{
  "link": "https://www.rottentomatoes.com/tv/riverdale  ",
  "title": "Riverdale",
  "resume": "Drama based on characters from the Archie comic-books series is set in Riverdale, where aspiring musician Archie deals with life, love and high school.",
  "rate": "87",
  "genre": "Drama",
  "cast": {
    "actor": [
      "KJ Apa",
      "Camila Mendes",
      "Lili Reinhart",
      "Sarah Habel",
      "Cole Sprouse",
      "Mädchen Amick"
    ],
    "character": [
      "Archie Andrews",
      "Veronica Lodge",
      "Betty Cooper",
      "Ms. Grundy",
      "Jughead Jones",
      "Alice Cooper"
    ]
  },
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It! Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact (2017 - ) Riverdale (2017 - ) | 87 % 90 % 77% liked it Critic Consensus: Series Info Creator: Roberto Aguirre-Sacasa Starring: KJ Apa , Camila Mendes , Lili Reinhart Riverdale Videos Riverdale Photos Seasons Riverdale: Season 2 Critics Consensus: Riverdale enters its sophomore year with an off-kilter new murder mystery while continuing to up the hormonal teen melodrama. Riverdale: Season 1 Critics Consensus: Riverdale offers an amusingly self-aware reimagining of its classic source material that proves eerie, odd, daring, and above all addictive. Cast as Archie Andrews as Veronica Lodge as Betty Cooper as Ms. Grundy as Jughead Jones as Alice Cooper as Cheryl Blossom as Fred Andrews as Josie Mccoy as Reggie Mantle as Hermione Lodge as Kevin Keller as FP Jones as Chic as Polly as Mary as Penelope as Toni as Valerie as Hiram as Mayor McCoy as Penny Peabody as Himself as Ethel as Pop Tate as Sheriff Minetta) as Agent Adams as Sheriff Keller Series Details TV Network: CBC Premiere Date: Jan 26, 2017 Genre: Drama Greg Berlanti , Sarah Schechter , Jon Goldwater Full Cast Related News & Interviews Trailers & Clips Pictures News & Interviews for Riverdale 2018 TV Premiere Dates Calendar 2018 TV Finale Dates Calendar Renewed and Canceled TV Shows 2018 5 of the Best Comic Book Dads on TV Right Now — and 2 of the Worst Flash-Forward to Fall 2018 Comic Book Television Fall TV First Look: New and Notable Titles Coming to Screens Soon The Best and Worst Comic Book TV Mothers Riverdale Team Spills on Carrie -Themed Musical Episode and Sabrina Spin-Off 2018’s Most Anticipated Comic-Tied TV and Streaming Series 5 of the Best Comics–on–TV Moments in 2017 Staff Picks: 13 TV Shows From 2017 You Should Binge-Watch Right Now 5 Riverdale Characters Who Still Look Good for the Black Hood 2017 Fall TV Premiere Dates Renewed and Canceled TV Shows 2017 Could Riverdale Revisit Archie Comics’ Superhero Past? View All Riverdale News Discussion Forum Discuss Riverdale on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}