{
  "link": "https://www.rottentomatoes.com/tv/empire\n",
  "title": "Empire",
  "resume": "A music mogul plans for the future of his empire as his three sons and his ex-wife battle each other to become the next heir apparent to the hip-hop throne.",
  "rate": "85",
  "genre": "Drama",
  "cast": {
    "actor": [
      "Terrence Howard",
      "Taraji P. Henson",
      "Malik Yoba",
      "Jussie Smollett",
      "Bryshere Y. Gray",
      "Trai Byers"
    ],
    "character": [
      "Lucious Lyon",
      "Cookie Lyon",
      "Vernon Turner",
      "Jamal Lyon",
      "Hakeem Lyon",
      "Andre Lyon"
    ]
  },
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact (2015 - ) Empire (2015 - ) | 85 % 85 % 77% liked it Critic Consensus: Series Info Creators: Danny Strong , Lee Daniels Starring: Terrence Howard , Taraji P. Henson , Malik Yoba Empire Videos Empire Photos Seasons Empire: Season 4 Critics Consensus: Empire: Season 3 Critics Consensus: Empire: Season 2 Critics Consensus: Empire is not backing down on the soapy spectacle in its second season. Empire: Season 1 Critics Consensus: Empire elevates the nighttime soap with its top-notch cast, musical entertainment, and engrossing plots. Cast as Lucious Lyon as Cookie Lyon as Vernon Turner as Jamal Lyon as Hakeem Lyon as Andre Lyon as Anika Calhoun, Anika Gibbons as Tasha as Anika Calhoun as Rhonda Lyon as MIchael Sanchez as Becky as Porsha as Camilla as Tiana as Freda Gatz as Shine Johnson as Tariq Cousins as Renee as Angelo Dubois as Thirsty Rawlings as Chicken as Leah Walker as Nessa as Juanita as Diana DuBois as Laura as Derek Major as Drop as Eddie Barker as Nurse as Carol Hardaway as Philip as Leah Walker as Candace as Teenage Loretha as Giuliana Green as Mimi Whiteman as Tory Ash as Chyna as Zeah as Poundcake as Teenage Lucious as Laz Delgado as Pamela Rose as Chicken as Burleson as Edna as Blake as J Poppa as Leonard Bernstein as Marisol as Marcel as Malcom as Lucious's Assistant as Webb as Roxanne Ford as Ryan as Charlotte Frost as Carmen as Preacher as Steve Cho as Gram as Webb as Olivia as Jago as V as Tay-O as Skye Summers as Jamesion as Lana Hall as Bunkie as Reverend L.C. Price as Giselle as Morris as Valentina as Teen Carol as Teen Candace as Trap as Lonnie as Eddie Barker as Alex as Vaughn as Ron as Harper Scott as Billy Beretti as Xavier Rosen as Delphine as Angie as Elle Dallas as Maya as Tamara as Jackson Sterling as Tony \"Tricky\" Trichter as Celeste as Barry as Gino Falcone as Michelle White as Agent Hughes as Blake as Herself as April as Ralph Anderson as Dr. Simon Lambert as J Poppa as Frank Gathers as Officer Mcknight as Dr. Calhoun as Warden Athena Myers as Melissa Calhoun as Mercedes as Agent Harlow Carter as Pepper O'Leary as Himself as Haven Quinn as Himself as Carmen as Carlotta Brown as Himself as Kitty as Himself as Leah Walker as Himself as Angelo Dubois as Homeboy as Himself as Tyree as Himself as Tiffany as Himself as Guy as Himself as Kelly Patel as Carmel Dielman as Himself as Himself as Philip as Joyce as Tasha as Clem as Judith as Lola as Franco as Brooke as Ruth as Himself as Big Heavy as Himself as Little Dwight Walker as Jake Perlman as Herself as Max Perkins as Gus Rodriguez as Kelly Patel as Cabbie as Raquel Alvarez as Aston Taylor as Officer McAdams as Denise as Detective Mitchell as Sven as Homeboy as Helen Von Wyeth as Huey as Himself as Interviewer as Armando as Gus as Trig as Himself as Nurse as Zoe as Aston Taylor as Detective Lumley as Skip Shepherd as Tommy Churner as Doctor as Tony as Erika as Myra as Dr. Jamilla Johnson as Calvin Moore as Himself as Hot Delivery Man as Janelle Monae-Type as Judge Barnes as Jerry Springer as Stacee Run-Run as Judge Claremont as Jezzy as Jack as John Halloway as Lou as Sheri as Leonard Bernstein as Fatima as Gavin Foer as Gladys as Dr. Gloria Rothman as Young Tariq as Henry as Butler as Engineer as Boule Snob as Dr. Banks as Minion as Ezekiel Dubois as Beekman Poser as Jerome as ROYALE-T Series Details TV Network: FOX Premiere Date: Jan 7, 2015 Genre: Drama Brian Grazer , Danny Strong , Francie Calfo , Lee Daniels Full Cast Related News & Interviews Trailers & Clips Pictures News & Interviews for Empire 2018 TV Premiere Dates Calendar 2018 TV Finale Dates Calendar Renewed and Canceled TV Shows 2018 2018 NAACP Image Award Winners: Girls Trip Wins Outstanding Motion Picture 2017 Fall TV Premiere Dates Renewed and Canceled TV Shows 2017 2018 NAACP Image Award Nominations 2017 Fall TV Preview: Over 50 of the Latest Trailers and Teasers 2017 Spring/Summer TV Premiere Dates 2017 NAACP Image Awards: Hidden Figures , black-ish , Queen Sugar Win Top Awards People’s Choice 2017 Winners Announced TCA 2017: X-Men Series Plan to Fit in With the Movies, Prison Break Premiere Date, More 2017 NAACP Image Award Nominations Announced People’s Choice 2017: Vote Now for Your Favorite Movies, TV Shows and More Pro Tips and Wisdom Offered at the 2016 Women in Entertainment Summit View All Empire News Discussion Forum Discuss Empire on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}