{
  "link": "https://www.rottentomatoes.com/tv/the_americans\n",
  "title": "The Americans",
  "resume": "Two KGB spies pose as an American married couple living in 1980s Washington, D.C.",
  "rate": "96",
  "genre": "Drama",
  "cast": {
    "actor": [
      "Matthew Rhys",
      "Keri Russell",
      "Holly Taylor",
      "Keidrich Sellati",
      "Noah Emmerich",
      "Annet Mahendru"
    ],
    "character": [
      "Philip Jennings",
      "Elizabeth Jennings",
      "Paige Jennings",
      "Henry Jennings",
      "Stan Beeman",
      "Nina"
    ]
  },
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It! Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact (2013 - ) The Americans (2013 - ) | 96 % 96 % 93% liked it Critic Consensus: Series Info Creator: Joseph Weisberg Starring: Matthew Rhys , Keri Russell , Holly Taylor The Americans Videos The Americans Photos Seasons The Americans: Season 6 Critics Consensus: The Americans ' powerful final season pumps up the volume on an already intense show, concluding the complex series arc with epic familial conflict... and a high body count. The Americans: Season 5 Critics Consensus: The Americans brings long-simmering storylines to a boil while heightening the spy-thriller stakes and deepening the domestic drama -- all brought vividly to life by superb performances from its veteran cast. The Americans: Season 4 Critics Consensus: The Americans continues to deliver top-tier spy drama while sending its characters in directions that threaten to destroy their freedoms - and their lives. The Americans: Season 3 Critics Consensus: The Americans ' tautly drawn tension, dispensing thrills of a different ilk this season. The Americans: Season 2 Critics Consensus: The Americans retains all the suspense and action of season one while enhancing the level of excitement... and wigs. The Americans: Season 1 Critics Consensus: The Americans is a spy thriller of the highest order, with evocative period touches and strong chemistry between its leads. Cast as Philip Jennings as Elizabeth Jennings as Paige Jennings as Henry Jennings as Stan Beeman as Nina as Chris Amador as Sandra Beeman as Martha Hanson as Agent Frank Gaad as Arkady as Ben Canfield as Jeff Canfield as Oleg Nicholiavic as Tatiana as Fred Timbrook as Nikolai Timoshev as Leanne as Bruce Dameran as Colonel Zhukov as Gene Craft as Stavos as Mark Bartholomew as Deputy Attorney General Warren as Emmett as Pasty Bureaucrat as Helen Leavis as Lucia as Sanford Prince as Jared Connors as Colonel Rennhull as Derek as Roy Oatway as Dan Maphis Series Details TV Network: FX Premiere Date: Jan 30, 2013 Genre: Drama Joseph Weisberg , Graham Yost , Justin Falvey , Darryl Frank Full Cast Related News & Interviews Trailers & Clips Pictures News & Interviews for The Americans 2018 TV Premiere Dates Calendar 2018 TV Finale Dates Calendar Renewed and Canceled TV Shows 2018 Say Goodbye to These Groundbreaking Female Characters Leaving Your TV Screen 10 TV Shows You Should Binge-Watch This March Writers Guild: 2018 Film and Television Winners Announced DGA 2018 Film and Television Winners Announced DGA 2018 Film and Television Nominations Announced Writers Guild: 2018 Film and Television Nominations Announced Renewed and Canceled TV Shows 2017 2017 Spring/Summer TV Premiere Dates How Real-Life U.S.-Russia Relations Influence The Americans Season 5 7 TV Shows You Should Binge-Watch This March 2017 Writers Guild Awards Winners: Moonlight , Arrival , and Atlanta Come Out on Top People’s Choice 2017 Winners Announced View All The Americans News Discussion Forum Discuss The Americans on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}