{
  "link": "https://www.rottentomatoes.com/tv/criminal_minds\n",
  "title": "Criminal Minds",
  "resume": "The show is about the elite Behavioural Analysis Unit of the FBI which is the brain and brawn behind a majority of criminal investigations across the country. The diligent workforce work round the clock to unravel the psyche of a criminal and in this way contain further havoc.",
  "rate": "37",
  "genre": "Drama",
  "cast": {
    "actor": [
      "Joe Mantegna",
      "Mandy Patinkin",
      "Thomas Gibson",
      "Shemar Moore",
      "Matthew Gray Gubler",
      "Lola Glaudini"
    ],
    "character": [
      "David Rossi",
      "Jason Gideon",
      "Aaron 'Hotch' Hotchner",
      "Derek Morgan",
      "Dr. Spencer Reid",
      "Elle Greenway"
    ]
  },
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact (2005 - ) Criminal Minds (2005 - ) | Tomatometer Not Available... —— 37 % 88% liked it Critic Consensus: Series Info Creator: Jeff Davis Starring: Joe Mantegna , Mandy Patinkin , Thomas Gibson Criminal Minds Photos Seasons Criminal Minds: Season 13 No Tomatometer score yet... Criminal Minds: Season 12 No Tomatometer score yet... Criminal Minds: Season 11 No Tomatometer score yet... Criminal Minds: Season 10 No Tomatometer score yet... Criminal Minds: Season 9 No Tomatometer score yet... Criminal Minds: Season 8 No Tomatometer score yet... Criminal Minds: Season 7 No Tomatometer score yet... Criminal Minds: Season 6 No Tomatometer score yet... Criminal Minds: Season 5 No Tomatometer score yet... Criminal Minds: Season 4 No Tomatometer score yet... Criminal Minds: Season 3 No Tomatometer score yet... Criminal Minds: Season 2 No Tomatometer score yet... Criminal Minds: Season 1 Critics Consensus: Cast as David Rossi as Jason Gideon as Aaron 'Hotch' Hotchner as Derek Morgan as Dr. Spencer Reid as Elle Greenway as Jennifer 'J.J.' Jareau as Penelope Garcia as Emily Prentiss as Haley Hotchner as Erin Strauss as William LaMontagne Jr. as Kevin Lynch as Ashley Seaver as Kate Callahan as Alex Blake as Luke Alvez as Dr. Tara Lewis as Stephen Walker as Matt Simmons as Amy Cole as Jack Hotchner as Savannah as Anderson as Greg Winters as Jordan Todd as Henry as Mateo Cruz as Peter Lewis as Beth as Meg Callahan as Diana Reid as Agent Sharp as Assistant Director Linda Barnes as Richard Slessman as Jessica Brooks as Dr. Weiss as Ian Doyle as George Foyet as Tsia Mosely as Ellie Spicer as Kristy Simmons as Joy Struthers as Rebecca Bryant as Clarence as Markayla Davis as Rafael Taveras as Clyde Easter as Smitty as Guard Lionel Wilkins as Fiona Duncan as Young Rossi as Agent Natalie Colfax as Wallace Hines as Frank as Harrison Scott as Tamara Barnes as Tobias Hankel as Lieutenant Rakesha Wilson as US Marshall as Hayden Montgomery as Julia Taveras as Antonia Slade as Giuseppe Montolo as Owen McGregor as Jane as Kate Joyner as Desmond Holt as Kevin Decker as Mitchell McCord/UnSub as Mark Henshaw as Gabriel Merza as Elena Duran as Sgt. Lynne Johnson as Chris Callahan as Carla Hines as Billy Flynn as Detective Kurzbard as ND Agent as Monica Walker as Det. Farraday as Yvonne Burns as Olivia Taveras as Kevin Peck as Stunt Double Simmons as Preacher Mills as Det. Brunstin as Cherry Rollins as Chad Higgins as Gabriel Lewis as Kimberly Desmond as Beth Osborne as Lindsey Vaughn as Unsub as Unsub Sheppard as Concerned Mom as Amy Cole as Scott Taveras as Tony Axelrod as Det. Walker as Bruce Proctor as Det. Owen Kim as Adam Fuchs as Cramer as Janet Desmond as Adele McCord as Tia Canning as James Odenkirk as Leonard Hagland as Clayton Osborne as Sheriff Coleman as Man as Paramedic One as Albert Lewis as Fence as Carolyn as Thomas Scott as Andrew Hirota as Krisitin as Dr. Bayo as Dr. Pat Lewis as Tommy as Judge Willa Frost as Clyde Easter as Abigail Fuller as Tim Vogel as Brenda Samms as Trish/Cheryl Davenport as Lisa Bartelby as Alison Shines as Colette Wilson as Betty as Roland Cole/Josh Martin as Capt. Ferreri as Liz Leonte as Adrian Scott as Tyra as Deputy Marty Bennett as Punk as Malcolm as Manny Martinez as May Scott as James Colby Baylor as Bobby Putnam as Passerby as Assistant Mia Prado as Sandy Jareau as Liam as Cenisa Royce as Captain Martin Savalas as Medical Examiner as Stunt Double Martin as Jesse Wilson as Deputy Vicky Lorenzana as Bill Shines as Theo Goss as Agent Douglas Rudy as Male Nurse as Bill Thompson as Stunt Coordinator/Utility as Douglas Carmichael as Vernon Duncanson as William Reid as Shelly as Newsanchor Kent as Guard as M.E. as Capt. Warner as Man in Black as Frazier as Det. Cooper as Jenny as Ben as Max Ryan as Sheriff Jeff Sanders as Sheriff Jeff Sanders as Walter Turner as Don Sanderson as Sydney Manning as Steve as Blake Wells as Annie Stewart as Coach Bunting as Michael Clark Thompson as Franklin Graney as Vincent Perotta as Cherish Hanson as Lila Archer as Mark Gregory as Kaman as Rhett as Dina as Shelley Chamberlain as Evan Davenport as Randall Gardner as Mr. Mullens as Grady Beeks as Dr. Hannah Cooke as Lori Johnson as Cheryl Grant as Jasper Talbot as Dinah Stidham as M.E. Clare Kaufman as Ned Hogan as Hannah Shines as Becca Miles as Young Scott as Dr. Stacey Carroll as Security Guard as Dr. Taylor as Young Tara as Matthew Downs as Gianna Schrader as Dalton McCann as Chairperson Pam Chapman as John Decker as Lisa Douglas as Anita Aldo as Cop as Cassie Campbell as Randall Harris as Police Officer as Bartender #2 as Trauma Surgeon as Rosa Medina as Paige Bonner as Paige as Heather Clarke as Anne Baldwin as Young Gabriel as Cybercrimes Unit Chief Gary Omri as Commander David Nash as Connie Linn as Bryce McCord as Larry as Ray Donavan as Linda as Molly as Jill Morris as Angela Procter as Bill as Benjamin Cyrus as Hamilton Bartholomew as Prof. Rothschild as Lester Turner as William Taylor as Prof. Marsha Grant as James O'Neill as Brenda Wipley as Emma Kerrigan as Josh Moore as Barry Flynn as Stuart Baker as Todd Burton as Bryan Hughes as Rodney Harris as Det. Anne Hudson as Tess Mynock as Phillip Connor as Vincent Shyer as Allison Crawford as Cory Bridges as Agent Tanya Mays as Tanner as Nancy Campbell as Frank Clemensen as Brooke Chambers as Detective Spicer as Candice DeLilly as Marvin Caul as Kelly as Anna as Dr. Stan Howard as Steven Parkett as Hayman Vasher as Leo Jenkins as Sammy Sparks as Floyd Feylinn Ferell as Molly as Ellen Connell as Tivon Askari as Luke Dolan as Tony as Steven as Sam as Tony as Michael as Jeff Collins as William Cochran as Mrs. Gless as Megan Kane as Randy Jacobs as Andrew Meeks as Adam Jackson as Claire Whitewood as Dan Murphy as Dr. Linda Kimura as William Hightower as Chief Jim Cooper as Shanice Stone as Tory Chapman as Dale Shrader as Joe Reese as Capt. Griffith as Unsub as Deputy Boyd as Scott Miller as Unsub as Daria Samsen as Ambassador Elizabeth Prentiss as Johnny as Steven as Joseph Lanham as Professor Walker as Tom as Greg as Benton Farland as Pam Baleman as Sheriff Britt Hallum as Brian Matloff as Congressman Benjamin Troy as Sheriff Merrill Dobson as Herself as Danny Lee Watson as J.B. Allen as Matt Franks as Cindi as Helen Garrett as Robert Boles as Father Paul Silvano as Violet/Amelia Hawthorne as Tony Anders as Adam Rain as Bruce Morrison as Carol as Miranda White as Charlie Stuart as Leland as Katherine Cole as Kate Hoffer as Nancy Riverton as Dennis Cutler as Michael as Cissy Howard as Bill Harding as Francis Goehring as Matt as John McHale/Night as Reporter as Young Gideon as Keri Derzmond as Nelson as Chase as Ian Corbin as Trevor Mills as Mitchell Crossford as Dana Seavers as Detective Gassner as Zoe Hawkes as Hank Morgan as Van as Vincent as Diane as Heather Vanderwaal as P.K. Davies (aka Dante) as Freddy Candore as Sylvia Gooden as Meg Collins as Parker Dunley as Raymond McCarthy as Sarah Hillridge as Malcolm Taffert as Maggie Callahan as Tech Jennings as John Nichols as Det. John Fordham as David Wade Cunningham as Tony Torell as Aubrey Jacobs as LAPD Cop as Nurse as M.E. Cranston as Young Morgan as Leonard Ennis as Officer Bachner as Izzy Rogers as Chris Stratton as Samuel as Victim #2 as Terrell Campbell as Lia Wyler as Dr. Sherman as Morgan's Dad as Young Kevin as Cop #1 as Buffet Manager as Surgeon No. 2 as The Cleaner as Larry as Undercover Cop as Dr. Wilson as Professor as Mental Health Nurse as Parole Commissioner as Carly as Mulder Lookalike as Brad Norton/Jogger as Dr. Marvin Saul as Lilian Forsythe as Justin Leu as Bernice as Bobby Kim as Katrina Townsley as Connie Galen as Owen Savage as Bob Adams as George Kelling as Ryan Scott as SWAT Officer as Monica as Jack Garrett as Dr. Judith Mertz as Angel as Vanessa Hill as Ellen Clark as William Harris as Malcolm Ford as Tom Larson as David Zimmerman as Cat Adams as John Myers as Gina Bryant as Chazz Montolo as Cathy as Chad Mills as Claude Barlow as Sheriff Mitchell as Dr. Barton as Darrin Call as Deeley Henson as Michelle Bradley as Mark Tolson as Brendon as Gil Clurman as Sheriff Hall as Roger as William Lynch as Claire Henderson as Det. Barton as Damon Miller as Melissa Miller as Trish Gaines as Ellen Samsen as Susan Harrison as Det. Jim Griffith as Special Agent Owen Quinn as Det. Yarbough as Sheriff Williams as Dr. Lorenz as William Pratt as Robert Bremmer as Kyle as Brenda Archer as Sophie Troy as Chloe Kelcher as Roy Brooks as Ryan Becker as Vanessa as William Duke Mason as James Heathridge as Dylan Kohler as Lance Coleman as Jacob Dufour as Michelle as Flora Martin as Kyle Wipley as Ray Colson as John Nelson as Patrick Sorenson as Gil Bonner as Brian Phillips as Lee Whitworth as Evan Davis as Trooper Jim Carson as Kyle Ecklund as Sera Morrison as Det. Andrews as Mark Jackson as Sheriff Bob Collier as Edwin as Karl Arnold/The Fox as Det. Tom Landry as Alan Crawford as Jimmy Baker as Adam Boyd as Agent Goldman as Sgt. Suzanne Kuroda as Doug Gregory as Ben Davis as Sgt. Joe Mahaffey as Peter as Lida Taffert as Phil Brooks as Jeffrey Whitfield as Brenda Bright as Sam Russell as Clifford Walsh as Jess Carney/Unsub as Himself as May as Bill Calvert as Frank Cowles as Susan Jacobs as Charlie Hosswell as Doug Adams as Charlie Sparks as Yolanda as Larry as Det. Bryce Harding as Andrew Ford as SSA Norwood as Rebecca Farland as Colton Gran as Officer Keith Rivers as Tawes as Jimmy as Larry Merrin as Vanessa Campbell as Kevin Liman as John Holden as Claire Bates as Donald Collins as Vanessa as Cdr. Marks as Sheriff Paul Desario as Amy Gibb as Ellen Daniels as Ray Colson as Toby Whitewood as Det. Lynne Henderson as Bea as Erika Silverman as Philip Bromwell as Colin Bramwell as John Malone as Hannah Johnson as Truck Driver as Sam Cooper as Jose as William Lee as Unsub as Kelly Seymour as Det. Mathias as Det. David Crowley as Gloria Wilson as Paul as Cheryl Kaline as Old Nate as Brenda as Hayden as Bates as Jane as Danny as Ronnie Baleman as Jenna Dolan as Boy/Young Chase as Nancy Lunde as Floyd Hansen as Curtis Banks as Clark Preston as Kaylee Robinson as Dad as Det. Fulwood as Bryan Davis as Matthew Benton as Derek at 10 as Sheriff Olivia Colwin as Michael Lee Peterson as Det. Reese Evans as Joseph Berzon as Chad Mills as Sarah Murphy as Matt Moore as Roberto Morales as Gloria Baker as Madison Riley as Donnie Bidwell as Anthony Rango as Clara Seger as Bunting as Dr. Malcolm as Marcia Gordon as John Curtis as Chris Crawford as Mrs. Krouse as Sheriff Hall as Paul Collins as Wayne Gulino as Mary Clemensen as Tina Johnson as Henry as Sue Walsh as Finn Bailey as Paul as Lt. Al Garner as Lysowsky as Chris as Malachi Lee as Shane Wyland as Drew Jacobs as Candace as Joe Smith as Caleb Sands as Dr. Norman as Workman as Greg Everson as Guard Butler as Scully Lookalike as Younger Jesse Wilson as David Simmons as Tracy Belle as Maxine Reynolds as Priest #2 as EIS Officer Sara Freeman as Jake Simmons as Pretty Co-Ed as Husband as Ian Watt as Dog Owner as Manny as Det. Sachs as John David Bidwell as Boardmember No. 1 as Kate Phinney as Charlie Wilkinson as Andre Hutchins as Chloe Donaghy as Gen. Boyd Milgram as Jordan Norris as Allen Archer as Agent Darryl Young as Hilary Ross as Ashley Holden as Linda Collins as Captain Beau Hallendale as Chief Raul Montoya as Lt. Evans as Chief Palmer as Lara Heathridge as Barry Winslow as Det. Connie Lawlor as Andrew Kane as Young Man as Sgt. Michael O'Mara as Sarah Mapes as Motel Clerk as Floressa as Joe Donovan as Colin Maynard as Detective Lennon Miles as Amanda Bergstrom as Paul Westin as Vincent as Josh Harmon as Peter Harper as Clark as Maria Ortiz as Gina as Johnny Ray Covey as Eddie as Joe Muller as Pete Abadilla as Ryan Krouse as Det. Baez as Rebecca as David Stuart as Sophia Collins as Jenna Alban as Sam Bower as Lynn Clemons as Mick Rawson as Laura as Desi Gutierrez/UnSub as Ronald James Underwood as Chief Steve Gaines as Vincent Stiles as Justin Franco as Josh Kramer as Chief Karen Carlson as Store Owner as Beth Jacobs as Michelle as Jack Fahey as Tony as Neighbor as Vickie as Chief Thiers as Unsub as Carl Mason as Dinah Troy as Young Hope as Shara Carlino as Jessica Evanson as Armando Salinas as Agent Carol Goslin as Billy Henderson as Sarah Morgan as Riley Desario as Adrea Harris as Lance as Jill Simmons as Dana as Darlene Beckett as Arthur Rykov as Sheila Woods as Derek at 15 as Dr. Kiyomura as Det. Rawlings as Shannon as Earl as Jerome as Zeke as Bryce Jarvis as Miranda as Renee as Sean Hotchner as Det. Cotrone as Guard Tidwell as Eric Miller as Michael Russo as Anton Harris as Katie Hammond as Virginia Davis as Anita as Pilot as Amanda Gilroy as Edith Lynch as FBI Professor as FBI Professor as Matthew as Shane Wyeth as Sheriff Mike Bowman as Carl as Wanda Robbins as Alan Anderson as Jeff Joyce as Cesar Jones as Dr. Fullerson as Miles Lee as Brad as Steven Gourse as Gary as Biker as Henry Frost as Claire Dunbar as Det. Dawn Rosenberg as Georgie Galen as Donnie Mallick as Principal Givens as Det. Woods as Eve Alexander as Warden Miles Tate as Nick as Patrick Jon Murphy as Marc Clifford as Abby Corbin as Det. Hyde as Norman Hill as Sam Burnett as Mom as Patricia Brannon as Danielle Steinhardt as Danny Murphy as Kate as Roy Webster as Chad Brown as Det. Sam Ogilvie as Katie Morrison as Paul Westin as Molly Patton as Chad Dumont as Ashley Fouladi as Sylvia Hoover as Charles Johnson as Richard Clayvin as Juliet as Alicia Jordan as Sandra Madsen as Shane Wyeth as Austin Chapman as Polly Homefeldt as Himself as Jeremy as Kevon Winters as Christy White as Sgt Mack as Sammy as Det. Manny Ruiz as Vicki as Lt. Ted Banks as SWAT Captain as Lyle as Jumilla Reardon as Alison Sparks as Albert Stillman as Chad Griffith as Rose as Andy Farland as Lamott as Frank Cosgrove as Beth Smoler as Peter Folkmore as Det. Jarvis as Travis James as Ron Massey as Lily Lambert as Diana Mitchell as Daniel Karras as Milena Valdez as Det. Ashby as Det. Jon Childers as Agent Debbie Webster as Brian Cochran as John Tilghman as Chloe Andrews as Carl Timmons as Sgt. Natalie Whitfield as Cara Barrett as Amanda Lopez as Amanda as Cheryl Morrissey as Mr. James as Chief Arthur Emmett as Francesca Morales as Jeffrey Barton as Lt. Kevin Mitchell as Leanne Tipton as Rosalie Escobar as Veronica Hanson as Trey Gordon as Maya Carcani as Gerald Dupree as Katie Hammond as Herbert Sykes as Man as Keith Graves as Lila May as Gabby Hoffer as Maryann Thomas as Russell Holmes as Joe Bachner as Scott as Cal McGee as Brandon as Constable Caesar as Bartender as Dr. Weingold as Steven Onishi as Chad Stiller as Lily Simmons as Wife as David Logan as Cora Bradshaw as Anesthesiologist as Craig Sanders as Simon as Lucille as Carlos Garcia as Vihaan Patel as Erol Altan as Chloe Simmons as Director as Jim Carlson as Connor Holt as Josie Behdart as Rod Norris as Det. Steve Berry as Daniel/Father as Lt. Beasley as TV News Reporter as Regina Lampert as Ruben Garcia as Patricia Valdez as James as Judy Hannity as Sharon Harris as Rod Garrett as The Kid as Sandra Lombardini as Agent William Waters as Ellen Russel as John Cooley as John Bradley as Terry Rodgers as Det. McLeary as Det. Sam Oglivie as Stanley Wolcott as Border Agent #1 as Zach Peterson as Det. David Rizzo as Lt. Brantley as Raoul as Mario Casteneda as Marta Calderon as Frank Fielding as Trish Leake as Eddie Lee Wilcox as Det. Portillo as Lyle Johnson as Rebecca as Doug Downey as Willie as Judith Anderson as Dana Gaines as Scott Hartway as Detective Shannon Morris as Wayne Campbell as Apartment Super as Ervin as School Teacher as Max Pool as Frank Canvers as Dr. Boyd as Det. Ravi Shah as Alicia Galen as Peter Redding as Det. Tina Lopez as Capt. Dale Shavers as Stacey Murphy as Sela Dobson as Pam as Eddie Bee as Playboy as Stuart Wallace as Bahni Desai as Bernard Graff as Andrea Gambrell as Chemist as A.G. Patrick Jackson as Dr. Givens as Reporter No. 1 as Mrs. Roberts as Doris as Mary Donovan as Patrick Meyers as Det. Marty Friedman as Judge Schuller as Doug Warn as Turner as Conrad Winmar as Tara as Jenny Shrader as Elizabeth Garrett as Danny White as Bob Joplin as Nancy Summers as Father Kendellen as Linda Grunwell as Jody Clemons as Prophet as Julie Hoover as Helen Pierce as Norma Renmar as Marcus Younger as Chief Thomas Wheeler as Kendra Sayer as Coby Peters as Sergei as Stephanie as Det. Croft as Debbie Martin as Victor Cabrera as Theo Holston as Det. Bailey as Lex Dreyer as Guard as Karen Haywood as Jennifer as Julie as Michael Connell as Louise Jones as Campbell as Betty Wright as Chief Cole as Greta Thomas as Kathy Evanson as Sheriff Bruner as Craig Bridges as Hunter as Trisha Lewis as Tracy Senarak as Himself as Rebecca as Brooks Tanner as Danny Desario as Karen Coleman as Devin as Det. Oren Carr as Jesse as Nurse West as Julie as Coakley as Dr. Nichols as Mr. Conrad as Lynelle Barker as Kelly Miller as Young Call as P.K. Riggins as Billy as Sam Wakefield as Viv as Joan Grayson as Brent Miller as Mark Anderson as Sam Carter as Sheriff Scott Paseo as Lisa Bower as Agent Wallace as Owen Porter as Larry Robbins as Deputy Rick Siglock as Liz Foley as Doctor as Kierston Torell as Sheriff Schaeffer as Aliza as FBI Instructor as Sarah Sands as Mark as James Franklin as Harris Townsend as Marjorie as Det. Sandra Carpenter as Det. Brady as Movie Buff #1 as Brian Stiller as Stu as Jon Kanak as Lachlan McDermott as Brian Long as Chef as Bobby Smith as Cece as Paul Troy as Josh Redding as Christine McNeil as Al Eisenmund as Matt Nelson as Catherine Heathridge as Female Reporter as Mitch Gregory as Tom Shaunessy as Ellie Zumwalt as Nat Daniels as Bart Shulman as Officer Chet Dewey as Patricia Olwyler as Det. Paul Boseman as Sheffield as Laura Downey as Tara Rios as Det. Morrison as Dr. Marion Rillo as Samantha Malcolm as Sheriff Bridges as Unsub as Hal Clayton as Barbara Lynch as Scotty Delfino as Sheriff Ruiz as Dr. Eldon Mercer as Lara Gutierrez as Harold Ramsey as Tech as Chief Jones as Kal Montgomery as Bob Cooper as Det. Solana Ramirez as UnSub as Craig Kaline as Maggie as Linda Walker as James Stanworth as Annie Beneville as Guard as Curtis Wyler as Robber as Victim #3 as Nathan Butler as Phillip Sullivan as Passerby as Younger Carlos Garcia as Adam Jefferies as Stacy Uqalla as Angie Stanton as Raymond Leu as Enid as Galen Petosky as Robert Miller as Medic No. 2 as Gus as Sheriff Montell as Renee as Driver as Ms. McKee as Officer Tom Polinsky as Russ Montgomery as Sgt. Carlson as Bobby Jones as Bill Kinderman as Det. Spreewell as Teri as Betty Wilson as Jolene Senarak as Oscar Acosta as Mike as Randy Nelson as Detective Palmer as Eric Olson as Janet Foster as 12-year-old Gina as Det. Gonzalez as Mark as Dr. Ticona Roberts as Reporter No. 2 as Jimmy Bennett as Michelle as Connie Foster as Jason as Dawn Durboraw as Border Agent #2 as Sheriff Wilson as Chip Gordon as Det. Gil Hardesty as Dr. Balboa as Jane Winmar as Larabee as Stan Gordinski as Jill Flanagan as Wilson Summers as Gigi Stevens as Harry Greenberg as Liz Hammond as Curt as Prospector as Yvonne Carpenter as Helen as The Doctor as Marla Golden as Tina Gutierrez as Lindsey Krukowski as James Charles as Debbie Bloom as Newsanchor Laura as Georgia Davis as Cashier as Sandra Bennett as Lt. Ricardo Vega as Gregory Wilson as Ranger Lizzie Evans as Krystall Richards as Capt. Wright as Capt. Wright as Det. Wolynski as Jimmy Mercado as Jeremy as Joshua Parker as Gus as Amber Lasko as Michael Ballantyne as Declan as Peter Goodwin as Deputy Lou Savage as Doctor as Phinny as Will Redding as Agent Parker as Det. Garrity as Officer Ron Mercer as Det. Salinas as Cate Hale as Kevin Jenson as Dr. Ivan Smith as Medical Examiner as Geena Deaver as Josie Zumwalt as Teen Girl as Angie Katz as Sean Parker as Asher Douglas as Renee Morales as Mitchell Ruiz as Bones Jarvis as Record Executive as Mayor Lindsey Winters as Chief Bailor as Amber Moxley as James Blake as Adrian Bale as JD as Adam Dawson as Dr. Hoshino as Dmitri Sobchek as Warden Harding as Tiffany as Cheryl Cosgrove as Laurie Patterson as Gary Hiles as Trevor Gaines as Patty Joyce as Daughter as Ray Murphy as Lyov as Raymond Martin as Michael Walker as William Heller as Lt. Nellis as Chief Barrows as Dr. William Suri as Bartender as Chris Jensen as Oren Farland as Gary Rhymer as Det. Pete Chalmers as Eldery Woman as Layla as Marlene Smith as Mike Hicks as Fran Meredith as Madison Young as Matt Lewis as Kelly Goodwin as Emma Nelson as Det. Linden as Paddy Morris as Agent Matt Lopez as Stanley Usher as Bianca as Sgt. Carol Gridley as Nurse as Young Hank Morgan as Dr. Rosa Escobedo as Det. Quinn as Carla Jean Birch as Otis as Howard Walker as Dr. Lawrence Becker as Dr. Zwerling as Gina Mendes as Officer Cabrera as Colton Davis as Corin Todd as Frank Lynch as Gina LaSalle as Debbie Bloom as Judy Homefeldt as Clerk as Kathleen Benedict as Romeo the Magician as Walter Trudeau as Dr. Weinstein as Teen Cissy as Kiara's Mom as Kiara's Mom as Sgt. Burnell as Donna Holston as Clerk as Daniel Osbourne as Gibbs as Jack Westbrook as Sky Connell as Dwayne as Merriman as Curtis Fackler as Stephen Gideon as Det. Davenport as Connie Murphy as Dean Miller as Delilah Grennan as Chris Cole as Ryan as Herman Scobie as Joann Nelson as Amy Bridges as Katherine Wallace as Female Witness as Daniel Adams as Mrs. Yvonne Ashford as Det. Angela Pratt as Det. Angela Pratt as Debra Acklin as Mary Lenahan as Nurse Marconi as Otis as Man as Pharmacist as Baker as Nicole Francis as Bina Sukarto as Kay as Ronny Downey as Connie Shrader as Jonathan Rhodes as Bethany Wallace as Bob Clarke as Parishoner as Samantha Wilcox as Dan Ash as Leah Rollins as Wanda as Mike Bishop as Det. Murad as Police Dispatcher One as Mary Ann as Sheriff Clifford as Larry Simmons as Kathy Hartway as Carrie as Sarah as Sarah as Shirley Hamilton as Concierge as Ray Hamilton as Jessica Mayhew as Howard's Mother as Elian as Dr. Lee as Mr. Connoley as Shelley Hicks as Trailer Park Manager as Tara Harris as Linda Westbrook as Marcus Talbot as Marcus Talbot as Sparring Partner as Laurie Ann Morris as Dr. Bruce Borrego as Melissa Murphy as Tom as Tiff Redding as Jerry Tidwell as Dr. Raj Surna as Harold Sanders as Medical Examiner as Capt. Phil Wilson as Lou Jenkins as Sgt. Manny Rodriguez as Kyle Lincoln as Manager as Sloan as Kevin Gaylen as Det. Brady as Dr. Janine Ainsworth as Mike Acklin as Brian Lenahan as Evan Harvey as Hollie Riggio as Madison Cooke as Lindsay Leeman as Capt. Lancaster as Woman as Local Reporter as John Butler as Kevin Hilliard as Paul Downey as Dan Otey as Jean Clarke as Layperson #1 as Tommy Burns as Elizabeth Padilla as Alex McLean as Kevin as Omar as Cheryl Bishop as Daniel Milworth as Chief Gary Foles as Police Dispatcher Two as Ethan as Casey Peters as Annette Simmons as Willie Blaine as Officer Kowalski as Chris as Melissa as Tim Harrison as Leopold as Frank Brooks as Harvey Brinkman as Claire as Jerry Holston as Donnie as Det. Colbern as Jeff as Max Connell as James Rhymer as Chester Hardwick as Martha Slade as James Burke as Shannon as Hannah as Lacey as Damon Weeks as State Cop as Tabitha Merrin as Eddie \"Sweetness\" Parrish as Alex Zorgen as Cashier as Charlie Senarak as Madison Mills as Doug Fuller as Abby as Stephen Baleman as Little Boy as Arthur Gibb as Theatre Attendant as Adam Morrissey as Earl Roy Everton as Dr. Frank Chapman as Kim Conti as Jeff Bedwell as Shannon Lavin as Medical Examiner as Megan as Agent Stern as Melody Payton as Det. Kaminski as Cell Mate as Anna Johnson as Mike Hood as Bob Hammond as Ben Harrison as ER Doctor as Security Guard Jiminez as Nancy Jones as Sheriff Yates as Newsanchor Pat as Alphonse Keppler as Penny as Asian Diner as Det. Jordan as Desmond as John Caulfield as Older Man as Man (John) as Lidia as Young Heather as Vince as Vince as 911 Operator as Student One as Unsub as Nadine Acosta as Adam Nelson as Britney Hill as Warden Hansen as 8-year-old Gina as Morgan Kid #1 as Luke Zumwalt as Kai Struthers as Carl as Capt. Grant Howard as Byron Sadler as Matt Doherty as Medical Examiner as Paige Munson as Cho as Melanie Burke as Kevin Hilliard as Maxine Wynan as Mike Hardy as Lorraine as Dana as Barry as Kevin Cho as John Fords as Sam as Bev Spera as FBI Instructor as Gavin Rossler as Lisa Blake as Charles Gates as Sheriff Rhodes as Emma as Brad as Rosemary Jackson as Asst. Police Chief Jimmy Mackenzie as Mark Davis as Kate Joyce as Dennis as Jenny Kyle as Amy as Tom Wittman as Michael Uqalla as Sean McAllister as Katie as Anisa Gold as Officer Bowie as Lisa Randall as Brian as Sparks as State Trooper as Max as Jamie as Carlos as Dr. Renee Turner as Ezra Warren as Bill Campbell as Elaine Kraus as Lynn Brooks as Matt Miller as Aasia Desai as Det. Bates as Agent Adrienne Mitchell as Det. Duran as Lauren as John Westchester as Andrea Benton as Donna Sullivan as Louise Hulland as Billy Walton as Officer Feder as Melinda as Cormac Burton as Dr. Francie Kendall as Young Deeley Henson as Scott as Officer Rodriguez as Germ as Ray Campion as Angela Mastriano as Mary Hammond as Alyssa Miles as Neela Travers as Mrs. Leake as M.E. Wong as Mike Hardy as Agent Malcolm Hollins as Aimee Lynch as Beth Griffith as Bob Orci as Sita Patel as Agent Eli West as Olsen as Jake Bennett as Carl Kevork as Det. Leah Castro as Fyodor as Meredith Joy as Appalachian Woman as Dr. Edward Calder as Charles Holcombe as Carlos Ortega as Senator Alfred Mayhew as Agent Sean Dougherty as Marie Samuels as News Reporter as Diane Goehring as Dr. Rasgotra as Don Chamberlain as Milo as Det. Greg Lefroy as Male Hiker as Connie as Mr. Corbett as Coroner as Carter Campbell as Dr. Joanne Carlton as Desk Cop as Lizette Castro as Jimmy as Jimmy Valdez as Student Two as Karl Ulrich as Det. Rachel Harding as Lisa as Harold McDermott as Brooke Lombardini as Morgan Kid #2 as Gary as Lexy Kerrigan as Isaac Henry as Warden Bryan Nabb as Paul Makely as Daniel Cullen as John David Bates as Abby as Curtis Burton as Eric Bakken as Jody Wilson as Lani Sukarto as Pharmacist as Maddison Mastriano as Dr. Harriet Jones as Mark Keeling as Capt. Gail Stoll as Cindy Amundson as Truck Driver as Robert Greenaway as Parker Mills as Doctor as Colin Kirkland as Maeve Donovan as Joey Davin as Agent Lawrence as Coyote #1 as Parole Officer as Don Norvell as Craig Ramey as Allison Kittredge as Gloria Holden as Det. Stansfield as Syd Pearson as Lacy Jaime as Sarah Renfield as Doctor Aristeo Caruso as Paramedic #1 as Dr. Albert Miles as Robert Brooks as Corey Cowles as Shane Quinn as Nathan Chow as Bill as Paul Jones as Capt. Dan Martin as Adam Lewis as Bull as Deputy Bart Lawford as Reporter as Jenna as Charlotte Jacobsen as ESU One as Greg Sullivan as Dan Torre as Jimmy Kinderman as Chief Wilson as Det. Mike Warner as Minister as Erika Taylor as Samantha as Dr. Reuben Jenkins as Trevor Farson as Karla Demshure as Jim Scheueren as Sarah Miles as Trudy Yates as Hoyt Ashford as Tom Benton as Maria Rodriguez as Amanda Bell as Jay as Elaine Porter as Young John Henry Henson as Capt. Marcus Jackson as Marissa as Christopher Summers as Younger Danny as Brooke as Driver as Layperson #2 as Bell as Greg as Agent Green as Jeffrey as Tom Dunleivy as Captain Rogers as Detective One as Benjie Ruiz as Frank Morris as Suzanne Cole as David Smith as Julio as David Marshak as Ron Cosenza as Laurie Burgin as Leon as Adam Werner as Jonathan Morris as Gary as Teen Hope as Betty as Receptionist as Markus Ivey as Alice Pritchard as Linda Calvary as Tyler Parker as James Dolan as Susan Groves as Lyla Brewer as David Roy Turner as Monica DeJesus as Hugh Rollins as Addyson Jones as Orel Wilbur as Det. Martin as Ray Finnegan as Jeff Godwin as Carl Buford as Claire Vendi as Wanda Sullivan as Amalia Banks as Voluptuous Woman as Shane Payton as Molly Muller as Thane Parks as Carla Marshall as Melody Grimes as Joey Fletcher as News Anchor as Officer Ryan Clayburn as Nora as Dr. Liz Montoya as Natalie Corbis as M.E. Leslie Jackson as Timothy Kane as Newsanchor Paul as Holly Franklin as Rodney as Beth Hartway as Dr. Claude Pinault as Natalya Chernus as Tara Dice as Vicky Wilson as Mary Rutka as Jake Owns as Young Howard as Store Clerk as Nathan Chow as Ortiz Mother as Uniform as Sheriff Oliver as ND Agent as Dr. Fulton as Lillian as Riley Summers as Tara as Linda Owens as Sarah as Shawn Overholt as Cowboy Hat Guy as Jordan Aguilar as Lauren White as Sam Pritchett as Det. Daniels as Francesca as Theo Koutranis as Tom Kayser as Victor Alvarez as Arnold Whitcomb as Paul Larson as Woman as Lawyer as Sheila Hawkes as Anthony Simmons as Young Sheila as Mackenzie Acklin as Nina Hale as Dan Keller as Brianna Wells as Malcolm Landon as Daniel as SWAT Commander as Dr. Cipolla as Susan Cole as William as Julie as Emma Coleman as Lyn Anastasio as Hayden Rawlings as Bobby Lainsford as Woman as Howard Nathanson as Ryan Kash as Sgt. Tom Sikes as Michelle Gorman/Mackrel (Shelly as Kayla Bennett as Barista as Young Man as Karla as Portia Richards as Mrs. Stanworth as Elizabeth Tappin as Ortiz Father as Paul Jacobs as Mrs. Donnolly as Kevin Brubaker as Joy as Jessica Randall as Female Hiker as Chelsea as Colleen Sullivan as Reporter as Brittany as Jimmy as Peter Booth as Emily Sisk as Jillian Carter as Young Trudy Yates as Michael Browder as Uniform as Wendy Campbell as Mistress Magdaline as Grief-striken Father as DOD Man as Stephanie Carson as Judy Morrison as Anton Slavsky as Nicole as Laurel Tyson as Jogger as Jon Kreutzmann as Rosalind Bell as Mother as Beth Norvell as Texting Detective as Gill Seymour as Gayle as Irma as Carrie Sayer as Soccer Mom as Charles Cook as Zina as Marvin as Patrolman Harris as Bob Page as Ortiz Father as Shanice as Taxi Driver as Jane Posner as Jennifer Hillbridge as Kerry Fagan as Martha Jennings as Philly Agent as SSA Andi Swan as Dr. Mahaffey as Coroner as Mary Ellen Barnett as Dr. Felicia Campo as Teen Heather as Cora Gilliam as Owner as Mrs. Ortiz as Gary Fisher as Kyle as Walter Davis as Businessman as Male Broker #1 as Doctor as Kevin Bruner as Danny Tucker as Watch Officer as Edgar Solomon as Mother as Joe Vendi as Tim Dellinger as Joe as Sheriff Frank Sanders as Ronnie Hawks as Henry Davin as Liz Meyer as Brian Stoll as Doc Johnson as Tivon Askari as Johnny Matthews as Paramedic One as Michelle Fader as Tanesa Winters as Jay-Mo as Bobbi Baird as Wick Rollins as Cop as Belinda Clark as Patrick as Assistant as M.E. Tech as Jerry as Charles Lorne as Michelle Weston as Don Owens as Nathan Munz as David Fitzgerald as Mrs. Crenshaw as Samantha as Det. Angela Pierce as Agent Dorian Loker as Sid Ruttledge as Mary Kinderman as Det. Dustin Paddock as Officer as Dr. Bonds as Dominic Maguire as Unsub as Young Reid as Paula McConnell as Frank Myers as Joseph Fielding as Jason Nelson as Eileen Woods as Marie Valentine as Authur Lanessa as Linda Nelson as Linda Carlson as Dr. Edward Gourse as Dr. Sandra Lee as Young Todd as Patient as Sherry Douglas as Sean as Young Allie Henson as Dr. Ruiz as Mundy as Strauss Child #1 as Mia Rivera as Serena Adams as Unsub as Casey as Dr. Van Dyke as Charlotte Novak as Zach Bower as Gracie Hendricks as Eli Walker as Cop as Leon Burns as Daryl Barnes as Bryan Behar as Paul Wilson as Evan Abby as Jonah as Maddie Lee as Mona as Violet Brooks as Coroner as Dr. Wolfe as Deborah Quinn as Capt. Margot Nolan as Lt. Price as Det. Paul Rosado as Father Marks as Jasper as Karen Foley as Jane as Strip Club Customer as Lizzy Scott as Sarah Letts as Reporter as Randall Jefferson Jones as Lester Serling as Man as ESU Two as Lou Manzoni as Doug Summers as Gary Michaels as Ray Phillips as Mrs. Holden as Juliette Raynard as Allyson as Tammy May Vasquez as Det. Perez as Maggie Crewswick as Holly as Braden Acklin as Ronnie Brewer as Jose Aguilar as Juan Lopez as Young Vincent as Timothy Ritchie as Dr. Glenn as Tech as Stephanie Turner as Teen Girl as Young Man as Brandi as Shondra Walters as Middle-Aged Man as Capt. Joseph Downey as Mike Bollinger as Eli Grohl as Capt. Joseph Downey as Dwayne as Joe Belser as Det. Ron Keaton as Son as Jim Peters as Dwayne as Mr. Krouse as Frank McKelson as Mr. Harris as Maria Grace as Stephen Shepherd as Jake Preston as Trevor Madison as Roland Lynch as Unsub/Man as Marguerite Churchill as Elaine as Walter Knight as Colleen Everson as Madison Davis as Kat Mackrel as Jimmy Barrett as Debra Wilson as Dr. Carol Roberts as Agnes Kane as Tabitha Ryan as Special Agent Mary Meadows as Miss Rogers as Frank Fagan as Father as Mary Wilkinson as Woman #1 as Sarah Fitzgerald as Fana Kedibe as Jack as Liz Dorsey as Medical Examiner as Becky Williams as Dr. Larson as Louis Sills as Bob Campbell as RV Park Owner as Officer as Cab Driver as Judd as Diane Lanessa as ER Doctor as Young Patrick Sorenson as Boy as Victor Costella as Tucker White as Young Tommy as Allison Sandweiss as Unsub's Wife as Todd Backus as Owen Sims as Bill Seavers as Guard as Dr. Jerry Berneman as Carousel Manager as Dina McKelson as Danny Sterling as Courtney Campbell as Mike Kroger as Young Boy as Carol as Young Leland Peters as Barb Stanhope as Ken as Sam Caplan as Luke Hamilton as Det. Jimmy Tavez as Tabitha Ryan as Ritual Woman as Tim as Rodney Tanner as Bob Kelton as Jean as Claire Proctor as Heather White as Kelsey Tanner as Nancy Ferguson as Julio Watson as Dr. Alexander as Alison Sullivan as Jack as Dr. Linda Merrill as Guy Ayres as Brian Taylor as Sophia Underwood as Chelsea Robinson as Homeless Man as Male Broker #2 as Cara Smith as Eileen Kebler as M.E. as Security Guard as Laura Tucker as Doctor Rawlings as Dr. Rowe as Helen McGill as Sid as Grief-striken Mother as Lisa Barclay as Marvi Hatcher as Mae Wilson as Mr. Leake as Ben Coleman as Vanessa Randall as Det. Moreland as Gas Station Attendant as Nurse as Rev. Jackson Harris as Dr. Janis Karickhoff as Det. Reyes as Jane McBride as Trooper Pasternak as Reporter as Nicole Jones as Shirley Andrews as Bill as Mr. Foley as Allison Abby as Reporter as Jen as Mike Watson as Joshua Sanderson as Alma Hernandez as Sandy as Emily Hazley as Employee No. 3 as Terence Reynolds as ER Nurse as Mrs. Foster as Flora Mendez as Guy as Client as Bart as Det. Willis as Mary Fallon as Clarence Wright as Mark Dolan as Dr. Waters as Paul Barter as Lewis Ramsey as Dylan Einstein as Judge as Emma Zika as Cop #1 as Dr. Hagen as Working Girl #3 as Woman as Mark Cunningham as Russell Pearson as Worried Father as Elaine Simmons as Danny as Carl Cade as Rebecca Leeman as Eric Rawdon as Chelsea Carter as Jack Summers as Kyle Owens as Det. Edward Sanchez as Samantha as Erin as Joseph Purl as Betts as Dennis Hammond as Hicks as Greg Matulic as Charlie Hillridge as Bill Henderson as Concerned Bystander as Kathleen Miller as Detective Michelle Wallenberg as Janine as Terry Pyke as Paramedic Two as State Trooper as Susan as Rachel Willow as Lauryn-Anne Harrison as Ana Brooks as Landlady as Carrie as Richard Jacobs as Carla Wendel as Morris Perrault as Nurse Velma Bradford as Bob Jenkins as Amelia Porter as Evan as Eric as Techie as Frank Kingman as Modesto Bull as Caroline Davis as Dr. Brandon MacDonald as Randall McAdams as Rev. Jorge Santos as Lily as Det. Bob Oliver as Neighbor as Mr. Seager as Trent Walker as Det. Benning as Aimee Fortner as Austin Settergren as Jimmy Ridley as Ruffian as James Barfield as M.E. Sterling as Tracy as Super as Strauss Child #2 as Lisa Jackson as Paul McConnell as Gloria Carlyle as Maya Walker as Holly as Tamako Kimura as Nurse as Dr. Wagner as Renee Patterson as Carl Lee as Elaine Seymour as Michael Hastings as Maya Taylor as Overworked Doctor as Dee Stockton as Cop as Nathan Tubs as Will as Rebecca David as Ann Olson as Lee-Ann Kelton as M.E. as Sara Denslyn as Woman as Celine Destin as Pump Operator as Guard as Woman #2 as Federal Agent as Hostel Manager as Tucker James as Ben Abner as Dr. Susannah Regan as Older Hobo as Dr. Jan Mohikian as Mackenzie Lewis as D.J. as M.E. Jacoby as Larry Bartlett as Truck Driver as Father Davison as Stone as Betty Sorenson as Man/Building Super as Sam Meckler as Kim as George Small as John Henry Henson as Michael Lee Hill as Young Morgan as Michelle Adams as Garrett Pain as Minister as Kimberly Sullivan as Strauss Child #3 as Brook Sanchez as Martha as Jackie Powers as Leslie McBride as Young Charles as Young Daniel as Doctor Michael Bateman as Joshua as Eric as Sgt. Gulsby as Dr. Garnett Packard as Meg DiCamillo as Young Kevon Winters as Tom as Larry Scanlon as Teen Malachi as Janice Fox as Security Guard as Jesse Moore as Carrie Sanderson as Dr. Anthony Reynolds as Jason as Teenage Girl as Birthday Boy as Judge Walter Brooks as Stephen Foley as Rosemary Jenkins as Mary Dolan as Technician as Leo Kane as Dillon Kingman as Susan as Club Dude as Sam Devers as Junkie as Melissa Foster as Curtis Price as Jasmine as Officer Jim Gray as Ben Hughes as Cheryl Winslow as Jeremy as Officer Dewey's Wife as Homeless Man as Woman as Foreman as Tammy as Beth Sims as Allison Astor as Emma Churchill as Stacey Ryan as Sheriff Samuel as Nick Wilson as Manager as Ruth Lynch as Karen Sheppard as Craig Dyson as Trooper Creighton as Lt. Mike Sommers as Coach Don Haas as Phil Andrews as Agent Green as Dr. John Chen as Ellie's Mom as Foley Daughter #1 as Ellie's Mom as Nurse as Daniel Lanham as Josh Stidham as Staff #1 as Becky as Uniformed Cop as Liza McMurray as Tiffany Gleason as Conner Thomas as Nathan Henson as Katherine as Bailey Shelton as Fitz as Paramedic as Tyler Allison as FPS Leader as Jessica as Benjamin Wade as Suzy Maguire as Jodie Armstrong as Kelly Tucker as Alice as Sgt. Hernandez as Nic Prosser as Trisha Bates as Maxine Hightower as Dr. Barbara Moore as Sgt. Blutarsky as Detective as Herbert Mullin as Dr. Gillespy as Medic #1 as Eric as Bartender as Newscaster as Reporter #1 as Disgruntled Man as Deputy Gentry as Reporter #2 as Reporter as Police Captain as Ian Little as Heather as Mr. Belle as Maureen Watson as M.E. Darryl Sutton as Jane Howard as Doctor Barnes as ER Doctor as Minister as Tom Fallon as Eileen Bechtold as Timmy Tanner as Officer Rudy Hightower as Robert Healy as Cop #2 as Roman Azarof as Angel Maker as Tahitian Girl as Richard Henderson as Chloe as Female Broker as Connie Mayers as Lynn Robillard as John Portman as Dr. Laura Braga as 10-year-old Tommy as Bernard as Bus Driver as Mrs. Seager as Kim as Johnson as Sen. Baylor as Jane Sissler as Mitch Settergren as Drew Sandweiss as Kevin Aylesworth as Clarence Tipton as Kate as Cowboy as Little T as Elizabeth Nash as Secretary as Jack Vaughn as Gil Patterson as Steven O'Malley as Young Jess Carney as Liam Abby as Christopher Stafford as Female Cop as Bartender as Admin No. 5/Pam as Terry Rossett as Ms. Bennett as Peter as Priest as Sean Wallace as Older Woman as Billy as Beth Acosta as Man #1 as John Folkmore as Sarah Henson as Nina Moore as Rachel Litterski as Deputy No. 1 as Sect Member No. 1 as Tammy as Gus as Julie as Bailiff as Simon Kahn as 15-year-old Tommy as George Hawthorne as Alan Archer as Dan Riggins as Will Blackburn as Lynn as Wes as Paul Adams as Arlene Tipton as Marcia Masters as Old Woman as Junkie as Milos as Newscaster as Danny Randall as Celia Bryant as Michael as Scared Woman as Peter Chambers as Mr. Kane as James Crayton as Leslie Sanders as Aunt Stiles as Brent as Adam Richmond as Jessica Howard as Guard #1 as Phillip Tran as Darryl Jensen as Dr. Joyce Giles as Audrey Hansen as Dr. Risa Coletti as Caleb as Charles Tanner as Witherspoon as Young Travis as Taras Yudin as Joe Sullivan as Dr. Jean Bellamy as Sect Member No. 1 as Head of Security as Young Reid as Mayor Steve Wennington as Clerk as Meredith Henderson as Tiffany as Young Flora as Uniformed Officer as Nathan Eades as Coroner as Kasey as Secret Service Player as Mark Harrison as Shawn Struthers as PFC Hernandez as Tyrell Curtis as Regan Walton as Ryan as Jerry Sorum as Bernard Hatchitt as Mary Newsome as Amber as Young Karl Beck as Tommy as Reporter as Trainer as Coroner as Dane Hendrix as Doctor Emily Hicks as Reporter as Mrs. Belle as Helen as Heather Jacobs as Abby Sanderson as Benjamin David Merva as Teenager as Peter as Lizzie Sparks as Sheryl Timmons as Paul Lyons as Mail Carrier as Young Karen Foley as Marcy Owens as Colm Lagan as Jenna Kingman as Lindsey Cooper as Woman as Angela Ortiz as Nurse as Security Guard as Diane Haller as Young James as Female Driver as Triage Nurse as Dr. Holly Roettinger as Gail Phillips as Leslie Hopkins as Keron Bendor as Fantasy Victim as Dani Forester as Diane as CEO #1 as Court Clerk as Erik Cole as Deputy #1 as Janis Weir as Reporter #2 as Jake Hillridge as Bad Karaoke Singer as Young William Lynch as Hannah Accord as Lawyer as Alex Grayson as Rhonda as Tire Changer as Elijah Hall as Dart Player as Foley Daughter #2 as Lionel as Corrine Jordan as Anton Gorban as Billy Deaver as Charlie as Abigail Jones as EMT #1 as Screaming Mom as Cashier as Byron Delancey as Lyla Olson as Nurse as Officer Austin Kent as Connie Galen (6-years old) as Ike Stratman as Medical Examiner as Chris Shelton as Samantha as Viper as Burke Manning as Steve Halvert as Julie Beckford as Gary Hazlett as Amber as Julie Myers as Lawyer #1 as Capt. Danny Wales as Coakley's Wife as Hostess as Russ Daniels as Walter Patterson as Aidan as Ron Fergusson as Eleanor Parsons as Medic #2 as Stuart as Doctor #2 as Amber as Det. Ekler as Daniel Morrison as Reporter as Mrs. Brown as Rhonda as Scott Weldon as Carter as Rick Sturgess as Anton Gorban as Kathy as Wick Griffith as Lisa Phillips as Young Tom as EMT #2 as Supervisor as Juan as Staff #2 as Mantis as Weatherman as John Timmons as Hunter Olson as Clerk as Lily Droubay as Operator as Estelle Cosgrove as Young Unsub as Ranger as Vernon Zika as Husband as Michelle Golovin as Man as Det. Stark as Andrea Wright as Sasha Hill as Coroner as Cop as Tommy Anderson as Lenore Purcell as Wade Burke as Reporter as Catherine Hatchitt as Boyfriend as Officer Liddy as Riley Wilson as Channel 3 Reporter #1 as Deacon as CS Tech as Sylvia Frazee as Paul Davies as Missy as Angela Miller as Bill Thomas as Alexander Chase as Lucy as Greta Jacobsen as Man #2 as Jerry Holtz as Pedro Mendez as Austin as Young Samantha as Dr. Castro as Linda as Valerie as Mrs. Kin Nishio as Alex Rain as Trudy as Tre as Young Paul Westin as Mike as Regina Franklin as Dr. Kathleen Dekeyser as George Findley as Leo as Paramedic #1 as Lauren Morrison as Uniform Cop as Tricia Smoots as CSU Tech as Mrs. Kane as Bartender as Nanny as Uri as Clark Howard as Trevor Burkett as Ben Montoya as Guard #2 as Mrs. Donovan as Bus Driver as Surgeon as Alicia Galen (3-years old) as Ally Dolan as Driver as Gavin Pressman as Young Peter as Roscoe Gulch as Deputy No. 2 as Sect Member No. 2 as Security Guard as Father as Sarah Gammon as Larry Stiles as Adam Jenkins as Young Girl #1 as Man as Girl at Rest Stop as Younger Randy as Lawyer #2 as Chief Tom Schultz as Deputy as Charlotte as PFC Mattheson as Hector Ramon as Principal Anderson as Vicki as Principal Vicki Dahl as Colleen Riggins as Tyler Rogers as Tyler Harris as Samantha Forester as Jason Otey as Linda Jackson as Patron as Duerson as Det. Casey as Young Edith Lynch as Richard as Young James Moses as Jeffrey as Holly Golden as Manager as Bartender as Edna as Dad as Peter Hanley as Janice Cheswick as Young Ashley as Uni No. 1 as Father as John Franklin as Benson as Robert Wilkinson as Greg as Coordinator as Michelle Golovin as Pat Sullivan as Deputy No. 2 as Lance Kingman as Reporter as Christopher DeLuca as Male Nurse as Male Reporter as Maureen Hawthorne as Sarah Sherwood as Sandy as Waiter as Principal as Sadie as Paramedic #1 as Mr. Shepherd as Det. Ganz as Martha Porter as David Caston as Spicer's Mom as Building Administrator as Paul Farraday as Brad as Peter Hanley as Dusty as Young Mary Rutka as Carrie Lawson as Dinah's Mom as Mrs. Manwaring as Passenger as Stu as Mike Fleming as Helen Trestle as Chuck as Landon as Karen Holden as Devon White as Faye Landreaux as Donna Kingman as Agent Rush as Woman as Agent Travis Green as Matthew Cannon as Principal Brendan Burke as Young Violet/Amelia as Tina as Ian Steinhardt as Det. William Richards, William Richards as Spooky Prisoner as Catherine as Sheila Goode as M.E. as Stephanie Lawford as Edward Ray Stokes as Benjamin Grayson as Deputy Mack as Joshua Farraday as Renee Sheffield as Ramon as Jogger as Katie as Sally as Sgt. Fletcher as Dee Montoya as Staff #3 as Leo Holt as Damien Chamberlain as Jake Ellison as Chrissy Wilkinson as Medical Examiner as Woman as Dr. Paul Stumpo as Cesar Jimenez as Kelsey Ashwood as Ira Stein as Eric Beckford as Young Girl #2 as Ivan Bakuna as Ross Acklin as Commuter #1 as Russell Smith as Kelly as Bill Jarvis as Paul as Rick Purcell as Luann as Young EMT as Melinda Carroll as Surgeon as Mrs. Shepherd as Nelson G as Louise Hightower as Dr. Anne Cabrera as Karen Manning as Guy as Uni No. 2 as Phil Olson as Local Cop as Police Officer as Bobby Rhodes as Stuart Sankler as Bartender #1 as Billy Rutledge as Donna Kingman as Billie as Sect Member No. 3 as Dr. William Shaw as Deputy as Young Unsub as Lupe Suarez as Jenny Hill as Trent as Priest #1 as Dr. Ridgeway as Dad as Michael as Young Leanne as Nick Forester as Grant Franklin as Agatha Connor as Kiegan Hatchitt as Ted as Guard Tyler as Paramedic #2 as Kat Allen as Smitty as Tech as Alexander as Sandy as Marcus Kinman as Sarah as Young Matt as Uniformed Officer as Timmy Cosgrove as Randy Slade as Audrey Henson as Nick Sullivan as Nate Cochran as Player as Sheriff as Ruth Vasquez as Visitor as Tina Dyson as Paul Hicks as Hernandez III as Isabella Grant as Montgomery Houston as Brandi's Mom as Cassie Campbell as Dr. Meyer as Max as Officer Gardella as SWAT Leader as Marion as Andrew as M.E. Garrison as Uniform Cop as Benjamin David Merva as Gary Manning as Security Officer as State Trooper as Bartender as Evan as Bill as Amy Ellison as Young Chad as Boy as Yoga Teacher as Reporter as Frank Holden as Sect Member No. 4 as Tasha Brooks as Ramon Gomez as Young James as Bill Pittman as Barry Deaver as Mrs. Burke as Bill Kestler as Patricia as Allie Henson as Kristie as George Cunningham as Tara Kelly as Cameron Patterson as Lucy Masters as Nadia as Nora Flynn as Young Joe as Young James Stanworth as Chikodili Mahoney as Jake McCauley as Young Garcia (Age 9) as Digger as Smoker as Sergeant as Lynn Boyd as Peter Joshua as Todd Ashwood as Anthony Ford as Young man as Angie as Oliver Stratton as Tommy as Paul Kelly as Regina's Mom as Jane Young as Dale Ericsson as Cop as Mae as Evidence Tech as Sheryl as Mrs. Porter as Manager as Deputy Everett as April Pearson as Tyler as Passenger as Detective No. 1 as Kimmy as Henry as Patrick Butler as Nick Sullivan as Jason as Rose as Miles Hendrick as Mr. Gless as Hernandez's Mother as Commuter #2 as Jaime as Reporter #1 as Marc as Lindsay as Tony Canardo as Coroner as Cameron Patterson as Bob Sanderson as Gladys as Principal McIntyre as High School Kid as Mrs. Benson as Dale Crawford as SWAT Commander as Brandi as Eva Montoya as Victoria Taylor as Boy as Allison Barnes as Young James as Debbie Joy as Mason Turner as Andre as Ryan as John Westin as Charlie Figg as Maya Connor as Young Elle as Reporter #1 as Nicholas Faye as Jogger as Dahlia as Assistant as Robert as Hunter as Sara as Heather Manning as Abby Benson as Dr. Urman as Bar Patron as Don Black as Lockeford Bull as Renee Acosta as Nick Baleman as Store Manager as Katherine as Minister as Karl Wallace as Classmate #1 as Mr. Hayden as Nicholas Gaye as Faux Unsub as Cordo as Albert Franklin as Girl in Video as Girl as Bruce Proctor as Pamela Mills as Bartender as Ed Gein as Dr. Lin as Jodi Ketelson as Gary Ellard as Beverly Kestler as Burt Lang as Josh as John O'Heron as Akil as Ann Herron as Waiter as Looky-Lou as Reporter as Reporter #2 as Bartender as Young Flynn as Olga the Contortionist as Son as Cop as Bonnie Taylor as Joe Mahoney as Stanley Holmes as Young Garcia (Age 20) as Detective No. 2 as Agent as Colin Dupley as Unsub's Mother as News Reporter as Morgue Technician as Vanessa Hall as Kind Woman as Jessica as Regina's Dad as Stacy Young as Tammy Ericsson as Brandy Moore as TV Newscaster as Suspect as Russian Translator as Kiara as Acolyte as Mr. Connoley's Son as Dr. Nash as Medic as Wendy Milgram as Josephine Patterson as Resident Jogger as Referee as Sect Member No. 5 as Unsub's Mother as Annie Baleman as Joy Harmon as SWAT Commander as Reporter #2 as Father as Janet Morrison as Patron as Newscaster #1 as Desk Sergeant as Guy as Sect Member No. 6 as Field Reporter as Diane as Young Prentiss as Mini-Mart Clerk as Deputy as Justine Mackrel as Sandra Bidwell as Tracey Lambert as Young Ben (10-Years-Old) as Hayden Montgomery as Hitchhiker as Eddie Butler as Kevin Bergstrom as Bill Jarvis as Wesley Parham as Classmate #2 as Billy O'Brien as Annie as Ms. Springer as Linda as Colin Baylor as Manager as Weeks as Amber Stone as Kim Groves as Young Roderick as E.J. Torres as Hospital Clerk as Doug as Elsie as Clarence as Warden as Impatient Man as Carter Tadman as Desk Sergeant as Young Trevor as Lynne Noble as Nancy as Dr. Finn as Victim No. 4 as Uniform as Young Ben (5-Years-Old) as Amy Danwell as Shawn Harper as Sam Bidwell as Glen Hill as HRT Cdr. Powell as Henchman as Medic as Grace Doherty as Female Reporter #2 as Shop Manager as Deputy Hall as Uniformed Sergeant as Dr. Joe Gorman as Man as Reporter1 as DMV Supervisor as Cards Kid as Attorney General as Staring Girl as Jose Rivera as Crystal as Doctor as Meg as Classmate #3 as Salesman as Bobby as Widow as Newscaster #2 as Claire's Father as Abigail as Young Matthew as Randy Harper as Tina (13-Years Old) as Reporter as DJ mark as Agent Franks as Travis as Young Claire as Mom as Ben as Reporter 2 as Greg Murray as Nurse as DJ Brian as Gassed Victim as Young John David Bidwell as Grace Powell as Kate Bryggman as Dr. Kay Armbruster as Tommy (16-years Old) as David Turner as Chess Inmate as Newscaster #3 as Reporter as Helen Clark as Helen as Susie as Priest as Mary Bidwell as Keith Doheny as Police Officer as Young Arthur as Brianne Matloff as Sam as Dan Osborne as Christian as Driver as Carter's Aunt as Young Tobias as Worker as Reporter 3 as Terry Rosett as Woman as Handyman as Baldridge Priest as Carol Murray as Young Sandra as Marie as Megan as Karen Osborne as Nick Goode as Zack Hansen as Reese Hansen as Young Justin Leu as Mrs. Parker as Ruth Taylor as Hannah Wakefield as Mr. Parker as Lynn as Steve as John as Becca as Donald as Georgina Yates Series Details TV Network: CBS Premiere Date: Sep 22, 2005 Genre: Drama Mark Gordon , Edward Allen Bernero , Jeff Davis , Deborah Spera , Chris Mundy , Simon Mirren , Erica Messer , Janine Sherman Barrois , Breen Frazier , Geoff Fitzpatrick , John Luscombe Full Cast Related News & Interviews Pictures News & Interviews for Criminal Minds 2018 TV Premiere Dates Calendar 2018 TV Finale Dates Calendar 2017 Fall TV Premiere Dates Renewed and Canceled TV Shows 2017 S.W.A.T. Star Shemar Moore Shares 7 Things That’ll Make You Say ‘Whoa’ People’s Choice 2017 Winners Announced People’s Choice 2017: Vote Now for Your Favorite Movies, TV Shows and More 2016 Fall TV Premiere Dates People’s Choice Awards 2016: Furious 7 and The Big Bang Theory Are Fan Favorites People’s Choice Awards Nominations 2016 Fall 2015 TV Premiere Dates View All Criminal Minds News Discussion Forum Discuss Criminal Minds on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}