{
  "link": "https://www.rottentomatoes.com/tv/the_x_files\n",
  "title": "The X",
  "resume": "'The truth is out there,' and FBI agents Scully and Mulder seek it in this sci-fi phenomenon about their quest to explain the seemingly unexplainable. Their strange cases include UFO sightings, alien abductions and just about anything else paranormal. The tales were spooky and well-written, but the long-running cult favorite's strength was a gallery of intriguing (when they weren't just enigmatic) characters, and the dynamic---and intense bond---between believer Mulder and skeptic Scully.",
  "rate": "73",
  "genre": "",
  "cast": {},
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It! Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact Home The X-Files (1993 - ) The X-Files (1993 - ) View Collection > View the Collection: Part of the Collection: | 73 % 73 % 80% liked it Critic Consensus: Series Info Creator: Chris Carter Starring: David Duchovny , Gillian Anderson , Arnie Walters The X-Files Videos The X-Files Photos Seasons The X-Files: Season 11 Critics Consensus: The X-Files ' return to business as usual is a refreshing upgrade from the show's underwhelming previous outing. The X-Files: Season 10 Critics Consensus: The X-Files revival lacks the creative spark necessary to sustain the initial rush of nostalgia. The X-Files: Season 9 Critics Consensus: The X-Files: Season 8 Critics Consensus: The X-Files: Season 7 Critics Consensus: The X-Files: Season 6 Critics Consensus: The X-Files: Season 5 Critics Consensus: The X-Files: Season 4 Critics Consensus: The X-Files: Season 3 Critics Consensus: The X-Files: Season 2 Critics Consensus: The X-Files: Season 1 Critics Consensus: Cast as Fox Mulder as Dana Scully as John Doggett as Monica Reyes as Cigarette Smoking Man as Frohike as Diana Fowley as Walter Skinner as Langly as Byers as Gene Gogolak as Erika Price as Jackson Van De Kamp as Brianna Stapleton as Dr. Zuckerman as Michael Bishop as Chief Strong as Davey James as Shirley as Reggie Something as Barbara Beaumont/Sitcom Barbara as Mr. Y as Sarah Arthur as Anna Strong as Dr. They as Dr. Randolph Luvenis as Dean Cavalier as Young Walter Skinner as Nurse as Betty as Arkie Seavers as Commander Al as Officer Eggers as Jeffrey Spender as Juliet 'La Avispa' Bocanegra as Martin as Arkie Seavers as 2nd Missionary as Sherriff Mac Stenzler as Olivia Bocanegra as Nurse Peggy Easton as Agent Colquitt as Josephine Bocanegra as Melvin Peter as Detective Costa as Nurse Vickie Easton as Dr. Babsi Russel as Diana Eggers as Agent Colquitt as Sergeant as Agent Bill Bludworth as Andrew Eggers as Dr. Joyet as Officer Sean as Emily Strong as Maddy Series Details TV Network: FOX Premiere Date: Sep 10, 1993 Chris Carter , Howard Gordon , R.W. Goodwin Full Cast Related News & Interviews Trailers & Clips Pictures News & Interviews for The X-Files 2018 TV Premiere Dates Calendar 2018 TV Finale Dates Calendar 15 Memorable Crossover Episodes Ranked X-Files Stars Gillian Anderson, David Duchovny on Final Season, Including That Episode With Almost No Dialogue ‘Tis the Season for 10 Film- and TV-Tied Video Games Renewed and Canceled TV Shows 2017 TCA 2017: X-Men Series Plan to Fit in With the Movies, Prison Break Premiere Date, More On DVD This Week: 10 Cloverfield Lane , The X-Files , London Has Fallen , and More Now Streaming: The X-Files , Fear the Walking Dead , Fargo , And More Definitive Gillian Anderson Roles As Animated GIFs The X-Files Is Back but David Duchovny Wants to Read the Third Movie Script Video: TV Premieres Countdown for January 22, 2016 It Took Gillian Anderson 10 Years to Appreciate The X-Files 10 TV Shows You Should Binge-Watch This January 2016 Winter/Spring TV Premiere Dates View All The X-Files News Discussion Forum Discuss The X-Files on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}