{
  "link": "https://www.rottentomatoes.com/tv/westworld\n",
  "title": "Westworld",
  "resume": "A sci-fi drama set in an Old West theme park where guests interact with automatons in scenarios that are developed, overseen and scripted by the park's creative, security and quality assurance departments. Based on the 1973 feature film directorial debut by Michael Crichton.",
  "rate": "86",
  "genre": "Science Fiction & Fantasy",
  "cast": {
    "actor": [
      "Angela Sarafyan",
      "Anthony Hopkins",
      "Ed Harris",
      "Evan Rachel Wood",
      "Eddie Rouse",
      "Ingrid Bolso Berdal"
    ],
    "character": [
      "Clementine Pennyfeather",
      "Dr. Robert Ford",
      "The Man in Black",
      "Dolores Abernathy",
      "Kisecawchuck",
      "Armistice"
    ]
  },
  "site_data": "html  TODO: Put in long term targeting fix × Close What is the Tomatometer ® ? From the Critics From RT Users Like You! Fresh The Tomatometer is 60% or higher. Rotten The Tomatometer is below 60%. Certified Fresh Audience Score Percentage of users who rate a movie or TV show positively. Learn More What's the Tomatometer ® ? RT Critics  Home Box Office DVD MORE mobile dropdown News SIGN UP LOG IN mobile dropdown end Movies in Theaters Opening This Week Top Box Office Coming Soon to Theaters Weekend Earnings Certified Fresh Movies On Dvd & Streaming FandangoNOW Netflix Streaming iTunes Amazon and Amazon Prime Top DVD & Streaming New Releases Coming Soon to DVD Certified Fresh Movies Browse All More Top Movies Trailers Forums Certified Fresh Picks 93% Incredibles 2 89% Hereditary 86% Thoroughbreds TV New TV Tonight 100% GLOW 97% A Very English Scandal 67% Kiss Me First No Score Yet Nailed It! Most Popular TV on RT 86% Westworld 84% Marvel's Luke Cage 88% Marvel's Cloak & Dagger 100% Cobra Kai 100% Vida 50% Yellowstone 82% Dietland 96% The Handmaid's Tale 100% Endeavour 83% Goliath 92% The Staircase 96% Pose More Top TV Shows Certified Fresh TV Episodic Reviews Fear the Walking Dead: Season 4 The Handmaid's Tale: Season 2 Legion: Season 2 Preacher: Season 3 The Walking Dead: Season 8 Westworld: Season 2 Certified Fresh Pick 100% Cobra Kai Columns 24 Frames Binge Guide Box Office Guru Critics Consensus Five Favorite Films Now Streaming Parental Guidance Red Carpet Roundup RT on DVD The Simpsons Decade Sub-Cult Tech Talk Total Recall TV Countdown TV Talk Video Interviews Weekly Ketchup View All Best and Worst Jurassic Park Movies Ranked By Tomatometer View All Guides View All RT News GLOW ’s Empowering Season 2 Tickets & Showtimes Trending on RT Sicario Reviews Ant-Man Reviews 75 Best HBO Series Armageddon vs Deep Impact (2015 - ) Westworld (2015 - ) | 86 % 79 % 87% liked it Critic Consensus: Series Info Creator: Jonathan Nolan Starring: Angela Sarafyan , Anthony Hopkins , Ed Harris Most Recent Episode Aired Sun, Jun 24, 2018 The Passenger Westworld Videos Westworld Photos Seasons Westworld: Season 2 Critics Consensus: Westworld builds on its experimental first season, diving deeper into the human side of AI without losing any of its stylish, bloody glory. Westworld: Season 1 Critics Consensus: Westworld balances intelligent, enthralling drama against outright insanity. Cast as Clementine Pennyfeather as Dr. Robert Ford as The Man in Black as Dolores Abernathy as Kisecawchuck as Armistice as Teddy Flood as Charlotte Hale as Theresa Cullen as Bernard Lowe as William as Elsie King as Lee Sizemore as Maeve Millay as Logan as Lawrence as Stubbs as Angela as Antoine Costa as Karl Strand as Grace as Nicholas as Young Robert Ford Series Details TV Network: HBO Premiere Date: Oct 2, 2016 Genre: Science Fiction & Fantasy Bryan Burk , J.J. Abrams , Jerry Weintraub , Jonathan Nolan , Lisa Joy Full Cast Related News & Interviews Trailers & Clips Pictures News & Interviews for Westworld 2018 TV Finale Dates Calendar The 10 Best Moments From Westworld Season 2 Renewed and Canceled TV Shows 2018 Westworld Whips Out Shogun World for Guests Bored by the Old West Westworld Finally Reveals One of the Park’s True Purposes: QA Testing Immortality Westworld : A Seven Nation Army Couldn’t Hold Dolores Back Westworld ’s ‘Reunion’ Scores With Critics Westworld Returns With Dolores’ Guns Blazing in Season 2 Premiere Super Troopers 2 Is More of the Same, but in Canada Rank Thandie Newton’s 10 Best Movies 12 TV Shows You Should Binge-Watch This April New Westworld Trailer Offers 11 Big Season 2 Revelations Westworld Stars and Creators Promise a Revolutionary Season 2 Westworld Stars Preview Season 2 at SXSW Panel Renewed and Canceled TV Shows 2017 View All Westworld News Discussion Forum Discuss Westworld on our TV talk forum!  Help About Rotten Tomatoes What's the Tomatometer? Feedback Critic Submission Licensing Advertise Careers JOIN THE NEWSLETTER Follow Us      Copyright © Fandango. All rights reserved.  V2 Privacy Policy | Terms and Policies | Ad Choices Copyright © Fandango. All rights reserved. V2 Join Newsletter Terms and Policies  Privacy Policy  Feedback"
}