{"link": "https://www.themoviedb.org/tv/44914?language=en", "title": "The Return", "resume": "La Patrona is a Spanish-language telenovela produced by United States-based television network Telemundo Studios, Miami and Mexican Argos Comunicación. The telenovela is a remake of the Venezuelan telenovela La Dueña, written by José Ignacio Cabrujas.\nThe name reflects a local term or slang in Mexico to address a person recognized as the main boss. However, the title is also a reflection of both the protagonist and the antagonist struggle to conquer power, authority and respect in a labor field traditionally deemed to be a man's job.", "rate": 100, "genre": ["Drama", "Soap"], "cast": ["Aracely Arámbula", "Jorge Luis Pila", "Christian Bach", "Erika de la Rosa", "Gonzalo García Vivanco"], "character": ["Gabriela Suárez / Verónica Dantés", "Alejandro Beltrán Guerra", "Antonia Guerra", "Irene Montemar", "Lucho Vampa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44914   Expand The Return   (2013) User Score Overview La Patrona is a Spanish-language telenovela produced by United States-based television network Telemundo Studios, Miami and Mexican Argos Comunicación. The telenovela is a remake of the Venezuelan telenovela La Dueña, written by José Ignacio Cabrujas. The name reflects a local term or slang in Mexico to address a person recognized as the main boss. However, the title is also a reflection of both the protagonist and the antagonist struggle to conquer power, authority and respect in a labor field traditionally deemed to be a man's job. Featured Crew Valentina Párraga Creator José Ignacio Cabrujas Creator Julio César Mármol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aracely Arámbula Gabriela Suárez / Verónica Dantés Jorge Luis Pila Alejandro Beltrán Guerra Christian Bach Antonia Guerra Erika de la Rosa Irene Montemar Gonzalo García Vivanco Lucho Vampa Full Cast & Crew Last Season Season 1 2013 | 127 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Return. You can help by rating TV shows you've seen. Facts Original Name  La Patrona Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Drama Soap Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 18 shiff7 d 6 denim 4 WLEXT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}