{"link": "https://www.themoviedb.org/tv/14929?language=en", "title": "Heartland", "resume": "Life is hard on the Flemings' ranch in the Alberta foothills where abused or neglected horses find refuge with a kind, hard-working family. Debts abound and the bank is about to foreclose. Can they keep the ranch running?", "rate": 76, "genre": ["Drama"], "cast": ["Amber Marshall", "Graham Wardle", "Shaun Johnston", "Michelle Morgan", "Chris Potter"], "character": ["Amy Fleming", "Ty Borden", "Jack Bartlett", "Samantha Louise \"Lou\" Fleming Morris", "Timothy \"Tim\" Fleming"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14929   Expand Heartland   (2007) User Score  Play Trailer Overview Life is hard on the Flemings' ranch in the Alberta foothills where abused or neglected horses find refuge with a kind, hard-working family. Debts abound and the bank is about to foreclose. Can they keep the ranch running? Featured Crew Heather Conkie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  2 Images Backdrops  8 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amber Marshall Amy Fleming Graham Wardle Ty Borden Shaun Johnston Jack Bartlett Michelle Morgan Samantha Louise \"Lou\" Fleming Morris Chris Potter Timothy \"Tim\" Fleming Full Cast & Crew Last Season Season 11 2017 | 18 Episodes Season 11 of Heartland premiered on September 24, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply w Ty: Happy Birthday Graham Wardle! Open 0 by wonder2wonder\n      \n     w Mallory: Happy Birthday Jessica Amlee! Open 0 by wonder2wonder\n      \n     w Amy: Happy Birthday Amber Marshall! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  4 Recommendations   2008-07-01 The Secret Life of the American Teenager 4.8    2010-08-02 Teresa 7.7    2014-09-21 Madam Secretary 6.4    2008-01-24 Murdoch Mysteries 6.9    2012-10-10 Nashville 6.1    2012-08-13 Major Crimes 6.7    2016-01-26 Outsiders 6.7    2009-09-22 NCIS: Los Angeles 6.4  Facts Status  Returning Series Network Certification PG Meaning Parental guidance. Moderate violence and moderate profanity is allowed, as is brief nudity and sexual references if important to the context of the story. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbc.ca/heartland/ Genres Drama Keywords horse death of mother horse ranch alberta canada based on young adult novel Content Score 100 Yes! Looking good! Top Contributors c 97 chevylvr 54 Elizabeth Jennings 16 CouchTater 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}