{"link": "https://www.themoviedb.org/tv/65214?language=en", "title": "Active Raid", "resume": "Set in a part of Tokyo that has descended into a quagmire, the story follows Unit 8 of the 5th Special Public Security Section's 3rd Mobile Assault Division — popularly called \"The Eighth\" — who don powered armor \"Willware\" exoskeletons to counter the rise in crime. Assistant inspector Asami Kazari is assigned to The Eighth with the task of assessing the unit's status and reporting it to her superiors. But her true goal is to rehabilitate this sloppy, haphazard, justice-less group.", "rate": 64, "genre": ["Action", "Adventure", "Animation", "Crime"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65214   Expand Active Raid   (2016) User Score Overview Set in a part of Tokyo that has descended into a quagmire, the story follows Unit 8 of the 5th Special Public Security Section's 3rd Mobile Assault Division — popularly called \"The Eighth\" — who don powered armor \"Willware\" exoskeletons to counter the rise in crime. Assistant inspector Asami Kazari is assigned to The Eighth with the task of assessing the unit's status and reporting it to her superiors. But her true goal is to rehabilitate this sloppy, haphazard, justice-less group. Featured Crew Noriaki Akitaya Creator Goro Taniguchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2016 | 12 Episodes Season 2 of Active Raid premiered on July 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Active Raid. You can help by rating TV shows you've seen. Facts Original Name  アクティヴレイド -機動強襲室第八係- Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://activeraid.net/ Genres Action & Adventure Animation Crime Keywords anime Content Score 64 We're so close, yet so far. Top Contributors 22 sp1ti 17 Elizabeth Jennings 15 Wong 9 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}