{"link": "https://www.themoviedb.org/tv/44103?language=en", "title": "The Undersea World of Jacques Cousteau", "resume": "Le monde sous-marin de Jacques Cousteau est une série télévisée documentaire documentaire mettant l'accent sur la biodiversité marine, organisé par le cinéaste français, chercheur et explorateur marin, Jacques Cousteau. De nouveaux épisodes de la série a été diffusée de 1968 à 1996. English narration était par Richard Johnson et Rod Serling.", "rate": 80, "genre": ["Documentary"], "cast": ["Jacques-Yves Cousteau"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44103   Expand The Undersea World of Jacques Cousteau   (1968) User Score Overview Le monde sous-marin de Jacques Cousteau est une série télévisée documentaire documentaire mettant l'accent sur la biodiversité marine, organisé par le cinéaste français, chercheur et explorateur marin, Jacques Cousteau. De nouveaux épisodes de la série a été diffusée de 1968 à 1996. English narration était par Richard Johnson et Rod Serling. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jacques-Yves Cousteau Himself - Host Full Cast & Crew Last Season Season 2 1979 | 55 Episodes Season 2 of The Undersea World of Jacques Cousteau premiered on August  1, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Undersea World of Jacques Cousteau. You can help by rating TV shows you've seen. Facts Original Name  La collection Cousteau Status  Ended Networks - Certification  - Type  Scripted Original Language  French Runtime  50m Homepage  - Genres Documentary Keywords marine biology nature documentary Content Score 56 We're so close, yet so far. Top Contributors GB 11 Guillaume Beyssac d 11 denis 9 Elizabeth Jennings R 6 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}