{"link": "https://www.themoviedb.org/tv/39180?language=en", "title": "Housos", "resume": "Housos is an Australian comedy television series created by Paul Fenech for SBS, that screens on SBS One. The series is a satirical parody of low income Australian residents of fictional suburb Sunnyvale, who are living in Housing Commission public housing. On 1 November 2012, a film based on the series was released in Australian cinemas, titled Housos vs. Authority. On 9 September 2012 it was announced that Housos would return for a second series, which premiered 22 July 2013.", "rate": 64, "genre": ["Documentary", "Comedy"], "cast": ["Amanda Keller", "Ian Turpie", "Melissa Tkautz", "Jabba", "Rob Shehadie"], "character": ["Dazza"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39180   Expand Housos   (2011) User Score Overview Housos is an Australian comedy television series created by Paul Fenech for SBS, that screens on SBS One. The series is a satirical parody of low income Australian residents of fictional suburb Sunnyvale, who are living in Housing Commission public housing. On 1 November 2012, a film based on the series was released in Australian cinemas, titled Housos vs. Authority. On 9 September 2012 it was announced that Housos would return for a second series, which premiered 22 July 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Keller Ian Turpie Melissa Tkautz Jabba Dazza Rob Shehadie Full Cast & Crew Last Season Season 2 2013 | 9 Episodes Season 2 of Housos premiered on July 22, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Housos. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2003-09-16 Little Britain 7.2  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Documentary Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 4 TMDb Bot 2 Elizabeth Jennings 1 Rug 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}