{"link": "https://www.themoviedb.org/tv/61192?language=en", "title": "Fated to Love You", "resume": "The hard working, kind and timid Kim Mi Young (Jang Nara) has little in the way of education, beauty or wealth, but all that changes after a fateful night of accidental passion with the spoiled, rich heir of a family company, Lee Gun (Jang Hyuk). Her insignificant existence completely transforms when she finds out she is pregnant and must tie her life to his in a shot-gun wedding. The couple decides to make the best of a bad situation, but just when Lee Gun begins to show his growing affection for Kim Mi Young, his first love re-enters the picture to stake her claim.", "rate": 70, "genre": ["Comedy"], "cast": ["Jang Hyuk", "Jang Na-ra", "Choi Jin-hyuk", "Wang Ji-won", "Choi Woo-shik"], "character": ["Lee Gun", "Kim Mi Young", "Daniel Pitt", "Kang Se-ra", "Lee Yong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61192   Expand Fated to Love You   (2014) User Score  Play Trailer Overview The hard working, kind and timid Kim Mi Young (Jang Nara) has little in the way of education, beauty or wealth, but all that changes after a fateful night of accidental passion with the spoiled, rich heir of a family company, Lee Gun (Jang Hyuk). Her insignificant existence completely transforms when she finds out she is pregnant and must tie her life to his in a shot-gun wedding. The couple decides to make the best of a bad situation, but just when Lee Gun begins to show his growing affection for Kim Mi Young, his first love re-enters the picture to stake her claim.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jang Hyuk Lee Gun Jang Na-ra Kim Mi Young Choi Jin-hyuk Daniel Pitt Wang Ji-won Kang Se-ra Choi Woo-shik Lee Yong Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Fated to Love You premiered on July  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Fated to Love You. You can help by rating TV shows you've seen. Facts Original Name  운명처럼 널 사랑해 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/dlove/ Genres Comedy Keywords romance marriage of convenience remake korea Content Score 93 Almost there... Top Contributors M 48 Maria180493 7 Imzadi z 5 zurman1 4 Fabrício  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}