{"link": "https://www.themoviedb.org/tv/1621?language=en", "title": "Boardwalk Empire", "resume": "Boardwalk Empire is a period drama focusing on Enoch \"Nucky\" Thompson (based on the historical Enoch L. Johnson), a political figure who rose to prominence and controlled Atlantic City, New Jersey, during the Prohibition period of the 1920s and 1930s. Nucky interacts with several historical figures in both his personal and political life, including mobsters, politicians, government agents, and the common folk who look up to him. The federal government also takes an interest in the bootlegging and other illegal activities in the area, sending agents to investigate possible mob connections but also looking at Nucky's lifestyle—expensive and lavish for a county political figure.\nPrimetime Emmy Award-winning screenwriter and producer Terence Winter adapted the show from Boardwalk Empire: The Birth, High Times, and Corruption of Atlantic City, a book by Nelson Johnson about historical criminal kingpin Enoch L. Johnson.", "rate": 79, "genre": ["Drama", "Crime"], "cast": ["Steve Buscemi", "Stephen Graham", "Vincent Piazza", "Kelly Macdonald", "Michael Shannon"], "character": ["Enoch 'Nucky' Thompson", "Al Capone", "Lucky Luciano", "Margaret Schroeder", "Nelson Van Alden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1621   Expand Boardwalk Empire   (2010) User Score  Play Trailer Overview Boardwalk Empire is a period drama focusing on Enoch \"Nucky\" Thompson (based on the historical Enoch L. Johnson), a political figure who rose to prominence and controlled Atlantic City, New Jersey, during the Prohibition period of the 1920s and 1930s. Nucky interacts with several historical figures in both his personal and political life, including mobsters, politicians, government agents, and the common folk who look up to him. The federal government also takes an interest in the bootlegging and other illegal activities in the area, sending agents to investigate possible mob connections but also looking at Nucky's lifestyle—expensive and lavish for a county political figure. Primetime Emmy Award-winning screenwriter and producer Terence Winter adapted the show from Boardwalk Empire: The Birth, High Times, and Corruption of Atlantic City, a book by Nelson Johnson about historical criminal kingpin Enoch L. Johnson. Featured Crew Terence Winter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  18 Posters  61 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Buscemi Enoch 'Nucky' Thompson Stephen Graham Al Capone Vincent Piazza Lucky Luciano Kelly Macdonald Margaret Schroeder Michael Shannon Nelson Van Alden Full Cast & Crew Last Season Season 5 2014 | 8 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply S A New Rumor About Why Michael Pitt/Jimmy Darmody was written out of the show Open 0 by Salt-and-Limes\n      \n     A psychological profile of Nelson Van Alden? Open 1 by  Bloodshot77 Go to Discussions Media Most Popular Videos  1 Backdrops  18 Posters  61 Recommendations   1999-01-10 The Sopranos 8.3    2004-03-21 Deadwood 8.1    2005-08-28 Rome 8.2    2002-06-02 The Wire 8.4    2007-07-19 Mad Men 8.0    2010-03-16 Justified 7.9    2012-06-24 The Newsroom 7.8    2004-07-18 Entourage 7.1  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.hbo.com/boardwalk-empire Genres Drama Crime Keywords prohibition gangster mobster atlantic city historical fiction period drama costume drama Content Score 100 Yes! Looking good! Top Contributors 66 Elizabeth Jennings 48 Travis Bell v 32 vahidSA 10 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}