{"link": "https://www.themoviedb.org/tv/10611?language=en", "title": "Mr. Terrific", "resume": "Mister Terrific is an American TV sitcom that aired on CBS Television from January 9, to May 8, 1967. It starred Stephen Strimpell in the title role, and lasted 17 episodes. The show was similar to NBC's Captain Nice, which followed Mister Terrific on Monday nights during its run.\nRiding the tide of the camp superhero craze of the 1960s, the show's premise involved gas station attendant Stanley Beamish, a mild-mannered scrawny youth who secretly worked to fight crime for a government organization, The Bureau of Secret Projects, in Washington. All he needed to do was take a \"power pill\" which gave him the strength of a thousand men and enabled him to fly, much like Superman, albeit by furious flapping while wearing the top half of a wingsuit. Unfortunately, he was the only person on whom the pills worked. It was established that, although the pill would give him great strength, he was still vulnerable to bullets. Furthermore, each power pill had a time limit of one hour, although he generally had two 10-minute booster pills available per episode. Much of the show's humor revolved around Stanley losing his superpowers before he completed his given assignment.", "rate": 0, "genre": ["Comedy"], "cast": ["Stephen Strimpell", "Richard Gautier", "John McGiver", "Paul Smith", "Paul Frees"], "character": ["Stanley Beamish", "Hal Walters", "B. J. Reed", "Harley Trent", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10611   Expand Mr. Terrific   (1967) User Score Overview Mister Terrific is an American TV sitcom that aired on CBS Television from January 9, to May 8, 1967. It starred Stephen Strimpell in the title role, and lasted 17 episodes. The show was similar to NBC's Captain Nice, which followed Mister Terrific on Monday nights during its run. Riding the tide of the camp superhero craze of the 1960s, the show's premise involved gas station attendant Stanley Beamish, a mild-mannered scrawny youth who secretly worked to fight crime for a government organization, The Bureau of Secret Projects, in Washington. All he needed to do was take a \"power pill\" which gave him the strength of a thousand men and enabled him to fly, much like Superman, albeit by furious flapping while wearing the top half of a wingsuit. Unfortunately, he was the only person on whom the pills worked. It was established that, although the pill would give him great strength, he was still vulnerable to bullets. Furthermore, each power pill had a time limit of one hour, although he generally had two 10-minute booster pills available per episode. Much of the show's humor revolved around Stanley losing his superpowers before he completed his given assignment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Strimpell Stanley Beamish Richard Gautier Hal Walters John McGiver B. J. Reed Paul Smith Harley Trent Paul Frees Narrator Full Cast & Crew Last Season Season 1 1967 | 17 Episodes Season 1 of Mr. Terrific premiered on January  9, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mr. Terrific. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords superhero sitcom Content Score 86 Almost there... Top Contributors p 15 pertolero 7 Banana S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}