{"link": "https://www.themoviedb.org/tv/14762?language=en", "title": "Swamp Thing", "resume": "Swamp Thing is an American animated television series based on the DC Comics character Swamp Thing. The series is short-lived, with the pilot episode airing on October 31, 1990 followed by four additional episodes airing weekly from April 20 to May 11, 1991. Produced by DIC Entertainment, the series corresponded with Kenner's Swamp Thing action figure collection released in 1990. Despite the animated series' brief run, various merchandise was also produced in 1991 resulting in the only significant marketing platform ever created for the character.\nLike previous film incarnations of Swamp Thing, the animated series rejects the popular Alan Moore revision of Swamp Thing's origin and portrays him with his original origin as a man turned into a plant-like entity. Anton Arcane takes the role of the main villain responsible for Alec Holland's transformation into Swamp Thing. Arcane is backed by his gang of Un-Men: Dr. Deemo, Weedkiller, and Skinman. Swamp Thing also has two friends named Tomahawk and Bayou Jack. Tomahawk is Native American not to be confused with the DC/Vertigo character, Thomas Hawk, who was a soldier in the American Revolution rescued by Native Americans. Bayou Jack is a Vietnam veteran.", "rate": 60, "genre": ["Animation"], "cast": ["Don Francks", "Len Carlson", "Jonathan Potts", "Philip Akin", "Harvey Atkin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14762   Expand Swamp Thing   (1990) User Score Overview Swamp Thing is an American animated television series based on the DC Comics character Swamp Thing. The series is short-lived, with the pilot episode airing on October 31, 1990 followed by four additional episodes airing weekly from April 20 to May 11, 1991. Produced by DIC Entertainment, the series corresponded with Kenner's Swamp Thing action figure collection released in 1990. Despite the animated series' brief run, various merchandise was also produced in 1991 resulting in the only significant marketing platform ever created for the character. Like previous film incarnations of Swamp Thing, the animated series rejects the popular Alan Moore revision of Swamp Thing's origin and portrays him with his original origin as a man turned into a plant-like entity. Anton Arcane takes the role of the main villain responsible for Alec Holland's transformation into Swamp Thing. Arcane is backed by his gang of Un-Men: Dr. Deemo, Weedkiller, and Skinman. Swamp Thing also has two friends named Tomahawk and Bayou Jack. Tomahawk is Native American not to be confused with the DC/Vertigo character, Thomas Hawk, who was a soldier in the American Revolution rescued by Native Americans. Bayou Jack is a Vietnam veteran. Featured Crew Len Wein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Francks Len Carlson Jonathan Potts Philip Akin Harvey Atkin Full Cast & Crew Last Season : the animated series season 1 1991 | 5 Episodes Season 1 of Swamp Thing premiered on April 20, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Swamp Thing. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}