{"link": "https://www.themoviedb.org/tv/21470?language=en", "title": "Summer's Lease", "resume": "Molly Pargeter is a forty-something wife and mother of three girls, who leads a stable but dull life in 1980s West London. She feels overweight and there is no passion in her relationship with her husband Hugh, who is secretly seeing another woman. For most of her life she has found escape in detective novels and books on art, especially about the fifteenth century Italian fresco painter Piero Della Francesca. Then in a newspaper's small ads Molly sees the details of a villa in Tuscany, Italy to let and after travelling to Italy to view the villa \"La Felicita\" she decides to take it for the family's August holiday.", "rate": 80, "genre": ["Drama"], "cast": ["Sammy Glenn", "Susan Fleetwood", "John Gielgud", "Jeremy Kemp", "Leslie Phillips"], "character": ["Molly Pargeter", "Haverford Downs", "William Fosdyke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21470   Expand Summer's Lease   (1989) User Score Overview Molly Pargeter is a forty-something wife and mother of three girls, who leads a stable but dull life in 1980s West London. She feels overweight and there is no passion in her relationship with her husband Hugh, who is secretly seeing another woman. For most of her life she has found escape in detective novels and books on art, especially about the fifteenth century Italian fresco painter Piero Della Francesca. Then in a newspaper's small ads Molly sees the details of a villa in Tuscany, Italy to let and after travelling to Italy to view the villa \"La Felicita\" she decides to take it for the family's August holiday. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sammy Glenn Susan Fleetwood Molly Pargeter John Gielgud Haverford Downs Jeremy Kemp Leslie Phillips William Fosdyke Full Cast & Crew Last Season Miniseries 1989 | 4 Episodes Season 1 of Summer's Lease premiered on October 31, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Summer's Lease. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  55m Homepage  - Genres Drama Keywords based on novel or book miniseries 1980s Content Score 86 Almost there... Top Contributors R 11 Rebecca TB 8 TMDb Bot i 3 ismax935 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}