{"link": "https://www.themoviedb.org/tv/54344?language=en", "title": "The Leftovers", "resume": "When 2% of the world's population abruptly disappears without explanation, the world struggles to understand just what they're supposed to do about it. The drama series 'The Leftovers' is the story of the people who didn't make the cut.\nBased on the bestselling novel by Tom Perrotta, 'The Leftovers' follows Kevin Garvey, a father of two and the chief of police in a small New York suburb, as he tries to maintain some semblance of normalcy when the notion no longer applies.", "rate": 79, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Justin Theroux", "Carrie Coon", "Christopher Eccleston", "Margaret Qualley", "Chris Zylka"], "character": ["Kevin Garvey", "Nora Durst", "Matt Jamison", "Jill Garvey", "Tom Garvey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54344   Expand The Leftovers   (2014) User Score  Play Trailer Overview When 2% of the world's population abruptly disappears without explanation, the world struggles to understand just what they're supposed to do about it. The drama series 'The Leftovers' is the story of the people who didn't make the cut. Based on the bestselling novel by Tom Perrotta, 'The Leftovers' follows Kevin Garvey, a father of two and the chief of police in a small New York suburb, as he tries to maintain some semblance of normalcy when the notion no longer applies. Featured Crew Damon Lindelof Creator Tom Perrotta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  42 Content Issues  0 Images Backdrops  21 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  2 Top Billed Cast Justin Theroux Kevin Garvey Carrie Coon Nora Durst Christopher Eccleston Matt Jamison Margaret Qualley Jill Garvey Chris Zylka Tom Garvey Full Cast & Crew Last Season Season 3 2017 | 8 Episodes View All Seasons Social Reviews  1 Discussions  42 A review by His Excellency  10.0 Written by  His Excellency  on June 10, 2017 The Leftovers is a show that has had a quite fascinating trajectory. An HBO show with an all-star cast, created by the co-creator of the magnificent Lost. How could it all go wrong? And yet, it almost did. Season 1 at first glance was an inconsistent, tumultuous show of middling quality. Moments of genuine quality interspersed with plodding mediocrity. That said, upon a rewatch, my opinion of it significantly improved. It always was a good show, with some truly mesmerising moments (see Holy Wayne hugging Nora). Season 2 is where it really came alive, however. Whereas season 1 might have seemed...  read the rest. Read All Reviews Media Most Popular Videos  3 Backdrops  21 Posters  14 Recommendations   2014-04-15 Fargo 8.2    2015-06-05 Sense8 7.7    2014-01-12 True Detective 8.1    2011-04-03 The Killing 7.5    2013-04-04 Hannibal 7.7    2011-12-04 Black Mirror 8.2    2013-04-22 Rectify 7.6    2016-06-03 Outcast 7.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.hbo.com/the-leftovers Genres Sci-Fi & Fantasy Drama Keywords depression based on novel or book police chief disappearance family missing person small town sheriff strange event Content Score 100 Yes! Looking good! Top Contributors 116 lineker 86 Elizabeth Jennings 21 Ryan McCloskey 17 Marso  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}