{"link": "https://www.themoviedb.org/tv/19855?language=en", "title": "Blue Gender", "resume": "Blue Gender is a 26-episode anime created by Ryōsuke Takahashi broadcast in Japan from 1999-2000. Blue Gender was created by the Japanese animation studio, AIC and is distributed in the United States by Funimation Entertainment. In 2003, Blue Gender was released on American television as part of Cartoon Network's Adult Swim, though it had originally been planned for Toonami, and was thus edited to remove its graphic violence, nudity, and sex scenes. There is also a compilation movie available on DVD with an alternative ending. The series was also shown on the Sci Fi Channel in the UK in 2002-2003. The Blue Gender series is set in the 2030s, in which Earth has been overrun by the Blue, which are mutated insect-like creatures containing a newly evolved B-cell that recently appeared in several humans, including the main protagonist, Yuji Kaido, that kill and harvest humans for food. Most of the surviving human race has moved to Second Earth, a huge spaceship that orbits the planet. The series mostly focuses on Yuji and Marlene's relationship as they work together to reach Second Earth and their participation in military combat operations against the Blue.", "rate": 73, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["John Burgmeier", "Laura Bailey", "Kyle Hebert", "Kenji Nojima", "Bradford Jackson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19855   Expand Blue Gender   (2003) User Score Overview Blue Gender is a 26-episode anime created by Ryōsuke Takahashi broadcast in Japan from 1999-2000. Blue Gender was created by the Japanese animation studio, AIC and is distributed in the United States by Funimation Entertainment. In 2003, Blue Gender was released on American television as part of Cartoon Network's Adult Swim, though it had originally been planned for Toonami, and was thus edited to remove its graphic violence, nudity, and sex scenes. There is also a compilation movie available on DVD with an alternative ending. The series was also shown on the Sci Fi Channel in the UK in 2002-2003. The Blue Gender series is set in the 2030s, in which Earth has been overrun by the Blue, which are mutated insect-like creatures containing a newly evolved B-cell that recently appeared in several humans, including the main protagonist, Yuji Kaido, that kill and harvest humans for food. Most of the surviving human race has moved to Second Earth, a huge spaceship that orbits the planet. The series mostly focuses on Yuji and Marlene's relationship as they work together to reach Second Earth and their participation in military combat operations against the Blue. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Burgmeier Laura Bailey Kyle Hebert Kenji Nojima Bradford Jackson Full Cast & Crew Last Season Season 1 2003 | 26 Episodes Season 1 of Blue Gender premiered on August  4, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blue Gender. You can help by rating TV shows you've seen. Facts Original Name  ブルージェンダー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Drama Keywords anime Content Score 86 Almost there... Top Contributors M 15 Migi m 3 magoozin TB 2 TMDb Bot 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}