{"link": "https://www.themoviedb.org/tv/6998?language=en", "title": "Lark Rise to Candleford", "resume": "Set in the small hamlet of Lark Rise and the wealthier neighbouring market town, Candleford, the series chronicles the daily lives of farm-workers, craftsmen and gentry at the end of the 19th Century. Lark Rise to Candleford is a love letter to a vanished corner of rural England and a heart-warming drama series teeming with wit, wisdom and romance.", "rate": 73, "genre": ["Drama"], "cast": ["Olivia Hallinan", "Karl Johnson", "Victoria Hamilton", "Dawn French", "Julia Sawalha"], "character": ["Dorcas Lane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6998   Expand Lark Rise to Candleford   (2008) User Score  Play Trailer Overview Set in the small hamlet of Lark Rise and the wealthier neighbouring market town, Candleford, the series chronicles the daily lives of farm-workers, craftsmen and gentry at the end of the 19th Century. Lark Rise to Candleford is a love letter to a vanished corner of rural England and a heart-warming drama series teeming with wit, wisdom and romance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Olivia Hallinan Karl Johnson Victoria Hamilton Dawn French Julia Sawalha Dorcas Lane Full Cast & Crew Last Season Season 4 2011 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  4 Recommendations   2004-04-18 He Knew He Was Right 6.6    1998-05-09 Berkeley Square 7.3    1999-06-20 Aristocrats 7.8    2001-11-11 The Way We Live Now 7.9    1996-11-17 The Tenant of Wildfell Hall 7.3    2012-09-25 The Paradise 6.8    2005-06-07 Sugar Rush 7.8    2002-04-07 The Forsyte Saga 7.7  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00gbbl0 Genres Drama Keywords england family business  city country contrast rural setting period drama costume drama Content Score 93 Almost there... Top Contributors 27 Elizabeth Jennings 12 kcdh 2 Marr 🇳🇱 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}