{"link": "https://www.themoviedb.org/tv/14457?language=en", "title": "Tate", "resume": "Tate is an American Western television series that aired on NBC from June 8 until September 14, 1960. It was created by Harry Julian Fink, who wrote most of the scripts, and produced by Perry Como's Roncom Video Films, Inc., as a summer replacement for The Perry Como Show. Richard Whorf guest starred once on the series and directed the majority of the episodes. Ida Lupino directed one segment.", "rate": 0, "genre": ["Western"], "cast": ["David McLean"], "character": ["Tate"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14457   Expand Tate   (1960) User Score Overview Tate is an American Western television series that aired on NBC from June 8 until September 14, 1960. It was created by Harry Julian Fink, who wrote most of the scripts, and produced by Perry Como's Roncom Video Films, Inc., as a summer replacement for The Perry Como Show. Richard Whorf guest starred once on the series and directed the majority of the episodes. Ida Lupino directed one segment. Featured Crew Harry Julian Fink Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David McLean Tate Full Cast & Crew Last Season Season 1 1960 | 13 Episodes Season 1 of Tate premiered on June  8, 1960. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tate. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Keywords wild west 19th century Content Score 64 We're so close, yet so far. Top Contributors 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}