{"link": "https://www.themoviedb.org/tv/27119?language=en", "title": "The Comic Strip Presents", "resume": "The Comic Strip is a group of British comedians, who came to prominence in the 1980s. They are known for their television series The Comic Strip Presents... which was labelled as an example of alternative comedy. The core members are Adrian Edmondson, Dawn French, Rik Mayall, Nigel Planer, Peter Richardson, Jennifer Saunders and Alexei Sayle with frequent appearances by Keith Allen, Robbie Coltrane and others.", "rate": 73, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27119   Expand The Comic Strip Presents   (1982) User Score Overview The Comic Strip is a group of British comedians, who came to prominence in the 1980s. They are known for their television series The Comic Strip Presents... which was labelled as an example of alternative comedy. The core members are Adrian Edmondson, Dawn French, Rik Mayall, Nigel Planer, Peter Richardson, Jennifer Saunders and Alexei Sayle with frequent appearances by Keith Allen, Robbie Coltrane and others. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2011 | 3 Episodes Season 9 of The Comic Strip Presents premiered on October 15, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1981-02-26 Hi-de-Hi! 7.3    1976-09-08 The Fall and Rise of Reginald Perrin 8.7    1974-01-03 It Ain't Half Hot Mum 8.0    1999-01-08 Gimme Gimme Gimme 7.0    1982-11-09 The Young Ones 7.6    1995-04-21 Father Ted 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords surreal parody anthology british humour Content Score 56 We're so close, yet so far. Top Contributors 21 kcdh 8 Banana O 5 Ozbourne r 5 rmhanford  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}