{"link": "https://www.themoviedb.org/tv/3232?language=en", "title": "Fury", "resume": "Fury is an American western television series that aired on NBC from 1955 to1960. It stars Peter Graves as Jim Newton, who operates the Broken Wheel Ranch in California; Bobby Diamond as Jim's adopted son, Joey Clark Newton, and William Fawcett as ranch hand Pete Wilkey. Roger Mobley co-starred in the two final seasons as Homer \"Packy\" Lambert, a friend of Joey's.\nThe frequent introduction to the show depicts the beloved stallion running inside the corral and approaching the camera as the announcer reads: \"FURY!..The story of a horse..and a boy who loves him.\" Fury is the first American series produced originally by Television Programs of America and later by the British-based company ITC Entertainment.", "rate": 60, "genre": ["Western", "Action", "Adventure"], "cast": ["Peter Graves", "William Fawcett", "Bobby Diamond", "Roger Mobley"], "character": ["Jim Newton", "Pete Wilkey", "Joey Newton", "Packy Lambert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3232   Expand Fury   (1955) User Score Overview Fury is an American western television series that aired on NBC from 1955 to1960. It stars Peter Graves as Jim Newton, who operates the Broken Wheel Ranch in California; Bobby Diamond as Jim's adopted son, Joey Clark Newton, and William Fawcett as ranch hand Pete Wilkey. Roger Mobley co-starred in the two final seasons as Homer \"Packy\" Lambert, a friend of Joey's. The frequent introduction to the show depicts the beloved stallion running inside the corral and approaching the camera as the announcer reads: \"FURY!..The story of a horse..and a boy who loves him.\" Fury is the first American series produced originally by Television Programs of America and later by the British-based company ITC Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Graves Jim Newton William Fawcett Pete Wilkey Bobby Diamond Joey Newton Roger Mobley Packy Lambert Full Cast & Crew Last Season Season 5 1959 | 20 Episodes Season 5 of Fury premiered on October 10, 1959. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fury. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Western Action & Adventure Keywords california horse ranch orphan Content Score 86 Almost there... Top Contributors 23 Banana R 2 Rhoy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}