{"link": "https://www.themoviedb.org/tv/63333?language=en", "title": "The Last Kingdom", "resume": "A show of heroic deeds and epic battles with a thematic depth that embraces politics, religion, warfare, courage, love, loyalty and our universal search for identity. Combining real historical figures and events with fictional characters, it is the story of how a people combined their strength under one of the most iconic kings of history in order to reclaim their land for themselves and build a place they call home.", "rate": 77, "genre": ["Action", "Adventure", "Drama"], "cast": ["Alexander Dreymon", "David Dawson", "Ian Hart", "Thomas W. Gabrielsson", "Eliza Butterworth"], "character": ["Uhtred of Bebbanburg", "King Alfred", "Beocca", "Guthrum", "Aelswith"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63333   Expand The Last Kingdom   (2015) User Score  Play Trailer Overview A show of heroic deeds and epic battles with a thematic depth that embraces politics, religion, warfare, courage, love, loyalty and our universal search for identity. Combining real historical figures and events with fictional characters, it is the story of how a people combined their strength under one of the most iconic kings of history in order to reclaim their land for themselves and build a place they call home. Featured Crew Stephen Butchard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  11 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexander Dreymon Uhtred of Bebbanburg David Dawson King Alfred Ian Hart Beocca Thomas W. Gabrielsson Guthrum Eliza Butterworth Aelswith Full Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of The Last Kingdom premiered on March 16, 2017. View All Seasons Social Reviews  1 Discussions  5 A review by SevenHouses  9.0 Written by  SevenHouses  on March  3, 2017 Pleasantly surprised by the first episode  Spoilers As a fan of Cornwell's Warrior Chronicles/Saxon Stories I've been looking forward to this series for quite some time. Mentally prepared for a major disappointment I have to say that I was pleasantly surprised. If you haven't read the novels the story of Uhtred unfolds fast, perhaps too fast. This first episode covers more than half of the first novel. Although a lot has been omitted, many of the aspects that make the novel such a pleasure to read are there, but (very) subtle. \nIf you have read the novel you have to accept that many eve...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  11 Posters  8 Recommendations   2015-09-15 The Bastard Executioner 5.5    2014-12-12 Marco Polo 7.4    2015-11-15 Into the Badlands 7.4    2013-09-12 Peaky Blinders 8.2    2014-05-11 Penny Dreadful 7.4    2014-01-25 Black Sails 7.1    2014-04-06 TURN: Washington's Spies 7.4    2015-03-20 Bloodline 7.5  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbcamerica.com/the-last-kingdom/ Genres Action & Adventure Drama Keywords viking historical fiction king historical drama costume drama saxons Content Score 100 Yes! Looking good! Top Contributors 118 Elizabeth Jennings 17 EveDemocracy 12 Bendik 10 ciaron88  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}