{"link": "https://www.themoviedb.org/tv/14184?language=en", "title": "Sweet Spy", "resume": "Nam Sang-mi plays widowed police officer Lee Sun-ae who finds herself  suddenly immersed into international espionage by Han Yoo-il, an undercover agent. Kang-Jun has recently transferred to the Criminal  Investigation Department. He opens an old case involving Sun-ae's past  that leads him to an entanglement between the current political/economic  powers and their secrets. One of them, oddly enough, being Han Yoo-il.  Who is this man? Why is he here?", "rate": 100, "genre": ["Action", "Adventure", "Drama", "Comedy"], "cast": ["Nam Sang-mi", "Yoo Seungjun", "Yoo Seon", "Lee Joo-hyun", "Dennis Oh"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14184   Expand Sweet Spy   (2005) User Score Overview Nam Sang-mi plays widowed police officer Lee Sun-ae who finds herself  suddenly immersed into international espionage by Han Yoo-il, an undercover agent. Kang-Jun has recently transferred to the Criminal  Investigation Department. He opens an old case involving Sun-ae's past  that leads him to an entanglement between the current political/economic  powers and their secrets. One of them, oddly enough, being Han Yoo-il.  Who is this man? Why is he here? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nam Sang-mi Yoo Seungjun Yoo Seon Lee Joo-hyun Dennis Oh Full Cast & Crew Last Season Season 1 2005 | 20 Episodes Season 1 of Sweet Spy premiered on November  7, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sweet Spy. You can help by rating TV shows you've seen. Facts Original Name  달콤한스파이 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/spy/ Genres Action & Adventure Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 9 tmdb983464 t 4 taxigps 3 part-mozi A 1 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}