{"link": "https://www.themoviedb.org/tv/71102?language=en", "title": "The Noble Detective", "resume": "A man identifies himself as “Kizoku” (\"Aristocrat\") and works as a private detective for a hobby. Nobody knows his age, address or anything about his family. The actual deductions and investigations are carried out by his employees including his butler, maid and chauffeur. He only has a good time talking to the women involved in the cases.\nMeanwhile, Aika Takatoku works as a private detective. She competes with the Aristocrat Detective to solve cases.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Masaki Aiba", "Emi Takei", "Katsuhisa Namase", "Haruka Kinami", "Amane Okayama"], "character": ["Noble detective", "Aika Takatoku", "Raiu Hanagata", "Yoriko Tamamura", "Shingo Tsunemi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71102   Expand The Noble Detective   (2017) User Score Overview A man identifies himself as “Kizoku” (\"Aristocrat\") and works as a private detective for a hobby. Nobody knows his age, address or anything about his family. The actual deductions and investigations are carried out by his employees including his butler, maid and chauffeur. He only has a good time talking to the women involved in the cases. Meanwhile, Aika Takatoku works as a private detective. She competes with the Aristocrat Detective to solve cases. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masaki Aiba Noble detective Emi Takei Aika Takatoku Katsuhisa Namase Raiu Hanagata Haruka Kinami Yoriko Tamamura Amane Okayama Shingo Tsunemi Full Cast & Crew Last Season Season 1 2017 | 11 Episodes Season 1 of The Noble Detective premiered on April 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Noble Detective. You can help by rating TV shows you've seen. Facts Original Name  貴族探偵 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.fujitv.co.jp/kizoku/ Genres Crime Drama Keywords japan Content Score 71 Just a little bit more... Top Contributors M 43 Maria180493 d 1 dtago1234 1 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}