{"link": "https://www.themoviedb.org/tv/79411?language=en", "title": "Kody Kapow", "resume": "While visiting his family’s village in China, 9-year-old Kody learns that he is next in line to become Village Defender! But he’ll have his hands full, with the evil Mogo Monkey No Go and his monkey minions causing plenty of chaos around town. Luckily, Kody has the help of his grandfather Master Li, his super-sleuth cousin Mei, and ‘fraidy-cat tiger Goji. They also have a secret weapon: the Sapphire Dragon, which they use to Kapower up into martial arts-style superheroes!", "rate": 0, "genre": [], "cast": ["Nissae Isen", "Jenna Warren", "Jason Alexander", "Neil Crone", "Scott Gorman"], "character": ["Kody (voice)", "Mei (voice)", "Goji (voice)", "Mogo (voice)", "Baozi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79411   Expand Kody Kapow   (2017) User Score Overview While visiting his family’s village in China, 9-year-old Kody learns that he is next in line to become Village Defender! But he’ll have his hands full, with the evil Mogo Monkey No Go and his monkey minions causing plenty of chaos around town. Luckily, Kody has the help of his grandfather Master Li, his super-sleuth cousin Mei, and ‘fraidy-cat tiger Goji. They also have a secret weapon: the Sapphire Dragon, which they use to Kapower up into martial arts-style superheroes! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nissae Isen Kody (voice) Jenna Warren Mei (voice) Jason Alexander Goji (voice) Neil Crone Mogo (voice) Scott Gorman Baozi (voice) Full Cast & Crew Last Season Season 1 2017 | 21 Episodes Season 1 of Kody Kapow premiered on July 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kody Kapow. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.kodykapow.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors A 16 Angyl 10 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}