{"link": "https://www.themoviedb.org/tv/20574?language=en", "title": "Wild China", "resume": "The dazzling array of mysterious and wonderful creatures that live in China's most beautiful landscapes.", "rate": 82, "genre": ["Documentary"], "cast": ["Bernard Hill"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20574   Expand Wild China   (2008) User Score Overview The dazzling array of mysterious and wonderful creatures that live in China's most beautiful landscapes. Featured Crew Gavin Maxwell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  9 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bernard Hill Himself - Narrator Full Cast & Crew Last Season Miniseries 2008 | 6 Episodes Season 1 of Wild China premiered on May 11, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Wild China. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  7 Recommendations   2006-09-26 Galapagos 6.5    2003-04-20 Helen of Troy 6.4    2001-09-12 The Blue Planet 8.4    1985-09-29 MacGyver 7.3    1971-09-15 Columbo 7.8    2006-03-05 Planet Earth 8.5  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 50m Homepage   http://www.bbc.co.uk/programmes/b00bv6lk Genres Documentary Keywords china natural history animal nature Content Score 64 We're so close, yet so far. Top Contributors 26 Banana TB 25 TMDb Bot 11 Elizabeth Jennings 8 hzKevin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}