{"link": "https://www.themoviedb.org/tv/2538?language=en", "title": "Hyperdrive", "resume": "Hyperdrive is a British television science fiction sitcom broadcast by BBC Two in 2006 and 2007. The working title was Full Power. In a 2008 interview, Kevin Eldon commented that he considered a third series was unlikely to be commissioned. Set in 2151 and 2152, it follows the crew of HMS Camden Lock as they stumble through their heroic mission to protect British interests in a changing galaxy.\nThe series is written by Kevin Cecil and Andy Riley, directed by John Henderson and produced by Alex Walsh-Taylor. The first episode was broadcast on BBC Two on 11 January 2006. A second series began on 12 July 2007 on BBC Two.", "rate": 74, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Nick Frost", "Miranda Hart", "Kevin Eldon", "Dan Antopolski", "Stephen Evans"], "character": ["Commander Michael Henderson", "Diplomatic Officer Chloe Alice Teal", "First Officer Eduardo Pauline York", "Technical Officer Karl Jeffers", "Navigator Dave Vine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2538   Expand Hyperdrive   (2006) User Score Overview Hyperdrive is a British television science fiction sitcom broadcast by BBC Two in 2006 and 2007. The working title was Full Power. In a 2008 interview, Kevin Eldon commented that he considered a third series was unlikely to be commissioned. Set in 2151 and 2152, it follows the crew of HMS Camden Lock as they stumble through their heroic mission to protect British interests in a changing galaxy. The series is written by Kevin Cecil and Andy Riley, directed by John Henderson and produced by Alex Walsh-Taylor. The first episode was broadcast on BBC Two on 11 January 2006. A second series began on 12 July 2007 on BBC Two. Featured Crew Andy Riley Creator Kevin Cecil Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nick Frost Commander Michael Henderson Miranda Hart Diplomatic Officer Chloe Alice Teal Kevin Eldon First Officer Eduardo Pauline York Dan Antopolski Technical Officer Karl Jeffers Stephen Evans Navigator Dave Vine Full Cast & Crew Last Season Season 2 2007 | 6 Episodes Season 2 of Hyperdrive premiered on July 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   1984-03-07 Fresh Fields 7.0    1986-09-01 Brush Strokes 7.8    1991-04-07 The Darling Buds of May 7.8  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  30m, 29m Homepage  - Genres Comedy Sci-Fi & Fantasy Keywords future space sitcom british humour Content Score 93 Almost there... Top Contributors 13 Banana 12 TonAngel 7 Markxist O 5 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}