{"link": "https://www.themoviedb.org/tv/42713?language=en", "title": "Record of Lodoss War", "resume": "Born in battle, baptized in fire, it's kingdoms have been ravaged by war for thousands of years.  Now, an evil stirs, an ancient goddess of destruction awakened by an evil wizard.  A party of six is forged to defeat this threat, or die in the attempt.  Join Parn, the young fighter, as he leads his warriors into the heart of a land where dragons rule and evil holds sway over the earth.  Six swords are now drawn against this darkness.  The war for Lodoss has begun!", "rate": 79, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["Takeshi Kusao", "Yumi Touma", "Kappei Yamaguchi", "Hideyuki Tanaka", "Yoshiko Sakakibara"], "character": ["Parn (voice)", "Deedlit (voice)", "Etoh (voice)", "Slayn (voice)", "Karla (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42713   Expand Record of Lodoss War   (1990) User Score Overview Born in battle, baptized in fire, it's kingdoms have been ravaged by war for thousands of years.  Now, an evil stirs, an ancient goddess of destruction awakened by an evil wizard.  A party of six is forged to defeat this threat, or die in the attempt.  Join Parn, the young fighter, as he leads his warriors into the heart of a land where dragons rule and evil holds sway over the earth.  Six swords are now drawn against this darkness.  The war for Lodoss has begun! Featured Crew Ryo Mizuno Creator Hitoshi Yasuda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takeshi Kusao Parn (voice) Yumi Touma Deedlit (voice) Kappei Yamaguchi Etoh (voice) Hideyuki Tanaka Slayn (voice) Yoshiko Sakakibara Karla (voice) Full Cast & Crew Last Season Season 1 1990 | 13 Episodes Season 1 of Record of Lodoss War premiered on June 30, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  11 Recommendations   2002-01-08 Full Metal Panic! 6.6    2007-07-27 Baccano! 8.4    1996-01-10 Rurouni Kenshin 7.6    1998-04-02 TRIGUN 7.7    1997-10-07 Berserk 8.1    1995-10-04 Neon Genesis Evangelion 8.0    2004-05-20 Samurai Champloo 8.0    1999-01-10 Batman Beyond 7.8  Facts Original Name  ロ-ドス島戰記 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Drama Keywords fantasy supernatural based on manga shounen anime Content Score 100 Yes! Looking good! Top Contributors t 44 tmdb42009110 t 21 tmdb62726470 l 12 larysius 9 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}