{"link": "https://www.themoviedb.org/tv/20696?language=en", "title": "Dennou Keisatsu Cybercop", "resume": "Dennou Keisatsu Cybercop is a Japanese tokusatsu TV series. First created in 1988 by Toho Enterprises, the show was an attempt to create a Tokusatsu series using the Super Sentai motif, but the idea was dropped after the unaired episode 0. The show was broadcast on NTV and aired from October 2, 1988 to July 5, 1989.", "rate": 88, "genre": ["Kids", "Action", "Adventure"], "cast": ["Tomonori Yoshida", "Shogo Shiotani", "Ryuji Mizumoto", "Ryoma Sasaki", "Takashi Koura"], "character": ["Shinya Takeda/Júpiter", "Akira Hōjō/Marte", "Ryōichi Mōri/Saturno", "Osamu Saionji/Mercúrio", "Lucifer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20696   Expand Dennou Keisatsu Cybercop   (1988) User Score Overview Dennou Keisatsu Cybercop is a Japanese tokusatsu TV series. First created in 1988 by Toho Enterprises, the show was an attempt to create a Tokusatsu series using the Super Sentai motif, but the idea was dropped after the unaired episode 0. The show was broadcast on NTV and aired from October 2, 1988 to July 5, 1989. Featured Crew Minoru Nonaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomonori Yoshida Shinya Takeda/Júpiter Shogo Shiotani Akira Hōjō/Marte Ryuji Mizumoto Ryōichi Mōri/Saturno Ryoma Sasaki Osamu Saionji/Mercúrio Takashi Koura Lucifer Full Cast & Crew Last Season Season 1 1988 | 37 Episodes Season 1 of Dennou Keisatsu Cybercop premiered on October  2, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1985-03-15 Kyojuu Tokusou Juspion 9.0  Facts Original Name  電脳警察サイバーコップ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Kids Action & Adventure Keywords tokusatsu Content Score 93 Almost there... Top Contributors a 34 agabrielads NS 18 Norte Serra 8 Renato 1 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}