{"link": "https://www.themoviedb.org/tv/9830?language=en", "title": "Dennis Miller Live", "resume": "Dennis Miller Live was a weekly talk show on HBO, hosted by comedian Dennis Miller. The show ran 215 episodes from 1994 to 2002, and received five Emmy awards, plus an additional 11 Emmy nominations. It was also nominated six times for the Writers Guild of America Award for \"Best Writing For A Comedy/Variety Series\", and won three of those times.\nThe show was the brainstorm of HBO honcho Michael Fuchs, who told Miller he could use any forum he wanted as long as he brought in the numbers. It was directed by Debbie Palacio for most of its run, and head writers were first Jeff Cesario and then Eddie Feldmann. Other writers included José Arroyo, Rich Dahm, Ed Driscoll, David Feldman, Mike Gandolfi, Jim Hanna, Tom Hertz, Leah Krinsky, Rob Kutner, Rick Overton, Jacob Sager Weinstein, and David S. Weiss.", "rate": 73, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9830   Expand Dennis Miller Live User Score Overview Dennis Miller Live was a weekly talk show on HBO, hosted by comedian Dennis Miller. The show ran 215 episodes from 1994 to 2002, and received five Emmy awards, plus an additional 11 Emmy nominations. It was also nominated six times for the Writers Guild of America Award for \"Best Writing For A Comedy/Variety Series\", and won three of those times. The show was the brainstorm of HBO honcho Michael Fuchs, who told Miller he could use any forum he wanted as long as he brought in the numbers. It was directed by Debbie Palacio for most of its run, and head writers were first Jeff Cesario and then Eddie Feldmann. Other writers included José Arroyo, Rich Dahm, Ed Driscoll, David Feldman, Mike Gandolfi, Jim Hanna, Tom Hertz, Leah Krinsky, Rob Kutner, Rick Overton, Jacob Sager Weinstein, and David S. Weiss. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}