{"link": "https://www.themoviedb.org/tv/47093?language=en", "title": "Rough Riders", "resume": "Rough Riders is a 1997 television miniseries directed and co-written by John Milius about future President Theodore Roosevelt and the regiment. The series prominently shows the bravery of the volunteers at the Battle of San Juan Hill, part of the Spanish–American War of 1898. It was released on DVD in 2006. The series originally aired on TNT with a four-hour running time, including commercials.", "rate": 68, "genre": ["Western", "Drama", "Action", "Adventure", "War", "Politics"], "cast": ["Holt McCallany", "James Parks", "Dakin Matthews", "Mark Moses", "William Katt"], "character": ["Sgt. Hamilton Fish", "William Tiffany", "Wadsworth, Sr.", "Lt. Woodbury Kane", "Edward Marshall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47093   Expand Rough Riders   (1997) User Score Overview Rough Riders is a 1997 television miniseries directed and co-written by John Milius about future President Theodore Roosevelt and the regiment. The series prominently shows the bravery of the volunteers at the Battle of San Juan Hill, part of the Spanish–American War of 1898. It was released on DVD in 2006. The series originally aired on TNT with a four-hour running time, including commercials. Featured Crew John Milius Creator Hugh Wilson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Holt McCallany Sgt. Hamilton Fish James Parks William Tiffany Dakin Matthews Wadsworth, Sr. Mark Moses Lt. Woodbury Kane William Katt Edward Marshall Full Cast & Crew Last Season Mini series 1997 | 2 Episodes Season 1 of Rough Riders premiered on January  1, 1997. View All Seasons Social Reviews  1 Discussions  1 T A review by Tim-Buktu Written by  Tim-Buktu  on February 26, 2017 A first rate adventure story of the Spanish-American War centering on the American Volunteers to Cuba. Many historical figures are portrayed accurately if somewhat over the top. Read All Reviews Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2011-04-17 Game of Thrones 8.2  Facts Status  Ended Network Certification 12 Meaning Content suitable for viewers over the age of 12. Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Western Drama Action & Adventure War & Politics Keywords theodore roosevelt spanish–american war rough riders Content Score 93 Almost there... Top Contributors TB 19 TMDb Bot 18 Steve 10 Juscelino Franklin Dos Santos R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}