{"link": "https://www.themoviedb.org/tv/44724?language=en", "title": "Orbit: Earth's Extraordinary Journey", "resume": "Right now you're hurtling around the sun at 64,000 miles an hour (100,000 kms an hour). In the next year you'll travel 584 million miles, to end up back where you started. Presenters Kate Humble and Dr Helen Czerski follow the Earth's voyage around the sun for one complete orbit, to witness the astonishing consequences this journey has for us all.", "rate": 87, "genre": ["Documentary"], "cast": ["Kate Humble"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44724   Expand Orbit: Earth's Extraordinary Journey   (2012) User Score Overview Right now you're hurtling around the sun at 64,000 miles an hour (100,000 kms an hour). In the next year you'll travel 584 million miles, to end up back where you started. Presenters Kate Humble and Dr Helen Czerski follow the Earth's voyage around the sun for one complete orbit, to witness the astonishing consequences this journey has for us all. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Humble Full Cast & Crew Last Season Miniseries 2012 | 3 Episodes Season 1 of Orbit: Earth's Extraordinary Journey premiered on March  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2010-06-09 Through the Wormhole 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00xztbr Genres Documentary Keywords miniseries planet earth Content Score 56 We're so close, yet so far. Top Contributors R 15 Rebecca TB 7 TMDb Bot 4 Bekker f 3 flashcg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}