{"link": "https://www.themoviedb.org/tv/424?language=en", "title": "Torchwood", "resume": "Torchwood is a British science fiction television programme created by Russell T Davies. The series is a spin-off from the 2005 revival of the long-running science fiction programme Doctor Who. Torchwood follows the exploits of a small team of alien hunters, who make up the Cardiff branch of the fictional Torchwood Institute, which deals mainly with incidents involving extraterrestrials.", "rate": 74, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["John Barrowman", "Eve Myles", "Lauren Ambrose", "Alexa Havins", "Mekhi Phifer"], "character": ["Jack Harkness", "Gwen Cooper", "Jilly Kitzinger", "Esther Drummond", "Rex Matheson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 424   Expand Torchwood   (2006) User Score  Play Trailer Overview Torchwood is a British science fiction television programme created by Russell T Davies. The series is a spin-off from the 2005 revival of the long-running science fiction programme Doctor Who. Torchwood follows the exploits of a small team of alien hunters, who make up the Cardiff branch of the fictional Torchwood Institute, which deals mainly with incidents involving extraterrestrials. Featured Crew Russell T. Davies Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  51 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Barrowman Jack Harkness Eve Myles Gwen Cooper Lauren Ambrose Jilly Kitzinger Alexa Havins Esther Drummond Mekhi Phifer Rex Matheson Full Cast & Crew Last Season Miracle Day 2011 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  51 Posters  11 Recommendations   2008-10-03 Sanctuary 6.8    2011-07-11 Alphas 6.5    1963-11-23 Doctor Who 7.8    2007-02-10 Primeval 6.6    2009-07-07 Warehouse 13 7.2    2004-07-11 The 4400 6.9    1999-10-05 Angel 7.6    2006-03-05 Numb3rs 6.5  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m, 50m Homepage   http://www.bbc.co.uk/programmes/b006m8ln Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords supernatural time travel alien paranormal investigation spin off space and aliens Content Score 100 Yes! Looking good! Top Contributors L 22 Law 17 Elizabeth Jennings 12 Travis Bell d 8 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}