{"link": "https://www.themoviedb.org/tv/2609?language=en", "title": "The Day of the Triffids", "resume": "The Day of the Triffids is a British television series which was first aired by the BBC in 1981. An adaptation by Douglas Livingstone of the 1951 novel by John Wyndham, the six half-hour episodes were produced by David Maloney and directed by Ken Hannam, with original music by Christopher Gunning.", "rate": 67, "genre": ["Drama"], "cast": ["Stephen Yardley", "Maurice Colbourne", "John Duttine", "Gary Olsen", "Emma Relph"], "character": ["Jack Coker", "Bill Masen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2609   Expand The Day of the Triffids   (1981) User Score Overview The Day of the Triffids is a British television series which was first aired by the BBC in 1981. An adaptation by Douglas Livingstone of the 1951 novel by John Wyndham, the six half-hour episodes were produced by David Maloney and directed by Ken Hannam, with original music by Christopher Gunning. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Yardley Maurice Colbourne Jack Coker John Duttine Bill Masen Gary Olsen Emma Relph Full Cast & Crew Last Season Miniseries 1981 | 6 Episodes Season 1 of The Day of the Triffids premiered on September  9, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1968-09-14 The Adventures of Batman 7.4    1996-09-12 Neverwhere 7.2    1999-11-14 Aftershock: Earthquake in New York 4.9    2009-07-26 The Storm 4.0    1976-09-08 The Fall and Rise of Reginald Perrin 8.7    1969-11-19 The Benny Hill Show 6.0    2009-12-28 The Day of the Triffids 5.6    1999-09-14 Journey to the Center of the Earth 4.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m, 26m Homepage   http://www.bbc.co.uk/programmes/b007vv66 Genres Drama Keywords miniseries Content Score 86 Almost there... Top Contributors TB 10 TMDb Bot 9 lineker R 7 Rebecca w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}