{"link": "https://www.themoviedb.org/tv/13120?language=en", "title": "Code Monkeys", "resume": "Code Monkeys is an American animated television program by Adam de la Peña. Set in the early 1980s, it follows the adventures of fictional video game company GameaVision.\nThe show first aired on July 11, 2007. Two seasons have aired on G4 and G4 Canada. In September 2008, the show began airing on the Teletoon Detour block on Teletoon in Canada.\nWhile G4 was vague on the future of the show after the end of the second season, it was announced in May 2009 that the show would not be renewed for a third season.", "rate": 76, "genre": ["Animation", "Comedy"], "cast": ["Dana Snyder", "Adam de la Peña", "Lionel Tubbins", "Andy Sipes", "Matt Mariska"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13120   Expand Code Monkeys   (2007) User Score Overview Code Monkeys is an American animated television program by Adam de la Peña. Set in the early 1980s, it follows the adventures of fictional video game company GameaVision. The show first aired on July 11, 2007. Two seasons have aired on G4 and G4 Canada. In September 2008, the show began airing on the Teletoon Detour block on Teletoon in Canada. While G4 was vague on the future of the show after the end of the second season, it was announced in May 2009 that the show would not be renewed for a third season. Featured Crew Adam de la Peña Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dana Snyder Adam de la Peña Lionel Tubbins Andy Sipes Matt Mariska Full Cast & Crew Last Season Code monkeys season 2 2008 | 12 Episodes Season 2 of Code Monkeys premiered on June  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1990-09-08 The Adventures of Super Mario Bros. 3 6.2    2007-05-13 Superjail! 7.5    2005-12-13 Moral Orel 7.5    2010-09-06 Mad 4.4    1997-07-15 I Am Weasel 7.4    2011-10-02 China, IL 6.0    2003-08-23 Duck Dodgers 7.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.g4tv.com/codemonkeys Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 9 janar z 5 zurman1 3 TheOneManBoxOffice r 2 rectifyer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}