{"link": "https://www.themoviedb.org/tv/71636?language=en", "title": "Individualist Ms. Ji Young", "resume": "This is a short drama about an individualist, Ji Young (Min Hyo Rin), who avoids relationships with others, meets Byuk Soo (Gong Myung), who can’t live without having relationships.", "rate": 100, "genre": ["Comedy"], "cast": ["Min Hyo-rin", "Gong Myung", "Oh Na-ra", "Ji Il-Joo", "Jung Young-ki"], "character": ["Ji Young", "Byuk Soo", "Su Kyoung", "Yun Suk", "cameo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71636   Expand Individualist Ms. Ji Young   (2017) User Score Overview This is a short drama about an individualist, Ji Young (Min Hyo Rin), who avoids relationships with others, meets Byuk Soo (Gong Myung), who can’t live without having relationships. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Min Hyo-rin Ji Young Gong Myung Byuk Soo Oh Na-ra Su Kyoung Ji Il-Joo Yun Suk Jung Young-ki cameo Full Cast & Crew Last Season Season 1 2017 | 2 Episodes Season 1 of Individualist Ms. Ji Young premiered on May  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Individualist Ms. Ji Young. You can help by rating TV shows you've seen. Facts Original Name  개인주의자 지영씨 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/individualjy/about/program/index.html Genres Comedy Keywords romance Content Score 71 Just a little bit more... Top Contributors 16 sojuoppa 12 barto d 3 daphie R 2 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}