{"link": "https://www.themoviedb.org/tv/72548?language=en", "title": "Are You Human?", "resume": "Nam Shin is a son from a family who runs a large company. After an unexpected accident, he falls into a coma. His mother Oh Ro-Ra is an authority on brain science and artificial intelligence. She creates an android named Nam Shin III which looks like just like her son Nam Shin. The android pretends to be Nam Shin and he has a bodyguard So-Bong.", "rate": 70, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Seo Kang-joon", "Gong Seung-yeon", "Lee Joon-hyuk", "Park Hwan-Hee", "Kim Sung-ryung"], "character": ["Nam Shin / Nam Shin III", "Kang So-Bong", "Ji Young-Hoon", "Seo Ye-Na", "Oh Ro-Ra"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72548   Expand Are You Human?   (2018) User Score Overview Nam Shin is a son from a family who runs a large company. After an unexpected accident, he falls into a coma. His mother Oh Ro-Ra is an authority on brain science and artificial intelligence. She creates an android named Nam Shin III which looks like just like her son Nam Shin. The android pretends to be Nam Shin and he has a bodyguard So-Bong. Featured Crew Jo Jung Joo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo Kang-joon Nam Shin / Nam Shin III Gong Seung-yeon Kang So-Bong Lee Joon-hyuk Ji Young-Hoon Park Hwan-Hee Seo Ye-Na Kim Sung-ryung Oh Ro-Ra Full Cast & Crew Current Season Season 1 2018 | 20 Episodes Season 1 of Are You Human? premiered on June  4, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Are You Human?. You can help by rating TV shows you've seen. Facts Original Name  너도 인간이니 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/ruhuman/ Genres Sci-Fi & Fantasy Keywords romance korea Content Score 93 Almost there... Top Contributors M 57 Maria180493 4 shadowfurious h 3 huestory 3 Alex2017  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}