{"link": "https://www.themoviedb.org/tv/67604?language=en", "title": "Ça décolle", "resume": "Welcome to Superior Air! Buckle up, put your seat in the upright position, and get ready for the jokes to fly at 30,000 feet. Kim, Clara and Justin, our senior flight crew, will make sure that every flight is unforgettable. On each trip passengers of all ages, with their own stories, will board the plane for a destination.", "rate": 75, "genre": ["Comedy"], "cast": ["Mehdi Bousaidan", "Anne-Élisabeth Bossé", "Marie Soleil Dion", "Pierre-Luc Lafontaine", "Michel Laperrière"], "character": ["Mohammed", "Kim", "Clara", "Bastien", "Richard Lachance"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67604   Expand Ça décolle   (2016) User Score Overview Welcome to Superior Air! Buckle up, put your seat in the upright position, and get ready for the jokes to fly at 30,000 feet. Kim, Clara and Justin, our senior flight crew, will make sure that every flight is unforgettable. On each trip passengers of all ages, with their own stories, will board the plane for a destination. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mehdi Bousaidan Mohammed Anne-Élisabeth Bossé Kim Marie Soleil Dion Clara Pierre-Luc Lafontaine Bastien Michel Laperrière Richard Lachance Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Ça décolle premiered on September  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ça décolle. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  23m Homepage   http://vtele.ca/emissions/ca-decolle Genres Comedy Keywords airplane sketch comedy sitcom Content Score 86 Almost there... Top Contributors 70 Banana 4 Guipat 2 tarawillow  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}