{"link": "https://www.themoviedb.org/tv/68653?language=en", "title": "Oh My Geum Bi", "resume": "Geum Bi is only 8-years-old, but she suffers from dementia. She is slowly losing her memory. Her father Hwi Cheol is a swindler. While taking care of Geum Bi, he learns about the preciousness of life. Jang Joo Young becomes involved with Geum Bi and Hwi Cheol.", "rate": 87, "genre": ["Family", "Drama"], "cast": ["Oh Ji-ho", "Heo Jung-eun", "Park Jin-Hee", "Oh Yoon-ah", "Lee Ji-hoon"], "character": ["Mo Hwi-Chul", "Mo Geum-Bi", "Go Gang-Hee", "Jang Joo-Young", "Cha Chi-Soo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68653   Expand Oh My Geum Bi   (2016) User Score  Play Trailer Overview Geum Bi is only 8-years-old, but she suffers from dementia. She is slowly losing her memory. Her father Hwi Cheol is a swindler. While taking care of Geum Bi, he learns about the preciousness of life. Jang Joo Young becomes involved with Geum Bi and Hwi Cheol. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oh Ji-ho Mo Hwi-Chul Heo Jung-eun Mo Geum-Bi Park Jin-Hee Go Gang-Hee Oh Yoon-ah Jang Joo-Young Lee Ji-hoon Cha Chi-Soo Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of Oh My Geum Bi premiered on November 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2016-09-21 On the Way to the Airport 8.7    2016-09-26 Woman with a Suitcase 7.1    2016-11-07 Romantic Doctor, Teacher Kim 6.7    2016-08-27 Blow Breeze 6.6    2016-01-22 Madame Antoine 6.0    2016-09-05 Drinking Solo 8.1    2016-03-18 Ms. Temper & Nam Jung Gi 6.0    2016-05-14 Dear Fair Lady Kong Shim 5.2  Facts Original Name  오 마이 금비 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/myfairlady/ Genres Family Drama Keywords korea Content Score 93 Almost there... Top Contributors M 39 Maria180493 z 15 zurman1 3 lemonlyman 3 andermairena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}