{"link": "https://www.themoviedb.org/tv/4613?language=en", "title": "Band of Brothers", "resume": "Drawn from interviews with survivors of Easy Company, as well as their journals and letters, Band of Brothers chronicles the experiences of these men from paratrooper training in Georgia through the end of the war. As an elite rifle company parachuting into Normandy early on D-Day morning, participants in the Battle of the Bulge, and witness to the horrors of war, the men of Easy knew extraordinary bravery and extraordinary fear - and became the stuff of legend. Based on Stephen E. Ambrose's acclaimed book of the same name.", "rate": 82, "genre": ["Drama", "War", "Politics", "War", "Politics"], "cast": ["Damian Lewis", "Ron Livingston", "Donnie Wahlberg", "Matthew Settle", "Scott Grimes"], "character": ["Richard D. Winters", "Lewis Nixon", "C. Carwood Lipton", "Ronald Speirs", "Donald Malarkey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4613   Expand Band of Brothers   (2001) User Score  Play Trailer Overview Drawn from interviews with survivors of Easy Company, as well as their journals and letters, Band of Brothers chronicles the experiences of these men from paratrooper training in Georgia through the end of the war. As an elite rifle company parachuting into Normandy early on D-Day morning, participants in the Battle of the Bulge, and witness to the horrors of war, the men of Easy knew extraordinary bravery and extraordinary fear - and became the stuff of legend. Based on Stephen E. Ambrose's acclaimed book of the same name. Featured Crew Steven Spielberg Creator Tom Hanks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  9 Images Backdrops  45 Posters  33 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Damian Lewis Richard D. Winters Ron Livingston Lewis Nixon Donnie Wahlberg C. Carwood Lipton Matthew Settle Ronald Speirs Scott Grimes Donald Malarkey Full Cast & Crew Last Season Season 1 2001 | 10 Episodes Season 1 of Band of Brothers premiered on September  9, 2001. View All Seasons Social Reviews  1 Discussions  11 a A review by avivg  10.0 Written by  avivg  on September 26, 2017 One of the best TV-shows of all time.\nThis war series is one of the most realistic,  accurate, detailed and comprehensive I've ever encountered.\nThe show is overwhelming, intriguing and some episodes can squeeze a couple of tears from you.\nOne of the few series that stuck in your head even a week after you've finish them.\nHighly recommended. Read All Reviews Media Most Popular Videos  1 Backdrops  45 Posters  33 Recommendations   2010-03-14 The Pacific 7.9    2004-03-21 Deadwood 8.1    2005-08-28 Rome 8.2    2002-06-02 The Wire 8.4    1999-01-10 The Sopranos 8.3    2010-09-19 Boardwalk Empire 7.7    2014-01-12 True Detective 8.1    2008-07-13 Generation Kill 8.1  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.hbo.com/band-of-brothers Genres Drama War & Politics War & Politics Keywords war kidnapping world war ii u.s. army paratroops miniseries combat war in europe paratrooper 1940s Content Score 100 Yes! Looking good! Top Contributors 81 Elizabeth Jennings o 72 olecare TB 56 TMDb Bot s 34 slone  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}