{"link": "https://www.themoviedb.org/tv/42666?language=en", "title": ".hack//Legend of the Twilight Bracelet", "resume": ".hack//Legend of the Twilight is a science fiction manga series written by Tatsuya Hamazaki and drawn by Rei Izumi. The twenty-two chapters of .hack//Legend of the Twilight appeared as a serial in the Japanese magazine Comptiq, and published in three tankōbon by Kadokawa Shoten from July 2002 to April 2004. Set in a fictional MMORPG, The World, the series focuses on twins Rena and Shugo, who receive chibi avatars in the design of the legendary .hackers known as Kite and BlackRose. After Shugo is given the Twilight Bracelet by a mysterious girl, the two embark on a quest to find Aura and unravel the mystery of the Twilight Bracelet.\nThe series was adapted into a twelve episode anime of the same name directed by Koichi Mashimo and Koji Sawai, and produced by Bee Train.\nTokyopop licensed the manga series for an English-language release in North America. It published the three volumes from September 2003 to April 2004. Bandai Entertainment had licensed the anime series for North American broadcast. The word \"Bracelet\" in the title was removed in North America, shortening the title to .hack//Legend of the Twilight. Following the closure of Bandai Entertainment, Funimation announced at SDCC 2013, that they have acquired 4 .hack title including Legend of the Twilight.", "rate": 60, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Animation"], "cast": ["Junko Minagawa", "Mai Nakahara", "Ayako Kawasumi", "Nobuyuki Hiyama", "Maaya Sakamoto"], "character": ["Shugo (voice)", "Rena (voice)", "Hotaru (voice)", "Balmung (voice)", "Aura (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42666   Expand .hack//Legend of the Twilight Bracelet   (2003) User Score Overview .hack//Legend of the Twilight is a science fiction manga series written by Tatsuya Hamazaki and drawn by Rei Izumi. The twenty-two chapters of .hack//Legend of the Twilight appeared as a serial in the Japanese magazine Comptiq, and published in three tankōbon by Kadokawa Shoten from July 2002 to April 2004. Set in a fictional MMORPG, The World, the series focuses on twins Rena and Shugo, who receive chibi avatars in the design of the legendary .hackers known as Kite and BlackRose. After Shugo is given the Twilight Bracelet by a mysterious girl, the two embark on a quest to find Aura and unravel the mystery of the Twilight Bracelet. The series was adapted into a twelve episode anime of the same name directed by Koichi Mashimo and Koji Sawai, and produced by Bee Train. Tokyopop licensed the manga series for an English-language release in North America. It published the three volumes from September 2003 to April 2004. Bandai Entertainment had licensed the anime series for North American broadcast. The word \"Bracelet\" in the title was removed in North America, shortening the title to .hack//Legend of the Twilight. Following the closure of Bandai Entertainment, Funimation announced at SDCC 2013, that they have acquired 4 .hack title including Legend of the Twilight. Featured Crew Tatsuya Hamazaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junko Minagawa Shugo (voice) Mai Nakahara Rena (voice) Ayako Kawasumi Hotaru (voice) Nobuyuki Hiyama Balmung (voice) Maaya Sakamoto Aura (voice) Full Cast & Crew Last Season .hack//Legend of the Twlight 2003 | 12 Episodes Season 1 of .hack//Legend of the Twilight Bracelet premiered on January  8, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on .hack//Legend of the Twilight Bracelet. You can help by rating TV shows you've seen. Facts Original Name  .hack//黄昏の腕輪伝説 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Animation Keywords video game virtual reality cyberspace game Content Score 93 Almost there... Top Contributors W 19 Watcher14 17 BrerFox 8 Marr 🇳🇱 _ 4 _Anarchist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}