{"link": "https://www.themoviedb.org/tv/19889?language=en", "title": "Timmy Time", "resume": "Timmy Time is a British animated pre-school children's comedy series created by the BBC and Aardman Animations. It started broadcasting in the UK on CBeebies on 6 April 2009. The show is a spin off from the Shaun the Sheep animation which itself is a spin off from the Aardman series Wallace & Gromit, which introduced the character of Shaun. The first two series ran for 26 episodes. In the United Kingdom, the show's most recent run began in September 2011 on CBeebies. In Australia, season one commenced in May 2009 on ABC1 and season three started in May 2011 on ABC 4 Kids.", "rate": 53, "genre": ["Animation", "Comedy", "Kids"], "cast": ["Kate Harbour", "Justin Fletcher"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19889   Expand Timmy Time   (2009) User Score Overview Timmy Time is a British animated pre-school children's comedy series created by the BBC and Aardman Animations. It started broadcasting in the UK on CBeebies on 6 April 2009. The show is a spin off from the Shaun the Sheep animation which itself is a spin off from the Aardman series Wallace & Gromit, which introduced the character of Shaun. The first two series ran for 26 episodes. In the United Kingdom, the show's most recent run began in September 2011 on CBeebies. In Australia, season one commenced in May 2009 on ABC1 and season three started in May 2011 on ABC 4 Kids. Featured Crew Liz Whitaker Creator Jackie Cockle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Harbour Justin Fletcher Full Cast & Crew Last Season Season 3 2011 | 26 Episodes Season 3 of Timmy Time premiered on November  9, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Timmy Time. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   2007-07-08 Total Drama Island 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Danish Runtime  58m Homepage   http://www.timmytime.tv/ Genres Animation Comedy Kids Keywords friendship sheep bird animal kindergarden Content Score 64 We're so close, yet so far. Top Contributors d 21 deus-dk 21 david8s95 n 16 naka D 9 Decaliax  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}