{"link": "https://www.themoviedb.org/tv/61184?language=en", "title": "The Joseon Gunman", "resume": "It’s the 19th Century and as western influences spread across Asia, Korea’s Joseon dynasty is experiencing great upheaval and rapid modernization. As the son of the last great swordsman, Park Yoon Kang is caught between two worlds, but the sudden murder of his father and sister catapult him into the new era as he takes up the gun to avenge their deaths. However, it’s not just his family who needs his protection, but his people as well. Is Park Yoon Kang cut out to be the hero of an era?", "rate": 63, "genre": ["Action", "Adventure", "Drama"], "cast": ["Lee Joon-gi", "Nam Sang-mi", "Jeon Hye-bin", "Han Joo-wan", "Yu Oh-seong"], "character": ["Park Yoon-kang", "Jung Soo-in", "Choi Hye-won", "Kim Ho-kyung", "Choi Won-shin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61184   Expand The Joseon Gunman   (2014) User Score  Play Trailer Overview It’s the 19th Century and as western influences spread across Asia, Korea’s Joseon dynasty is experiencing great upheaval and rapid modernization. As the son of the last great swordsman, Park Yoon Kang is caught between two worlds, but the sudden murder of his father and sister catapult him into the new era as he takes up the gun to avenge their deaths. However, it’s not just his family who needs his protection, but his people as well. Is Park Yoon Kang cut out to be the hero of an era? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  14 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Joon-gi Park Yoon-kang Nam Sang-mi Jung Soo-in Jeon Hye-bin Choi Hye-won Han Joo-wan Kim Ho-kyung Yu Oh-seong Choi Won-shin Full Cast & Crew Last Season Season 1 2014 | 22 Episodes Season 1 of The Joseon Gunman premiered on June 25, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  10 Posters  14 Recommendations   2011-03-16 49 Days 8.9    2012-08-13 Faith 7.6    2016-01-11 Moorim School 6.2    2011-05-25 City Hunter 7.5    2013-06-05 I Hear Your Voice 8.2    2014-12-08 Healer 8.7    2014-11-12 Pinocchio 7.4    2010-11-13 Secret Garden 8.2  Facts Original Name  조선 총잡이 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/gunman/ Genres Action & Adventure Drama Keywords korea period drama Content Score 93 Almost there... Top Contributors M 52 Maria180493 S 19 Sergey CM 11 Cherche Moi 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}