{"link": "https://www.themoviedb.org/tv/35092?language=en", "title": "Lights Out", "resume": "Lights Out is an American television boxing drama series from the FX network in the United States. It stars Holt McCallany as Patrick \"Lights\" Leary, a New Jersey native, and former heavyweight champion boxer who is considering a comeback. The series premiered on January 11, 2011 at 10 pm ET/PT. On March 24, 2011, FX announced the cancellation of the show. The final episode aired on April 5.", "rate": 81, "genre": ["Action", "Adventure", "Drama"], "cast": ["Holt McCallany", "Stacy Keach", "Pablo Schreiber", "Catherine McCormack", "Bill Irwin"], "character": ["Patrick 'Lights' Leary", "Pops", "Johnny Leary", "Theresa Leary", "Hal Brennan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35092   Expand Lights Out   (2011) User Score  Play Trailer Overview Lights Out is an American television boxing drama series from the FX network in the United States. It stars Holt McCallany as Patrick \"Lights\" Leary, a New Jersey native, and former heavyweight champion boxer who is considering a comeback. The series premiered on January 11, 2011 at 10 pm ET/PT. On March 24, 2011, FX announced the cancellation of the show. The final episode aired on April 5. Featured Crew Justin Zackham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Holt McCallany Patrick 'Lights' Leary Stacy Keach Pops Pablo Schreiber Johnny Leary Catherine McCormack Theresa Leary Bill Irwin Hal Brennan Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Lights Out premiered on January 11, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  6 Posters  3 Recommendations   2012-09-04 World Without End 6.8    2011-10-21 Boss 7.7    2009-02-15 Eastbound & Down 7.4    2004-07-18 Entourage 7.1    2003-09-14 Carnivàle 8.1    2007-10-02 Pushing Daisies 7.8    2004-03-21 Deadwood 8.1    2013-01-15 Utopia 8.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.fxnetworks.com/shows/originals/lightsout/ Genres Action & Adventure Drama Keywords boxing Content Score 100 Yes! Looking good! Top Contributors 21 Razorback121 R 6 Rebecca s 3 speedycars c 3 cricri12230  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}