{"link": "https://www.themoviedb.org/tv/14298?language=en", "title": "WordWorld", "resume": "WordWorld is an Emmy Award-winning children's television series partially funded by the United States Department of Education as part of the Ready to Learn literacy initiative targeted to 3- to 7-year olds. The show airs in 10 languages and 90 countries, including in the United States. The television series, created by Don Moody and Jacqueline Moody, stars Dog and his WordFriends. In each episode, Dog and/or one of his friends embarks on a series of adventures where the only way to save the day is to build or un-build words. The show's novelty is that when a word is built correctly, it morphs into the thing it represents, which gives instant meaning to the word. WordWorld has been translated into popular mobile applications, Internet-based games, magnetic plush and other toys.\nWordWorld currently airs in 90 countries and 10 languages. It premiered September 3, 2007 on PBS Kids and is currently in its third season, with 84 11-minute episodes. WordWorld currently broadcasts on PBS Kids it is produced for WTTW Chicago.", "rate": 70, "genre": ["Animation", "Family", "Kids"], "cast": ["Veronica Taylor", "Marc Thompson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14298   Expand WordWorld   (2007) User Score Overview WordWorld is an Emmy Award-winning children's television series partially funded by the United States Department of Education as part of the Ready to Learn literacy initiative targeted to 3- to 7-year olds. The show airs in 10 languages and 90 countries, including in the United States. The television series, created by Don Moody and Jacqueline Moody, stars Dog and his WordFriends. In each episode, Dog and/or one of his friends embarks on a series of adventures where the only way to save the day is to build or un-build words. The show's novelty is that when a word is built correctly, it morphs into the thing it represents, which gives instant meaning to the word. WordWorld has been translated into popular mobile applications, Internet-based games, magnetic plush and other toys. WordWorld currently airs in 90 countries and 10 languages. It premiered September 3, 2007 on PBS Kids and is currently in its third season, with 84 11-minute episodes. WordWorld currently broadcasts on PBS Kids it is produced for WTTW Chicago. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Veronica Taylor Marc Thompson Full Cast & Crew Last Season Season 3 2010 | 10 Episodes Season 3 of WordWorld premiered on October  4, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on WordWorld. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 28m Homepage   http://pbskids.org/wordworld Genres Animation Family Kids Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors d 17 dwkodi15  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}