{"link": "https://www.themoviedb.org/tv/42778?language=en", "title": "Shamanic Princess", "resume": "Shamanic Princess is a Japanese anime consisting of 6 OVA episodes. It chronicles the exploits of Tiara, an agent from the Guardian World, who has been sent to Earth to recover the Throne of Yord, a mystical object which is the source of magical energy in the Guardian World.", "rate": 0, "genre": ["Animation"], "cast": ["Yamauchi Sayuri", "Rica Matsumoto", "Mitsuki Yayoi", "Hiro Yuuki", "Kouichi Yamadera"], "character": ["Tiara", "Japolo / Graham", "Lena", "Leon", "Kagetsu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42778   Expand Shamanic Princess   (1996) User Score  Play Trailer Overview Shamanic Princess is a Japanese anime consisting of 6 OVA episodes. It chronicles the exploits of Tiara, an agent from the Guardian World, who has been sent to Earth to recover the Throne of Yord, a mystical object which is the source of magical energy in the Guardian World. Featured Crew Mami Watanabe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yamauchi Sayuri Tiara Rica Matsumoto Japolo / Graham Mitsuki Yayoi Lena Hiro Yuuki Leon Kouichi Yamadera Kagetsu Full Cast & Crew Last Season Season 1 1996 | 6 Episodes Season 1 of Shamanic Princess premiered on June  7, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Shamanic Princess. You can help by rating TV shows you've seen. Facts Original Name  シャーマニックプリンセス Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Miniseries Original Language  Japanese Runtime  30m Homepage   http://www.shamanicprincess.com/ Genres Animation Keywords magical girl anime Content Score 100 Yes! Looking good! Top Contributors 46 Jack Duiz 4 BlackDelivery TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}