{"link": "https://www.themoviedb.org/tv/59659?language=en", "title": "Halt and Catch Fire", "resume": "Set in the early 1980s, and about a fictional visionary, an engineer and a prodigy whose innovations confronts the corporate behemoths of the time. Their personal and professional partnership will be challenged by greed and ego while charting the changing culture in Texas' Silicon Prairie.", "rate": 79, "genre": ["Drama"], "cast": ["Lee Pace", "Scoot McNairy", "Mackenzie Davis", "Kerry Bishé", "Toby Huss"], "character": ["Joe MacMillan", "Gordon Clark", "Cameron Howe", "Donna Clark", "John Bosworth"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59659   Expand Halt and Catch Fire   (2014) User Score  Play Trailer Overview Set in the early 1980s, and about a fictional visionary, an engineer and a prodigy whose innovations confronts the corporate behemoths of the time. Their personal and professional partnership will be challenged by greed and ego while charting the changing culture in Texas' Silicon Prairie. Featured Crew Christopher Cantwell Creator Christopher C. Rogers Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  2 Images Backdrops  19 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  3 Opening Credits  1 Top Billed Cast Lee Pace Joe MacMillan Scoot McNairy Gordon Clark Mackenzie Davis Cameron Howe Kerry Bishé Donna Clark Toby Huss John Bosworth Full Cast & Crew Last Season Season 4 2017 | 10 Episodes Season 4 of Halt and Catch Fire premiered on August 19, 2017. View All Seasons Social Reviews  1 Discussions  10 A review by Benedict  9.0 Written by  Benedict  on March  2, 2017 Perhaps the best show on television. I found myself a new favourite among TV series. Exceedingly strong performances from the whole cast, a gripping, dynamic plot, and script and direction that will have you laughing aloud before hunkering at the edge of your seat. As TV goes, I honestly don’t think it gets much better than this. The character of Joe MacMillan is just unrivalled in complexity and depth. Lee Pace is beyond magnetic in the role, he’s electric, and the writers recognise that and use it beautifully. The storylines are broad, sweeping and powerful, skipping triviality in f...  read the rest. Read All Reviews Media Most Popular Videos  5 Backdrops  19 Posters  9 Recommendations   2013-04-22 Rectify 7.6    2014-04-06 TURN: Washington's Spies 7.4    2012-06-24 The Newsroom 7.8    2007-07-19 Mad Men 8.0    2014-08-08 The Knick 7.5    2015-01-15 The Man in the High Castle 7.5    2013-01-11 Banshee 7.9    2013-09-29 Masters of Sex 6.6  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m, 60m, 45m, 43m, 47m Homepage   http://www.amctv.com/shows/halt-and-catch-fire Genres Drama Keywords computer nerd period drama laptop laptop computer ibm 1980s informatics Content Score 100 Yes! Looking good! Top Contributors 66 Elizabeth Jennings 28 Travis Bell 19 Razze 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}