{"link": "https://www.themoviedb.org/tv/38560?language=en", "title": "Gosick", "resume": "Gosick is a Japanese light novel series by Kazuki Sakuraba, published by Fujimi Shobo. Set in a fictional European country in 1924, a Japanese exchange student meets a mysterious, brilliant girl who only leaves the library to sleep. Her brother, a detective, relies on her exceptional mind to solve difficult mysteries.\nTokyopop released the first novel in the series in English in April 2008 and the second in March 2010. The series has been published in Germany by Tokyopop since November 2006. A manga adaptation started serialization in the shōnen manga magazine Monthly Dragon Age on December 9, 2007. An anime adaptation by Bones premiered on January 7, 2011. Crunchyroll simulcasted the animation during its Japanese broadcast and continues to webcast it. At Otakon 2011 Bandai Entertainment announced that they would release the series in North America. In January 2012 Bandai Entertainment announced that they will withdraw from the North American market, and GOSICK's North American release was cancelled.", "rate": 73, "genre": ["Animation", "Drama", "Mystery"], "cast": ["Miyuki Sawashiro", "Takuya Eguchi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38560   Expand Gosick   (2011) User Score Overview Gosick is a Japanese light novel series by Kazuki Sakuraba, published by Fujimi Shobo. Set in a fictional European country in 1924, a Japanese exchange student meets a mysterious, brilliant girl who only leaves the library to sleep. Her brother, a detective, relies on her exceptional mind to solve difficult mysteries. Tokyopop released the first novel in the series in English in April 2008 and the second in March 2010. The series has been published in Germany by Tokyopop since November 2006. A manga adaptation started serialization in the shōnen manga magazine Monthly Dragon Age on December 9, 2007. An anime adaptation by Bones premiered on January 7, 2011. Crunchyroll simulcasted the animation during its Japanese broadcast and continues to webcast it. At Otakon 2011 Bandai Entertainment announced that they would release the series in North America. In January 2012 Bandai Entertainment announced that they will withdraw from the North American market, and GOSICK's North American release was cancelled. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyuki Sawashiro Takuya Eguchi Full Cast & Crew Last Season Season 1 2011 | 24 Episodes Season 1 of Gosick premiered on January  7, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on Gosick. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.gosick.tv/ Genres Animation Drama Mystery Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors J 5 JeremyRogers 4 yoshizuka m 3 magoozin s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}