{"link": "https://www.themoviedb.org/tv/45944?language=en", "title": "My Little Nightmare", "resume": "Akumu-chan is a 2012 Japanese television drama series. Based on the novel Yume Chigai by Riku Onda, this television series stars actress Keiko Kitagawa and singer Gackt also child actress Manatsu Kimura. A movie was announced for 2014.\nThis television series was broadcast in Japan from October 13, 2012 to December 22, 2012 as part of Nippon Television's Saturday Dramas time slot, which airs every Saturday from 9pm to 9:54pm. In addition it was simulcast on the streaming service Crunchyroll under the title My Little Nightmare in the U.S., Canada, United Kingdom, Ireland, South Africa, Australia, and New Zealand.", "rate": 70, "genre": ["Drama", "Comedy", "Sci-Fi", "Fantasy", "Mystery"], "cast": ["Keiko Kitagawa", "Yuka", "Fuuka Haruna", "Kokoro Hirasawa", "Manatsu Kimura"], "character": ["Mutoi Ayami", "Hirashima Kotoba", "Ayami", "Koto Yuiko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45944   Expand My Little Nightmare   (2012) User Score Overview Akumu-chan is a 2012 Japanese television drama series. Based on the novel Yume Chigai by Riku Onda, this television series stars actress Keiko Kitagawa and singer Gackt also child actress Manatsu Kimura. A movie was announced for 2014. This television series was broadcast in Japan from October 13, 2012 to December 22, 2012 as part of Nippon Television's Saturday Dramas time slot, which airs every Saturday from 9pm to 9:54pm. In addition it was simulcast on the streaming service Crunchyroll under the title My Little Nightmare in the U.S., Canada, United Kingdom, Ireland, South Africa, Australia, and New Zealand. Featured Crew Yumechigae Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keiko Kitagawa Mutoi Ayami Yuka Hirashima Kotoba Fuuka Haruna Kokoro Hirasawa Ayami Manatsu Kimura Koto Yuiko Full Cast & Crew Last Season Season 1 2012 | 11 Episodes Season 1 of My Little Nightmare premiered on October 13, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Little Nightmare. You can help by rating TV shows you've seen. Facts Original Name  悪夢ちゃん Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.ntv.co.jp/akumu/ Genres Drama Comedy Sci-Fi & Fantasy Mystery Keywords japan Content Score 93 Almost there... Top Contributors 29 Sergiojamon M 13 Maria180493 A 4 Aka75 2 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}