{"link": "https://www.themoviedb.org/tv/62160?language=en", "title": "Raised by Wolves", "resume": "Set on a Wolverhampton council estate, Raised By Wolves is modern day reimagining of the childhood of Caitlin Moran and her brothers and sisters.\nSingle-mum Della lives in a three bedroom council house with Germaine, Aretha, Yoko, Mariah, Wyatt and baby Cher. She is attempting to raise the children by herself, but does have visits from Grampy, who likes to come around to dispense his wisdom to his grandchildren.", "rate": 72, "genre": ["Comedy"], "cast": ["Helen Monks", "Alexa Davies", "Molly Risker", "Caden Ellis Wall", "Rebekah Staton"], "character": ["Germaine Garry", "Aretha Garry", "Yoko Garry", "Wyatt Garry", "Grampy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62160   Expand Raised by Wolves   (2015) User Score Overview Set on a Wolverhampton council estate, Raised By Wolves is modern day reimagining of the childhood of Caitlin Moran and her brothers and sisters. Single-mum Della lives in a three bedroom council house with Germaine, Aretha, Yoko, Mariah, Wyatt and baby Cher. She is attempting to raise the children by herself, but does have visits from Grampy, who likes to come around to dispense his wisdom to his grandchildren. Featured Crew Caroline Moran Creator Caitlin Moran Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Helen Monks Germaine Garry Alexa Davies Aretha Garry Molly Risker Yoko Garry Caden Ellis Wall Wyatt Garry Rebekah Staton Grampy Full Cast & Crew Last Season season 2 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Raised by Wolves. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  24m Homepage   http://www.channel4.com/programmes/raised-by-wolves Genres Comedy Keywords hippie lifestyle single mother family Content Score 93 Almost there... Top Contributors 30 Elizabeth Jennings w 27 wolff92 6 Nero Kosonen 4 Markxist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}