{"link": "https://www.themoviedb.org/tv/63859?language=en", "title": "Run", "resume": "Four gritty no-holds-barred human stories of the streets, all linked together in some respect.", "rate": 67, "genre": [], "cast": ["Katharina Schüttler", "Katie Leung", "Olivia Colman", "Lennie James", "Chris Jarman"], "character": ["Kasia", "Ying", "Carol", "Richard", "DC Burgess"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63859   Expand Run   (2013) User Score Overview Four gritty no-holds-barred human stories of the streets, all linked together in some respect. Featured Crew Marlon Smith Creator Daniel Fajemisin-Duncan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katharina Schüttler Kasia Katie Leung Ying Olivia Colman Carol Lennie James Richard Chris Jarman DC Burgess Full Cast & Crew Last Season Season 1 2013 | 4 Episodes Season 1 of Run premiered on July 15, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations   2008-03-10 The Fixer 7.6    2007-09-17 K-Ville 6.7    2002-11-14 Wire in the Blood 7.5    2013-02-19 Cult 4.2    2010-08-27 The Booth at the End 8.1    2012-10-11 Copper 6.0    2014-09-04 Chasing Shadows 7.5    2011-05-05 The Shadow Line 8.1  Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords miniseries Content Score 71 Just a little bit more... Top Contributors TB 17 TMDb Bot 7 Banana 4 theefallen 2 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}