{"link": "https://www.themoviedb.org/tv/10662?language=en", "title": "The Big Gay Sketch Show", "resume": "The Big Gay Sketch Show is an LGBT-themed sketch comedy program that debuted on Logo on April 24, 2007. The series is produced by Rosie O'Donnell and directed by Amanda Bearse. The program was originally titled \"The Big Gay Show\" but was renamed during production. As the name indicates, the show features comedy sketches with gay themes or a gay twist. Sketch topics include parodies of old sitcoms like The Honeymooners and The Facts of Life under the Nick at Nite-parodying heading \"Logo at Nite\", a lesbian speed dating session and an extended send-up of Broadway legend Elaine Stritch working as a Wal-Mart greeter, among other decidedly un-glamorous jobs.\nLogo produced a second season of the series. Paolo Andino and Colman Domingo joined the cast. Season 2 premiered on February 5, 2008.\nProduction on season three began in March 2009. Erica Ash is no longer with the cast. In 2009, Logo announced plans for a search for new cast members. However, the result entitled, \"The Big Gay Casting Competition\", was limited to an online talent search, in which videos by contestants were uploaded to logoonline.com and voted on by site visitors. The winner, Wil Heuser, was a former American Idol contestant, who appeared in only one episode of the series, but as an extra, not a cast member. Season three debuted on Logo April 13, 2010.", "rate": 0, "genre": ["Comedy"], "cast": ["Amanda Bearse", "Colman Domingo", "Nicol Paone", "Stephen Guarino", "Julie Goldman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10662   Expand The Big Gay Sketch Show   (2007) User Score Overview The Big Gay Sketch Show is an LGBT-themed sketch comedy program that debuted on Logo on April 24, 2007. The series is produced by Rosie O'Donnell and directed by Amanda Bearse. The program was originally titled \"The Big Gay Show\" but was renamed during production. As the name indicates, the show features comedy sketches with gay themes or a gay twist. Sketch topics include parodies of old sitcoms like The Honeymooners and The Facts of Life under the Nick at Nite-parodying heading \"Logo at Nite\", a lesbian speed dating session and an extended send-up of Broadway legend Elaine Stritch working as a Wal-Mart greeter, among other decidedly un-glamorous jobs. Logo produced a second season of the series. Paolo Andino and Colman Domingo joined the cast. Season 2 premiered on February 5, 2008. Production on season three began in March 2009. Erica Ash is no longer with the cast. In 2009, Logo announced plans for a search for new cast members. However, the result entitled, \"The Big Gay Casting Competition\", was limited to an online talent search, in which videos by contestants were uploaded to logoonline.com and voted on by site visitors. The winner, Wil Heuser, was a former American Idol contestant, who appeared in only one episode of the series, but as an extra, not a cast member. Season three debuted on Logo April 13, 2010. Featured Crew Rosie O'Donnell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Bearse Colman Domingo Nicol Paone Stephen Guarino Julie Goldman Full Cast & Crew Last Season Season 3 2010 | 9 Episodes Season 3 of The Big Gay Sketch Show premiered on April 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Big Gay Sketch Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.logotv.com/shows/big_gay_sketch_show/season_1/series.jhtml Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}