{"link": "https://www.themoviedb.org/tv/62777?language=en", "title": "Open Slather", "resume": "The biggest names in Australian comedy are joining forces with a group of rising new stars for Open Slather, Foxtel’s highly anticipated, original production. Creating a comedy ‘hot pot’, Open Slather casts a satirical eye across the pop culture landscape and combines the talents of comedy legends who have made us laugh for years, (Glenn Robbins, Magda Szubanski, Shane Jacobson, Marg Downey, Gina Riley, Stephen Curry, Michael Veitch and Jane Turner) with 12 rising stars including Ben Gerrard, Ben Lomas, Dave Eastgate, Demi Lardner, Emily Taheny, George H. Xanthis, Hannah Bath, Holly Austin, Ilai Swindells, Jay K Cagatay, Laura Hughes and Miles O’Neil. Filmed in Melbourne, Open Slather will be a no holds barred send up of popular culture, politics, sport, music and media – all the things that capture the imagination of the public and get people laughing.", "rate": 0, "genre": ["Comedy"], "cast": ["Magda Szubanski", "Jane Turner", "Gina Riley", "Glenn Robbins", "Stephen Curry"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62777   Expand Open Slather   (2015) User Score Overview The biggest names in Australian comedy are joining forces with a group of rising new stars for Open Slather, Foxtel’s highly anticipated, original production. Creating a comedy ‘hot pot’, Open Slather casts a satirical eye across the pop culture landscape and combines the talents of comedy legends who have made us laugh for years, (Glenn Robbins, Magda Szubanski, Shane Jacobson, Marg Downey, Gina Riley, Stephen Curry, Michael Veitch and Jane Turner) with 12 rising stars including Ben Gerrard, Ben Lomas, Dave Eastgate, Demi Lardner, Emily Taheny, George H. Xanthis, Hannah Bath, Holly Austin, Ilai Swindells, Jay K Cagatay, Laura Hughes and Miles O’Neil. Filmed in Melbourne, Open Slather will be a no holds barred send up of popular culture, politics, sport, music and media – all the things that capture the imagination of the public and get people laughing. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Magda Szubanski Jane Turner Gina Riley Glenn Robbins Stephen Curry Full Cast & Crew Last Season Season 1 2015 | 14 Episodes Season 1 of Open Slather premiered on May 24, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Open Slather. You can help by rating TV shows you've seen. Facts Status  Returning Series Network The Comedy Channel Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://thecomedychannel.com.au/shows/open-slather/ Genres Comedy Keywords sketch comedy Content Score 86 Almost there... Top Contributors c 17 courtneysmith86 8 Elizabeth Jennings 6 Banana tj 2 tatah junior  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}