{"link": "https://www.themoviedb.org/tv/67345?language=en", "title": "Thunderbolt Fantasy", "resume": "In an Eastern-styled fantasy setting, a brother and sister team of sacred guardians is beset by the Xuan Gui Zong, minions of Miè Tian Hai, who seeks the Tian Xing Jiàn sword that they possess. Hai showing up himself leads to the defeat of the brother, but his sister, Dan Fei, jumps off a cliff to temporary safety. Later, a wandering swordsman comes across a ruined temple where a statue of Buddha is protected by an umbrella against the rain. When he takes the umbrella for himself, a man resting under a tree nearby informs him the he must be compassionate to the next traveler he meets as trade-off for taking the umbrella. But the next traveler is Dan Fei, who is still being pursue by the Xuan Gui Zong minions, and between that and the sorcery of the other man he finds himself unable to avoid getting involved.", "rate": 0, "genre": ["Drama", "Action", "Adventure", "Animation"], "cast": ["Junichi Suwabe", "Kohsuke Toriumi", "Mai Nakahara", "Daisuke Hirakawa", "Rikiya Koyama"], "character": ["Shāng Bù Huàn (Voice)", "Lǐn Xuě Yā (Voice)", "Dān Fěi (Voice)", "Dān Héng (Voice)", "Shòu Yún Xiāo (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67345   Expand Thunderbolt Fantasy   (2016) User Score Overview In an Eastern-styled fantasy setting, a brother and sister team of sacred guardians is beset by the Xuan Gui Zong, minions of Miè Tian Hai, who seeks the Tian Xing Jiàn sword that they possess. Hai showing up himself leads to the defeat of the brother, but his sister, Dan Fei, jumps off a cliff to temporary safety. Later, a wandering swordsman comes across a ruined temple where a statue of Buddha is protected by an umbrella against the rain. When he takes the umbrella for himself, a man resting under a tree nearby informs him the he must be compassionate to the next traveler he meets as trade-off for taking the umbrella. But the next traveler is Dan Fei, who is still being pursue by the Xuan Gui Zong minions, and between that and the sorcery of the other man he finds himself unable to avoid getting involved. Featured Crew Gen Urobuchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junichi Suwabe Shāng Bù Huàn (Voice) Kohsuke Toriumi Lǐn Xuě Yā (Voice) Mai Nakahara Dān Fěi (Voice) Daisuke Hirakawa Dān Héng (Voice) Rikiya Koyama Shòu Yún Xiāo (Voice) Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Thunderbolt Fantasy premiered on July  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Thunderbolt Fantasy. You can help by rating TV shows you've seen. Facts Original Name  Thunderbolt Fantasy -東離劍遊紀 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.thunderboltfantasy.com/ Genres Drama Action & Adventure Animation Keywords wuxia puppet theater Content Score 93 Almost there... Top Contributors KL 32 Kristian Larsson 9 Elizabeth Jennings G 8 Giaten 6 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}