{"link": "https://www.themoviedb.org/tv/13712?language=en", "title": "Oswald", "resume": "Oswald is an American children's cartoon series on Nick Jr. about a blue octopus and his friends, that first aired August 20, 2001 and officially ended in early 2004. The show was created by Dan Yaccarino and was co-produced by HiT Entertainment. It was also shown on Noggin in reruns. The show aired on Nick Jr. on CBS on September 22, 2001, to September 7, 2002. Nick Jr. aired the original episodes until the network lineup changes on March 1, 2012 took effect. It also airs on the British channel \"JimJam\" which is shown in numerous countries including Israel. In addition, the Indian channel Zee TV currently airs a Hindi dubbed version. It is also telecast on Indian channel Pogo as a Hindi dubbed version.", "rate": 68, "genre": ["Animation"], "cast": ["Crystal Scales", "Fred Savage", "David L. Lander", "Debi Derryberry", "Laraine Newman"], "character": ["Oswald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13712   Expand Oswald   (2001) User Score Overview Oswald is an American children's cartoon series on Nick Jr. about a blue octopus and his friends, that first aired August 20, 2001 and officially ended in early 2004. The show was created by Dan Yaccarino and was co-produced by HiT Entertainment. It was also shown on Noggin in reruns. The show aired on Nick Jr. on CBS on September 22, 2001, to September 7, 2002. Nick Jr. aired the original episodes until the network lineup changes on March 1, 2012 took effect. It also airs on the British channel \"JimJam\" which is shown in numerous countries including Israel. In addition, the Indian channel Zee TV currently airs a Hindi dubbed version. It is also telecast on Indian channel Pogo as a Hindi dubbed version. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Crystal Scales Fred Savage Oswald David L. Lander Debi Derryberry Laraine Newman Full Cast & Crew Last Season Season 1 2001 | 52 Episodes Season 1 of Oswald premiered on August 20, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2007-04-05 Bakugan Battle Brawlers 4.6    2008-04-18 Ben 10: Alien Force 6.1    2010-04-23 Ben 10: Ultimate Alien 6.1    1999-04-12 Bob the Builder 5.5    2005-12-27 Ben 10 6.2    2000-09-23 Static Shock 7.1    2005-01-21 American Dragon: Jake Long 5.9    2007-08-17 Phineas and Ferb 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 Banana R 2 Rebecca S 1 Samara 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}