{"link": "https://www.themoviedb.org/tv/9464?language=en", "title": "Queenie's Castle", "resume": "The lives and, often illegal, activities of the residents of a tower block in early 1970s Leeds, West Yorkshire, with the brassy matriarch, Queenie Shepherd, ruling the roost over her neighbours.", "rate": 70, "genre": ["Comedy"], "cast": ["Diana Dors", "Freddie Fletcher", "Brian Marshall", "Barrie Rutter", "Tony Caunter"], "character": ["Queenie Shepherd", "Raymond Herbert Shepherd", "Bernard Anthony \"Bunny\" Shepherd", "Douglas Fairbanks Shepherd", "Jack Henry Shepherd"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9464   Expand Queenie's Castle   (1970) User Score Overview The lives and, often illegal, activities of the residents of a tower block in early 1970s Leeds, West Yorkshire, with the brassy matriarch, Queenie Shepherd, ruling the roost over her neighbours. Featured Crew Keith Waterhouse Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diana Dors Queenie Shepherd Freddie Fletcher Raymond Herbert Shepherd Brian Marshall Bernard Anthony \"Bunny\" Shepherd Barrie Rutter Douglas Fairbanks Shepherd Tony Caunter Jack Henry Shepherd Full Cast & Crew Last Season Season 3 1972 | 6 Episodes Season 3 of Queenie's Castle premiered on August  1, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Queenie's Castle. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords mother northern england yorkshire family tower block sitcom british humour Content Score 79 Pump it up! We're close now. Top Contributors O 16 Ozbourne H 9 HelloCharlie 5 lineker 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}