{"link": "https://www.themoviedb.org/tv/43070?language=en", "title": "Riverworld", "resume": "Riverworld is a television film released on the Syfy channel on April 18, 2010. Based on the Riverworld books by Philip José Farmer, the made-for-TV film is a reboot of the aborted Sci-Fi Channel Riverworld television series, of which only the pilot episode was produced.\nRiverworld stars Tahmoh Penikett, Laura Vandervoort, Jeananne Goossen, Alan Cumming, Mark Deklin, and Peter Wingfield. It is produced by Reunion Pictures, an award-winning Canadian-based production company. It is written by Robert Hewitt Wolfe and directed by Stuart Gillard.", "rate": 33, "genre": [], "cast": ["Tahmoh Penikett", "Laura Vandervoort", "Kwesi Ameyaw", "Mark Deklin", "Matty Finochio"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43070   Expand Riverworld   (2010) User Score Overview Riverworld is a television film released on the Syfy channel on April 18, 2010. Based on the Riverworld books by Philip José Farmer, the made-for-TV film is a reboot of the aborted Sci-Fi Channel Riverworld television series, of which only the pilot episode was produced. Riverworld stars Tahmoh Penikett, Laura Vandervoort, Jeananne Goossen, Alan Cumming, Mark Deklin, and Peter Wingfield. It is produced by Reunion Pictures, an award-winning Canadian-based production company. It is written by Robert Hewitt Wolfe and directed by Stuart Gillard. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tahmoh Penikett Laura Vandervoort Kwesi Ameyaw Mark Deklin Matty Finochio Full Cast & Crew Last Season Season 1 2010 | 2 Episodes Season 1 of Riverworld premiered on April 18, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Riverworld. You can help by rating TV shows you've seen. Facts Status  In Production Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 5 jokebume 3 sp1ti s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}