{"link": "https://www.themoviedb.org/tv/78906?language=en", "title": "Hitoshi Matsumoto Presents Documental", "resume": "Ten comedians are pitted against each other in a closed room with the objective to make each other laugh. The last person to stay in the room without laughing wins and is awarded a 10 million yen prize and bragging rights as the funniest comedian.", "rate": 0, "genre": ["Comedy"], "cast": ["Hitoshi Matsumoto"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78906   Expand Hitoshi Matsumoto Presents Documental   (2016) User Score Overview Ten comedians are pitted against each other in a closed room with the objective to make each other laugh. The last person to stay in the room without laughing wins and is awarded a 10 million yen prize and bragging rights as the funniest comedian. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hitoshi Matsumoto Full Cast & Crew Current Season Season 5 2018 | 5 Episodes Season 5 of Hitoshi Matsumoto Presents Documental premiered on April 20, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hitoshi Matsumoto Presents Documental. You can help by rating TV shows you've seen. Facts Original Name  HITOSHI MATSUMOTO Presents ドキュメンタル Status  Returning Series Network Certification NR Meaning No rating information Type  Reality Original Language  Japanese Runtime  40m Homepage   https://www.amazon.co.jp/dp/B01N677USQ/ Genres Comedy Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors S 43 SonofUgly 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}