{"link": "https://www.themoviedb.org/tv/34131?language=en", "title": "El Gran Sushi", "resume": "Mister Ajikko is a Japanese manga series written and illustrated by Daisuke Terasawa about a young boy cook. It was later adapted into anime series, produced by TV Tokyo and Sunrise. This show was broadcast from October 8, 1987 to September 28, 1989 with a total of 99 episodes. One of the earliest cooking/battle related manga and anime of its kind, there are some indications that this series is the inspiration for the live action competitive cooking show, Iron Chef.", "rate": 0, "genre": ["Animation"], "cast": ["Minami Takayama", "Chieko Honda", "Takkou Ishimori", "Saeko Shimazu", "Takaya Hashi"], "character": ["Youichi Ajiyoshi", "Minmin", "Bravo Ojisan", "Shoukichi", "Robot Cook Sally"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34131   Expand El Gran Sushi   (1987) User Score Overview Mister Ajikko is a Japanese manga series written and illustrated by Daisuke Terasawa about a young boy cook. It was later adapted into anime series, produced by TV Tokyo and Sunrise. This show was broadcast from October 8, 1987 to September 28, 1989 with a total of 99 episodes. One of the earliest cooking/battle related manga and anime of its kind, there are some indications that this series is the inspiration for the live action competitive cooking show, Iron Chef. Featured Crew Yasuhiro Imagawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Minami Takayama Youichi Ajiyoshi Chieko Honda Minmin Takkou Ishimori Bravo Ojisan Saeko Shimazu Shoukichi Takaya Hashi Robot Cook Sally Full Cast & Crew Last Season Season 1 1987 | 99 Episodes Season 1 of El Gran Sushi premiered on October  8, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for El Gran Sushi. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on El Gran Sushi. You can help by rating TV shows you've seen. Facts Original Name  Mister Ajikko Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors R 6 RoadtoParadise O 4 OnNeVitQue2FoisJB 2 TheDerpMan 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}