{"link": "https://www.themoviedb.org/tv/68387?language=en", "title": "Estocolmo", "resume": "\"Stockholm: Lost Identity\" narrates over 13 chapters with almost surgical detail the criminal, judicial and media research about the disappearance of a young woman by a network of trafficking. An attorney general, an undercover agent and a journalist will be immersed in a police plot that mixes suspense, drama and action where law and justice are two different sides of the same coin.", "rate": 60, "genre": ["Drama", "Crime"], "cast": ["Juana Viale"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68387   Expand Estocolmo   (2016) User Score  Play Trailer Overview \"Stockholm: Lost Identity\" narrates over 13 chapters with almost surgical detail the criminal, judicial and media research about the disappearance of a young woman by a network of trafficking. An attorney general, an undercover agent and a journalist will be immersed in a police plot that mixes suspense, drama and action where law and justice are two different sides of the same coin. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Juana Viale Full Cast & Crew Last Season Season 1 2016 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Estocolmo. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Spanish; Castilian Runtime  42m Homepage   https://www.netflix.com/title/80118346 Genres Drama Crime Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 14 joeynotjoe 7 Razorback121 z 5 zurman1 t 3 tmdb59661364  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}