{"link": "https://www.themoviedb.org/tv/34110?language=en", "title": "The Kabocha Wine", "resume": "The Kabocha Wine is a Japanese manga series written and illustrated by Mitsuru Miura. It was serialized in Kodansha's Weekly Shōnen Magazine from 1981 to 1984. The Kabocha Wine received the 1983 Kodansha Manga Award for the shōnen category.\nThe sequel to the manga, The Kabocha Wine - Sequel is a one-shot manga published by Seirindo on October 15, 2006.\nThe third series of the manga, The Kabocha Wine - Another is published by Akita Shoten.\nIt has been adapted into an 95 episode anime series by Toei Animation.\nThe sequel to the anime was in the form of an animated movie, called The Kabocha Wine: Nita no Aijou Monogatari, which was released on July 14, 1984 by Toei Animation.\nOn October 26, 2007, wint released a DVD for the live-action movie adaptation of the third manga series, called The Kabocha Wine - Another. Directed by Hitoshi Ishikawa, the movie starred Yoko Kumada.", "rate": 0, "genre": ["Animation"], "cast": ["Toshio Furukawa", "Tomiko Suzuki", "Keiko Yokozawa", "Yūko Mita", "Banjou Ginga"], "character": ["Shunsuke Aoba", "Madoka", "Eru", "Kouhei", "Dekkin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34110   Expand The Kabocha Wine   (1982) User Score Overview The Kabocha Wine is a Japanese manga series written and illustrated by Mitsuru Miura. It was serialized in Kodansha's Weekly Shōnen Magazine from 1981 to 1984. The Kabocha Wine received the 1983 Kodansha Manga Award for the shōnen category. The sequel to the manga, The Kabocha Wine - Sequel is a one-shot manga published by Seirindo on October 15, 2006. The third series of the manga, The Kabocha Wine - Another is published by Akita Shoten. It has been adapted into an 95 episode anime series by Toei Animation. The sequel to the anime was in the form of an animated movie, called The Kabocha Wine: Nita no Aijou Monogatari, which was released on July 14, 1984 by Toei Animation. On October 26, 2007, wint released a DVD for the live-action movie adaptation of the third manga series, called The Kabocha Wine - Another. Directed by Hitoshi Ishikawa, the movie starred Yoko Kumada. Featured Crew Mitsuru Miura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshio Furukawa Shunsuke Aoba Tomiko Suzuki Madoka Keiko Yokozawa Eru Yūko Mita Kouhei Banjou Ginga Dekkin Full Cast & Crew Last Season Season 1 1982 | 95 Episodes Season 1 of The Kabocha Wine premiered on July  5, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Kabocha Wine. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors SL 4 Steven LEGUIN  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}