{"link": "https://www.themoviedb.org/tv/17937?language=en", "title": "Ghost Adventures", "resume": "Paranormal investigator Zak Bagans and his crew, Nick Groff and Aaron Goodwin, search for haunted locations both domestically and internationally. During their investigations, Zak and crew acquaint themselves with the general area; interview locals about the hauntings; and go face-to-face with the evil spirits who reportedly haunt these locations.", "rate": 70, "genre": ["Documentary", "Mystery", "Reality"], "cast": ["Zak Bagans", "Aaron Goodwin", "Billy Tolley", "Jay Wasley"], "character": ["Investigator", "Camera, investigator", "Equipment Tech, Investigator", "Camera , Investigator, Sound Technician"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17937   Expand Ghost Adventures   (2008) User Score  Play Trailer Overview Paranormal investigator Zak Bagans and his crew, Nick Groff and Aaron Goodwin, search for haunted locations both domestically and internationally. During their investigations, Zak and crew acquaint themselves with the general area; interview locals about the hauntings; and go face-to-face with the evil spirits who reportedly haunt these locations. Featured Crew Zak Bagans Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zak Bagans Investigator Aaron Goodwin Camera, investigator Billy Tolley Equipment Tech, Investigator Jay Wasley Camera , Investigator, Sound Technician Full Cast & Crew Current Season Season 16 2018 | 7 Episodes Season 16 of Ghost Adventures premiered on March 24, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  8 Recommendations   2008-01-09 Ghost Hunters International 6.8    Ghost Adventures: Aftershocks 7.0    2007-06-06 Destination Truth 7.6    2002-10-31 Most Haunted Live! 6.0    2013-05-04 My Haunted House 5.6    2004-07-05 UFO Files 7.3    2007-12-10 Paranormal State 5.7    2012-07-03 Haunted Highway 5.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  45m, 60m Homepage   http://www.travelchannel.com/TV_Shows/Ghost_Adventures/ Genres Documentary Mystery Reality Keywords paranormal Content Score 100 Yes! Looking good! Top Contributors 30 Elizabeth Jennings 23 Banana T 13 Trade 13 nspedenfallss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}