{"link": "https://www.themoviedb.org/tv/69644?language=en", "title": "Two Spirits Love", "resume": "The title speaks of Mario’s character who’s a businessman and has a condition, he loses his memory and becomes someone who is the complete opposite of his former self and only remembers Mint or someone who looks like Mint, and we’ll get to see how he plays two different personalities while trying to figure out his real self, and come to term with this new revelation. Thus the ‘two spirits’ love.’", "rate": 0, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Mario Maurer", "Chalida Vijitvongtong", "Kawin Imanothai", "Chatphong Natthaphong", "Non Thanalop"], "character": ["Tharatorn/Warong", "Kewalin / \"Kaew\"", "Korn", "Pu", "Mor Krit"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69644   Expand Two Spirits Love   (2015) User Score Overview The title speaks of Mario’s character who’s a businessman and has a condition, he loses his memory and becomes someone who is the complete opposite of his former self and only remembers Mint or someone who looks like Mint, and we’ll get to see how he plays two different personalities while trying to figure out his real self, and come to term with this new revelation. Thus the ‘two spirits’ love.’ Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mario Maurer Tharatorn/Warong Chalida Vijitvongtong Kewalin / \"Kaew\" Kawin Imanothai Korn Chatphong Natthaphong Pu Non Thanalop Mor Krit Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Two Spirits Love premiered on October  7, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Two Spirits Love. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Two Spirits Love. You can help by rating TV shows you've seen. Facts Original Name  สองหัวใจนี้เพื่อเธอ Status  Ended Network Certification  - Type  Scripted Original Language  Thai Runtime  110m Homepage  - Genres Comedy Drama Sci-Fi & Fantasy Keywords supernatural romance Content Score 86 Almost there... Top Contributors G 22 GregLikesTV 6 mariilakorn21 z 6 zurman1 5 Sven-Erik Andersen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}