{"link": "https://www.themoviedb.org/tv/3226?language=en", "title": "The Martian Chronicles", "resume": "The Martian Chronicles is a television miniseries based on Ray Bradbury's The Martian Chronicles and dealing with the exploration of Mars and the inhabitants there. The series starred Rock Hudson, Darren McGavin, Bernadette Peters, Roddy McDowall, Barry Morse, and Maria Schell. It was aired on NBC in January 1980 in three episodes with a total running time of just over four hours.\nBradbury found the miniseries \"just boring\".\nThe script differs significantly from Bradbury's original novel from the 1940s, see episode summary below.", "rate": 39, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Rock Hudson", "Christopher Connelly", "Darren McGavin", "Roddy McDowall", "Nicholas Hammond"], "character": ["Col. John Wilder", "Ben Driscoll", "Sam Parkhill", "Father Stone", "Commander Arthur Black"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3226   Expand The Martian Chronicles   (1980) User Score  Play Trailer Overview The Martian Chronicles is a television miniseries based on Ray Bradbury's The Martian Chronicles and dealing with the exploration of Mars and the inhabitants there. The series starred Rock Hudson, Darren McGavin, Bernadette Peters, Roddy McDowall, Barry Morse, and Maria Schell. It was aired on NBC in January 1980 in three episodes with a total running time of just over four hours. Bradbury found the miniseries \"just boring\". The script differs significantly from Bradbury's original novel from the 1940s, see episode summary below. Featured Crew Ray Bradbury Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rock Hudson Col. John Wilder Christopher Connelly Ben Driscoll Darren McGavin Sam Parkhill Roddy McDowall Father Stone Nicholas Hammond Commander Arthur Black Full Cast & Crew Last Season Season 1 1980 | 3 Episodes Season 1 of The Martian Chronicles premiered on January 15, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Martian Chronicles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m, 360m Homepage  - Genres Sci-Fi & Fantasy Keywords mars based on novel or book nasa alien planet miniseries colonisation astronaut mission to mars Content Score 100 Yes! Looking good! Top Contributors 12 joel6 10 Banana J 7 JeePeCe 5 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}