{"link": "https://www.themoviedb.org/tv/62715?language=en", "title": "Dragon Ball Super", "resume": "Set just after the events of the Buu Saga of Dragon Ball Z, a deadly threat awakens once more. People lived in peace without knowing who the true heroes were during the devastating battle against Majin Buu. The powerful Dragon Balls have prevented any permanent damage, and our heroes also continue to live a normal life. In the far reaches of the universe, however, a powerful being awakens early from his slumber, curious about a prophecy of his defeat.\nJoin Gokuu, Piccolo, Vegeta, Gohan, and the rest of the Dragon Ball crew as they tackle the strongest opponent they have ever faced. Beerus, the god of destruction, now sets his curious sights on Earth. Will the heroes save the day and prevent earth's destruction? Or will the whims of a bored god prove too powerful for the Saiyans? Gokuu faces impossible odds once more and fights for the safety of his loved ones and the planet.", "rate": 69, "genre": ["Action", "Adventure", "Animation", "Mystery"], "cast": ["Masako Nozawa", "Takeshi Kusao", "Ryou Horikawa", "Hiromi Tsuru", "Eiko Yamada"], "character": ["Son Goku/Black Goku/Son Gohan/Son Goten (voices)", "Trunks (voice)", "Vegeta (voice)", "Bulma (voice)", "Mai (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62715   Expand Dragon Ball Super   (2015) User Score  Play Trailer Overview Set just after the events of the Buu Saga of Dragon Ball Z, a deadly threat awakens once more. People lived in peace without knowing who the true heroes were during the devastating battle against Majin Buu. The powerful Dragon Balls have prevented any permanent damage, and our heroes also continue to live a normal life. In the far reaches of the universe, however, a powerful being awakens early from his slumber, curious about a prophecy of his defeat. Join Gokuu, Piccolo, Vegeta, Gohan, and the rest of the Dragon Ball crew as they tackle the strongest opponent they have ever faced. Beerus, the god of destruction, now sets his curious sights on Earth. Will the heroes save the day and prevent earth's destruction? Or will the whims of a bored god prove too powerful for the Saiyans? Gokuu faces impossible odds once more and fights for the safety of his loved ones and the planet. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  35 Images Backdrops  24 Posters  8 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Masako Nozawa Son Goku/Black Goku/Son Gohan/Son Goten (voices) Takeshi Kusao Trunks (voice) Ryou Horikawa Vegeta (voice) Hiromi Tsuru Bulma (voice) Eiko Yamada Mai (voice) Full Cast & Crew Last Season Original Air Date Original Air Date American DVDs (DVD) Japanese DVDs (DVD) French DVDs (DVD) German DVDs (DVD) Sagas (Story Arc) Season 1 2015 | 131 Episodes View All Seasons Social Reviews  0 Discussions  40 Subject Status Replies Last Reply The Series Ended Open 37 by  Harry Skywalker Season Formatting Open 9 by  Banana M Dubbed Open 0 by Mrcrotaa\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  24 Posters  8 Recommendations   1989-04-26 Dragon Ball Z 8.1    1986-02-26 Dragon Ball 8.1    1996-02-07 Dragon Ball GT 5.7    2009-04-05 Dragon Ball Z Kai 5.3    1999-10-20 One Piece 7.4    2016-04-03 My Hero Academia 8.0    2004-10-05 Bleach 7.5    2017-04-05 Boruto: Naruto Next Generations 7.1  Facts Original Name  ドラゴンボール超（スーパー） Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.toei-anim.co.jp/tv/dragon_s Genres Action & Adventure Animation Mystery Keywords martial arts super power martial arts tournament shounen anime Content Score 93 Almost there... Top Contributors 77 Banana 64 RubeensVinicius 56 Elizabeth Jennings AK 45 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}