{"link": "https://www.themoviedb.org/tv/66869?language=en", "title": "Good Girls Revolt", "resume": "A look at the personal and professional lives of employees at an American news magazine in the late 1960s.", "rate": 78, "genre": ["Drama"], "cast": ["Genevieve Angelson", "Anna Camp", "Jim Belushi", "Hunter Parrish", "Erin Darke"], "character": ["Patti Robinson", "Jane Hollander", "William 'Wick' McFadden", "Douglas Rhodes", "Cindy Reston"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66869   Expand Good Girls Revolt   (2015) User Score Overview A look at the personal and professional lives of employees at an American news magazine in the late 1960s. Featured Crew Dana Calvo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Genevieve Angelson Patti Robinson Anna Camp Jane Hollander Jim Belushi William 'Wick' McFadden Hunter Parrish Douglas Rhodes Erin Darke Cindy Reston Full Cast & Crew Last Season Season 1 2015 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2014-04-24 Black Box 6.4    2013-10-29 The Escape Artist 7.0    2017-06-04 I'm Dying Up Here 6.9    2014-07-03 The Honourable Woman 7.8    2016-12-26 The Witness for the Prosecution 7.3    2016-02-21 The Break 7.8    2014-02-06 Mozart in the Jungle 7.8    2016-04-10 The Girlfriend Experience 5.5  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  52m Homepage   https://www.amazon.com/Good-Girls-Revolt/dp/B017AOY4WS Genres Drama Keywords women historical fiction writer news Content Score 93 Almost there... Top Contributors 34 joeynotjoe 23 brunnogama 6 Elizabeth Jennings z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}