{"link": "https://www.themoviedb.org/tv/79190?language=en", "title": "EXIT", "resume": "Kang Soo is a loan shark that tries to get by day to day in his depressing reality. His father's abuse lead to his mother running away from home. Thanks to his father's crippling debt, he began to work under Hwang Tae Bok. Happiness wasn't something that was allowed to him. His only dream is to find his mother and live a happy life. However, this is impossible in his life. No matter how hard he tries, he can't escape the nightmare of his reality, and when he was about to give up on his life, he sees a flier asking, \"Do you want to become happy?\" With the smallest inkling of hope, he goes to the research center, so he can experience a bit of happiness. However, he learns that happiness comes at a steep price of 300,000 dollars. He decides to steal the money from Tae Bok. Will he be able to achieve happiness?", "rate": 80, "genre": ["Action", "Adventure", "Drama"], "cast": ["Choi Tae-joon", "Woo Hyeon", "Nam Ki-Ae", "Park Ho-san", "Kim Kyung-Nam"], "character": ["Do Gang-Soo", "Do Jung-Man", "Lee In-Sook", "Hwang Tae-Bok", "Hong Ki-Cheol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79190   Expand EXIT   (2018) User Score Overview Kang Soo is a loan shark that tries to get by day to day in his depressing reality. His father's abuse lead to his mother running away from home. Thanks to his father's crippling debt, he began to work under Hwang Tae Bok. Happiness wasn't something that was allowed to him. His only dream is to find his mother and live a happy life. However, this is impossible in his life. No matter how hard he tries, he can't escape the nightmare of his reality, and when he was about to give up on his life, he sees a flier asking, \"Do you want to become happy?\" With the smallest inkling of hope, he goes to the research center, so he can experience a bit of happiness. However, he learns that happiness comes at a steep price of 300,000 dollars. He decides to steal the money from Tae Bok. Will he be able to achieve happiness? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Tae-joon Do Gang-Soo Woo Hyeon Do Jung-Man Nam Ki-Ae Lee In-Sook Park Ho-san Hwang Tae-Bok Kim Kyung-Nam Hong Ki-Cheol Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of EXIT premiered on April 30, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on EXIT. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  30m Homepage   http://programs.sbs.co.kr/drama/exit/ Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 27 Lumina_B M 17 Maria180493 R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}