{"link": "https://www.themoviedb.org/tv/32800?language=en", "title": "Chase", "resume": "Chase is an American police procedural drama television series created by Jennifer Johnson for the NBC network. The series follows a U.S. Marshals fugitive-apprehension team, based out of Houston, Texas. Jerry Bruckheimer and Johnson serve as executive producers for the one-hour drama. The series originally aired on Mondays at 10:00 pm ET/9:00 pm CT and premiered on September 20, 2010. After the mid-season break, Chase returned on Wednesdays at 9:00 pm ET/8:00 pm CT On October 19, 2010, the network ordered a full season consisting of 22 episodes, but this order was cut to 18 in December. On February 3, 2011, the show was put on \"a hiatus\" with no plan regarding the remaining episodes. On April 6, 2011, NBC announced the remaining five episodes would be broadcast on Saturday nights beginning on April 23, 2011. Later the show was replaced by Harry's Law.", "rate": 62, "genre": ["Drama", "Action", "Adventure"], "cast": ["Rose Rollins", "Jesse Metcalfe", "Amaury Nolasco", "Cole Hauser", "Kelli Giddish"], "character": ["Daisy Ogbaa", "Luke Watson", "Marco Martinez", "Jimmy Godfrey", "Annie Nolan Frost"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32800   Expand Chase   (2010) User Score Overview Chase is an American police procedural drama television series created by Jennifer Johnson for the NBC network. The series follows a U.S. Marshals fugitive-apprehension team, based out of Houston, Texas. Jerry Bruckheimer and Johnson serve as executive producers for the one-hour drama. The series originally aired on Mondays at 10:00 pm ET/9:00 pm CT and premiered on September 20, 2010. After the mid-season break, Chase returned on Wednesdays at 9:00 pm ET/8:00 pm CT On October 19, 2010, the network ordered a full season consisting of 22 episodes, but this order was cut to 18 in December. On February 3, 2011, the show was put on \"a hiatus\" with no plan regarding the remaining episodes. On April 6, 2011, NBC announced the remaining five episodes would be broadcast on Saturday nights beginning on April 23, 2011. Later the show was replaced by Harry's Law. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rose Rollins Daisy Ogbaa Jesse Metcalfe Luke Watson Amaury Nolasco Marco Martinez Cole Hauser Jimmy Godfrey Kelli Giddish Annie Nolan Frost Full Cast & Crew Last Season Season 1 2010 | 18 Episodes Season 1 of Chase premiered on September 20, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Chase. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.nbc.com/chase Genres Drama Action & Adventure Keywords u.s. marshal fugitive escaped prisoner Content Score 86 Almost there... Top Contributors 21 Banana s 5 speedycars 4 BigMad z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}