{"link": "https://www.themoviedb.org/tv/61140?language=en", "title": "Inspiring Generation", "resume": "Based in the 1930's of Shanghai, China, this drama is a story about love, friendship, patriotism and desire. Shin Jung Tae (Kim Hyun Joong) is an outrageous and clumsy man, but has an unconditional love for his country and family. He was known as the best fighter in the alleys of Shanghai.", "rate": 77, "genre": ["Action", "Adventure", "Drama"], "cast": ["Kim Hyun-joong", "Im Soo-hyang", "Jin Se-yeon", "Jo Dong-hyuk", "Kim Seong-oh"], "character": ["Shin Jung-tae", "Teguchi Gaya", "Kim Ok-ryun", "Shinichi", "Jung Jae-hwa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61140   Expand Inspiring Generation   (2014) User Score  Play Trailer Overview Based in the 1930's of Shanghai, China, this drama is a story about love, friendship, patriotism and desire. Shin Jung Tae (Kim Hyun Joong) is an outrageous and clumsy man, but has an unconditional love for his country and family. He was known as the best fighter in the alleys of Shanghai. Featured Crew Kim Jung-kyu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hyun-joong Shin Jung-tae Im Soo-hyang Teguchi Gaya Jin Se-yeon Kim Ok-ryun Jo Dong-hyuk Shinichi Kim Seong-oh Jung Jae-hwa Full Cast & Crew Last Season Season 1 2014 | 24 Episodes Season 1 of Inspiring Generation premiered on January 15, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Inspiring Generation. You can help by rating TV shows you've seen. Facts Original Name  감격시대 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/tusin/ Genres Action & Adventure Drama Keywords korea Content Score 100 Yes! Looking good! Top Contributors M 42 Maria180493 d 14 daphie 11 Elizabeth Jennings z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}