{"link": "https://www.themoviedb.org/tv/44857?language=en", "title": "The Mindy Project", "resume": "Obstetrician/gynecologist Mindy Lahiri tries to balance her personal and professional life, surrounded by quirky co-workers in a small medical practice in New York City.", "rate": 58, "genre": ["Comedy"], "cast": ["Mindy Kaling", "Ed Weeks", "Ike Barinholtz", "Beth Grant", "Xosha Roquemore"], "character": ["Mindy Lahiri", "Jeremy Reed", "Morgan Tookers", "Beverly", "Tamra"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44857   Expand The Mindy Project   (2012) User Score  Play Trailer Overview Obstetrician/gynecologist Mindy Lahiri tries to balance her personal and professional life, surrounded by quirky co-workers in a small medical practice in New York City. Featured Crew Mindy Kaling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  4 Images Backdrops  14 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mindy Kaling Mindy Lahiri Ed Weeks Jeremy Reed Ike Barinholtz Morgan Tookers Beth Grant Beverly Xosha Roquemore Tamra Full Cast & Crew Last Season Season 6 2017 | 10 Episodes Season 6 of The Mindy Project premiered on September 11, 2017. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply Did anyone see the series finale?  (Spoilers) Open 0 by MirrorMask\n      \n     w Mindy: Happy Birthday Mindy Kaling! Open 0 by wonder2wonder\n      \n     What did you all think of the new episode Dibs Open 0 by henahey42\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  8 Recommendations   2012-09-11 The New Normal 5.2    2014-09-30 Selfie 6.4    2012-09-25 Ben and Kate 5.9    2012-04-11 Don't Trust the B---- in Apartment 23 6.7    2011-04-13 Happy Endings 7.3    2014-04-09 Deadbeat 6.2    2016-03-15 Crowded 6.4    2014-05-29 Undateable 6.2  Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.hulu.com/the-mindy-project Genres Comedy Keywords new york indian lead gynecologist sitcom workplace comedy workplace romance Content Score 100 Yes! Looking good! Top Contributors 124 Banana 28 Elizabeth Jennings 24 Travis Bell TB 16 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}