{"link": "https://www.themoviedb.org/tv/69740?language=en", "title": "Ozark", "resume": "A financial adviser drags his family from Chicago to the Missouri Ozarks, where he must launder $500 million in five years to appease a drug boss.", "rate": 80, "genre": ["Crime", "Drama"], "cast": ["Jason Bateman", "Laura Linney", "Sofia Hublitz", "Skylar Gaertner", "Jason Butler Harner"], "character": ["Marty Byrde", "Wendy Byrde", "Charlotte Byrde", "Jonah Byrde", "Roy Petty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69740   Expand Ozark   (2017) User Score  Play Trailer Overview A financial adviser drags his family from Chicago to the Missouri Ozarks, where he must launder $500 million in five years to appease a drug boss. Featured Crew Bill Dubuque Creator Mark Williams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  11 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Bateman Marty Byrde Laura Linney Wendy Byrde Sofia Hublitz Charlotte Byrde Skylar Gaertner Jonah Byrde Jason Butler Harner Roy Petty Full Cast & Crew Next Season Season 2 2018 | 6 Episodes Season 2 of Ozark is set to premiere on August 31, 2018. View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply Not to be that guy, but I am surprised this show is currently rated 8.1... Open 2 by  JustinJackFlash Season 2 Open 5 by  Melanie So, who is Del's boss? Open 11 by  DRDMovieMusings Go to Discussions Media Most Popular Videos  2 Backdrops  3 Posters  5 Recommendations   2017-10-13 Mindhunter 7.4    2017-12-01 Dark 7.9    2017-08-01 Manhunt: Unabomber 7.8    2017-08-02 The Sinner 7.3    2017-11-17 Marvel's The Punisher 8.0    2016-07-10 The Night Of 7.7    2015-08-28 Narcos 8.0    2017-09-10 The Deuce 7.9  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  80m, 56m Homepage   https://www.netflix.com/title/80117552 Genres Crime Drama Keywords money laundering drug cartel crime kingpin Content Score 100 Yes! Looking good! Top Contributors 99 Elizabeth Jennings 21 Cyro Dubeux TB 16 TMDb Bot 8 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}