{"link": "https://www.themoviedb.org/tv/78069?language=en", "title": "Sandro de América", "resume": "Sandro de América is a series of Argentine biographical, musical, dramatic and romantic television broadcasted by Telefe and produced by The Magic Eye, starring Antonio Grimau, Marco Antonio Caponi and Agustín Sullivan, who will perform the famous Argentine singer and composer Sandro en different stages of his life.\nThe series has 13 episodes and debuted on March 5, 2018, broadcasting Monday through Thursday, over three weeks, as a \"unique event\" television.", "rate": 100, "genre": [], "cast": ["Agustín Sullivan", "Marco Antonio Caponi", "Antonio Grimau", "Luis Machín", "Muriel Santa Ana"], "character": ["Sandro - Joven", "Sandro - Adultez", "Sandro - Adulto", "Oscar Anderle", "Olga Garaventa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78069   Expand Sandro de América   (2018) User Score Overview Sandro de América is a series of Argentine biographical, musical, dramatic and romantic television broadcasted by Telefe and produced by The Magic Eye, starring Antonio Grimau, Marco Antonio Caponi and Agustín Sullivan, who will perform the famous Argentine singer and composer Sandro en different stages of his life. The series has 13 episodes and debuted on March 5, 2018, broadcasting Monday through Thursday, over three weeks, as a \"unique event\" television. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Agustín Sullivan Sandro - Joven Marco Antonio Caponi Sandro - Adultez Antonio Grimau Sandro - Adulto Luis Machín Oscar Anderle Muriel Santa Ana Olga Garaventa Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of Sandro de América premiered on March  5, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sandro de América. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  47m Homepage   http://telefe.com/sandro-la-serie/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 10 Nicolás h 6 hueverin v 6 vodmxtv  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}