{"link": "https://www.themoviedb.org/tv/75187?language=en", "title": "Armchair Detectives", "resume": "A gameshow in which three amateur sleuths head to the fictional town of Mortcliff to solve a deadly crime, from the comfort of the Armchairs in the studio. They'll watch the drama play out as Mortcliff's crack team of detectives - DI Knight, DC Slater and Scenes of Crime Officer Simmons - make enquiries with the local residents.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Susan Calman", "Stephen Billington", "Roger Nsengiyumva", "Sarah Baxendale"], "character": ["Herself - Presenter", "DI Knight", "DC Slater", "Simmons"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75187   Expand Armchair Detectives   (2017) User Score Overview A gameshow in which three amateur sleuths head to the fictional town of Mortcliff to solve a deadly crime, from the comfort of the Armchairs in the studio. They'll watch the drama play out as Mortcliff's crack team of detectives - DI Knight, DC Slater and Scenes of Crime Officer Simmons - make enquiries with the local residents. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Susan Calman Herself - Presenter Stephen Billington DI Knight Roger Nsengiyumva DC Slater Sarah Baxendale Simmons Full Cast & Crew Current Season Season 1 2017 | 11 Episodes Season 1 of Armchair Detectives premiered on November 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Armchair Detectives. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.bbc.co.uk/programmes/b09gz79q Genres Crime Drama Keywords game show Content Score 86 Almost there... Top Contributors 27 Elizabeth Jennings 4 Ibuddy66  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}