{"link": "https://www.themoviedb.org/tv/42490?language=en", "title": "Wild Romance", "resume": "Pro baseball player Mu Yeol, renowned for both his skill and his bad temper, is the star player of the Red Dreamers. Eun Jae is a lifelong fan of the Blue Seagulls, the Red Dreamers' rival team. See what happens when two mortal enemies are suddenly thrown together by fate in this hilarious screwball comedy. A chance meeting during a drunken night of karaoke leads to a scuffle, which Eun Jae easily wins, flipping Mu Yeol on his back. The fight is captured on video, however, and soon erupts into a huge scandal, with Mu Yeol's reputation and Eun Jae's career as a bodyguard at stake. To fix things, their respective employers agree to assign Eun Jae to act as Mu Yeol's bodyguard. Now, this mismatched pair must spend all their time together, and in the midst of constant battling and working to find each other's weak spots, they find out more about each other than they realized. Sparks fly between Lee Dong Wook and Lee Si Young in this fast-paced and entertaining comedy.", "rate": 100, "genre": ["Comedy"], "cast": ["Lee Dong-wook", "Lee Si-young", "Jessica Jung", "Hwang Sun-hee", "Lee Han-wi"], "character": ["Park Mu-yeol", "Yoo Eun-jae", "Kang Jong-hee", "Oh Soo-young", "Kevin Jang"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42490   Expand Wild Romance   (2012) User Score  Play Trailer Overview Pro baseball player Mu Yeol, renowned for both his skill and his bad temper, is the star player of the Red Dreamers. Eun Jae is a lifelong fan of the Blue Seagulls, the Red Dreamers' rival team. See what happens when two mortal enemies are suddenly thrown together by fate in this hilarious screwball comedy. A chance meeting during a drunken night of karaoke leads to a scuffle, which Eun Jae easily wins, flipping Mu Yeol on his back. The fight is captured on video, however, and soon erupts into a huge scandal, with Mu Yeol's reputation and Eun Jae's career as a bodyguard at stake. To fix things, their respective employers agree to assign Eun Jae to act as Mu Yeol's bodyguard. Now, this mismatched pair must spend all their time together, and in the midst of constant battling and working to find each other's weak spots, they find out more about each other than they realized. Sparks fly between Lee Dong Wook and Lee Si Young in this fast-paced and entertaining comedy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Dong-wook Park Mu-yeol Lee Si-young Yoo Eun-jae Jessica Jung Kang Jong-hee Hwang Sun-hee Oh Soo-young Lee Han-wi Kevin Jang Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of Wild Romance premiered on January  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Wild Romance. You can help by rating TV shows you've seen. Facts Original Name  난폭한 로맨스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/wildromance/ Genres Comedy Keywords korea Content Score 93 Almost there... Top Contributors M 36 Maria180493 N 15 Nightowl.Kr z 10 zurman1 t 4 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}