{"link": "https://www.themoviedb.org/tv/9503?language=en", "title": "Lace", "resume": "Lace is an American television two-part miniseries, based on the novel of the same name by author Shirley Conran. The series aired on ABC from February 26–27, 1984. The plot concerns the search by sex symbol Lili for her natural mother, who surrendered her for adoption as a newborn. Lace was one of the highest-rated television movies of the 1983-84 television season.\nThe miniseries is infamous for the line \"Which one of you bitches is my mother?\" spoken by Lili, when she finally assembles the three potential candidates: Pagan Trelawney, Judy Hale and Maxine Pascal.", "rate": 68, "genre": ["Drama"], "cast": ["Bess Armstrong", "Arielle Dombasle", "Brooke Adams", "Phoebe Cates", "Angela Lansbury"], "character": ["Judy Hale", "Maxine Pascal", "Jennifer 'Pagan' Trelawney", "Lili", "Aunt Hortense Boutin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9503   Expand Lace   (1984) User Score Overview Lace is an American television two-part miniseries, based on the novel of the same name by author Shirley Conran. The series aired on ABC from February 26–27, 1984. The plot concerns the search by sex symbol Lili for her natural mother, who surrendered her for adoption as a newborn. Lace was one of the highest-rated television movies of the 1983-84 television season. The miniseries is infamous for the line \"Which one of you bitches is my mother?\" spoken by Lili, when she finally assembles the three potential candidates: Pagan Trelawney, Judy Hale and Maxine Pascal. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bess Armstrong Judy Hale Arielle Dombasle Maxine Pascal Brooke Adams Jennifer 'Pagan' Trelawney Phoebe Cates Lili Angela Lansbury Aunt Hortense Boutin Full Cast & Crew Last Season Season 1 1984 | 2 Episodes Season 1 of Lace premiered on February 26, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1985-11-03 North and South 7.2    2012-01-01 Treasure Island 6.5    1998-04-26 Merlin 6.3    1995-05-14 The Langoliers 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  300m, 240m Homepage  - Genres Drama Keywords mother identity mystery school flashback actress abandoned Content Score 86 Almost there... Top Contributors TB 32 TMDb Bot z 25 zurman1 w 3 webmaster c 3 chispy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}