{"link": "https://www.themoviedb.org/tv/31272?language=en", "title": "Fun House", "resume": "Fun House is a British children's game show produced by Scottish Television and based on the American show, that aired on CITV from 24 February 1989 to 29 December 1999. It usually aired on Fridays. It was hosted by Pat Sharp, who was also aided by twin cheerleaders, Melanie Grant supporting the red team and Martina Grant supporting the yellow team. The announcer was Gary King. The theme tune was composed by David Pringle and Bob Heatlie.", "rate": 50, "genre": ["Comedy"], "cast": ["Pat Sharp"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31272   Expand Fun House   (1989) User Score Overview Fun House is a British children's game show produced by Scottish Television and based on the American show, that aired on CITV from 24 February 1989 to 29 December 1999. It usually aired on Fridays. It was hosted by Pat Sharp, who was also aided by twin cheerleaders, Melanie Grant supporting the red team and Martina Grant supporting the yellow team. The announcer was Gary King. The theme tune was composed by David Pringle and Bob Heatlie. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pat Sharp Full Cast & Crew Last Season Season 11 1999 | 15 Episodes Season 11 of Fun House premiered on September 24, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fun House. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}