{"link": "https://www.themoviedb.org/tv/15296?language=en", "title": "Kryminalni", "resume": "Kryminalni was a Polish crime drama television series that aired on TVN network from September 18, 2004 until May 24, 2008. It ran for 8 seasons and 101 episodes were broadcast in total. It was created by Polish director and screenwriter Piotr Wereśniak and produced by MTL Maxfilm studio.\nThe series followed life and work of police officers from the elite Criminal Terror and Murders Division of the Warsaw Metropolitan Police; the title refers to police officers in the crime section. The three main characters were Adam Zawada, an experienced, tough cup, his younger colleague Marek Brodecki and Barbara Storosz, an ambitious female officer who in the first season joins the team just after graduating.\nAlthough none of the main actors had had star status before the series debuted, all three of them rose to prominence and popularity during the 5-year-long run. Many of Poland's best known actors guest starred, usually playing roles of people involved in just one particular investigation. The serial was one of the most popular in Poland: each week it had an audience of 4 million.", "rate": 0, "genre": ["Drama"], "cast": ["Joanna Liszowska", "Tomasz Karolak", "Adam Ferency", "Katarzyna Herman", "Daniel Olbrychski"], "character": ["Szczepan Zaloda", "Krzysztof Brodecki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15296   Expand Kryminalni   (2004) User Score Overview Kryminalni was a Polish crime drama television series that aired on TVN network from September 18, 2004 until May 24, 2008. It ran for 8 seasons and 101 episodes were broadcast in total. It was created by Polish director and screenwriter Piotr Wereśniak and produced by MTL Maxfilm studio. The series followed life and work of police officers from the elite Criminal Terror and Murders Division of the Warsaw Metropolitan Police; the title refers to police officers in the crime section. The three main characters were Adam Zawada, an experienced, tough cup, his younger colleague Marek Brodecki and Barbara Storosz, an ambitious female officer who in the first season joins the team just after graduating. Although none of the main actors had had star status before the series debuted, all three of them rose to prominence and popularity during the 5-year-long run. Many of Poland's best known actors guest starred, usually playing roles of people involved in just one particular investigation. The serial was one of the most popular in Poland: each week it had an audience of 4 million. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joanna Liszowska Tomasz Karolak Szczepan Zaloda Adam Ferency Katarzyna Herman Daniel Olbrychski Krzysztof Brodecki Full Cast & Crew Last Season Season 8 2008 | 13 Episodes Season 8 of Kryminalni premiered on March  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kryminalni. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}