{"link": "https://www.themoviedb.org/tv/54671?language=en", "title": "Penny Dreadful", "resume": "Some of literature's most terrifying characters, including Dr. Frankenstein, Dorian Gray, and iconic figures from the novel Dracula are lurking in the darkest corners of Victorian London. Penny Dreadful is a frightening psychological thriller that weaves together these classic horror origin stories into a new adult drama.", "rate": 75, "genre": ["Drama"], "cast": ["Timothy Dalton", "Eva Green", "Josh Hartnett", "Rory Kinnear", "Harry Treadaway"], "character": ["Sir Malcolm", "Vanessa Ives", "Ethan Chandler", "The Creature", "Dr. Victor Frankenstein"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54671   Expand Penny Dreadful   (2014) User Score  Play Trailer Overview Some of literature's most terrifying characters, including Dr. Frankenstein, Dorian Gray, and iconic figures from the novel Dracula are lurking in the darkest corners of Victorian London. Penny Dreadful is a frightening psychological thriller that weaves together these classic horror origin stories into a new adult drama. Featured Crew John Logan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  11 Posters  47 Videos Trailers  2 Teasers  1 Clips  0 Featurettes  15 Opening Credits  1 Top Billed Cast Timothy Dalton Sir Malcolm Eva Green Vanessa Ives Josh Hartnett Ethan Chandler Rory Kinnear The Creature Harry Treadaway Dr. Victor Frankenstein Full Cast & Crew Last Season Season 3 2016 | 9 Episodes Season 3 of Penny Dreadful premiered on May  1, 2016. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply John Clare Open 0 by write2topcat\n      \n     For Newbies to the Show! No Spoilers Please! Open 5 by  write2topcat Character discussions, who was your favorite and who did you despise, etc. Open 0 by write2topcat\n      \n     Go to Discussions Media Most Popular Videos  19 Backdrops  11 Posters  47 Recommendations   2013-04-04 Hannibal 7.7    2014-07-13 The Strain 6.6    2013-09-16 Sleepy Hollow 6.4    2013-04-19 Hemlock Grove 6.4    2014-01-12 True Detective 8.1    2014-04-20 Salem 7.3    2014-01-10 Helix 6.4    2010-01-22 Spartacus 7.8  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.sho.com/penny-dreadful Genres Drama Keywords witch monster underground vampire supernatural victorian england werewolf devil town mental illness psychotherapy succubus dark fantasy frankenstein's monster 19th century Content Score 100 Yes! Looking good! Top Contributors 97 Elizabeth Jennings 44 Travis Bell v 30 vahidSA TB 25 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}