{"link": "https://www.themoviedb.org/tv/32515?language=en", "title": "Dance Academy", "resume": "At Sydney's National Dance Academy, a few talented youngsters are recruited for the excruciatingly tough course. It follows Tara Webster, a sheepfarmgirl who's ambition is to be the next best ballerina. Jewish long line of doctors' heir Samuel 'Sammy' and minor juvenile offender Christian are the outsiders but gradually fit in, making new kinds of friends. Star ballerina's daughter Kat also introduces them in the circle of last-year brother Ethan, who already aspires a career as choreographer. Also Abigail, a smart young girl who'll walk over dead bodies to reach the stars tries to sabotage everything and everyone.", "rate": 88, "genre": ["Comedy", "Drama", "Family"], "cast": ["Xenia Goodwin", "Alicia Banit", "Dena Kaplan", "Isabel Durant", "Jordan Rodrigues"], "character": ["Tara Webster", "Katrina \"Kat\" Karamakov", "Abigail Armstrong", "Grace Whitney", "Christian Reed"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32515   Expand Dance Academy   (2010) User Score  Play Trailer Overview At Sydney's National Dance Academy, a few talented youngsters are recruited for the excruciatingly tough course. It follows Tara Webster, a sheepfarmgirl who's ambition is to be the next best ballerina. Jewish long line of doctors' heir Samuel 'Sammy' and minor juvenile offender Christian are the outsiders but gradually fit in, making new kinds of friends. Star ballerina's daughter Kat also introduces them in the circle of last-year brother Ethan, who already aspires a career as choreographer. Also Abigail, a smart young girl who'll walk over dead bodies to reach the stars tries to sabotage everything and everyone. Featured Crew Samantha Strauss Creator Joanna Werner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  16 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Xenia Goodwin Tara Webster Alicia Banit Katrina \"Kat\" Karamakov Dena Kaplan Abigail Armstrong Isabel Durant Grace Whitney Jordan Rodrigues Christian Reed Full Cast & Crew Last Season Season 3 2013 | 14 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Kat: Happy Birthday Alicia Banit! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  16 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Dance Academy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  24m, 30m Homepage   http://www.abc.net.au/abc3/danceacademy/ Genres Comedy Drama Family Keywords dance ballet teenager ballerina dance school Content Score 100 Yes! Looking good! Top Contributors 157 Marr 🇳🇱 18 United600 3 rtentser TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}