{"link": "https://www.themoviedb.org/tv/3353?language=en", "title": "Odd Man Out", "resume": "Odd Man Out is an American sitcom that aired on the ABC television network as a part of the TGIF lineup. It aired from September 24, 1999 to January 7, 2000. Created by Ed Decter and John J. Strauss, the show also featured Bill Cosby as executive producer.", "rate": 0, "genre": ["Comedy"], "cast": ["Erik von Detten", "Vicki Davis", "Natalia Cigliuti", "Jessica Capshaw", "Markie Post"], "character": ["Andrew Whitney", "Valerie 'Val' Whitney", "Paige Whitney", "Aunt Jordan", "Julia Whitney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3353   Expand Odd Man Out   (1999) User Score Overview Odd Man Out is an American sitcom that aired on the ABC television network as a part of the TGIF lineup. It aired from September 24, 1999 to January 7, 2000. Created by Ed Decter and John J. Strauss, the show also featured Bill Cosby as executive producer. Featured Crew Ed Decter Creator John J. Strauss Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erik von Detten Andrew Whitney Vicki Davis Valerie 'Val' Whitney Natalia Cigliuti Paige Whitney Jessica Capshaw Aunt Jordan Markie Post Julia Whitney Full Cast & Crew Last Season Season 1 1999 | 13 Episodes Season 1 of Odd Man Out premiered on September 24, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Odd Man Out. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Comedy Keywords family sitcom Content Score 79 Pump it up! We're close now. Top Contributors 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}