{"link": "https://www.themoviedb.org/tv/60842?language=en", "title": "Mekaku city Actors", "resume": "The incidents which occurred on August 14th and 15th bring a group of young boys and girls together… They are members of a group they call themselves the \"Mekakushi Dan\" (Blindfold Organization) and each member possesses a strange power involving their eyes.", "rate": 68, "genre": ["Animation", "Comedy", "Romance"], "cast": ["Misuzu Togashi", "Shinnosuke Tachibana", "Yuko Kaida", "Kana Asumi"], "character": ["Amamiya Hibiya", "Kano Shuuya", "Kido Tsubomi", "Enomoto Takane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60842   Expand Mekaku city Actors   (2014) User Score Overview The incidents which occurred on August 14th and 15th bring a group of young boys and girls together… They are members of a group they call themselves the \"Mekakushi Dan\" (Blindfold Organization) and each member possesses a strange power involving their eyes. Featured Crew Akiyuki Shinbo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Misuzu Togashi Amamiya Hibiya Shinnosuke Tachibana Kano Shuuya Yuko Kaida Kido Tsubomi Kana Asumi Enomoto Takane Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Mekaku city Actors premiered on April 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mekaku city Actors. You can help by rating TV shows you've seen. Facts Original Name  メカクシティアクターズ Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Romance Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 28 benf45 G 6 Geonk J 6 Jason R 3 RsTxSpyMaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}