{"link": "https://www.themoviedb.org/tv/4774?language=en", "title": "Värsta språket", "resume": "Värsta språket was a Swedish television series about the Swedish language. The series, which was hosted by Fredrik Lindström and produced by Karin af Klintberg, was broadcast on SVT during 2002 and 2003. The series discussed issues with the Swedish language in an entertaining way.\nAfter two seasons, Fredrik Lindström claimed that the attention from the programme was a burden to him and that he wouldn't host it anymore. The show was therefore put on hiatus. Lindström did however return with another language-related series called Svenska dialektmysterier in 2006.\nLindström and af Klintberg were given Stora journalistpriset for the programme.\nMuch of what was mentioned in the show is recorded and can be read in Lindström's two books: Världens dåligaste språk and Jordens smartaste ord.", "rate": 60, "genre": ["Comedy"], "cast": ["Annie Girardot", "Anthony Hopkins", "Dietlinde Turban", "Fabio Testi", "Susan Sarandon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4774   Expand Värsta språket   (2002) User Score Overview Värsta språket was a Swedish television series about the Swedish language. The series, which was hosted by Fredrik Lindström and produced by Karin af Klintberg, was broadcast on SVT during 2002 and 2003. The series discussed issues with the Swedish language in an entertaining way. After two seasons, Fredrik Lindström claimed that the attention from the programme was a burden to him and that he wouldn't host it anymore. The show was therefore put on hiatus. Lindström did however return with another language-related series called Svenska dialektmysterier in 2006. Lindström and af Klintberg were given Stora journalistpriset for the programme. Much of what was mentioned in the show is recorded and can be read in Lindström's two books: Världens dåligaste språk and Jordens smartaste ord. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Annie Girardot Anthony Hopkins Dietlinde Turban Fabio Testi Susan Sarandon Full Cast & Crew Last Season Season 2 2003 | 7 Episodes Season 2 of Värsta språket premiered on February 18, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2004-08-30 John Safran vs God 7.3    2016-04-25 After the Thrones 4.6    1987-09-05 På spåret 5.0    1999-01-18 Parlamentet 3.0    2011-01-06 The Reckoning 3.7    2013-11-07 Folkets främsta företrädare 5.0    2001-01-17 Uppdrag granskning 6.8    2015-12-01 1000 Years until Christmas Eve 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}