{"link": "https://www.themoviedb.org/tv/63226?language=en", "title": "I'm Home", "resume": "Ieji Hisashi, a salaryman who works for a securities company, has a fuzzy memory of the recent five years because of an accident at his job posting. His wife of five years, Megumi and their 4-year-old son seem to wear masks. He can neither tell their facial expressions nor their emotions. He also struggles about his love for them. On the other hand, Ieji feels an attachment to his ex-wife, whom he divorced five years ago, and their daughter. What sort of days did he have in those five years which are a blank to him? Ieji sets out on a journey to find his past self with a mysterious bunch of 10 keys that he has. He becomes aware that he was a cold, career-minded man before the accident, and the persona that is gradually revealed is beyond the imagination of his present kindhearted self.", "rate": 100, "genre": ["Family", "Drama", "Mystery"], "cast": ["Takuya Kimura", "Aya Ueto"], "character": ["Ieji Hisashi", "Ieji Megumi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63226   Expand I'm Home   (2015) User Score Overview Ieji Hisashi, a salaryman who works for a securities company, has a fuzzy memory of the recent five years because of an accident at his job posting. His wife of five years, Megumi and their 4-year-old son seem to wear masks. He can neither tell their facial expressions nor their emotions. He also struggles about his love for them. On the other hand, Ieji feels an attachment to his ex-wife, whom he divorced five years ago, and their daughter. What sort of days did he have in those five years which are a blank to him? Ieji sets out on a journey to find his past self with a mysterious bunch of 10 keys that he has. He becomes aware that he was a cold, career-minded man before the accident, and the persona that is gradually revealed is beyond the imagination of his present kindhearted self. Featured Crew Kei Ishizaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Kimura Ieji Hisashi Aya Ueto Ieji Megumi Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of I'm Home premiered on April 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I'm Home. You can help by rating TV shows you've seen. Facts Original Name  アイムホーム Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  50m Homepage   http://www.tv-asahi.co.jp/imhome/ Genres Family Drama Mystery Keywords mystery family Content Score 64 We're so close, yet so far. Top Contributors A 31 Aka75 16 haslil 13 zohctheman 13 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}