{"link": "https://www.themoviedb.org/tv/61019?language=en", "title": "Street Outlaws", "resume": "From a 1969 Chevy Nova to a race-ready farm truck, the vehicles - and their drivers - come in all shapes and sizes and have one thing in common: the need for speed. But according to the STREET OUTLAWS of Oklahoma City - home to one of the largest undercover street racing rings in America – if you’re not on “the list,” you don’t matter. The “list” contains the 10 fastest street-racing cars in Oklahoma City and they are the best of the best. Not only will these guys will do anything -ANYTHING- to get ranked on this list, they’ll do whatever it takes to STAY ranked. Street racing comes first - before family, before friends and before work. The stakes are high and these drivers will put everything on the line to get to top, where there can only be one #1.", "rate": 81, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61019   Expand Street Outlaws   (2013) User Score  Play Trailer Overview From a 1969 Chevy Nova to a race-ready farm truck, the vehicles - and their drivers - come in all shapes and sizes and have one thing in common: the need for speed. But according to the STREET OUTLAWS of Oklahoma City - home to one of the largest undercover street racing rings in America – if you’re not on “the list,” you don’t matter. The “list” contains the 10 fastest street-racing cars in Oklahoma City and they are the best of the best. Not only will these guys will do anything -ANYTHING- to get ranked on this list, they’ll do whatever it takes to STAY ranked. Street racing comes first - before family, before friends and before work. The stakes are high and these drivers will put everything on the line to get to top, where there can only be one #1. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 11 2018 | 9 Episodes Season 11 of Street Outlaws premiered on May 21, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Street Outlaws. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2005-04-12 Deadliest Catch 6.6    2012-06-06 Fast N' Loud 6.2    2014-05-06 Alaskan Bush People 5.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.discovery.com/tv-shows/street-outlaws/ Genres Reality Keywords car race Content Score 64 We're so close, yet so far. Top Contributors 35 Elizabeth Jennings b 10 basher p 8 panjoel TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}