{"link": "https://www.themoviedb.org/tv/4682?language=en", "title": "Strictly Come Dancing: It Takes Two", "resume": "Strictly Come Dancing: It Takes Two, or simply Strictly: It Takes Two, is a British television programme, the companion show to the popular BBC One programme Strictly Come Dancing. It airs on weeknights during the run of the main show on BBC Two at 6:30pm. Claudia Winkleman was the first presenter of the series; however due to her pregnancy in 2011 she had to leave and since then former Strictly finalist Zoë Ball has presented it.\nBefore 2010, BBC Two Scotland did not broadcast the show on Thursdays, when locally-produced Gaelic language programming aired in the slot instead, though during the 2008 and 2009 series the Thursday night show was carried as an alternative digital stream via BBC Red Button.\nThe programme features interviews and training footage of the couples competing in the main Saturday night show, opinions from the judges on the previous Saturday show and the training footage for the next, and interviews with celebrities who have been watching the show. Head judge Len Goodman had a weekly spot with Claudia Winkleman entitled \"Len's Masterclass\", in which he demonstrated the dances to be performed on the following Saturday - this has been discontinued since Zoe Ball took over the presenter role.", "rate": 0, "genre": ["Reality"], "cast": ["Zoë Ball"], "character": ["Herself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4682   Expand Strictly Come Dancing: It Takes Two   (2004) User Score  Play Trailer Overview Strictly Come Dancing: It Takes Two, or simply Strictly: It Takes Two, is a British television programme, the companion show to the popular BBC One programme Strictly Come Dancing. It airs on weeknights during the run of the main show on BBC Two at 6:30pm. Claudia Winkleman was the first presenter of the series; however due to her pregnancy in 2011 she had to leave and since then former Strictly finalist Zoë Ball has presented it. Before 2010, BBC Two Scotland did not broadcast the show on Thursdays, when locally-produced Gaelic language programming aired in the slot instead, though during the 2008 and 2009 series the Thursday night show was carried as an alternative digital stream via BBC Red Button. The programme features interviews and training footage of the couples competing in the main Saturday night show, opinions from the judges on the previous Saturday show and the training footage for the next, and interviews with celebrities who have been watching the show. Head judge Len Goodman had a weekly spot with Claudia Winkleman entitled \"Len's Masterclass\", in which he demonstrated the dances to be performed on the following Saturday - this has been discontinued since Zoe Ball took over the presenter role. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zoë Ball Herself - Presenter Full Cast & Crew Last Season Season 15 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Strictly Come Dancing: It Takes Two. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006mgww Genres Reality Keywords dancing reality competition Content Score 64 We're so close, yet so far. Top Contributors 12 tigru89 7 Elizabeth Jennings 3 mgn S 3 SamSanti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}