{"link": "https://www.themoviedb.org/tv/59500?language=en", "title": "See Dad Run", "resume": "The story of David Hobbs, who has spent the last decade playing the perfect father on one of TV’s biggest sitcoms. But when the series ends and his wife resumes her own television career, he finds himself cast in his most challenging role to date: handling the day-to-day needs of three kids who've grown accustomed to not having him around. David soon learns that playing a dad on TV is child’s play compared to the real thing.", "rate": 50, "genre": ["Family", "Comedy", "Drama"], "cast": ["Scott Baio", "Alanna Ubach", "Ryan Newman", "Jackson Brundage", "Bailey Michelle Brown"], "character": ["David Hobbs", "Amy Hobbs", "Emily Hobbs", "Joe Hobbs", "Janie Hobbs"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59500   Expand See Dad Run   (2012) User Score  Play Trailer Overview The story of David Hobbs, who has spent the last decade playing the perfect father on one of TV’s biggest sitcoms. But when the series ends and his wife resumes her own television career, he finds himself cast in his most challenging role to date: handling the day-to-day needs of three kids who've grown accustomed to not having him around. David soon learns that playing a dad on TV is child’s play compared to the real thing. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Scott Baio David Hobbs Alanna Ubach Amy Hobbs Ryan Newman Emily Hobbs Jackson Brundage Joe Hobbs Bailey Michelle Brown Janie Hobbs Full Cast & Crew Last Season Season 3 2014 | 13 Episodes Season 3 of See Dad Run premiered on February  9, 2014. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w David: Happy Birthday Scott Baio! Open 0 by wonder2wonder\n      \n     w Janie: Happy Birthday Bailey Michelle Brown ! Open 0 by wonder2wonder\n      \n     w Emily: Happy Birthday Ryan Newman! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2007-09-27 Secret Diary of a Call Girl 6.4  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.nickatnite.com/shows/see-dad-run/ Genres Family Comedy Drama Keywords stay-at-home dad family sitcom Content Score 93 Almost there... Top Contributors 32 CouchTater 12 Banana 7 DarkMan c 3 chaynick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}