{"link": "https://www.themoviedb.org/tv/6092?language=en", "title": "The Beiderbecke Affair", "resume": "The Beiderbecke Affair is a television series produced in the United Kingdom by ITV during 1985, written by the prolific Alan Plater, whose lengthy credits to British Television since the 1960s included the preceding 4 part mini series Get Lost! for ITV in 1981. The Beiderbecke Affair has a similar style to Get Lost!, where Neville Keaton and Judy Threadgold played in an ensemble cast. Although The Beiderbecke Affair was intended as a sequel to Get Lost!, Alun Armstrong proved to be unavailable and the premise was reworked. It is the first part of The Beiderbecke Trilogy with the two sequel series being The Beiderbecke Tapes and The Beiderbecke Connection.", "rate": 95, "genre": ["Comedy", "Drama"], "cast": ["Dominic Jephcott", "Terence Rigby", "Dudley Sutton", "Barbara Flynn", "James Bolam"], "character": ["Det. Sgt. Hobson", "Big Al", "Mr. Carter", "Jill Swinburne", "Trevor Chaplin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6092   Expand The Beiderbecke Affair   (1985) User Score Overview The Beiderbecke Affair is a television series produced in the United Kingdom by ITV during 1985, written by the prolific Alan Plater, whose lengthy credits to British Television since the 1960s included the preceding 4 part mini series Get Lost! for ITV in 1981. The Beiderbecke Affair has a similar style to Get Lost!, where Neville Keaton and Judy Threadgold played in an ensemble cast. Although The Beiderbecke Affair was intended as a sequel to Get Lost!, Alun Armstrong proved to be unavailable and the premise was reworked. It is the first part of The Beiderbecke Trilogy with the two sequel series being The Beiderbecke Tapes and The Beiderbecke Connection. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dominic Jephcott Det. Sgt. Hobson Terence Rigby Big Al Dudley Sutton Mr. Carter Barbara Flynn Jill Swinburne James Bolam Trevor Chaplin Full Cast & Crew Last Season Season 1 1985 | 6 Episodes Season 1 of The Beiderbecke Affair premiered on January  1, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Beiderbecke Affair. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  55m Homepage  - Genres Comedy Drama Keywords miniseries Content Score 86 Almost there... Top Contributors TB 37 TMDb Bot R 6 Rebecca I 1 Iain_S  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}