{"link": "https://www.themoviedb.org/tv/69907?language=en", "title": "Simple Man", "resume": "A \"devil\" website connected four unrelated ordinary individuals by giving each of them a tiny amount of super power to satisfy their needs. When they discover others who had signed up on the same site were dying mysteriously, they worry they may be next. They start to probe into who gave them the powers. Their investigation points them to a deadly \"human puzzle\" experiment in which they are the subjects and organ donors for a new life. When it comes time for the devil to demand its payments, their powers maybe the only thing that can save their lives.", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Chen Si Yu", "Li Si Yang", "Xiong Xin", "Zhang Chi", "Wang Zi Qing"], "character": ["Gu Hao Ming", "Xu Meng Qi", "Yan Wen", "Bu Fan", "Vella"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69907   Expand Simple Man   (2016) User Score Overview A \"devil\" website connected four unrelated ordinary individuals by giving each of them a tiny amount of super power to satisfy their needs. When they discover others who had signed up on the same site were dying mysteriously, they worry they may be next. They start to probe into who gave them the powers. Their investigation points them to a deadly \"human puzzle\" experiment in which they are the subjects and organ donors for a new life. When it comes time for the devil to demand its payments, their powers maybe the only thing that can save their lives. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chen Si Yu Gu Hao Ming Li Si Yang Xu Meng Qi Xiong Xin Yan Wen Zhang Chi Bu Fan Wang Zi Qing Vella Full Cast & Crew Last Season Season 1 2016 | 17 Episodes Season 1 of Simple Man premiered on November  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Simple Man. You can help by rating TV shows you've seen. Facts Original Name  微能力者 Status  Ended Network QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  35m Homepage  - Genres Sci-Fi & Fantasy Keywords china suspense Content Score 86 Almost there... Top Contributors M 28 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}