{"link": "https://www.themoviedb.org/tv/73839?language=en", "title": "Hacka Doll", "resume": "In 2xxx, amidst a highly-developed information society, human beings are drowning in a sea of information. This leads to a situation where people cannot find the necessary information. The only hope to solve this problem is a navigator program... Hacka Doll.", "rate": 20, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Miyu Takagi", "Kaya Okuno", "Nanami Yamashita"], "character": ["Hacka Doll #1 (voice)", "Hacka Doll #2 (voice)", "Hacka Doll #3 (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73839   Expand Hacka Doll   (2015) User Score Overview In 2xxx, amidst a highly-developed information society, human beings are drowning in a sea of information. This leads to a situation where people cannot find the necessary information. The only hope to solve this problem is a navigator program... Hacka Doll. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyu Takagi Hacka Doll #1 (voice) Kaya Okuno Hacka Doll #2 (voice) Nanami Yamashita Hacka Doll #3 (voice) Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Hacka Doll premiered on October  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hacka Doll. You can help by rating TV shows you've seen. Facts Original Name  ハッカドール Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  8m Homepage   http://hackadoll-anime.com Genres Animation Comedy Sci-Fi & Fantasy Keywords artificial intelligence anime short episodes Content Score 56 We're so close, yet so far. Top Contributors 63 Marr 🇳🇱 m 3 magoozin 3 thextremehd6@gmail.com 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}