{"link": "https://www.themoviedb.org/tv/60950?language=en", "title": "Sex Sent Me to the ER", "resume": "Sex in a tree? A quickie in the closet? Laundry room relations? These are just a few of the out-of-the-ordinary places where amorous adventurers go to get intimate with their other halves. But few people expect to land themselves in the emergency room as a result! Brought to life for Discovery Fit & Health by GRB Entertainment, the production company behind the hit show UNTOLD STORIES OF THE ER, this all-new series documents the real-life and often hilarious stories of what happens when a little action leads to a medical crisis. Retold by emergency room physicians and the actual couples who, in the heat of the moment, got themselves into a fix and needed a doctor to fix it, this series illustrates how loving couples cope when sex goes outrageously wrong.", "rate": 47, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60950   Expand Sex Sent Me to the ER   (2013) User Score Overview Sex in a tree? A quickie in the closet? Laundry room relations? These are just a few of the out-of-the-ordinary places where amorous adventurers go to get intimate with their other halves. But few people expect to land themselves in the emergency room as a result! Brought to life for Discovery Fit & Health by GRB Entertainment, the production company behind the hit show UNTOLD STORIES OF THE ER, this all-new series documents the real-life and often hilarious stories of what happens when a little action leads to a medical crisis. Retold by emergency room physicians and the actual couples who, in the heat of the moment, got themselves into a fix and needed a doctor to fix it, this series illustrates how loving couples cope when sex goes outrageously wrong. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2016 | 6 Episodes Season 2 of Sex Sent Me to the ER premiered on January  2, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2005-07-20 Criss Angel Mindfreak 4.2  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Documentary Original Language  English Runtime  60m Homepage   http://www.tlc.com/tv-shows/sex-sent-me-to-the-er/ Genres Documentary Keywords sex emergency room Content Score 56 We're so close, yet so far. Top Contributors 27 Elizabeth Jennings TB 11 TMDb Bot 3 Farkas Tibor a 2 apung21  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}