{"link": "https://www.themoviedb.org/tv/65576?language=en", "title": "The Return of Sherlock Holmes", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 80, "genre": ["Mystery", "Crime", "Drama"], "cast": ["Jeremy Brett", "Donald Marshall Gray", "David Burke", "Colin Jeavons"], "character": ["Sherlock Holmes", "Mycroft", "Dr Watson", "Inspektor Lestrade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65576   Expand The Return of Sherlock Holmes   (1984) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew John Hawkesworth Creator Jeremy Brett Creator David Burke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Brett Sherlock Holmes Donald Marshall Gray Mycroft David Burke Dr Watson Colin Jeavons Inspektor Lestrade Full Cast & Crew Last Season Season 9 1994 | 6 Episodes Season 9 of The Return of Sherlock Holmes premiered on March  7, 1994. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Return of Sherlock Holmes. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Return of Sherlock Holmes. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Mystery Crime Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors A 40 Athanor66 S 22 Sherlock_Holmes m 18 mfuessl GS 10 Giuseppe Stia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}