{"link": "https://www.themoviedb.org/tv/70555?language=en", "title": "Po zakonam voyennogo vremeni", "resume": "It is July 1941, and the Nazis are advancing towards Kiev. A special squad is tasked with investigating major cases by acting both at the frontline and in the city itself, where rising criminals are joining German subversives in infiltrating the city, while a number of Soviet government representatives are happily profiting from other people’s misery.", "rate": 0, "genre": ["Drama"], "cast": ["Евгений Воловенко", "Игорь Петрусенко", "Aleksandr Pankratov-Chyornyy", "Ekaterina Klimova", "Maksim Drozd"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70555   Expand Po zakonam voyennogo vremeni   (2015) User Score Overview It is July 1941, and the Nazis are advancing towards Kiev. A special squad is tasked with investigating major cases by acting both at the frontline and in the city itself, where rising criminals are joining German subversives in infiltrating the city, while a number of Soviet government representatives are happily profiting from other people’s misery. Featured Crew Максим Мехеда Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Евгений Воловенко Игорь Петрусенко Aleksandr Pankratov-Chyornyy Ekaterina Klimova Maksim Drozd Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Po zakonam voyennogo vremeni premiered on May  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Po zakonam voyennogo vremeni. You can help by rating TV shows you've seen. Facts Original Name  По законам военного времени Status  Ended Networks - Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Scripted Original Language  Russian Runtime  - Homepage   http://www.starmediafilm.com/en/serial/za_zakonami_voyennogo_chasu Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 19 Moscalika 9 Banana i 6 iboltun TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}