{"link": "https://www.themoviedb.org/tv/4826?language=en", "title": "GSG 9 -  Ihr Einsatz ist ihr Leben", "resume": "GSG 9 is a German TV-series about the special unit GSG 9 der Bundespolizei of the German Federal Police. It premièred in the Spring of 2007.\nIts original title, GSG 9 - Ihr Einsatz ist ihr Leben, is a pun on the word Einsatz. Einsatz can be translated as \"mission, stake, bet, dedication\", depending on the context. Thus, it can be translated as, GSG 9 - Their Mission Is Their Life or GSG 9 - They Put Their Lives at Stake.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Marc Benjamin Puch", "Bülent Sharif", "Wanja Mues", "Jorres Risse", "André Hennicke"], "character": ["Gebhard Schurlau", "Demir Azlan", "Frederick Sedlack", "Frank Wernitz", "Thomas Anhoff"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4826   Expand GSG 9 -  Ihr Einsatz ist ihr Leben   (2007) User Score Overview GSG 9 is a German TV-series about the special unit GSG 9 der Bundespolizei of the German Federal Police. It premièred in the Spring of 2007. Its original title, GSG 9 - Ihr Einsatz ist ihr Leben, is a pun on the word Einsatz. Einsatz can be translated as \"mission, stake, bet, dedication\", depending on the context. Thus, it can be translated as, GSG 9 - Their Mission Is Their Life or GSG 9 - They Put Their Lives at Stake. Featured Crew Friedrich Wildfeuer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marc Benjamin Puch Gebhard Schurlau Bülent Sharif Demir Azlan Wanja Mues Frederick Sedlack Jorres Risse Frank Wernitz André Hennicke Thomas Anhoff Full Cast & Crew Last Season Season 2 2008 | 12 Episodes Season 2 of GSG 9 -  Ihr Einsatz ist ihr Leben premiered on February 14, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on GSG 9 -  Ihr Einsatz ist ihr Leben. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  45m Homepage   http://www.sat1.de/filme_serien/gsg9/ Genres Action & Adventure Keywords police Content Score 93 Almost there... Top Contributors S 44 Samara s 4 speedycars a 3 asusar m 3 mccalimero62  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}