{"link": "https://www.themoviedb.org/tv/33907?language=en", "title": "Downton Abbey", "resume": "A chronicle of the lives of the aristocratic Crawley family and their servants in the post-Edwardian era—with great events in history having an effect on their lives and on the British social hierarchy.", "rate": 80, "genre": ["Drama"], "cast": ["Hugh Bonneville", "Maggie Smith", "Michelle Dockery", "Jim Carter", "Laura Carmichael"], "character": ["Robert Crawley", "Violet Crawley", "Mary Crawley", "Mr. Carson", "Edith Crawley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33907   Expand Downton Abbey   (2010) User Score  Play Trailer Overview A chronicle of the lives of the aristocratic Crawley family and their servants in the post-Edwardian era—with great events in history having an effect on their lives and on the British social hierarchy. Featured Crew Julian Fellowes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  1 Images Backdrops  39 Posters  16 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Hugh Bonneville Robert Crawley Maggie Smith Violet Crawley Michelle Dockery Mary Crawley Jim Carter Mr. Carson Laura Carmichael Edith Crawley Full Cast & Crew Last Season Original Air Date Original Air Date Netflix Order (Digital) Series 6 2015 | 8 Episodes View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply binge watching this series Open 71 by  Anna Suggestions for other Period Dramas? Open 17 by  genplant29 w Anna Bates: Happy Birthday Joanne Froggatt! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  39 Posters  16 Recommendations   2007-07-19 Mad Men 8.0    2001-06-03 Six Feet Under 8.2    2005-08-28 Rome 8.2    2013-03-04 Broadchurch 8.1    2011-04-03 The Killing 7.5    2010-05-04 Luther 7.9    2009-09-22 The Good Wife 7.2    2010-09-26 Borgen 8.0  Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  66m, 40m, 47m Homepage   http://www.itv.com/downtonabbey Genres Drama Keywords england servant yorkshire period drama aristocrat estate costume drama upstairs downstairs Content Score 100 Yes! Looking good! Top Contributors 138 Elizabeth Jennings 82 Banana 18 Steve G 14 Giaten  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}