{"link": "https://www.themoviedb.org/tv/46613?language=en", "title": "Ghost Mine", "resume": "Ghost Mine is an American paranormal television series that premiered on January 16, 2013 in the United States on Syfy channel. The series features a group of hard rock miners searching for gold in Oregon's Crescent Mine. Two paranormal investigators accompany them in an attempt to determine if the location is haunted.\nOn April 10, 2013, Syfy renewed the series for a 12 episode second season, set to premiere September 4, 2013.", "rate": 60, "genre": ["Reality"], "cast": ["Patrick Doyle", "Kristen Lumen", "Jamol Eli"], "character": ["Paranormal Investigator", "Paranormal Investigator", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46613   Expand Ghost Mine   (2013) User Score Overview Ghost Mine is an American paranormal television series that premiered on January 16, 2013 in the United States on Syfy channel. The series features a group of hard rock miners searching for gold in Oregon's Crescent Mine. Two paranormal investigators accompany them in an attempt to determine if the location is haunted. On April 10, 2013, Syfy renewed the series for a 12 episode second season, set to premiere September 4, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Doyle Paranormal Investigator Kristen Lumen Paranormal Investigator Jamol Eli Himself Full Cast & Crew Last Season Season 2 2013 | 12 Episodes Season 2 of Ghost Mine premiered on September  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ghost Mine. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  45m Homepage  - Genres Reality Keywords mine miner paranormal show Content Score 56 We're so close, yet so far. Top Contributors 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}