{"link": "https://www.themoviedb.org/tv/42411?language=en", "title": "The Betrayal Knows My Name", "resume": "Gifted with a strange ability to see into the troubles of others, kind-hearted Yuki Sakurai finds his life turned upside down the day a handsome stranger named Luka appears. Suddenly, evil beings known as \"Duras\" begin hunting for him and a world of magic, terror, and a dark truth about his past surround him.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Soichiro Hoshi", "Takahiro Sakurai", "Akira Ishida", "Daisuke Ono", "Hiroshi Kamiya"], "character": ["Yuki Giou", "Luka Crosszeria", "Kanata Wakamiya", "Hotsuma Renjou", "Kuroto Hourai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42411   Expand The Betrayal Knows My Name   (2010) User Score Overview Gifted with a strange ability to see into the troubles of others, kind-hearted Yuki Sakurai finds his life turned upside down the day a handsome stranger named Luka appears. Suddenly, evil beings known as \"Duras\" begin hunting for him and a world of magic, terror, and a dark truth about his past surround him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Soichiro Hoshi Yuki Giou Takahiro Sakurai Luka Crosszeria Akira Ishida Kanata Wakamiya Daisuke Ono Hotsuma Renjou Hiroshi Kamiya Kuroto Hourai Full Cast & Crew Last Season Season 1 2010 | 24 Episodes Season 1 of The Betrayal Knows My Name premiered on April 11, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Betrayal Knows My Name. You can help by rating TV shows you've seen. Facts Original Name  裏切りは僕の名前を知っている Status  Ended Networks - Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.uraboku.jp/ Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 39 Marr 🇳🇱 4 seboseboss V 3 VegaKita m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}