{"link": "https://www.themoviedb.org/tv/61550?language=en", "title": "Marvel's Agent Carter", "resume": "It's 1946, and peace has dealt Peggy Carter a serious blow as she finds herself marginalized when the men return home from fighting abroad. Working for the covert SSR (Strategic Scientific Reserve), Peggy must balance doing administrative work and going on secret missions for Howard Stark all while trying to navigate life as a single woman in America, in the wake of losing the love of her life - Steve Rogers.", "rate": 75, "genre": ["Action", "Adventure"], "cast": ["Hayley Atwell", "James D'Arcy", "Chad Michael Murray", "Enver Gjokaj", "Bridget Regan"], "character": ["Peggy Carter", "Edwin Jarvis", "Jack Thompson", "Daniel Sousa", "Dottie Underwood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61550   Expand Marvel's Agent Carter   (2015) User Score Overview It's 1946, and peace has dealt Peggy Carter a serious blow as she finds herself marginalized when the men return home from fighting abroad. Working for the covert SSR (Strategic Scientific Reserve), Peggy must balance doing administrative work and going on secret missions for Howard Stark all while trying to navigate life as a single woman in America, in the wake of losing the love of her life - Steve Rogers. Featured Crew Stephen McFeely Creator Christopher Markus Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  4 Images Backdrops  15 Posters  22 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hayley Atwell Peggy Carter James D'Arcy Edwin Jarvis Chad Michael Murray Jack Thompson Enver Gjokaj Daniel Sousa Bridget Regan Dottie Underwood Full Cast & Crew Last Season Season 2 2016 | 10 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply James D'Arcy and Haley Atwell Open 0 by Norrin_Radd_Of_Zenn_La\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  15 Posters  22 Recommendations   2015-11-20 Marvel's Jessica Jones 7.6    2013-09-24 Marvel's Agents of S.H.I.E.L.D. 6.7    2014-10-24 Constantine 7.2    2015-04-10 Marvel's Daredevil 7.7    2016-09-30 Marvel's Luke Cage 6.9    2013-09-16 Sleepy Hollow 6.4    2009-07-07 Warehouse 13 7.2    2014-09-22 Forever 7.5  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/marvels-agent-carter Genres Action Adventure Keywords based on comic marvel cinematic universe 1940s Content Score 100 Yes! Looking good! Top Contributors 101 Elizabeth Jennings 33 seawolf 25 davekeys R 21 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}