{"link": "https://www.themoviedb.org/tv/69853?language=en", "title": "Goodbye Ghosts!", "resume": "Madoka Tsutsumi is a university student. He rarely expresses his feelings and he has never done an impulsive act in his life. One night, he sees an old man and a pink rabbit struggling physically. The pink rabbit seems surprised and asks Madoka if he can see them. The pink rabbit then introduces itself as the Angel of Death and says the old man is a ghost who died yesterday.", "rate": 0, "genre": ["Comedy"], "cast": ["Sota Fukushi", "Tao Tsuchiya", "Ryohei Suzuki", "Mugi Kadowaki", "Kokone Hamada"], "character": ["Madoka Tsutsumi", "Sachi Aguma", "Nabeshima", "Chisato Ogawa", "Yuzuko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69853   Expand Goodbye Ghosts!   (2016) User Score Overview Madoka Tsutsumi is a university student. He rarely expresses his feelings and he has never done an impulsive act in his life. One night, he sees an old man and a pink rabbit struggling physically. The pink rabbit seems surprised and asks Madoka if he can see them. The pink rabbit then introduces itself as the Angel of Death and says the old man is a ghost who died yesterday. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sota Fukushi Madoka Tsutsumi Tao Tsuchiya Sachi Aguma Ryohei Suzuki Nabeshima Mugi Kadowaki Chisato Ogawa Kokone Hamada Yuzuko Full Cast & Crew Last Season Season 1 2016 | 9 Episodes Season 1 of Goodbye Ghosts! premiered on April 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Goodbye Ghosts!. You can help by rating TV shows you've seen. Facts Original Name  お迎えです。 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage   http://www.ntv.co.jp/omukaedesu/ Genres Comedy Keywords japan ghost Content Score 86 Almost there... Top Contributors M 35 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}