{"link": "https://www.themoviedb.org/tv/14519?language=en", "title": "", "resume": "All Quiet on the Preston Front (or the shortened Preston Front as it became known for series two and three) was a BBC comedy drama about a group of friends in the fictional Lancashire town of Roker Bridge, and their links to the local Territorial Army infantry platoon. It was created by Tim Firth and ran from 1994 to 1997.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["Colin Buchanan", "Paul Haigh", "Caroline Catz", "Adrian Hood", "Alistair McGowan"], "character": ["Hodge", "Eric", "Dawn", "Lloydy", "Spock"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14519   Expand (All Quiet on the) Preston Front   (1994) User Score Overview All Quiet on the Preston Front (or the shortened Preston Front as it became known for series two and three) was a BBC comedy drama about a group of friends in the fictional Lancashire town of Roker Bridge, and their links to the local Territorial Army infantry platoon. It was created by Tim Firth and ran from 1994 to 1997. Featured Crew Tim Firth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Colin Buchanan Hodge Paul Haigh Eric Caroline Catz Dawn Adrian Hood Lloydy Alistair McGowan Spock Full Cast & Crew Last Season Series 3 1997 | 7 Episodes Season 3 of (All Quiet on the) Preston Front premiered on July 21, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on (All Quiet on the) Preston Front. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  40m, 50m Homepage  - Genres Comedy Drama Keywords friendship northern england british army love child relationships territorial army Content Score 79 Pump it up! We're close now. Top Contributors 74 Markxist H 13 HelloCharlie 11 Elizabeth Jennings PS 7 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}