{"link": "https://www.themoviedb.org/tv/69629?language=en", "title": "The Gifted", "resume": "A suburban couple's ordinary lives are rocked by the sudden discovery that their children possess mutant powers. Forced to go on the run from a hostile government, the family joins up with an underground network of mutants and must fight to survive.", "rate": 70, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Stephen Moyer", "Amy Acker", "Natalie Alyn Lind", "Percy Hynes White", "Sean Teale"], "character": ["Reed Strucker", "Caitlin Strucker", "Lauren Strucker", "Andy Strucker", "Marcos Diaz / Eclipse"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69629   Expand The Gifted   (2017) User Score  Play Trailer Overview A suburban couple's ordinary lives are rocked by the sudden discovery that their children possess mutant powers. Forced to go on the run from a hostile government, the family joins up with an underground network of mutants and must fight to survive. Featured Crew Matt Nix Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  15 Content Issues  1 Images Backdrops  9 Posters  16 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Moyer Reed Strucker Amy Acker Caitlin Strucker Natalie Alyn Lind Lauren Strucker Percy Hynes White Andy Strucker Sean Teale Marcos Diaz / Eclipse Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of The Gifted premiered on October  1, 2017. View All Seasons Social Reviews  1 Discussions  16 dc A review by dr cherry peper  10.0 Written by  dr cherry peper  on October  3, 2017 after watching the first episode of this program I am not afraid to admit that if it keeps going like this we are in for a huge action show and very enjoyable experience I am so ready to watch more of the story and you are sure going to enjoy this for sure if you keep an open mind you will for sure enjoy it this completely blew my expectations out of the water and I was spellbound cant wait for more of the story Read All Reviews Media Most Popular Videos  1 Backdrops  9 Posters  16 Recommendations   2017-09-29 Marvel's Inhumans 5.6    2017-11-21 Marvel's Runaways 7.3    2017-09-10 The Orville 7.2    2017-09-25 The Brave 6.6    2017-08-18 Marvel's The Defenders 7.1    2017-10-01 Ghosted 6.2    2017-09-27 SEAL Team 6.6    2017-09-25 The Good Doctor 7.9  Facts Status  Returning Series Network Certification PG Meaning Parental guidance. Moderate violence and moderate profanity is allowed, as is brief nudity and sexual references if important to the context of the story. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.fox.com/the-gifted Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords superhero mutant based on comic on the run family based on graphic novel super power hunted Content Score 100 Yes! Looking good! Top Contributors 41 Banana 33 Elizabeth Jennings t 33 tmdb42368388 r 29 racci  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}