{"link": "https://www.themoviedb.org/tv/13264?language=en", "title": "The Legends of Treasure Island", "resume": "The Legends Of Treasure Island is an animated cartoon from the UK that ran from 1993-1995. It had two series of 13 episodes each and each episode runs for 22–25 minutes.\nThe series was loosely based on Robert Louis Stevenson's original story \"Treasure Island\". Featuring a mysterious and dark storyline, it incorporates magic and many new characters. Unlike the book and most adaptations Long John Silver is not an anti-hero with dubious morality but rather a straight villain. It was broadcast in the United Kingdom and in other countries throughout Europe and Latin America and was also aired in Australia. The programme was a FilmFair production for Central Independent Television, The Legends of Treasure Island, is owned by ITV PLC.", "rate": 100, "genre": ["Family", "Animation"], "cast": ["Hugh Laurie", "Chris Barrie", "Richard E. Grant", "Dawn French", "Juliet Stevenson"], "character": ["Squire Trelawney (voice)", "Captain Smollett (voice)", "Long John Silver (voice)", "Jim Hawkins (voice)", "Jane (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13264   Expand The Legends of Treasure Island   (1993) User Score Overview The Legends Of Treasure Island is an animated cartoon from the UK that ran from 1993-1995. It had two series of 13 episodes each and each episode runs for 22–25 minutes. The series was loosely based on Robert Louis Stevenson's original story \"Treasure Island\". Featuring a mysterious and dark storyline, it incorporates magic and many new characters. Unlike the book and most adaptations Long John Silver is not an anti-hero with dubious morality but rather a straight villain. It was broadcast in the United Kingdom and in other countries throughout Europe and Latin America and was also aired in Australia. The programme was a FilmFair production for Central Independent Television, The Legends of Treasure Island, is owned by ITV PLC. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Laurie Squire Trelawney (voice) Chris Barrie Captain Smollett (voice) Richard E. Grant Long John Silver (voice) Dawn French Jim Hawkins (voice) Juliet Stevenson Jane (voice) Full Cast & Crew Last Season Season 2 1995 | 13 Episodes Season 2 of The Legends of Treasure Island premiered on April  4, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Legends of Treasure Island. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  22m, 20m Homepage  - Genres Family Animation Keywords island magic pirate based on children's book Content Score 71 Just a little bit more... Top Contributors 18 Banana o 7 ostafrallan d 6 desert188  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}