{"link": "https://www.themoviedb.org/tv/43274?language=en", "title": "Bikie Wars: Brothers in Arms", "resume": "Bikie Wars: Brothers in Arms is a six-part Australian drama miniseries, screened on Network Ten on 15 May 2012. Bikie Wars is based on the book Brothers in Arms by Lindsay Simpson and Sandra Harvey. The screenplay was written by Greg Haddrick, Roger Simpson and Jo Martino. It is directed by Peter Andrikidis. Bikie Wars: Brothers in Arms cost A$6,000,000 to make.", "rate": 80, "genre": ["Drama"], "cast": ["Callan Mulvey", "Anthony Hayes", "Damian Walshe-Howling", "Susie Porter", "Todd Lasance"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43274   Expand Bikie Wars: Brothers in Arms   (2012) User Score Overview Bikie Wars: Brothers in Arms is a six-part Australian drama miniseries, screened on Network Ten on 15 May 2012. Bikie Wars is based on the book Brothers in Arms by Lindsay Simpson and Sandra Harvey. The screenplay was written by Greg Haddrick, Roger Simpson and Jo Martino. It is directed by Peter Andrikidis. Bikie Wars: Brothers in Arms cost A$6,000,000 to make. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Callan Mulvey Anthony Hayes Damian Walshe-Howling Susie Porter Todd Lasance Full Cast & Crew Last Season Season 1 2012 | 6 Episodes Season 1 of Bikie Wars: Brothers in Arms premiered on May 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bikie Wars: Brothers in Arms. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  40m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 gromo3eka w 3 webmaster 1 Elizabeth Jennings R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}