{"link": "https://www.themoviedb.org/tv/42576?language=en", "title": "Duets", "resume": "Duets is a singing competition reality television show that premiered on May 24, 2012 on ABC. The show starred Kelly Clarkson, John Legend, Robin Thicke, and Jennifer Nettles as mentors who search for singers to duet with them as they perform in front of a live studio audience. Quddus serves as the host. The show is a production of Keep Calm and Carry On Productions. Robert Deaton and Charles Wachter are the executive producers.\nOn April 30, 2012, it was confirmed that John Legend had replaced Lionel Richie as a mentor on the show; Richie left the show citing \"personal scheduling conflicts.\"", "rate": 0, "genre": [], "cast": ["John Legend", "Kelly Clarkson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42576   Expand Duets   (2012) User Score Overview Duets is a singing competition reality television show that premiered on May 24, 2012 on ABC. The show starred Kelly Clarkson, John Legend, Robin Thicke, and Jennifer Nettles as mentors who search for singers to duet with them as they perform in front of a live studio audience. Quddus serves as the host. The show is a production of Keep Calm and Carry On Productions. Robert Deaton and Charles Wachter are the executive producers. On April 30, 2012, it was confirmed that John Legend had replaced Lionel Richie as a mentor on the show; Richie left the show citing \"personal scheduling conflicts.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Legend Kelly Clarkson Full Cast & Crew Last Season Season 1 2012 | 9 Episodes Season 1 of Duets premiered on May 24, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Duets. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 1 Michael 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}