{"link": "https://www.themoviedb.org/tv/73348?language=en", "title": "Trop", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Evelyne Brochu", "Virginie Fortin", "Anne-Marie Cadieux", "Éric Bruneau"], "character": ["Isabelle Desbiens", "Anaïs Desbiens", "Myriam Champagne", "Marc-Antoine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73348   Expand Trop   (2017) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Marie-Andrée Labbé Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Evelyne Brochu Isabelle Desbiens Virginie Fortin Anaïs Desbiens Anne-Marie Cadieux Myriam Champagne Éric Bruneau Marc-Antoine Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Trop premiered on March 23, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Trop. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Trop. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  30m Homepage   http://ici.radio-canada.ca/tele/trop/site Genres Drama Comedy Keywords montreal thirty something bipolar disorder Content Score 86 Almost there... Top Contributors m 26 marcdede 19 Banana 19 Guipat 10 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}