{"link": "https://www.themoviedb.org/tv/19863?language=en", "title": "Captain Mack", "resume": "Captain Mack is a British children's television show set in the town of Sunshine City. It was created and developed by John Lomas-Bullivant at Fireback Entertainment and was first broadcast in February 2008. The series currently runs on CITV's pre-school slot Mini CITV and Tiny Pop. In Australia, it is shown on ABC2 - in particular on Saturday and Sunday mornings at 8.40am. It also runs in New Zealand on TVNZ 7. It also aired on Cartoonito in 2013 earlier than before.", "rate": 0, "genre": [], "cast": ["Akiya Henry", "Rikki Chamberlain", "Andrew Greenough", "Julia Mallam", "Bennet Thorpe"], "character": ["Rosie Raucous", "Samson", "Mayor Gaston Goody", "Camilla Divine", "Captain Mack"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19863   Expand Captain Mack   (2008) User Score Overview Captain Mack is a British children's television show set in the town of Sunshine City. It was created and developed by John Lomas-Bullivant at Fireback Entertainment and was first broadcast in February 2008. The series currently runs on CITV's pre-school slot Mini CITV and Tiny Pop. In Australia, it is shown on ABC2 - in particular on Saturday and Sunday mornings at 8.40am. It also runs in New Zealand on TVNZ 7. It also aired on Cartoonito in 2013 earlier than before. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akiya Henry Rosie Raucous Rikki Chamberlain Samson Andrew Greenough Mayor Gaston Goody Julia Mallam Camilla Divine Bennet Thorpe Captain Mack Full Cast & Crew Last Season Season 1 2008 | 52 Episodes Season 1 of Captain Mack premiered on May  4, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Captain Mack. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}