{"link": "https://www.themoviedb.org/tv/6318?language=en", "title": "Assy McGee", "resume": "Assy McGee is an animated sitcom featuring police detective Assy McGee, a parody of tough-guy cop shows and movies, who is literally a walking pair of buttocks. Along with his partner Don Sanchez, the trigger-happy McGee solves crimes in a fictionalized Exeter, New Hampshire. Larry Murphy voices all of the main characters. The series premiered on November 26, 2006, on Adult Swim and was canceled after season two ended on July 6, 2008.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": ["H. Jon Benjamin", "Jon Glaser", "H. Jon Benjamin", "Patrice O'Neal", "Larry Murphy"], "character": ["Mayor", "Additional", "Blind Anthony"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6318   Expand Assy McGee   (2006) User Score Overview Assy McGee is an animated sitcom featuring police detective Assy McGee, a parody of tough-guy cop shows and movies, who is literally a walking pair of buttocks. Along with his partner Don Sanchez, the trigger-happy McGee solves crimes in a fictionalized Exeter, New Hampshire. Larry Murphy voices all of the main characters. The series premiered on November 26, 2006, on Adult Swim and was canceled after season two ended on July 6, 2008. Featured Crew Matt Harrigan Creator Jon Glaser Creator H. Jon Benjamin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast H. Jon Benjamin Mayor Jon Glaser H. Jon Benjamin Additional Patrice O'Neal Blind Anthony Larry Murphy Full Cast & Crew Last Season Season 2 2008 | 14 Episodes Season 2 of Assy McGee premiered on April  6, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Assy McGee. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 18+ Meaning Programming intended for viewers ages 18 and older. May contain explicit violence and sexual activity. Programming with this rating cannot air before the watershed (9:00 p.m. to 6:00 a.m.). Type  Scripted Original Language  English Runtime  15m, 11m Homepage   http://www.adultswim.com/shows/assy/ Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors m 1 movie28 A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}