{"link": "https://www.themoviedb.org/tv/73816?language=en", "title": "Jenny", "resume": "A journey into the heart of a 13-year-old girl diagnosed with leukemia. Far from being overwhelmed, she discovers rather an impressive force of character that helps her fight her illness.", "rate": 0, "genre": ["Drama", "Family"], "cast": ["Émilie Bierre", "William Coallier", "Tayna V. Lavoie", "Henri Picard", "Patrice Godin"], "character": ["Jenny", "Félix-Antoine", "Florence", "Charles", "Père de Jenny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73816   Expand Jenny   (2017) User Score Overview A journey into the heart of a 13-year-old girl diagnosed with leukemia. Far from being overwhelmed, she discovers rather an impressive force of character that helps her fight her illness. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Émilie Bierre Jenny William Coallier Félix-Antoine Tayna V. Lavoie Florence Henri Picard Charles Patrice Godin Père de Jenny Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Jenny premiered on September  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jenny. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  French Runtime  15m Homepage   https://unis.ca/jenny Genres Drama Family Keywords leukemia cancer Content Score 86 Almost there... Top Contributors 28 Elizabeth Jennings j 20 joethebeef 4 Banana 3 kingkong25  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}