{"link": "https://www.themoviedb.org/tv/65988?language=en", "title": "Wynonna Earp", "resume": "Based on the IDW Comic, Wynonna Earp follows Wyatt Earp's great granddaughter as she battles demons and other creatures. With her unique abilities, and a posse of dysfunctional allies, she's the only thing that can bring the paranormal to justice.", "rate": 63, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Western"], "cast": ["Melanie Scrofano", "Shamier Anderson", "Tim Rozon", "Dominique Provost-Chalkley", "Katherine Barrell"], "character": ["Wynonna Earp", "Xavier Dolls", "John Henry \"Doc\" Holliday", "Waverly Earp", "Nicole Haught"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65988   Expand Wynonna Earp   (2016) User Score  Play Trailer Overview Based on the IDW Comic, Wynonna Earp follows Wyatt Earp's great granddaughter as she battles demons and other creatures. With her unique abilities, and a posse of dysfunctional allies, she's the only thing that can bring the paranormal to justice. Featured Crew Emily Andras Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  2 Images Backdrops  24 Posters  10 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  1 Opening Credits  0 Top Billed Cast Melanie Scrofano Wynonna Earp Shamier Anderson Xavier Dolls Tim Rozon John Henry \"Doc\" Holliday Dominique Provost-Chalkley Waverly Earp Katherine Barrell Nicole Haught Full Cast & Crew Next Season Season 3 2018 | 1 Episode Season 3 of Wynonna Earp is set to premiere on July 20, 2018. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply (Spoiler) What They Did To Agent Lucado ... Open 2 by  janar Does Someone Know The Name Of This Actor? Open 4 by  janar Special Effects Open 0 by janar\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  24 Posters  10 Recommendations   2016-09-23 Van Helsing 5.6    2016-09-27 Aftermath 6.1    2016-01-22 Stan Lee's Lucky Man 7.3    2016-01-05 The Shannara Chronicles 6.4    2015-06-19 Killjoys 6.7    2016-06-28 Dead of Summer 5.3    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1    2012-10-29 Wizards vs Aliens 6.7  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.syfy.com/wynonnaearp Genres Action & Adventure Sci-Fi & Fantasy Western Keywords sibling relationship paranormal based on graphic novel lgbt family curse revenant Content Score 100 Yes! Looking good! Top Contributors 288 janar 41 Rug 40 Elizabeth Jennings 22 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}