{"link": "https://www.themoviedb.org/tv/34751?language=en", "title": "Steel Angel Kurumi", "resume": "Steel Angel Kurumi is a manga and anime series following the adventures of its titular character created by Kaishaku. Directed by Naohito Takahashi, animated by Oriental Light and Magic and produced by Pony Canyon with character designs by Yuriko Chiba and Yuji Ikeda and music by Toshihiko Sahashi, it has been translated and released in North America by ADV Films. In 2008 Crunchyroll announced it had partnered with Pony Canyon to release all Steel Angel Kurumi series' for streaming and download.\nThe Kurumi series as a whole consists of the first show Steel Angel Kurumi, four OVA episodes entitled Steel Angel Kurumi Encore, and a second show by the name of Steel Angel Kurumi 2, plus a sort-of dramatic prequel \"Steel Angel Kurumi 0\". A live-action version was made, titled Steel Angel Kurumi Pure, but has a different continuity to the anime. This show was originally aired in Japan as part of WOWOW's Anime Complex.\nThe anime is set in an alternate history version of Japan during the Taishō period.", "rate": 0, "genre": ["Drama", "Animation", "Comedy"], "cast": ["Toshiyuki Morikawa", "Tomomichi Nishimura", "Hirotaka Suzuoki", "Yasunori Matsumoto", "Masayo Kurata"], "character": ["Dr. Brandow", "Dr. Walski", "Dr. Ayanokouji", "Kamihito Kagura", "Karinka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34751   Expand Steel Angel Kurumi   (1999) User Score Overview Steel Angel Kurumi is a manga and anime series following the adventures of its titular character created by Kaishaku. Directed by Naohito Takahashi, animated by Oriental Light and Magic and produced by Pony Canyon with character designs by Yuriko Chiba and Yuji Ikeda and music by Toshihiko Sahashi, it has been translated and released in North America by ADV Films. In 2008 Crunchyroll announced it had partnered with Pony Canyon to release all Steel Angel Kurumi series' for streaming and download. The Kurumi series as a whole consists of the first show Steel Angel Kurumi, four OVA episodes entitled Steel Angel Kurumi Encore, and a second show by the name of Steel Angel Kurumi 2, plus a sort-of dramatic prequel \"Steel Angel Kurumi 0\". A live-action version was made, titled Steel Angel Kurumi Pure, but has a different continuity to the anime. This show was originally aired in Japan as part of WOWOW's Anime Complex. The anime is set in an alternate history version of Japan during the Taishō period. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshiyuki Morikawa Dr. Brandow Tomomichi Nishimura Dr. Walski Hirotaka Suzuoki Dr. Ayanokouji Yasunori Matsumoto Kamihito Kagura Masayo Kurata Karinka Full Cast & Crew Last Season Season 2 2001 | 12 Episodes Season 2 of Steel Angel Kurumi premiered on April 12, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Steel Angel Kurumi. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Drama Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 Marr 🇳🇱 m 3 magoozin A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}