{"link": "https://www.themoviedb.org/tv/51835?language=en", "title": "My Lovely", "resume": "Khun Ton is a writer who writes romance novels. Pimmapa is a brand manager at a cosmetic brand called Naree. Story starts out with Khun Ton taking pictures at a villa on the mountains and accidently captures Pimmapa on his camera. He is immediately memorized by her beauty. They have a short encounter where he returns her lost phone to her and they go their separate ways. Long story short, Pimmapa comes back to Bangkok and finds out her boyfriend P'Eak cheated on her with two women on her wedding day. She meets Khun Ton again on her vacation and they being to hang out. They come back to Bangkok again separately and things happen that leads Pimmapa to the bar where she gets drunk and is saved by Khun Ton from being kidnapped by bad men. He takes her to her condo and as she is drunk, she tells him about her corrupted wedding day and her horrible cheating ex-boyfriend. Khun Ton comforts her and tells her that there are still many good men in the world. Pimmapa forces him to sign the marriage certificate that she still kept from the wedding day. After a bunch of convincing and making him feel guilty, Pimmapa successfully gets Khun Ton to sign the marriage certificate. The next morning, they both wake up and Pimmapa finds out they both are husband and wife because they signed the marriage certificate, but because it was not turned into the state's office(or something like that), the marriage was not official. However, Pimmapa convinces Khun Ton to pretend to be her husband for the sake of her parents and he agrees. They end up being fake husband and wife through the story but begins to develop real feelings towards each other because of their jealousy. Khun Ton is jealous of Pimmapa because her boss Khun Triwin is in love with her and tries to get close to her. Pimmapa is jealous of Khun Ton because his almost fiancée Karakade finally meets him and she wants him. She pretends to be a good girl in front of Khun Ton's grandma, but is actually a very evil person. Bad things happen because of third wheel people in the story that wants Khun Ton and Pimmapa to separate. However, Khun Ton's sister Mint and his cousin Kingkaew, Pimmapa's friends and family supports them being together, even though they all found out that the marriage was fake. In the end, the bad people loses and Khun Ton and pimmapa ends up together. The ending scene is at the same villa where Khun Ton first captured a picture of pimmapa. They hug, kiss and do all those lovey dovey things that happen in every thai lakorn.", "rate": 59, "genre": ["Soap", "Drama"], "cast": ["Patchata Nampan", "Araya Alberta Hargate", "May Fuengarom", "Vorarit Fuangarome", "Wiragarn Seneetunti"], "character": ["Ridchawee/Ton", "Pimmapa/Pim", "Lan", "Pat(Pimmapa's older brother)", "Mint(Khun Ton's younger sister)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51835   Expand My Lovely (Fake) Husband   (2012) User Score  Play Trailer Overview Khun Ton is a writer who writes romance novels. Pimmapa is a brand manager at a cosmetic brand called Naree. Story starts out with Khun Ton taking pictures at a villa on the mountains and accidently captures Pimmapa on his camera. He is immediately memorized by her beauty. They have a short encounter where he returns her lost phone to her and they go their separate ways. Long story short, Pimmapa comes back to Bangkok and finds out her boyfriend P'Eak cheated on her with two women on her wedding day. She meets Khun Ton again on her vacation and they being to hang out. They come back to Bangkok again separately and things happen that leads Pimmapa to the bar where she gets drunk and is saved by Khun Ton from being kidnapped by bad men. He takes her to her condo and as she is drunk, she tells him about her corrupted wedding day and her horrible cheating ex-boyfriend. Khun Ton comforts her and tells her that there are still many good men in the world. Pimmapa forces him to sign the marriage certificate that she still kept from the wedding day. After a bunch of convincing and making him feel guilty, Pimmapa successfully gets Khun Ton to sign the marriage certificate. The next morning, they both wake up and Pimmapa finds out they both are husband and wife because they signed the marriage certificate, but because it was not turned into the state's office(or something like that), the marriage was not official. However, Pimmapa convinces Khun Ton to pretend to be her husband for the sake of her parents and he agrees. They end up being fake husband and wife through the story but begins to develop real feelings towards each other because of their jealousy. Khun Ton is jealous of Pimmapa because her boss Khun Triwin is in love with her and tries to get close to her. Pimmapa is jealous of Khun Ton because his almost fiancée Karakade finally meets him and she wants him. She pretends to be a good girl in front of Khun Ton's grandma, but is actually a very evil person. Bad things happen because of third wheel people in the story that wants Khun Ton and Pimmapa to separate. However, Khun Ton's sister Mint and his cousin Kingkaew, Pimmapa's friends and family supports them being together, even though they all found out that the marriage was fake. In the end, the bad people loses and Khun Ton and pimmapa ends up together. The ending scene is at the same villa where Khun Ton first captured a picture of pimmapa. They hug, kiss and do all those lovey dovey things that happen in every thai lakorn.  Featured Crew Maker J Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patchata Nampan Ridchawee/Ton Araya Alberta Hargate Pimmapa/Pim May Fuengarom Lan Vorarit Fuangarome Pat(Pimmapa's older brother) Wiragarn Seneetunti Mint(Khun Ton's younger sister) Full Cast & Crew Last Season Season 1 2012 | 14 Episodes Season 1 of My Lovely (Fake) Husband premiered on December 10, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on My Lovely (Fake) Husband. You can help by rating TV shows you've seen. Facts Original Name  คุณสามี(กำมะลอ)ที่รัก ตอนที่ Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  99m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 47 Crip 3 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}