{"link": "https://www.themoviedb.org/tv/4489?language=en", "title": "Josie and the Pussycats", "resume": "Josie and the Pussycats is an American animated television series, based upon the Archie Comics comic book series of the same name created by Dan DeCarlo. Produced for Saturday morning television by Hanna-Barbera Productions, sixteen episodes of Josie and the Pussycats aired on CBS during the 1970-71 television season, and were rerun during the 1971-72 season. In 1972, the show was re-conceptualized as Josie and the Pussycats in Outer Space, sixteen episodes of which aired on CBS during the 1972-73 season and were rerun the following season. Reruns of the original series alternated between CBS, ABC, and NBC from 1974 through 1976. This brought its national Saturday morning TV run on three networks to six years.\nJosie and the Pussycats featured an all-girl pop music band that toured the world with their entourage, getting mixed up in strange adventures, spy capers, and mysteries. On the small-screen, the group consisted of level-headed lead singer and guitarist Josie, intelligent tambourinist Valerie, and air-headed blonde drummer Melody. Other characters included their cowardly manager Alexander Cabot III, his conniving sister Alexandra, her cat Sebastian, and muscular roadie Alan.", "rate": 47, "genre": ["Animation"], "cast": ["Casey Kasem", "Don Messick", "Janet Waldo", "Jerry Dexter", "Sherry Alberoni"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4489   Expand Josie and the Pussycats   (1970) User Score Overview Josie and the Pussycats is an American animated television series, based upon the Archie Comics comic book series of the same name created by Dan DeCarlo. Produced for Saturday morning television by Hanna-Barbera Productions, sixteen episodes of Josie and the Pussycats aired on CBS during the 1970-71 television season, and were rerun during the 1971-72 season. In 1972, the show was re-conceptualized as Josie and the Pussycats in Outer Space, sixteen episodes of which aired on CBS during the 1972-73 season and were rerun the following season. Reruns of the original series alternated between CBS, ABC, and NBC from 1974 through 1976. This brought its national Saturday morning TV run on three networks to six years. Josie and the Pussycats featured an all-girl pop music band that toured the world with their entourage, getting mixed up in strange adventures, spy capers, and mysteries. On the small-screen, the group consisted of level-headed lead singer and guitarist Josie, intelligent tambourinist Valerie, and air-headed blonde drummer Melody. Other characters included their cowardly manager Alexander Cabot III, his conniving sister Alexandra, her cat Sebastian, and muscular roadie Alan. Featured Crew Dan DeCarlo Creator Art Davis Creator Joe Ruby Creator Ken Spears Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casey Kasem Don Messick Janet Waldo Jerry Dexter Sherry Alberoni Full Cast & Crew Last Season Season 1 1970 | 16 Episodes Season 1 of Josie and the Pussycats premiered on September 12, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Josie and the Pussycats. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 21m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 2 minhus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}