{"link": "https://www.themoviedb.org/tv/38189?language=en", "title": "Endgame", "resume": "Endgame is a Canadian drama television series that premiered on the Showcase Television network on Monday, March 14, 2011. The series is developed and produced by Thunderbird Films. The series follows former World Chess Champion Arkady Balagan, a genius who uses his analytical skills to solve crimes.\nThe show starts three months after the death of Balagan's fiancée Rosemary, where Balagan has developed agoraphobia. Balagan uses those faculties he honed playing chess to help him solve cases.\nIn the United States, the series is broadcast exclusively on Hulu.", "rate": 75, "genre": ["Drama", "Action", "Adventure"], "cast": ["Shawn Doyle", "Patrick Gallagher", "Katharine Isabelle", "Lisa Ray", "Melanie Papalia"], "character": ["Arkady Balagan", "Hugo Lum", "Danni", "Rosemary Venturi", "Pippa Venturi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38189   Expand Endgame   (2011) User Score  Play Trailer Overview Endgame is a Canadian drama television series that premiered on the Showcase Television network on Monday, March 14, 2011. The series is developed and produced by Thunderbird Films. The series follows former World Chess Champion Arkady Balagan, a genius who uses his analytical skills to solve crimes. The show starts three months after the death of Balagan's fiancée Rosemary, where Balagan has developed agoraphobia. Balagan uses those faculties he honed playing chess to help him solve cases. In the United States, the series is broadcast exclusively on Hulu. Featured Crew Avrum Jacobson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shawn Doyle Arkady Balagan Patrick Gallagher Hugo Lum Katharine Isabelle Danni Lisa Ray Rosemary Venturi Melanie Papalia Pippa Venturi Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Endgame premiered on March 14, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   2011-04-06 Breaking In 5.4    2008-06-01 In Plain Sight 7.0    2010-09-22 The Defenders 7.0    2008-06-16 The Middleman 7.5    2010-06-24 Rookie Blue 7.0    2011-01-20 Fairly Legal 5.8    2010-09-08 Terriers 8.1    2011-02-07 The Chicago Code 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.showcase.ca/endgame/ Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 3 5 38956 z 4 zurman1 R 4 Rebecca 4 rantamplan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}