{"link": "https://www.themoviedb.org/tv/3164?language=en", "title": "Payne", "resume": "Payne is an American television series, patterned after the British program Fawlty Towers. It starred American actor John Larroquette, who portrayed assistant district attorney Dan Fielding on the American television program Night Court. Larroquette was also an executive producer for the series.\nPayne was a mid-season replacement on CBS and aired in March and April 1999. The show also starred JoBeth Williams, Julie Benz and Rick Batalla. Despite fairly positive reception, and receiving the blessing of John Cleese, who agreed to take a recurring role if the show was renewed, Payne was quickly cancelled. Nine episodes were filmed; eight were aired. The show is not available on DVD.", "rate": 10, "genre": ["Comedy"], "cast": ["Julie Benz", "John Larroquette", "JoBeth Williams", "Dona Hardy", "Ellen Albertini Dow"], "character": ["Breeze O'Rourke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3164   Expand Payne   (1999) User Score Overview Payne is an American television series, patterned after the British program Fawlty Towers. It starred American actor John Larroquette, who portrayed assistant district attorney Dan Fielding on the American television program Night Court. Larroquette was also an executive producer for the series. Payne was a mid-season replacement on CBS and aired in March and April 1999. The show also starred JoBeth Williams, Julie Benz and Rick Batalla. Despite fairly positive reception, and receiving the blessing of John Cleese, who agreed to take a recurring role if the show was renewed, Payne was quickly cancelled. Nine episodes were filmed; eight were aired. The show is not available on DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julie Benz Breeze O'Rourke John Larroquette JoBeth Williams Dona Hardy Ellen Albertini Dow Full Cast & Crew Last Season Season 1 1999 | 9 Episodes Season 1 of Payne premiered on March 15, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Payne. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords hotel california remake sitcom Content Score 71 Just a little bit more... Top Contributors 9 Banana TB 2 TMDb Bot O 1 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}