{"link": "https://www.themoviedb.org/tv/55446?language=en", "title": "Annika Bengtzon: Crime Reporter", "resume": "Annika Bengtzon is a journalist and working mother of two struggling to keep her marriage alive. Fearless in her search for the truth, she won't take no for an answer from anyone: not from prestigious academicians, or drug dealers or from colleagues inside her own profession. Her passion for getting the story may bring her into dangerous situations, but it ultimately allows her to peer into the heart of every crime. Annika's not afraid to square off with hardened criminals, but her toughest challenge seems to be trying to balance the job with her sometimes tumultuous private life.", "rate": 80, "genre": ["Crime", "Drama", "Mystery", "Thriller"], "cast": ["Malin Crépin", "Björn Kjellman", "Leif Andrée", "Erik Johansson ", "Kajsa Ernst"], "character": ["Annika Bengtzon", "Anders Schyman", "Spiken", "Patrik Nilsson", "Berit Hamrin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55446   Expand Annika Bengtzon: Crime Reporter   (2012) User Score Overview Annika Bengtzon is a journalist and working mother of two struggling to keep her marriage alive. Fearless in her search for the truth, she won't take no for an answer from anyone: not from prestigious academicians, or drug dealers or from colleagues inside her own profession. Her passion for getting the story may bring her into dangerous situations, but it ultimately allows her to peer into the heart of every crime. Annika's not afraid to square off with hardened criminals, but her toughest challenge seems to be trying to balance the job with her sometimes tumultuous private life.  Featured Crew Liza Marklund Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Malin Crépin Annika Bengtzon Björn Kjellman Anders Schyman Leif Andrée Spiken Erik Johansson  Patrik Nilsson Kajsa Ernst Berit Hamrin Full Cast & Crew Last Season Season 1 2012 | 6 Episodes Season 1 of Annika Bengtzon: Crime Reporter premiered on June 20, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Annika Bengtzon: Crime Reporter. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Annika Bengtzon: Crime Reporter. You can help by rating TV shows you've seen. Facts Original Name  Liza Marklund's Annika Bengtzon Status  Ended Networks - Certification  - Type  Scripted Original Language  Swedish Runtime  90m Homepage  - Genres Crime Drama Mystery Thriller Keywords sweden reporter murder investigation Content Score 93 Almost there... Top Contributors 32 Banana t 14 tmdb45070722 SQ 3 Sir Quickly TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}