{"link": "https://www.themoviedb.org/tv/61817?language=en", "title": "Jul på Månetoppen", "resume": "Christmas on the Moontop is a Norwegian christmas series. It was produced and sent on NRK in 2002 with replays in 2005, 2010 and 2014. Idea and screenplay by Gudny Ingebjørg Hagen. Christmas on the Moontop was the successor to Christmas in Blåfjell and Amalies Christmas. Directed by Torunn Calmeyer Ringen.", "rate": 0, "genre": ["Action", "Adventure", "Drama", "Family", "Kids"], "cast": ["Ulrikke Hansen Døvigen", "Frank Jørstad", "Liv Bernhoft Osa", "Britt Langlie", "Kai Remlov"], "character": ["Jentungen", "Storm", "Nissemamma", "Fjellmor", "Nissepappa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61817   Expand Jul på Månetoppen   (2002) User Score Overview Christmas on the Moontop is a Norwegian christmas series. It was produced and sent on NRK in 2002 with replays in 2005, 2010 and 2014. Idea and screenplay by Gudny Ingebjørg Hagen. Christmas on the Moontop was the successor to Christmas in Blåfjell and Amalies Christmas. Directed by Torunn Calmeyer Ringen. Featured Crew Gudny Ingebjørg Hagen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ulrikke Hansen Døvigen Jentungen Frank Jørstad Storm Liv Bernhoft Osa Nissemamma Britt Langlie Fjellmor Kai Remlov Nissepappa Full Cast & Crew Last Season Season 1 2002 | 24 Episodes Season 1 of Jul på Månetoppen premiered on December  1, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jul på Månetoppen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  Norwegian Runtime  30m Homepage  - Genres Action & Adventure Drama Family Kids Keywords mountain snow christmas Content Score 93 Almost there... Top Contributors 61 Freebird CM 9 Cherche Moi 7 Bendik R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}