{"link": "https://www.themoviedb.org/tv/68716?language=en", "title": "Marvel's Inhumans", "resume": "After the Royal Family of Inhumans is splintered by a military coup, they barely escape to Hawaii where their surprising interactions with the lush world and humanity around them may prove to not only save them, but Earth itself.", "rate": 56, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Anson Mount", "Serinda Swan", "Iwan Rheon", "Isabelle Cornish", "Ken Leung"], "character": ["Blackagar Boltagon / Black Bolt", "Medusalith Amaquelin / Medusa", "Maximus Boltagon", "Crystalia Amaquelin / Crystal", "Karnak Mander-Azur / Karnak"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68716   Expand Marvel's Inhumans   (2017) User Score  Play Trailer Overview After the Royal Family of Inhumans is splintered by a military coup, they barely escape to Hawaii where their surprising interactions with the lush world and humanity around them may prove to not only save them, but Earth itself. Featured Crew Scott Buck Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  22 Content Issues  7 Images Backdrops  9 Posters  44 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anson Mount Blackagar Boltagon / Black Bolt Serinda Swan Medusalith Amaquelin / Medusa Iwan Rheon Maximus Boltagon Isabelle Cornish Crystalia Amaquelin / Crystal Ken Leung Karnak Mander-Azur / Karnak Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Marvel's Inhumans premiered on September 29, 2017. View All Seasons Social Reviews  0 Discussions  29 Subject Status Replies Last Reply Not sure I'll watch Season 2 Open 11 by  poweranimals season2 plot revealed Open 0 by Ray\n      \n     S Well, I gave it three episodes Open 8 by  poweranimals Go to Discussions Media Most Popular Videos  2 Backdrops  9 Posters  44 Recommendations   2017-10-02 The Gifted 7.0    2017-11-21 Marvel's Runaways 7.3    2017-09-25 The Brave 6.6    2017-09-10 The Orville 7.2    2017-08-18 Marvel's The Defenders 7.1    2017-10-01 Ghosted 6.2    2017-10-01 Wisdom of the Crowd 7.1    2016-01-21 DC's Legends of Tomorrow 6.1  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/marvels-inhumans Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords superhero royal family based on comic marvel cinematic universe Content Score 100 Yes! Looking good! Top Contributors 111 Banana 62 Jessica Drew 23 TopKek G 16 Gustave2001  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}