{"link": "https://www.themoviedb.org/tv/1699?language=en", "title": "Last Comic Standing", "resume": "A nationwide talent search accepting the best professional and non-professional stand-up comedians. Once the selection process is narrowed to 10, the show covers the contestants as they live together and compete for an exclusive contract with NBC, and to be called the Last Comic Standing.", "rate": 85, "genre": ["Reality", "Comedy"], "cast": ["Peter Engel"], "character": ["9"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1699   Expand Last Comic Standing   (2003) User Score Overview A nationwide talent search accepting the best professional and non-professional stand-up comedians. Once the selection process is narrowed to 10, the show covers the contestants as they live together and compete for an exclusive contract with NBC, and to be called the Last Comic Standing. Featured Crew Peter Engel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Engel 9 Full Cast & Crew Last Season Season 9 2015 | 8 Episodes Season 9 of Last Comic Standing premiered on July 22, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Last Comic Standing. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.nbc.com/Last_Comic_Standing Genres Reality Comedy Keywords stand-up comedy Content Score 64 We're so close, yet so far. Top Contributors 16 Elizabeth Jennings ea 4 elizabeth aden TB 1 TMDb Bot k 1 kayanabitta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}