{"link": "https://www.themoviedb.org/tv/12342?language=en", "title": "Banzai", "resume": "Banzai was a British comedy gambling gameshow spoofing Japanese gameshows and general television style. It was produced by Radar, part of RDF Media. Each segment of the show was a silly or bizarre contest. Members of the viewing audience were encouraged to bet with each other on the outcome of each segment.\nThe pseudo-Japanese characters seen on screen during the programme are meaningless.", "rate": 0, "genre": ["Comedy"], "cast": ["Bill Murray", "Burt Kwouk", "Tadao Tomomatsu"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12342   Expand Banzai   (2001) User Score Overview Banzai was a British comedy gambling gameshow spoofing Japanese gameshows and general television style. It was produced by Radar, part of RDF Media. Each segment of the show was a silly or bizarre contest. Members of the viewing audience were encouraged to bet with each other on the outcome of each segment. The pseudo-Japanese characters seen on screen during the programme are meaningless. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Murray Burt Kwouk Tadao Tomomatsu Full Cast & Crew Last Season Season 3 2003 | 8 Episodes Season 3 of Banzai premiered on March 27, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Banzai. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 6 in2repid  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}