{"link": "https://www.themoviedb.org/tv/63398?language=en", "title": "Life in Pieces", "resume": "Comedy about one big happy family and their sometimes awkward, often hilarious and ultimately beautiful milestone moments as told by its various members.  Of the three siblings, middle child Matt may have just found his true love, his co-worker, Colleen; his coddled youngest brother, Greg, and his wife, Jen, are overwhelmed by the birth of their first child; and the eldest, Heather, and her husband, Tim, are dreading their impending empty nest so much, they're considering having another baby. Their parents are Joan the family's adoring matriarch who would do anything for her kids - as long as she agrees with it - and John, the gregarious patriarch who's searching for ways to soften the blow of turning 70. As the family's lives unfold in four short stories each week, they try to savor these little pieces of time that flash by but stay with you forever, because these moments add up to what life's all about.", "rate": 75, "genre": ["Comedy"], "cast": ["Thomas Sadoski", "Dianne Wiest", "James Brolin", "Zoe Lister-Jones", "Colin Hanks"], "character": ["Matt Short", "Joan Short", "John Short", "Jen", "Greg Short"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63398   Expand Life in Pieces   (2015) User Score  Play Trailer Overview Comedy about one big happy family and their sometimes awkward, often hilarious and ultimately beautiful milestone moments as told by its various members.  Of the three siblings, middle child Matt may have just found his true love, his co-worker, Colleen; his coddled youngest brother, Greg, and his wife, Jen, are overwhelmed by the birth of their first child; and the eldest, Heather, and her husband, Tim, are dreading their impending empty nest so much, they're considering having another baby. Their parents are Joan the family's adoring matriarch who would do anything for her kids - as long as she agrees with it - and John, the gregarious patriarch who's searching for ways to soften the blow of turning 70. As the family's lives unfold in four short stories each week, they try to savor these little pieces of time that flash by but stay with you forever, because these moments add up to what life's all about. Featured Crew Justin Adler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  8 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thomas Sadoski Matt Short Dianne Wiest Joan Short James Brolin John Short Zoe Lister-Jones Jen Colin Hanks Greg Short Full Cast & Crew Current Season Season 3 2017 | 22 Episodes Season 3 of Life in Pieces premiered on November  2, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Samantha: Happy Birthday Holly Barrett! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  6 Recommendations   2015-12-13 LEGO Nexo Knights 6.0    2011-02-08 Traffic Light 7.2    2015-04-26 HAPPYish 6.9    2016-08-02 Borderline 7.1    2008-10-12 Stephen Fry in America 8.0    2013-07-20 Cedar Cove 6.7    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1    2016-06-02 Hibana: Spark 7.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  23m Homepage   http://www.cbs.com/shows/life-in-pieces/ Genres Comedy Keywords big family family Content Score 100 Yes! Looking good! Top Contributors 42 Elizabeth Jennings a 20 adambakir92 10 niqo19 b 10 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}