{"link": "https://www.themoviedb.org/tv/15800?language=en", "title": "Kennedy", "resume": "Kennedy is a five-hour miniseries written by Reg Gadney and directed by Jim Goddard. The miniseries was produced by Central Independent Television and originally aired in the United States starting on 20 November 1983 around the time of the 20th anniversary of the Kennedy assassination. The TV miniseries was a biography of the 1961-1963 presidency of John F. Kennedy.\nThe mini-series stars Martin Sheen as President John F. Kennedy, John Shea as Robert F. Kennedy, Blair Brown as Jacqueline Kennedy, E.G. Marshall as Joseph P. Kennedy, Vincent Gardenia as J. Edgar Hoover and Kelsey Grammer as Stephen Smith amongst many others.\nThe series was broadcast on NBC, and was also sold to 50 Countries, with 27 of them broadcasting the series simultaneous. The series was nominated for 3 Golden Globes and 4 BAFTA, and won Baftas for Best Drama Series and Best Make Up.", "rate": 70, "genre": ["Drama", "War", "Politics"], "cast": ["Martin Sheen", "Kevin Conroy", "Charles Brown", "Nesbitt Blaisdell", "Peter Boyden"], "character": ["John F. Kennedy", "Ted Kennedy", "Martin Luther King Jr.", "Lyndon B. Johnson", "Pierre Salinger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15800   Expand Kennedy   (1983) User Score  Play Trailer Overview Kennedy is a five-hour miniseries written by Reg Gadney and directed by Jim Goddard. The miniseries was produced by Central Independent Television and originally aired in the United States starting on 20 November 1983 around the time of the 20th anniversary of the Kennedy assassination. The TV miniseries was a biography of the 1961-1963 presidency of John F. Kennedy. The mini-series stars Martin Sheen as President John F. Kennedy, John Shea as Robert F. Kennedy, Blair Brown as Jacqueline Kennedy, E.G. Marshall as Joseph P. Kennedy, Vincent Gardenia as J. Edgar Hoover and Kelsey Grammer as Stephen Smith amongst many others. The series was broadcast on NBC, and was also sold to 50 Countries, with 27 of them broadcasting the series simultaneous. The series was nominated for 3 Golden Globes and 4 BAFTA, and won Baftas for Best Drama Series and Best Make Up. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Sheen John F. Kennedy Kevin Conroy Ted Kennedy Charles Brown Martin Luther King Jr. Nesbitt Blaisdell Lyndon B. Johnson Peter Boyden Pierre Salinger Full Cast & Crew Last Season Season One 1983 | 7 Episodes Season 1 of Kennedy premiered on November 20, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kennedy. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  282m, 360m, 311m Homepage  - Genres Drama War & Politics Keywords biography miniseries kennedy family Content Score 93 Almost there... Top Contributors TB 26 TMDb Bot 18 Steve 2 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}