{"link": "https://www.themoviedb.org/tv/43183?language=en", "title": "Horrid Henry", "resume": "Horrid Henry is a British animated television series based on the book series by Francesca Simon produced by One Explosion Studios and Nelvana Limited, broadcast from late 2006 on Children's ITV in the UK and it will air on Cartoon Network Pakistan and Cartoon Network India on 2013 from 6am until 6:30am. The animation style differs from the Tony Ross illustrations in the books. Series Producer of the series is Lucinda Whiteley, Animation Director is Dave Unwin. The series has been sold to more than a dozen countries including France, Germany, South Africa, South Korea, and the Philippines.\nSo far, the two series have 104 episodes. The second series of 52 episodes started airing on 16 February 2009 and episodes from this series are currently being shown alongside episodes from the first series. There is a music album Horrid Henry's Most Horrid Album. The incidental music is composed by Lester Barnes and additional songs are composed by Lockdown Media.", "rate": 75, "genre": ["Animation", "Comedy", "Family"], "cast": ["Wayne Forester", "Lizzie Waterworth", "Tamsin Heatley"], "character": ["Henry's Dad (voice)", "Henry (voice)", "Henry's Mum (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43183   Expand Horrid Henry   (2006) User Score Overview Horrid Henry is a British animated television series based on the book series by Francesca Simon produced by One Explosion Studios and Nelvana Limited, broadcast from late 2006 on Children's ITV in the UK and it will air on Cartoon Network Pakistan and Cartoon Network India on 2013 from 6am until 6:30am. The animation style differs from the Tony Ross illustrations in the books. Series Producer of the series is Lucinda Whiteley, Animation Director is Dave Unwin. The series has been sold to more than a dozen countries including France, Germany, South Africa, South Korea, and the Philippines. So far, the two series have 104 episodes. The second series of 52 episodes started airing on 16 February 2009 and episodes from this series are currently being shown alongside episodes from the first series. There is a music album Horrid Henry's Most Horrid Album. The incidental music is composed by Lester Barnes and additional songs are composed by Lockdown Media. Featured Crew Holly Lyons Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wayne Forester Henry's Dad (voice) Lizzie Waterworth Henry (voice) Tamsin Heatley Henry's Mum (voice) Full Cast & Crew Last Season Season 2 2009 | 2 Episodes Season 2 of Horrid Henry premiered on February 16, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Horrid Henry. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  11m Homepage   http://www.itv.com/hub/horrid-henry/ Genres Animation Comedy Family Keywords boy british humour horrid henry Content Score 64 We're so close, yet so far. Top Contributors j 45 jordee 3 nazgul5 O 2 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}