{"link": "https://www.themoviedb.org/tv/13436?language=en", "title": "Roots: The Next Generations", "resume": "Roots: The Next Generations is a television miniseries, introduced in 1979, continuing, from 1882 to the 1960s, the fictionalized story of the family of Alex Haley and their life in Henning, Lauderdale County, Tennessee, USA. This sequel to the 1977 miniseries is based on the last seven chapters of Haley's novel entitled Roots: The Saga of an American Family plus additional material by Haley.\nRoots: The Next Generations was produced with a budget of $16.6 million, nearly three times as large as that of the original.", "rate": 79, "genre": ["Drama"], "cast": ["James Earl Jones", "Dorian Harewood", "Debbi Morgan", "Lynn Hamilton", "Lynne Moody"], "character": ["Alex Haley", "Simon Haley", "Elizabeth Harvey", "Cousin Georgia Anderson", "Irene Harvey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13436   Expand Roots: The Next Generations   (1979) User Score Overview Roots: The Next Generations is a television miniseries, introduced in 1979, continuing, from 1882 to the 1960s, the fictionalized story of the family of Alex Haley and their life in Henning, Lauderdale County, Tennessee, USA. This sequel to the 1977 miniseries is based on the last seven chapters of Haley's novel entitled Roots: The Saga of an American Family plus additional material by Haley. Roots: The Next Generations was produced with a budget of $16.6 million, nearly three times as large as that of the original. Featured Crew Alex Haley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Earl Jones Alex Haley Dorian Harewood Simon Haley Debbi Morgan Elizabeth Harvey Lynn Hamilton Cousin Georgia Anderson Lynne Moody Irene Harvey Full Cast & Crew Last Season Season 1 1979 | 7 Episodes Season 1 of Roots: The Next Generations premiered on February 18, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1983-11-01 The Hitchhiker 6.4    1984-09-20 Who's the Boss? 6.4    1970-09-16 McCloud 7.0    1971-09-17 The Persuaders! 8.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 45 tmdb18595655 TB 6 TMDb Bot M 5 MRieping 2 sparky61  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}