{"link": "https://www.themoviedb.org/tv/51704?language=en", "title": "Defiance", "resume": "Defiance is an American science fiction television show that takes place in the future on a radically transformed Earth containing new species arriving from space. In the show, Joshua Nolan works as the lawman for the town of Defiance, a community where humans and intelligent extraterrestrial species coexist. The show follows Nolan, his adopted alien daughter Irisa, and the town's new mayor Amanda Rosewater.", "rate": 65, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Grant Bowler", "Julie Benz", "Stephanie Leonidas", "Tony Curran", "Jaime Murray"], "character": ["Joshua Nolan", "Amanda Rosewater", "Irisa", "Datak Tarr", "Stahma Tarr"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51704   Expand Defiance   (2013) User Score  Play Trailer Overview Defiance is an American science fiction television show that takes place in the future on a radically transformed Earth containing new species arriving from space. In the show, Joshua Nolan works as the lawman for the town of Defiance, a community where humans and intelligent extraterrestrial species coexist. The show follows Nolan, his adopted alien daughter Irisa, and the town's new mayor Amanda Rosewater. Featured Crew Rockne S. O'Bannon Creator Kevin Murphy Creator Michael Taylor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  53 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Grant Bowler Joshua Nolan Julie Benz Amanda Rosewater Stephanie Leonidas Irisa Tony Curran Datak Tarr Jaime Murray Stahma Tarr Full Cast & Crew Last Season Season 3 2015 | 13 Episodes View All Seasons Social Reviews  1 Discussions  4 A review by AKJETJ  6.0 Written by  AKJETJ  on July 12, 2017 Yet another great SciFi show that i found myself wanting to love. I had high hopes, but eventually just had to give up. Read All Reviews Media Most Popular Videos  2 Backdrops  53 Posters  10 Recommendations   2011-06-19 Falling Skies 6.4    2014-06-19 Dominion 5.9    2012-09-17 Revolution 6.0    2012-05-27 Continuum 7.1    2009-07-07 Warehouse 13 7.2    2013-06-24 Under the Dome 6.2    2006-07-18 Eureka 7.4    2015-06-19 Killjoys 6.7  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.syfy.com/defiance Genres Drama Sci-Fi & Fantasy Keywords future killer robot post-apocalyptic alien alien invasion planet invasion Content Score 100 Yes! Looking good! Top Contributors 78 Marr 🇳🇱 47 Elizabeth Jennings t 36 tolhauZ 29 Atanas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}