{"link": "https://www.themoviedb.org/tv/18516?language=en", "title": "The New Adventures of Black Beauty", "resume": "The New Adventures of Black Beauty was the title of a television drama series produced in the early 1990s. The show was produced first in New Zealand, then in Australia. The two different productions had different characters and plotlines, un-related except through the horse, Black Beauty.\nThe first season of the show was produced 1990-1991 by Isambard Productions Ltd in association with The Fremantle Corporation, and Beta Taurus produced the series primarily in New Zealand as a continuation of the 1972-1974 television drama series, The Adventures of Black Beauty. Set 20 years after the events of the earlier series, it featured two of the original characters, Dr James Gordon and Jenny Gordon Denning. The series was originally aired on ITV in the United Kingdom, and Isambard Productions Ltd produced 26 episodes in total. This production was subsequently aired in the US, where it was split into two seasons, aired in a different order, and with two episodes possibly omitted in some markets.\nIn 1992, The Fremantle Corporation moved production to Australia with what was for all practical purposes an entirely new series with new characters and a plotline unrelated to the previous episodes. The only connection to earlier works is the use of material from the final episode of the 1990-1991 production, reworked and with a voice-over explaining that Beauty had been released into the Australian wild. This was shown at the beginning of the first episode of the new production.", "rate": 0, "genre": ["Drama"], "cast": ["William Lucas", "Stacy Dorning", "Amber McWilliams", "Bill Kerr", "Gedeon Burkhard"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18516   Expand The New Adventures of Black Beauty   (1990) User Score Overview The New Adventures of Black Beauty was the title of a television drama series produced in the early 1990s. The show was produced first in New Zealand, then in Australia. The two different productions had different characters and plotlines, un-related except through the horse, Black Beauty. The first season of the show was produced 1990-1991 by Isambard Productions Ltd in association with The Fremantle Corporation, and Beta Taurus produced the series primarily in New Zealand as a continuation of the 1972-1974 television drama series, The Adventures of Black Beauty. Set 20 years after the events of the earlier series, it featured two of the original characters, Dr James Gordon and Jenny Gordon Denning. The series was originally aired on ITV in the United Kingdom, and Isambard Productions Ltd produced 26 episodes in total. This production was subsequently aired in the US, where it was split into two seasons, aired in a different order, and with two episodes possibly omitted in some markets. In 1992, The Fremantle Corporation moved production to Australia with what was for all practical purposes an entirely new series with new characters and a plotline unrelated to the previous episodes. The only connection to earlier works is the use of material from the final episode of the 1990-1991 production, reworked and with a voice-over explaining that Beauty had been released into the Australian wild. This was shown at the beginning of the first episode of the new production. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Lucas Stacy Dorning Amber McWilliams Bill Kerr Gedeon Burkhard Full Cast & Crew Last Season Season 1 1990 | 26 Episodes Season 1 of The New Adventures of Black Beauty premiered on September  1, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The New Adventures of Black Beauty. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 3 Elizabeth Jennings BA 3 Barbara Ann O'Leary s 3 speedycars 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}