{"link": "https://www.themoviedb.org/tv/37632?language=en", "title": "Switched at Birth", "resume": "The story of two teenage girls who discover they were accidentally switched as newborns in the hospital. Bay Kennish grew up in a wealthy family with two parents and a brother, while Daphne Vasquez, who lost her hearing at an early age due to a case of meningitis, grew up with a single mother in a working-class neighborhood. Things come to a dramatic head when both families meet and struggle to learn how to live together for the sake of the girls.", "rate": 62, "genre": ["Drama"], "cast": ["Vanessa Marano", "Katie Leclerc", "Lucas Grabeel", "Lea Thompson", "Constance Marie"], "character": ["Bay Kennish", "Daphne Vasquez", "Toby Kennish", "Kathryn Kennish", "Regina Vasquez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37632   Expand Switched at Birth   (2011) User Score  Play Trailer Overview The story of two teenage girls who discover they were accidentally switched as newborns in the hospital. Bay Kennish grew up in a wealthy family with two parents and a brother, while Daphne Vasquez, who lost her hearing at an early age due to a case of meningitis, grew up with a single mother in a working-class neighborhood. Things come to a dramatic head when both families meet and struggle to learn how to live together for the sake of the girls. Featured Crew Lizzy Weiss Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  12 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vanessa Marano Bay Kennish Katie Leclerc Daphne Vasquez Lucas Grabeel Toby Kennish Lea Thompson Kathryn Kennish Constance Marie Regina Vasquez Full Cast & Crew Last Season Season 5 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply N Give Tank A Proper Resolution!! Open 6 by  Zero-angel w Toby: Happy Birthday Lucas Grabeel! Open 0 by wonder2wonder\n      \n     w Bay: Happy Birthday Vanessa Marano! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  3 Recommendations   2013-06-03 The Fosters 6.2    2011-08-05 Friends with Benefits 6.1    2010-01-18 Life Unexpected 7.4    2015-08-23 Noble, My Love 7.4    2011-09-05 Zig and Sharko 5.3    Double, Double, Toil and Trouble 3.7    2013-01-14 The Carrie Diaries 4.9    2017-01-06 One Day at a Time 6.6  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://freeform.go.com/shows/switched-at-birth Genres Drama Keywords deaf disabled sign language teen drama biological parents Content Score 100 Yes! Looking good! Top Contributors 102 Banana 24 Elizabeth Jennings TB 9 TMDb Bot 7 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}