{"link": "https://www.themoviedb.org/tv/64566?language=en", "title": "The Dandy", "resume": "Inspired by the 1997 American drama Donnie Brasco, El Dandy tells the story of a law professor who has been hired by the Attorney General, to participate in a program of special operations, where you must infiltrate one of the most notorious drug cartels of Mexico City. Under the false name Daniel \"El Dandy\" Bracho, begins the task of identifying all the members of this clandestine network. However, he quickly finds that his acute ability to police work is only comparable with the exciting sense of danger that experiences living life to the fullest. Along the way, it avails itself of the help of a criminal's petty, loyal, even corrupt, called El Chueco, who quickly befriends Bracho and comes dangerously close to discover his true identity. Much deeper Bracho is involved in the mafia, more work tells him to get out, and the professor once incorruptible has to choose between returning to a normal life as a respectable citizen or fully embrace his criminal life.", "rate": 55, "genre": [], "cast": ["Alfonso Herrera", "Itahisa Machado", "Damián Alcázar", "Luis de Alba", "Dagoberto Gama"], "character": ["Daniel \"El Dandy\" Bracho", "Leticia Albarrán", "Juan Antonio Ramírez \"El Chueco\"", "Euladio", "José Luis Zamacona \"El Negro\""], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64566   Expand The Dandy   (2015) User Score  Play Trailer Overview Inspired by the 1997 American drama Donnie Brasco, El Dandy tells the story of a law professor who has been hired by the Attorney General, to participate in a program of special operations, where you must infiltrate one of the most notorious drug cartels of Mexico City. Under the false name Daniel \"El Dandy\" Bracho, begins the task of identifying all the members of this clandestine network. However, he quickly finds that his acute ability to police work is only comparable with the exciting sense of danger that experiences living life to the fullest. Along the way, it avails itself of the help of a criminal's petty, loyal, even corrupt, called El Chueco, who quickly befriends Bracho and comes dangerously close to discover his true identity. Much deeper Bracho is involved in the mafia, more work tells him to get out, and the professor once incorruptible has to choose between returning to a normal life as a respectable citizen or fully embrace his criminal life. Featured Crew Chava Cartas Creator Mauricio Cruz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alfonso Herrera Daniel \"El Dandy\" Bracho Itahisa Machado Leticia Albarrán Damián Alcázar Juan Antonio Ramírez \"El Chueco\" Luis de Alba Euladio Dagoberto Gama José Luis Zamacona \"El Negro\" Full Cast & Crew Last Season Season 1 2015 | 9 Episodes Season 1 of The Dandy premiered on October 26, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Dandy. You can help by rating TV shows you've seen. Facts Original Name  El Dandy Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.tntla.com/series/el-dandy-la Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 32 itxel 6 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}