{"link": "https://www.themoviedb.org/tv/34785?language=en", "title": "H2", "resume": "Kunimi Hiro is a high school student, who is forced to give up his ambitions as a professional baseball player due to a serious injury. Now at a new high school, Hiro gets involved with Haruko and her goals of reviving that school's baseball team. At first they must overcome the refusal of school principle, who still remembers a dishonorable defeat that the school's baseball suffered some ten years earlier. Even with permission to form a school baseball team, there are still the players to recruit and train, and the challenges of building a reputation of the team within the high school baseball circuit. This is a story of group of high school students and their love of the game of baseball. Hiro is national class pitcher and batter, with his best friend who is a catcher and with Haruko as the team manager, together they struggle to build a baseball team worthy of the national championship.", "rate": 100, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Shinnosuke Furumoto", "Keiko Imamura", "Mitsuru Miyamoto", "Masami Suzuki", "Shinichi Takenaka"], "character": ["Hiro Kunimi (voice)", "Hikari Amamiya (voice)", "Hideo Tachibana (voice)", "Haruka Koga (voice)", "Ryūtaro Kine (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34785   Expand H2   (1995) User Score Overview Kunimi Hiro is a high school student, who is forced to give up his ambitions as a professional baseball player due to a serious injury. Now at a new high school, Hiro gets involved with Haruko and her goals of reviving that school's baseball team. At first they must overcome the refusal of school principle, who still remembers a dishonorable defeat that the school's baseball suffered some ten years earlier. Even with permission to form a school baseball team, there are still the players to recruit and train, and the challenges of building a reputation of the team within the high school baseball circuit. This is a story of group of high school students and their love of the game of baseball. Hiro is national class pitcher and batter, with his best friend who is a catcher and with Haruko as the team manager, together they struggle to build a baseball team worthy of the national championship. Featured Crew Hidehito Ueda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shinnosuke Furumoto Hiro Kunimi (voice) Keiko Imamura Hikari Amamiya (voice) Mitsuru Miyamoto Hideo Tachibana (voice) Masami Suzuki Haruka Koga (voice) Shinichi Takenaka Ryūtaro Kine (voice) Full Cast & Crew Last Season Season 1 1995 | 41 Episodes Season 1 of H2 premiered on June  1, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on H2. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Drama Keywords baseball based on manga shounen Content Score 93 Almost there... Top Contributors 34 United600 17 deanzel 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}