{"link": "https://www.themoviedb.org/tv/64872?language=en", "title": "SAF3", "resume": "The series follows Southern California's elite rescue task force, SAF3 (pronouced \"safe\") , consists of the cream-of-the-crop from the sea, air, and fire divisions of the Malibu Fire Department. They are the heroes who answer the most challenging calls; specialists who collaborate, coordinate, and initiate daring rescues in the most dangerous venues to save human life, always aware of the harsh reality that one of them may not return.", "rate": 40, "genre": ["Drama", "Action", "Adventure"], "cast": ["Dolph Lundgren", "Jocelyn Osorio", "J.R. Martinez", "Karl Thaning", "Lydia Hull"], "character": ["John Eriksson", "Graciela Vega", "Alfonso Rivera", "Jared Taylor", "Lily Maddox"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64872   Expand SAF3   (2013) User Score Overview The series follows Southern California's elite rescue task force, SAF3 (pronouced \"safe\") , consists of the cream-of-the-crop from the sea, air, and fire divisions of the Malibu Fire Department. They are the heroes who answer the most challenging calls; specialists who collaborate, coordinate, and initiate daring rescues in the most dangerous venues to save human life, always aware of the harsh reality that one of them may not return. Featured Crew Gregory J. Bonann Creator Tanquil Lisa Collins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dolph Lundgren John Eriksson Jocelyn Osorio Graciela Vega J.R. Martinez Alfonso Rivera Karl Thaning Jared Taylor Lydia Hull Lily Maddox Full Cast & Crew Last Season Season 1 2013 | 20 Episodes Season 1 of SAF3 premiered on September 21, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on SAF3. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Drama Action & Adventure Keywords fire brigade rescue mission malibu rescue team lifeguard southern california Content Score 93 Almost there... Top Contributors R 32 Rebecca 4 Michael s 4 speedycars z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}