{"link": "https://www.themoviedb.org/tv/67579?language=en", "title": "Shin Getter Robo vs. Neo Getter Robo", "resume": "Years after the defeat of the Reptilian Empire, Getter Team has begun training on a new super robot, Neo Getter Robo. But a surprise attack from the Empire's revived leader forces them to recruit a street fighter named Go Ichimonji as Getter One's pilot. Faced with an enormously powerful foe, the new team's only hope for victory may lie in the resurrection of the lost weapon of humanity, Shin Getter Robo.", "rate": 0, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Hideo Ishikawa", "Toshiharu Sakurai", "Takahiro Sakurai", "Naoya Uchida", "Naoya Uchida"], "character": ["Ryouma Nagare", "Gai Daido", "Go Ichimonji", "Hayato Jin", "Bat"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67579   Expand Shin Getter Robo vs. Neo Getter Robo   (2000) User Score Overview Years after the defeat of the Reptilian Empire, Getter Team has begun training on a new super robot, Neo Getter Robo. But a surprise attack from the Empire's revived leader forces them to recruit a street fighter named Go Ichimonji as Getter One's pilot. Faced with an enormously powerful foe, the new team's only hope for victory may lie in the resurrection of the lost weapon of humanity, Shin Getter Robo. Featured Crew Gou Nagai Creator Ken Ishikawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hideo Ishikawa Ryouma Nagare Toshiharu Sakurai Gai Daido Takahiro Sakurai Go Ichimonji Naoya Uchida Hayato Jin Naoya Uchida Bat Full Cast & Crew Last Season Season 1 2000 | 4 Episodes Season 1 of Shin Getter Robo vs. Neo Getter Robo premiered on December 20, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Shin Getter Robo vs. Neo Getter Robo. You can help by rating TV shows you've seen. Facts Original Name  真ゲッターロボ対ネオゲッターロボ Status  Ended Networks - Certification  - Type  Video Original Language  Japanese Runtime  30m Homepage   https://v-storage.bandaivisual.co.jp/sp-site/shin-getter-robo-vs-neo-getter-robot/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors d 21 denis 14 Banana 13 Elizabeth Jennings P 9 PieroMartini  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}