{"link": "https://www.themoviedb.org/tv/9829?language=en", "title": "The New Archies", "resume": "The New Archies is a children's television cartoon, based upon the long-running Archie comic books and characters. The series, produced by DIC Entertainment and originally airing on NBC, re-imagined Archie Andrews, Betty Cooper, Veronica Lodge, Jughead Jones, Reggie Mantle, and the other teenage students of Riverdale High School as pre-teens in junior high. Fourteen episodes of the show were produced, which all aired during the show's first and only season in 1987 and were repeated in 1989. A short-lived Archie Comics series was produced bearing the same title and set in the same universe as the animated series. Reruns of the series ran on The Family Channel's Saturday morning lineup, 1991 to 1993 and on Toon Disney from 1998 to 2002.\nIn this series Veronica speaks like a valley girl. However, in previous animated cartoons and the radio show, she had a southern accent. Dilton Doiley was replaced as the \"intellectual\" character by an African American named Eugene. Eugene's girlfriend Amani was another addition to the cast. Archie also gained a dog, Red.", "rate": 0, "genre": ["Family", "Animation"], "cast": ["Michael Fantini", "Alyson Court", "Linda Sorensen", "Sunny Besen Thrasher", "Louise Vallance"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9829   Expand The New Archies   (1987) User Score Overview The New Archies is a children's television cartoon, based upon the long-running Archie comic books and characters. The series, produced by DIC Entertainment and originally airing on NBC, re-imagined Archie Andrews, Betty Cooper, Veronica Lodge, Jughead Jones, Reggie Mantle, and the other teenage students of Riverdale High School as pre-teens in junior high. Fourteen episodes of the show were produced, which all aired during the show's first and only season in 1987 and were repeated in 1989. A short-lived Archie Comics series was produced bearing the same title and set in the same universe as the animated series. Reruns of the series ran on The Family Channel's Saturday morning lineup, 1991 to 1993 and on Toon Disney from 1998 to 2002. In this series Veronica speaks like a valley girl. However, in previous animated cartoons and the radio show, she had a southern accent. Dilton Doiley was replaced as the \"intellectual\" character by an African American named Eugene. Eugene's girlfriend Amani was another addition to the cast. Archie also gained a dog, Red. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Fantini Alyson Court Linda Sorensen Sunny Besen Thrasher Louise Vallance Full Cast & Crew Last Season Season 1 1987 | 13 Episodes Season 1 of The New Archies premiered on September 12, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The New Archies. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Animation Keywords middle school teenager archie Content Score 71 Just a little bit more... Top Contributors 12 Banana 2 BigMad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}