{"link": "https://www.themoviedb.org/tv/70186?language=en", "title": "Natsuko Kira, Sales Manager", "resume": "Natsuko is going back to the advertising agency she worked for before taking maternity leave and is shocked to learn that she is not the creative director any more but instead, she is put in charge of the Sales Development. Unmotivated, Natsuko finds she has her work cut out for her, and she has trouble balancing her job responsibilities with her home life, so she hires Miyuki, a babysitter. Unfortunately, Miyuki’s presence eventually works to tear her marriage apart.", "rate": 0, "genre": ["Drama"], "cast": ["Nanako Matsushima", "Ryuhei Matsuda", "Yoshinori Okada", "Daigo", "Anne Nakamura"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70186   Expand Natsuko Kira, Sales Manager   (2016) User Score Overview Natsuko is going back to the advertising agency she worked for before taking maternity leave and is shocked to learn that she is not the creative director any more but instead, she is put in charge of the Sales Development. Unmotivated, Natsuko finds she has her work cut out for her, and she has trouble balancing her job responsibilities with her home life, so she hires Miyuki, a babysitter. Unfortunately, Miyuki’s presence eventually works to tear her marriage apart. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nanako Matsushima Ryuhei Matsuda Yoshinori Okada Daigo Anne Nakamura Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Natsuko Kira, Sales Manager premiered on July 21, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Natsuko Kira, Sales Manager. You can help by rating TV shows you've seen. Facts Original Name  営業部長 吉良奈津子 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage   http://www.fujitv.co.jp/kiranatsuko/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 24 taxigps 10 Elizabeth Jennings A 2 Aka75 2 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}