{"link": "https://www.themoviedb.org/tv/70128?language=en", "title": "Genius", "resume": "Anthology series about famous geniuses with the first season charting how Albert Einstein unlocked the mysteries of the atom and the universe, and the second exploring the passionate nature and relentless creative drive of Pablo Picasso.", "rate": 70, "genre": ["Drama"], "cast": ["Antonio Banderas", "Alex Rich", "Samantha Colley", "Sebastian Roché", "Lucas Englander"], "character": ["Pablo Picasso", "Young Pablo Picasso", "Mileva Maric", "Emile Gilot", "Daniel-Henry Kahnweiler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70128   Expand Genius   (2017) User Score  Play Trailer Overview Anthology series about famous geniuses with the first season charting how Albert Einstein unlocked the mysteries of the atom and the universe, and the second exploring the passionate nature and relentless creative drive of Pablo Picasso. Featured Crew Noah Pink Creator Kenneth Biller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  14 Posters  16 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antonio Banderas Pablo Picasso Alex Rich Young Pablo Picasso Samantha Colley Mileva Maric Sebastian Roché Emile Gilot Lucas Englander Daniel-Henry Kahnweiler Full Cast & Crew Current Season Picasso 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Somewhat disappointing Open 37 by  PT 100 Chapter 8 -- The Einstein / Geist \"Interview\".  Linear vs. non-linear storytelling Open 3 by  Kathy He may have been a \"genius\", but ... Open 5 by  SkyPowers Go to Discussions Media Most Popular Videos  2 Backdrops  14 Posters  16 Recommendations   2016-08-28 TVF Tripling 8.0    2016-11-14 Mars 6.6    2017-10-21 Gunpowder 6.8    2018-01-18 Britannia 6.6    2017-09-27 SEAL Team 6.6    1955-09-10 Gunsmoke 6.4    2017-12-06 Knightfall 6.2    1963-09-16 The Outer Limits 7.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m, 60m Homepage   http://channel.nationalgeographic.com/genius/ Genres Drama Keywords genius biography historical drama Content Score 100 Yes! Looking good! Top Contributors 84 Elizabeth Jennings 79 velpi s 15 speedycars 11 moviefars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}