{"link": "https://www.themoviedb.org/tv/69410?language=en", "title": "Shitamachi Rocket", "resume": "Tsukuda Kohei was once a researcher with the Aerospace and Science Exploration Agency and now runs Tsukuda Industries, a small factory which was left by his father. Although his relationship with his teenage daughter Rina is somewhat strained, business at Tsukuda Industries has gradually started to improve. But Tsukuda puts too much effort into his dream of developing a rocket engine and business declines little by little. One day, a major client suddenly declares that it is dropping Tsukuda Industries. Then, Tsukuda Industries gets sued by a big rival company, Nakashima Industries, for patent infringement. Tsukuda Industries’ reputation is hurt and financing from banks is also in a desperate situation. In the midst of this, Teikoku Heavy Industries, one of Japan’s leading corporations, offers to buy a patent which Tsukuda Industries possesses for 2 billion yen", "rate": 0, "genre": [], "cast": ["Hiroshi Abe", "Soko Wada", "Ken Yasuda", "Tao Tsuchiya", "Hiroki Konno"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69410   Expand Shitamachi Rocket   (2015) User Score Overview Tsukuda Kohei was once a researcher with the Aerospace and Science Exploration Agency and now runs Tsukuda Industries, a small factory which was left by his father. Although his relationship with his teenage daughter Rina is somewhat strained, business at Tsukuda Industries has gradually started to improve. But Tsukuda puts too much effort into his dream of developing a rocket engine and business declines little by little. One day, a major client suddenly declares that it is dropping Tsukuda Industries. Then, Tsukuda Industries gets sued by a big rival company, Nakashima Industries, for patent infringement. Tsukuda Industries’ reputation is hurt and financing from banks is also in a desperate situation. In the midst of this, Teikoku Heavy Industries, one of Japan’s leading corporations, offers to buy a patent which Tsukuda Industries possesses for 2 billion yen Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroshi Abe Soko Wada Ken Yasuda Tao Tsuchiya Hiroki Konno Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Shitamachi Rocket premiered on October 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shitamachi Rocket. You can help by rating TV shows you've seen. Facts Original Name  下町ロケット Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 32 MundoAsian c 19 ctchim A 2 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}