{"link": "https://www.themoviedb.org/tv/77169?language=en", "title": "Cobra Kai", "resume": "This Karate Kid sequel series picks up 30 years after the events of the 1984 All Valley Karate Tournament and finds Johnny Lawrence on the hunt for redemption by reopening the infamous Cobra Kai karate dojo. This reignites his old rivalry with the successful Daniel LaRusso, who has been working to maintain the balance in his life without mentor Mr. Miyagi.", "rate": 88, "genre": ["Action", "Adventure", "Drama"], "cast": ["Ralph Macchio", "William Zabka", "Xolo Maridueña", "Mary Mouser", "Courtney Henggeler"], "character": ["Daniel LaRusso", "Johnny Lawrence", "Miguel Diaz", "Samantha LaRusso", "Amanda Larusso / ..."], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77169   Expand Cobra Kai   (2018) User Score  Play Trailer Overview This Karate Kid sequel series picks up 30 years after the events of the 1984 All Valley Karate Tournament and finds Johnny Lawrence on the hunt for redemption by reopening the infamous Cobra Kai karate dojo. This reignites his old rivalry with the successful Daniel LaRusso, who has been working to maintain the balance in his life without mentor Mr. Miyagi. Featured Crew Josh Heald Creator Hayden Schlossberg Creator John Hurwitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  1 Teasers  3 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ralph Macchio Daniel LaRusso William Zabka Johnny Lawrence Xolo Maridueña Miguel Diaz Mary Mouser Samantha LaRusso Courtney Henggeler Amanda Larusso / ... Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Cobra Kai premiered on May  2, 2018. View All Seasons Social Reviews  2 Discussions  6 g A review by garyturnbullsr Written by  garyturnbullsr  on May  4, 2018 I watched the whole first season. I loved it. Good drama and story line. I cant wait for season 2 to see how this story continues. Read All Reviews Media Most Popular Videos  4 Backdrops  10 Posters  3 Recommendations   2017-03-05 Making History 6.5    1988-01-31 The Wonder Years 8.0    2017-11-02 S.W.A.T. 6.6    2016-10-22 Dirk Gently's Holistic Detective Agency 7.7    2014-04-06 Silicon Valley 7.9    2017-03-31 13 Reasons Why 7.2    2015-08-28 Narcos 8.0    1999-01-31 Family Guy 6.5  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   https://www.youtube.com/Cobra-Kai Genres Action & Adventure Drama Keywords karate rivalry dojo Content Score 100 Yes! Looking good! Top Contributors 62 Elizabeth Jennings 18 ajalex 5 Sergiojamon 5 fonzie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}