{"link": "https://www.themoviedb.org/tv/65947?language=en", "title": "Bodo", "resume": "Glitter, scandals, roaring twenties music and amazing acting, all that and much more in a brand new series depicting life of Eugene Bodo - a man of many talents. The artist was a major star of Europe between wars. He was an actor, a director, a producer, a businessman, the central figure of numerous gossip and scandals. Women went crazy for him, men wanted to be like him. The biography of the cabaret and movie star would be enough for a bunch of people. The story presents Bodo’s way to success, which was not always ‘a bed of roses’. Viewers will have a chance follow the man’s difficult decisions and life choices, running away from home, early steps on stage in a provincial theatre but also his relationship with possessive mother and love affairs with a number of women including Nora Ney. The 13-episode series will bring back the times of early movie sets and the heyday of cabaret", "rate": 18, "genre": ["Drama"], "cast": ["Anna Pijanowska", "Antoni Królikowski", "Agnieszka Wosińska", "Anna Próchniak"], "character": ["Ada", "Eugeniusz Bodo", "Jadwiga Anna Dorota Dylewska-Junod, matka Eugeniusza Bodo", "Nora Ney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65947   Expand Bodo   (2016) User Score Overview Glitter, scandals, roaring twenties music and amazing acting, all that and much more in a brand new series depicting life of Eugene Bodo - a man of many talents. The artist was a major star of Europe between wars. He was an actor, a director, a producer, a businessman, the central figure of numerous gossip and scandals. Women went crazy for him, men wanted to be like him. The biography of the cabaret and movie star would be enough for a bunch of people. The story presents Bodo’s way to success, which was not always ‘a bed of roses’. Viewers will have a chance follow the man’s difficult decisions and life choices, running away from home, early steps on stage in a provincial theatre but also his relationship with possessive mother and love affairs with a number of women including Nora Ney. The 13-episode series will bring back the times of early movie sets and the heyday of cabaret Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Pijanowska Ada Antoni Królikowski Eugeniusz Bodo Agnieszka Wosińska Jadwiga Anna Dorota Dylewska-Junod, matka Eugeniusza Bodo Anna Próchniak Nora Ney Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Bodo premiered on March  6, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bodo. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Polish Runtime  54m Homepage   http://bodo.tvp.pl/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 15 Elizabeth Jennings A 8 Anitta60 6 Macoes TV s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}