{"link": "https://www.themoviedb.org/tv/61147?language=en", "title": "Marry Him If You Dare", "resume": "In the broadcasting world, writers report news of things that have already occurred or are unfolding: they tell it like it is, without any control over transpiring events. 32-year-old news writer Na Mi Rae is the exception to the rule: she meets her future self who wants to change the events of her present life, namely advising her younger self not to marry news anchor Kim Shin. With this in mind, young Mi Rae pursues a vastly different path in life, one full of hopes and dreams. But what’s news to Mi Rae is that when you change even a small part of history, all of history changes along with it.", "rate": 70, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Yoon Eun-hye", "Lee Dong-gun", "Jung Yong-hwa", "Han Chae-ah", "Go Doo-shim"], "character": ["Na Mi-rae", "Kim Shin", "Park Se-joo", "Seo Yoo-kyung", "Lee Mi-ran"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61147   Expand Marry Him If You Dare   (2013) User Score  Play Trailer Overview In the broadcasting world, writers report news of things that have already occurred or are unfolding: they tell it like it is, without any control over transpiring events. 32-year-old news writer Na Mi Rae is the exception to the rule: she meets her future self who wants to change the events of her present life, namely advising her younger self not to marry news anchor Kim Shin. With this in mind, young Mi Rae pursues a vastly different path in life, one full of hopes and dreams. But what’s news to Mi Rae is that when you change even a small part of history, all of history changes along with it. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Eun-hye Na Mi-rae Lee Dong-gun Kim Shin Jung Yong-hwa Park Se-joo Han Chae-ah Seo Yoo-kyung Go Doo-shim Lee Mi-ran Full Cast & Crew Last Season Season 1 2013 | 16 Episodes Season 1 of Marry Him If You Dare premiered on October 14, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Marry Him If You Dare. You can help by rating TV shows you've seen. Facts Original Name  미래의 선택 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://english.kbs.co.kr/tv/main.html?tv_code=24 Genres Comedy Sci-Fi & Fantasy Keywords korea Content Score 93 Almost there... Top Contributors M 38 Maria180493 12 Elizabeth Jennings CM 8 Cherche Moi z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}