{"link": "https://www.themoviedb.org/tv/66271?language=en", "title": "Lucky Romance", "resume": "A romantic comedy about superstitious woman who tries to change her foretold fate by seducing a virgin and nerd guy. Bo Nui is a superstitious woman who relies too much in fortune-telling. One day she gets to know that if she doesn't sleep with a virgin man born in 1986 (year of tiger), she will die soon. She then meets an incredibly stingy guy Soo Ho. Bo Nui learns that he matches the conditions set forth by the fortune teller and sets out to seduce him. Unfortunately for her, Soo Ho is a nerd CEO of a game company who trusts only in logical and scientific things.", "rate": 73, "genre": ["Comedy"], "cast": ["Hwang Jung-eum", "Ryu Jun-yeol", "Lee Soo-Hyuk", "Lee Chung-a", "Kim Sang-ho"], "character": ["Shim Bo-nui", "Je Soo-ho", "Choi Gun-wook", "Han Seol-hee", "Won Dae-hae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66271   Expand Lucky Romance   (2016) User Score Overview A romantic comedy about superstitious woman who tries to change her foretold fate by seducing a virgin and nerd guy. Bo Nui is a superstitious woman who relies too much in fortune-telling. One day she gets to know that if she doesn't sleep with a virgin man born in 1986 (year of tiger), she will die soon. She then meets an incredibly stingy guy Soo Ho. Bo Nui learns that he matches the conditions set forth by the fortune teller and sets out to seduce him. Unfortunately for her, Soo Ho is a nerd CEO of a game company who trusts only in logical and scientific things. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hwang Jung-eum Shim Bo-nui Ryu Jun-yeol Je Soo-ho Lee Soo-Hyuk Choi Gun-wook Lee Chung-a Han Seol-hee Kim Sang-ho Won Dae-hae Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of Lucky Romance premiered on May 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2016-08-27 Our Gap Soon 9.3    2016-06-17 Squad 38 7.7    2016-07-30 Second To Last Love 8.3    2016-09-21 On the Way to the Airport 8.7    2016-04-27 Master: God of Noodles 7.3    2016-03-05 Marriage Contract 8.2    2016-09-21 Shopping King Louie 6.7    2016-05-02 Another Miss Oh 7.8  Facts Original Name  운빨로맨스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/lucky/ Genres Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 54 Maria180493 z 10 zurman1 d 9 desdoramas t 4 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}