{"link": "https://www.themoviedb.org/tv/2673?language=en", "title": "The O.C.", "resume": "The series centers on Ryan Atwood, a troubled youth from a broken home who is adopted by the wealthy and philanthropic Sandy and Kirsten Cohen. Ryan and his surrogate brother Seth, a socially awkward yet quick-witted teenager, deal with life as outsiders in the high-class world of Newport Beach. Ryan and Seth spend much time navigating their relationships with girl-next-door Marissa Cooper, Seth's childhood crush Summer Roberts, and the fast-talking loner Taylor Townsend. Story lines deal with the culture clash between the idealistic Cohen family and the shallow, materialistic, and closed-minded community in which they reside. The series includes elements of postmodernism, and functions as a mixture of melodrama and comedy.", "rate": 70, "genre": ["Drama"], "cast": ["Ben McKenzie", "Adam Brody", "Rachel Bilson", "Peter Gallagher", "Kelly Rowan"], "character": ["Ryan Atwood", "Seth Cohen", "Summer Roberts", "Sandy Cohen", "Kirsten Cohen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2673   Expand The O.C.   (2003) User Score  Play Trailer Overview The series centers on Ryan Atwood, a troubled youth from a broken home who is adopted by the wealthy and philanthropic Sandy and Kirsten Cohen. Ryan and his surrogate brother Seth, a socially awkward yet quick-witted teenager, deal with life as outsiders in the high-class world of Newport Beach. Ryan and Seth spend much time navigating their relationships with girl-next-door Marissa Cooper, Seth's childhood crush Summer Roberts, and the fast-talking loner Taylor Townsend. Story lines deal with the culture clash between the idealistic Cohen family and the shallow, materialistic, and closed-minded community in which they reside. The series includes elements of postmodernism, and functions as a mixture of melodrama and comedy. Featured Crew Josh Schwartz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  2 Images Backdrops  19 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben McKenzie Ryan Atwood Adam Brody Seth Cohen Rachel Bilson Summer Roberts Peter Gallagher Sandy Cohen Kelly Rowan Kirsten Cohen Full Cast & Crew Last Season Season 4 2006 | 16 Episodes View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply t Taylor Townsend day Open 0 by the_icon_0410\n      \n     w Ryan: Happy Birthday Benjamin McKenzie! Open 0 by wonder2wonder\n      \n     w Summer: Happy Birthday Rachel Bilson! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  4 Recommendations   2007-09-19 Gossip Girl 6.3    2003-09-23 One Tree Hill 6.5    2001-10-16 Smallville 6.9    1999-10-05 Angel 7.6    1997-09-08 Ally McBeal 5.9    1994-09-19 ER 6.9    2000-10-05 Gilmore Girls 7.5    1998-01-20 Dawson's Creek 6.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m, 60m Homepage  - Genres Drama Keywords california troubled teen unlikely lovers teenage romance teen drama wealthy teens Content Score 100 Yes! Looking good! Top Contributors 72 Banana R 24 Rebecca DS 10 David Schmitz NS 6 Norte Serra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}