{"link": "https://www.themoviedb.org/tv/60890?language=en", "title": "The Legend of Mick Dodge", "resume": "25 years ago, Mick Dodge walked away from the modern world, leaving civilization behind to live alongside nature's wonders in the Olympic Peninsula. Following a primal instinct present throughout generations of his family, Mick ventured deep into the Hoh Rainforest, making his home in the trees and hidden in the moss. Experience the wild life of Mick Dodge, a quirky character whose unique brand of Zen comes from living by his own code – off the land and off the grid.", "rate": 70, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60890   Expand The Legend of Mick Dodge   (2014) User Score Overview 25 years ago, Mick Dodge walked away from the modern world, leaving civilization behind to live alongside nature's wonders in the Olympic Peninsula. Following a primal instinct present throughout generations of his family, Mick ventured deep into the Hoh Rainforest, making his home in the trees and hidden in the moss. Experience the wild life of Mick Dodge, a quirky character whose unique brand of Zen comes from living by his own code – off the land and off the grid. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of The Legend of Mick Dodge premiered on January  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Mick Dodge. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage   http://channel.nationalgeographic.com/channel/the-legend-of-mick-dodge/ Genres Reality Keywords wilderness survivalist outdoorsman Content Score 43 There's no 'I' in team... Top Contributors 15 Elizabeth Jennings f 10 foundd 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}