{"link": "https://www.themoviedb.org/tv/61384?language=en", "title": "Zetman", "resume": "The story starts off with a face-off between two rival heroes, ZET and ALPHAS, and then traces their origins - Jin Kanzaki, a young man with the ability to transform into a superhuman being known as ZET, and Kouga Amagi, a young man with a strong sense of justice who uses technology to fight as ALPHAS.\nThe fates of these two men and those around them intertwine as they fight to protect mankind and destroy monstrous abominations known as Players.", "rate": 60, "genre": ["Action", "Adventure", "Animation"], "cast": ["Romi Park", "Namikawa Daisuke", "Mariya Ise", "Mamoru Miyano", "Yuki Kaida"], "character": ["Jin Kanzaki", "Jin Kanzaki", "Hanako Tanaka", "Kouga \"Alphasz\" Amagi", "Kouga \"Alphasz\" Amagi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61384   Expand Zetman   (2012) User Score  Play Trailer Overview The story starts off with a face-off between two rival heroes, ZET and ALPHAS, and then traces their origins - Jin Kanzaki, a young man with the ability to transform into a superhuman being known as ZET, and Kouga Amagi, a young man with a strong sense of justice who uses technology to fight as ALPHAS. The fates of these two men and those around them intertwine as they fight to protect mankind and destroy monstrous abominations known as Players. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Romi Park Jin Kanzaki Namikawa Daisuke Jin Kanzaki Mariya Ise Hanako Tanaka Mamoru Miyano Kouga \"Alphasz\" Amagi Yuki Kaida Kouga \"Alphasz\" Amagi Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Zetman premiered on April  3, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Zetman. You can help by rating TV shows you've seen. Facts Original Name  ゼットマン Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://zetman.jp/index.html Genres Action & Adventure Animation Keywords based on manga anime Content Score 93 Almost there... Top Contributors 28 sp1ti p 17 psy4trik 14 Siriuspr 4 kazuza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}