{"link": "https://www.themoviedb.org/tv/58080?language=en", "title": "You're Skitting Me", "resume": "You're Skitting Me is an edgy Australian sketch comedy series starring six new Australian teen actors who perform sketches about zombies, cavemen, naughty girl guides and parodies of Twilight and talent shows. Cosmo, Rowan, Hayden, Jake, Molly and Mia are fresh, funny, unpredictable and different and give the series its innovative, edgy appeal.", "rate": 40, "genre": ["Comedy", "Kids"], "cast": ["Cosmo Renfree", "Hayden McKertish", "Jake Fehily", "Mia Albers", "Molly Daniels"], "character": ["Various Characters", "Various Characters", "Various Characters", "Various Characters", "Various Characters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58080   Expand You're Skitting Me   (2012) User Score  Play Trailer Overview You're Skitting Me is an edgy Australian sketch comedy series starring six new Australian teen actors who perform sketches about zombies, cavemen, naughty girl guides and parodies of Twilight and talent shows. Cosmo, Rowan, Hayden, Jake, Molly and Mia are fresh, funny, unpredictable and different and give the series its innovative, edgy appeal. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cosmo Renfree Various Characters Hayden McKertish Various Characters Jake Fehily Various Characters Mia Albers Various Characters Molly Daniels Various Characters Full Cast & Crew Last Season Series 3 2016 | 1 Episode Season 3 of You're Skitting Me premiered on September 21, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on You're Skitting Me. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  12m, 25m, 24m Homepage   http://www.abc.net.au/tv/programs/youre-skitting-me/ Genres Comedy Kids Keywords sketch comedy Content Score 93 Almost there... Top Contributors 32 United600 1 Elizabeth Jennings TB 1 TMDb Bot d 1 dapat  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}