{"link": "https://www.themoviedb.org/tv/30543?language=en", "title": "The Line", "resume": "The Line is a Canadian television drama series, which debuted on Movie Central and The Movie Network on March 16, 2009.\nCreated by George F. Walker and Dani Romain, the series is being produced by The Nightingale Company, and shot by Richmond Street Films. The program was originally announced under the working title The Weight.", "rate": 40, "genre": ["Drama"], "cast": ["Sharon Lawrence", "Daniel Kash", "Ron White", "Milton Barnes", "Shawn Singleton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30543   Expand The Line   (2009) User Score Overview The Line is a Canadian television drama series, which debuted on Movie Central and The Movie Network on March 16, 2009. Created by George F. Walker and Dani Romain, the series is being produced by The Nightingale Company, and shot by Richmond Street Films. The program was originally announced under the working title The Weight. Featured Crew George F. Walker Creator Dani Romain Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sharon Lawrence Daniel Kash Ron White Milton Barnes Shawn Singleton Full Cast & Crew Last Season Season 1 2009 | 15 Episodes Season 1 of The Line premiered on March 16, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Line. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.thelinetv.net/ Genres Drama Keywords canada police organized crime Content Score 93 Almost there... Top Contributors 8 Banana D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}