{"link": "https://www.themoviedb.org/tv/2495?language=en", "title": "Ladette to Lady", "resume": "Ladette to Lady is a reality based series that first aired in the United Kingdom on ITV in June 2005. The series was produced by UK-based RDF Media.\nThe second series of Ladette to Lady was aired in the United Kingdom in October 2006 on ITV. The show had viewing figures of 4.45 million to 5.41 million, winning its timeslot each week. A third series followed in 2008, although it was originally planned to air in 2007.\nLadette to Lady was cancelled by ITV on 11 April 2008, but returned in June 2009, featuring Australian, rather than British, ladettes. The series featured the original staff and school.\nLadette to Lady returned for a new series that started at 10.35pm on 20 July 2010 that will bring another 6 episodes to ITV. The series saw the return of the familiar staff. However, instead of Eggleston Hall, where all the other series have been featured, this series is based in Hereford Hall.\nThe series has been parodied on The Charlotte Church Show as Lady to Ladette, in which, conversely, prim and proper girls are taught by Charlotte and some of her raucous friends to behave in a more ladette-like manner.", "rate": 0, "genre": [], "cast": ["Lucy Briers"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2495   Expand Ladette to Lady   (2005) User Score Overview Ladette to Lady is a reality based series that first aired in the United Kingdom on ITV in June 2005. The series was produced by UK-based RDF Media. The second series of Ladette to Lady was aired in the United Kingdom in October 2006 on ITV. The show had viewing figures of 4.45 million to 5.41 million, winning its timeslot each week. A third series followed in 2008, although it was originally planned to air in 2007. Ladette to Lady was cancelled by ITV on 11 April 2008, but returned in June 2009, featuring Australian, rather than British, ladettes. The series featured the original staff and school. Ladette to Lady returned for a new series that started at 10.35pm on 20 July 2010 that will bring another 6 episodes to ITV. The series saw the return of the familiar staff. However, instead of Eggleston Hall, where all the other series have been featured, this series is based in Hereford Hall. The series has been parodied on The Charlotte Church Show as Lady to Ladette, in which, conversely, prim and proper girls are taught by Charlotte and some of her raucous friends to behave in a more ladette-like manner. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lucy Briers Full Cast & Crew Last Season Season 5 2010 | 6 Episodes Season 5 of Ladette to Lady premiered on July 20, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ladette to Lady. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}