{"link": "https://www.themoviedb.org/tv/76694?language=en", "title": "Yorktown: A Time To Heal", "resume": "\"Yorktown: A Time to Heal\" is a non-profit fan film produced by Stan Woo. Production on the film began in 1985, and stars George Takei (Star Trek) and James Shigeta (Die Hard).\nThe 25 year old film was shot on 8mm. For over 20 years, the unfinished film was put on hiatus. In 2010, actor/producer John Atkin (Code Breakers) contacted Stan Woo about the unfinished film, and together they recruited a team of volunteer professionals to help finish the project. This team includes famed illustrator Andrew Probert (Back to the Future), FX artist Roland Baron (The Fountain of Life), and composer Christopher Barr (The Wizard of Stone Mountain).  The scenes that were never filmed in the 1980s, featuring the attack on the USS Yorktown, were filmed in Vancouver in 2013, and in November 2015, additional scenes were filmed in Ticonderoga, New York on the Star Trek: Phase II sets.  Captain's Log:\nHaving escaped capture by the Klingons, a damaged Starfleet reconnaissance probe crashes undetected on the planet Pahl III. Hikaru Sulu, serving as first officer on the retrofitted USS Yorktown, is sent by Admiral Nogura on a secret mission to help locate the missing spy drone. In order to prevent a catastrophic war from igniting with the Klingons, the USS Yorktown (under the command of Captain Bradley Frame) races against time to quickly find the lost drone, with orders to conceal its existence. At the same time, a terrorist group called S.H.A.R.K. discover the drone's location, and plot to steal the device and use it for their own nefarious means.", "rate": 0, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["George Takei", "James Shigeta"], "character": ["Hikaru Sulu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76694   Expand Yorktown: A Time To Heal   (2019) User Score Overview \"Yorktown: A Time to Heal\" is a non-profit fan film produced by Stan Woo. Production on the film began in 1985, and stars George Takei (Star Trek) and James Shigeta (Die Hard). The 25 year old film was shot on 8mm. For over 20 years, the unfinished film was put on hiatus. In 2010, actor/producer John Atkin (Code Breakers) contacted Stan Woo about the unfinished film, and together they recruited a team of volunteer professionals to help finish the project. This team includes famed illustrator Andrew Probert (Back to the Future), FX artist Roland Baron (The Fountain of Life), and composer Christopher Barr (The Wizard of Stone Mountain).  The scenes that were never filmed in the 1980s, featuring the attack on the USS Yorktown, were filmed in Vancouver in 2013, and in November 2015, additional scenes were filmed in Ticonderoga, New York on the Star Trek: Phase II sets.  Captain's Log: Having escaped capture by the Klingons, a damaged Starfleet reconnaissance probe crashes undetected on the planet Pahl III. Hikaru Sulu, serving as first officer on the retrofitted USS Yorktown, is sent by Admiral Nogura on a secret mission to help locate the missing spy drone. In order to prevent a catastrophic war from igniting with the Klingons, the USS Yorktown (under the command of Captain Bradley Frame) races against time to quickly find the lost drone, with orders to conceal its existence. At the same time, a terrorist group called S.H.A.R.K. discover the drone's location, and plot to steal the device and use it for their own nefarious means. Featured Crew Jem Ong Woo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Takei Hikaru Sulu James Shigeta Full Cast & Crew Next Season A TIME TO HEAL 2019 | 0 Episodes Season 1 of Yorktown: A Time To Heal is set to premiere on January 28, 2019. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.yorktownfilm.com/ Genres Action & Adventure Sci-Fi & Fantasy Keywords star trek yorktown Content Score 64 We're so close, yet so far. Top Contributors 27 gazzatrek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}