{"link": "https://www.themoviedb.org/tv/57828?language=en", "title": "Chickens", "resume": "It's the First World War. Our nation's heroes are fighting the good fight on foreign soil, but in one sleepy English village three young men remain: George is a conscientious objector, Cecil has flat feet and Bert really is a coward, unfortunately. They don't fight on the front line, but they do fight each other.", "rate": 65, "genre": ["Comedy"], "cast": ["Simon Bird", "Jonny Sweet", "Sarah Daykin", "Emerald Fennell", "Joe Thomas"], "character": ["Cecil Mowbray", "Bert Walpole", "Winky", "Agnes", "George Wright"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57828   Expand Chickens   (2013) User Score Overview It's the First World War. Our nation's heroes are fighting the good fight on foreign soil, but in one sleepy English village three young men remain: George is a conscientious objector, Cecil has flat feet and Bert really is a coward, unfortunately. They don't fight on the front line, but they do fight each other. Featured Crew Simon Bird Creator Joe Thomas Creator Jonny Sweet Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Bird Cecil Mowbray Jonny Sweet Bert Walpole Sarah Daykin Winky Emerald Fennell Agnes Joe Thomas George Wright Full Cast & Crew Last Season Season 1 2013 | 6 Episodes Season 1 of Chickens premiered on August 22, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Chickens. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords world war i sitcom british humour period sitcom Content Score 93 Almost there... Top Contributors 21 Elizabeth Jennings 12 Banana E 4 Elky w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}