{"link": "https://www.themoviedb.org/tv/7225?language=en", "title": "Merlin", "resume": "The unlikely friendship between Merlin, a young man gifted with extraordinary magical powers, and Prince Arthur, heir to the crown of Camelot.", "rate": 70, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Colin Morgan", "Angel Coulby", "Katie McGrath", "Bradley James", "John Hurt"], "character": ["Merlin", "Guinevere", "Morgana Pendragon", "Arthur Pendragon", "The Dragon (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7225   Expand Merlin   (2008) User Score  Play Trailer Overview The unlikely friendship between Merlin, a young man gifted with extraordinary magical powers, and Prince Arthur, heir to the crown of Camelot. Featured Crew Jake Michie Creator Johnny Capps Creator Julian Murphy Creator Julian Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  30 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Colin Morgan Merlin Angel Coulby Guinevere Katie McGrath Morgana Pendragon Bradley James Arthur Pendragon John Hurt The Dragon (voice) Full Cast & Crew Last Season Season 5 2012 | 13 Episodes Season 5 of Merlin premiered on October  6, 2012. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Arthur: Happy Birthday Bradley James! Open 0 by wonder2wonder\n      \n     J They should have made Morgana good again Open 2 by  Joe w Guinevere: Happy Birthday Angel Coulby! Open 1 by  Joe Go to Discussions Media Most Popular Videos  1 Backdrops  30 Posters  9 Recommendations   2008-11-01 Legend of the Seeker 7.2    1999-10-06 Roswell 7.0    2013-10-09 The Tomorrow People 6.6    1995-09-04 Xena: Warrior Princess 6.7    2006-10-22 Torchwood 7.4    1998-10-07 Charmed 6.7    2013-10-06 Witches of East End 6.6    2001-10-16 Smallville 6.9  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  50m, 45m Homepage   http://www.bbc.co.uk/merlin/ Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords magic supernatural powers royal family fantasy world wizard Content Score 100 Yes! Looking good! Top Contributors 40 Banana 18 Elizabeth Jennings 11 ElgarL 10 Damien Haynes  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}