{"link": "https://www.themoviedb.org/tv/29853?language=en", "title": "In Cold Blood", "resume": "At the end of the 1950s, in a more innocent America, the brutal, meaningless slaying of a Midwestern family horrified the nation. This film is based on Truman Capote's hauntingly detailed, psychologically penetrating nonfiction novel. While in prison, Dick Hickock, 20, hears a cell-mate's story about $10,000 in cash kept in a home safe by a prosperous rancher. When he's paroled, Dick persuades ex-con Perry Smith, also 20, to join him in going after the stash. On a November night in 1959, Dick and Perry break into the Holcomb, Kansas, house of Herb Clutter. Enraged at finding no safe, they wake the sleeping family and brutally kill them all. The bodies are found by two friends who come by before Sunday church. The murders shock the small Great Plains town, where doors are routinely left unlocked. Detective Alvin Dewey of the Kansas Bureau of Investigation heads the case, but there are no clues, no apparent motive and no suspects...", "rate": 62, "genre": ["Drama"], "cast": ["Margot Finley", "Anthony Edwards", "Leo Rossi", "Eric Roberts", "Kevin Tighe"], "character": ["Dick Hickock", "Perry Smith", "Herbert Clutter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29853   Expand In Cold Blood   (1996) User Score  Play Trailer Overview At the end of the 1950s, in a more innocent America, the brutal, meaningless slaying of a Midwestern family horrified the nation. This film is based on Truman Capote's hauntingly detailed, psychologically penetrating nonfiction novel. While in prison, Dick Hickock, 20, hears a cell-mate's story about $10,000 in cash kept in a home safe by a prosperous rancher. When he's paroled, Dick persuades ex-con Perry Smith, also 20, to join him in going after the stash. On a November night in 1959, Dick and Perry break into the Holcomb, Kansas, house of Herb Clutter. Enraged at finding no safe, they wake the sleeping family and brutally kill them all. The bodies are found by two friends who come by before Sunday church. The murders shock the small Great Plains town, where doors are routinely left unlocked. Detective Alvin Dewey of the Kansas Bureau of Investigation heads the case, but there are no clues, no apparent motive and no suspects... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Margot Finley Anthony Edwards Dick Hickock Leo Rossi Eric Roberts Perry Smith Kevin Tighe Herbert Clutter Full Cast & Crew Last Season Season 1 1996 | 2 Episodes Season 1 of In Cold Blood premiered on November 24, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   1998-05-18 Creature 4.2    2004-06-20 Salem's Lot 5.5    2005-12-05 The Triangle 6.1    2010-07-23 The Pillars of the Earth 7.9    1979-11-17 Salem's Lot 6.4  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  240m Homepage  - Genres Drama Keywords based on novel or book remake murder miniseries true crime 1950s Content Score 93 Almost there... Top Contributors TB 23 TMDb Bot 7 Banana s 2 speedycars 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}