{"link": "https://www.themoviedb.org/tv/7597?language=en", "title": "House of Saddam", "resume": "The intimate world of Saddam Hussein and his closest inner circle is in this gripping four-part drama that charts the rise and fall of one of the most significant political figures in recent history.", "rate": 68, "genre": ["War", "Politics", "Drama"], "cast": ["Christine Stephen-Daly", "Shohreh Aghdashloo", "Makram Khoury", "Igal Naor", "Daniel Lundh"], "character": ["Samira Shahbandar", "Sajida Hussein", "Tariq Aziz", "Saddam Hussein", "Saddam Kamel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7597   Expand House of Saddam   (2008) User Score  Play Trailer Overview The intimate world of Saddam Hussein and his closest inner circle is in this gripping four-part drama that charts the rise and fall of one of the most significant political figures in recent history. Featured Crew Alex Holmes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christine Stephen-Daly Samira Shahbandar Shohreh Aghdashloo Sajida Hussein Makram Khoury Tariq Aziz Igal Naor Saddam Hussein Daniel Lundh Saddam Kamel Full Cast & Crew Last Season Miniseries 2008 | 4 Episodes Season 1 of House of Saddam premiered on July 30, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for House of Saddam. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on House of Saddam. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00cwkqy Genres War & Politics Drama Keywords middle east iraq saddam hussein miniseries iraq war Content Score 100 Yes! Looking good! Top Contributors 26 Banana 17 Elizabeth Jennings 12 ibinbin TB 12 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}