{"link": "https://www.themoviedb.org/tv/59086?language=en", "title": "Some Girls", "resume": "Some Girls is a British comedy series written by Bernadette Davis that airs on BBC Three. The show stars Adelayo Adedayo, Mandeep Dhillon, Alice Felgate, Natasha Jonas, Dolly Wells, Colin Salmon, Jassa Ahluwalia and Franz Drameh. It debuted on 6 November 2012 and the first series ran for six episodes.\nBBC Three announced at the end of the first series that the show would return for a second series. On 18 September 2013, they confirmed that each episode of the second series will premiere on BBC iPlayer a week ahead of being broadcast on BBC Three. The first episode became available on iPlayer on 23 September and will be broadcast on BBC Three on 30 September with the rest of the series following that trend.", "rate": 100, "genre": ["Comedy"], "cast": ["Adelayo Adedayo", "Natasha Jonas", "Alice Felgate", "Mandeep Dhillon", "Dolly Wells"], "character": ["Viva Bennett", "Holli Vavasour", "Amber Dean", "Saz Kaur", "Anna Hitchcock"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59086   Expand Some Girls   (2012) User Score Overview Some Girls is a British comedy series written by Bernadette Davis that airs on BBC Three. The show stars Adelayo Adedayo, Mandeep Dhillon, Alice Felgate, Natasha Jonas, Dolly Wells, Colin Salmon, Jassa Ahluwalia and Franz Drameh. It debuted on 6 November 2012 and the first series ran for six episodes. BBC Three announced at the end of the first series that the show would return for a second series. On 18 September 2013, they confirmed that each episode of the second series will premiere on BBC iPlayer a week ahead of being broadcast on BBC Three. The first episode became available on iPlayer on 23 September and will be broadcast on BBC Three on 30 September with the rest of the series following that trend. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adelayo Adedayo Viva Bennett Natasha Jonas Holli Vavasour Alice Felgate Amber Dean Mandeep Dhillon Saz Kaur Dolly Wells Anna Hitchcock Full Cast & Crew Last Season Series 3 2014 | 6 Episodes Season 3 of Some Girls premiered on November 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Some Girls. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/p01gkh5q Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 25 Elizabeth Jennings R 3 Rebecca 2 janamang 2 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}