{"link": "https://www.themoviedb.org/tv/9356?language=en", "title": "Angelmouse", "resume": "Angelmouse is a children's television programme which was produced and broadcast by the BBC. It was aired on CBeebies. It was also aired on CITV in 2012. It has also been broadcast on ABC Kids. It started from 27 September 1999 and ended on 20 March 2000.\nThere are also Angelmouse books and plush toys.\nIt was narrated by David Jason who also voiced Danger Mouse, Count Duckula, Toad in The Wind in the Willows, Hugo in Victor and Hugo, The BFG and Father Christmas in Father Christmas and the Missing Reindeer.", "rate": 0, "genre": ["Family", "Animation"], "cast": ["David Jason"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9356   Expand Angelmouse User Score Overview Angelmouse is a children's television programme which was produced and broadcast by the BBC. It was aired on CBeebies. It was also aired on CITV in 2012. It has also been broadcast on ABC Kids. It started from 27 September 1999 and ended on 20 March 2000. There are also Angelmouse books and plush toys. It was narrated by David Jason who also voiced Danger Mouse, Count Duckula, Toad in The Wind in the Willows, Hugo in Victor and Hugo, The BFG and Father Christmas in Father Christmas and the Missing Reindeer. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Jason Full Cast & Crew Last Season Season 1 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage  - Genres Family Animation Keywords angel cartoon mouse good deed reference to god Content Score 36 There's no 'I' in team... Top Contributors 10 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}