{"link": "https://www.themoviedb.org/tv/953?language=en", "title": "Maverick", "resume": "Maverick is an American Western television series with comedic overtones created by Roy Huggins. The show ran from September 22, 1957 to July 8, 1962 on ABC and stars James Garner as Bret Maverick, an adroitly articulate cardsharp. Eight episodes into the first season, he was joined by Jack Kelly as his brother Bart, and from that point on, Garner and Kelly alternated leads from week to week, sometimes teaming up for the occasional two-brother episode. The Mavericks were poker players from Texas who traveled all over the American Old West and on Mississippi riverboats, constantly getting into and out of life-threatening trouble of one sort or another, usually involving money, women, or both. They would typically find themselves weighing a financial windfall against a moral dilemma. More often than not, their consciences trumped their wallets since both Mavericks were intensely ethical.\nWhen Garner left the series after the third season due to a legal dispute, Roger Moore was added to the cast as their cousin Beau Maverick. Robert Colbert appeared later in the fourth season as a third Maverick brother, Brent Maverick. No more than two of the series leads ever appeared together in the same episode, and usually only one.", "rate": 80, "genre": ["Comedy", "Western"], "cast": ["Jack Kelly"], "character": ["Bart Maverick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 953   Expand Maverick   (1957) User Score Overview Maverick is an American Western television series with comedic overtones created by Roy Huggins. The show ran from September 22, 1957 to July 8, 1962 on ABC and stars James Garner as Bret Maverick, an adroitly articulate cardsharp. Eight episodes into the first season, he was joined by Jack Kelly as his brother Bart, and from that point on, Garner and Kelly alternated leads from week to week, sometimes teaming up for the occasional two-brother episode. The Mavericks were poker players from Texas who traveled all over the American Old West and on Mississippi riverboats, constantly getting into and out of life-threatening trouble of one sort or another, usually involving money, women, or both. They would typically find themselves weighing a financial windfall against a moral dilemma. More often than not, their consciences trumped their wallets since both Mavericks were intensely ethical. When Garner left the series after the third season due to a legal dispute, Roger Moore was added to the cast as their cousin Beau Maverick. Robert Colbert appeared later in the fourth season as a third Maverick brother, Brent Maverick. No more than two of the series leads ever appeared together in the same episode, and usually only one. Featured Crew Roy Huggins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Jack Kelly Bart Maverick Full Cast & Crew Last Season season 5 1961 | 13 Episodes Season 5 of Maverick premiered on September 17, 1961. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply \"Dutchman's Gold\" episode loosely based on history Open 0 by Moon_Doggie\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations   1969-09-24 Medical Center 6.3    1963-09-17 The Fugitive 7.9    1963-09-29 My Favorite Martian 5.4    1965-01-24 Branded 8.3    1968-01-09 It Takes a Thief 7.4    1959-10-05 Adventures in Paradise 7.5    1962-10-11 McHale's Navy 6.1    1962-10-02 Combat! 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Western Keywords professional gambler Content Score 71 Just a little bit more... Top Contributors 21 Steve z 6 zurman1 5 lineker PE 5 Patrick E. Abe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}