{"link": "https://www.themoviedb.org/tv/45278?language=en", "title": "Natsuyuki Rendezvous", "resume": "Natsuyuki Rendezvous is a Japanese manga series by Haruka Kawachi which serialized in Shodensha's Feel Young magazine between July 2009 and January 2012. An anime television adaptation by Dogakobo aired in Fuji TV's Noitamina block between July 6, 2012 and September 14, 2012. The anime series has been licensed by Sentai Filmworks in North America.", "rate": 0, "genre": ["Animation", "Drama", "Drama"], "cast": ["Yuichi Nakamura", "Jun Fukuyama"], "character": ["Ryōsuke Hazuki", "Atsushi Shimao"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45278   Expand Natsuyuki Rendezvous   (2012) User Score Overview Natsuyuki Rendezvous is a Japanese manga series by Haruka Kawachi which serialized in Shodensha's Feel Young magazine between July 2009 and January 2012. An anime television adaptation by Dogakobo aired in Fuji TV's Noitamina block between July 6, 2012 and September 14, 2012. The anime series has been licensed by Sentai Filmworks in North America. Featured Crew Kō Matsuo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuichi Nakamura Ryōsuke Hazuki Jun Fukuyama Atsushi Shimao Full Cast & Crew Last Season Season 1 2012 | 11 Episodes Season 1 of Natsuyuki Rendezvous premiered on July  6, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Natsuyuki Rendezvous. You can help by rating TV shows you've seen. Facts Original Name  夏雪ランデブー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 12 BrerFox 4 sp1ti m 3 magoozin _ 3 _Anarchist  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}