{"link": "https://www.themoviedb.org/tv/35268?language=en", "title": "The Glee Project", "resume": "The Glee Project is an American reality television series from Oxygen. It serves as an audition for the FOX musical comedy series Glee, and the prize for the winner is a seven-episode arc in the following season of the show. The show's first season premiered in the US on June 12, 2011, and concluded on August 21, 2011. In Canada, the series began airing on Slice on June 26, 2011, and in the UK, the series began airing on Sky1 on July 14, 2011. A second season aired in the US from June 5 to August 14, 2012. In July 2013, it was announced that The Glee Project will not return for a third season.\nGlee executive producers Ryan Murphy and Dante Di Loreto are executive producers for The Glee Project. Glee's casting director, Robert Ulrich, is casting director for the project.", "rate": 58, "genre": [], "cast": ["Blake Jenner"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35268   Expand The Glee Project   (2011) User Score Overview The Glee Project is an American reality television series from Oxygen. It serves as an audition for the FOX musical comedy series Glee, and the prize for the winner is a seven-episode arc in the following season of the show. The show's first season premiered in the US on June 12, 2011, and concluded on August 21, 2011. In Canada, the series began airing on Slice on June 26, 2011, and in the UK, the series began airing on Sky1 on July 14, 2011. A second season aired in the US from June 5 to August 14, 2012. In July 2013, it was announced that The Glee Project will not return for a third season. Glee executive producers Ryan Murphy and Dante Di Loreto are executive producers for The Glee Project. Glee's casting director, Robert Ulrich, is casting director for the project. Featured Crew Ryan Murphy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Blake Jenner Himself Full Cast & Crew Last Season Season 2 2012 | 11 Episodes Season 2 of The Glee Project premiered on June  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Glee Project. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://thegleeproject.oxygen.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 6 dbowman D 2 Daniel s 2 sora_sey C 1 CherryJones  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}