{"link": "https://www.themoviedb.org/tv/58557?language=en", "title": "Ja'mie: Private School Girl", "resume": "Ja'mie King, the self-promoting \"queen bee\" of Summer Heights High, returns from an exchange semester at that public school for her last three months at Hillford Girls Grammar, where she's the unchallenged diva among the school's most popular girls, as well as the school captain. Clothes, cars, boys, parties ... Ja'mie has it all, and her overriding goal is to win the Hillford Medal", "rate": 67, "genre": ["Comedy"], "cast": ["Chris Lilley"], "character": ["Ja'mie King"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58557   Expand Ja'mie: Private School Girl   (2013) User Score  Play Trailer Overview Ja'mie King, the self-promoting \"queen bee\" of Summer Heights High, returns from an exchange semester at that public school for her last three months at Hillford Girls Grammar, where she's the unchallenged diva among the school's most popular girls, as well as the school captain. Clothes, cars, boys, parties ... Ja'mie has it all, and her overriding goal is to win the Hillford Medal Featured Crew Chris Lilley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Lilley Ja'mie King Full Cast & Crew Last Season Season 1 2013 | 6 Episodes Season 1 of Ja'mie: Private School Girl premiered on October 30, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  0 Posters  2 Recommendations   2011-05-11 Angry Boys 6.5    2014-05-07 Jonah From Tonga 6.6    2013-10-20 Toast of London 6.8    2010-12-25 Come Fly With Me 6.6    2007-09-05 Summer Heights High 7.4    2014-01-13 Uncle 7.3    1996-11-12 Never Mind the Buzzcocks 7.5    2006-10-06 Not Going Out 7.8  Facts Status  Ended Networks Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Comedy Keywords mockumentary teenage girl teenager swearing social media rich brat brat Content Score 56 We're so close, yet so far. Top Contributors a 18 alexmate TB 12 TMDb Bot 10 Banana O 7 Oath  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}