{"link": "https://www.themoviedb.org/tv/30904?language=en", "title": "BrzydUla", "resume": "BrzydUla was a Polish telenovela that premiered on October 6, 2008, on TVN in Poland. The series was an adaptation of the Colombian telenovela Yo soy Betty, la fea. The Polish version told the story of an ugly but smart girl who started to work at the Febo & Dobrzański fashion house, and she fell in love with her boss, Marek Dobrzański. Ula had a sick father, Józef, a teenage brother, Jasiek, and a much younger sister, Beatka. The telenovela also told the stories of Ula's friends' and coworkers' lives. Series was broadcast from Monday to Friday at 17:55 / 5:55PM, replays the next day at 08:00 am and Saturday at 16.40. Series was carried out in HD. HD version of the show was available on the TVN channel HD broadcast takes place in parallel with the issue on the TVN channel.\nTop song from the show Fri So much sun in the city from the repertoire sung by Anna Jantar Julia Kaminska.", "rate": 73, "genre": ["Comedy"], "cast": ["Małgorzata Socha", "Julia Kamińska", "Filip Bobek", "Maja Hirsch", "Krzysztof Czeczot"], "character": ["Viola Kubasinska", "Urszula Cieplak", "Marek Dobrzański", "Paulina Febo", "Maciej Szymczyk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30904   Expand BrzydUla   (2008) User Score Overview BrzydUla was a Polish telenovela that premiered on October 6, 2008, on TVN in Poland. The series was an adaptation of the Colombian telenovela Yo soy Betty, la fea. The Polish version told the story of an ugly but smart girl who started to work at the Febo & Dobrzański fashion house, and she fell in love with her boss, Marek Dobrzański. Ula had a sick father, Józef, a teenage brother, Jasiek, and a much younger sister, Beatka. The telenovela also told the stories of Ula's friends' and coworkers' lives. Series was broadcast from Monday to Friday at 17:55 / 5:55PM, replays the next day at 08:00 am and Saturday at 16.40. Series was carried out in HD. HD version of the show was available on the TVN channel HD broadcast takes place in parallel with the issue on the TVN channel. Top song from the show Fri So much sun in the city from the repertoire sung by Anna Jantar Julia Kaminska. Featured Crew Wojciech Smarzowski Creator Robert Wichrowski Creator Filip Zylber Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Małgorzata Socha Viola Kubasinska Julia Kamińska Urszula Cieplak Filip Bobek Marek Dobrzański Maja Hirsch Paulina Febo Krzysztof Czeczot Maciej Szymczyk Full Cast & Crew Last Season Season 2 2009 | 67 Episodes Season 2 of BrzydUla premiered on September  7, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on BrzydUla. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.brzydula.tvn.pl/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors c 3 czakur m 2 mario934  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}