{"link": "https://www.themoviedb.org/tv/34406?language=en", "title": "Take Two with Phineas and Ferb", "resume": "Take Two with Phineas and Ferb is a spin-off series from Phineas and Ferb that premiered on Disney Channel on December 3, 2010. The series revolves around Phineas and Ferb interviewing celebrities. The show's aforementioned premise bears similarities to that of Cartoon Network's late-night animated talk show Space Ghost Coast to Coast on Adult Swim. The show ran for one season, and was not picked up for a second.", "rate": 40, "genre": ["Animation"], "cast": ["Vincent Martella", "Thomas Brodie-Sangster", "Ashley Tisdale", "Alyson Stoner", "Bobby Gaylor"], "character": ["Phineas Flynn", "Ferb Fletcher", "Candace Flynn", "Isabella Garcia-Shapiro", "Buford Van Stomm"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34406   Expand Take Two with Phineas and Ferb   (2010) User Score Overview Take Two with Phineas and Ferb is a spin-off series from Phineas and Ferb that premiered on Disney Channel on December 3, 2010. The series revolves around Phineas and Ferb interviewing celebrities. The show's aforementioned premise bears similarities to that of Cartoon Network's late-night animated talk show Space Ghost Coast to Coast on Adult Swim. The show ran for one season, and was not picked up for a second. Featured Crew Dan Povenmire Creator Jeff 'Swampy' Marsh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vincent Martella Phineas Flynn Thomas Brodie-Sangster Ferb Fletcher Ashley Tisdale Candace Flynn Alyson Stoner Isabella Garcia-Shapiro Bobby Gaylor Buford Van Stomm Full Cast & Crew Last Season Season 2 2011 | 10 Episodes Season 2 of Take Two with Phineas and Ferb premiered on July 23, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Take Two with Phineas and Ferb. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  2m, 3m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors E 1 Ez3ahshu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}