{"link": "https://www.themoviedb.org/tv/70265?language=en", "title": "Suamiku Paling Sweet", "resume": "The story tells Qisya Iriz (Mawar Rashid), university graduates who had become a nanny while Hafiey (brother Nik Adam Mika), the grandson of a friend of his mother, Mrs. Fathma (Liza Abdullah). Nanny-nanny before which can not survive with a mischievous attitude Hafiey it. Qisya accept her proposals as it is only for a while. When Qisya stubborn met with Hafiey, it will lead to chaos.\nBoth parents Hafiey had died in an accident. Because of that, Hafiey regarded the uncle Izz Haikal (Syafiq Kyle) as his own father. Izz willing to do anything for the happiness of Hafiey. After meeting with caregivers Hafiey, heart pounding Izz and Qisya often. But they do not care about the true meaning behind the heart palpitations occur until an event that changed the fate of both their lives.", "rate": 0, "genre": ["Drama"], "cast": ["Mawar Rashid", "Syafiq Kyle", "Natasya Mahyan", "Fazren Rafi", "Nik Adam Mika"], "character": ["Qisya Iriz", "Izz Haikal", "Maya", "Qairul", "Hafiey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70265   Expand Suamiku Paling Sweet   (2017) User Score Overview The story tells Qisya Iriz (Mawar Rashid), university graduates who had become a nanny while Hafiey (brother Nik Adam Mika), the grandson of a friend of his mother, Mrs. Fathma (Liza Abdullah). Nanny-nanny before which can not survive with a mischievous attitude Hafiey it. Qisya accept her proposals as it is only for a while. When Qisya stubborn met with Hafiey, it will lead to chaos. Both parents Hafiey had died in an accident. Because of that, Hafiey regarded the uncle Izz Haikal (Syafiq Kyle) as his own father. Izz willing to do anything for the happiness of Hafiey. After meeting with caregivers Hafiey, heart pounding Izz and Qisya often. But they do not care about the true meaning behind the heart palpitations occur until an event that changed the fate of both their lives. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mawar Rashid Qisya Iriz Syafiq Kyle Izz Haikal Natasya Mahyan Maya Fazren Rafi Qairul Nik Adam Mika Hafiey Full Cast & Crew Last Season Season 1 2017 | 28 Episodes Season 1 of Suamiku Paling Sweet premiered on February 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Suamiku Paling Sweet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Malay Runtime  44m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors v 35 vplaytv M 2 Mr_Democracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}