{"link": "https://www.themoviedb.org/tv/12637?language=en", "title": "Rebelde", "resume": "Rebelde is a Mexican telenovela produced by Televisa and created by Cris Morena. It is a remake of a famous Argentine series Rebelde Way adapted for the Mexican audience therefore leading to differences in characters' backgrounds. The series ran for three seasons, the final episode airing in Mexico on June 2, 2006. Rebelde was replaced in June 2006 with Televisa's new series Código Postal.\nThe series is set at the Elite Way School, a prestigious private boarding high school in Mexico City with a major plot line revolving around a group of students forming a pop band. Additional subplots involve the school's faculty and the students' parents. One trademark of the show is the random use of English words and phrases, often used by fresa characters.\nA notable aspect of the series is that the actors playing the bandmembers are themselves in an actual band named RBD, and perform most of the music used on the show. They have been extremely successful in their own right, becoming one of the most popular acts in Latin America and touring internationally.\nRebelde began airing March 21, 2005 and ended on December 15, 2006. The show was also transmitted in 65 other countries, including Serbia, Peru, Romania on Acasa TV, Brazil, Spain on Antena 3, Slovenia, Bulgaria and from September 2009 in Slovakia on TV Doma, in Croatia on Nova TV and in Albania on Vizion Plus.", "rate": 69, "genre": ["Comedy"], "cast": ["Maite Perroni", "Anahí", "Dulce María", "Christopher Von Uckermann", "Alfonso Herrera"], "character": ["Guadalupe \"Lupita\" Fernandez", "Mia Colucci", "Roberta Pardo Rey", "Diego Bustamante", "Miguel Arango"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12637   Expand Rebelde   (2004) User Score Overview Rebelde is a Mexican telenovela produced by Televisa and created by Cris Morena. It is a remake of a famous Argentine series Rebelde Way adapted for the Mexican audience therefore leading to differences in characters' backgrounds. The series ran for three seasons, the final episode airing in Mexico on June 2, 2006. Rebelde was replaced in June 2006 with Televisa's new series Código Postal. The series is set at the Elite Way School, a prestigious private boarding high school in Mexico City with a major plot line revolving around a group of students forming a pop band. Additional subplots involve the school's faculty and the students' parents. One trademark of the show is the random use of English words and phrases, often used by fresa characters. A notable aspect of the series is that the actors playing the bandmembers are themselves in an actual band named RBD, and perform most of the music used on the show. They have been extremely successful in their own right, becoming one of the most popular acts in Latin America and touring internationally. Rebelde began airing March 21, 2005 and ended on December 15, 2006. The show was also transmitted in 65 other countries, including Serbia, Peru, Romania on Acasa TV, Brazil, Spain on Antena 3, Slovenia, Bulgaria and from September 2009 in Slovakia on TV Doma, in Croatia on Nova TV and in Albania on Vizion Plus. Featured Crew Cris Morena Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maite Perroni Guadalupe \"Lupita\" Fernandez Anahí Mia Colucci Dulce María Roberta Pardo Rey Christopher Von Uckermann Diego Bustamante Alfonso Herrera Miguel Arango Full Cast & Crew Last Season Season 3 — | 46 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2003-07-06 Pasión de gavilanes 5.6    2004-05-17 Rubí 8.0    2002-08-07 La familia P. Luche 6.8    2011-03-07 Crematorio 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage  - Genres Comedy Keywords telenovela Content Score 100 Yes! Looking good! Top Contributors 98 Amanda s 3 shiff7 s 3 speedycars b 3 bluwy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}