{"link": "https://www.themoviedb.org/tv/42882?language=en", "title": "Bubblegum Crisis", "resume": "In the near future, Tokyo was left flattened as a result from a great earthquake. A new city, MegaTokyo, was then recreated due in no small part from the aid of a multi-million dollar company, Genom Corp. Genom created and mass-produced biomechanical creatures called Boomers to aid in the restoration of MegaTokyo. When the Boomers began to run out of control, the ADPolice at first tried to stop them, but they proved to be far more difficult to deal with than was first imagined. Under the ever looming Boomer threat, a group of four girls from varying degrees of society banded together. Calling themselves The Knight Sabers, they were the only ones with enough firepower and resourcefullness to defend the fledgling MegaTokyo from Genom and it's berserk Boomers.", "rate": 65, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Kenichi Ogata", "Michael Sinterniklaas"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42882   Expand Bubblegum Crisis   (1987) User Score Overview In the near future, Tokyo was left flattened as a result from a great earthquake. A new city, MegaTokyo, was then recreated due in no small part from the aid of a multi-million dollar company, Genom Corp. Genom created and mass-produced biomechanical creatures called Boomers to aid in the restoration of MegaTokyo. When the Boomers began to run out of control, the ADPolice at first tried to stop them, but they proved to be far more difficult to deal with than was first imagined. Under the ever looming Boomer threat, a group of four girls from varying degrees of society banded together. Calling themselves The Knight Sabers, they were the only ones with enough firepower and resourcefullness to defend the fledgling MegaTokyo from Genom and it's berserk Boomers.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenichi Ogata Michael Sinterniklaas Full Cast & Crew Last Season Bubblegum Crash 1991 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   2000-12-03 Frank Herbert's Dune 6.7    2004-05-20 Samurai Champloo 8.0    2009-07-07 Warehouse 13 7.2    1969-10-05 Monty Python's Flying Circus 8.2  Facts Original Name  バブルガムクライシス Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  45m, 41m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords mecha cyberpunk anime a.d. police Content Score 56 We're so close, yet so far. Top Contributors 56 sp1ti CM 13 Cherche Moi F 3 FabioWC 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}