{"link": "https://www.themoviedb.org/tv/63455?language=en", "title": "Zero: Black Blood", "resume": "Ray Fujita stars as the lead character Rei Suzumura, the Silver Fanged Knight Zero, reprising his role as the character from the previous Garo television series and films. This series explores this character who served a supporting role in the previous productions and his investigation of a joint human and Horror commune led by the Horror Ring.", "rate": 75, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Ray Fujita", "Thane Camus", "Ai Orikasa", "Riria", "Naoki Takeshi"], "character": ["Rei Suzumura", "Ring", "Silva (voice)", "Yuna", "Kain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63455   Expand Zero: Black Blood   (2014) User Score  Play Trailer Overview Ray Fujita stars as the lead character Rei Suzumura, the Silver Fanged Knight Zero, reprising his role as the character from the previous Garo television series and films. This series explores this character who served a supporting role in the previous productions and his investigation of a joint human and Horror commune led by the Horror Ring. Featured Crew Keita Amemiya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ray Fujita Rei Suzumura Thane Camus Ring Ai Orikasa Silva (voice) Riria Yuna Naoki Takeshi Kain Full Cast & Crew Last Season Season 1 2014 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Zero: Black Blood. You can help by rating TV shows you've seen. Facts Original Name  絶狼＜ZERO＞-BLACK BLOOD- Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://garo-project.jp/ZERO/ Genres Action & Adventure Sci-Fi & Fantasy Keywords knight tokusatsu garo zero Content Score 100 Yes! Looking good! Top Contributors 33 miryoku 14 J. TB 3 TMDb Bot 2 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}