{"link": "https://www.themoviedb.org/tv/63022?language=en", "title": "Witch’s Romance", "resume": "Drama series depicts a love story between Ban Ji-Yeon and Yoon Dong-Ha. \nBan Ji-Yeon is a single 39-year-old woman. She works as a reporter and is very enthusiastic about her work. So much so that she is often called a “witch” at work. She doesn't believe in true love, because of her past experience when her boyfriend disappeared prior to their wedding. \nYoon Dong-Ha is 25-year-old young man who runs a small errand center with his friend. The errand center will do pretty much anything including sending out someone dressed as Santa Claus or provide security for an idol star. He looks like a happy guy, but he lost his girlfriend by an accident.", "rate": 88, "genre": ["Comedy", "Romance"], "cast": ["Park Seo-jun", "Uhm Jung-hwa", "Jeong Yeon-joo", "Yang Hee-Kyung", "Ra Mi-ran"], "character": ["Yoon Dong-ha", "Ban Ji-yeon", "Jung Eun-chae", "Choi Jung-sook", "Baek Na-rae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63022   Expand Witch’s Romance   (2014) User Score Overview Drama series depicts a love story between Ban Ji-Yeon and Yoon Dong-Ha.  Ban Ji-Yeon is a single 39-year-old woman. She works as a reporter and is very enthusiastic about her work. So much so that she is often called a “witch” at work. She doesn't believe in true love, because of her past experience when her boyfriend disappeared prior to their wedding.  Yoon Dong-Ha is 25-year-old young man who runs a small errand center with his friend. The errand center will do pretty much anything including sending out someone dressed as Santa Claus or provide security for an idol star. He looks like a happy guy, but he lost his girlfriend by an accident. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Seo-jun Yoon Dong-ha Uhm Jung-hwa Ban Ji-yeon Jeong Yeon-joo Jung Eun-chae Yang Hee-Kyung Choi Jung-sook Ra Mi-ran Baek Na-rae Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Witch’s Romance premiered on April 14, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Witch’s Romance. You can help by rating TV shows you've seen. Facts Original Name  마녀의 연애 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/witch Genres Comedy Romance Keywords remake korea Content Score 86 Almost there... Top Contributors M 45 Maria180493 z 5 zurman1 s 4 sheva_vitali 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}