{"link": "https://www.themoviedb.org/tv/232?language=en", "title": "Ultraviolet", "resume": "Ultraviolet is a 1998 United Kingdom television series written and directed by Joe Ahearne and starring Jack Davenport, Susannah Harker, Idris Elba and Philip Quast. Music was composed and performed by Sue Hewitt. The programme was produced by World Productions for Channel 4.", "rate": 75, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Susannah Harker", "Jack Davenport", "Idris Elba", "Philip Quast", "Colette Brown"], "character": ["Dr. Angela March", "Michael Colefield", "Vaughan Rice", "Father Pearse J. Harman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 232   Expand Ultraviolet   (1998) User Score Overview Ultraviolet is a 1998 United Kingdom television series written and directed by Joe Ahearne and starring Jack Davenport, Susannah Harker, Idris Elba and Philip Quast. Music was composed and performed by Sue Hewitt. The programme was produced by World Productions for Channel 4. Featured Crew Joe Ahearne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Susannah Harker Dr. Angela March Jack Davenport Michael Colefield Idris Elba Vaughan Rice Philip Quast Father Pearse J. Harman Colette Brown Full Cast & Crew Last Season Season 1 1998 | 6 Episodes Season 1 of Ultraviolet premiered on September 15, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2009-01-15 The Beast 7.0    1995-09-22 American Gothic 7.7    1980-09-13 Hammer House of Horror 6.5    2011-09-21 The Fades 7.0    1967-01-10 The Invaders 7.3    1994-01-19 The Day Today 8.3    1992-12-06 A Touch of Frost 7.9    1982-11-09 The Young Ones 7.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.world-productions.com/wp/content/shows/other/uv/uvhome.htm Genres Drama Sci-Fi & Fantasy Keywords vampire vampire hunter secret government organization miniseries Content Score 93 Almost there... Top Contributors 10 Banana TB 7 TMDb Bot R 6 Rebecca 5 2 5lucina5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}