{"link": "https://www.themoviedb.org/tv/20755?language=en", "title": "The Last Days of Pompeii", "resume": "This seven-hour British-Italian adaptation of Edward Bulwer-Lytton's 1834 epic, set against the eruption of Mount Vesuvius in 79 A.D. and previously filmed in 1935, and in 1960 was a vehicle for muscleman Steve Reeves, was trashed by the critics as the campiest of sword and sandal sagas to emerge in years. This despite its reported $19-million price tag, the nobility of its cast that includes Laurence Olivier, Siobhan McKenna and Anthony Quayle, and its rather unspectacular special effects. The central figures are Nicholas Clay as Glaucus, the noble Athenian; Olivia Hussey as the high-born Ione, his love, who is seduced by the Egyptian, Arbaces (Franco Nero), a religious fanatic; Duncan Regehr as Lydon, the champion gladiator; and Linda Purl as the blind slave Nydia, who is torn between Glaucus and Lydon.", "rate": 70, "genre": ["Drama"], "cast": ["Linda Purl", "Anthony Quayle", "Duncan Regehr", "Laurence Olivier", "Benedict Taylor"], "character": ["Nydia", "Quintus", "Lydon", "Gaius", "Antonius"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20755   Expand The Last Days of Pompeii   (1984) User Score Overview This seven-hour British-Italian adaptation of Edward Bulwer-Lytton's 1834 epic, set against the eruption of Mount Vesuvius in 79 A.D. and previously filmed in 1935, and in 1960 was a vehicle for muscleman Steve Reeves, was trashed by the critics as the campiest of sword and sandal sagas to emerge in years. This despite its reported $19-million price tag, the nobility of its cast that includes Laurence Olivier, Siobhan McKenna and Anthony Quayle, and its rather unspectacular special effects. The central figures are Nicholas Clay as Glaucus, the noble Athenian; Olivia Hussey as the high-born Ione, his love, who is seduced by the Egyptian, Arbaces (Franco Nero), a religious fanatic; Duncan Regehr as Lydon, the champion gladiator; and Linda Purl as the blind slave Nydia, who is torn between Glaucus and Lydon. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Linda Purl Nydia Anthony Quayle Quintus Duncan Regehr Lydon Laurence Olivier Gaius Benedict Taylor Antonius Full Cast & Crew Last Season Season 1 1984 | 3 Episodes Season 1 of The Last Days of Pompeii premiered on May  6, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Last Days of Pompeii. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  140m Homepage  - Genres Drama Keywords gladiator volcano miniseries Content Score 71 Just a little bit more... Top Contributors TB 26 TMDb Bot R 14 Rebecca 10 Elizabeth Jennings a 3 atom100  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}