{"link": "https://www.themoviedb.org/tv/46786?language=en", "title": "Bates Motel", "resume": "A \"contemporary prequel\" to the 1960 film Psycho, depicting the life of Norman Bates and his mother Norma prior to the events portrayed in Hitchcock's film, albeit in a different fictional town and in a modern setting. The series begins after the death of Norma's husband, when she purchases a motel located in a coastal Oregon town so she and Norman can start a new life.", "rate": 77, "genre": ["Drama", "Mystery"], "cast": ["Vera Farmiga", "Freddie Highmore", "Max Thieriot", "Olivia Cooke", "Nestor Carbonell"], "character": ["Norma Bates", "Norman Bates", "Dylan Massett", "Emma Decody", "Sheriff Alex Romero"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46786   Expand Bates Motel   (2013) User Score  Play Trailer Overview A \"contemporary prequel\" to the 1960 film Psycho, depicting the life of Norman Bates and his mother Norma prior to the events portrayed in Hitchcock's film, albeit in a different fictional town and in a modern setting. The series begins after the death of Norma's husband, when she purchases a motel located in a coastal Oregon town so she and Norman can start a new life. Featured Crew Carlton Cuse Creator Anthony Cipriano Creator Kerry Ehrin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  45 Content Issues  0 Images Backdrops  24 Posters  25 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vera Farmiga Norma Bates Freddie Highmore Norman Bates Max Thieriot Dylan Massett Olivia Cooke Emma Decody Nestor Carbonell Sheriff Alex Romero Full Cast & Crew Last Season Season 5 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  45 Subject Status Replies Last Reply The Last Episode...Spoilers Open 10 by  write2topcat Series Finale, the final Romero scene SPOILERS Open 0 by write2topcat\n      \n     w Dylan: Happy Birthday Max Thieriot! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  24 Posters  25 Recommendations   2011-10-05 American Horror Story 7.0    2013-04-04 Hannibal 7.7    2013-04-19 Hemlock Grove 6.4    2013-01-21 The Following 6.2    2015-05-14 Wayward Pines 6.5    2014-06-29 The Leftovers 7.7    2016-06-03 Outcast 7.0    2013-07-11 Orange Is the New Black 7.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.aetv.com/bates-motel Genres Drama Mystery Keywords small town parent child relationship motel dysfunctional family prequel serial killer single mother based on movie Content Score 100 Yes! Looking good! Top Contributors 102 Banana 33 Travis Bell 27 Elizabeth Jennings 23 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}