{"link": "https://www.themoviedb.org/tv/5346?language=en", "title": "Here Come the Double Deckers", "resume": "Here Come the Double Deckers was a 17-part British children's TV series from 1970-71 revolving around the adventures of seven children whose den was an old red double-decker London bus in an unused works yard.", "rate": 85, "genre": ["Family", "Comedy"], "cast": ["Melvyn Hayes", "Peter Firth", "Bruce Clark", "Gillian Bailey", "Michael Audreson"], "character": ["Albert", "Cap'taine", "Solo", "Belle", "Prof"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5346   Expand Here Come the Double Deckers   (1970) User Score Overview Here Come the Double Deckers was a 17-part British children's TV series from 1970-71 revolving around the adventures of seven children whose den was an old red double-decker London bus in an unused works yard. Featured Crew Harry Booth Creator Roy Simpson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melvyn Hayes Albert Peter Firth Cap'taine Bruce Clark Solo Gillian Bailey Belle Michael Audreson Prof Full Cast & Crew Last Season Season 1 1970 | 17 Episodes Season 1 of Here Come the Double Deckers premiered on September 12, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Here Come the Double Deckers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.thedoubledeckers.com/ Genres Family Comedy Keywords england children Content Score 93 Almost there... Top Contributors 17 LaPiche 8 Banana 3 vadlefou d 3 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}