{"link": "https://www.themoviedb.org/tv/11882?language=en", "title": "I Shouldn't Be Alive", "resume": "I Shouldn't Be Alive is a documentary television series that airs on multiple networks in the United States, Canada, the U.K., the Netherlands, Australia, New Zealand, India, Iran, Pakistan, South Africa and the Philippines. I Shouldn't Be Alive is made by Darlow Smithson Productions, a UK-based production company.\nThe show features accounts of individuals and groups caught in dangerous scenarios, presented both through interviews and dramatic reenactments. The main focus is how the survivors survived and the decisions they made that kept them alive.\nThe show is currently casting on Animal Planet.com.\nIt was announced on August 4 that I Shouldn't Be Alive was canceled by Animal Planet.", "rate": 67, "genre": ["Documentary", "Drama", "Action", "Adventure"], "cast": ["Qarie Marshall"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11882   Expand I Shouldn't Be Alive   (2005) User Score  Play Trailer Overview I Shouldn't Be Alive is a documentary television series that airs on multiple networks in the United States, Canada, the U.K., the Netherlands, Australia, New Zealand, India, Iran, Pakistan, South Africa and the Philippines. I Shouldn't Be Alive is made by Darlow Smithson Productions, a UK-based production company. The show features accounts of individuals and groups caught in dangerous scenarios, presented both through interviews and dramatic reenactments. The main focus is how the survivors survived and the decisions they made that kept them alive. The show is currently casting on Animal Planet.com. It was announced on August 4 that I Shouldn't Be Alive was canceled by Animal Planet. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Qarie Marshall Full Cast & Crew Last Season Season 6 2011 | 6 Episodes Season 6 of I Shouldn't Be Alive premiered on October  7, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I Shouldn't Be Alive. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://dsc.discovery.com/fansites/alive/alive.html Genres Documentary Drama Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 2 tigru89 1 Elizabeth Jennings TB 1 TMDb Bot D 1 DoiD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}