{"link": "https://www.themoviedb.org/tv/78093?language=en", "title": "Unmasking a Killer", "resume": "Viewers go inside the investigation, the case files and the mind of The Golden State Killer – a man believed to be the most prolific uncaught rapist and serial killer in the nation. With exclusive cooperation from law enforcement and survivors, the docuseries examines the historical and social ramifications of The Golden State Killer’s reign of terror, explore the advances in forensic technology, and highlight the legal changes to our justice system that his crime spree spurred.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78093   Expand Unmasking a Killer   (2018) User Score Overview Viewers go inside the investigation, the case files and the mind of The Golden State Killer – a man believed to be the most prolific uncaught rapist and serial killer in the nation. With exclusive cooperation from law enforcement and survivors, the docuseries examines the historical and social ramifications of The Golden State Killer’s reign of terror, explore the advances in forensic technology, and highlight the legal changes to our justice system that his crime spree spurred. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 5 Episodes Season 1 of Unmasking a Killer premiered on March 18, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Unmasking a Killer. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  - Homepage  - Genres Documentary Keywords serial killer true crime rapist serial rapist Content Score 56 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}