{"link": "https://www.themoviedb.org/tv/44550?language=en", "title": "Flower Boy Ramen Shop", "resume": "Flower Boy Ramen Shop is a 2011 South Korean romantic comedy television series, starring Jung Il-woo, Lee Chung-ah and Lee Ki-woo. It was broadcast on cable channel tvN from October 31 to December 20, 2011, on Wednesdays and Thursdays at 23:00 for 16 episodes.\nThis drama is about \"pretty boys\" who, with good looks and individuality, operate a ramyun shop with a lively college girl and experience the happenings of daily life. It was the first installment of tvN's \"Oh! Boy\" series of Flower Boy programming targeted at the teenage demographic, and was followed by Shut Up Flower Boy Band in 2012 and Flower Boys Next Door in 2013.\nThe series is also known as Flower Boy Ramyun Shop and the international title Cool Guys, Hot Ramen.", "rate": 73, "genre": ["Drama", "Comedy"], "cast": ["Lee Ki-Woo", "Jung Il-woo", "Lee Chung-a", "Park Min-woo", "Jo Yoon-woo"], "character": ["Choi Kang-hyuk", "Cha Chi-soo", "Yang Eun-bi", "Kim Ba-wool", "Woo Hyun-woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44550   Expand Flower Boy Ramen Shop   (2011) User Score Overview Flower Boy Ramen Shop is a 2011 South Korean romantic comedy television series, starring Jung Il-woo, Lee Chung-ah and Lee Ki-woo. It was broadcast on cable channel tvN from October 31 to December 20, 2011, on Wednesdays and Thursdays at 23:00 for 16 episodes. This drama is about \"pretty boys\" who, with good looks and individuality, operate a ramyun shop with a lively college girl and experience the happenings of daily life. It was the first installment of tvN's \"Oh! Boy\" series of Flower Boy programming targeted at the teenage demographic, and was followed by Shut Up Flower Boy Band in 2012 and Flower Boys Next Door in 2013. The series is also known as Flower Boy Ramyun Shop and the international title Cool Guys, Hot Ramen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Ki-Woo Choi Kang-hyuk Jung Il-woo Cha Chi-soo Lee Chung-a Yang Eun-bi Park Min-woo Kim Ba-wool Jo Yoon-woo Woo Hyun-woo Full Cast & Crew Last Season Season 1 2011 | 16 Episodes Season 1 of Flower Boy Ramen Shop premiered on October 31, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Flower Boy Ramen Shop. You can help by rating TV shows you've seen. Facts Original Name  꽃미남 라면가게 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 8 Nightowl.Kr M 6 Maria180493 t 4 tmdb38202327 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}