{"link": "https://www.themoviedb.org/tv/897?language=en", "title": "The Grim Adventures of Billy and Mandy", "resume": "The exploits of the Grim Reaper, who has been forced into being the best friend of two children. A spin-off of the show Grim & Evil.", "rate": 73, "genre": ["Animation", "Comedy", "Family"], "cast": ["Greg Eagles", "Richard Steven Horvitz", "Grey DeLisle"], "character": ["Grim (voice)", "Billy (voice)", "Mandy (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 897   Expand The Grim Adventures of Billy and Mandy   (2001) User Score Overview The exploits of the Grim Reaper, who has been forced into being the best friend of two children. A spin-off of the show Grim & Evil. Featured Crew Maxwell Atoms Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Greg Eagles Grim (voice) Richard Steven Horvitz Billy (voice) Grey DeLisle Mandy (voice) Full Cast & Crew Last Season Season 7 2006 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2004-08-13 Foster's Home for Imaginary Friends 6.8    2002-12-06 Codename: Kids Next Door 6.5    1998-11-18 The Powerpuff Girls 7.0    1999-11-12 Courage the Cowardly Dog 7.6    1999-01-04 Ed, Edd n Eddy 7.0    1997-09-16 Cow and Chicken 6.4    1996-04-28 Dexter's Laboratory 7.3    2005-12-26 My Gym Partner's a Monkey 5.0  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.cartoonnetwork.com/tv_shows/billymandy/index.html Genres Animation Comedy Family Keywords grim reaper spin off kids Content Score 64 We're so close, yet so far. Top Contributors R 18 Rebecca d 15 dravincrow 13 Banana 10 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}