{"link": "https://www.themoviedb.org/tv/43750?language=en", "title": "The Mystery of Edwin Drood", "resume": "Choirmaster John Jasper is obsessed with his nephew's fiancé. Will he take his opportunity to get rid of Edwin Drood?", "rate": 51, "genre": [], "cast": ["Ian McNeice", "Matthew Rhys", "Freddie Fox", "Tamzin Merchant"], "character": ["John Jasper", "Edwin Drood", "Rosa Bud"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43750   Expand The Mystery of Edwin Drood   (2012) User Score Overview Choirmaster John Jasper is obsessed with his nephew's fiancé. Will he take his opportunity to get rid of Edwin Drood? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian McNeice Matthew Rhys John Jasper Freddie Fox Edwin Drood Tamzin Merchant Rosa Bud Full Cast & Crew Last Season Season 1 2012 | 2 Episodes Season 1 of The Mystery of Edwin Drood premiered on January 10, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2015-01-21 Wolf Hall 7.8    2011-12-27 Great Expectations 7.1    2009-08-30 Wuthering Heights 6.9    2014-09-01 Houdini 6.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b019nky7 Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors TB 13 TMDb Bot 8 Banana Z 3 Zeepnu w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}