{"link": "https://www.themoviedb.org/tv/62746?language=en", "title": "Legendary Witches", "resume": "Orphan Moon Soo-in marries Ma Do-hyun, the eldest son of the chaebol family who owns bakery corporation Shinhwa Group. But when Do-hyun dies unexpectedly, the Ma family makes Soo-in take the fall for their illegal business practices and she ends up in jail for stock manipulation that she didn't commit. At Cheongju's Penitentiary for Women, her cellmates are kind-hearted Shim Bok-nyeo who was falsely accused of killing her husband and son; tough-as-nails, foul-mouthed Son Poong-geum who was convicted of fraud; and former model Seo Mi-oh who's been charged with the attempted murder of her boyfriend, Shinhwa Group's youngest son.\nThe four women bond and become friends, particularly when they join the baking classes being taught by Nam Woo-suk, a hotel chef. Woo-suk is a widower who is raising his daughter alone after the death of his wife six years ago. At his father-in-law's suggestion, he became a volunteer at the local prison's vocational training center, where he meets Soo-in and begins to fall for her.\nUpon their discharge, the four women put the baking skills they learned in prison to use, opening up a bakery together. But they face stiff competition from the Shinhwa Group.", "rate": 95, "genre": ["Drama", "Family", "Romance"], "cast": ["Hong Ah-reum", "Do Sang-woo", "Ha Yeon-soo", "Ha Seok-jin", "Tae Hang-ho"], "character": ["Eun Bo-kyung", "Ma Do-jin", "Seo Mi-oh", "Nam Woo-suk", "Company President Kim"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62746   Expand Legendary Witches   (2014) User Score Overview Orphan Moon Soo-in marries Ma Do-hyun, the eldest son of the chaebol family who owns bakery corporation Shinhwa Group. But when Do-hyun dies unexpectedly, the Ma family makes Soo-in take the fall for their illegal business practices and she ends up in jail for stock manipulation that she didn't commit. At Cheongju's Penitentiary for Women, her cellmates are kind-hearted Shim Bok-nyeo who was falsely accused of killing her husband and son; tough-as-nails, foul-mouthed Son Poong-geum who was convicted of fraud; and former model Seo Mi-oh who's been charged with the attempted murder of her boyfriend, Shinhwa Group's youngest son. The four women bond and become friends, particularly when they join the baking classes being taught by Nam Woo-suk, a hotel chef. Woo-suk is a widower who is raising his daughter alone after the death of his wife six years ago. At his father-in-law's suggestion, he became a volunteer at the local prison's vocational training center, where he meets Soo-in and begins to fall for her. Upon their discharge, the four women put the baking skills they learned in prison to use, opening up a bakery together. But they face stiff competition from the Shinhwa Group. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hong Ah-reum Eun Bo-kyung Do Sang-woo Ma Do-jin Ha Yeon-soo Seo Mi-oh Ha Seok-jin Nam Woo-suk Tae Hang-ho Company President Kim Full Cast & Crew Last Season Season 1 2014 | 40 Episodes Season 1 of Legendary Witches premiered on October 25, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Legendary Witches. You can help by rating TV shows you've seen. Facts Original Name  전설의 마녀 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/manyo/ Genres Drama Family Romance Keywords korea Content Score 86 Almost there... Top Contributors t 38 tmdb38202327 M 13 Maria180493 3 lareina123 2 Mervan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}