{"link": "https://www.themoviedb.org/tv/5119?language=en", "title": "Roobarb", "resume": "Roobarb is a British animated children's television programme, originally shown on BBC1 just before the evening news. Each cartoon, written by Grange Calveley and animated by Bob Godfrey, was about five minutes long. Thirty episodes were made, and the show was first shown on 21 October 1974. The theme is that of the friendly rivalry between Roobarb the green dog and Custard the pink cat from next door.\nThe narration of the series was provided by the actor Richard Briers. On 18 February 2013, Briers died, followed four days later by animator Godfrey.", "rate": 100, "genre": ["Animation"], "cast": ["Richard Briers"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5119   Expand Roobarb   (1974) User Score Overview Roobarb is a British animated children's television programme, originally shown on BBC1 just before the evening news. Each cartoon, written by Grange Calveley and animated by Bob Godfrey, was about five minutes long. Thirty episodes were made, and the show was first shown on 21 October 1974. The theme is that of the friendly rivalry between Roobarb the green dog and Custard the pink cat from next door. The narration of the series was provided by the actor Richard Briers. On 18 February 2013, Briers died, followed four days later by animator Godfrey. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Briers Full Cast & Crew Last Season Season 1 1974 | 30 Episodes Season 1 of Roobarb premiered on October 21, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Roobarb. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 xyzl 1 MaxdMerc  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}