{"link": "https://www.themoviedb.org/tv/49129?language=en", "title": "The Fugitive of Joseon", "resume": "Set during the reign of King Injong, the protagonist is a royal physician desperate to cure his ailing daughter. He becomes a fugitive when he gets entangled in an assassination plot to poison the crown prince, and fights to save both his daughter's life and his own.", "rate": 0, "genre": ["Drama", "History", "Mystery", "Romance", "Thriller"], "cast": ["Lee Dong-wook", "Kim Yoo-bin", "Song Ji-hyo", "Im Seul-ong", "Song Jong-ho"], "character": ["Choi Won", "Choi Rang", "Hong Da-in", "Crown Prince Lee Ho", "Lee Jung-hwan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49129   Expand The Fugitive of Joseon   (2013) User Score  Play Trailer Overview Set during the reign of King Injong, the protagonist is a royal physician desperate to cure his ailing daughter. He becomes a fugitive when he gets entangled in an assassination plot to poison the crown prince, and fights to save both his daughter's life and his own. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Dong-wook Choi Won Kim Yoo-bin Choi Rang Song Ji-hyo Hong Da-in Im Seul-ong Crown Prince Lee Ho Song Jong-ho Lee Jung-hwan Full Cast & Crew Last Season Season 1 2013 | 20 Episodes Season 1 of The Fugitive of Joseon premiered on April 24, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Fugitive of Joseon. You can help by rating TV shows you've seen. Facts Original Name  천명 : 조선판 도망자 이야기 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/fugitive/ Genres Drama History Mystery Romance Thriller Keywords korea Content Score 93 Almost there... Top Contributors t 50 tmdb38202327 TB 2 TMDb Bot M 2 Maria180493 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}