{"link": "https://www.themoviedb.org/tv/42903?language=en", "title": "The Girl Who Leapt Through Space", "resume": "The Girl Who Leapt Through Space, is a Japanese anime television series, created and produced by Sunrise. Based on the original concept by the Sunrise animation staff, the series is directed by Masakazu Obara and written by Jukki Hanada, overseeing a team of animators noted for their previous work on My-HiME and My-Otome.\nThe anime began airing in Japan on the TV Tokyo television network on January 6, 2009. The series is set in the far future where humans now live in space colonies orbiting far from Earth. A manga adaptation, Sora Kake Girl R, began serialization in the March 2009 issue of Ichijinsha's Comic Rex, and another manga, Sora Kake Girl D, began serialization in the April 2009 issue of ASCII Media Works' Dengeki Daioh. A light novel adaptation began serialization in Ichijinsha's Chara Mel in December 2008, and an Internet radio show has also been created.", "rate": 0, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Mako Sakurai", "Aya Endo", "Yui Makino", "Ai Nonaka", "Jun Fukuyama"], "character": ["Akiha Shishido", "Itsuki Kannagi", "Honoka Kawai", "Imoko Shishido", "Leopard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42903   Expand The Girl Who Leapt Through Space   (2009) User Score Overview The Girl Who Leapt Through Space, is a Japanese anime television series, created and produced by Sunrise. Based on the original concept by the Sunrise animation staff, the series is directed by Masakazu Obara and written by Jukki Hanada, overseeing a team of animators noted for their previous work on My-HiME and My-Otome. The anime began airing in Japan on the TV Tokyo television network on January 6, 2009. The series is set in the far future where humans now live in space colonies orbiting far from Earth. A manga adaptation, Sora Kake Girl R, began serialization in the March 2009 issue of Ichijinsha's Comic Rex, and another manga, Sora Kake Girl D, began serialization in the April 2009 issue of ASCII Media Works' Dengeki Daioh. A light novel adaptation began serialization in Ichijinsha's Chara Mel in December 2008, and an Internet radio show has also been created. Featured Crew Hajime Yatate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mako Sakurai Akiha Shishido Aya Endo Itsuki Kannagi Yui Makino Honoka Kawai Ai Nonaka Imoko Shishido Jun Fukuyama Leopard Full Cast & Crew Last Season Season 1 2009 | 25 Episodes Season 1 of The Girl Who Leapt Through Space premiered on January  5, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  15 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Girl Who Leapt Through Space. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.sorakake.net/ Genres Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 8 TheDerpMan n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}