{"link": "https://www.themoviedb.org/tv/7482?language=en", "title": "Leverage", "resume": "Leverage follows a five-person team: a thief, a grifter, a hacker, and a retrieval specialist, led by former insurance investigator Nathan Ford, who use their skills to fight corporate and governmental injustices inflicted on ordinary citizens.", "rate": 73, "genre": ["Drama", "Comedy", "Action", "Adventure"], "cast": ["Gina Bellman", "Timothy Hutton", "Christian Kane", "Goran Visnjic", "Beth Riesgraf"], "character": ["Sophie Devereaux", "Nathan Ford", "Eliot Spencer", "Damien Moreau", "Parker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7482   Expand Leverage   (2008) User Score  Play Trailer Overview Leverage follows a five-person team: a thief, a grifter, a hacker, and a retrieval specialist, led by former insurance investigator Nathan Ford, who use their skills to fight corporate and governmental injustices inflicted on ordinary citizens. Featured Crew John Rogers Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  19 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gina Bellman Sophie Devereaux Timothy Hutton Nathan Ford Christian Kane Eliot Spencer Goran Visnjic Damien Moreau Beth Riesgraf Parker Full Cast & Crew Last Season Season 5 2012 | 15 Episodes Season 5 of Leverage premiered on July 15, 2012. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Rating Open 0 by There-Can-Be-Only-One\n      \n     w Eliot: Happy Birthday Christian Kane! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  12 Recommendations   2007-06-28 Burn Notice 7.3    2006-03-05 Numb3rs 6.5    2009-10-23 White Collar 7.7    2009-07-07 Warehouse 13 7.2    2014-01-07 Intelligence 6.3    2009-01-21 Lie to Me 7.4    2010-01-17 Human Target 7.1    2007-09-24 Chuck 7.7  Facts Status  Ended Network Certification N-7 Meaning Intended for viewers from 7 years old. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.electric-entertainment.com/index.php Genres Drama Comedy Action & Adventure Keywords hacker thief muscleman criminal grifter Content Score 100 Yes! Looking good! Top Contributors 17 Travis Bell C 13 Cataloguer 8 Julien Lefebvre 8 GhostKU  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}