{"link": "https://www.themoviedb.org/tv/16374?language=en", "title": "Kojak", "resume": "Kojak is an American television series starring Ving Rhames, airing on the USA Network cable channel, and on ITV4 in the United Kingdom. It was a reimagined version of the 1973-1978 series starring Telly Savalas.\nRhames portrays Lieutenant Theo Kojak of the New York City Police Department, a skilled plain clothes detective with a shaved head and an affinity for jazz, fine clothing, and lollipops. As with the original series, he is fond of the catchphrase \"Who loves ya, baby?\" The series lasted for one season.", "rate": 0, "genre": ["Drama"], "cast": ["Roselyn Sánchez", "Ving Rhames", "Chazz Palminteri"], "character": ["Carmen Warrick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16374   Expand Kojak   (2005) User Score Overview Kojak is an American television series starring Ving Rhames, airing on the USA Network cable channel, and on ITV4 in the United Kingdom. It was a reimagined version of the 1973-1978 series starring Telly Savalas. Rhames portrays Lieutenant Theo Kojak of the New York City Police Department, a skilled plain clothes detective with a shaved head and an affinity for jazz, fine clothing, and lollipops. As with the original series, he is fond of the catchphrase \"Who loves ya, baby?\" The series lasted for one season. Featured Crew Abby Mann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roselyn Sánchez Carmen Warrick Ving Rhames Chazz Palminteri Full Cast & Crew Last Season Season 1 2005 | 10 Episodes Season 1 of Kojak premiered on March 25, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kojak. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords police detective nypd Content Score 64 We're so close, yet so far. Top Contributors 5 Banana s 3 speedycars 1 t0by 1 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}