{"link": "https://www.themoviedb.org/tv/3297?language=en", "title": "Wilfred", "resume": "Wilfred is an Australian comedy television series directed by Tony Rogers, produced by Jenny Livingston and starring Jason Gann, Adam Zwar and Cindy Waddingham. Created by Zwar, Gann and Rogers, it was based on their award-winning 2002 short film and later adapted to a series. The story follows the lives of the eponymous dog Wilfred, his owner Sarah, and her boyfriend Adam, who sees Wilfred as a man in a dog suit.\nTwo seasons were broadcast on SBS One – the first in 2007 and the second in 2010. The series won three AFI Awards and was nominated for a Logie.\nIndependent Film Channel acquired the international broadcast rights to the original two seasons of Wilfred in 2010. A U.S. version premiered on the cable channel FX on 23 June 2011.", "rate": 71, "genre": ["Comedy"], "cast": ["Jason Gann", "Adam Zwar", "Cindy Waddingham"], "character": ["Wilfred", "Adam Douglas", "Sarah Mitchell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3297   Expand Wilfred   (2007) User Score Overview Wilfred is an Australian comedy television series directed by Tony Rogers, produced by Jenny Livingston and starring Jason Gann, Adam Zwar and Cindy Waddingham. Created by Zwar, Gann and Rogers, it was based on their award-winning 2002 short film and later adapted to a series. The story follows the lives of the eponymous dog Wilfred, his owner Sarah, and her boyfriend Adam, who sees Wilfred as a man in a dog suit. Two seasons were broadcast on SBS One – the first in 2007 and the second in 2010. The series won three AFI Awards and was nominated for a Logie. Independent Film Channel acquired the international broadcast rights to the original two seasons of Wilfred in 2010. A U.S. version premiered on the cable channel FX on 23 June 2011. Featured Crew Adam Zwar Creator Jason Gann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Gann Wilfred Adam Zwar Adam Douglas Cindy Waddingham Sarah Mitchell Full Cast & Crew Last Season Season 2 2010 | 8 Episodes Season 2 of Wilfred premiered on March  8, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2011-02-09 Mr. Sunshine 6.4    2000-05-31 Clerks: The Animated Series 7.0    2008-12-08 Childrens Hospital 7.0    2009-09-20 Bored to Death 7.4    2011-06-23 Wilfred 7.0    2010-02-19 The Ricky Gervais Show 7.9    2009-02-15 Eastbound & Down 7.4    1997-09-20 The New Batman Adventures 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage   http://www.sbs.com.au/shows/wilfred Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 12 janar w 3 webmaster e 3 error666 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}