{"link": "https://www.themoviedb.org/tv/42553?language=en", "title": "Alice in Wonderland", "resume": "Alice in Wonderland is a two-part film adaptation of Lewis Carroll's Alice books. An Irwin Allen production, it was a special made for television and used a huge all-star cast of notable actors and actresses. The title role was played by 9-year-old Natalie Gregory, who wore a blonde wig for this miniseries. Alice in Wonderland was first telecast December 9, 1985, and December 10, 1985, at 8:00pm EST on CBS. It was filmed in Los Angeles at the MGM Studios in Culver City over a 55-day period from March 12, 1985 to May 28 of that same year. Additional filming took place at Malibu beach for oyster scene, and establishing shots of Alice's house took place at the S. S. Hinds Estate, also in the Los Angeles area.", "rate": 90, "genre": ["Action", "Adventure", "Family", "Sci-Fi", "Fantasy"], "cast": ["Steve Lawrence", "Patrick Duffy", "Martha Raye", "Jayne Meadows", "Anthony Newley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42553   Expand Alice in Wonderland   (1985) User Score Overview Alice in Wonderland is a two-part film adaptation of Lewis Carroll's Alice books. An Irwin Allen production, it was a special made for television and used a huge all-star cast of notable actors and actresses. The title role was played by 9-year-old Natalie Gregory, who wore a blonde wig for this miniseries. Alice in Wonderland was first telecast December 9, 1985, and December 10, 1985, at 8:00pm EST on CBS. It was filmed in Los Angeles at the MGM Studios in Culver City over a 55-day period from March 12, 1985 to May 28 of that same year. Additional filming took place at Malibu beach for oyster scene, and establishing shots of Alice's house took place at the S. S. Hinds Estate, also in the Los Angeles area. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Lawrence Patrick Duffy Martha Raye Jayne Meadows Anthony Newley Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Alice in Wonderland. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  240m Homepage  - Genres Action & Adventure Family Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors CM 11 Cherche Moi j 4 jmoney6979 3 Zlogorek w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}