{"link": "https://www.themoviedb.org/tv/60066?language=en", "title": "The Assets", "resume": "1985 serves as the backdrop to the final showdown of the Cold War when Sandy and her partner Jeanne Vertefeuille vowed to find the mole that would turn out to be the most notorious traitor in US History, Aldrich Ames. Sandy is in a race against time to save the Soviet intelligence officers from being caught and killed. Living her own double life at home, this beautiful wife and mother vowed to stop at nothing until she uncovered the truth.", "rate": 72, "genre": ["Drama"], "cast": ["Paul Rhys", "Jodie Whittaker", "Harriet Walter", "Stuart Milligan", "Christina Cole"], "character": ["Aldrich Ames", "Sandy Grimes", "Jeanne Vertefeuille", "Arthur O'Neill", "Louisa Tilton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60066   Expand The Assets   (2014) User Score  Play Trailer Overview 1985 serves as the backdrop to the final showdown of the Cold War when Sandy and her partner Jeanne Vertefeuille vowed to find the mole that would turn out to be the most notorious traitor in US History, Aldrich Ames. Sandy is in a race against time to save the Soviet intelligence officers from being caught and killed. Living her own double life at home, this beautiful wife and mother vowed to stop at nothing until she uncovered the truth. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Rhys Aldrich Ames Jodie Whittaker Sandy Grimes Harriet Walter Jeanne Vertefeuille Stuart Milligan Arthur O'Neill Christina Cole Louisa Tilton Full Cast & Crew Last Season Season 1 2014 | 8 Episodes Season 1 of The Assets premiered on January  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2014-01-14 Friday Night Tykes 6.8    2006-03-13 Canada's Worst Handyman 5.0    2017-11-17 Shot in the Dark 7.4    2012-09-04 Highway Thru Hell 7.0    2015-09-22 Sea of Plastic 6.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   http://abc.go.com/shows/the-assets Genres Drama Keywords cia spy cold war soviet union miniseries 1980s Content Score 93 Almost there... Top Contributors 29 Elizabeth Jennings 8 Banana CM 4 Cherche Moi TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}