{"link": "https://www.themoviedb.org/tv/65791?language=en", "title": "My Little Baby", "resume": "Cha Jung Han is a detective for a special investigation team. He is busy with investigating violent cases including drugs and gangs, but one day he takes in his niece, Eun Ae and struggles to raise her. Meanwhile, Han Ye Seul is a single mother who raises her 5-years-old son alone. She is Cha Jung-Han’s first love.", "rate": 48, "genre": ["Comedy"], "cast": ["Oh Ji-ho", "Kim Min-jae", "Son Ji-Hyun", "Lee Soo-kyung", "Jung Soo-Young"], "character": ["Cha Jung-Han", "Yoon Min", "Han So-Yoon", "Han Ye-Seul", "Jo Ji-Young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65791   Expand My Little Baby   (2016) User Score Overview Cha Jung Han is a detective for a special investigation team. He is busy with investigating violent cases including drugs and gangs, but one day he takes in his niece, Eun Ae and struggles to raise her. Meanwhile, Han Ye Seul is a single mother who raises her 5-years-old son alone. She is Cha Jung-Han’s first love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oh Ji-ho Cha Jung-Han Kim Min-jae Yoon Min Son Ji-Hyun Han So-Yoon Lee Soo-kyung Han Ye-Seul Jung Soo-Young Jo Ji-Young Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of My Little Baby premiered on March  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2015-07-22 Diamond Lover 6.9    2016-03-06 Refresh Man 7.0  Facts Original Name  마이 리틀 베이비 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/malibe/ Genres Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 32 Maria180493 z 10 zurman1 3 lareina123 MP 2 Mr. Peanutbutter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}