{"link": "https://www.themoviedb.org/tv/62602?language=en", "title": "Blue Spring Ride", "resume": "At the end of her first year of high school, Futaba Yoshioka suddenly has a chance encounter with her first love, Tanaka Kou. Three years ago, he transferred schools before she was able to say how she felt about him. After meeting each other again, Futaba realizes that he has gone through many changes. He acts more cool and even had his last name changed to Mabuchi. Gradually the two rekindle their love while piecing together what had happened in the time that they were apart.", "rate": 88, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Maaya Uchida", "Yuuki Kaji", "Kayano Ai", "Kenn", "Mikako Komatsu"], "character": ["Futaba Yoshioka (voice)", "Kou Mabuchi (voice)", "Yuri Makita (voice)", "Aya Kominato (voice)", "Shuko Murao (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62602   Expand Blue Spring Ride   (2014) User Score Overview At the end of her first year of high school, Futaba Yoshioka suddenly has a chance encounter with her first love, Tanaka Kou. Three years ago, he transferred schools before she was able to say how she felt about him. After meeting each other again, Futaba realizes that he has gone through many changes. He acts more cool and even had his last name changed to Mabuchi. Gradually the two rekindle their love while piecing together what had happened in the time that they were apart. Featured Crew Io Sakisaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maaya Uchida Futaba Yoshioka (voice) Yuuki Kaji Kou Mabuchi (voice) Kayano Ai Yuri Makita (voice) Kenn Aya Kominato (voice) Mikako Komatsu Shuko Murao (voice) Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Blue Spring Ride premiered on July  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2012-10-04 BTOOOM! 6.3    2013-07-08 Blood Lad 6.8    2015-07-05 Charlotte 6.8    2014-07-06 Akame ga Kill! 7.0    2012-01-10 Another 7.2    2016-01-08 ERASED 7.8  Facts Original Name  アオハライド Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.aoha-anime.com/ Genres Animation Comedy Drama Keywords high school romance slice of life anime watercolour style Content Score 100 Yes! Looking good! Top Contributors 64 Marr 🇳🇱 J 38 Jason B 9 Bonsai 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}