{"link": "https://www.themoviedb.org/tv/28574?language=en", "title": "Kidnapped", "resume": "David McCallum stars as the rebellious Alan Breck Stewart, and this ambitious serial (a co-production between HTV and Germany's Tele-Munchen) also features a host of British character actors, including Bill Simpson, Patrick Allen, Andrew Keir, Patrick Magee and Frank Windsor.\nWhen young David Balfour arrives at his uncle's bleak Scottish house to claim his inheritance, his relative tries to murder him then has him shipped off to be sold as a slave in the colonies. Luckily for the lad, he strikes up a friendship with Alan Breck Stewart, who is on the run after Bonnie Prince Charlie's defeat at Culloden. When a ship's captain tries to kill Breck for his money, the two manage to get to land and set out for Edinburgh, dodging the ruthless Redcoats along the way.", "rate": 50, "genre": ["Drama"], "cast": ["David McCallum", "Ekkehardt Belle", "Aude Landry", "Bill Simpson", "Patrick Allen"], "character": ["Alan Breck Stewart", "David Balfour", "Catriona", "James of the Glens", "Prestongrange"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28574   Expand Kidnapped   (1978) User Score Overview David McCallum stars as the rebellious Alan Breck Stewart, and this ambitious serial (a co-production between HTV and Germany's Tele-Munchen) also features a host of British character actors, including Bill Simpson, Patrick Allen, Andrew Keir, Patrick Magee and Frank Windsor. When young David Balfour arrives at his uncle's bleak Scottish house to claim his inheritance, his relative tries to murder him then has him shipped off to be sold as a slave in the colonies. Luckily for the lad, he strikes up a friendship with Alan Breck Stewart, who is on the run after Bonnie Prince Charlie's defeat at Culloden. When a ship's captain tries to kill Breck for his money, the two manage to get to land and set out for Edinburgh, dodging the ruthless Redcoats along the way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David McCallum Alan Breck Stewart Ekkehardt Belle David Balfour Aude Landry Catriona Bill Simpson James of the Glens Patrick Allen Prestongrange Full Cast & Crew Last Season Mini-Series 1978 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Kidnapped. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kidnapped. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Miniseries Original Language  English Runtime  30m Homepage  - Genres Drama Keywords ship scotland adventure romance history money murder inheritance miniseries slave adaptation Content Score 71 Just a little bit more... Top Contributors 39 SWFT TB 12 TMDb Bot 3 Elizabeth Jennings a 3 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}