{"link": "https://www.themoviedb.org/tv/78808?language=en", "title": "Angels in White", "resume": "Rumi Kizaki enrols in a nursing program because she failed to enter a university. However, she does not want to become a nurse because she believes that she will not make a good nurse. While Rumi ponders over what to do, she continues her training in nursing. Along the way, Rumi meets new people and discovers new things about herself.", "rate": 80, "genre": ["Drama"], "cast": ["Yua Shinkawa", "Sairi Itoh", "Miki Sakai", "Honami Sato", "Toshiki Seto"], "character": ["Rumi Kizaki", "Chinatsu Yamada", "Noriko Saeki", "Fujika Tono", "Shunya Hino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78808   Expand Angels in White   (2018) User Score Overview Rumi Kizaki enrols in a nursing program because she failed to enter a university. However, she does not want to become a nurse because she believes that she will not make a good nurse. While Rumi ponders over what to do, she continues her training in nursing. Along the way, Rumi meets new people and discovers new things about herself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yua Shinkawa Rumi Kizaki Sairi Itoh Chinatsu Yamada Miki Sakai Noriko Saeki Honami Sato Fujika Tono Toshiki Seto Shunya Hino Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Angels in White premiered on April  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Angels in White. You can help by rating TV shows you've seen. Facts Original Name  いつまでも白い羽根 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://tokai-tv.com/shiroihane/ Genres Drama Keywords medical drama Content Score 86 Almost there... Top Contributors M 39 Maria180493 TB 2 TMDb Bot A 1 Arius11  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}