{"link": "https://www.themoviedb.org/tv/31938?language=en", "title": "Jungle Jim", "resume": "Jungle Jim is a 26-episode syndicated adventure television series which aired from 1955 till 1956, starring Johnny Weismuller, as Jim \"Jungle Jim\" Bradley, a hunter, guide, and explorer in, primarily, Africa. The program should not be confused with Ramar of the Jungle, but is based on the Jungle Jim comic strip created by Alex Raymond and Don Moore. Starring with Weismuller were Martin Huston as Jungle Jim's teenage son, Skipper; Dean Fredericks as Haseem, the Hindu manservant, and Neal, a chimpanzee from the World Jungle Compound, as Tamba. Paul Cavanagh played Commissioner Morrison in nine episodes.\nProduced by Harold Greene, the series was filmed by Screen Gems, a subsidiary of Columbia Pictures. The program aired in 158 American media markets and in thirty-eight other nations.Earl Bellamy directed the first four episodes of the new series. The series capitalized on the popularity of Weismuller, who had just completed his last film of Tarzan, the jungle character created by Edgar Rice Burroughs. Jungle Jim was a low-budget offering that relied heavily on stock footage and was not renewed beyond its original episodes.", "rate": 0, "genre": [], "cast": ["Johnny Weissmuller", "Martin Huston"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31938   Expand Jungle Jim   (1955) User Score Overview Jungle Jim is a 26-episode syndicated adventure television series which aired from 1955 till 1956, starring Johnny Weismuller, as Jim \"Jungle Jim\" Bradley, a hunter, guide, and explorer in, primarily, Africa. The program should not be confused with Ramar of the Jungle, but is based on the Jungle Jim comic strip created by Alex Raymond and Don Moore. Starring with Weismuller were Martin Huston as Jungle Jim's teenage son, Skipper; Dean Fredericks as Haseem, the Hindu manservant, and Neal, a chimpanzee from the World Jungle Compound, as Tamba. Paul Cavanagh played Commissioner Morrison in nine episodes. Produced by Harold Greene, the series was filmed by Screen Gems, a subsidiary of Columbia Pictures. The program aired in 158 American media markets and in thirty-eight other nations.Earl Bellamy directed the first four episodes of the new series. The series capitalized on the popularity of Weismuller, who had just completed his last film of Tarzan, the jungle character created by Edgar Rice Burroughs. Jungle Jim was a low-budget offering that relied heavily on stock footage and was not renewed beyond its original episodes. Featured Crew Alex Raymond Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Johnny Weissmuller Martin Huston Full Cast & Crew Last Season Season 1 1955 | 26 Episodes Season 1 of Jungle Jim premiered on September 26, 1955. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jungle Jim. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 3 jack denis 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}