{"link": "https://www.themoviedb.org/tv/39501?language=en", "title": "Sidekick", "resume": "Most kids dream of being superheroes. Not Eric Needles. Eric dreams of being a sidekick. So you can imagine his elation when his favorite superhero, Maxum Man, selects Eric to be his sidekick. But things take a weird turn when, on the day that Eric is scheduled to start being a full-time sidekick, Maxum Man vanishes. The superhero's disappearance leaves Eric responsible to convince the world that Maxum Man is still on the job, doing what a superhero does. Eric's peers include Kitty Ko, a boy-crazy heroine who serves up stellar advice.", "rate": 0, "genre": ["Action", "Adventure", "Animation", "Comedy", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39501   Expand Sidekick   (2010) User Score Overview Most kids dream of being superheroes. Not Eric Needles. Eric dreams of being a sidekick. So you can imagine his elation when his favorite superhero, Maxum Man, selects Eric to be his sidekick. But things take a weird turn when, on the day that Eric is scheduled to start being a full-time sidekick, Maxum Man vanishes. The superhero's disappearance leaves Eric responsible to convince the world that Maxum Man is still on the job, doing what a superhero does. Eric's peers include Kitty Ko, a boy-crazy heroine who serves up stellar advice. Featured Crew Butch Hartman Creator Chris Savino Creator Jeff Kline Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Next Season Season 4 2018 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sidekick. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  - Homepage   http://www.sidekick.ytv.com Genres Action & Adventure Animation Comedy Kids Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors c 10 christinavo98 c 6 christinavo87 w 2 whitetigerx8  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}