{"link": "https://www.themoviedb.org/tv/4504?language=en", "title": "Shortland Street", "resume": "Shortland Street is a New Zealand prime-time soap opera centering around the fictitious Shortland Street Hospital, first broadcast on Television New Zealand's TV2 on 25 May 1992. It is the country's longest-running drama and soap opera, being broadcast continuously for over 5000 episodes and 20 years, and is one of the most watched television programs in New Zealand.\nThe show was originally screened as five half-hour episodes each week and initially receiving mixed reviews on its premiere. After its launch it dropped in ratings and would have been cancelled if TVNZ had not ordered a year's worth of episodes in advance. By early 1993, the show's rating picked up and TVNZ renewed the production. Today, it is one of New Zealand's highest-rated shows, frequently making AGB Nielsen Media Research's top 5 programmes of the week.", "rate": 50, "genre": ["Soap"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4504   Expand Shortland Street   (1992) User Score Overview Shortland Street is a New Zealand prime-time soap opera centering around the fictitious Shortland Street Hospital, first broadcast on Television New Zealand's TV2 on 25 May 1992. It is the country's longest-running drama and soap opera, being broadcast continuously for over 5000 episodes and 20 years, and is one of the most watched television programs in New Zealand. The show was originally screened as five half-hour episodes each week and initially receiving mixed reviews on its premiere. After its launch it dropped in ratings and would have been cancelled if TVNZ had not ordered a year's worth of episodes in advance. By early 1993, the show's rating picked up and TVNZ renewed the production. Today, it is one of New Zealand's highest-rated shows, frequently making AGB Nielsen Media Research's top 5 programmes of the week. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 25 2016 | 8 Episodes Season 25 of Shortland Street premiered on January 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shortland Street. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.tvnz.co.nz/shortland-street Genres Soap Keywords new zealand hospital soap opera medical drama Content Score 56 We're so close, yet so far. Top Contributors 26 janar 7 Damien Haynes 6 Elizabeth Jennings 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}