{"link": "https://www.themoviedb.org/tv/578?language=en", "title": "Numb3rs", "resume": "Inspired by actual cases and experiences, Numb3rs depicts the confluence of police work and mathematics in solving crime as an FBI agent recruits his mathematical genius brother to help solve a wide range of challenging crimes in Los Angeles from a very different perspective.", "rate": 67, "genre": ["Crime", "Drama", "Mystery"], "cast": ["David Krumholtz", "Rob Morrow", "Peter MacNicol", "Judd Hirsch", "Navi Rawat"], "character": ["Charlie Eppes", "Don Eppes", "Larry Fleinhardt", "Alan Eppes", "Amita Ramanujan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 578   Expand Numb3rs   (2006) User Score  Play Trailer Overview Inspired by actual cases and experiences, Numb3rs depicts the confluence of police work and mathematics in solving crime as an FBI agent recruits his mathematical genius brother to help solve a wide range of challenging crimes in Los Angeles from a very different perspective. Featured Crew Nicolas Falacci Creator Cheryl Heuton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Krumholtz Charlie Eppes Rob Morrow Don Eppes Peter MacNicol Larry Fleinhardt Judd Hirsch Alan Eppes Navi Rawat Amita Ramanujan Full Cast & Crew Last Season Season 6 2011 | 16 Episodes Season 6 of Numb3rs premiered on June  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  7 Recommendations   2009-01-21 Lie to Me 7.4    2005-09-23 Ghost Whisperer 5.6    2002-09-23 CSI: Miami 5.8    2007-06-28 Burn Notice 7.3    2008-09-23 The Mentalist 7.3    2008-12-07 Leverage 7.2    2009-10-23 White Collar 7.7    2003-09-28 Cold Case 7.0  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  43m, 60m Homepage  - Genres Crime Drama Mystery Keywords fbi mathematician genius los angeles crime investigation Content Score 100 Yes! Looking good! Top Contributors 35 stickell 14 Banana 11 Travis Bell BB 11 Balázs Bárdosi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}