{"link": "https://www.themoviedb.org/tv/33001?language=en", "title": "Haven", "resume": "FBI agent Audrey Parker arrives in the small town of Haven, Maine to solve a murder and soon discovers the town's many secrets—which also hold the key to unlocking the mysteries of her lost past.", "rate": 71, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Emily Rose", "Lucas Bryant", "Eric Balfour", "Jayne Eastwood", "Laura Mennell"], "character": ["Audrey Parker", "Nathan Wournos", "Duke Crocker", "Gloria Verrano", "Charlotte Cross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33001   Expand Haven   (2010) User Score Overview FBI agent Audrey Parker arrives in the small town of Haven, Maine to solve a murder and soon discovers the town's many secrets—which also hold the key to unlocking the mysteries of her lost past. Featured Crew Jim Dunn Creator Sam Ernst Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  48 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emily Rose Audrey Parker Lucas Bryant Nathan Wournos Eric Balfour Duke Crocker Jayne Eastwood Gloria Verrano Laura Mennell Charlotte Cross Full Cast & Crew Last Season Season 5 2014 | 26 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Great Quirky Show Open 4 by  write2topcat Last Goodbyes Open 0 by write2topcat\n      \n     One Great Thing Open 0 by write2topcat\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  48 Posters  12 Recommendations   2009-07-07 Warehouse 13 7.2    2011-07-11 Alphas 6.5    2012-05-27 Continuum 7.1    2010-09-12 Lost Girl 6.7    2006-07-18 Eureka 7.4    2013-10-09 The Tomorrow People 6.6    2013-09-16 Sleepy Hollow 6.4    2008-10-03 Sanctuary 6.8  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  45m, 42m Homepage   http://www.syfy.com/haven/ Genres Drama Sci-Fi & Fantasy Keywords small town based on novel or book police fbi supernatural paranormal maine female protagonist new england mysterious woman idiopathic neuropathy Content Score 93 Almost there... Top Contributors 78 Banana J 45 Jenn 35 Elizabeth Jennings 20 CouchTater  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}