{"link": "https://www.themoviedb.org/tv/40484?language=en", "title": "The Fierce Wife", "resume": "The Fierce Wife, or The Shrewd Wife in Singapore, is a 2010 Taiwanese drama starring Sonia Sui, Wen Sheng Hao, Chris Wang and Amanda Zhu. It was a TTV and Sanlih E-Television co-presentation, and was directed by Xu Fu Jun. The filming started in October 2010, and was first broadcast on 5 November 2010. It’s been on the air ever since.\nBefore The Fierce Wife was produced, both Sonia Sui and Wen Sheng Hao had acted in two TTV productions, The Year of Happiness and Love and PS Man. The Fierce Wife, The Year of Happiness and Love, and PS Man all feature youth idol.\nOn 9 June 2011, The Fierce Wife, described as “the most talked about TV show in Taiwan,” entered the Japanese market, renamed Does Marriage Guarantee Happiness. It was broadcast on BS Nittele in Chinese with Japanese subtitles, every Thursday at 2300 in high definition, six times as high as in Taiwan. The whole TV series was divided into 34 episodes in Japan, and the DVDs in both Chinese and Japanese went on sale on 20 June 2012.\nThe TV series was a big hit in 2011. “Xiaosan” or “Little Third”, “the other woman” in the story, has become a popular euphemism thanks to the show. Also, merchandise has sold well in Taiwan and abroad. The popular drama was nominated for a number of Golden Bell Awards. Some controversial parts of the story received heated discussion, and the producer Wang Pei Hua decided to make it into a feature movie set four years after the main female character Xie An Zhen get divorced. A press conference to announce the film adaptation The Fierce Wife: The Final Episode, was held on 20 January 2012. The film was released on 17 August 2012.", "rate": 70, "genre": ["Drama"], "cast": ["Sonia Sui", "James Wen", "Chris Wang", "Amanda Zhu"], "character": ["Xie An Zhen", "Wen Rui Fan", "Lan Tian Wei", "Li Wei En"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40484   Expand The Fierce Wife   (2010) User Score Overview The Fierce Wife, or The Shrewd Wife in Singapore, is a 2010 Taiwanese drama starring Sonia Sui, Wen Sheng Hao, Chris Wang and Amanda Zhu. It was a TTV and Sanlih E-Television co-presentation, and was directed by Xu Fu Jun. The filming started in October 2010, and was first broadcast on 5 November 2010. It’s been on the air ever since. Before The Fierce Wife was produced, both Sonia Sui and Wen Sheng Hao had acted in two TTV productions, The Year of Happiness and Love and PS Man. The Fierce Wife, The Year of Happiness and Love, and PS Man all feature youth idol. On 9 June 2011, The Fierce Wife, described as “the most talked about TV show in Taiwan,” entered the Japanese market, renamed Does Marriage Guarantee Happiness. It was broadcast on BS Nittele in Chinese with Japanese subtitles, every Thursday at 2300 in high definition, six times as high as in Taiwan. The whole TV series was divided into 34 episodes in Japan, and the DVDs in both Chinese and Japanese went on sale on 20 June 2012. The TV series was a big hit in 2011. “Xiaosan” or “Little Third”, “the other woman” in the story, has become a popular euphemism thanks to the show. Also, merchandise has sold well in Taiwan and abroad. The popular drama was nominated for a number of Golden Bell Awards. Some controversial parts of the story received heated discussion, and the producer Wang Pei Hua decided to make it into a feature movie set four years after the main female character Xie An Zhen get divorced. A press conference to announce the film adaptation The Fierce Wife: The Final Episode, was held on 20 January 2012. The film was released on 17 August 2012. Featured Crew Wang Pei Hua Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sonia Sui Xie An Zhen James Wen Wen Rui Fan Chris Wang Lan Tian Wei Amanda Zhu Li Wei En Full Cast & Crew Last Season Season 1 2010 | 23 Episodes Season 1 of The Fierce Wife premiered on November  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Fierce Wife. You can help by rating TV shows you've seen. Facts Status  Ended Network TTV Main Channel Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://fwife.tv/ Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 3 lareina123 2 Wendy 1 MaFt  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}