{"link": "https://www.themoviedb.org/tv/32114?language=en", "title": "Big & Small", "resume": "Big & Small is a British children's television series aimed at preschoolers. Big & Small is a co-production between Kindle Entertainment and 3J's Productions produced in association with the BBC, Treehouse TV, and Studio 100. The first series was deemed a success worldwide and a second series was commissioned by the BBC. The show is a live action comedy for preschoolers, and follows the lives of puppets. Big & Small Online, a section of CBeebies Online, won a Children's BAFTA in 2009 for the best interactive content.", "rate": 0, "genre": ["Comedy"], "cast": ["Imelda Staunton", "Lenny Henry", "Shaun Fleming", "Billie Joe Armstrong", "Cree Summer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32114   Expand Big & Small   (2008) User Score Overview Big & Small is a British children's television series aimed at preschoolers. Big & Small is a co-production between Kindle Entertainment and 3J's Productions produced in association with the BBC, Treehouse TV, and Studio 100. The first series was deemed a success worldwide and a second series was commissioned by the BBC. The show is a live action comedy for preschoolers, and follows the lives of puppets. Big & Small Online, a section of CBeebies Online, won a Children's BAFTA in 2009 for the best interactive content. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Imelda Staunton Lenny Henry Shaun Fleming Billie Joe Armstrong Cree Summer Full Cast & Crew Last Season Big and small season 3 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Big & Small. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  10m, 11m Homepage   http://www.bbc.co.uk/cbeebies/bigandsmall/ Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}