{"link": "https://www.themoviedb.org/tv/44733?language=en", "title": "Pramface", "resume": "Pramface is a BBC Three television comedy series starring Scarlett Alice Johnson, Sean Michael Verey, Ben Crompton, Bronagh Gallagher, Anna Chancellor and Angus Deayton. Written by Chris Reddy and produced by BBC/Little Comet, the six-part first series commenced transmission on 23 February 2012. The second series began on 8 January 2013, with the first episode 60 minutes long, as a special, and the remainder of the series consisted of the usual 30 minute episodes. The second series concluded on 19 February 2013. A third series was confirmed on 29 April 2013.", "rate": 75, "genre": ["Comedy"], "cast": ["Scarlett Alice Johnson", "Sean Verey", "Emer Kenny", "Ben Crompton", "Bronagh Gallagher"], "character": ["Laura Derbyshire", "Jamie Prince", "Danielle Reeves", "Keith Prince", "Sandra Prince"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44733   Expand Pramface   (2012) User Score Overview Pramface is a BBC Three television comedy series starring Scarlett Alice Johnson, Sean Michael Verey, Ben Crompton, Bronagh Gallagher, Anna Chancellor and Angus Deayton. Written by Chris Reddy and produced by BBC/Little Comet, the six-part first series commenced transmission on 23 February 2012. The second series began on 8 January 2013, with the first episode 60 minutes long, as a special, and the remainder of the series consisted of the usual 30 minute episodes. The second series concluded on 19 February 2013. A third series was confirmed on 29 April 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Scarlett Alice Johnson Laura Derbyshire Sean Verey Jamie Prince Emer Kenny Danielle Reeves Ben Crompton Keith Prince Bronagh Gallagher Sandra Prince Full Cast & Crew Last Season Season 3 2014 | 6 Episodes Season 3 of Pramface premiered on February 25, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   2014-08-07 Siblings 5.3    2013-08-16 Big School 6.3    2016-05-09 Upstart Crow 7.4    2012-09-25 Cuckoo 6.6    2013-10-20 Toast of London 6.8    2010-09-06 Him & Her 7.5    2010-12-25 Come Fly With Me 6.6    2009-04-16 Horrible Histories 8.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords parenthood teenager pregnancy sitcom british humour Content Score 86 Almost there... Top Contributors h 6 hroptatyr O 5 Ozbourne w 3 webmaster p 3 pepitopajas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}