{"link": "https://www.themoviedb.org/tv/3167?language=en", "title": "The Early Show", "resume": "The Early Show is an American morning television show which was broadcast by CBS from New York City from 1999 to 2012. The program aired live from 7 to 9 a.m. Eastern Time Monday through Friday in the Eastern time zone; most affiliates in the Central, Mountain, and Pacific time zones aired the show on tape-delay from 7 to 9 a.m. local time. The Saturday edition aired live from 7 to 9 a.m. Eastern Time as well, but a number of affiliates did not carry it or aired it later on tape-delay. It premiered on November 1, 1999, and was the newest of the major networks' morning shows, although CBS has made several attempts to program in the morning slot since 1954. The show aired as a division of CBS News.\nThe Early Show, like many of its predecessors, traditionally ran last in the ratings to its rivals, NBC's Today and ABC's Good Morning America. Much like NBC's The Today Show and The Tonight Show, the title The Early Show was analogous to that of CBS's late-night talk show, The Late Show.\nOn November 15, 2011, CBS announced that a new morning show would replace The Early Show on January 9, 2012. CBS News chairman Jeff Fager and CBS News president David Rhodes stated that the new show would \"redefine the morning television landscape.\" On December 1, it was announced that the new show would be titled CBS This Morning. The Early Show ended its twelve-year run on January 6, 2012, to make way for the program. Charlie Rose, Gayle King, and Erica Hill were named anchors of the new program.", "rate": 0, "genre": ["News"], "cast": ["Bryant Gumbel", "Gretchen Carlson", "David Hart Smith", "Jane Clayson Johnson", "Julie Chen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3167   Expand The Early Show   (1999) User Score Overview The Early Show is an American morning television show which was broadcast by CBS from New York City from 1999 to 2012. The program aired live from 7 to 9 a.m. Eastern Time Monday through Friday in the Eastern time zone; most affiliates in the Central, Mountain, and Pacific time zones aired the show on tape-delay from 7 to 9 a.m. local time. The Saturday edition aired live from 7 to 9 a.m. Eastern Time as well, but a number of affiliates did not carry it or aired it later on tape-delay. It premiered on November 1, 1999, and was the newest of the major networks' morning shows, although CBS has made several attempts to program in the morning slot since 1954. The show aired as a division of CBS News. The Early Show, like many of its predecessors, traditionally ran last in the ratings to its rivals, NBC's Today and ABC's Good Morning America. Much like NBC's The Today Show and The Tonight Show, the title The Early Show was analogous to that of CBS's late-night talk show, The Late Show. On November 15, 2011, CBS announced that a new morning show would replace The Early Show on January 9, 2012. CBS News chairman Jeff Fager and CBS News president David Rhodes stated that the new show would \"redefine the morning television landscape.\" On December 1, it was announced that the new show would be titled CBS This Morning. The Early Show ended its twelve-year run on January 6, 2012, to make way for the program. Charlie Rose, Gayle King, and Erica Hill were named anchors of the new program. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bryant Gumbel Gretchen Carlson David Hart Smith Jane Clayson Johnson Julie Chen Full Cast & Crew Last Season Season 12 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Early Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres News Keywords news broadcast morning show Content Score 71 Just a little bit more... Top Contributors 15 Elizabeth Jennings 12 Banana 5 seawolf 2 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}