{"link": "https://www.themoviedb.org/tv/31891?language=en", "title": "Que Sera, Sera", "resume": "Que Sera, Sera is a 2007 South Korean television series starring Eric Mun, Jung Yoo-mi, Lee Kyu-han, and Yoon Ji-hye. It aired on MBC from March 17 to May 13, 2007 on Saturdays and Sundays at 21:40 for 17 episodes. It is a passionate, violent and twisted drama about emotional abuse, the notion that love is a zero-sum game, and that sometimes, you can even buy love.", "rate": 0, "genre": ["Drama"], "cast": ["Eric Mun", "Lee Kyu-han", "Lee Eun-sung", "Jung Yu-mi", "Yoon Ji-hye"], "character": ["Kang Tae-joo", "Shin Joon-hyuk", "Han Ji-soo", "Han Eun-soo", "Cha Hye-rin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31891   Expand Que Sera, Sera   (2007) User Score Overview Que Sera, Sera is a 2007 South Korean television series starring Eric Mun, Jung Yoo-mi, Lee Kyu-han, and Yoon Ji-hye. It aired on MBC from March 17 to May 13, 2007 on Saturdays and Sundays at 21:40 for 17 episodes. It is a passionate, violent and twisted drama about emotional abuse, the notion that love is a zero-sum game, and that sometimes, you can even buy love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Mun Kang Tae-joo Lee Kyu-han Shin Joon-hyuk Lee Eun-sung Han Ji-soo Jung Yu-mi Han Eun-soo Yoon Ji-hye Cha Hye-rin Full Cast & Crew Last Season Season 1 2007 | 17 Episodes Season 1 of Que Sera, Sera premiered on March 17, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Que Sera, Sera. You can help by rating TV shows you've seen. Facts Original Name  케세라, 세라 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.imbc.com/broad/tv/drama/queserasera/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 15 Maria180493 t 2 tmdb38202327 t 1 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}