{"link": "https://www.themoviedb.org/tv/1099?language=en", "title": "The Girl from U.N.C.L.E.", "resume": "The Girl from U.N.C.L.E. is an American spy-fi TV series that aired on NBC for one season from September 16, 1966 to April 11, 1967. The series was a spin-off from The Man from U.N.C.L.E. and used the same theme music composed by Jerry Goldsmith, which was rearranged into a slightly different, harder-edged arrangement by Dave Grusin.", "rate": 70, "genre": ["Action", "Adventure"], "cast": ["Leo G. Carroll", "Noel Harrison", "Stefanie Powers"], "character": ["Alexander Waverly", "Mark Slate", "April Dancer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1099   Expand The Girl from U.N.C.L.E.   (1966) User Score Overview The Girl from U.N.C.L.E. is an American spy-fi TV series that aired on NBC for one season from September 16, 1966 to April 11, 1967. The series was a spin-off from The Man from U.N.C.L.E. and used the same theme music composed by Jerry Goldsmith, which was rearranged into a slightly different, harder-edged arrangement by Dave Grusin. Featured Crew Sam Rolfe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leo G. Carroll Alexander Waverly Noel Harrison Mark Slate Stefanie Powers April Dancer Full Cast & Crew Last Season Season 1 1966 | 29 Episodes Season 1 of The Girl from U.N.C.L.E. premiered on September 13, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Girl from U.N.C.L.E.. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords undercover spy female spy Content Score 64 We're so close, yet so far. Top Contributors 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}