{"link": "https://www.themoviedb.org/tv/62211?language=en", "title": "Sonic Boom", "resume": "The speedy blue hedgehog gets a new look in this comedy/adventure series that sees him battling a familiar foe with sidekick Tails and pals Knuckles, Amy and Sticks. The gang tries to ward off the evil plans of Dr. Eggman, who is hellbent on taking over the world. Sonic faces regular battles with Eggman's henchmen, including loyal robots Orbot and Cubot, evil interns, and giant, robotic monsters.", "rate": 67, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Roger Craig Smith", "Colleen O'Shaughnessey", "Travis Willingham", "Cindy Robinson", "Mike Pollock"], "character": ["Sonic the Hedgehog / Dave the Intern / Young Gogoba (voice)", "Miles 'Tails' Prower / Zooey / Mrs. Vandersnout / Belinda (voice)", "Knuckles the Echidna / Soar the Eagle / Obliterator Bot / Old Monkey / Mr. Slate (voice)", "Amy Rose / Perci / Elderly Gogoba / Justin Beaver (voice)", "Dr. Eggman / Fastidious Beaver / Mayor (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62211   Expand Sonic Boom   (2014) User Score Overview The speedy blue hedgehog gets a new look in this comedy/adventure series that sees him battling a familiar foe with sidekick Tails and pals Knuckles, Amy and Sticks. The gang tries to ward off the evil plans of Dr. Eggman, who is hellbent on taking over the world. Sonic faces regular battles with Eggman's henchmen, including loyal robots Orbot and Cubot, evil interns, and giant, robotic monsters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roger Craig Smith Sonic the Hedgehog / Dave the Intern / Young Gogoba (voice) Colleen O'Shaughnessey Miles 'Tails' Prower / Zooey / Mrs. Vandersnout / Belinda (voice) Travis Willingham Knuckles the Echidna / Soar the Eagle / Obliterator Bot / Old Monkey / Mr. Slate (voice) Cindy Robinson Amy Rose / Perci / Elderly Gogoba / Justin Beaver (voice) Mike Pollock Dr. Eggman / Fastidious Beaver / Mayor (voice) Full Cast & Crew Last Season Season 2 2016 | 52 Episodes Season 2 of Sonic Boom premiered on October 29, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1999-10-04 Sonic Underground 2.0    1999-11-12 Mike, Lu & Og 3.3    2000-12-21 The Brak Show 7.0    2007-07-08 Total Drama Island 6.2    2003-08-23 Sonic X 5.5    2005-07-08 Camp Lazlo 5.6    2005-09-17 Johnny Test 4.2    2000-11-17 Sheep in the Big City 6.8  Facts Status  Returning Series Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.sonicthehedgehog.com/boom/en/sonic-boom-tv-overview/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 41 Rocketeer Raccoon 21 Elizabeth Jennings S 16 Scerttle CM 15 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}