{"link": "https://www.themoviedb.org/tv/6478?language=en", "title": "VH1 Storytellers", "resume": "The greatest singers and songwriters play their music and tell the stories behind their greatest songs on this acclaimed VH1 music performance series. Each one-hour episode takes viewers behind the scenes with a single artist or group featuring intimate musical performances and the first-hand stories behind the performer's hits and sentimental favorites.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6478   Expand VH1 Storytellers   (2005) User Score Overview The greatest singers and songwriters play their music and tell the stories behind their greatest songs on this acclaimed VH1 music performance series. Each one-hour episode takes viewers behind the scenes with a single artist or group featuring intimate musical performances and the first-hand stories behind the performer's hits and sentimental favorites. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 12 2011 | 4 Episodes Season 12 of VH1 Storytellers premiered on May 13, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for VH1 Storytellers. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on VH1 Storytellers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 15 Elizabeth Jennings 1 fmfanuk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}