{"link": "https://www.themoviedb.org/tv/6153?language=en", "title": "Gigantor", "resume": "Gigantor is an American adaptation of the anime version of Tetsujin 28-go, a manga by Mitsuteru Yokoyama released in 1956. It debuted on U.S. television in 1964. As with Speed Racer, the characters' original names were altered and the original series' violence was toned down for American viewers. The series \"was resurrected, in color, as The New Adventures of Gigantor, by the Sci Fi Channel in 1993.\"", "rate": 100, "genre": ["Animation"], "cast": ["Kazue Takahashi", "Kousei Tomita", "Minoru Yada", "Yuzuru Fujimoto", "Fuyumi Shiraishi"], "character": ["Jimmy Sparks", "Inspector Blooper", "Dr. Bob Brilliant"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6153   Expand Gigantor   (1963) User Score Overview Gigantor is an American adaptation of the anime version of Tetsujin 28-go, a manga by Mitsuteru Yokoyama released in 1956. It debuted on U.S. television in 1964. As with Speed Racer, the characters' original names were altered and the original series' violence was toned down for American viewers. The series \"was resurrected, in color, as The New Adventures of Gigantor, by the Sci Fi Channel in 1993.\" Featured Crew Mitsuteru Yokoyama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kazue Takahashi Jimmy Sparks Kousei Tomita Inspector Blooper Minoru Yada Dr. Bob Brilliant Yuzuru Fujimoto Fuyumi Shiraishi Full Cast & Crew Last Season Season 1 1963 | 52 Episodes Season 1 of Gigantor premiered on October 20, 1963. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gigantor. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.gigantor.org/ Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}