{"link": "https://www.themoviedb.org/tv/14807?language=en", "title": "Autumn in My Heart", "resume": "Autumn in My Heart is a 2000 South Korean romantic television drama, starring Song Seung-heon, Song Hye-kyo and Won Bin. It aired on Korean Broadcasting System from September 18 to November 7, 2000 on Mondays and Tuesdays at 21:55 for 16 episodes. The series was very successful in South Korea, averaging viewership ratings of 38.6% and reaching a peak viewership of 46.1%.\nThe series is the first installment of season-themed tetralogy Endless Love drama series directed by Yoon Seok-ho.", "rate": 80, "genre": ["Drama"], "cast": ["Song Seung-heon", "Moon Geun-Young", "Song Hye-kyo", "Han Chae-young", "Lee Ae-jung"], "character": ["Yoon Joon-suh", "young Eun-suh", "Yun", "Choi/Yoon Shin-ae", "young Shin-ae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14807   Expand Autumn in My Heart   (2000) User Score Overview Autumn in My Heart is a 2000 South Korean romantic television drama, starring Song Seung-heon, Song Hye-kyo and Won Bin. It aired on Korean Broadcasting System from September 18 to November 7, 2000 on Mondays and Tuesdays at 21:55 for 16 episodes. The series was very successful in South Korea, averaging viewership ratings of 38.6% and reaching a peak viewership of 46.1%. The series is the first installment of season-themed tetralogy Endless Love drama series directed by Yoon Seok-ho. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Song Seung-heon Yoon Joon-suh Moon Geun-Young young Eun-suh Song Hye-kyo Yun Han Chae-young Choi/Yoon Shin-ae Lee Ae-jung young Shin-ae Full Cast & Crew Last Season Season 1 2000 | 18 Episodes Season 1 of Autumn in My Heart premiered on September 18, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Autumn in My Heart. You can help by rating TV shows you've seen. Facts Original Name  가을동화 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.kbs.co.kr/drama/fall/ Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors N 17 Nightowl.Kr t 11 tmdb38202327 R 4 Rebecca 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}