{"link": "https://www.themoviedb.org/tv/65495?language=en", "title": "Atlanta", "resume": "Two cousins, with different views on art versus commerce, on their way up through the Atlanta rap scene; Earnest 'Earn' Marks, an ambitious college dropout and his estranged cousin, who suddenly becomes a star.", "rate": 75, "genre": ["Comedy"], "cast": ["Donald Glover", "Brian Tyree Henry", "LaKeith Stanfield", "Zazie Beetz"], "character": ["Earnest \"Earn\" Marks", "Alfred \"Paper Boi\" Miles", "Darius", "Vanessa \"Van\" Keefer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65495   Expand Atlanta   (2016) User Score  Play Trailer Overview Two cousins, with different views on art versus commerce, on their way up through the Atlanta rap scene; Earnest 'Earn' Marks, an ambitious college dropout and his estranged cousin, who suddenly becomes a star. Featured Crew Donald Glover Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  14 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Donald Glover Earnest \"Earn\" Marks Brian Tyree Henry Alfred \"Paper Boi\" Miles LaKeith Stanfield Darius Zazie Beetz Vanessa \"Van\" Keefer Full Cast & Crew Current Season Robbin' Season 2018 | 11 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Live Action South Park Open 0 by TheVorlon\n      \n     Super Fun Open 2 by Jeff_34\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  5 Recommendations   2015-11-06 Master of None 8.0    2009-03-20 Party Down 7.4    2014-01-22 Broad City 7.6    2009-09-17 Community 7.9    2016-08-12 The Get Down 7.6    2003-01-22 Chappelle's Show 8.2    2012-04-22 Veep 7.2    2014-08-22 BoJack Horseman 8.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.fxnetworks.com/shows/atlanta Genres Comedy Keywords hip-hop atlanta Content Score 100 Yes! Looking good! Top Contributors 45 Elizabeth Jennings 10 Banana m 10 misfit_noel AF 6 Alex Facey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}