{"link": "https://www.themoviedb.org/tv/15953?language=en", "title": "Trapped", "resume": "Trapped is a documentary television series that premiered on November 7, 2007 on the National Geographic Channel. Produced in association with the National Geographic Channel and Cineflix, the program examines various actual incidents or disasters in which victims were trapped on the site.\nAs of 12 December 2007, six episodes have been aired.", "rate": 0, "genre": ["Documentary"], "cast": ["Simon Greenall"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15953   Expand Trapped   (2007) User Score Overview Trapped is a documentary television series that premiered on November 7, 2007 on the National Geographic Channel. Produced in association with the National Geographic Channel and Cineflix, the program examines various actual incidents or disasters in which victims were trapped on the site. As of 12 December 2007, six episodes have been aired. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Greenall Full Cast & Crew Last Season Season 3 2009 | 13 Episodes Season 3 of Trapped premiered on January  2, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Trapped. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 1 ssmol  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}