{"link": "https://www.themoviedb.org/tv/37764?language=en", "title": "Romania's Got Talent", "resume": "Românii au talent is a TV show which first aired on 18 February 2011. The project is a franchise of Got Talent, developed by Simco Limited. The hosts of the show are Smiley and Pavel Bartoş. The judges are the Romanian singer Andra, a Pro TV star and presenter Andi Moisescu,TV presenter Mihaela Rădulescu and Florin Calinescu,Romanian actor, theatre director and television host.The grand prize is 120.000€.", "rate": 81, "genre": ["Reality"], "cast": ["Andra", "Mihaela Rădulescu", "Andi Moisescu", "Florin Călinescu", "Smiley"], "character": ["Judge", "Judge", "Judge", "Judge", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37764   Expand Romania's Got Talent   (2011) User Score Overview Românii au talent is a TV show which first aired on 18 February 2011. The project is a franchise of Got Talent, developed by Simco Limited. The hosts of the show are Smiley and Pavel Bartoş. The judges are the Romanian singer Andra, a Pro TV star and presenter Andi Moisescu,TV presenter Mihaela Rădulescu and Florin Calinescu,Romanian actor, theatre director and television host.The grand prize is 120.000€. Featured Crew Ken Warwick Creator Simon Cowell Creator Jason Raff Creator Cécile Frot-Coutaz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andra Judge Mihaela Rădulescu Judge Andi Moisescu Judge Florin Călinescu Judge Smiley Host Full Cast & Crew Current Season Season 8 2018 | 10 Episodes Season 8 of Romania's Got Talent premiered on February 16, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Romania's Got Talent. You can help by rating TV shows you've seen. Facts Original Name  Românii au talent Status  Returning Series Network Certification  - Type  Reality Original Language  Romanian Runtime  - Homepage   http://romaniiautalent.protv.ro/ Genres Reality Keywords talent show Content Score 79 Pump it up! We're close now. Top Contributors 60 Liviu Roman R 10 Romaryho 5 Banana S 2 SerialeOnline2015  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}