{"link": "https://www.themoviedb.org/tv/61860?language=en", "title": "Maids", "resume": "Set in the Joseon Dynasty, three women learn what love means as they try to navigate through the class system and survive. In Yup (Jung Yoo Mi) is a beautiful noblewoman who becomes a servant overnight when her father is framed and labeled a traitor. She ends up falling in love with a fellow servant, Moo Myung (Oh Ji Ho), while working for the royal family, and becomes friends with her own handmaiden Sa Wol thanks to their shared experiences. Meanwhile Ga Hee is the most famous gisaeng of the city but with her own aspirations for romance. She falls in love with Moo Myung, but what can she do when his heart lies elsewhere?", "rate": 71, "genre": ["Drama", "History", "Romance"], "cast": ["Jeong Yu-mi", "Oh Ji-ho", "Kim Dong-wook", "Lee El", "Lee Shi-Ah"], "character": ["Gook In-yub", "Moo-myung / Lee-bi", "Kim Eun-gi", "Lady Kang", "Heo Yoon-Ok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61860   Expand Maids   (2014) User Score Overview Set in the Joseon Dynasty, three women learn what love means as they try to navigate through the class system and survive. In Yup (Jung Yoo Mi) is a beautiful noblewoman who becomes a servant overnight when her father is framed and labeled a traitor. She ends up falling in love with a fellow servant, Moo Myung (Oh Ji Ho), while working for the royal family, and becomes friends with her own handmaiden Sa Wol thanks to their shared experiences. Meanwhile Ga Hee is the most famous gisaeng of the city but with her own aspirations for romance. She falls in love with Moo Myung, but what can she do when his heart lies elsewhere? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeong Yu-mi Gook In-yub Oh Ji-ho Moo-myung / Lee-bi Kim Dong-wook Kim Eun-gi Lee El Lady Kang Lee Shi-Ah Heo Yoon-Ok Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Maids premiered on December 12, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Maids. You can help by rating TV shows you've seen. Facts Original Name  하녀들 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://home.jtbc.joins.com/Event/Event.aspx?prog_id=PR10010330&menu_id=PM10027378 Genres Drama History Romance Keywords korea Content Score 86 Almost there... Top Contributors M 40 Maria180493 t 5 tmdb38202327 4 digit r 2 rogercyk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}