{"link": "https://www.themoviedb.org/tv/63404?language=en", "title": "Taskmaster", "resume": "Greg Davies is the Taskmaster, and with the help of his ever-loyal assistant Alex Horne, they will set out to test the wiles, wit, wisdom and skills of five hyper-competitive comedians. Who will be crowned the Taskmaster champion in this brand new game show?", "rate": 93, "genre": ["Comedy"], "cast": ["Greg Davies", "Alex Horne", "Asim Chaudhry", "Russell Howard", "Alice Levine"], "character": ["Taskmaster", "Taskmaster's Assistant", "Himself", "Himself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63404   Expand Taskmaster   (2015) User Score Overview Greg Davies is the Taskmaster, and with the help of his ever-loyal assistant Alex Horne, they will set out to test the wiles, wit, wisdom and skills of five hyper-competitive comedians. Who will be crowned the Taskmaster champion in this brand new game show? Featured Crew Alex Horne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Greg Davies Taskmaster Alex Horne Taskmaster's Assistant Asim Chaudhry Himself Russell Howard Himself Alice Levine Herself Full Cast & Crew Current Season Series 6 2018 | 10 Episodes Season 6 of Taskmaster premiered on May  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Taskmaster. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://dave.uktv.co.uk/shows/taskmaster/ Genres Comedy Keywords comedian game show challenge task panel show british humour Content Score 93 Almost there... Top Contributors 60 BagronkeN s 38 speller2 20 Markxist 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}