{"link": "https://www.themoviedb.org/tv/9777?language=en", "title": "Friends with Benefits", "resume": "Revolving around a group of twentysomething singles as they navigate the difficult, sometimes rewarding, often confusing world of dating. Loyal and devoted to one another, these friends are never too busy to help a member of the group who might be in need. In fact, their companionship often extends into a more intimate setting - the bedroom.", "rate": 61, "genre": ["Drama", "Comedy"], "cast": ["Ryan Hansen", "Danneel Ackles", "Zach Cregger", "André Holland", "Jessica Lucas"], "character": ["Ben Lewis", "Sara Maxwell", "Aaron Greenway", "Julian 'Fitz' Fitzgerald", "Riley Elliott"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9777   Expand Friends with Benefits   (2011) User Score Overview Revolving around a group of twentysomething singles as they navigate the difficult, sometimes rewarding, often confusing world of dating. Loyal and devoted to one another, these friends are never too busy to help a member of the group who might be in need. In fact, their companionship often extends into a more intimate setting - the bedroom. Featured Crew Michael H. Weber Creator Scott Neustadter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Hansen Ben Lewis Danneel Ackles Sara Maxwell Zach Cregger Aaron Greenway André Holland Julian 'Fitz' Fitzgerald Jessica Lucas Riley Elliott Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Absolute) Digital Order (Digital) Production Order + Pilot (Production) Season 1 2011 | 12 Episodes Season 1 of Friends with Benefits premiered on August  4, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2009-06-22 Make It or Break It 6.6    2010-06-07 Persons Unknown 6.4    2011-06-06 Switched at Birth 6.1    2011-04-13 Happy Endings 7.3    2012-09-25 The Mindy Project 5.6    2003-09-23 One Tree Hill 6.5    2011-07-11 Alphas 6.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  21m Homepage   http://www.nbc.com/friends-with-benefits Genres Drama Comedy Keywords chicago group of friends sitcom Content Score 93 Almost there... Top Contributors 46 Banana 38 seawolf 5 Vampire Bai b 4 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}