{"link": "https://www.themoviedb.org/tv/13260?language=en", "title": "Conan the Adventurer", "resume": "Conan: The Adventurer is an American television series created, developed, financed, distributed and produced by Max A. Keller and Micheline Keller from 1997 to 1998 and loosely based on the fantasy hero Conan the Barbarian. The TV show premiered on September 22, 1997, and ran for 22 episodes. The series has been broadcast in over 150 countries throughout the world. Keller Entertainment Group continues to market and distribute the series worldwide and the series has longevity among international broadcasters and dvd aggregators. The series will soon be available on the internet. This live-action series stars Ralf Möller as Conan of Cimmeria and Danny Woodburn as his sidekick Otli. The storyline is quite different from the Conan lore created in the original Conan novels and short stories by Robert E. Howard, as well as that of the Conan earlier depicted in the various Conan comic book series by Marvel Comics. The TV character is based on the version in the 1980s films, but there is no continuity between the films and TV series.", "rate": 60, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Drama"], "cast": ["Ralf Moeller", "Jeremy Kemp", "Danny Woodburn", "Robert McRay", "T. J. Storm"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13260   Expand Conan the Adventurer   (1997) User Score Overview Conan: The Adventurer is an American television series created, developed, financed, distributed and produced by Max A. Keller and Micheline Keller from 1997 to 1998 and loosely based on the fantasy hero Conan the Barbarian. The TV show premiered on September 22, 1997, and ran for 22 episodes. The series has been broadcast in over 150 countries throughout the world. Keller Entertainment Group continues to market and distribute the series worldwide and the series has longevity among international broadcasters and dvd aggregators. The series will soon be available on the internet. This live-action series stars Ralf Möller as Conan of Cimmeria and Danny Woodburn as his sidekick Otli. The storyline is quite different from the Conan lore created in the original Conan novels and short stories by Robert E. Howard, as well as that of the Conan earlier depicted in the various Conan comic book series by Marvel Comics. The TV character is based on the version in the 1980s films, but there is no continuity between the films and TV series. Featured Crew Robert E. Howard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ralf Moeller Jeremy Kemp Danny Woodburn Robert McRay T. J. Storm Full Cast & Crew Last Season Conan (1997) season 1 1997 | 22 Episodes Season 1 of Conan the Adventurer premiered on September 22, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Conan the Adventurer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 5 zurman1 w 4 waterhorse s 3 speedycars 2 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}