{"link": "https://www.themoviedb.org/tv/34697?language=en", "title": "Blade of the Immortal", "resume": "Blade of the Immortal is a Japanese manga series by Hiroaki Samura. The series is set in Japan during the mid-Tokugawa Shogunate period and follows the cursed samurai Manji, who has to kill 1000 evil men in order to regain his mortality. The manga was originally published in Afternoon from June 25, 1993 – December 25, 2012. A 2008 anime adaption was produced Bee Train and Production I.G. Also in 2008, the novel Blade of the Immortal: Legend of the Sword Demon was released in the United States by Dark Horse Comics.", "rate": 70, "genre": ["Animation", "Action", "Adventure"], "cast": ["Tomokazu Seki", "Rina Satou", "Kazuya Nakai", "Katsuyuki Konishi", "Hirofumi Nojima"], "character": ["Manji", "Rin Asano", "Taito Magatsu", "Eiku Shizuma", "Kagehisa Anotsu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34697   Expand Blade of the Immortal   (2008) User Score Overview Blade of the Immortal is a Japanese manga series by Hiroaki Samura. The series is set in Japan during the mid-Tokugawa Shogunate period and follows the cursed samurai Manji, who has to kill 1000 evil men in order to regain his mortality. The manga was originally published in Afternoon from June 25, 1993 – December 25, 2012. A 2008 anime adaption was produced Bee Train and Production I.G. Also in 2008, the novel Blade of the Immortal: Legend of the Sword Demon was released in the United States by Dark Horse Comics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomokazu Seki Manji Rina Satou Rin Asano Kazuya Nakai Taito Magatsu Katsuyuki Konishi Eiku Shizuma Hirofumi Nojima Kagehisa Anotsu Full Cast & Crew Last Season Season 1 2008 | 13 Episodes Season 1 of Blade of the Immortal premiered on July 13, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Blade of the Immortal. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords based on manga anime monthly afternoon Content Score 86 Almost there... Top Contributors 7 sp1ti m 3 magoozin 1 TheDerpMan o 1 onlinemoviestar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}