{"link": "https://www.themoviedb.org/tv/8915?language=en", "title": "The Galaxy Railways", "resume": "The Galaxy Railways is a 26 episode science fiction anime series about flying trains set in the far reaches of space. It is licensed by Funimation Production Ltd. and produced by Leiji Matsumoto. It debuted on American TV in a syndicated FUNimation Channel programming block airing on CoLours TV on Monday, June 19, 2006, but was replaced by Dragon Ball until the programming block was dropped. The series has also aired on the linear FUNimation Channel. Two sequels have been produced, both currently unlicensed in English regions.\nA 4-part OVA series The Galaxy Railways: A Letter from the Abandoned Planet was produced that bridges both seasons of the show.\nIn 2006 a sequel series, The Galaxy Railways: Crossroads to Eternity began broadcasting in Japan for a 26-episode run. Of those 26, only 24 episodes were broadcast on television, with the final two released only on DVD.\nIt has also been announced that on the 25-03-2009, an off take of the series called The Galaxy Railways: Faraway Angels will be released as a Drama CD. The story follows the Mizar platoon and their adventures.", "rate": 65, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Takehito Koyasu", "Naoki Yanagi", "Kazuhiko Inoue", "Hikaru Midorikawa", "Naoko Suzuki"], "character": ["Bruce J. Speed", "Manabu Yuki", "Wataru Yûki", "David Young", "Sexaroid Yuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8915   Expand The Galaxy Railways   (2003) User Score Overview The Galaxy Railways is a 26 episode science fiction anime series about flying trains set in the far reaches of space. It is licensed by Funimation Production Ltd. and produced by Leiji Matsumoto. It debuted on American TV in a syndicated FUNimation Channel programming block airing on CoLours TV on Monday, June 19, 2006, but was replaced by Dragon Ball until the programming block was dropped. The series has also aired on the linear FUNimation Channel. Two sequels have been produced, both currently unlicensed in English regions. A 4-part OVA series The Galaxy Railways: A Letter from the Abandoned Planet was produced that bridges both seasons of the show. In 2006 a sequel series, The Galaxy Railways: Crossroads to Eternity began broadcasting in Japan for a 26-episode run. Of those 26, only 24 episodes were broadcast on television, with the final two released only on DVD. It has also been announced that on the 25-03-2009, an off take of the series called The Galaxy Railways: Faraway Angels will be released as a Drama CD. The story follows the Mizar platoon and their adventures. Featured Crew Leiji Matsumoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takehito Koyasu Bruce J. Speed Naoki Yanagi Manabu Yuki Kazuhiko Inoue Wataru Yûki Hikaru Midorikawa David Young Naoko Suzuki Sexaroid Yuki Full Cast & Crew Last Season Season 1 2003 | 26 Episodes Season 1 of The Galaxy Railways premiered on October  4, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Galaxy Railways. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors d 6 denis 4 sp1ti 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}