{"link": "https://www.themoviedb.org/tv/4344?language=en", "title": "Rescue Me", "resume": "Rescue Me revolves around the lives of the men in a New York City firehouse, the crew of 62 Truck. Examining the fraternal nature and relationships of firefighters, the series tackles the daily drama of the life-and-death situations associated with being a firefighter, while exploring the ways the men use dark humor to protect their true emotions.", "rate": 78, "genre": ["Action", "Adventure", "Drama", "Comedy"], "cast": ["Denis Leary", "Adam Ferrara", "Michael Lombardi", "Steven Pasquale", "Andrea Roth"], "character": ["Tommy Gavin", "Chief 'Needles' Nelson", "Mike Silletti", "Sean Garrity", "Janet Gavin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4344   Expand Rescue Me   (2004) User Score Overview Rescue Me revolves around the lives of the men in a New York City firehouse, the crew of 62 Truck. Examining the fraternal nature and relationships of firefighters, the series tackles the daily drama of the life-and-death situations associated with being a firefighter, while exploring the ways the men use dark humor to protect their true emotions. Featured Crew Denis Leary Creator Peter Tolan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  13 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Denis Leary Tommy Gavin Adam Ferrara Chief 'Needles' Nelson Michael Lombardi Mike Silletti Steven Pasquale Sean Garrity Andrea Roth Janet Gavin Full Cast & Crew Last Season Season 7 2011 | 9 Episodes Season 7 of Rescue Me premiered on July 13, 2011. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Tommy: Happy Birthday Denis Leary! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  13 Posters  8 Recommendations   2006-07-09 Brotherhood 7.4    2003-07-22 Nip/Tuck 6.9    2007-02-26 The Black Donnellys 7.4    1996-09-17 Spin City 7.0    1997-07-12 Oz 8.1    2002-03-12 The Shield 8.1    2010-03-16 Justified 7.9    2006-03-12 Big Love 7.6  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.fxnetworks.com/shows/originals/rescueme/ Genres Action & Adventure Drama Comedy Keywords new york firemen fire department post 9/11 Content Score 93 Almost there... Top Contributors 103 United600 12 Banana 10 Travis Bell S 10 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}