{"link": "https://www.themoviedb.org/tv/3937?language=en", "title": "The Life and Times of Vivienne Vyle", "resume": "Revolving around the life of Vivienne Vyle, a daytime TV presenter/agony aunt in the mold of Trisha, the show focuses on not only the problems of her guests but the problems Vivienne faces herself in regards to her love and home life.", "rate": 100, "genre": ["Comedy"], "cast": ["Miranda Richardson", "Jennifer Saunders", "Christopher Ryan", "Conleth Hill", "Paul O'Grady"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3937   Expand The Life and Times of Vivienne Vyle   (2007) User Score Overview Revolving around the life of Vivienne Vyle, a daytime TV presenter/agony aunt in the mold of Trisha, the show focuses on not only the problems of her guests but the problems Vivienne faces herself in regards to her love and home life. Featured Crew Jennifer Saunders Creator Tanya Byron Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miranda Richardson Jennifer Saunders Christopher Ryan Conleth Hill Paul O'Grady Full Cast & Crew Last Season Season 1 2007 | 6 Episodes Season 1 of The Life and Times of Vivienne Vyle premiered on October  4, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Life and Times of Vivienne Vyle. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/viviennevyle/ Genres Comedy Keywords satire parody tv host british humour Content Score 93 Almost there... Top Contributors O 7 Ozbourne 7 Jimensue 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}