{"link": "https://www.themoviedb.org/tv/67611?language=en", "title": "High Society", "resume": "Kerem is a young and hardworking man who comes from a poor family. His father works as a gardener and his mother works as a cook for a rich family. Cansu is the youngest daughter of a wealthy family from high society. Despite her wealth, she is not happy at all. One day, she accidentally meets a fortune teller who says that Cansu would find a true love if she reads the signs. Out of pure coincidence, Cansu finds herself at Olivia and starts to work there as a sales person. Olivia becomes a complicated place: Kerem thinks that Cansu is a poor girl and starts to have feelings for her. Cansu thinks that Kerem is a decent man even though he cmes forom a high society and starts to have feeling for him.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Hazar Ergüçlü", "Engin Ozturk", "Ozan Dolunay", "Meriç Aral", "Aliye Uzunatağan"], "character": ["Cansu Koran", "Kerem Özkan", "Mert", "Ece", "Bedia Çalhan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67611   Expand High Society   (2016) User Score  Play Trailer Overview Kerem is a young and hardworking man who comes from a poor family. His father works as a gardener and his mother works as a cook for a rich family. Cansu is the youngest daughter of a wealthy family from high society. Despite her wealth, she is not happy at all. One day, she accidentally meets a fortune teller who says that Cansu would find a true love if she reads the signs. Out of pure coincidence, Cansu finds herself at Olivia and starts to work there as a sales person. Olivia becomes a complicated place: Kerem thinks that Cansu is a poor girl and starts to have feelings for her. Cansu thinks that Kerem is a decent man even though he cmes forom a high society and starts to have feeling for him. Featured Crew Feride Kaytan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hazar Ergüçlü Cansu Koran Engin Ozturk Kerem Özkan Ozan Dolunay Mert Meriç Aral Ece Aliye Uzunatağan Bedia Çalhan Full Cast & Crew Last Season Season 1 2016 | 27 Episodes Season 1 of High Society premiered on July 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on High Society. You can help by rating TV shows you've seen. Facts Original Name  Yüksek Sosyete Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors V 30 Vaine 7 moviefars A 5 Alenp 3 purplelammashta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}