{"link": "https://www.themoviedb.org/tv/13387?language=en", "title": "Bagpuss", "resume": "Bagpuss is a UK children's television series, made by Peter Firmin and Oliver Postgate from 12 February 1974 to 7 May 1974 through their company Smallfilms. The title character was \"an old, saggy cloth cat, baggy, and a bit loose at the seams\". Although only 13 episodes of the show were made, it remains fondly remembered, and was regularly repeated in the UK for thirteen years. In 1999 Bagpuss topped a BBC poll for the UK's favourite children's TV programme.", "rate": 0, "genre": ["Kids", "Animation"], "cast": ["Oliver Postgate"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13387   Expand Bagpuss   (1974) User Score Overview Bagpuss is a UK children's television series, made by Peter Firmin and Oliver Postgate from 12 February 1974 to 7 May 1974 through their company Smallfilms. The title character was \"an old, saggy cloth cat, baggy, and a bit loose at the seams\". Although only 13 episodes of the show were made, it remains fondly remembered, and was regularly repeated in the UK for thirteen years. In 1999 Bagpuss topped a BBC poll for the UK's favourite children's TV programme. Featured Crew Oliver Postgate Creator Peter Firmin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oliver Postgate Full Cast & Crew Last Season Season 1 1974 | 13 Episodes Season 1 of Bagpuss premiered on February 12, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bagpuss. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Kids Animation Keywords cat mouse shop puppet folk music woodpecker Content Score 64 We're so close, yet so far. Top Contributors c 9 cliveski 1 xyzl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}