{"link": "https://www.themoviedb.org/tv/34806?language=en", "title": "Needless", "resume": "Needless is an action comedy science fiction manga and anime series by Kami Imai. Serialized in Shueisha's seinen magazine Ultra Jump beginning in 2004, an anime adaptation by Madhouse began airing on July 2, 2009.", "rate": 80, "genre": ["Animation"], "cast": ["Eri Kitamura", "Takehito Koyasu", "Aya Endo", "Kenji Utsumi", "Kentaro Ito"], "character": ["Eve Neuschwanstein", "Adam Blade (voice)", "Cruz Shild (voice)", "Guido (voice)", "Momiji Teruyama (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34806   Expand Needless   (2009) User Score Overview Needless is an action comedy science fiction manga and anime series by Kami Imai. Serialized in Shueisha's seinen magazine Ultra Jump beginning in 2004, an anime adaptation by Madhouse began airing on July 2, 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eri Kitamura Eve Neuschwanstein Takehito Koyasu Adam Blade (voice) Aya Endo Cruz Shild (voice) Kenji Utsumi Guido (voice) Kentaro Ito Momiji Teruyama (voice) Full Cast & Crew Last Season Season 1 2009 | 24 Episodes Season 1 of Needless premiered on July  2, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Needless. You can help by rating TV shows you've seen. Facts Original Name  ニードレス Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 21 BrerFox m 3 magoozin TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}