{"link": "https://www.themoviedb.org/tv/32682?language=en", "title": "The Laser Man", "resume": "Laser Man, John Ausonius, committed in 1991-92 a number of terror attacks on immigrants. One person was killed and ten injured. This mini series from SVT is based on Gellert Tamas bestselling book \"The Laser Man\" and is a strong dramatization of one of the most dangerous people in the Swedish criminal history.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["Sten Ljunggren", "Ralph Carlsson", "David Dencik", "Mats Blomgren", "Sten Johan Hedman"], "character": ["Thorin", "Bergkvist", "John Ausonius", "Sjöberg", "Thorstensson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32682   Expand The Laser Man   (2005) User Score Overview Laser Man, John Ausonius, committed in 1991-92 a number of terror attacks on immigrants. One person was killed and ten injured. This mini series from SVT is based on Gellert Tamas bestselling book \"The Laser Man\" and is a strong dramatization of one of the most dangerous people in the Swedish criminal history. Featured Crew Mikael Marcimain Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sten Ljunggren Thorin Ralph Carlsson Bergkvist David Dencik John Ausonius Mats Blomgren Sjöberg Sten Johan Hedman Thorstensson Full Cast & Crew Last Season Season 1 2005 | 3 Episodes Season 1 of The Laser Man premiered on November 23, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   Roman Polanski: Wanted and Desired 6.4    2003-12-08 Battlestar Galactica 8.3    1990-04-08 Twin Peaks 8.1  Facts Original Name  Lasermannen Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Miniseries Original Language  Swedish Runtime  - Homepage   https://www.svt.se/dokumentarfilm/lasermannen/ Genres Crime Drama Keywords miniseries Content Score 93 Almost there... Top Contributors TB 40 TMDb Bot F 15 Frixzon 11 lineker CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}