{"link": "https://www.themoviedb.org/tv/8565?language=en", "title": "Martha Speaks", "resume": "Martha Speaks is a Canadian/American animated children's television series based on the 1992 children's book of the same name by Susan Meddaugh, about a talking dog named Martha, who is owned by ten-year-old Helen Lorraine. When Helen feeds Martha some alphabet soup, the soup travels to her brain instead of her stomach, resulting in her ability to speak. The show focuses on synonyms and vocabulary, with each episode featuring an underlying theme illustrated with key words. The show takes place in the fictional town of Wagstaff City, a parody of Flagstaff, Arizona.\nThe show is produced by WGBH in Boston, along with Vancouver based animation studio DHX Media Vancouver, and debuted on September 1, 2008 on PBS Kids and PBS Kids Go! stations across the United States. Some episodes of this TV series were available for limited theatrical release on January 3, 2009.\nThe second season began airing on September 14, 2009. The third season of Martha Speaks premiered on PBS Kids on October 11, 2010, and the fourth season began airing on February 20, 2012. In May 2013, PBS Kids renewed Martha Speaks for a fifth and sixth season of 8 new episodes each. The fifth season premiered on June 24, 2013.", "rate": 40, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8565   Expand Martha Speaks   (2008) User Score Overview Martha Speaks is a Canadian/American animated children's television series based on the 1992 children's book of the same name by Susan Meddaugh, about a talking dog named Martha, who is owned by ten-year-old Helen Lorraine. When Helen feeds Martha some alphabet soup, the soup travels to her brain instead of her stomach, resulting in her ability to speak. The show focuses on synonyms and vocabulary, with each episode featuring an underlying theme illustrated with key words. The show takes place in the fictional town of Wagstaff City, a parody of Flagstaff, Arizona. The show is produced by WGBH in Boston, along with Vancouver based animation studio DHX Media Vancouver, and debuted on September 1, 2008 on PBS Kids and PBS Kids Go! stations across the United States. Some episodes of this TV series were available for limited theatrical release on January 3, 2009. The second season began airing on September 14, 2009. The third season of Martha Speaks premiered on PBS Kids on October 11, 2010, and the fourth season began airing on February 20, 2012. In May 2013, PBS Kids renewed Martha Speaks for a fifth and sixth season of 8 new episodes each. The fifth season premiered on June 24, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2013 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Martha Speaks. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 10 tlavigne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}