{"link": "https://www.themoviedb.org/tv/12143?language=en", "title": "Azumanga Daioh", "resume": "Azumanga Daioh is a Japanese comedy manga by Kiyohiko Azuma. It was serialized by MediaWorks in the shōnen manga magazine Dengeki Daioh from 1999 to 2002 and collected in four bound volumes. In May 2009, in conjunction with the 10th anniversary of the manga, three additional chapters began serialization in Shogakukan's Monthly Shōnen Sunday under the title Azumanga Daioh: Supplementary Lessons.\nThe manga is drawn in a series of vertical four-panel comic strips called yonkoma and depicts the lives of a group of girls during their three years as high-school classmates. The series has been praised for its humor driven by eccentric characters, and Kiyohiko Azuma acclaimed as a \"master of the four-panel form,\" for both his art style and comic timing.\nIt was adapted as an anime television series called Azumanga Daioh: the Animation by J.C.Staff, which aired from the week of April 8, 2002 until the week of September 30, 2002. It was broadcast on the TV Tokyo network and AT-X in five-minute segments every weekday, then rebroadcast as a 25-minute compilation that weekend, for a total of 130 five-minute segments collected in 26 episodes. The compilation episodes were released on DVD and Universal Media Discs by Starchild Records; the five-minute segments can be distinguished by their individual titles. Several soundtrack albums were released, as well as three Azumanga Daioh video games.", "rate": 85, "genre": ["Animation", "Comedy"], "cast": ["Tomoko Kaneda", "Yuki Matsuoka", "Chieko Higuchi", "Rie Tanaka", "Yuu Asakawa"], "character": ["Chiyo Mihama (Voice)", "Ayumu 'Osaka' Kasuga (Voice)", "Tomo Takino (Voice)", "Koyomi Mizuhara (Voice)", "Sakaki (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12143   Expand Azumanga Daioh   (2002) User Score Overview Azumanga Daioh is a Japanese comedy manga by Kiyohiko Azuma. It was serialized by MediaWorks in the shōnen manga magazine Dengeki Daioh from 1999 to 2002 and collected in four bound volumes. In May 2009, in conjunction with the 10th anniversary of the manga, three additional chapters began serialization in Shogakukan's Monthly Shōnen Sunday under the title Azumanga Daioh: Supplementary Lessons. The manga is drawn in a series of vertical four-panel comic strips called yonkoma and depicts the lives of a group of girls during their three years as high-school classmates. The series has been praised for its humor driven by eccentric characters, and Kiyohiko Azuma acclaimed as a \"master of the four-panel form,\" for both his art style and comic timing. It was adapted as an anime television series called Azumanga Daioh: the Animation by J.C.Staff, which aired from the week of April 8, 2002 until the week of September 30, 2002. It was broadcast on the TV Tokyo network and AT-X in five-minute segments every weekday, then rebroadcast as a 25-minute compilation that weekend, for a total of 130 five-minute segments collected in 26 episodes. The compilation episodes were released on DVD and Universal Media Discs by Starchild Records; the five-minute segments can be distinguished by their individual titles. Several soundtrack albums were released, as well as three Azumanga Daioh video games. Featured Crew Hiroshi Nishikiori Creator Kouji Miyoshi Creator Jun Fukuda Creator Takashi Ikehata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomoko Kaneda Chiyo Mihama (Voice) Yuki Matsuoka Ayumu 'Osaka' Kasuga (Voice) Chieko Higuchi Tomo Takino (Voice) Rie Tanaka Koyomi Mizuhara (Voice) Yuu Asakawa Sakaki (Voice) Full Cast & Crew Last Season Season 1 2002 | 26 Episodes Season 1 of Azumanga Daioh premiered on April  7, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  7 Recommendations   1998-04-07 Cardcaptor Sakura 7.5    2008-10-02 Toradora! 7.5    2013-10-04 Kill la Kill 7.7    2007-04-08 Lucky Star 5.0    2006-10-05 Kanon 8.0    2011-01-07 Puella Magi Madoka Magica 7.9    2000-04-26 FLCL 8.1    2006-04-03 The Melancholy of Haruhi Suzumiya 7.6  Facts Original Name  あずまんが大王 THE ANIMATION Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords high school japan animation slice of life Content Score 93 Almost there... Top Contributors 33 Ailurus Fulgens t 25 tmdb983464 8 boy0815 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}