{"link": "https://www.themoviedb.org/tv/66840?language=en", "title": "Bull", "resume": "Dr. Jason Bull is the brilliant, brash, and charming founder of a hugely successful trial consulting firm.", "rate": 66, "genre": ["Crime", "Drama"], "cast": ["Michael Weatherly", "Geneva Carr", "Annabelle Attanasio", "Freddy Rodríguez", "Chris Jackson"], "character": ["Jason Bull", "Marissa Morgan", "Cable McCrory", "Benny Colon", "Chunk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66840   Expand Bull   (2016) User Score  Play Trailer Overview Dr. Jason Bull is the brilliant, brash, and charming founder of a hugely successful trial consulting firm. Featured Crew Paul Attanasio Creator Phil McGraw Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  10 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Weatherly Jason Bull Geneva Carr Marissa Morgan Annabelle Attanasio Cable McCrory Freddy Rodríguez Benny Colon Chris Jackson Chunk Full Cast & Crew Last Season Season 2 2017 | 22 Episodes Season 2 of Bull premiered on September 26, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Renewal Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  10 Recommendations   2017-11-02 S.W.A.T. 6.6    2016-09-23 MacGyver 5.5    2017-09-27 SEAL Team 6.6    2016-09-21 Lethal Weapon 7.3    2015-09-30 Code Black 7.0    2017-10-01 Ten Days in the Valley 6.0    2016-01-07 Shades of Blue 6.2    2015-11-08 Agent X 4.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbs.com/shows/bull Genres Crime Drama Keywords investigation jury psychologist lawyer crime courtroom analysis legal Content Score 100 Yes! Looking good! Top Contributors p 37 plumpro 22 d.a. 21 thomscode 17 david8s95  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}