{"link": "https://www.themoviedb.org/tv/61613?language=en", "title": "Modern Farmer", "resume": "In search of inspiration, rock band “Excellent Souls” — Lee Min Ki, Kang Hyeok, Yoo Han Cheol — goes on hiatus deep in the countryside. To their surprise, the village elder is none other than Kang Yoon Hee, a zippy woman who's not only the town’s first female leader, but also the youngest. She also just so happens to be bandleader Min Ki’s first love. Amidst a rural backdrop, these scrappy rockers take stock of what stirs their passions — both musical and romantic.", "rate": 90, "genre": ["Comedy", "Family"], "cast": ["Lee Hong-gi", "Park Min-woo", "Lee Si-eon", "Kwak Dong-yeon", "Lee Ha-nui"], "character": ["Lee Min-ki", "Kang Hyeok", "Yoo Han-cheol", "Han Ki-joon", "Kang Yoon-hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61613   Expand Modern Farmer   (2014) User Score Overview In search of inspiration, rock band “Excellent Souls” — Lee Min Ki, Kang Hyeok, Yoo Han Cheol — goes on hiatus deep in the countryside. To their surprise, the village elder is none other than Kang Yoon Hee, a zippy woman who's not only the town’s first female leader, but also the youngest. She also just so happens to be bandleader Min Ki’s first love. Amidst a rural backdrop, these scrappy rockers take stock of what stirs their passions — both musical and romantic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Hong-gi Lee Min-ki Park Min-woo Kang Hyeok Lee Si-eon Yoo Han-cheol Kwak Dong-yeon Han Ki-joon Lee Ha-nui Kang Yoon-hee Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Modern Farmer premiered on October 18, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Modern Farmer. You can help by rating TV shows you've seen. Facts Original Name  모던파머 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000004561 Genres Comedy Family Keywords korea Content Score 86 Almost there... Top Contributors M 37 Maria180493 8 Elizabeth Jennings CM 6 Cherche Moi z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}