{"link": "https://www.themoviedb.org/tv/9115?language=en", "title": "Amerika", "resume": "Amerika – suggesting a Russified name for the United States – is an American television miniseries that was broadcast in 1987 on ABC. The miniseries inspired a novelization entitled Amerika: The Triumph of the American Spirit. Amerika starred Kris Kristofferson, Mariel Hemingway, Sam Neill, Robert Urich, and a 17-year-old Lara Flynn Boyle in her first major role. Amerika was about life in the United States after a bloodless takeover engineered by the Soviet Union. Not wanting to depict the actual takeover, ABC Entertainment president Brandon Stoddard set the miniseries ten years after the event, focusing on the demoralized American people a decade after the Soviet conquest. The intent, he later explained, was to explore the American spirit under such conditions, not to portray the conflict of the Soviet coup.\nDescribed in promotional materials as \"the most ambitious American miniseries ever created,\" Amerika aired for 14½ hours over seven nights, and reportedly cost US$40 million to produce. The miniseries was filmed in Toronto, London, Ontario, and Hamilton, Ontario, as well as various locations in Nebraska – most notably the small town of Tecumseh, which served as \"Milford,\" the fictional setting for most of the series. Donald Wrye was the executive producer, director, and writer of Amerika, while composer Basil Poledouris scored the miniseries, ultimately recording eight hours of music – the equivalent of four feature films.", "rate": 52, "genre": ["Drama"], "cast": ["Lara Flynn Boyle", "Kris Kristofferson", "Robert Urich", "Sam Neill", "Wendy Hughes"], "character": ["Jacqueline 'Jessie' Bradford", "Devin Milford", "Peter Bradford", "Colonel Andrei Denisov", "Marion Andrews"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9115   Expand Amerika   (1987) User Score Overview Amerika – suggesting a Russified name for the United States – is an American television miniseries that was broadcast in 1987 on ABC. The miniseries inspired a novelization entitled Amerika: The Triumph of the American Spirit. Amerika starred Kris Kristofferson, Mariel Hemingway, Sam Neill, Robert Urich, and a 17-year-old Lara Flynn Boyle in her first major role. Amerika was about life in the United States after a bloodless takeover engineered by the Soviet Union. Not wanting to depict the actual takeover, ABC Entertainment president Brandon Stoddard set the miniseries ten years after the event, focusing on the demoralized American people a decade after the Soviet conquest. The intent, he later explained, was to explore the American spirit under such conditions, not to portray the conflict of the Soviet coup. Described in promotional materials as \"the most ambitious American miniseries ever created,\" Amerika aired for 14½ hours over seven nights, and reportedly cost US$40 million to produce. The miniseries was filmed in Toronto, London, Ontario, and Hamilton, Ontario, as well as various locations in Nebraska – most notably the small town of Tecumseh, which served as \"Milford,\" the fictional setting for most of the series. Donald Wrye was the executive producer, director, and writer of Amerika, while composer Basil Poledouris scored the miniseries, ultimately recording eight hours of music – the equivalent of four feature films. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lara Flynn Boyle Jacqueline 'Jessie' Bradford Kris Kristofferson Devin Milford Robert Urich Peter Bradford Sam Neill Colonel Andrei Denisov Wendy Hughes Marion Andrews Full Cast & Crew Last Season Season 1 1987 | 11 Episodes Season 1 of Amerika premiered on February 15, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Chilling Open 0 by GForce59\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Amerika. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  870m Homepage  - Genres Drama Keywords cold war Content Score 86 Almost there... Top Contributors TB 20 TMDb Bot f 5 flimmerix S 1 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}