{"link": "https://www.themoviedb.org/tv/64760?language=en", "title": "Fungus the Bogeyman", "resume": "An adaptation of Raymond Briggs' children's classic that mixes live action and CGI animation to follow the adventures of a family of green monsters who live in the slimy underground world of Bogeydom. Fungus and his wife Mildew suspect their son Mould is illicitly dabbling in human culture, sparking a family argument that sees the boy flee to the surface. Above ground in Daventry, Daryl Hedge's go-getting wife Wendy won't let him forget it that he is unemployed, while his daughter Lucy has fallen for a disagreeable older boy called Dean.", "rate": 75, "genre": ["Drama", "Family"], "cast": ["Timothy Spall", "Victoria Wood", "Keeley Hawes", "Fern Deacon", "Paul Kaye"], "character": ["Fungus", "Eve", "Wendy Snow", "Lucy", "The Bogeyhunter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64760   Expand Fungus the Bogeyman   (2015) User Score  Play Trailer Overview An adaptation of Raymond Briggs' children's classic that mixes live action and CGI animation to follow the adventures of a family of green monsters who live in the slimy underground world of Bogeydom. Fungus and his wife Mildew suspect their son Mould is illicitly dabbling in human culture, sparking a family argument that sees the boy flee to the surface. Above ground in Daventry, Daryl Hedge's go-getting wife Wendy won't let him forget it that he is unemployed, while his daughter Lucy has fallen for a disagreeable older boy called Dean. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Timothy Spall Fungus Victoria Wood Eve Keeley Hawes Wendy Snow Fern Deacon Lucy Paul Kaye The Bogeyhunter Full Cast & Crew Last Season Season 1 2015 | 3 Episodes Season 1 of Fungus the Bogeyman premiered on December 27, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Fungus the Bogeyman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Miniseries Original Language  English Runtime  30m Homepage  - Genres Drama Family Keywords monster based on children's book Content Score 93 Almost there... Top Contributors 36 Elizabeth Jennings 7 Banana R 3 Rebecca 3 Conny  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}