{"link": "https://www.themoviedb.org/tv/56578?language=en", "title": "Selling Houses Australia", "resume": "Selling Houses Australia is an Australian TV show, based on the British show of the same name. The series follows property owners who are having difficulty selling their home. The show is hosted by property expert Andrew Winter, who is joined by landscaper, Charlie Albone, and interior designer, Shaynna Blaze. The team initially assess the property, and then proceed with a renovation to boost the property's appeal and salability. The property is then put up for sale and the result is shown at the end of each episode.\nIn 2009 and 2010, the show won the ASTRA Awards for most outstanding lifestyle program and the viewers favourite program. The show is nominated at the 2013 Logie Awards for Most Popular Lifestyle Program.", "rate": 70, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56578   Expand Selling Houses Australia   (2008) User Score Overview Selling Houses Australia is an Australian TV show, based on the British show of the same name. The series follows property owners who are having difficulty selling their home. The show is hosted by property expert Andrew Winter, who is joined by landscaper, Charlie Albone, and interior designer, Shaynna Blaze. The team initially assess the property, and then proceed with a renovation to boost the property's appeal and salability. The property is then put up for sale and the result is shown at the end of each episode. In 2009 and 2010, the show won the ASTRA Awards for most outstanding lifestyle program and the viewers favourite program. The show is nominated at the 2013 Logie Awards for Most Popular Lifestyle Program. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Selling Houses Australia. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}