{"link": "https://www.themoviedb.org/tv/62742?language=en", "title": "Sankarea: Undying Love", "resume": "Zombie-obsessed Furuya is making a potion to reanimate his dead cat when he meets Rea. She’s about as miserable as a girl can get, thanks to her creepy, domineering father. When the pain becomes too much, she tries to commit suicide with a sip of Furuya’s weird elixir. The potion doesn’t kill her – but it does turn her into a zombie after she falls from a cliff.\nNow that Rea’s undead and ready to finally live, she hides out with Furuya, who’s always dreamed of having a zombie girlfriend. Their one-of-a-kind relationship comes with some challenges, like the fact that Rea is decomposing. Even worse, her freak-show dad is dangerously determined to get her back under his control. As Furuya fights to keep his ghoulfriend safe, Rea finds the secret to resurrecting her happiness: Live like you’re dying – even if you’re already dead.", "rate": 73, "genre": ["Animation", "Comedy", "Drama", "Romance"], "cast": ["Saori Hayashi", "Shuuhei Iwase", "Mayumi Asano", "Maaya Uchida", "Ryohei Kimura"], "character": ["Mogi", "Yasutaka", "Aria Sanka", "Rea Sanka", "Chihiro Furuya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62742   Expand Sankarea: Undying Love   (2012) User Score Overview Zombie-obsessed Furuya is making a potion to reanimate his dead cat when he meets Rea. She’s about as miserable as a girl can get, thanks to her creepy, domineering father. When the pain becomes too much, she tries to commit suicide with a sip of Furuya’s weird elixir. The potion doesn’t kill her – but it does turn her into a zombie after she falls from a cliff. Now that Rea’s undead and ready to finally live, she hides out with Furuya, who’s always dreamed of having a zombie girlfriend. Their one-of-a-kind relationship comes with some challenges, like the fact that Rea is decomposing. Even worse, her freak-show dad is dangerously determined to get her back under his control. As Furuya fights to keep his ghoulfriend safe, Rea finds the secret to resurrecting her happiness: Live like you’re dying – even if you’re already dead. Featured Crew Mitsuru Hattori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saori Hayashi Mogi Shuuhei Iwase Yasutaka Mayumi Asano Aria Sanka Maaya Uchida Rea Sanka Ryohei Kimura Chihiro Furuya Full Cast & Crew Last Season Season 1 2012 | 15 Episodes Season 1 of Sankarea: Undying Love premiered on April  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2006-10-04 Negima!? Magister Negi Magi 5.9    2011-04-14 Aria the Scarlet Ammo 6.4    2007-04-13 Stigma of the Wind 8.1    2005-01-06 Negima! Magister Negi Magi 6.7    2009-04-02 Phantom: Requiem for the Phantom 6.4    2009-10-05 Heaven's Lost Property 5.3    2012-04-08 Dusk Maiden of Amnesia 7.6    2006-04-04 Air Gear 5.3  Facts Original Name  さんかれあ Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.funimation.com/shows/sankarea/home Genres Animation Comedy Drama Romance Keywords harem tragedy zombie ecchi anime fan service Content Score 93 Almost there... Top Contributors 54 WillofOwn R 11 Rebecca s 5 schmidt0412 5 therayox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}