{"link": "https://www.themoviedb.org/tv/64900?language=en", "title": "Hangar 1: The UFO Files", "resume": "Delve deep into a vast archive of over 70,000 UFO files gathered over nearly half a century in Hangar 1. MUFON, an independent organization dedicated to investigating UFOs, has compiled these archives looking for connections, clues, and evidence to find the truth about UFOs.", "rate": 66, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64900   Expand Hangar 1: The UFO Files   (2014) User Score Overview Delve deep into a vast archive of over 70,000 UFO files gathered over nearly half a century in Hangar 1. MUFON, an independent organization dedicated to investigating UFOs, has compiled these archives looking for connections, clues, and evidence to find the truth about UFOs. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2015 | 12 Episodes Season 2 of Hangar 1: The UFO Files premiered on April 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2012-03-27 NASA's Unexplained Files 7.7    2012-01-21 America's Book of Secrets 4.8    2015-01-17 Monsters and Mysteries in America 5.8    2015-01-09 UFOs Declassified 7.3    2008-01-30 UFO Hunters 6.2    2011-06-27 Doomsday Preppers 4.5    2007-06-06 Destination Truth 7.6    2015-01-08 Expedition Unknown 7.8  Facts Status  Ended Networks - Certification  - Type  Documentary Original Language  English Runtime  - Homepage   http://www.history.com/shows/hangar-1-the-ufo-files Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors p 13 pisoni 11 pixelight 6 Elizabeth Jennings Y 5 YRV  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}