{"link": "https://www.themoviedb.org/tv/78742?language=en", "title": "About Time", "resume": "Our heroine will have the unfortunate ability to see the “life clocks” of everyone around her, including herself, and the hero will somehow be able to stop her “time” without lifting a finger. This story will follow time that is stopped, extended, and even erased through the love they have for each other.", "rate": 60, "genre": ["Drama"], "cast": ["Lee Sung-kyung", "Lee Sang-yoon", "Im Se-Mi", "Han Seung-yeon", "Ro Woon"], "character": ["Choi Michaela", "Lee Do-Ha", "Bae Soo-Bong", "Jeon Sung-Hee", "Choi Wi-Jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78742   Expand About Time   (2018) User Score  Play Trailer Overview Our heroine will have the unfortunate ability to see the “life clocks” of everyone around her, including herself, and the hero will somehow be able to stop her “time” without lifting a finger. This story will follow time that is stopped, extended, and even erased through the love they have for each other. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Sung-kyung Choi Michaela Lee Sang-yoon Lee Do-Ha Im Se-Mi Bae Soo-Bong Han Seung-yeon Jeon Sung-Hee Ro Woon Choi Wi-Jin Full Cast & Crew Current Season Season 1 2018 | 16 Episodes Season 1 of About Time premiered on May 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on About Time. You can help by rating TV shows you've seen. Facts Original Name  멈추고 싶은 순간: 어바웃타임 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/abouttime Genres Drama Keywords fantasy romance Content Score 93 Almost there... Top Contributors M 29 Maria180493 16 Chelsea 6 Otgoo 4 lys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}