{"link": "https://www.themoviedb.org/tv/45282?language=en", "title": "Inu x Boku Secret Service", "resume": "Protected by the highest security, the Maison de Ayakashi is rumored to be haunted, where only eccentrics could live. In reality, it is a place for humans with non-human ancestors to live. The socially-inept Ririchiyo has come here to improve herself. She meets secret service bodyguard Soushi, who is assigned to protect residents. He has a request of her: \"Please make me your dog.\"", "rate": 0, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Kana Hanazawa", "Mamoru Miyano", "Tomokazu Sugita", "Yuichi Nakamura", "Rina Hidaka"], "character": ["Sōshi Miketsukami"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45282   Expand Inu x Boku Secret Service   (2012) User Score Overview Protected by the highest security, the Maison de Ayakashi is rumored to be haunted, where only eccentrics could live. In reality, it is a place for humans with non-human ancestors to live. The socially-inept Ririchiyo has come here to improve herself. She meets secret service bodyguard Soushi, who is assigned to protect residents. He has a request of her: \"Please make me your dog.\" Featured Crew Naokatsu Tsuda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Mamoru Miyano Tomokazu Sugita Yuichi Nakamura Sōshi Miketsukami Rina Hidaka Full Cast & Crew Last Season Season 1 2012 | 12 Episodes Season 1 of Inu x Boku Secret Service premiered on January 12, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Inu x Boku Secret Service. You can help by rating TV shows you've seen. Facts Original Name  妖狐×僕SS Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Drama Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 7 tmdb983464 5 yoshizuka 4 Mikedeth5 4 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}