{"link": "https://www.themoviedb.org/tv/75191?language=en", "title": "The Terror", "resume": "The crew of a Royal Naval expedition searching for the Arctic's treacherous Northwest Passage discovers instead a monstrous predator.", "rate": 78, "genre": ["Drama", "Mystery"], "cast": ["Jared Harris", "Ciarán Hinds", "Tobias Menzies", "Paul Ready", "Adam Nagaitis"], "character": ["Captain Francis Crozier", "Sir John Franklin", "Captain James Fitzjames", "Doctor Henry Goodsir", "Cornelius Hickey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75191   Expand The Terror   (2018) User Score  Play Trailer Overview The crew of a Royal Naval expedition searching for the Arctic's treacherous Northwest Passage discovers instead a monstrous predator. Featured Crew Edward Berger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  8 Posters  12 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  2 Opening Credits  0 Top Billed Cast Jared Harris Captain Francis Crozier Ciarán Hinds Sir John Franklin Tobias Menzies Captain James Fitzjames Paul Ready Doctor Henry Goodsir Adam Nagaitis Cornelius Hickey Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of The Terror premiered on March 26, 2018. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply So, any ideas for season 2 Open 0 by D-magic\n      \n     So this was shot on a Croatian island Open 0 by globalistas\n      \n     m Book vs. Show Question Open 1 by  globalistas Go to Discussions Media Most Popular Videos  4 Backdrops  8 Posters  12 Recommendations   2018-03-29 Siren 7.3    2017-10-13 Lore 6.1    2018-03-18 Instinct 5.9    2018-04-02 The Crossing 7.8    2018-05-04 The Rain 6.1    2017-06-30 Gypsy 6.0    2018-05-30 Reverie 7.0    2018-01-22 The Alienist 7.1  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  47m Homepage   http://www.amc.com/shows/the-terror Genres Drama Mystery Keywords expedition shaman polar deadly disease inuits Content Score 100 Yes! Looking good! Top Contributors 78 Elizabeth Jennings 12 oligoboli 11 express 8 Ander33x  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}