{"link": "https://www.themoviedb.org/tv/21624?language=en", "title": "Call of the Wild", "resume": "Call of the Wild is an adventure television series based on the best-selling novel of the same title by author Jack London. It was shown on Animal Planet. The thirteen episodes of Call of the Wild would later be released on DVD into 120 minute full length movie.", "rate": 70, "genre": ["Family", "Action", "Adventure"], "cast": ["Nick Mancuso", "Shane Meier", "Rachel Hayward", "Amber McWilliams", "William MacDonald"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21624   Expand Call of the Wild   (2000) User Score Overview Call of the Wild is an adventure television series based on the best-selling novel of the same title by author Jack London. It was shown on Animal Planet. The thirteen episodes of Call of the Wild would later be released on DVD into 120 minute full length movie. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nick Mancuso Shane Meier Rachel Hayward Amber McWilliams William MacDonald Full Cast & Crew Last Season Season 1 2000 | 13 Episodes Season 1 of Call of the Wild premiered on March 31, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Call of the Wild. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Family Action & Adventure Keywords canada 19th century northern canada Content Score 71 Just a little bit more... Top Contributors 9 Banana s 3 speedycars G 1 Gosia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}