{"link": "https://www.themoviedb.org/tv/68083?language=en", "title": "Swords of Legends", "resume": "Set during the Tang Dynasty, a young and quiet swordsman name Baili Tusu is infected by the aura of an ancient demonic sword known as the Sword of Burning Solitude. Living with the dark energy, he grew up without family. Until one day, he meets a friendly girl Feng Qingxue along with a group of heroes, and together they wander the land to seek out destiny and bring balance to the world.", "rate": 68, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Li Yifeng", "Yang Mi", "Qiao Zhenyu", "Ma Tianyu", "Zheng Shuang"], "character": ["Baili Tusu / Han Yun Xi", "Feng Qing Xue", "Ouyang Shaogong", "Fang Lan Sheng / Jin Lei", "Xiang Ling"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68083   Expand Swords of Legends   (2014) User Score Overview Set during the Tang Dynasty, a young and quiet swordsman name Baili Tusu is infected by the aura of an ancient demonic sword known as the Sword of Burning Solitude. Living with the dark energy, he grew up without family. Until one day, he meets a friendly girl Feng Qingxue along with a group of heroes, and together they wander the land to seek out destiny and bring balance to the world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Li Yifeng Baili Tusu / Han Yun Xi Yang Mi Feng Qing Xue Qiao Zhenyu Ouyang Shaogong Ma Tianyu Fang Lan Sheng / Jin Lei Zheng Shuang Xiang Ling Full Cast & Crew Last Season Season 1 2014 | 52 Episodes Season 1 of Swords of Legends premiered on July  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Swords of Legends. You can help by rating TV shows you've seen. Facts Original Name  古剑奇谭 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords romance xianxia Content Score 86 Almost there... Top Contributors M 51 Maria180493 k 3 khyungil TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}