{"link": "https://www.themoviedb.org/tv/44844?language=en", "title": "Playhouse Presents", "resume": "Playhouse Presents is a series of self-contained TV plays, made by British broadcaster Sky Arts. The series started airing on 12 April 2012, on Sky Arts 1. Each episode is written by a different writer and stars a different cast.\nThe four-part adaptation of A Country Doctor's Notebook was also broadcast on the strand in December 2012.\nSky Arts have announced that they are ordering a five-part spin-off of the third play, Nixon’s The One. They say the full cast, including Harry Shearer as Nixon and Henry Goodman as Kissinger, will return for the series run, which will be filmed in September 2012. The series will broadcast in 2013.\nThe second series began airing in April 2013 featuring Kathy Burke, Frances Barber, Julia Davis, Idris Elba, Anna Friel, Rebecca Front, Stephen Graham, David Harewood, Ian Hart, Sharon Horgan, Mathew Horne, Suranne Jones, Kylie Minogue, Vanessa Redgrave, Peter Serafinowicz, Matt Smith, Johnny Vegas, Marc Warren, Jack Whitehall and Reggie Yates.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44844   Expand Playhouse Presents   (2012) User Score Overview Playhouse Presents is a series of self-contained TV plays, made by British broadcaster Sky Arts. The series started airing on 12 April 2012, on Sky Arts 1. Each episode is written by a different writer and stars a different cast. The four-part adaptation of A Country Doctor's Notebook was also broadcast on the strand in December 2012. Sky Arts have announced that they are ordering a five-part spin-off of the third play, Nixon’s The One. They say the full cast, including Harry Shearer as Nixon and Henry Goodman as Kissinger, will return for the series run, which will be filmed in September 2012. The series will broadcast in 2013. The second series began airing in April 2013 featuring Kathy Burke, Frances Barber, Julia Davis, Idris Elba, Anna Friel, Rebecca Front, Stephen Graham, David Harewood, Ian Hart, Sharon Horgan, Mathew Horne, Suranne Jones, Kylie Minogue, Vanessa Redgrave, Peter Serafinowicz, Matt Smith, Johnny Vegas, Marc Warren, Jack Whitehall and Reggie Yates. Featured Crew Stanley Kutler Creator Harry Shearer Creator Kate Hardie Creator Grayson Perry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2014 | 8 Episodes Season 3 of Playhouse Presents premiered on May  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Playhouse Presents. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 56 Steve T 6 Torq00 3 lineker s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}