{"link": "https://www.themoviedb.org/tv/64198?language=en", "title": "Blaze and the Monster Machines", "resume": "AJ is an 8-year-old techie who drives monster-truck Blaze, the top racer in Axle City. The two go on adventures that have them taking on problems involving science and math. Many predicaments they face are caused by Blaze's rival, Crusher, a tractor-trailer that will do anything to beat other vehicles to the finish line. The animated series is billed as the first TV show for preschoolers to comprehensively cover areas of science, technology, engineering and math. Each episode introduces different STEM concepts, including buoyancy and trajectory.", "rate": 60, "genre": ["Animation", "Kids"], "cast": ["Nolan North", "Angelina Wahler", "James Patrick Stuart", "Sunil Malhotra", "Kate Higgins"], "character": ["Blaze", "Gabby", "Zeg", "Stripes", "Starla"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64198   Expand Blaze and the Monster Machines   (2014) User Score Overview AJ is an 8-year-old techie who drives monster-truck Blaze, the top racer in Axle City. The two go on adventures that have them taking on problems involving science and math. Many predicaments they face are caused by Blaze's rival, Crusher, a tractor-trailer that will do anything to beat other vehicles to the finish line. The animated series is billed as the first TV show for preschoolers to comprehensively cover areas of science, technology, engineering and math. Each episode introduces different STEM concepts, including buoyancy and trajectory. Featured Crew Ellen Martin Creator Jeff Borkin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nolan North Blaze Angelina Wahler Gabby James Patrick Stuart Zeg Sunil Malhotra Stripes Kate Higgins Starla Full Cast & Crew Current Season Season 4 2018 | 6 Episodes Season 4 of Blaze and the Monster Machines premiered on March 26, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Blaze and the Monster Machines. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.nickjr.com/blaze-and-the-monster-machines/ Genres Animation Kids Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 22 Elizabeth Jennings 20 Mike Whitcombe 6 Евгений A 6 Angyl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}