{"link": "https://www.themoviedb.org/tv/34836?language=en", "title": "Princess Resurrection", "resume": "Princess Resurrection is a Japanese horror comedy manga by Yasunori Mitsunaga. The manga was serialized monthly in Monthly Shōnen Sirius magazine and published by Kodansha. A 26-episode anime series by Madhouse aired on TBS in 2007. Both the manga and anime are available in North America with the manga licensed by Del Rey Manga and the anime licensed by Sentai Filmworks and available on the Anime Network website. A new OVA series has been made by Tatsunoko Production with the first episode released in December 2010, along with the 13th volume of the manga, the second episode for the 14th volume, and the third episode for the 16th volume. A spin-off manga, Naqua-Den, which stars a side-character from Princess Resurrection as the main character, was released in 2012 currently with two volumes.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Rika Morinaga", "Shiho Kawaragi", "Ayako Kawasumi", "Mamiko Noto", "Fuyuka Ono"], "character": ["Francesca", "Flandre", "Hime", "Reiri Kamura", "Hiro Hiyorimi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34836   Expand Princess Resurrection   (2007) User Score Overview Princess Resurrection is a Japanese horror comedy manga by Yasunori Mitsunaga. The manga was serialized monthly in Monthly Shōnen Sirius magazine and published by Kodansha. A 26-episode anime series by Madhouse aired on TBS in 2007. Both the manga and anime are available in North America with the manga licensed by Del Rey Manga and the anime licensed by Sentai Filmworks and available on the Anime Network website. A new OVA series has been made by Tatsunoko Production with the first episode released in December 2010, along with the 13th volume of the manga, the second episode for the 14th volume, and the third episode for the 16th volume. A spin-off manga, Naqua-Den, which stars a side-character from Princess Resurrection as the main character, was released in 2012 currently with two volumes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rika Morinaga Francesca Shiho Kawaragi Flandre Ayako Kawasumi Hime Mamiko Noto Reiri Kamura Fuyuka Ono Hiro Hiyorimi Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of Princess Resurrection premiered on April 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Princess Resurrection. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://kc.kodansha.co.jp/kaibutsu/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 yoshizuka m 3 magoozin 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}