{"link": "https://www.themoviedb.org/tv/71411?language=en", "title": "El Chapo", "resume": "A look at the life of notorious drug kingpin, El Chapo, from his early days in the 1980s working for the Guadalajara Cartel, to his rise to power of during the '90s and his ultimate downfall in 2016.", "rate": 73, "genre": ["Drama"], "cast": ["Marco de la O", "Valentina Acosta", "Juan Carlos Olivas", "Humberto Busto", "Alejandro Aguilar"], "character": ["Joaquin 'El Chapo' Guzman", "Alejandra", "El Güero", "Don Sol", "Toño"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71411   Expand El Chapo   (2017) User Score Overview A look at the life of notorious drug kingpin, El Chapo, from his early days in the 1980s working for the Guadalajara Cartel, to his rise to power of during the '90s and his ultimate downfall in 2016. Featured Crew Silvana Aguirre Zegarra Creator Daniel Posada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  4 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marco de la O Joaquin 'El Chapo' Guzman Valentina Acosta Alejandra Juan Carlos Olivas El Güero Humberto Busto Don Sol Alejandro Aguilar Toño Full Cast & Crew Last Season Season 2 2017 | 12 Episodes Season 2 of El Chapo premiered on September 16, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Anybody seen it yet? Open 0 by Benedict\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2017-02-08 Alias J.J. 7.8    2017-01-10 The Frozen Dead 6.6    2017-12-22 The Toys That Made Us 7.5    2017-10-06 Suburra: Blood on Rome 7.5    2014-05-06 Gomorrah 7.8    2017-06-15 Riviera 5.4    2017-06-30 Gypsy 6.0    2012-06-26 Line of Duty 8.0  Facts Status  Returning Series Network Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Scripted Original Language  Spanish; Castilian Runtime  55m Homepage   http://www.univision.com/series/el-chapo Genres Drama Keywords drugs drug lord kingpin cartel mexican cartel Content Score 100 Yes! Looking good! Top Contributors 45 Elizabeth Jennings 12 Zorro1 k 9 klaus064 9 Ander33x  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}