{"link": "https://www.themoviedb.org/tv/7634?language=en", "title": "Lost Worlds", "resume": "Lost Worlds is a documentary television series by The History Channel that explores a variety of \"lost\" locations from ancient to modern times. These \"great feats of engineering, technology, and culture\" are revealed through the use of archaeological evidence, interviews with relevant experts while examining the sites, and CGI reproductions. These visual re-creations take the form of rendered 3D environments and photo manipulated overlays, allowing the \"lost world\" to be seen over its present-day state.\nThe pilot episode \"Palenque: Metropolis of the Maya\" was first aired on April 4, 2005. It was followed by 12 more episodes in 2006, and a further 19 episodes in 2007.", "rate": 0, "genre": ["Documentary"], "cast": ["Corey Lawson", "David Robb"], "character": ["Narrator", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7634   Expand Lost Worlds   (2006) User Score Overview Lost Worlds is a documentary television series by The History Channel that explores a variety of \"lost\" locations from ancient to modern times. These \"great feats of engineering, technology, and culture\" are revealed through the use of archaeological evidence, interviews with relevant experts while examining the sites, and CGI reproductions. These visual re-creations take the form of rendered 3D environments and photo manipulated overlays, allowing the \"lost world\" to be seen over its present-day state. The pilot episode \"Palenque: Metropolis of the Maya\" was first aired on April 4, 2005. It was followed by 12 more episodes in 2006, and a further 19 episodes in 2007. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Corey Lawson Narrator David Robb Narrator Full Cast & Crew Last Season Season 2 2007 | 19 Episodes Season 2 of Lost Worlds premiered on August  1, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Lost Worlds. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  120m, 60m Homepage   http://www.atlanticproductions.tv/?s=lost+worlds Genres Documentary Keywords history Content Score 56 We're so close, yet so far. Top Contributors 25 waaw  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}