{"link": "https://www.themoviedb.org/tv/61669?language=en", "title": "Dear Sister", "resume": "Growing up, sisters Misaki and Hazuki couldn't have been more different. Misaki's charming personality and popularity stood in sharp contrast to the older, more responsible yet timid Hazuki. After high school, the two lose touch once Misaki leaves their home, only to be reunited many years later, when Misaki returns, harboring a secret.", "rate": 83, "genre": ["Comedy"], "cast": ["Satomi Ishihara", "Nao Matsushita", "Takanori Iwata", "Hiroyuki Hirayama"], "character": ["Misaki Fukazawa", "Hazuki Fukazawa", "Eito", "Yohei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61669   Expand Dear Sister   (2014) User Score Overview Growing up, sisters Misaki and Hazuki couldn't have been more different. Misaki's charming personality and popularity stood in sharp contrast to the older, more responsible yet timid Hazuki. After high school, the two lose touch once Misaki leaves their home, only to be reunited many years later, when Misaki returns, harboring a secret. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Satomi Ishihara Misaki Fukazawa Nao Matsushita Hazuki Fukazawa Takanori Iwata Eito Hiroyuki Hirayama Yohei Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Dear Sister premiered on October 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dear Sister. You can help by rating TV shows you've seen. Facts Original Name  ディア・シスター Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  60m, 54m Homepage   http://www.fujitv.co.jp/dearsister Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors C 25 Chintaran 13 Elizabeth Jennings CM 4 Cherche Moi z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}