{"link": "https://www.themoviedb.org/tv/45016?language=en", "title": "The Bridge", "resume": "When a body is found on the bridge between Denmark and Sweden, right on the border, Danish inspector Martin Rohde and Swedish Saga Norén have to share jurisdiction and work together to find the killer.", "rate": 80, "genre": ["Crime", "Mystery"], "cast": ["Sofia Helin", "Thure Lindhardt", "Mikael Birkkjær", "Sarah Boberg", "Selma Modéer Wiking"], "character": ["Saga Norén", "Henrik", "Jonas", "Lillian", "Astrid"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45016   Expand The Bridge   (2011) User Score  Play Trailer Overview When a body is found on the bridge between Denmark and Sweden, right on the border, Danish inspector Martin Rohde and Swedish Saga Norén have to share jurisdiction and work together to find the killer. Featured Crew Hans Rosenfeldt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  11 Posters  10 Videos Trailers  4 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sofia Helin Saga Norén Thure Lindhardt Henrik Mikael Birkkjær Jonas Sarah Boberg Lillian Selma Modéer Wiking Astrid Full Cast & Crew Current Season Season 4 2018 | 8 Episodes Season 4 of The Bridge premiered on January  1, 2018. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply SB Season 4 Open 0 by Strange Bedfellows\n      \n     m Is this entirely in Swedish? Open 0 by microscope\n      \n     S Season 4 - Anytime soon? Open 2 by  Viktor Andersson Go to Discussions Media Most Popular Videos  4 Backdrops  11 Posters  10 Recommendations   2007-01-07 The Killing 8.0    2010-09-26 Borgen 8.0    2013-03-04 Broadchurch 8.1    2010-05-04 Luther 7.9    2011-04-03 The Killing 7.5    2013-05-12 The Fall 7.6    2012-06-26 Line of Duty 8.0    2013-01-15 Utopia 8.0  Facts Original Name  Bron/Broen Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Swedish Runtime  60m Homepage   http://www.svt.se/bron/ Genres Crime Mystery Keywords police denmark copenhagen detective sweden bridge female protagonist female detective murder investigation nordic noir scandinavian malmö Content Score 100 Yes! Looking good! Top Contributors 47 Steve TN 37 The Night's Watch 25 spaceship broken v 20 veboli  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}