{"link": "https://www.themoviedb.org/tv/11548?language=en", "title": "Nichols", "resume": "Nichols is an American Western television series starring James Garner broadcast in the United States on NBC during the 1971-72 season. Set the fictional town of Nichols, Arizona, in 1914, Nichols differed from traditional Western series of the era. The main character, a sheriff, rode on a motorcycle and in an automobile rather than on the traditional horse. The hero did not carry a firearm and was generally opposed to the use of violence to solve problems, preferring other means. Margot Kidder portrayed Ruth, the love interest/barmaid of Nichols.", "rate": 0, "genre": ["Western"], "cast": ["Margot Kidder", "James Garner", "John Beck", "Stuart Margolin", "Neva Patterson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11548   Expand Nichols   (1971) User Score  Play Trailer Overview Nichols is an American Western television series starring James Garner broadcast in the United States on NBC during the 1971-72 season. Set the fictional town of Nichols, Arizona, in 1914, Nichols differed from traditional Western series of the era. The main character, a sheriff, rode on a motorcycle and in an automobile rather than on the traditional horse. The hero did not carry a firearm and was generally opposed to the use of violence to solve problems, preferring other means. Margot Kidder portrayed Ruth, the love interest/barmaid of Nichols. Featured Crew Frank Pierson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Margot Kidder James Garner John Beck Stuart Margolin Neva Patterson Full Cast & Crew Last Season Season 1 1971 | 24 Episodes Season 1 of Nichols premiered on September 16, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nichols. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Keywords sheriff ex soldier 1910s Content Score 100 Yes! Looking good! Top Contributors 8 Banana 3 Steve TB 2 TMDb Bot S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}