{"link": "https://www.themoviedb.org/tv/72459?language=en", "title": "My Sweet Lavender", "resume": "Tells Laila, a 25-year-old woman to work as an insurance officer and is creating a name in the industry. He has a lover named Danish, son of Datuk Azman, a well-known corporate figure.\nDespite being in love with her, Danish is also linked to a businessman named Sara so far as to make Laila uncomfortable with this situation.\nSara is good at picking up the Danish heart of a Danish mother named Datin Salmah. For Datin Salmah, Sara is the most suitable son-in-law even though her husband, Datuk Azman, doubts Sara's heartbeat. For Datuk Azman, Sara may have a bigger agenda and use Danish to achieve his dreams.\nRumors of Sara and Danish tensions led to Laila feeling depressed. To get rid of stress, Laila wanted to find a momentary peace of duty for three days in Kuala Pilah. On the way there, Laila was involved in an accident and caused the death of a woman named Kalsom. This tragedy has changed her life.\nTwo weeks passed and Laila realized with certainty he lost memory. When asked, he heard the voice of a man saying that his wife Laila and mother of three her children named Aishah, 17 years old, Muhammad 10 years old and Yusof 7 years old. What is Laila's reaction?", "rate": 0, "genre": ["Drama"], "cast": ["Adi Putra", "Zara Zya", "Aeril Zafrel", "Nadia Brian"], "character": ["Amirul", "Laila", "Danish", "Sara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72459   Expand My Sweet Lavender   (2017) User Score Overview Tells Laila, a 25-year-old woman to work as an insurance officer and is creating a name in the industry. He has a lover named Danish, son of Datuk Azman, a well-known corporate figure. Despite being in love with her, Danish is also linked to a businessman named Sara so far as to make Laila uncomfortable with this situation. Sara is good at picking up the Danish heart of a Danish mother named Datin Salmah. For Datin Salmah, Sara is the most suitable son-in-law even though her husband, Datuk Azman, doubts Sara's heartbeat. For Datuk Azman, Sara may have a bigger agenda and use Danish to achieve his dreams. Rumors of Sara and Danish tensions led to Laila feeling depressed. To get rid of stress, Laila wanted to find a momentary peace of duty for three days in Kuala Pilah. On the way there, Laila was involved in an accident and caused the death of a woman named Kalsom. This tragedy has changed her life. Two weeks passed and Laila realized with certainty he lost memory. When asked, he heard the voice of a man saying that his wife Laila and mother of three her children named Aishah, 17 years old, Muhammad 10 years old and Yusof 7 years old. What is Laila's reaction? Featured Crew Azmi Hatta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adi Putra Amirul Zara Zya Laila Aeril Zafrel Danish Nadia Brian Sara Full Cast & Crew Last Season Season 1 2017 | 1 Episode Season 1 of My Sweet Lavender premiered on June  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Sweet Lavender. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Malay Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 18 CyberTech 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}