{"link": "https://www.themoviedb.org/tv/43207?language=en", "title": "The IT Crowd", "resume": "The IT Crowd was to be a sitcom based on the British series of the same name and adapted for U.S. audiences. The show was picked up for a midseason debut in 2008, but was later pushed back. On September 13 2007, it was reported that NBC pulled the plug on the show.", "rate": 60, "genre": ["Comedy"], "cast": ["Joel McHale", "Richard Ayoade", "Rocky Carroll"], "character": ["Roy", "Moss"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43207   Expand The IT Crowd   (2007) User Score Overview The IT Crowd was to be a sitcom based on the British series of the same name and adapted for U.S. audiences. The show was picked up for a midseason debut in 2008, but was later pushed back. On September 13 2007, it was reported that NBC pulled the plug on the show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joel McHale Roy Richard Ayoade Moss Rocky Carroll Full Cast & Crew  Create Episode Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for The IT Crowd. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2015-08-25 Vixen 7.1    2002-01-08 Full Metal Panic! 6.6    2006-10-16 Frisky Dingo 8.1  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.nbc.com/Fall_Preview/The_IT_Crowd/ Genres Comedy Keywords computer nerd geek sitcom Content Score 56 We're so close, yet so far. Top Contributors 12 Banana 5 Elizabeth Jennings C 4 Cataloguer g 2 gersey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}