{"link": "https://www.themoviedb.org/tv/18548?language=en", "title": "PitchMen", "resume": "PitchMen is a docudrama television program produced for the Discovery Channel in the United States. The show followed infomercial producers and talent Billy Mays and Anthony \"Sully\" Sullivan as they attempted to sell various inventions through direct-response marketing, mainly through Telebrands, one of the largest direct response/infomercial companies. The series was narrated by Thom Beers. Each episode typically focused on two different products.", "rate": 80, "genre": ["Documentary"], "cast": ["Billy Mays", "Thom Beers", "Anthony Sullivan"], "character": ["Himself - Host", "Himself - Narrator", "Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18548   Expand PitchMen   (2009) User Score Overview PitchMen is a docudrama television program produced for the Discovery Channel in the United States. The show followed infomercial producers and talent Billy Mays and Anthony \"Sully\" Sullivan as they attempted to sell various inventions through direct-response marketing, mainly through Telebrands, one of the largest direct response/infomercial companies. The series was narrated by Thom Beers. Each episode typically focused on two different products. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy Mays Himself - Host Thom Beers Himself - Narrator Anthony Sullivan Himself - Host Full Cast & Crew Last Season Season 2 2010 | 10 Episodes Season 2 of PitchMen premiered on August 19, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on PitchMen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  60m, 43m Homepage   http://dsc.discovery.com/tv/pitchmen/pitchmen.html Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}