{"link": "https://www.themoviedb.org/tv/39358?language=en", "title": "Revenge", "resume": "When Emily Thorne moves to the Hamptons, everyone wonders about the new girl, but she knows everything about them, including what they did to her family. Years ago, they took everything from her. Now, one by one, she's going to make them pay.", "rate": 69, "genre": ["Drama", "Mystery"], "cast": ["Emily VanCamp", "Madeleine Stowe", "Joshua Bowman", "Nick Wechsler", "Gabriel Mann"], "character": ["Emily Thorne", "Victoria Grayson", "Daniel Grayson", "Jack Porter", "Nolan Ross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39358   Expand Revenge   (2011) User Score  Play Trailer Overview When Emily Thorne moves to the Hamptons, everyone wonders about the new girl, but she knows everything about them, including what they did to her family. Years ago, they took everything from her. Now, one by one, she's going to make them pay. Featured Crew Mike Kelley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  15 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emily VanCamp Emily Thorne Madeleine Stowe Victoria Grayson Joshua Bowman Daniel Grayson Nick Wechsler Jack Porter Gabriel Mann Nolan Ross Full Cast & Crew Last Season Season 4 2014 | 23 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply T Good Series Open 0 by TheBayHarborButcher\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  11 Recommendations   2008-09-07 True Blood 7.1    2011-09-13 Ringer 5.9    2009-10-23 White Collar 7.7    2013-09-16 Sleepy Hollow 6.4    2012-09-17 Revolution 6.0    2013-10-06 Witches of East End 6.6    2008-09-23 The Mentalist 7.3    2009-03-08 Castle 7.3  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m Homepage   http://www.abc.go.com/shows/revenge Genres Drama Mystery Keywords secret identity revenge betrayal faked death identity swap vengeful woman Content Score 100 Yes! Looking good! Top Contributors R 131 Rebecca 52 Marr 🇳🇱 46 Elizabeth Jennings 14 CouchTater  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}