{"link": "https://www.themoviedb.org/tv/38751?language=en", "title": "Drew Carey's Improv-A-Ganza", "resume": "Drew Carey's Improv-A-Ganza is an improvisational comedy television program that aired in the United States on the Game Show Network. The program was hosted by Drew Carey from CBS's The Price Is Right and former host of ABC's Whose Line Is It Anyway? and was produced at the Hollywood Theatre at the MGM Grand in Paradise, Nevada. The show premiered on April 11, 2011 at 8 p.m. Eastern time.", "rate": 100, "genre": ["Comedy"], "cast": ["Jonathan Mangum", "Kathy Kinney", "Brad Sherwood", "Chip Esten", "Jeff B. Davis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38751   Expand Drew Carey's Improv-A-Ganza   (2011) User Score Overview Drew Carey's Improv-A-Ganza is an improvisational comedy television program that aired in the United States on the Game Show Network. The program was hosted by Drew Carey from CBS's The Price Is Right and former host of ABC's Whose Line Is It Anyway? and was produced at the Hollywood Theatre at the MGM Grand in Paradise, Nevada. The show premiered on April 11, 2011 at 8 p.m. Eastern time. Featured Crew Drew Carey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Mangum Kathy Kinney Brad Sherwood Chip Esten Jeff B. Davis Full Cast & Crew Last Season Season 1 2011 | 40 Episodes Season 1 of Drew Carey's Improv-A-Ganza premiered on April 11, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Drew Carey's Improv-A-Ganza. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}