{"link": "https://www.themoviedb.org/tv/12211?language=en", "title": "The Rag Trade", "resume": "The Rag Trade is a British television sitcom broadcast by the BBC between 1961 and 1963 and by LWT between 1977 and 1978.\nThe scripts were by Ronald Wolfe and Ronald Chesney, who later wrote Wild, Wild Women, Meet the Wife and On the Buses. Wild, Wild Women was a period variation of The Rag Trade.\nThe action centred on a small clothing workshop, Fenner Fashions in London. Although run by Harold Fenner and Reg the foreman, the female workers are led by militant shop steward Paddy Fleming, ever ready to strike, with the catchphrase \"Everybody out!\" Other cast members included Sheila Hancock, Esma Reese Cannon, Wanda Ventham and Barbara Windsor.\nThe Rag Trade was revived by ITV company LWT in 1977, with Jones and Karlin reprising their roles. The 1977 version ran for two series, most of the scripts being based on the BBC episodes from the 1960s, and featured Anna Karen and future EastEnders star Gillian Taylforth as factory workers.\nThe theme tune for the LWT series was written and performed by Lynsey De Paul.", "rate": 60, "genre": ["Comedy"], "cast": ["Barbara Windsor", "Sheila Hancock", "Reg Varney", "Esma Cannon", "Wanda Ventham"], "character": ["Gloria"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12211   Expand The Rag Trade   (1961) User Score Overview The Rag Trade is a British television sitcom broadcast by the BBC between 1961 and 1963 and by LWT between 1977 and 1978. The scripts were by Ronald Wolfe and Ronald Chesney, who later wrote Wild, Wild Women, Meet the Wife and On the Buses. Wild, Wild Women was a period variation of The Rag Trade. The action centred on a small clothing workshop, Fenner Fashions in London. Although run by Harold Fenner and Reg the foreman, the female workers are led by militant shop steward Paddy Fleming, ever ready to strike, with the catchphrase \"Everybody out!\" Other cast members included Sheila Hancock, Esma Reese Cannon, Wanda Ventham and Barbara Windsor. The Rag Trade was revived by ITV company LWT in 1977, with Jones and Karlin reprising their roles. The 1977 version ran for two series, most of the scripts being based on the BBC episodes from the 1960s, and featured Anna Karen and future EastEnders star Gillian Taylforth as factory workers. The theme tune for the LWT series was written and performed by Lynsey De Paul. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barbara Windsor Gloria Sheila Hancock Reg Varney Esma Cannon Wanda Ventham Full Cast & Crew Last Season Series 4 1977 | 15 Episodes Season 4 of The Rag Trade premiered on September 11, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Rag Trade. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords workplace working class steward sitcom british humour clothes factory workplace comedy Content Score 71 Just a little bit more... Top Contributors O 14 Ozbourne R 6 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}