{"link": "https://www.themoviedb.org/tv/71007?language=en", "title": "ID-0", "resume": "I-Machines are the general term for robots that operate in extreme environments. While Alliance Academy student Maya Mikuri is in the middle of operating an I-Machine, she gets involved in an incident with pirates, and ends up serving as a crew member on an excavation company's spaceship.", "rate": 64, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Kayama Koya", "Kimoto Hoshiko", "Ozawa Aki", "Rena Ueda", "Minami Tsuda"], "character": ["Greyman", "Claire Hojo", "Falsa", "Mysterious Girl", "Maya Mikuri (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71007   Expand ID-0   (2017) User Score  Play Trailer Overview I-Machines are the general term for robots that operate in extreme environments. While Alliance Academy student Maya Mikuri is in the middle of operating an I-Machine, she gets involved in an incident with pirates, and ends up serving as a crew member on an excavation company's spaceship. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kayama Koya Greyman Kimoto Hoshiko Claire Hojo Ozawa Aki Falsa Rena Ueda Mysterious Girl Minami Tsuda Maya Mikuri (voice) Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of ID-0 premiered on April  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2016-01-01 72 Cutest Animals 5.0    2015-12-13 LEGO Nexo Knights 6.0    2016-07-06 Paquita Salas 7.8  Facts Original Name  アイディー・ゼロ Aidī Zero Status  Planned Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://id-zero.com/ Genres Animation Sci-Fi & Fantasy Keywords mecha Content Score 93 Almost there... Top Contributors 18 YareYareDaze2 10 TheDerpMan s 10 scott2029 9 Leaked Inc  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}