{"link": "https://www.themoviedb.org/tv/34827?language=en", "title": "UG*Ultimate Girls", "resume": "Ultimate Girls is a Japanese fanservice UHF anime series from the production company m.o.e. which parodies the genres of tokusatsu, kaiju, and superheroes; mainly themes from the Ultra Series and Kyodai Hero sub-genre. It first aired in Japan on January 10, 2005 and had a total of 12 episodes which ran for 13 minutes each. The series has been licensed in North America by Media Blasters.", "rate": 100, "genre": ["Animation"], "cast": ["Akiko Kimura", "Takashi Matsuyama", "Misato Fukuen", "Tōru Furuya"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34827   Expand UG*Ultimate Girls   (2005) User Score Overview Ultimate Girls is a Japanese fanservice UHF anime series from the production company m.o.e. which parodies the genres of tokusatsu, kaiju, and superheroes; mainly themes from the Ultra Series and Kyodai Hero sub-genre. It first aired in Japan on January 10, 2005 and had a total of 12 episodes which ran for 13 minutes each. The series has been licensed in North America by Media Blasters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akiko Kimura Takashi Matsuyama Misato Fukuen Tōru Furuya Full Cast & Crew Last Season Season 1 2005 | 12 Episodes Season 1 of UG*Ultimate Girls premiered on January 10, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on UG*Ultimate Girls. You can help by rating TV shows you've seen. Facts Original Name  UG☆アルティメットガール Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  15m Homepage   http://www.ponycanyon.co.jp/pc-moe/ug/index.html Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 seboseboss 3 sp1ti m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}