{"link": "https://www.themoviedb.org/tv/79460?language=en", "title": "Legacies", "resume": "In a place where young witches, vampires, and werewolves are nurtured to be their best selves in spite of their worst impulses, Klaus Mikaelson’s daughter, 17-year-old Hope Mikaelson, Alaric Saltzman’s twins, Lizzie and Josie Saltzman, among others, come of age into heroes and villains at The Salvatore School for the Young and Gifted.", "rate": 0, "genre": ["Mystery", "Drama", "Action", "Adventure"], "cast": ["Danielle Rose Russell", "Matthew Davis", "Aria Shahghasemi", "Quincy Fouse", "Kaylee Bryant"], "character": ["Hope Mikaelson", "Alaric Saltzman", "Landon", "M.G", "Josie Saltzman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79460   Expand Legacies   (2018) User Score Overview In a place where young witches, vampires, and werewolves are nurtured to be their best selves in spite of their worst impulses, Klaus Mikaelson’s daughter, 17-year-old Hope Mikaelson, Alaric Saltzman’s twins, Lizzie and Josie Saltzman, among others, come of age into heroes and villains at The Salvatore School for the Young and Gifted. Featured Crew Julie Plec Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danielle Rose Russell Hope Mikaelson Matthew Davis Alaric Saltzman Aria Shahghasemi Landon Quincy Fouse M.G Kaylee Bryant Josie Saltzman Full Cast & Crew Next Season Season 1 2018 | 4 Episodes Season 1 of Legacies is set to premiere on October 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Facts Status  In Production Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cwtv.com/shows/legacies/ Genres Mystery Drama Action & Adventure Keywords witch spin off Content Score 79 Pump it up! We're close now. Top Contributors 40 perob24 13 MauSilva E 2 Elliottday  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}