{"link": "https://www.themoviedb.org/tv/4930?language=en", "title": "Backstairs at the White House", "resume": "Behind the scenes at the White House during eight administrations, as told by the people who work there.", "rate": 5, "genre": ["Drama", "War", "Politics"], "cast": ["Julie Harris", "Claire Bloom", "Kim Hunter", "Victor Buono", "Estelle Parsons"], "character": ["Mrs. Helen 'Nellie' Taft", "Mrs. Edith Galt Wilson", "Mrs. Ellen Wilson", "President William Howard Taft", "Mrs. Bess Truman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4930   Expand Backstairs at the White House   (1979) User Score Overview Behind the scenes at the White House during eight administrations, as told by the people who work there. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julie Harris Mrs. Helen 'Nellie' Taft Claire Bloom Mrs. Edith Galt Wilson Kim Hunter Mrs. Ellen Wilson Victor Buono President William Howard Taft Estelle Parsons Mrs. Bess Truman Full Cast & Crew Last Season Miniseries 1979 | 4 Episodes Season 1 of Backstairs at the White House premiered on January 29, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Backstairs at the White House. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Drama War & Politics Keywords white house miniseries historical drama usa politics domestic worker Content Score 86 Almost there... Top Contributors TB 24 TMDb Bot 11 Banana R 3 Rebecca S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}