{"link": "https://www.themoviedb.org/tv/5330?language=en", "title": "Last Call with Carson Daly", "resume": "Last Call with Carson Daly is an American late night television program hosted by Carson Daly and broadcast on NBC. Formerly a traditional talk show, the half-hour program consists of several produced segments, featuring interviews with musicians, filmmakers, and other artists, along with pre-taped on-location musical performances. It airs weeknights at 1:35 a.m. Eastern / 12:35 a.m. Central; it also airs weeknights a second time on the cable channel, Fuse.\nIn 2003 and 2004, Last Call was nominated for a Teen Choice Award for \"Choice TV Show – Late Night\".\nIn September 2013, NBC announced that Daly would be moving to The Today Show and leaving Last Call; it was not revealed if the program would continue without him.", "rate": 23, "genre": ["Talk"], "cast": ["Carson Daly"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5330   Expand Last Call with Carson Daly   (2002) User Score Overview Last Call with Carson Daly is an American late night television program hosted by Carson Daly and broadcast on NBC. Formerly a traditional talk show, the half-hour program consists of several produced segments, featuring interviews with musicians, filmmakers, and other artists, along with pre-taped on-location musical performances. It airs weeknights at 1:35 a.m. Eastern / 12:35 a.m. Central; it also airs weeknights a second time on the cable channel, Fuse. In 2003 and 2004, Last Call was nominated for a Teen Choice Award for \"Choice TV Show – Late Night\". In September 2013, NBC announced that Daly would be moving to The Today Show and leaving Last Call; it was not revealed if the program would continue without him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carson Daly Host Full Cast & Crew Last Season Season 1 2002 | 1 Episode Season 1 of Last Call with Carson Daly premiered on January  8, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2014-12-02 Late Night with Seth Meyers 5.6    The Oprah Winfrey Show 4.1    2009-06-01 The Tonight Show with Conan O'Brien 7.8    2005-07-19 Miami Ink 6.0    2002-09-16 Dr. Phil 2.7    2009-03-02 Late Night with Jimmy Fallon 6.0    1997-08-11 The View 3.3    1992-05-25 The Tonight Show with Jay Leno 5.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 29m Homepage   http://www.nbc.com/Last_Call_with_Carson_Daly/ Genres Talk Keywords talk show celebrity Content Score 56 We're so close, yet so far. Top Contributors 15 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}