{"link": "https://www.themoviedb.org/tv/62915?language=en", "title": "Hometown Over the Hill", "resume": "Dreams and reality of farming villages\nBy depicting the dreams of people living in farming villages, this drama also reveals problems that today’s residents of rural areas face, such as a growing number of biracial children from international marriages and the cutthroat competition to survive.\nScenic landscapes and heartwarming stories\nScenes showing picturesque rustic landscapes during each season spellbind viewers, as do heartwarming stories about the strong determination of people living in farming villages.\nBecoming one\nWhile centering on people who have lived in farming villages for generations, this drama also portrays the lives of people who have moved to farmland from big cities and from abroad.", "rate": 0, "genre": ["Drama", "Family", "Fantasy"], "cast": ["Woo Hee-jin", "Kim Chang-sook", "Seo Tae-hwa"], "character": ["Choi Young Hee", "Lee Soon Duk", "Kang Ki Sup"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62915   Expand Hometown Over the Hill   (2007) User Score Overview Dreams and reality of farming villages By depicting the dreams of people living in farming villages, this drama also reveals problems that today’s residents of rural areas face, such as a growing number of biracial children from international marriages and the cutthroat competition to survive. Scenic landscapes and heartwarming stories Scenes showing picturesque rustic landscapes during each season spellbind viewers, as do heartwarming stories about the strong determination of people living in farming villages. Becoming one While centering on people who have lived in farming villages for generations, this drama also portrays the lives of people who have moved to farmland from big cities and from abroad. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Woo Hee-jin Choi Young Hee Kim Chang-sook Lee Soon Duk Seo Tae-hwa Kang Ki Sup Full Cast & Crew Last Season Season 2 2012 | 125 Episodes Season 2 of Hometown Over the Hill premiered on May 20, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hometown Over the Hill. You can help by rating TV shows you've seen. Facts Original Name  산너머 남촌에는 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/namchon/ Genres Drama Family Fantasy Keywords korea Content Score 56 We're so close, yet so far. Top Contributors t 62 tmdb38202327 N 2 Nightowl.Kr TB 1 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}