{"link": "https://www.themoviedb.org/tv/47007?language=en", "title": "To the Beautiful You", "resume": "To The Beautiful You is a 2012 South Korean television drama series starring f(x)'s Sulli, Shinee's Minho, and Lee Hyun-woo. It aired on SBS from August 15 to October 4, 2012 on Wednesdays and Thursdays at 21:55 for 16 episodes.\nIt is based on the Japanese shōjo manga series, Hanazakari no Kimitachi e, written by Hisaya Nakajo. The Korean series is the fourth television adaptation of the manga following the Taiwanese Hanazakarino Kimitachihe in 2006, the Japanese Hanazakari no Kimitachi e in 2007 and its remake Hanazakari no Kimitachi e 2011.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["Choi Minho", "Sulli", "Lee Hyun-woo", "Kang Ha-neul", "Kim Ji-Won"], "character": ["Kang Tae-joon", "Goo Jae-hee", "Cha Eun-gyeol", "Min Hyeon-jae", "Seol Han Na"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47007   Expand To the Beautiful You   (2012) User Score Overview To The Beautiful You is a 2012 South Korean television drama series starring f(x)'s Sulli, Shinee's Minho, and Lee Hyun-woo. It aired on SBS from August 15 to October 4, 2012 on Wednesdays and Thursdays at 21:55 for 16 episodes. It is based on the Japanese shōjo manga series, Hanazakari no Kimitachi e, written by Hisaya Nakajo. The Korean series is the fourth television adaptation of the manga following the Taiwanese Hanazakarino Kimitachihe in 2006, the Japanese Hanazakari no Kimitachi e in 2007 and its remake Hanazakari no Kimitachi e 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Minho Kang Tae-joon Sulli Goo Jae-hee Lee Hyun-woo Cha Eun-gyeol Kang Ha-neul Min Hyeon-jae Kim Ji-Won Seol Han Na Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of To the Beautiful You premiered on August 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on To the Beautiful You. You can help by rating TV shows you've seen. Facts Original Name  아름다운 그대에게 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://wizard2.sbs.co.kr/foryou/ Genres Comedy Drama Keywords romance korea based on manga Content Score 86 Almost there... Top Contributors M 21 Maria180493 N 9 Nightowl.Kr 7 Zlogorek t 6 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}