{"link": "https://www.themoviedb.org/tv/16476?language=en", "title": "Seabert", "resume": "Seabert is an animated television series from 1985. It was created by BZZ films in Paris and originally aired in French before being translated into different languages around the world. In the United States, the show aired on HBO starting in 1987. There were 26 episodes. The author is Marc Tortarolo for the theme, Philippe Marin for the design and Jacques Morel and Eric Turlot for the stories.\nSeabert was about a boy named Tommy, an Inuit girl named Aura, and their \"pet\" whitecoat seal Seabert. After Seabert's parents are killed by hunters, the three banded together. They go on adventures in which they encounter more hunters and poachers and save various animals from harm.\nThe production for the series was handled by Mill Valley Animation, on a contract from Sepp, SA International, Brussels, the noted production house which also featured animation series and properties including the Smurfs, Snorks and Foofur. Jerry Smith, owner of Mill Valley Animation was also responsible for many of the below the line fulfillment needs of many Hanna-Barbera, Ruby Spears and some DIC Animation series. Director for Seabert was Dirk Braat of Amsterdam and series Casting Director Ron Knight, principal of Knight Mediacom. See Knight Mediacom International", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16476   Expand Seabert   (1986) User Score Overview Seabert is an animated television series from 1985. It was created by BZZ films in Paris and originally aired in French before being translated into different languages around the world. In the United States, the show aired on HBO starting in 1987. There were 26 episodes. The author is Marc Tortarolo for the theme, Philippe Marin for the design and Jacques Morel and Eric Turlot for the stories. Seabert was about a boy named Tommy, an Inuit girl named Aura, and their \"pet\" whitecoat seal Seabert. After Seabert's parents are killed by hunters, the three banded together. They go on adventures in which they encounter more hunters and poachers and save various animals from harm. The production for the series was handled by Mill Valley Animation, on a contract from Sepp, SA International, Brussels, the noted production house which also featured animation series and properties including the Smurfs, Snorks and Foofur. Jerry Smith, owner of Mill Valley Animation was also responsible for many of the below the line fulfillment needs of many Hanna-Barbera, Ruby Spears and some DIC Animation series. Director for Seabert was Dirk Braat of Amsterdam and series Casting Director Ron Knight, principal of Knight Mediacom. See Knight Mediacom International Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1986 | 12 Episodes Season 1 of Seabert premiered on October  1, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Seabert. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors s 6 scheijgrond 3 BigMad r 3 romangt j 2 jeroen1981  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}