{"link": "https://www.themoviedb.org/tv/12111?language=en", "title": "Project U.F.O.", "resume": "Project U.F.O. is a NBC television series which lasted two seasons, from 1978 to 1979. Based loosely on the real-life Project Blue Book, the show was created by Dragnet veteran Jack Webb, who pored through Air Force files looking for episode ideas. This was the final show produced by Webb's Mark VII Limited, but in the case of this show it was produced in association with Worldvision Enterprises; this was the only Mark VII production not produced with the two other studios closely associated with Mark VII -- Warner Bros. or MCA TV / Universal Television.", "rate": 0, "genre": ["Mystery"], "cast": ["William Jordan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12111   Expand Project U.F.O.   (1978) User Score Overview Project U.F.O. is a NBC television series which lasted two seasons, from 1978 to 1979. Based loosely on the real-life Project Blue Book, the show was created by Dragnet veteran Jack Webb, who pored through Air Force files looking for episode ideas. This was the final show produced by Webb's Mark VII Limited, but in the case of this show it was produced in association with Worldvision Enterprises; this was the only Mark VII production not produced with the two other studios closely associated with Mark VII -- Warner Bros. or MCA TV / Universal Television. Featured Crew Jack Webb Creator Harold Jack Bloom Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Jordan Full Cast & Crew Last Season Season 2 1978 | 13 Episodes Season 2 of Project U.F.O. premiered on September 21, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Project U.F.O.. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Mystery Keywords alien ufo military ufo conspiracy Content Score 64 We're so close, yet so far. Top Contributors 14 Banana 4 lineker 1 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}