{"link": "https://www.themoviedb.org/tv/1784?language=en", "title": "In Case of Emergency", "resume": "In Case of Emergency is an American half-hour comedy television series shown on ABC in the United States. The series follows a group of high school acquaintances whose lives have not turned out as they hoped. It premiered on January 3, 2007 at 9:30pm and ended on April 11, 2007. The pilot episode was directed by Jon Favreau and the cast included Jonathan Silverman, David Arquette, Lori Loughlin, Kelly Hu, and Greg Germann.\nABC gave early renewal notices to several of its series on March 21, 2007 but In Case of Emergency was not one of them. Many believe this is due to being placed in the same time slot as \"American Idol\".\nOn April 12, 2007, ABC announced that the show had been officially cancelled leaving one episode unaired, which has since been broadcast internationally.", "rate": 0, "genre": ["Comedy"], "cast": ["Jonathan Silverman", "Kelly Hu", "Lori Loughlin", "Greg Germann", "Jackson Bond"], "character": ["Kelly Lee", "Dr. Joanna Lupone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1784   Expand In Case of Emergency   (2007) User Score Overview In Case of Emergency is an American half-hour comedy television series shown on ABC in the United States. The series follows a group of high school acquaintances whose lives have not turned out as they hoped. It premiered on January 3, 2007 at 9:30pm and ended on April 11, 2007. The pilot episode was directed by Jon Favreau and the cast included Jonathan Silverman, David Arquette, Lori Loughlin, Kelly Hu, and Greg Germann. ABC gave early renewal notices to several of its series on March 21, 2007 but In Case of Emergency was not one of them. Many believe this is due to being placed in the same time slot as \"American Idol\". On April 12, 2007, ABC announced that the show had been officially cancelled leaving one episode unaired, which has since been broadcast internationally. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Silverman Kelly Hu Kelly Lee Lori Loughlin Dr. Joanna Lupone Greg Germann Jackson Bond Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of In Case of Emergency premiered on January  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on In Case of Emergency. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords group of friends Content Score 86 Almost there... Top Contributors w 3 webmaster 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}