{"link": "https://www.themoviedb.org/tv/6401?language=en", "title": "Wild West", "resume": "Wild West is a situation comedy screened from October 2002 until 2004 starring Dawn French and Catherine Tate. It was described as a dark comedy from the pen of Simon Nye and was filmed on location in Cornwall. Set in the hamlet of St Gweep, Wild West observes the strange goings-on in the local Cornish community. Shop owners Mary Trewednack and her life-partner Angela are the main focus but there are many other characters in this sitcom.\nThe first series of the sitcom was scheduled to appear on prime-time BBC1 where its eccentricities met with a poor critical and popular response, but a second series was commissioned and both series have received retrospective praise.\nMost of the sitcom was filmed in the village of Portloe in Cornwall.", "rate": 0, "genre": ["Comedy"], "cast": ["Catherine Tate", "Dawn French", "Richard Mylan", "Anne-Marie Duff", "Bill Bailey"], "character": ["Angela Phillips", "Mary Trewednack", "Harry", "Holly", "Doug"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6401   Expand Wild West   (2002) User Score Overview Wild West is a situation comedy screened from October 2002 until 2004 starring Dawn French and Catherine Tate. It was described as a dark comedy from the pen of Simon Nye and was filmed on location in Cornwall. Set in the hamlet of St Gweep, Wild West observes the strange goings-on in the local Cornish community. Shop owners Mary Trewednack and her life-partner Angela are the main focus but there are many other characters in this sitcom. The first series of the sitcom was scheduled to appear on prime-time BBC1 where its eccentricities met with a poor critical and popular response, but a second series was commissioned and both series have received retrospective praise. Most of the sitcom was filmed in the village of Portloe in Cornwall. Featured Crew Simon Nye Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Catherine Tate Angela Phillips Dawn French Mary Trewednack Richard Mylan Harry Anne-Marie Duff Holly Bill Bailey Doug Full Cast & Crew Last Season Season 2 2004 | 6 Episodes Season 2 of Wild West premiered on March 12, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wild West. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords small town eccentric british humour british sitcom Content Score 79 Pump it up! We're close now. Top Contributors 12 Banana O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}