{"link": "https://www.themoviedb.org/tv/63926?language=en", "title": "One-Punch Man", "resume": "Saitama is a hero who only became a hero for fun. After three years of “special” training, though, he’s become so strong that he’s practically invincible. In fact, he’s too strong—even his mightiest opponents are taken out with a single punch, and it turns out that being devastatingly powerful is actually kind of a bore. With his passion for being a hero lost along with his hair, yet still faced with new enemies every day, how much longer can he keep it going?", "rate": 82, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Makoto Furukawa", "Kaito Ishikawa", "Kazuhiro Yamaji", "Yuichi Nakamura", "Kenjirou Tsuda"], "character": ["Saitama", "Genos", "Silverfang", "License-less Rider", "Atomic Samurai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63926   Expand One-Punch Man   (2015) User Score  Play Trailer Overview Saitama is a hero who only became a hero for fun. After three years of “special” training, though, he’s become so strong that he’s practically invincible. In fact, he’s too strong—even his mightiest opponents are taken out with a single punch, and it turns out that being devastatingly powerful is actually kind of a bore. With his passion for being a hero lost along with his hair, yet still faced with new enemies every day, how much longer can he keep it going? Featured Crew ONE Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  3 Images Backdrops  7 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Makoto Furukawa Saitama Kaito Ishikawa Genos Kazuhiro Yamaji Silverfang Yuichi Nakamura License-less Rider Kenjirou Tsuda Atomic Samurai Full Cast & Crew Last Season Season 1 2015 | 12 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply N Sub or dub? Open 0 by Nanook\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  9 Recommendations   2013-04-06 Attack on Titan 7.6    2011-10-02 Hunter x Hunter 8.5    2011-04-06 Steins;Gate 8.2    2009-04-05 Fullmetal Alchemist: Brotherhood 8.3    2007-04-01 Gurren Lagann 7.9    2006-10-04 Death Note 8.2    2014-07-03 Tokyo Ghoul 7.2    2003-10-04 Fullmetal Alchemist 8.0  Facts Original Name  ワンパンマン Status  Returning Series Networks Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://onepunchman-anime.net/ Genres Action & Adventure Animation Comedy Keywords superhero parody social commentary based on manga violence zero to hero seinen anime absurd humor Content Score 100 Yes! Looking good! Top Contributors 64 RubeensVinicius 58 miryoku 15 FelipeFusion 8 Yourik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}