{"link": "https://www.themoviedb.org/tv/67054?language=en", "title": "Ange Vierge", "resume": "The story of the card game follows what happens when \"Hairou\" portals suddenly open, fusing five different worlds together. As a result, various mysterious \"Exceed\" powers are awakened in teenaged girls. An academy for these so-called \"Progress\" girls is built on the isolated Seiran Island in the Pacific.", "rate": 45, "genre": ["Action", "Adventure", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67054   Expand Ange Vierge   (2016) User Score Overview The story of the card game follows what happens when \"Hairou\" portals suddenly open, fusing five different worlds together. As a result, various mysterious \"Exceed\" powers are awakened in teenaged girls. An academy for these so-called \"Progress\" girls is built on the isolated Seiran Island in the Pacific. Featured Crew Masafumi Tamura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Ange Vierge premiered on July  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ange Vierge. You can help by rating TV shows you've seen. Facts Original Name  アンジュ・ヴィエルジュ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://ange-vierge-anime.com/ Genres Action & Adventure Animation Keywords fantasy ecchi anime Content Score 64 We're so close, yet so far. Top Contributors B 11 Bonsai 11 karaa S 8 Starfola d 7 dearjohn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}