{"link": "https://www.themoviedb.org/tv/60006?language=en", "title": "Hello Counselor", "resume": "Hello Counselor is a South Korean reality show first that debuted in November 2010. It is hosted by Shin Dong-yup, Lee Yeong-ja, and Cultwo (Jeong Chan-wu, Kim Tae-gyun). It is a talk show with an emphasis on regular people, regardless of age or gender, that aims to help take down communication barriers by sharing stories about life.", "rate": 90, "genre": ["Reality"], "cast": ["Lee Young-ja", "Jung Chan-woo", "Kim Tae-gyun", "Gong Seung-yeon", "Shin Dong-yup"], "character": ["Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60006   Expand Hello Counselor   (2010) User Score Overview Hello Counselor is a South Korean reality show first that debuted in November 2010. It is hosted by Shin Dong-yup, Lee Yeong-ja, and Cultwo (Jeong Chan-wu, Kim Tae-gyun). It is a talk show with an emphasis on regular people, regardless of age or gender, that aims to help take down communication barriers by sharing stories about life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Young-ja Jung Chan-woo Kim Tae-gyun Gong Seung-yeon Herself Shin Dong-yup Full Cast & Crew Last Season Season 1 2010 | 33 Episodes Season 1 of Hello Counselor premiered on November 22, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hello Counselor. You can help by rating TV shows you've seen. Facts Original Name  대국민 토크쇼 안녕하세요 Status  Returning Series Network Certification  - Type  Reality Original Language  Korean Runtime  - Homepage   http://www.kbs.co.kr/2tv/enter/hello/ Genres Reality Keywords 대국민 토크쇼 안녕하세요 Content Score 71 Just a little bit more... Top Contributors t 15 tmdb983464 k 5 kim3844 5 barto 4 Charles  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}