{"link": "https://www.themoviedb.org/tv/33955?language=en", "title": "Pound Puppies", "resume": "Pound Puppies is an American/Canadian animated series that premiered on The Hub Network on October 10, 2010, in the United States. Pound Puppies also aired on YTV in Canada and on Boomerang in the UK and Ireland, as well as Cartoon Network in Saudi Arabia. The series is produced by Hasbro Studios. It is the second series, after the 1986 series, to adapt Pound Puppies into a cartoon format. It is a kid-friendly cartoon, and is designed to appeal to children and their families. It has also featured very well-known voice actors, such as Betty White.", "rate": 0, "genre": ["Animation"], "cast": ["Michael Rapaport"], "character": ["Squirt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33955   Expand Pound Puppies   (2010) User Score Overview Pound Puppies is an American/Canadian animated series that premiered on The Hub Network on October 10, 2010, in the United States. Pound Puppies also aired on YTV in Canada and on Boomerang in the UK and Ireland, as well as Cartoon Network in Saudi Arabia. The series is produced by Hasbro Studios. It is the second series, after the 1986 series, to adapt Pound Puppies into a cartoon format. It is a kid-friendly cartoon, and is designed to appeal to children and their families. It has also featured very well-known voice actors, such as Betty White. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Rapaport Squirt Full Cast & Crew Last Season Season 3 2013 | 26 Episodes Season 3 of Pound Puppies premiered on June  1, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pound Puppies. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.hubworld.com/pound-puppies/shows/pound-puppies Genres Animation Keywords puppy talking animal dog dog pound dog catcher Content Score 56 We're so close, yet so far. Top Contributors 7 david8s95 6 Travis Bell TB 3 TMDb Bot 1 kuzronk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}