{"link": "https://www.themoviedb.org/tv/68546?language=en", "title": "Rhett & Link's Buddy System", "resume": "Follow best friends, Rhett & Link, as they embark on a fantastical misadventure in search of a missing phone that could save their morning talk show from a co-ex-girlfriend turned evil infomercial queen.", "rate": 70, "genre": ["Comedy"], "cast": ["Rhett McLaughlin", "Link Neal"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68546   Expand Rhett & Link's Buddy System   (2016) User Score  Play Trailer Overview Follow best friends, Rhett & Link, as they embark on a fantastical misadventure in search of a missing phone that could save their morning talk show from a co-ex-girlfriend turned evil infomercial queen. Featured Crew Rhett McLaughlin Creator Link Neal Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rhett McLaughlin Himself Link Neal Himself Full Cast & Crew Current Season Season 2 2017 | 8 Episodes Season 2 of Rhett & Link's Buddy System premiered on November 29, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rhett & Link's Buddy System. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  14m Homepage   https://www.youtube.com/playlist?list=PLJ49NV73ttruI9rFSL0xrqHzZjJmdH219 Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 53 Donxy 6 Elizabeth Jennings d 3 dsosu84 1 JP Dalton  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}