{"link": "https://www.themoviedb.org/tv/116?language=en", "title": "Titans", "resume": "Titans is an American prime time soap opera that debuted on October 4, 2000 on NBC. Thirteen episodes were filmed, of which eleven were actually aired. Produced by Aaron Spelling, the series was initially marketed as a \"Dynasty for the new millennium,\" attempting to emulate the style of Spelling's earlier hit series. However, low ratings led NBC to cancel the series before its first season was completed.", "rate": 0, "genre": ["Soap", "Drama"], "cast": ["Casper Van Dien", "Yasmine Bleeth", "Elizabeth Bogush", "Perry King", "John Barrowman"], "character": ["Peter Williams"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 116   Expand Titans   (2000) User Score Overview Titans is an American prime time soap opera that debuted on October 4, 2000 on NBC. Thirteen episodes were filmed, of which eleven were actually aired. Produced by Aaron Spelling, the series was initially marketed as a \"Dynasty for the new millennium,\" attempting to emulate the style of Spelling's earlier hit series. However, low ratings led NBC to cancel the series before its first season was completed. Featured Crew Charles Pratt, Jr. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casper Van Dien Yasmine Bleeth Elizabeth Bogush Perry King John Barrowman Peter Williams Full Cast & Crew Last Season Season 1 2000 | 13 Episodes Season 1 of Titans premiered on October  4, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Titans. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Soap Drama Keywords soap opera Content Score 93 Almost there... Top Contributors 11 Banana a 2 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}