{"link": "https://www.themoviedb.org/tv/66946?language=en", "title": "Bu Ram Pram Pra", "resume": "The nobility of the young stars, experiencing life and to avoid going to the islands in the Andaman Sea. A weird name 'Gavin island, which has a cool ocean young man owned a beautiful resort. Count the stars you do not think that would have come across the amazing life story. On that evening, severe storms, torrential rain. Then with one-liners wade into the sea to rescue the boy out. Everything would go well. If a child is not a guy ... And then proceeded to get dressed up to Tiger. Fully Tri's grandson gave his morale. Jada leather strap tied talked billion Rain แkenhantns anointed King Ounalom ' \"What do these dice one too,\" the star asked in amazement. If the answer was to make the girl fall to amaze. When the kids were little waves and almost drowned looked up and said. \"Named Sut ...\"", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Masu Junyangdikul", "Janila Pariya", "Natee Pitak", "Suthee Siangwaan", "Atirut Suwan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66946   Expand Bu Ram Pram Pra   (2015) User Score Overview The nobility of the young stars, experiencing life and to avoid going to the islands in the Andaman Sea. A weird name 'Gavin island, which has a cool ocean young man owned a beautiful resort. Count the stars you do not think that would have come across the amazing life story. On that evening, severe storms, torrential rain. Then with one-liners wade into the sea to rescue the boy out. Everything would go well. If a child is not a guy ... And then proceeded to get dressed up to Tiger. Fully Tri's grandson gave his morale. Jada leather strap tied talked billion Rain แkenhantns anointed King Ounalom ' \"What do these dice one too,\" the star asked in amazement. If the answer was to make the girl fall to amaze. When the kids were little waves and almost drowned looked up and said. \"Named Sut ...\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masu Junyangdikul Janila Pariya Natee Pitak Suthee Siangwaan Atirut Suwan Full Cast & Crew Last Season Season 1 2015 | 38 Episodes Season 1 of Bu Ram Pram Pra premiered on November  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Bu Ram Pram Pra. You can help by rating TV shows you've seen. Facts Original Name  บุรำปรัมปรา Status  Ended Network Certification  - Type  Scripted Original Language  Thai Runtime  45m Homepage  - Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 51 Sven-Erik Andersen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}