{"link": "https://www.themoviedb.org/tv/348?language=en", "title": "SMTV Live", "resume": "SMTV Live, also stylised as SM:tv LIVE and in early promotional material SMTV://live, is a British Saturday morning children's television programme, first broadcast on ITV on 29 August 1998 and last broadcast on 27 December 2003.\nOn the surface, the programme did not seem to stray away from the format of other Saturday morning output, featuring an audience of children, competitions and cartoons, though it constantly won in ratings battles with the BBC's Live & Kicking and became ITV's most successful children's programme since Tiswas. The major success of SMTV Live has been attributed in equal parts to Ant & Dec's original presenting partnership with Cat Deeley, its use of thinly-veiled comedic innuendo aimed at older viewers, and its broadcast of the Japanese cartoon series Pokémon. At the height of its popularity, SMTV Live regularly attracted 2.5 million viewers. Ant & Dec's company Gallowgate currently owns the rights to the show.", "rate": 0, "genre": ["Comedy"], "cast": ["James Redmond", "Ian Watkins", "Claire Richards", "Brian Dowling", "Declan Donnelly"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 348   Expand SMTV Live   (1998) User Score Overview SMTV Live, also stylised as SM:tv LIVE and in early promotional material SMTV://live, is a British Saturday morning children's television programme, first broadcast on ITV on 29 August 1998 and last broadcast on 27 December 2003. On the surface, the programme did not seem to stray away from the format of other Saturday morning output, featuring an audience of children, competitions and cartoons, though it constantly won in ratings battles with the BBC's Live & Kicking and became ITV's most successful children's programme since Tiswas. The major success of SMTV Live has been attributed in equal parts to Ant & Dec's original presenting partnership with Cat Deeley, its use of thinly-veiled comedic innuendo aimed at older viewers, and its broadcast of the Japanese cartoon series Pokémon. At the height of its popularity, SMTV Live regularly attracted 2.5 million viewers. Ant & Dec's company Gallowgate currently owns the rights to the show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Redmond Ian Watkins Claire Richards Brian Dowling Declan Donnelly Full Cast & Crew Last Season Season 6 2003 | 18 Episodes Season 6 of SMTV Live premiered on August 30, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on SMTV Live. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  125m, 180m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}