{"link": "https://www.themoviedb.org/tv/15819?language=en", "title": "Warehouse 13", "resume": "After saving the life of the President, two secret service agents - Myka Bering and Pete Lattimer - find themselves assigned to the top secret Warehouse 13. The Warehouse is a massive, top secret facility that houses dangerous and fantastical objects. Together, Pete and Myka along with fellow agents Claudia, Steve Jinks and Warehouse caretaker Artie, must recover artifacts from around the globe before they can cause catastrophic damage.", "rate": 74, "genre": ["Sci-Fi", "Fantasy", "Comedy", "Action", "Adventure"], "cast": ["Eddie McClintock", "Joanne Kelly", "Saul Rubinek", "Allison Scagliotti"], "character": ["Pete Lattimer", "Myka Bering", "Arthur \"Artie\" Nielsen", "Claudia Donovan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15819   Expand Warehouse 13   (2009) User Score Overview After saving the life of the President, two secret service agents - Myka Bering and Pete Lattimer - find themselves assigned to the top secret Warehouse 13. The Warehouse is a massive, top secret facility that houses dangerous and fantastical objects. Together, Pete and Myka along with fellow agents Claudia, Steve Jinks and Warehouse caretaker Artie, must recover artifacts from around the globe before they can cause catastrophic damage. Featured Crew Jane Espenson Creator D. Brent Mote Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  27 Posters  14 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eddie McClintock Pete Lattimer Joanne Kelly Myka Bering Saul Rubinek Arthur \"Artie\" Nielsen Allison Scagliotti Claudia Donovan Full Cast & Crew Last Season Season 5 2014 | 6 Episodes Season 5 of Warehouse 13 premiered on April 14, 2014. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Warehouse 13 game on Kickstarter Open 0 by DrZaat\n      \n     So what happened to Eddie McClintock and Joanne Kelly? Open 0 by Bananaghost\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  27 Posters  14 Recommendations   2006-07-18 Eureka 7.4    2011-07-11 Alphas 6.5    2012-05-27 Continuum 7.1    2010-07-09 Haven 7.0    2008-09-09 Fringe 8.1    2011-09-26 Terra Nova 6.3    2004-07-11 The 4400 6.9    2013-04-15 Defiance 6.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.syfy.com/warehouse13 Genres Sci-Fi & Fantasy Comedy Action & Adventure Keywords artifact secret government organization magical object Content Score 93 Almost there... Top Contributors 20 Banana 20 seawolf 16 Elizabeth Jennings E 14 Elky  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}