{"link": "https://www.themoviedb.org/tv/43105?language=en", "title": "The Mob Doctor", "resume": "For most physicians, the Hippocratic oath is sacred. But for one Chicago  doctor, who is indebted to the mafia, saving lives isn’t her only  concern. The Mob Doctor is a fast-paced medical drama focusing on a  young female surgeon caught between two worlds as she juggles her  promising medical career with her family’s debt to Chicago’s Southside  mob.", "rate": 60, "genre": ["Drama", "Mystery"], "cast": ["Jordana Spiro", "William Forsythe", "James Carpinello", "Zach Gilford", "Zeljko Ivanek"], "character": ["Dr. Grace Devlin", "Constantine Alexander", "Leoni Franco", "Dr. Brett Robinson", "Dr. Stafford White"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43105   Expand The Mob Doctor   (2012) User Score Overview For most physicians, the Hippocratic oath is sacred. But for one Chicago  doctor, who is indebted to the mafia, saving lives isn’t her only  concern. The Mob Doctor is a fast-paced medical drama focusing on a  young female surgeon caught between two worlds as she juggles her  promising medical career with her family’s debt to Chicago’s Southside  mob. Featured Crew Josh Berman Creator Rob Wright Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jordana Spiro Dr. Grace Devlin William Forsythe Constantine Alexander James Carpinello Leoni Franco Zach Gilford Dr. Brett Robinson Zeljko Ivanek Dr. Stafford White Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of The Mob Doctor premiered on September 17, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  8 Recommendations   2005-09-16 Threshold 6.9    2014-05-30 Crossbones 6.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  44m, 43m Homepage  - Genres Drama Mystery Keywords chicago organized crime hospital doctor surgery mob family Content Score 93 Almost there... Top Contributors 30 Banana 14 United600 8 david8s95 M 7 MAthePA  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}