{"link": "https://www.themoviedb.org/tv/868?language=en", "title": "Boston Common", "resume": "Boston Common is an American television sitcom that ran on NBC from 1996–1997. It starred Anthony Clark and took place in the city of Boston. It was one of the 10 highest rated shows in its first season as it ranked 8th in the yearly ratings and was viewed by an average of 14.96 million households per episode. However, with a move to Sundays in its second season, the show dropped from 8th to 51st.", "rate": 70, "genre": ["Comedy"], "cast": ["Traylor Howard", "Zach Galifianakis", "Roger Rees", "Anthony Clark", "Hedy Burress"], "character": ["Joy Byrnes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 868   Expand Boston Common   (1996) User Score Overview Boston Common is an American television sitcom that ran on NBC from 1996–1997. It starred Anthony Clark and took place in the city of Boston. It was one of the 10 highest rated shows in its first season as it ranked 8th in the yearly ratings and was viewed by an average of 14.96 million households per episode. However, with a move to Sundays in its second season, the show dropped from 8th to 51st. Featured Crew David Kohan Creator Max Mutchnick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Traylor Howard Joy Byrnes Zach Galifianakis Roger Rees Anthony Clark Hedy Burress Full Cast & Crew Last Season Season 2 1996 | 22 Episodes Season 2 of Boston Common premiered on September 29, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Boston Common. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords boston college sitcom living with sibling Content Score 79 Pump it up! We're close now. Top Contributors 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}