{"link": "https://www.themoviedb.org/tv/75778?language=en", "title": "25-sai no Joshikousei", "resume": "The romance story centers around Hana Natori, an earnest, good-natured 25-year-old woman whose cousin refuses to go to high school. Hana takes her cousin's place and attends the high school. On her first day, though, Hana's ruse is discovered by her former high school classmate Okito Kanie—who happens to be the high school's world history teacher.", "rate": 0, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75778   Expand 25-sai no Joshikousei   (2018) User Score Overview The romance story centers around Hana Natori, an earnest, good-natured 25-year-old woman whose cousin refuses to go to high school. Hana takes her cousin's place and attends the high school. On her first day, though, Hana's ruse is discovered by her former high school classmate Okito Kanie—who happens to be the high school's world history teacher. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of 25-sai no Joshikousei premiered on January  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 25-sai no Joshikousei. You can help by rating TV shows you've seen. Facts Original Name  25歳の女子高生 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://nigojo.cf-anime.com/ Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 14 sp1ti 4 JairoG 3 sekaidown04 m 2 maruino  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}