{"link": "https://www.themoviedb.org/tv/45815?language=en", "title": "Brazil Avenue", "resume": "Brazil Avenue is a dynamic, lifelike, and modern telenovela that reveals how unrelenting ambition and inflicted cruelty can change a young girl’s destiny and lead her to seek revenge.", "rate": 82, "genre": ["Drama", "Mystery"], "cast": ["Débora Falabella", "Adriana Esteves", "Isis Valverde", "Cauã Reymond", "Murilo Benício"], "character": ["Nina García Hernández (Rita)", "Carmem Lúcia Moreira de Araújo (Carminha)", "Suellen", "Jorginho Araújo Filho", "Tufão (Jorge Araújo)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45815   Expand Brazil Avenue   (2012) User Score Overview Brazil Avenue is a dynamic, lifelike, and modern telenovela that reveals how unrelenting ambition and inflicted cruelty can change a young girl’s destiny and lead her to seek revenge. Featured Crew João Emanuel Carneiro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Débora Falabella Nina García Hernández (Rita) Adriana Esteves Carmem Lúcia Moreira de Araújo (Carminha) Isis Valverde Suellen Cauã Reymond Jorginho Araújo Filho Murilo Benício Tufão (Jorge Araújo) Full Cast & Crew Last Season Season 1 2012 | 4 Episodes Season 1 of Brazil Avenue premiered on March 26, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2015-08-31 Rules of the Game 6.0  Facts Original Name  Avenida Brasil Status  Ended Network Certification 12 Meaning Content suitable for viewers over the age of 12. Type  Scripted Original Language  Portuguese Runtime  70m Homepage   gshow.globo.com/novelas/avenida-brasil Genres Drama Mystery Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors VF 73 Vitor Fernandes f 11 felipescavo 5 SaberA t 4 tmdb45070722  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}