{"link": "https://www.themoviedb.org/tv/1185?language=en", "title": "Jack's Big Music Show", "resume": "Jack's Big Music Show is a children's television program that aired on the Nick Jr. television network. The show premiered on the same network on September 12, 2005. Jack's Big Music Show was nominated for a 2008 Emmy award for Outstanding Pre-school Television Series.\nThe main characters are Jack, his best friend Mary, and his drum-playing dog Mel, all of whom are puppets. The show takes place in Jack's backyard clubhouse, and centers on the characters' love for music. Each episode runs without commercials for a duration of approximately 22 minutes. The characters play music in every episode, and are often accompanied by other puppets or human musicians. Each episode also features two music videos by children's musical artists, except \"Super Swell Sing-a-Long\" where there was only one video.\nAccording to Nick Jr.'s website:\nThe show is produced by Spiffy Pictures—David Rudman, Todd Hannert, and Adam Rudman. David Rudman is a veteran of the long-running public TV children's show Sesame Street, playing such popular Muppets as Baby Bear, Cookie Monster, and half of the Two-Headed Monster. Adam Rudman won six Emmys for his writing on Sesame Street; Mary's Alice Dinnean and Mel's John Kennedy are also Sesame Street alums.", "rate": 0, "genre": [], "cast": ["Alice Dinnean"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1185   Expand Jack's Big Music Show   (2005) User Score Overview Jack's Big Music Show is a children's television program that aired on the Nick Jr. television network. The show premiered on the same network on September 12, 2005. Jack's Big Music Show was nominated for a 2008 Emmy award for Outstanding Pre-school Television Series. The main characters are Jack, his best friend Mary, and his drum-playing dog Mel, all of whom are puppets. The show takes place in Jack's backyard clubhouse, and centers on the characters' love for music. Each episode runs without commercials for a duration of approximately 22 minutes. The characters play music in every episode, and are often accompanied by other puppets or human musicians. Each episode also features two music videos by children's musical artists, except \"Super Swell Sing-a-Long\" where there was only one video. According to Nick Jr.'s website: The show is produced by Spiffy Pictures—David Rudman, Todd Hannert, and Adam Rudman. David Rudman is a veteran of the long-running public TV children's show Sesame Street, playing such popular Muppets as Baby Bear, Cookie Monster, and half of the Two-Headed Monster. Adam Rudman won six Emmys for his writing on Sesame Street; Mary's Alice Dinnean and Mel's John Kennedy are also Sesame Street alums. Featured Crew Scott Fellows Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alice Dinnean Full Cast & Crew Last Season Season 2 2007 | 14 Episodes Season 2 of Jack's Big Music Show premiered on January  6, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jack's Big Music Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  20m, 22m Homepage   http://www.noggin.com/shows/jacks.php Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}