{"link": "https://www.themoviedb.org/tv/42524?language=en", "title": "History of the Salaryman", "resume": "History of a Salaryman is a 2012 South Korean television series that aired on SBS from January 2 to March 31, 2012 on Mondays and Tuesdays at 21:55 for 22 episodes. Starring Lee Beom-soo, Jung Ryeo-won, Jung Gyu-woon, Hong Soo-hyun, Lee Deok-hwa, and Kim Seo-hyung, the series is a quirky comedy and murder mystery about an ordinary salaryman who finds himself involved with corporate spies and rival pharmaceutical companies. It satirizes the historical events during China's Chu–Han Contention to become a parody of modern office politics.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["Jung Ryeo-won", "Hong Soo-hyun", "Lee Beom-soo", "Jung Gyu-woon", "Kim Seo-hyung"], "character": ["Baek Yeo-chi", "Cha Woo-hee", "Yoo-bang", "Choi Hang-woo", "Mo Ga-bi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42524   Expand History of the Salaryman   (2012) User Score Overview History of a Salaryman is a 2012 South Korean television series that aired on SBS from January 2 to March 31, 2012 on Mondays and Tuesdays at 21:55 for 22 episodes. Starring Lee Beom-soo, Jung Ryeo-won, Jung Gyu-woon, Hong Soo-hyun, Lee Deok-hwa, and Kim Seo-hyung, the series is a quirky comedy and murder mystery about an ordinary salaryman who finds himself involved with corporate spies and rival pharmaceutical companies. It satirizes the historical events during China's Chu–Han Contention to become a parody of modern office politics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Ryeo-won Baek Yeo-chi Hong Soo-hyun Cha Woo-hee Lee Beom-soo Yoo-bang Jung Gyu-woon Choi Hang-woo Kim Seo-hyung Mo Ga-bi Full Cast & Crew Last Season Season 1 2012 | 22 Episodes Season 1 of History of the Salaryman premiered on December 21, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on History of the Salaryman. You can help by rating TV shows you've seen. Facts Original Name  샐러리맨 초한지 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 10 tmdb38202327 8 Elizabeth Jennings z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}