{"link": "https://www.themoviedb.org/tv/21058?language=en", "title": "The Monkey King: Quest for the Sutra", "resume": "The Monkey King: Quest for the Sutra is a 2002 Hong Kong/Taiwanese TV series based on the classic Chinese novel: Journey to the West. It is also a remake of the 90's TVB version.\nThis is the second Monkey King that is portrayed by Dicky Cheung, the other one being \"Journey to the West I\". It is also the first Monkey King series that is not called \"Journey to the West\". This was just broadcast on TVB however it is a co-production of Taiwanese-Hong Kong.", "rate": 0, "genre": ["Comedy"], "cast": ["Dicky Cheung Wai-Kin", "Edmond Leung", "Eric Kot", "Sam Lee", "Jimmy Lin Zhi-Ying"], "character": ["The Monkey King", "The Mentor", "Chu Bak Gai", "The Sand Monk", "Na Ja"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21058   Expand The Monkey King: Quest for the Sutra   (2002) User Score Overview The Monkey King: Quest for the Sutra is a 2002 Hong Kong/Taiwanese TV series based on the classic Chinese novel: Journey to the West. It is also a remake of the 90's TVB version. This is the second Monkey King that is portrayed by Dicky Cheung, the other one being \"Journey to the West I\". It is also the first Monkey King series that is not called \"Journey to the West\". This was just broadcast on TVB however it is a co-production of Taiwanese-Hong Kong. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dicky Cheung Wai-Kin The Monkey King Edmond Leung The Mentor Eric Kot Chu Bak Gai Sam Lee The Sand Monk Jimmy Lin Zhi-Ying Na Ja Full Cast & Crew Last Season Season 1 2002 | 35 Episodes Season 1 of The Monkey King: Quest for the Sutra premiered on July 10, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Monkey King: Quest for the Sutra. You can help by rating TV shows you've seen. Facts Original Name  齊天大聖孫悟空 Status  Ended Networks - Certification  - Type  Scripted Original Language  Cantonese Runtime  45m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 39 tcx4c70 20 Elizabeth Jennings AM 3 Ade M Saragih  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}