{"link": "https://www.themoviedb.org/tv/80051?language=en", "title": "Ossan's Love", "resume": "Haruta Soichi is a 33-years-old single man who isn't popular with women. He works at a real estate office and lives with his parents. However, one day, his mother walks away from him and he has to live independently. Soichi doesn't know basic things such as cooking or washing his clothes. He then decides to live with Maki Ryota, a coworker who is good at housekeeping. One day, Ryota and Kurosawa Musashi, a gay coworker, both confess their feelings to Soichi.", "rate": 0, "genre": [], "cast": ["Kei Tanaka", "Kotaro Yoshida", "Kento Hayashi"], "character": ["Haruta Soichi", "Kurosawa Musashi", "Maki Ryota"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80051   Expand Ossan's Love   (2018) User Score Overview Haruta Soichi is a 33-years-old single man who isn't popular with women. He works at a real estate office and lives with his parents. However, one day, his mother walks away from him and he has to live independently. Soichi doesn't know basic things such as cooking or washing his clothes. He then decides to live with Maki Ryota, a coworker who is good at housekeeping. One day, Ryota and Kurosawa Musashi, a gay coworker, both confess their feelings to Soichi. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kei Tanaka Haruta Soichi Kotaro Yoshida Kurosawa Musashi Kento Hayashi Maki Ryota Full Cast & Crew Current Season Season 1 2018 | 7 Episodes Season 1 of Ossan's Love premiered on April 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ossan's Love. You can help by rating TV shows you've seen. Facts Original Name  おっさんずラブ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  40m Homepage  - Genres No genres have been added. Keywords love triangle gay office romance age gap Content Score 36 There's no 'I' in team... Top Contributors j 16 janbryan 14 Elizabeth Jennings 11 n71154plus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}