{"link": "https://www.themoviedb.org/tv/3462?language=en", "title": "Zoobilee Zoo", "resume": "Zoobilee Zoo is an Emmy Award-winning children's television series featuring costumed performers dressed as animal characters. It originally aired from 1986–1987, then in syndication until 2001 on several television channels including commercial network television stations, public television stations, The Learning Channel, and the Hallmark Channel. Only 65 episodes of the original incarnation of the show were made. While it was in syndication for 15 years, it was no longer airing on television as of July 2011. The original 65 episodes are currently owned by Hallmark Properties and were produced by WQED Pittsburgh.\nGenerally the plot of each episode consists of the main characters, called Zoobles, encountering difficulties usually common to young children and then learning a moral lesson about dealing with such problems, such as being apprehensive of going to a doctor or learning to appreciate others. Each character has a certain gimmick in his behavior or interests that gives him a unique view on each problem faced. Mayor Ben, who usually appears at the beginnings and ends of each episode, calls the fans and viewers of the show Zoobaroos.", "rate": 0, "genre": [], "cast": ["Louise Vallance", "Ben Vereen", "Gary Schwartz", "Karen Hartman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3462   Expand Zoobilee Zoo   (1986) User Score Overview Zoobilee Zoo is an Emmy Award-winning children's television series featuring costumed performers dressed as animal characters. It originally aired from 1986–1987, then in syndication until 2001 on several television channels including commercial network television stations, public television stations, The Learning Channel, and the Hallmark Channel. Only 65 episodes of the original incarnation of the show were made. While it was in syndication for 15 years, it was no longer airing on television as of July 2011. The original 65 episodes are currently owned by Hallmark Properties and were produced by WQED Pittsburgh. Generally the plot of each episode consists of the main characters, called Zoobles, encountering difficulties usually common to young children and then learning a moral lesson about dealing with such problems, such as being apprehensive of going to a doctor or learning to appreciate others. Each character has a certain gimmick in his behavior or interests that gives him a unique view on each problem faced. Mayor Ben, who usually appears at the beginnings and ends of each episode, calls the fans and viewers of the show Zoobaroos. Featured Crew Hallmark Creations Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Louise Vallance Ben Vereen Gary Schwartz Karen Hartman Full Cast & Crew Last Season Season 1 1986 | 64 Episodes Season 1 of Zoobilee Zoo premiered on September 22, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Zoobilee Zoo. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 1 magneeto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}