{"link": "https://www.themoviedb.org/tv/57564?language=en", "title": "Adolescence Medley", "resume": "A teen drama about high school students in a village high school. Jung Woo is a transfer student in Namil High School. After transferring schools 7 times, Jung Woo learns it is easiest not to make friends!", "rate": 0, "genre": ["Comedy", "Drama", "Romance"], "cast": ["Kwak Dong-yeon", "Lee Se-young", "Kwak Jung-wook", "Baek Sung-hyun", "Choi Tae-joon"], "character": ["Choi Jung-woo", "Yang Ah-young", "Im Deok-won", "Choi Jung-woo", "Lee Yeok-ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57564   Expand Adolescence Medley   (2013) User Score Overview A teen drama about high school students in a village high school. Jung Woo is a transfer student in Namil High School. After transferring schools 7 times, Jung Woo learns it is easiest not to make friends!  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kwak Dong-yeon Choi Jung-woo Lee Se-young Yang Ah-young Kwak Jung-wook Im Deok-won Baek Sung-hyun Choi Jung-woo Choi Tae-joon Lee Yeok-ho Full Cast & Crew Last Season Season 1 2013 | 4 Episodes Season 1 of Adolescence Medley premiered on June 30, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Adolescence Medley. You can help by rating TV shows you've seen. Facts Original Name  사춘기 메들리 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  70m Homepage   http://www.kbs.co.kr/drama/medley/ Genres Comedy Drama Romance Keywords friendship korea school Content Score 86 Almost there... Top Contributors M 36 Maria180493 z 5 zurman1 4 lareina123 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}