{"link": "https://www.themoviedb.org/tv/33238?language=en", "title": "Running Man", "resume": "A never-before-seen new genre of variety show focused in an urban environment with the MCs and guests completing missions to win the race.", "rate": 85, "genre": ["Comedy", "Reality"], "cast": ["Yoo Jae-suk", "Ji Suk-jin", "Kim Jong-kook", "Haha", "Song Ji-hyo"], "character": ["Yoo Jae-suk", "Ji Suk-jin", "Kim Jong-kook", "Haha", "Song Ji-hyo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33238   Expand Running Man   (2010) User Score Overview A never-before-seen new genre of variety show focused in an urban environment with the MCs and guests completing missions to win the race. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  8 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo Jae-suk Yoo Jae-suk Ji Suk-jin Ji Suk-jin Kim Jong-kook Kim Jong-kook Haha Haha Song Ji-hyo Song Ji-hyo Full Cast & Crew Last Season Season 1 2010 | 407 Episodes Season 1 of Running Man premiered on July 11, 2010. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Running Man. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  8 Recommendations   2015-04-09 Exo Next Door 8.7  Facts Original Name  런닝맨 Status  Returning Series Network Certification  - Type  Reality Original Language  Korean Runtime  85m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=00000330171 Genres Comedy Reality Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 43 Maria180493 TB 42 TMDb Bot v 30 vplaytv2 d 25 daphie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}