{"link": "https://www.themoviedb.org/tv/3553?language=en", "title": "Jake in Progress", "resume": "Jake in Progress is an American comedy series broadcast on ABC from 2005 to 2006. Created by Austin Winsberg, the show was originally conceived as a real-time comedy; the first season was to show the first date of Jake and a woman. This was dropped during development, and the show became more conventional and episodic. The first aired episode reflected the original plan, and covering the first half-hour of a date.", "rate": 70, "genre": ["Drama"], "cast": ["John Stamos", "Wendie Malick", "Ian Gomez", "Rick Hoffman", "David Hornsby"], "character": ["Jake Phillips", "Naomi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3553   Expand Jake in Progress   (2005) User Score Overview Jake in Progress is an American comedy series broadcast on ABC from 2005 to 2006. Created by Austin Winsberg, the show was originally conceived as a real-time comedy; the first season was to show the first date of Jake and a woman. This was dropped during development, and the show became more conventional and episodic. The first aired episode reflected the original plan, and covering the first half-hour of a date. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Stamos Jake Phillips Wendie Malick Naomi Ian Gomez Rick Hoffman David Hornsby Full Cast & Crew Last Season Season 2 2006 | 8 Episodes Season 2 of Jake in Progress premiered on January  9, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jake in Progress. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m Homepage  - Genres Drama Keywords new york dating public relations Content Score 86 Almost there... Top Contributors 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}