{"link": "https://www.themoviedb.org/tv/1913?language=en", "title": "Killinaskully", "resume": "Killinaskully was an Irish television comedy which details the bizarre goings-on in a fictitious Irish village called Killinaskully located in the hills of Ireland. It was actually filmed on location in the villages of Killoscully and Ballinahinch in County Tipperary, the title being a fusion of these two placenames. The show's humour comes from the unusual characterisations of traditional, stereotypical rural Irish folk. The show was chiefly written by the comedian, Pat Shortt, who also performed many of his own roles. It has spawned its own themed holiday in farm accommodation in the Slieve Felim mountain range region, within walking distance of the village used for filming the series. In an allusion to the popular song released by Pat Shortt, visitors are given a complimentary \"Jumbo Breakfast Roll\" upon their arrival.\nKillinaskully was produced by Shortt's own company and has been broadcast by RTÉ as part of their Sunday night schedule since 2004. The first three series are available on DVD and VHS and have since been released in box set format. The show is currently in its fifth and final series, having begun transmission on 28 September 2008. It ceased on 2 November 2008, although the traditional special at Christmas time aired as normal the following month; in 2008 there were two such specials. Despite having a weekly audience of 800,000, Shortt has stated that this was the final series as he wishes to concentrate on the development of a new show with a new style, characters and storyline. Nevertheless, RTÉ continue to rerun the series as summer filler.", "rate": 0, "genre": ["Comedy"], "cast": ["Pat Shortt", "Joe Rooney"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1913   Expand Killinaskully   (2003) User Score Overview Killinaskully was an Irish television comedy which details the bizarre goings-on in a fictitious Irish village called Killinaskully located in the hills of Ireland. It was actually filmed on location in the villages of Killoscully and Ballinahinch in County Tipperary, the title being a fusion of these two placenames. The show's humour comes from the unusual characterisations of traditional, stereotypical rural Irish folk. The show was chiefly written by the comedian, Pat Shortt, who also performed many of his own roles. It has spawned its own themed holiday in farm accommodation in the Slieve Felim mountain range region, within walking distance of the village used for filming the series. In an allusion to the popular song released by Pat Shortt, visitors are given a complimentary \"Jumbo Breakfast Roll\" upon their arrival. Killinaskully was produced by Shortt's own company and has been broadcast by RTÉ as part of their Sunday night schedule since 2004. The first three series are available on DVD and VHS and have since been released in box set format. The show is currently in its fifth and final series, having begun transmission on 28 September 2008. It ceased on 2 November 2008, although the traditional special at Christmas time aired as normal the following month; in 2008 there were two such specials. Despite having a weekly audience of 800,000, Shortt has stated that this was the final series as he wishes to concentrate on the development of a new show with a new style, characters and storyline. Nevertheless, RTÉ continue to rerun the series as summer filler. Featured Crew Pat Shortt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pat Shortt Joe Rooney Full Cast & Crew Last Season Season 5 2008 | 8 Episodes Season 5 of Killinaskully premiered on July 28, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Killinaskully. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.rte.ie/tv/killinaskully/index.html Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}