{"link": "https://www.themoviedb.org/tv/316?language=en", "title": "Maniac Mansion", "resume": "Maniac Mansion was a Canadian sitcom created by Eugene Levy, which aired concurrently on YTV in Canada and The Family Channel in the United States for three seasons from September 17, 1990 to April 4, 1993.\nThe series is very loosely based on the popular 1987 LucasArts video game of the same name. While LucasFilm served as co-producers on the series, the show thematically shares little in common with its source material.", "rate": 0, "genre": ["Comedy"], "cast": ["Joe Flaherty", "Deborah Theaker", "George Buza", "Kathleen Robertson", "Mary Charlotte Wilcox"], "character": ["Dr. Fred Edison", "Tina Edison"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 316   Expand Maniac Mansion   (1990) User Score Overview Maniac Mansion was a Canadian sitcom created by Eugene Levy, which aired concurrently on YTV in Canada and The Family Channel in the United States for three seasons from September 17, 1990 to April 4, 1993. The series is very loosely based on the popular 1987 LucasArts video game of the same name. While LucasFilm served as co-producers on the series, the show thematically shares little in common with its source material. Featured Crew Eugene Levy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Flaherty Dr. Fred Edison Deborah Theaker George Buza Kathleen Robertson Tina Edison Mary Charlotte Wilcox Full Cast & Crew Last Season Season 3 1992 | 22 Episodes Season 3 of Maniac Mansion premiered on September  7, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Maniac Mansion. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}