{"link": "https://www.themoviedb.org/tv/68060?language=en", "title": "Mobile Suit Gundam Unicorn RE:0096", "resume": "U.C. 0096. Three years after Char's Rebellion, Banagher Links, a boy living at the manufacturing colony Industrial 7, meets a mysterious girl who calls herself Audrey Burne. Audrey claims that she is trying to stop the Vist Foundation from handing over Laplace's Box to the Neo Zeon remnants known as the Sleeves, an act which could spark another war, and Banagher decides to help her. But the colony becomes a battlefield as fighting breaks out between the Sleeves and the Earth Federation Forces, who have also come to stop the handover...", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68060   Expand Mobile Suit Gundam Unicorn RE:0096   (2016) User Score Overview U.C. 0096. Three years after Char's Rebellion, Banagher Links, a boy living at the manufacturing colony Industrial 7, meets a mysterious girl who calls herself Audrey Burne. Audrey claims that she is trying to stop the Vist Foundation from handing over Laplace's Box to the Neo Zeon remnants known as the Sleeves, an act which could spark another war, and Banagher decides to help her. But the colony becomes a battlefield as fighting breaks out between the Sleeves and the Earth Federation Forces, who have also come to stop the handover... Featured Crew Kazuhiro Furuhashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 22 Episodes Season 1 of Mobile Suit Gundam Unicorn RE:0096 premiered on April  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Gundam Unicorn RE:0096. You can help by rating TV shows you've seen. Facts Original Name  機動戦士ガンダムユニコーン RE:0096 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords gundam Content Score 64 We're so close, yet so far. Top Contributors n 36 naka 9 Jenazad 6 Elizabeth Jennings 4 batellium  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}