{"link": "https://www.themoviedb.org/tv/44310?language=en", "title": "11eyes", "resume": "Satsuki Kakeru lost his sister by suicide and has been living a dull life ever since then. One day, he is transported into a bizarre world \"Red Night\" along with his friend Minase Yuka. In order to survive and escape from Red Night, he fights against Dark Spirits (Ralva) and Black Nights.", "rate": 80, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Daisuke Ono"], "character": ["Kakeru Satsuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44310   Expand 11eyes   (2009) User Score Overview Satsuki Kakeru lost his sister by suicide and has been living a dull life ever since then. One day, he is transported into a bizarre world \"Red Night\" along with his friend Minase Yuka. In order to survive and escape from Red Night, he fights against Dark Spirits (Ralva) and Black Nights. Featured Crew Masami Shimoda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daisuke Ono Kakeru Satsuki Full Cast & Crew Last Season 11eyes 2009 | 12 Episodes Season 1 of 11eyes premiered on October  7, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  12 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on 11eyes. You can help by rating TV shows you've seen. Facts Original Name  イレブンアイズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords fantasy romance ecchi anime Content Score 64 We're so close, yet so far. Top Contributors Z 19 Zayrus 17 Elizabeth Jennings 13 Dreydor 5 Alcides Lemos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}