{"link": "https://www.themoviedb.org/tv/69715?language=en", "title": "Humorously Yours", "resume": "Follows the life of Vipul Goyal , a Stand Up comedian. As the tagline says \"The drama behind the comedy\"", "rate": 63, "genre": ["Comedy", "Drama"], "cast": ["Vipul Goyal", "Rasika Dugal", "Abhishek Banerjee"], "character": ["Vipul Goyal", "Kavya", "Bhushi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69715   Expand Humorously Yours   (2016) User Score  Play Trailer Overview Follows the life of Vipul Goyal , a Stand Up comedian. As the tagline says \"The drama behind the comedy\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vipul Goyal Vipul Goyal Rasika Dugal Kavya Abhishek Banerjee Bhushi Full Cast & Crew Last Season Season 1 2016 | 5 Episodes Season 1 of Humorously Yours premiered on December 11, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   2016-08-28 TVF Tripling 8.0    2015-06-03 TVF Pitchers 6.9    2014-04-06 Silicon Valley 7.9  Facts Status  Ended Networks TVFPlay  Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Hindi Runtime  30m Homepage   http://tvfplay.com/category/1/series/145 Genres Comedy Drama Keywords comedian stand-up comedy behind the scenes Content Score 64 We're so close, yet so far. Top Contributors s 60 shahimclt 2 Prithu TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}