{"link": "https://www.themoviedb.org/tv/76127?language=en", "title": "Hakumei and Mikochi", "resume": "While Hakumei is cheerful, outgoing and prefers to be outside, Mikochi is more introverted and prefers to stay indoors. These differences will set the tone for their friendship. Riding on insects and birds, creating tools from the forest and living their normal lives, day to day chores can be the biggest adventure in a small world full of wonders.", "rate": 70, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76127   Expand Hakumei and Mikochi   (2018) User Score Overview While Hakumei is cheerful, outgoing and prefers to be outside, Mikochi is more introverted and prefers to stay indoors. These differences will set the tone for their friendship. Riding on insects and birds, creating tools from the forest and living their normal lives, day to day chores can be the biggest adventure in a small world full of wonders. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Hakumei and Mikochi premiered on January 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Hakumei and Mikochi. You can help by rating TV shows you've seen. Facts Original Name  ハクメイとミコチ Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://hakumiko.com/ Genres Animation Sci-Fi & Fantasy Keywords based on manga Content Score 56 We're so close, yet so far. Top Contributors 13 Elizabeth Jennings 12 sp1ti b 6 beachsounddog D 5 Destr0y  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}