{"link": "https://www.themoviedb.org/tv/7049?language=en", "title": "American Muscle Car", "resume": "American Muscle Car is a weekly television show on Speed, produced by Restoration Productions LLC., about muscle cars. Each episode provides a timeline of each vehicle's history beginning with its first year of production to its most recent year of production. The show was initially designed to showcase traditional muscle cars such as the Chevrolet Camaro, Ford Mustang, and Dodge Charger. It eventually added other performance vehicles such as the Shelby Cobra and the Chevrolet Corvette, and even began to focus on specific eras such as the Corvette Stingray. It even created a special dedicated to the last 1967 Corvette Stingray produced.\nIn 2006 season, the show's focus was expanded to include designers and engineers of muscle car era.\nIn 2007 season, the show's focus was expanded to include vintage races, powertrain components.", "rate": 80, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7049   Expand American Muscle Car User Score Overview American Muscle Car is a weekly television show on Speed, produced by Restoration Productions LLC., about muscle cars. Each episode provides a timeline of each vehicle's history beginning with its first year of production to its most recent year of production. The show was initially designed to showcase traditional muscle cars such as the Chevrolet Camaro, Ford Mustang, and Dodge Charger. It eventually added other performance vehicles such as the Shelby Cobra and the Chevrolet Corvette, and even began to focus on specific eras such as the Corvette Stingray. It even created a special dedicated to the last 1967 Corvette Stingray produced. In 2006 season, the show's focus was expanded to include designers and engineers of muscle car era. In 2007 season, the show's focus was expanded to include vintage races, powertrain components. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 — | 14 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  2 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}