{"link": "https://www.themoviedb.org/tv/28061?language=en", "title": "School Days", "resume": "A rumor states that if you take a photo of someone you like with your cellphone and keep it hidden, they'll fall for you. Will Makoto win his love by taking a picture of Kotonoha without anyone knowing?", "rate": 63, "genre": ["Animation", "Drama"], "cast": ["Daisuke Hirakawa", "Tae Okajima", "Shiho Kawaragi", "Keiko Imoto", "Ryouko Tanaka"], "character": ["Makoto Itou (voice)", "Kotonoha Katsura (voice)", "Sekai Saionji (voice)", "Setsuna Kiyoura (voice)", "Hikari Kuroda (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28061   Expand School Days   (2007) User Score Overview A rumor states that if you take a photo of someone you like with your cellphone and keep it hidden, they'll fall for you. Will Makoto win his love by taking a picture of Kotonoha without anyone knowing? Featured Crew Keitaro Motonaga Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Daisuke Hirakawa Makoto Itou (voice) Tae Okajima Kotonoha Katsura (voice) Shiho Kawaragi Sekai Saionji (voice) Keiko Imoto Setsuna Kiyoura (voice) Ryouko Tanaka Hikari Kuroda (voice) Full Cast & Crew Last Season Season 1 2007 | 12 Episodes Season 1 of School Days premiered on July  4, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2004-04-25 Bible Black: New Testament 6.5    2001-07-21 Bible Black: The Night of  Walpurgis 8.0    2010-04-03 Angel Beats! 7.4    2003-11-03 Great Teacher Onizuka 8.4    1991-08-11 The Ren & Stimpy Show 7.2    2012-01-10 Another 7.2    1990-01-01 Mr. Bean 7.8  Facts Original Name  スクールデイズ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://schooldays.us/ Genres Animation Drama Keywords high school love triangle cheating harem romance crush school teenager love affair high school friends based on visual novel Content Score 100 Yes! Looking good! Top Contributors 109 Marr 🇳🇱 7 Greg z 6 zurman1 B 4 Bonsai  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}