{"link": "https://www.themoviedb.org/tv/74183?language=en", "title": "King's Game - The Animation", "resume": "Nobuaki Kanazawa, who transferred to a high school far away, is afraid of getting intimate with his new classmates because of the events that happened from his previous school. This led him to shut his heart. However, he starts to open up during the sports festival’s class relay. He and all his classmates received an email from “King.” At first, his classmates didn’t take what they were told seriously, thinking it’s just a joke, but Nobuaki, the only one who knows the real meaning of it, fights against the “death” game that will soon begin…\nThe rules of the King’s Game are as follows:\n\nAll class members must participate.\nThe order sent by King through email must be followed within 24 hours.\nA punishment will be given to those who don’t follow the order.\nQuitting the King’s Game halfway is forbidden.", "rate": 55, "genre": ["Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74183   Expand King's Game - The Animation   (2017) User Score Overview Nobuaki Kanazawa, who transferred to a high school far away, is afraid of getting intimate with his new classmates because of the events that happened from his previous school. This led him to shut his heart. However, he starts to open up during the sports festival’s class relay. He and all his classmates received an email from “King.” At first, his classmates didn’t take what they were told seriously, thinking it’s just a joke, but Nobuaki, the only one who knows the real meaning of it, fights against the “death” game that will soon begin… The rules of the King’s Game are as follows: All class members must participate. The order sent by King through email must be followed within 24 hours. A punishment will be given to those who don’t follow the order. Quitting the King’s Game halfway is forbidden. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2017 | 12 Episodes Season 1 of King's Game - The Animation premiered on October  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on King's Game - The Animation. You can help by rating TV shows you've seen. Facts Original Name  王様ゲーム The Animation Status  In Production Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://kingsgame-anime.com/ Genres Animation Drama Keywords mystery survival game Content Score 56 We're so close, yet so far. Top Contributors 18 sp1ti D 16 Destr0y 8 Despair-Paradise 5 sekaidown04  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}