{"link": "https://www.themoviedb.org/tv/4317?language=en", "title": "The Telegoons", "resume": "The Telegoons is a comedy puppet show, adapted from the highly successful BBC radio comedy show of the 1950s, The Goon Show produced for BBC television and first shown during 1963 and 1964. Two series of 13 episodes were made. The series was briefly repeated immediately after its original run, and all episodes are known to have survived. Harry Secombe, Peter Sellers and Spike Milligan reprised their original voice roles from the radio series and appeared in promotional photos with some of the puppets from the series. A Telegoons comic strip appeared in TV Comic during the 1960s. Among the puppeteers were Ann Field, John Dudley and Violet Phelan.\nThe only official broadcasts of any Telegoons material since the 1960s were a short excerpt, claimed to have been newly printed from the original negative, shown on the 1980s BBC archive series Windmill, and a brief excerpt during the quiz programme Telly Addicts.", "rate": 0, "genre": ["Comedy"], "cast": ["Peter Sellers", "Spike Milligan", "Harry Secombe"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4317   Expand The Telegoons   (1963) User Score Overview The Telegoons is a comedy puppet show, adapted from the highly successful BBC radio comedy show of the 1950s, The Goon Show produced for BBC television and first shown during 1963 and 1964. Two series of 13 episodes were made. The series was briefly repeated immediately after its original run, and all episodes are known to have survived. Harry Secombe, Peter Sellers and Spike Milligan reprised their original voice roles from the radio series and appeared in promotional photos with some of the puppets from the series. A Telegoons comic strip appeared in TV Comic during the 1960s. Among the puppeteers were Ann Field, John Dudley and Violet Phelan. The only official broadcasts of any Telegoons material since the 1960s were a short excerpt, claimed to have been newly printed from the original negative, shown on the 1980s BBC archive series Windmill, and a brief excerpt during the quiz programme Telly Addicts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Sellers Spike Milligan Harry Secombe Full Cast & Crew Last Season Season 2 1964 | 15 Episodes Season 2 of The Telegoons premiered on March 28, 1964. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Telegoons. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Comedy Keywords puppet british humour Content Score 43 There's no 'I' in team... Top Contributors O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}