{"link": "https://www.themoviedb.org/tv/71392?language=en", "title": "This Is Life Live", "resume": "Watch families across the country go on a personal journey and share the joy, elation and surprise of once-in-a lifetime transformative moments. This groundbreaking event follows people about to experience an extraordinary circumstance and ultimately leading to a live tv moment.", "rate": 43, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71392   Expand This Is Life Live   (2017) User Score Overview Watch families across the country go on a personal journey and share the joy, elation and surprise of once-in-a lifetime transformative moments. This groundbreaking event follows people about to experience an extraordinary circumstance and ultimately leading to a live tv moment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2 2018 | 1 Episode Season 2 of This Is Life Live premiered on May 15, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply b Drunk driver Jim Open 0 by bgirlmagic\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on This Is Life Live. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   https://www.tlc.com/tv-shows/this-is-life-live/ Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors j 10 janzenalexandra86 7 Elizabeth Jennings i 2 imeldavega91 2 Sall  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}