{"link": "https://www.themoviedb.org/tv/78306?language=en", "title": "Hotel on the Brink!", "resume": "Staffed by sketchy people, this rock-bottom hotel is on the brink of bankruptcy! Out of nowhere, the ultimate shady guest arrives. This is the story of a hotel's “miraculous” transformation.", "rate": 0, "genre": ["Comedy"], "cast": ["Takanori Iwata", "Erika Toda", "Kosuke Suzuki", "Ikkei Watanabe", "Ryō"], "character": ["Naoya Ukai", "Sana Sakurai", "Akito Tanzawa", "Masao Tokisada", "Kozue Edagawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78306   Expand Hotel on the Brink!   (2018) User Score Overview Staffed by sketchy people, this rock-bottom hotel is on the brink of bankruptcy! Out of nowhere, the ultimate shady guest arrives. This is the story of a hotel's “miraculous” transformation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takanori Iwata Naoya Ukai Erika Toda Sana Sakurai Kosuke Suzuki Akito Tanzawa Ikkei Watanabe Masao Tokisada Ryō Kozue Edagawa Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Hotel on the Brink! premiered on April 15, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hotel on the Brink!. You can help by rating TV shows you've seen. Facts Original Name  崖っぷちホテル！ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   https://www.ntv.co.jp/gakehote/ Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 34 Maria180493 4 Elizabeth Jennings A 3 Arius11 2 magiclantern  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}