{"link": "https://www.themoviedb.org/tv/15179?language=en", "title": "Bolek and Lolek", "resume": "Bolek and Lolek are two Polish cartoon characters from the TV animated series by the same title. They are based on Władysław Nehrebecki's sons, named Jan and Roman, and were partially created by German-born Alfred Ledwig before being developed by Władysław Nehrebecki and Leszek Lorek. The series is about two young brothers and their fun and sometimes silly adventures which often involve spending a lot of time outdoors. They first appeared in an animated film in 1963.\nThe names of the two characters are diminutives of Bolesław and Karol. In English, the cartoon was distributed as Jym & Jam and Bennie and Lennie. Some episodes were seen as part of Nickelodeon's Pinwheel. In 1973 the creators of the film placed on the request from the female viewing audience a girl character by the name of Tola. The first time she appeared in occurred in the episode entitled \"Tola\". In total, Tola appeared in 30 episodes.\nMost episodes do not have dialogues. Exceptions are feature-length films and the series from the 1980s, where the main characters' voices were done by: Bolek – Ewa Złotowska, Ilona Kuśmierska; Lolek – Danuta Mancewicz, Danuta Przesmycka.\nDuring the period of the Peoples Republic of Poland, Bolek and Lolek were reproduced in a large quantity of toys: action figures, movies, postcards, online arcades, puzzles, etc., which can be seen in the Museum of Dobranocki of the PRL. They are also currently made in computer programs, coloring books, general picture books and games.", "rate": 60, "genre": ["Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15179   Expand Bolek and Lolek User Score Overview Bolek and Lolek are two Polish cartoon characters from the TV animated series by the same title. They are based on Władysław Nehrebecki's sons, named Jan and Roman, and were partially created by German-born Alfred Ledwig before being developed by Władysław Nehrebecki and Leszek Lorek. The series is about two young brothers and their fun and sometimes silly adventures which often involve spending a lot of time outdoors. They first appeared in an animated film in 1963. The names of the two characters are diminutives of Bolesław and Karol. In English, the cartoon was distributed as Jym & Jam and Bennie and Lennie. Some episodes were seen as part of Nickelodeon's Pinwheel. In 1973 the creators of the film placed on the request from the female viewing audience a girl character by the name of Tola. The first time she appeared in occurred in the episode entitled \"Tola\". In total, Tola appeared in 30 episodes. Most episodes do not have dialogues. Exceptions are feature-length films and the series from the 1980s, where the main characters' voices were done by: Bolek – Ewa Złotowska, Ilona Kuśmierska; Lolek – Danuta Mancewicz, Danuta Przesmycka. During the period of the Peoples Republic of Poland, Bolek and Lolek were reproduced in a large quantity of toys: action figures, movies, postcards, online arcades, puzzles, etc., which can be seen in the Museum of Dobranocki of the PRL. They are also currently made in computer programs, coloring books, general picture books and games. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 1965 | 1 Episode Season 2 of Bolek and Lolek premiered on January  1, 1965. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Facts Original Name  Bolek i Lolek Status  Ended Network Certification  - Type  Scripted Original Language  Polish Runtime  - Homepage  - Genres Animation Kids Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors M 21 Michal 6 mikme a 6 asusar 4 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}