{"link": "https://www.themoviedb.org/tv/10336?language=en", "title": "Sifl & Olly Show", "resume": "The Sifl and Olly Show is a comedy TV series that used sock puppets, animation, and music. Musicians Liam Lynch and Matt Crocco, friends since childhood, created and performed the series. The first episode aired on MTV in 1997. The show was cancelled in 1999. The characters, along with new material, currently appear on Liam Lynch's podcast entitled Lynchland.", "rate": 0, "genre": ["Comedy", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10336   Expand Sifl & Olly Show   (1998) User Score Overview The Sifl and Olly Show is a comedy TV series that used sock puppets, animation, and music. Musicians Liam Lynch and Matt Crocco, friends since childhood, created and performed the series. The first episode aired on MTV in 1997. The show was cancelled in 1999. The characters, along with new material, currently appear on Liam Lynch's podcast entitled Lynchland. Featured Crew Matt Crocco Creator Liam Lynch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season The Lost Episodes 2001 | 27 Episodes Season 3 of Sifl & Olly Show premiered on January  1, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sifl & Olly Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Animation Keywords puppet Content Score 64 We're so close, yet so far. Top Contributors 19 Banana R 4 Rob 1 kuzronk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}