{"link": "https://www.themoviedb.org/tv/66672?language=en", "title": "Son of a Bitch", "resume": "An original comic-drama fiction series that portrays the routine of a Brazilian soccer referee in the pursuit of his biggest dream: to blow the whistle at a World Cup final.", "rate": 90, "genre": ["Comedy", "Drama"], "cast": ["Vitor Moretti", "Saulo Vasconcelos", "Maria Cecília Audi", "Fernanda Franceschetto", "Paulo Tiefenthaler"], "character": ["Vinny", "Sérgio", "Rosali", "Vitória", "Carvalhosa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66672   Expand Son of a Bitch   (2012) User Score Overview An original comic-drama fiction series that portrays the routine of a Brazilian soccer referee in the pursuit of his biggest dream: to blow the whistle at a World Cup final. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vitor Moretti Vinny Saulo Vasconcelos Sérgio Maria Cecília Audi Rosali Fernanda Franceschetto Vitória Paulo Tiefenthaler Carvalhosa Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Son of a Bitch premiered on August 26, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Son of a Bitch. You can help by rating TV shows you've seen. Facts Original Name  (fdp) Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  - Homepage  - Genres Comedy Drama Keywords soccer Content Score 86 Almost there... Top Contributors 31 EveDemocracy r 5 ruinzaO 1 wilclefison  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}