{"link": "https://www.themoviedb.org/tv/40293?language=en", "title": "Da Vinci's Demons", "resume": "The series follows the \"untold\" story of Leonardo Da Vinci: the genius during his early years in Renaissance Florence. As a 25-year old artist, inventor, swordsman, lover, dreamer and idealist, he struggles to live within the confines of his own reality and time as he begins to not only see the future, but invent it.", "rate": 74, "genre": ["Fantasy", "Drama"], "cast": ["Tom Riley", "Laura Haddock", "Elliot Cowan", "Gregg Chillin", "Eros Vlahos"], "character": ["Leonardo Da Vinci", "Lucrezia Donati", "Lorenzo Medici", "Zoroaster", "Nico"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40293   Expand Da Vinci's Demons   (2013) User Score  Play Trailer Overview The series follows the \"untold\" story of Leonardo Da Vinci: the genius during his early years in Renaissance Florence. As a 25-year old artist, inventor, swordsman, lover, dreamer and idealist, he struggles to live within the confines of his own reality and time as he begins to not only see the future, but invent it. Featured Crew David S. Goyer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  20 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Riley Leonardo Da Vinci Laura Haddock Lucrezia Donati Elliot Cowan Lorenzo Medici Gregg Chillin Zoroaster Eros Vlahos Nico Full Cast & Crew Last Season Season 3 2015 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  20 Posters  12 Recommendations   2013-11-17 Almost Human 7.0    2012-05-27 Continuum 7.1    2013-09-16 Sleepy Hollow 6.4    2013-01-21 The Following 6.2    2013-04-15 Defiance 6.2    2008-09-09 Fringe 8.1    2010-01-22 Spartacus 7.8    2013-01-11 Banshee 7.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.starz.com/originals/davincisdemons Genres Fantasy Drama Keywords inventor italy old town leonardo da vinci castle europe florence discovery outdoor renaissance early modern period Content Score 100 Yes! Looking good! Top Contributors 68 Elizabeth Jennings 8 david8s95 7 Atanas 6 kwagi_movie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}