{"link": "https://www.themoviedb.org/tv/1160?language=en", "title": "Beach Girls", "resume": "Beach Girls was a six-part 2005 American mini-series produced by Fox and Robert Greenwald Productions and broadcast by Lifetime. The teleplay by Edithe Swensen, Elle Triedman, and Eric Tuchman was based on the bestselling novel by Luanne Rice.\nThe Beach Girls were three teenagers who spent their summers in the small, quiet beach town of Hubbard's Point. The trio grew apart and eventually went their separate ways, but the death of one of them reunites the surviving two, Stevie and Maddie, when her widower Jack and daughter Nell arrive in town.\nPaul Shapiro, Sandy Smolan, and Jeff Woolnough shared directing credits. The cast included Rob Lowe as Jack, Chelsea Hobbs as Nell, Julia Ormond as Stevie, and Katherine Ashby as Maddie, with Chris Carmack and Cloris Leachman in featured roles.\nThe opening credits theme song was \"Dreams,\" written by Dolores O'Riordan and Noel Hogan and performed by The Cranberries.\nThe series was filmed in Chester, Crystal Crescent Beach, and Halifax, all located in Nova Scotia, Canada. It aired in France and Sweden in 2006, Australia in 2007 and New Zealand in 2010. It has been released on DVD by Warner Home Video.", "rate": 0, "genre": ["Drama"], "cast": ["Rob Lowe", "Chelsea Hobbs", "Meredith Henderson", "Nigel Bennett", "Julia Ormond"], "character": ["Jack Kilvert", "Nell Kilvert", "Stevie Moore"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1160   Expand Beach Girls   (2005) User Score Overview Beach Girls was a six-part 2005 American mini-series produced by Fox and Robert Greenwald Productions and broadcast by Lifetime. The teleplay by Edithe Swensen, Elle Triedman, and Eric Tuchman was based on the bestselling novel by Luanne Rice. The Beach Girls were three teenagers who spent their summers in the small, quiet beach town of Hubbard's Point. The trio grew apart and eventually went their separate ways, but the death of one of them reunites the surviving two, Stevie and Maddie, when her widower Jack and daughter Nell arrive in town. Paul Shapiro, Sandy Smolan, and Jeff Woolnough shared directing credits. The cast included Rob Lowe as Jack, Chelsea Hobbs as Nell, Julia Ormond as Stevie, and Katherine Ashby as Maddie, with Chris Carmack and Cloris Leachman in featured roles. The opening credits theme song was \"Dreams,\" written by Dolores O'Riordan and Noel Hogan and performed by The Cranberries. The series was filmed in Chester, Crystal Crescent Beach, and Halifax, all located in Nova Scotia, Canada. It aired in France and Sweden in 2006, Australia in 2007 and New Zealand in 2010. It has been released on DVD by Warner Home Video. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Lowe Jack Kilvert Chelsea Hobbs Nell Kilvert Meredith Henderson Nigel Bennett Julia Ormond Stevie Moore Full Cast & Crew Last Season Season 1 2005 | 6 Episodes Season 1 of Beach Girls premiered on July 31, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Beach Girls. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.lifetimetv.com Genres Drama Keywords female friendship miniseries single father hometown Content Score 86 Almost there... Top Contributors 6 Banana 3 mdw  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}