{"link": "https://www.themoviedb.org/tv/3380?language=en", "title": "Starhunter", "resume": "Starhunter is a Canadian science fiction television series that aired for two seasons. The series was produced in Canada by The Danforth Studios Ltd. in association with Alliance Atlantis with some photography in the United Kingdom. Grosvenor Park Productions UK Ltd. was the co-producer from the United Kingdom, and Le Sabre SA, an affiliate of Canal+, was the French co-producer, with major unofficial German participation by Das Werk.\nIn season one, Starhunter starred Michael Paré, Tanya Allen, Claudette Roche and featured Murray Melvin and Stephen Marcus. In season two Clive Robertson, Dawn Stern and Paul Fox were added to the cast, while the original actors except Allen and Marcus were dropped. Contrary to the wishes of the series creators, the investors in the second season blocked the return of Paré and replaced Melvin.\nSeason one was nominated by the Directors Guild of Canada for a Best Production Design award, and for a \"Spaceys Award\" by Space: The Imagination Station.\nThe first run of the first season aired in Canada, from 1 November 2000 to 28 March 2001. Starhunter was syndicated in the United States by Western Television Syndicators, going to air in the fall of 2002. The first season continues to re-run in many territories. The second season had its first run in Canada from 9 August 2003 to 3 April 2004.", "rate": 70, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Michael Paré", "Tanya Allen", "Paul Fox", "Clive Robertson", "Murray Melvin"], "character": ["Dante Montana", "Percy Montana", "Marcus Fagen", "Travis Montana", "Caravaggio AI"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3380   Expand Starhunter   (2000) User Score Overview Starhunter is a Canadian science fiction television series that aired for two seasons. The series was produced in Canada by The Danforth Studios Ltd. in association with Alliance Atlantis with some photography in the United Kingdom. Grosvenor Park Productions UK Ltd. was the co-producer from the United Kingdom, and Le Sabre SA, an affiliate of Canal+, was the French co-producer, with major unofficial German participation by Das Werk. In season one, Starhunter starred Michael Paré, Tanya Allen, Claudette Roche and featured Murray Melvin and Stephen Marcus. In season two Clive Robertson, Dawn Stern and Paul Fox were added to the cast, while the original actors except Allen and Marcus were dropped. Contrary to the wishes of the series creators, the investors in the second season blocked the return of Paré and replaced Melvin. Season one was nominated by the Directors Guild of Canada for a Best Production Design award, and for a \"Spaceys Award\" by Space: The Imagination Station. The first run of the first season aired in Canada, from 1 November 2000 to 28 March 2001. Starhunter was syndicated in the United States by Western Television Syndicators, going to air in the fall of 2002. The first season continues to re-run in many territories. The second season had its first run in Canada from 9 August 2003 to 3 April 2004. Featured Crew Daniel D'Or Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Paré Dante Montana Tanya Allen Percy Montana Paul Fox Marcus Fagen Clive Robertson Travis Montana Murray Melvin Caravaggio AI Full Cast & Crew Last Season Season 2 2003 | 22 Episodes Season 2 of Starhunter premiered on August  9, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Starhunter. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.starhunteronline.co.nr/ Genres Sci-Fi & Fantasy Keywords future bounty hunter space Content Score 93 Almost there... Top Contributors 8 Banana s 5 smallguy p 4 pioupiouka w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}