{"link": "https://www.themoviedb.org/tv/12154?language=en", "title": "The Adventures of Sir Lancelot", "resume": "The Adventures of Sir Lancelot is a British television series first broadcast in 1956, produced by Sapphire Films for ITC Entertainment and screened on the ITV network. The series starred William Russell as the eponymous Sir Lancelot, a Knight of the Round Table in the time of King Arthur at Camelot.\nThe series debuted in the UK on Saturday 15 September 1956, on London weekend ITV franchise holder ATV, and on the NBC network in the United States nine days later. It is one of the very few British television series ever to have been screened on one of the major broadcast networks in the US. Its success on NBC led to it becoming the first British television series ever to be produced in colour, the last fourteen of the thirty half-hour episodes being shot on colour stock, although they were seen in colour only in the US. The last episode was shown on 20 April 1957 in the UK and 16 September 1957 on NBC. It later transferred networks in the US to ABC, who repeated the episodes from October 1957 to September 1958.\nAs was common with other British television series of the time, the programme employed several American screenwriters who had moved to Britain after being placed on the Hollywood blacklist, often under pseudonyms. These included Ian McLellan Hunter and Ring Lardner Jr. The series was produced by Sidney Cole, Dallas Bower and Bernard Knowles and made at Nettlefold Studios in Walton-on-Thames.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["William Russell", "Ronald Leigh-Hunt", "Derren Nesbitt", "Cyril Smith", "Robert Scroggins"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12154   Expand The Adventures of Sir Lancelot   (1956) User Score Overview The Adventures of Sir Lancelot is a British television series first broadcast in 1956, produced by Sapphire Films for ITC Entertainment and screened on the ITV network. The series starred William Russell as the eponymous Sir Lancelot, a Knight of the Round Table in the time of King Arthur at Camelot. The series debuted in the UK on Saturday 15 September 1956, on London weekend ITV franchise holder ATV, and on the NBC network in the United States nine days later. It is one of the very few British television series ever to have been screened on one of the major broadcast networks in the US. Its success on NBC led to it becoming the first British television series ever to be produced in colour, the last fourteen of the thirty half-hour episodes being shot on colour stock, although they were seen in colour only in the US. The last episode was shown on 20 April 1957 in the UK and 16 September 1957 on NBC. It later transferred networks in the US to ABC, who repeated the episodes from October 1957 to September 1958. As was common with other British television series of the time, the programme employed several American screenwriters who had moved to Britain after being placed on the Hollywood blacklist, often under pseudonyms. These included Ian McLellan Hunter and Ring Lardner Jr. The series was produced by Sidney Cole, Dallas Bower and Bernard Knowles and made at Nettlefold Studios in Walton-on-Thames. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Russell Ronald Leigh-Hunt Derren Nesbitt Cyril Smith Robert Scroggins Full Cast & Crew Last Season Season 1 1956 | 30 Episodes Season 1 of The Adventures of Sir Lancelot premiered on September 15, 1956. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of Sir Lancelot. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}