{"link": "https://www.themoviedb.org/tv/67653?language=en", "title": "Casper and Emma", "resume": "Two 5-year-olds become best friends at school when they realize that each of them has a special stuffed animal that can talk.", "rate": 60, "genre": ["Family"], "cast": ["Elias Søvold-Simonsen", "Nora Amundsen", "Janne Formoe"], "character": ["Karsten", "Petra", "Maria"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67653   Expand Casper and Emma   (2013) User Score Overview Two 5-year-olds become best friends at school when they realize that each of them has a special stuffed animal that can talk. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elias Søvold-Simonsen Karsten Nora Amundsen Petra Janne Formoe Maria Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Casper and Emma premiered on September  8, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Casper and Emma. You can help by rating TV shows you've seen. Facts Original Name  Karsten og Petra Status  Ended Network Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  Norwegian Runtime  12m Homepage   https://tv.nrk.no/serie/karsten-og-petra Genres Family Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 38 Marr 🇳🇱 4 Kris Ekman TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}