{"link": "https://www.themoviedb.org/tv/2000?language=en", "title": "Ratz", "resume": "Ratz is an animated television series created by France's Xilam studios, with joint production from Canada. The show stars two rats, Rapido and Razmo, aboard the S.S. Wanderer, a cheese ship with no actual destination. The focus of the series is on the adventures of the two rats, including guarding the cheese, interacting with other stowaways and various ill-fated encounters with the crew. The rats themselves live in the hull of the ship in a lavish two-bedroom apartment.\nWhile being targeted at young children in France, the series has gained a small cult following of older ages in Canada, due to its original late night air time. The French version features the voices of the comedy duo Éric et Ramzy. Unlike most animated programs designed for a younger audience, Ratz has no moral resolve at the end of each episode.\nThe show is also notable for its positive portrayal of rats, unusual for Western and North American cultures, which often give its fictional rats selfish, antagonizing and evil characteristics. Also of interest is the pure blend of traditional animation and 3D animation, and the eclectic soundtrack by Hervé Lavandier.\nRatz was originally titled Rapido and featured a chunkier animation style; some websites still reflect this.", "rate": 0, "genre": ["Animation"], "cast": ["Emmanuel Garijo", "Sylvia Bergé", "Ramzy Bedia", "Eric Judor", "Gérard Rinaldi"], "character": ["Benny", "Svetlana", "Rapido", "Razmo", "Le capitaine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2000   Expand Ratz User Score Overview Ratz is an animated television series created by France's Xilam studios, with joint production from Canada. The show stars two rats, Rapido and Razmo, aboard the S.S. Wanderer, a cheese ship with no actual destination. The focus of the series is on the adventures of the two rats, including guarding the cheese, interacting with other stowaways and various ill-fated encounters with the crew. The rats themselves live in the hull of the ship in a lavish two-bedroom apartment. While being targeted at young children in France, the series has gained a small cult following of older ages in Canada, due to its original late night air time. The French version features the voices of the comedy duo Éric et Ramzy. Unlike most animated programs designed for a younger audience, Ratz has no moral resolve at the end of each episode. The show is also notable for its positive portrayal of rats, unusual for Western and North American cultures, which often give its fictional rats selfish, antagonizing and evil characteristics. Also of interest is the pure blend of traditional animation and 3D animation, and the eclectic soundtrack by Hervé Lavandier. Ratz was originally titled Rapido and featured a chunkier animation style; some websites still reflect this. Featured Crew Monsieur Z Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emmanuel Garijo Benny Sylvia Bergé Svetlana Ramzy Bedia Rapido Eric Judor Razmo Gérard Rinaldi Le capitaine Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  11m Homepage   http://www.xilam.com/Ratz_web/home.html Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors w 19 wremy 7 Morgancinema TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}