{"link": "https://www.themoviedb.org/tv/32632?language=en", "title": "Law & Order: Los Angeles", "resume": "Law & Order: LA, originally titled Law & Order: Los Angeles, is an American police procedural and legal drama television series set in Los Angeles, where it was produced. Created and produced by Dick Wolf and developed by Blake Masters, it premiered on NBC on September 29, 2010, as a spin-off of Wolf's successful crime drama Law & Order.\nThe show received a full season pickup on October 18, 2010. On January 18, 2011, however, NBC announced that it was putting the series on hold indefinitely. According to a representative of the show, the scheduling change was not caused entirely by the recent cast shake-up. The network later announced a return date for the series, April 11, 2011; and the final episode scheduled for July 11, 2011.\nLaw & Order: LA was canceled by NBC on May 13, 2011.", "rate": 53, "genre": ["Crime", "Drama"], "cast": ["Skeet Ulrich", "Alfred Molina", "Terrence Howard", "Regina Hall", "Corey Stoll"], "character": ["Detective Rex Winters", "Deputy D.A. Ricardo Morales", "Deputy D.A. Jonah Dekker", "Deputy D.A. Evelyn Price", "Detective Tomas 'TJ' Jaruszalski"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32632   Expand Law & Order: Los Angeles   (2010) User Score Overview Law & Order: LA, originally titled Law & Order: Los Angeles, is an American police procedural and legal drama television series set in Los Angeles, where it was produced. Created and produced by Dick Wolf and developed by Blake Masters, it premiered on NBC on September 29, 2010, as a spin-off of Wolf's successful crime drama Law & Order. The show received a full season pickup on October 18, 2010. On January 18, 2011, however, NBC announced that it was putting the series on hold indefinitely. According to a representative of the show, the scheduling change was not caused entirely by the recent cast shake-up. The network later announced a return date for the series, April 11, 2011; and the final episode scheduled for July 11, 2011. Law & Order: LA was canceled by NBC on May 13, 2011. Featured Crew Dick Wolf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Skeet Ulrich Detective Rex Winters Alfred Molina Deputy D.A. Ricardo Morales Terrence Howard Deputy D.A. Jonah Dekker Regina Hall Deputy D.A. Evelyn Price Corey Stoll Detective Tomas 'TJ' Jaruszalski Full Cast & Crew Last Season Season 1 2010 | 22 Episodes Season 1 of Law & Order: Los Angeles premiered on September 29, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Law & Order: Los Angeles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/law-and-order-los-angeles/ Genres Crime Drama Keywords lawyer los angeles murder investigation law and order lapd Content Score 93 Almost there... Top Contributors 37 Banana 5 Vampire Bai w 3 webmaster 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}