{"link": "https://www.themoviedb.org/tv/14442?language=en", "title": "Working Stiffs", "resume": "Working Stiffs is a short-lived 1979 American television series which starred James Belushi and Michael Keaton as brothers Ernie and Mike O'Rourke. The pair were janitors who aspired to work their way up in the field of business. The brothers worked in an office building owned by their Uncle Harry. Ernie and Mike also were roommates in an apartment over a cafe where they befriended the owner Mitch and waitress Nikki. Each episode featured slapstick and physical comedy. Penny Marshall directed the pilot. Includes an early appearance of Paul Reubens as Heimlich the delivery boy at the cafe.\nThe series aired on CBS. It competed against the highly-rated shows NBC's CHiPs and ABC's The Ropers in its timeslot. Nine episodes were produced but after four episodes aired, the series was canceled. After Belushi and Keaton became major film stars in the 1980s, six episodes of the show were released on home video. Reruns have also aired on A&E Network, Comedy Central and TV Land. The syndication package included the previously unaired episodes.", "rate": 0, "genre": ["Comedy"], "cast": ["Jim Belushi", "Michael Keaton", "Allan Arbus", "Val Bisoglio", "Lorna Patterson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14442   Expand Working Stiffs   (1979) User Score Overview Working Stiffs is a short-lived 1979 American television series which starred James Belushi and Michael Keaton as brothers Ernie and Mike O'Rourke. The pair were janitors who aspired to work their way up in the field of business. The brothers worked in an office building owned by their Uncle Harry. Ernie and Mike also were roommates in an apartment over a cafe where they befriended the owner Mitch and waitress Nikki. Each episode featured slapstick and physical comedy. Penny Marshall directed the pilot. Includes an early appearance of Paul Reubens as Heimlich the delivery boy at the cafe. The series aired on CBS. It competed against the highly-rated shows NBC's CHiPs and ABC's The Ropers in its timeslot. Nine episodes were produced but after four episodes aired, the series was canceled. After Belushi and Keaton became major film stars in the 1980s, six episodes of the show were released on home video. Reruns have also aired on A&E Network, Comedy Central and TV Land. The syndication package included the previously unaired episodes. Featured Crew Bob Brunner Creator David W. Duclon Creator Arthur Silver Creator Harry Colomby Creator Marc Sotkin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Belushi Michael Keaton Allan Arbus Val Bisoglio Lorna Patterson Full Cast & Crew Last Season Season 1 1979 | 9 Episodes Season 1 of Working Stiffs premiered on September 22, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Working Stiffs. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sibling relationship janitor working class sitcom living with sibling Content Score 79 Pump it up! We're close now. Top Contributors 14 Banana s 1 smccaula  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}