{"link": "https://www.themoviedb.org/tv/42783?language=en", "title": "An Istanbul Tale", "resume": "The series is made into 71 episodes. It takes place in Istanbul, Turkey. The story centers around two rich brothers Selim Arhan the elder and Demir Arhan the younger one. They are still living at home with their parents Omar Arhan and Baheye Arhan. They live in a large house and have a cook by the name of Suzanne and her husband the driver whose name is Jamal Kozan. They have three children; Cheche the eldest is 28, Esma the second daughter who is the star of the series and finally a son who is in his final year at school. Esma has loved Demir, the younger son, ever since she was a child but he never noticed her. She always followed his news in the magazines. One night she climbed a tree to watch the annual Spring party that his family was holding but her sister followed her and tried to force to come down from the tree resulting in her falling over the large cake and hurting her ankle. The next morning, Selim found her sitting in the garden of his house and discovered that her foot was hurting so he decided to take her to a doctor. Esma was going to audition that day for a dance but her father didn't know about it. She failed the audition because she couldn't dance well. One night Demir came home followed by one of his girlfriends who refused to leave and wanted to be invited inside. He told her that his girlfriend was there and so he couldn't receive her. To convince that girl to go away, he kissed Esma who was in standing there. She thought that such a kiss was a sign that he was beginning to notice her. One night Demir came home drunk and couldn't go to his room. Esma had a copy of the house keys and so went to him to help him to his room. She tired to help him out of his clothes when his mother came in and saw them together in bed. When Selim was told about that he thought that he could save matters by putting her name as one to the people who were going to do their training at Arhan indutries which happened to be the largest company in Turkey and where many people were always trying to get their training there to put it on their CVs.", "rate": 70, "genre": ["Drama"], "cast": ["Ahu Türkpençe", "Mehmet Aslantuğ", "Çetin Tekindor", "Arsen Gürzap", "Emre Karayel"], "character": ["Esma Kozan Arhan", "Selim Arhan", "Ömer Arhan", "Behiye Arhan", "Zekeriya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42783   Expand An Istanbul Tale   (2003) User Score Overview The series is made into 71 episodes. It takes place in Istanbul, Turkey. The story centers around two rich brothers Selim Arhan the elder and Demir Arhan the younger one. They are still living at home with their parents Omar Arhan and Baheye Arhan. They live in a large house and have a cook by the name of Suzanne and her husband the driver whose name is Jamal Kozan. They have three children; Cheche the eldest is 28, Esma the second daughter who is the star of the series and finally a son who is in his final year at school. Esma has loved Demir, the younger son, ever since she was a child but he never noticed her. She always followed his news in the magazines. One night she climbed a tree to watch the annual Spring party that his family was holding but her sister followed her and tried to force to come down from the tree resulting in her falling over the large cake and hurting her ankle. The next morning, Selim found her sitting in the garden of his house and discovered that her foot was hurting so he decided to take her to a doctor. Esma was going to audition that day for a dance but her father didn't know about it. She failed the audition because she couldn't dance well. One night Demir came home followed by one of his girlfriends who refused to leave and wanted to be invited inside. He told her that his girlfriend was there and so he couldn't receive her. To convince that girl to go away, he kissed Esma who was in standing there. She thought that such a kiss was a sign that he was beginning to notice her. One night Demir came home drunk and couldn't go to his room. Esma had a copy of the house keys and so went to him to help him to his room. She tired to help him out of his clothes when his mother came in and saw them together in bed. When Selim was told about that he thought that he could save matters by putting her name as one to the people who were going to do their training at Arhan indutries which happened to be the largest company in Turkey and where many people were always trying to get their training there to put it on their CVs. Featured Crew Erol Avcı Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ahu Türkpençe Esma Kozan Arhan Mehmet Aslantuğ Selim Arhan Çetin Tekindor Ömer Arhan Arsen Gürzap Behiye Arhan Emre Karayel Zekeriya Full Cast & Crew Last Season Season 2 — | 35 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on An Istanbul Tale. You can help by rating TV shows you've seen. Facts Original Name  Bir İstanbul Masalı Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  75m Homepage   http://tmc.com.tr/biristanbulmasali/ Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 43 purplelammashta u 17 ugurnazli b 14 bluwy s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}