{"link": "https://www.themoviedb.org/tv/6051?language=en", "title": "Valentine", "resume": "Valentine is a romantic comedy/drama television series that aired on The CW and City in Canada from October 5, 2008 to July 19, 2009. The series was created by Kevin Murphy, who also serves as executive producer alongside Courtney Conte. The show was produced by Media Rights Capital and aired on Sundays at 8:00pm. On November 20, 2008, CW pulled Valentine along with Easy Money. However, the series returned on Sunday, June 28, 2009 to begin burning off the remaining unaired episodes. The show's only season averaged 0.72 million viewers and 0.2 demo in Adults 18-49.", "rate": 77, "genre": ["Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["Jaime Murray", "Kristoffer Polaha", "Autumn Reeser", "Christine Lakin", "Patrick Fabian"], "character": ["Aphrodite", "Danny Valentine", "Phoebe Valentine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6051   Expand Valentine   (2008) User Score Overview Valentine is a romantic comedy/drama television series that aired on The CW and City in Canada from October 5, 2008 to July 19, 2009. The series was created by Kevin Murphy, who also serves as executive producer alongside Courtney Conte. The show was produced by Media Rights Capital and aired on Sundays at 8:00pm. On November 20, 2008, CW pulled Valentine along with Easy Money. However, the series returned on Sunday, June 28, 2009 to begin burning off the remaining unaired episodes. The show's only season averaged 0.72 million viewers and 0.2 demo in Adults 18-49. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jaime Murray Aphrodite Kristoffer Polaha Danny Valentine Autumn Reeser Phoebe Valentine Christine Lakin Patrick Fabian Full Cast & Crew Last Season Season 1 2008 | 8 Episodes Season 1 of Valentine premiered on October  5, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2011-10-28 Grimm 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cwtv.com/thecw/valentine Genres Sci-Fi & Fantasy Drama Comedy Keywords matchmaking gods Content Score 86 Almost there... Top Contributors 5 Banana s 3 speedycars 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}