{"link": "https://www.themoviedb.org/tv/79569?language=en", "title": "Lock Up Your Sisters", "resume": "When a young man suddenly inherits a fortune and finds out he has sisters he's never met, life with his newly rich family gets him into amusing situations.", "rate": 90, "genre": ["Comedy"], "cast": ["Ali Rabee"], "character": ["سعادة / سويلم"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79569   Expand Lock Up Your Sisters   (2018) User Score Overview When a young man suddenly inherits a fortune and finds out he has sisters he's never met, life with his newly rich family gets him into amusing situations. Featured Crew Karim Fahmy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ali Rabee سعادة / سويلم Full Cast & Crew Current Season Season 1 2018 | 30 Episodes Season 1 of Lock Up Your Sisters premiered on May 16, 2018. View All Seasons Social Reviews  1 Discussions  0 e A review by egymummy  9.0 Written by  egymummy  on May 18, 2018 When a young man suddenly inherits a fortune and finds out he has sisters he's never met, life with his newly rich family gets him into amusing situations.\nLock Up Your Sisters, Or in Another translation To Match The Exact Meaning in Arabic, Lock Onto Your Sisters ( To Lockup And Control )\nStar Ali Rabee Drops an Amazing performance as a young Guy from Upper Egypt, That A funny Situation Via Facebook Live Video, Made Him hated in His Own Small Village , His Mother Suggest That He Should go to The City ( Cairo ) to Run Away from The Village , She Tells him That His Father Did Not Die 20 Years...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Lock Up Your Sisters. You can help by rating TV shows you've seen. Facts Original Name  سك على اخواتك Status  Returning Series Networks Certification  - Type  Scripted Original Language  Arabic Runtime  - Homepage   http://www.mbc.net/ar/programs/sok-ala-ikhwatak.html Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 24 Elizabeth Jennings e 20 egymummy 9 Fahad TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}