{"link": "https://www.themoviedb.org/tv/34501?language=en", "title": "Dan Vs.", "resume": "Dan Vs. is an Emmy award winning American Flash animated television series created by Dan Mandel and Chris Pearson. The series has spanned three seasons, airing on Hub Network from January 1, 2011 to March 9, 2013. The series is rated TV-PG.", "rate": 75, "genre": ["Animation", "Comedy"], "cast": ["Mark Hamill", "Paget Brewster", "Henry Winkler", "John C. McGinley", "Dave Foley"], "character": ["Dr. Pullum", "Madame Zelda / Elise / Mr. Mumbles", "Hal", "Fake Dan", "Chris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34501   Expand Dan Vs.   (2011) User Score Overview Dan Vs. is an Emmy award winning American Flash animated television series created by Dan Mandel and Chris Pearson. The series has spanned three seasons, airing on Hub Network from January 1, 2011 to March 9, 2013. The series is rated TV-PG. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Hamill Dr. Pullum Paget Brewster Madame Zelda / Elise / Mr. Mumbles Henry Winkler Hal John C. McGinley Fake Dan Dave Foley Chris Full Cast & Crew Last Season Season 3 2012 | 13 Episodes Season 3 of Dan Vs. premiered on November 17, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dan Vs.. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.hubworld.com/dan-vs/shows/dan-vs Official Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 17 Elizabeth Jennings A 3 AnthonyAtkins232 R 3 Rebecca D 1 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}