{"link": "https://www.themoviedb.org/tv/6423?language=en", "title": "Peking Express", "resume": "Peking Express is a Dutch/Flemish reality game show that follows a series of couples as they hitchhike to or from Beijing. The series has already gone through five seasons. In the Netherlands it is screened by Net 5 and in Belgium by VT4. A German version was shown in 2004. The concept has also been sold to Scandinavia where it was broadcast for the first time in the autumn of 2007. The Scandinavian version is shown on Kanal 5 in Sweden, TVNorge in Norway and Kanal 5 in Denmark. A French version named Pékin Express is screened by M6, with nine seasons aired by 2013. It can be seen on TV5 outside France. In Spain, the local version Pekín Express is shown on Cuatro, with four seasons by 2011. An Italian version has been produced in 2012 by RAI and shown on Rai 2 with success; a second season will be broadcast in 2013.", "rate": 0, "genre": [], "cast": ["Ernst-Paul Hasselbach"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6423   Expand Peking Express   (2004) User Score Overview Peking Express is a Dutch/Flemish reality game show that follows a series of couples as they hitchhike to or from Beijing. The series has already gone through five seasons. In the Netherlands it is screened by Net 5 and in Belgium by VT4. A German version was shown in 2004. The concept has also been sold to Scandinavia where it was broadcast for the first time in the autumn of 2007. The Scandinavian version is shown on Kanal 5 in Sweden, TVNorge in Norway and Kanal 5 in Denmark. A French version named Pékin Express is screened by M6, with nine seasons aired by 2013. It can be seen on TV5 outside France. In Spain, the local version Pekín Express is shown on Cuatro, with four seasons by 2011. An Italian version has been produced in 2012 by RAI and shown on Rai 2 with success; a second season will be broadcast in 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ernst-Paul Hasselbach Full Cast & Crew Last Season Season 6 2012 | 9 Episodes Season 6 of Peking Express premiered on April  1, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Peking Express. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.net5.nl/web/show/id=80543/langid=43/dbid=76/typeofpage=78934/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}