{"link": "https://www.themoviedb.org/tv/63623?language=en", "title": "Fuller House", "resume": "D.J. Tanner-Fuller is a widow and mother of three. Things become too much to handle, so she asks for help from her sister Stephanie and her best-friend Kimmy.", "rate": 56, "genre": ["Family", "Comedy"], "cast": ["Jodie Sweetin", "Candace Cameron Bure", "Andrea Barber", "Elias Harger", "Soni Bringas"], "character": ["Stephanie Tanner", "DJ Tanner-Fuller", "Kimmy Gibbler", "Max Fuller", "Ramona Gibbler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63623   Expand Fuller House   (2016) User Score  Play Trailer Overview D.J. Tanner-Fuller is a widow and mother of three. Things become too much to handle, so she asks for help from her sister Stephanie and her best-friend Kimmy. Featured Crew Jeff Franklin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  4 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jodie Sweetin Stephanie Tanner Candace Cameron Bure DJ Tanner-Fuller Andrea Barber Kimmy Gibbler Elias Harger Max Fuller Soni Bringas Ramona Gibbler Full Cast & Crew Last Season Season 3 2017 | 18 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Favorite character? Open 1 by  peachy88 Will there be a 4th season? Open 1 by  loiskatnissskywalker a Why does everyone hate Fernando? Open 2 by  miinty'srevenge Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  9 Recommendations   2007-09-03 Super Why! 5.7    2017-03-17 Julie's Greenroom 7.8    2009-06-25 Stoked 6.3    2011-02-08 Traffic Light 7.2    2015-12-11 Lost & Found Music Studios 8.0    2016-03-26 Juana Inés 7.7    2016-08-12 Ask the Storybots 7.5    2015-08-07 Project Mc² 4.7  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage   https://www.netflix.com/title/80051137 Genres Family Comedy Keywords sibling relationship san francisco friends family full house Content Score 100 Yes! Looking good! Top Contributors 30 Elizabeth Jennings r 12 rjmartini13 9 Maretoh 8 awkwardmeow  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}