{"link": "https://www.themoviedb.org/tv/2606?language=en", "title": "Love Soup", "resume": "Love Soup is a British television comedy-drama produced by the BBC and first screened on BBC One in the autumn of 2005. It stars Tamsin Greig as Alice Chenery and Michael Landes as Gil Raymond. The series is written by David Renwick, and was produced by Verity Lambert. This was the last programme that Lambert produced before she died. The programme was initially a critical success although its audience figures were steady rather than spectacular, netting an average of five million viewers an episode. Renwick and his former scriptwriting partner Andrew Marshall have cameo appearances in one episode as members of a television sitcom scriptwriting team.\nThe second series started on 1 March 2008 and finished on 17 May 2008. This series contained changes from the first, including a switch from six 60 minute episodes, to twelve of 30 minutes. Although the character of Gil was mentioned throughout the series, and momentarily seen in the final episode, he was not a main character.\nThe theme tune to Love Soup is \"Alley Boogie\" by jazz singer Georgia White.", "rate": 70, "genre": ["Comedy", "Drama"], "cast": ["Michael Landes", "Tamsin Greig", "Trudie Styler", "Sheridan Smith", "Mark Heap"], "character": ["Alice Chenery", "Cleo Martin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2606   Expand Love Soup   (2005) User Score Overview Love Soup is a British television comedy-drama produced by the BBC and first screened on BBC One in the autumn of 2005. It stars Tamsin Greig as Alice Chenery and Michael Landes as Gil Raymond. The series is written by David Renwick, and was produced by Verity Lambert. This was the last programme that Lambert produced before she died. The programme was initially a critical success although its audience figures were steady rather than spectacular, netting an average of five million viewers an episode. Renwick and his former scriptwriting partner Andrew Marshall have cameo appearances in one episode as members of a television sitcom scriptwriting team. The second series started on 1 March 2008 and finished on 17 May 2008. This series contained changes from the first, including a switch from six 60 minute episodes, to twelve of 30 minutes. Although the character of Gil was mentioned throughout the series, and momentarily seen in the final episode, he was not a main character. The theme tune to Love Soup is \"Alley Boogie\" by jazz singer Georgia White. Featured Crew David Renwick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Landes Tamsin Greig Alice Chenery Trudie Styler Sheridan Smith Cleo Martin Mark Heap Full Cast & Crew Last Season Season 2 2008 | 12 Episodes Season 2 of Love Soup premiered on March  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Love Soup. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 30m Homepage   http://www.bbc.co.uk/drama/lovesoup/ Genres Comedy Drama Keywords england dating british humour searching for love Content Score 93 Almost there... Top Contributors 10 Banana O 5 Ozbourne 3 kcdh R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}