{"link": "https://www.themoviedb.org/tv/70541?language=en", "title": "Maximilian - Das Spiel von Macht und Liebe", "resume": "In 1477 Charles the Bold dies, his only child is a girl which cannot rule without a husband. Meanwhile in Austria, Emperor Frederick III and his antagonist Louis XI France battle over said marriage prospects, battles ensue, tragedy falls.", "rate": 80, "genre": ["Drama", "War", "Politics"], "cast": ["Stefan Pohl", "Jannis Niewöhner", "Christa Théret", "André Penvern", "Björn Freiberg"], "character": ["Wolf von Polheim", "Maximilian", "Marie von Burgund", "Guillaume Hugonet", "Burgoise"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70541   Expand Maximilian - Das Spiel von Macht und Liebe   (2017) User Score Overview In 1477 Charles the Bold dies, his only child is a girl which cannot rule without a husband. Meanwhile in Austria, Emperor Frederick III and his antagonist Louis XI France battle over said marriage prospects, battles ensue, tragedy falls. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stefan Pohl Wolf von Polheim Jannis Niewöhner Maximilian Christa Théret Marie von Burgund André Penvern Guillaume Hugonet Björn Freiberg Burgoise Full Cast & Crew Last Season Season 1 2017 | 3 Episodes Season 1 of Maximilian - Das Spiel von Macht und Liebe premiered on March  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Maximilian - Das Spiel von Macht und Liebe. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  German Runtime  90m Homepage  - Genres Drama War & Politics Keywords austria history miniseries 15th century Content Score 86 Almost there... Top Contributors 21 harford t 19 tmdb45070722 S 10 Samara L 10 Lemmy_6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}