{"link": "https://www.themoviedb.org/tv/77742?language=en", "title": "The Blood Sisters", "resume": "Erich triples the thrill and plays Erika, Carrie, and Agatha – triplets who were carried by a surrogate mother and got separated after an agreement their parents made fell through.\nThe story revolves around Erika, a dancer in a bar who uses her enthralling beauty to mesmerize men. But behind the sultry moves lies a doting mother who strives to save her son’s life from a chronic illness.\nAs an entertainer, she is able to make ends meet and provide for her son’s hospital bills. But the comfort her job gives comes with a great price — she witnesses a gruesome murder in the bar, and the suspects will try to chase her down to silence her.\nWith her life at risk, Erika will do everything to escape death and live for her son. But moments away from getting caught, she discovers a huge revelation that changes her life — she has a twin named Carrie, and the criminals mistake Carrie as her, giving her another chance at life.\nWith the loss of her sister, Erika gets to experience the fabulous life of Carrie. However, she soon finds out that aside from Carrie, she has,another twin — Agatha — who will help her discover the truth behind their secret lives.\nBut their journey in finding out the truth will not be easy, as danger comes their way and will force them to make choices that will put their loved ones at risk.", "rate": 0, "genre": [], "cast": ["Erich Gonzales", "Enchong Dee", "Aj Muhlach", "Ejay Falcon", "Dina Bonnevie"], "character": ["Agatha Magtibay / Erika Castillo / Carrie Ann Almeda", "Samuel Hechanova", "Rainier Solomon", "Antonio Alipio", "Deborah Marie Bermudez-Almeda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77742   Expand The Blood Sisters   (2018) User Score Overview Erich triples the thrill and plays Erika, Carrie, and Agatha – triplets who were carried by a surrogate mother and got separated after an agreement their parents made fell through. The story revolves around Erika, a dancer in a bar who uses her enthralling beauty to mesmerize men. But behind the sultry moves lies a doting mother who strives to save her son’s life from a chronic illness. As an entertainer, she is able to make ends meet and provide for her son’s hospital bills. But the comfort her job gives comes with a great price — she witnesses a gruesome murder in the bar, and the suspects will try to chase her down to silence her. With her life at risk, Erika will do everything to escape death and live for her son. But moments away from getting caught, she discovers a huge revelation that changes her life — she has a twin named Carrie, and the criminals mistake Carrie as her, giving her another chance at life. With the loss of her sister, Erika gets to experience the fabulous life of Carrie. However, she soon finds out that aside from Carrie, she has,another twin — Agatha — who will help her discover the truth behind their secret lives. But their journey in finding out the truth will not be easy, as danger comes their way and will force them to make choices that will put their loved ones at risk. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erich Gonzales Agatha Magtibay / Erika Castillo / Carrie Ann Almeda Enchong Dee Samuel Hechanova Aj Muhlach Rainier Solomon Ejay Falcon Antonio Alipio Dina Bonnevie Deborah Marie Bermudez-Almeda Full Cast & Crew Current Season Season 1 2018 | 25 Episodes Season 1 of The Blood Sisters premiered on February 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Blood Sisters. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Tagalog Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 21 jibberken A 6 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}