{"link": "https://www.themoviedb.org/tv/50209?language=en", "title": "Girl Code", "resume": "Girl Code is an American reality comedy television series on MTV that debuted on April 23, 2013. It is a spin-off series to Guy Code. The series features female actresses, musicians, stand-up comics — plus a few men — who discuss the sisterhood that women share. It was announced on June 13, 2013, that the series has been renewed for a twenty episode second season. Season 2 will premiere on October 29, 2013.", "rate": 0, "genre": ["Comedy", "Reality"], "cast": ["Nikki Pettus", "Esther Ku", "Stephanie Hsu"], "character": ["Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50209   Expand Girl Code   (2013) User Score Overview Girl Code is an American reality comedy television series on MTV that debuted on April 23, 2013. It is a spin-off series to Guy Code. The series features female actresses, musicians, stand-up comics — plus a few men — who discuss the sisterhood that women share. It was announced on June 13, 2013, that the series has been renewed for a twenty episode second season. Season 2 will premiere on October 29, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nikki Pettus Herself Esther Ku Herself Stephanie Hsu Herself Full Cast & Crew Last Season Season 4 2015 | 5 Episodes Season 4 of Girl Code premiered on June  3, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Girl Code. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.mtv.com/shows/girl_code/ Genres Comedy Reality Keywords women code girl Content Score 56 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings 13 Banana 2 CouchTater u 2 uaufspou123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}