{"link": "https://www.themoviedb.org/tv/19356?language=en", "title": "Top Chef Masters", "resume": "Top Chef Masters is an American reality competition series that airs on the cable television network Bravo, and premiered June 10, 2009. It is a spinoff of Bravo's hit show Top Chef. In the series, world-renowned chefs compete against each other in weekly challenges. This show is a contrast from Top Chef, which typically features younger professional cooks who are still rising in the food service industry.", "rate": 80, "genre": [], "cast": ["Kelly Choi", "Curtis Stone", "Ruth Reichl", "Jay Rayner", "Gael Greene"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19356   Expand Top Chef Masters   (2009) User Score Overview Top Chef Masters is an American reality competition series that airs on the cable television network Bravo, and premiered June 10, 2009. It is a spinoff of Bravo's hit show Top Chef. In the series, world-renowned chefs compete against each other in weekly challenges. This show is a contrast from Top Chef, which typically features younger professional cooks who are still rising in the food service industry. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kelly Choi Curtis Stone Ruth Reichl Jay Rayner Gael Greene Full Cast & Crew Last Season Top chef: masters season 5 2013 | 10 Episodes Season 5 of Top Chef Masters premiered on July 24, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Top Chef Masters. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.bravotv.com/top-chef-masters Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 1 Michael TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}