{"link": "https://www.themoviedb.org/tv/66548?language=en", "title": "The Dude Perfect Show", "resume": "In this show, you'll meet the five guys behind the viral YouTube magic: Tyler, the bearded guy; Cody; the tall one; Garrett; the purple hoser; and Coby and Cory, the twins. Operating from their Dude Perfect headquarters in Frisco, Texas, Dude Perfect has the job every kid dreams of. Whether it’s working with celebrity guest stars like Luke Bryan, Dale Earnhardt Jr and Aaron Rodgers, or prepping for their next battle video, Giant Basketball Arcade, Lawnmower Race or Epic Snow Battle, these guys have made a career out of having fun.", "rate": 8, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66548   Expand The Dude Perfect Show   (2016) User Score Overview In this show, you'll meet the five guys behind the viral YouTube magic: Tyler, the bearded guy; Cody; the tall one; Garrett; the purple hoser; and Coby and Cory, the twins. Operating from their Dude Perfect headquarters in Frisco, Texas, Dude Perfect has the job every kid dreams of. Whether it’s working with celebrity guest stars like Luke Bryan, Dale Earnhardt Jr and Aaron Rodgers, or prepping for their next battle video, Giant Basketball Arcade, Lawnmower Race or Epic Snow Battle, these guys have made a career out of having fun. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 7 Episodes Season 1 of The Dude Perfect Show premiered on April 14, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Dude Perfect Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://www.cmt.com/shows/the-dude-perfect-show/ Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 13 Elizabeth Jennings 8 theefallen 3 lineker 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}