{"link": "https://www.themoviedb.org/tv/78102?language=en", "title": "Steins;Gate 0", "resume": "The dark untold story of Steins;Gate that leads with the eccentric mad scientist Okabe, struggling to recover from a failed attempt at rescuing Kurisu. He decides to give up and abandons his lively scientist alter ego, in pursuit to forget the past. When all seems to be normal, he is seemingly pulled back into the past by meeting an acquaintance of Kurisu, who tells him that they have begun testing a device that stores the memory of a human and creates a simulation of them with their characteristics and personalities. Okabe begins testing and finds out that the simulation of Kurisu has brought back anguish and some new unexpected tragedies.\nZero is a side story that explores events from the Beta Attractor Field's future that contribute in making the end of the original story possible.", "rate": 83, "genre": ["Sci-Fi", "Fantasy", "Animation"], "cast": ["Mamoru Miyano", "Asami Imai", "Kana Hanazawa", "Yukari Tamura", "Tomokazu Seki"], "character": ["Rintarou Okabe", "Kurisu Makise", "Mayuri Shiina", "Suzuha Amane", "Hashida Itaru"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78102   Expand Steins;Gate 0   (2018) User Score  Play Trailer Overview The dark untold story of Steins;Gate that leads with the eccentric mad scientist Okabe, struggling to recover from a failed attempt at rescuing Kurisu. He decides to give up and abandons his lively scientist alter ego, in pursuit to forget the past. When all seems to be normal, he is seemingly pulled back into the past by meeting an acquaintance of Kurisu, who tells him that they have begun testing a device that stores the memory of a human and creates a simulation of them with their characteristics and personalities. Okabe begins testing and finds out that the simulation of Kurisu has brought back anguish and some new unexpected tragedies. Zero is a side story that explores events from the Beta Attractor Field's future that contribute in making the end of the original story possible. Featured Crew Kenichi Kawamura Creator Jukki Hanada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamoru Miyano Rintarou Okabe Asami Imai Kurisu Makise Kana Hanazawa Mayuri Shiina Yukari Tamura Suzuha Amane Tomokazu Seki Hashida Itaru Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Steins;Gate 0 premiered on April 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Steins;Gate 0. You can help by rating TV shows you've seen. Facts Original Name  シュタインズ・ゲート ゼロ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://steinsgate0-anime.com/ Genres Sci-Fi & Fantasy Animation Keywords thriller anime based on visual novel Content Score 100 Yes! Looking good! Top Contributors 30 Moviegoer.ml 22 Aubi b 9 beachsounddog 9 neonime  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}