{"link": "https://www.themoviedb.org/tv/56497?language=en", "title": "Mei-chan's Butler", "resume": "The story revolves around a young woman named Mei, who was rescued as a young girl by someone calling himself her \"butler.\" With only a vague memory, though, the experience seems like just a dream. But one day, after her parents' accidental death, he appears: Rihito comes from a line of outstanding butlers, and he has been appointed to serve her! Now her ordinary life has completely flipped, as she discovers that she's actually the heiress to a fortune, and is forced to transfer to St. Lucia Girls' Academy, where all the students have butlers! As a result, her childhood friend Kento decides to enroll in a butler school so that he can stay close to her.", "rate": 63, "genre": ["Comedy"], "cast": ["Nana Eikura", "Hiro Mizushima", "Yu Yamada", "Osamu Mukai", "Mitsuki Tanimura"], "character": ["Shinonome Mei", "Shibata Rihito", "Lucia (Hongo Shiori)", "Shinobu", "Yamada Tami"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56497   Expand Mei-chan's Butler   (2009) User Score Overview The story revolves around a young woman named Mei, who was rescued as a young girl by someone calling himself her \"butler.\" With only a vague memory, though, the experience seems like just a dream. But one day, after her parents' accidental death, he appears: Rihito comes from a line of outstanding butlers, and he has been appointed to serve her! Now her ordinary life has completely flipped, as she discovers that she's actually the heiress to a fortune, and is forced to transfer to St. Lucia Girls' Academy, where all the students have butlers! As a result, her childhood friend Kento decides to enroll in a butler school so that he can stay close to her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nana Eikura Shinonome Mei Hiro Mizushima Shibata Rihito Yu Yamada Lucia (Hongo Shiori) Osamu Mukai Shinobu Mitsuki Tanimura Yamada Tami Full Cast & Crew Last Season Season 1 2009 | 10 Episodes Season 1 of Mei-chan's Butler premiered on January 13, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2008-04-15 Absolute Boyfriend 8.0  Facts Original Name  メイちゃんの執事 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  46m Homepage  - Genres Comedy Keywords japan boarding school butler private school Content Score 86 Almost there... Top Contributors 26 Wendy A 12 Aka75 L 4 Liuby NS 3 Norte Serra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}