{"link": "https://www.themoviedb.org/tv/58708?language=en", "title": "Prophets of Science Fiction", "resume": "Prophets of Science Fiction is an American documentary television series produced and hosted by Ridley Scott for the Science Channel. The program premiered on November 9, 2011.\nThe series covers the life and work of leading science fiction authors of the last couple of centuries. It depicts how they predicted and, accordingly, influenced the development of scientific advancements by inspiring many readers to assist in transforming those futuristic visions into everyday reality. The stories are told through film clips, reenactments, illustrations and interviews.\nThe first episode received mixed reviews. Commentators appreciated the approach of combining coverage of contemporary scientific research and biographical exposition, but criticized the series as \"light on the substance and heavy on the exaggeration\". The series' attempts to link Mary Shelley's Frankenstein to developments such as organ transplants, supercomputers and DNA research were described by one critic as far-fetched but by another as successful.", "rate": 71, "genre": ["Documentary", "Sci-Fi", "Fantasy"], "cast": ["Ridley Scott"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58708   Expand Prophets of Science Fiction   (2011) User Score  Play Trailer Overview Prophets of Science Fiction is an American documentary television series produced and hosted by Ridley Scott for the Science Channel. The program premiered on November 9, 2011. The series covers the life and work of leading science fiction authors of the last couple of centuries. It depicts how they predicted and, accordingly, influenced the development of scientific advancements by inspiring many readers to assist in transforming those futuristic visions into everyday reality. The stories are told through film clips, reenactments, illustrations and interviews. The first episode received mixed reviews. Commentators appreciated the approach of combining coverage of contemporary scientific research and biographical exposition, but criticized the series as \"light on the substance and heavy on the exaggeration\". The series' attempts to link Mary Shelley's Frankenstein to developments such as organ transplants, supercomputers and DNA research were described by one critic as far-fetched but by another as successful. Featured Crew Declan Whitebloom Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  17 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ridley Scott Himself Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of Prophets of Science Fiction premiered on November  9, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  17 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Prophets of Science Fiction. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  45m Homepage  - Genres Documentary Sci-Fi & Fantasy Keywords miniseries Content Score 71 Just a little bit more... Top Contributors C 50 CoLibrus R 9 Rebecca CM 6 Cherche Moi 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}