{"link": "https://www.themoviedb.org/tv/72091?language=en", "title": "Magical Warfare", "resume": "Takeshi Nanase is an ordinary high school boy who has a somewhat dark past. One day, he comes across a girl named Mui Aiba, in a uniform he has never seen before, collapsed on the school campus. This encounter changes his destiny completely. She tells Takeshi that she is a magician, and she apologizes, for she turned Takeshi into a magician, too. What Takeshi once knew as one world is actually two — the world where magicians live and the world where humans live.", "rate": 70, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72091   Expand Magical Warfare   (2014) User Score Overview Takeshi Nanase is an ordinary high school boy who has a somewhat dark past. One day, he comes across a girl named Mui Aiba, in a uniform he has never seen before, collapsed on the school campus. This encounter changes his destiny completely. She tells Takeshi that she is a magician, and she apologizes, for she turned Takeshi into a magician, too. What Takeshi once knew as one world is actually two — the world where magicians live and the world where humans live. Featured Crew Yuzo Sato Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Magical Warfare premiered on January  9, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Magical Warfare. You can help by rating TV shows you've seen. Facts Original Name  魔法戦争 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 12 Sergiojamon a 11 anarielz 4 jmf2k R 3 RsTxSpyMaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}