{"link": "https://www.themoviedb.org/tv/41343?language=en", "title": "Hungarian Folktales", "resume": "Hungarian Folktales is a Hungarian animated series. Each episode is based on a Hungarian folk tale. The creators paid special attention to using Hungarian folk motives in the episodes.", "rate": 0, "genre": ["Family", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41343   Expand Hungarian Folktales   (1977) User Score Overview Hungarian Folktales is a Hungarian animated series. Each episode is based on a Hungarian folk tale. The creators paid special attention to using Hungarian folk motives in the episodes. Featured Crew Marcell Jankovics Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2011 | 11 Episodes Season 9 of Hungarian Folktales premiered on January  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hungarian Folktales. You can help by rating TV shows you've seen. Facts Original Name  Magyar népmesék Status  Ended Network Magyar Televízió Certification  - Type  Scripted Original Language  Hungarian Runtime  9m, 8m Homepage  - Genres Family Animation Keywords tale animation hungarian folk tale Content Score 71 Just a little bit more... Top Contributors 34 Elizabeth Jennings E 18 EightNine TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}