{"link": "https://www.themoviedb.org/tv/72031?language=en", "title": "Decker", "resume": "The free world is in danger, and only one man can help. Jack Decker has sworn to defend America from foreign terrorists regardless of which spineless president is in charge. This is Decker: The Series.", "rate": 55, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72031   Expand Decker   (2014) User Score  Play Trailer Overview The free world is in danger, and only one man can help. Jack Decker has sworn to defend America from foreign terrorists regardless of which spineless president is in charge. This is Decker: The Series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2017 | 1 Episode Season 5 of Decker premiered on June  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2004-11-08 Sarabhai vs Sarabhai 5.6    2015-06-03 TVF Pitchers 6.9    2013-01-14 The Carrie Diaries 4.9    2017-04-21 Bill Nye Saves the World 2.4    1993-09-10 Bill Nye The Science Guy 7.3    2009-10-29 The League 7.1    2014-09-26 Transparent 6.7  Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  11m Homepage   www.adultswim.com/videos/decker Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors - 8 -Alexander- a 5 anisamawarni r 2 ricostream 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}