{"link": "https://www.themoviedb.org/tv/16270?language=en", "title": "Hunter", "resume": "Hunter is a two-part BBC One police drama. Hugh Bonneville and Janet McTeer reprised their roles as the dysfunctional detective double-act following on from the 2007 series Five Days.\nThe series aired in the UK on Monday 18 January 2009 on BBC One at 9pm and achieved an average of 5.4m viewers during first episode. It was simulcast on BBC HD.", "rate": 73, "genre": ["Drama"], "cast": ["Nathan Constance", "Eleanor Matsuura", "Hugh Bonneville", "Janet McTeer", "Clare Holman"], "character": ["DC Connor", "DI Zoe Larson", "DSI Iain Barclay", "DS Amy Foster", "Dr. Margaret Newell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16270   Expand Hunter   (2009) User Score Overview Hunter is a two-part BBC One police drama. Hugh Bonneville and Janet McTeer reprised their roles as the dysfunctional detective double-act following on from the 2007 series Five Days. The series aired in the UK on Monday 18 January 2009 on BBC One at 9pm and achieved an average of 5.4m viewers during first episode. It was simulcast on BBC HD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nathan Constance DC Connor Eleanor Matsuura DI Zoe Larson Hugh Bonneville DSI Iain Barclay Janet McTeer DS Amy Foster Clare Holman Dr. Margaret Newell Full Cast & Crew Last Season Miniseries 2009 | 2 Episodes Season 1 of Hunter premiered on January 17, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hunter. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords miniseries Content Score 86 Almost there... Top Contributors TB 13 TMDb Bot z 10 zurman1 R 5 Rebecca o 3 olili  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}