{"link": "https://www.themoviedb.org/tv/40966?language=en", "title": "Cliff Dexter", "resume": "Cliff Dexter was a detective series in the ZDF 1966 until 1968. It produced two seasons each with 13 episodes each 25 minutes, lead actor was Hans von Borsody. Other performers have included Hans Schellbach as Commissioner Meinert, Sabine Bethmann as Jacqueline and Andrea Dahmen as Carrol. In two episodes occurred Günter Strack.\nCliff Dexter is a former FBI agent who - working as a private investigator - in a German city. Parts of the series were filmed in Hamburg, including the startup sequence, runs in his Mercedes Benz Dexter Cliff SEb convertible through the Wallringtunnel to his office.\nThe series was, although popular with audiences, not continued after 26 episodes, probably partly because the critics little good at the 'pocket-Bond' was. Yet in this series broadcast period 1966-1968 reached regularly 36-38 million viewers.", "rate": 0, "genre": ["Crime"], "cast": ["Hans von Borsody", "Sabine Bethmann", "Andrea Dahmen", "Hans Schellbach"], "character": ["Cliff Dexter", "Jacqueline", "Carroll", "Kommissar Meinert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40966   Expand Cliff Dexter   (1966) User Score Overview Cliff Dexter was a detective series in the ZDF 1966 until 1968. It produced two seasons each with 13 episodes each 25 minutes, lead actor was Hans von Borsody. Other performers have included Hans Schellbach as Commissioner Meinert, Sabine Bethmann as Jacqueline and Andrea Dahmen as Carrol. In two episodes occurred Günter Strack. Cliff Dexter is a former FBI agent who - working as a private investigator - in a German city. Parts of the series were filmed in Hamburg, including the startup sequence, runs in his Mercedes Benz Dexter Cliff SEb convertible through the Wallringtunnel to his office. The series was, although popular with audiences, not continued after 26 episodes, probably partly because the critics little good at the 'pocket-Bond' was. Yet in this series broadcast period 1966-1968 reached regularly 36-38 million viewers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hans von Borsody Cliff Dexter Sabine Bethmann Jacqueline Andrea Dahmen Carroll Hans Schellbach Kommissar Meinert Full Cast & Crew Last Season Season 2 1967 | 13 Episodes Season 2 of Cliff Dexter premiered on November  8, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cliff Dexter. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  25m Homepage  - Genres Crime Keywords private detective Content Score 71 Just a little bit more... Top Contributors S 25 Samara TB 2 TMDb Bot M 2 Mec!as  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}