{"link": "https://www.themoviedb.org/tv/430?language=en", "title": "The Adventures of Sam & Max: Freelance Police", "resume": "The Adventures of Sam & Max: Freelance Police, Sam & Max: Freelance Police!!! or just simply Sam & Max, is an American animated television series starring Sam & Max, a duo of private investigators composed of Sam, an anthropomorphic dog, and Max, a lagomorph or \"hyperkinetic rabbity-thing.\" The show was created by Steve Purcell, also creator of the original comic book series. The series first aired in October 1997 on Fox Kids in the United States and YTV in Canada, producing 24 episodes and winning the 1998 Gemini Award for \"Best Animated Series\" before it was canceled in April 1998. With the exception of the first and last episodes, which each had a running time of about 20 minutes, each episode was approximately 10 minutes in length, and were usually aired in pairs.", "rate": 65, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Harvey Atkin", "Tracey Moore", "Robert Tinkler"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 430   Expand The Adventures of Sam & Max: Freelance Police   (1997) User Score Overview The Adventures of Sam & Max: Freelance Police, Sam & Max: Freelance Police!!! or just simply Sam & Max, is an American animated television series starring Sam & Max, a duo of private investigators composed of Sam, an anthropomorphic dog, and Max, a lagomorph or \"hyperkinetic rabbity-thing.\" The show was created by Steve Purcell, also creator of the original comic book series. The series first aired in October 1997 on Fox Kids in the United States and YTV in Canada, producing 24 episodes and winning the 1998 Gemini Award for \"Best Animated Series\" before it was canceled in April 1998. With the exception of the first and last episodes, which each had a running time of about 20 minutes, each episode was approximately 10 minutes in length, and were usually aired in pairs. Featured Crew Steve Purcell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Harvey Atkin Tracey Moore Robert Tinkler Full Cast & Crew Last Season Sam and max freelance police season 1 1997 | 24 Episodes Season 1 of The Adventures of Sam & Max: Freelance Police premiered on October  4, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of Sam & Max: Freelance Police. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage  - Genres Action & Adventure Animation Comedy Keywords police cat dark comedy based on comic anthropomorphism dog rabbit dry humour based on video game police precinct cartoon dog cartoon rabbit Content Score 64 We're so close, yet so far. Top Contributors a 25 alexmate 10 Banana 7 kuzronk a 1 artuross  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}