{"link": "https://www.themoviedb.org/tv/68722?language=en", "title": "The Correct Six", "resume": "In a small village in the 50ies six friends (four boys and two girls) want to experience some adventures in the summer holidays. They arrange a bathtub for a float journey, perform a theatre play at the yearly village party and a lot more...", "rate": 0, "genre": ["Family", "Action", "Adventure"], "cast": ["Jakub Hladík", "Sandra Jirickova", "Ondrej Wolf", "Sandra Nováková", "Jaroslav Pauer"], "character": ["Friedhelm", "Lisbeth", "Gustav", "Gretel", "Heini"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68722   Expand The Correct Six   (1993) User Score Overview In a small village in the 50ies six friends (four boys and two girls) want to experience some adventures in the summer holidays. They arrange a bathtub for a float journey, perform a theatre play at the yearly village party and a lot more... Featured Crew Karel Smyczek Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jakub Hladík Friedhelm Sandra Jirickova Lisbeth Ondrej Wolf Gustav Sandra Nováková Gretel Jaroslav Pauer Heini Full Cast & Crew Last Season Season 1 1993 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Correct Six. You can help by rating TV shows you've seen. Facts Original Name  Správná sestka Status  Ended Network Certification  - Type  Scripted Original Language  Czech Runtime  25m Homepage  - Genres Family Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 36 dannyvl 5 1 5lucina5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}