{"link": "https://www.themoviedb.org/tv/15063?language=en", "title": "Hometime", "resume": "Hometime is a PBS home improvement television show produced by Hometime Video Publishing, Chaska, Minnesota, in association with WHYY-TV Philadelphia/Wilmington, Delaware, and broadcast on public television and in syndication. It first aired in 1986. In the 1990s, Hometime aired on TLC.\nHometime demonstrates both do-it-yourself- and contractor-performed projects, ranging from simple weekend projects to complete homes. Hometime episodes have covered many aspects of home construction and maintenance.", "rate": 0, "genre": [], "cast": ["Dean Johnson", "Judd Nelson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15063   Expand Hometime   (1986) User Score Overview Hometime is a PBS home improvement television show produced by Hometime Video Publishing, Chaska, Minnesota, in association with WHYY-TV Philadelphia/Wilmington, Delaware, and broadcast on public television and in syndication. It first aired in 1986. In the 1990s, Hometime aired on TLC. Hometime demonstrates both do-it-yourself- and contractor-performed projects, ranging from simple weekend projects to complete homes. Hometime episodes have covered many aspects of home construction and maintenance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dean Johnson Judd Nelson Full Cast & Crew Last Season Season 27 2013 | 26 Episodes Season 27 of Hometime premiered on February  2, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Hometime. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hometime. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hometime.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors TB 1 TMDb Bot 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}