{"link": "https://www.themoviedb.org/tv/1554?language=en", "title": "QI", "resume": "Comedy quiz show full of quirky facts, in which contestants are rewarded more if their answers are 'quite interesting'.", "rate": 82, "genre": ["Comedy"], "cast": ["Sandi Toksvig", "Alan Davies"], "character": ["Herself - Presenter", "Himself - Panellist"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1554   Expand QI   (2003) User Score Overview Comedy quiz show full of quirky facts, in which contestants are rewarded more if their answers are 'quite interesting'. Featured Crew John Lloyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sandi Toksvig Herself - Presenter Alan Davies Himself - Panellist Full Cast & Crew Current Season Series O 2017 | 18 Episodes Season 15 of QI premiered on October 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  6 Recommendations   2005-06-05 Mock the Week 7.0    2007-06-16 Would I Lie to You? 7.8    1996-11-12 Never Mind the Buzzcocks 7.5    1982-11-09 The Young Ones 7.6    1990-09-28 Have I Got News for You 7.6    1995-04-21 Father Ted 7.9    1983-06-15 Blackadder 7.8    1975-09-19 Fawlty Towers 8.1  Facts Status  Returning Series Networks Certification  - Type  Talk Show Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006ml0g Genres Comedy Keywords game show quiz show trivia panel show british humour knowledge Content Score 64 We're so close, yet so far. Top Contributors 33 Elizabeth Jennings 27 TonAngel 8 Banana 8 Gustav  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}