{"link": "https://www.themoviedb.org/tv/11860?language=en", "title": "Airline", "resume": "Airline is a British television series produced by Yorkshire Television for the ITV network in 1982.\nThe series starred Roy Marsden as Jack Ruskin, a pilot demobbed after the end of the Second World War who starts up his own air freight business.\nAirline was created by Wilfred Greatorex and lasted for one series of nine episodes broadcast in January & February 1982, with a repeat in the summer of 1984. Other leading cast members were Polly Hemingway, Richard Heffer, Sean Scanlan and Terence Rigby, while noted guest-stars included Anthony Valentine and Walter Gotell.\nIt was partially filmed at the former RAF Rufforth in Yorkshire..", "rate": 0, "genre": [], "cast": ["Roy Marsden", "Terence Rigby", "Richard Heffer", "Nicholas Bond-Owen", "Polly Hemingway"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11860   Expand Airline   (1982) User Score Overview Airline is a British television series produced by Yorkshire Television for the ITV network in 1982. The series starred Roy Marsden as Jack Ruskin, a pilot demobbed after the end of the Second World War who starts up his own air freight business. Airline was created by Wilfred Greatorex and lasted for one series of nine episodes broadcast in January & February 1982, with a repeat in the summer of 1984. Other leading cast members were Polly Hemingway, Richard Heffer, Sean Scanlan and Terence Rigby, while noted guest-stars included Anthony Valentine and Walter Gotell. It was partially filmed at the former RAF Rufforth in Yorkshire.. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roy Marsden Terence Rigby Richard Heffer Nicholas Bond-Owen Polly Hemingway Full Cast & Crew Last Season (1982) season 1 1982 | 9 Episodes Season 1 of Airline premiered on January  3, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Airline. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors B 3 BWYoda z 2 zoroman2017  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}