{"link": "https://www.themoviedb.org/tv/5926?language=en", "title": "Testees", "resume": "Testees is a Canadian television series, created by Kenny Hotz and written and produced by Kenny Hotz and Derek Harvie. Testees originally aired on Thursdays at 10:30 PM EST on FX and ran from October 9, 2008 to December 18, 2008. and debuted on October 14, 2008 on Showcase in Canada. The show is filmed in Toronto and Hamilton, Ontario. Testees is now showing on FX in the UK, I.Sat in Brazil and Comedy Central in Germany, Austria and the Netherlands. After one season, Testees was not renewed by FX.", "rate": 72, "genre": ["Comedy"], "cast": ["Jeff Kassel", "Ho Chow", "Steve Markle", "Kenny Hotz", "Shauna Macdonald"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5926   Expand Testees   (2008) User Score Overview Testees is a Canadian television series, created by Kenny Hotz and written and produced by Kenny Hotz and Derek Harvie. Testees originally aired on Thursdays at 10:30 PM EST on FX and ran from October 9, 2008 to December 18, 2008. and debuted on October 14, 2008 on Showcase in Canada. The show is filmed in Toronto and Hamilton, Ontario. Testees is now showing on FX in the UK, I.Sat in Brazil and Comedy Central in Germany, Austria and the Netherlands. After one season, Testees was not renewed by FX. Featured Crew Kenny Hotz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Kassel Ho Chow Steve Markle Kenny Hotz Shauna Macdonald Full Cast & Crew Last Season Season 1 2008 | 13 Episodes Season 1 of Testees premiered on October  9, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply One Of My All Time Favourite Shows Open 0 by domremy\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2003-08-26 Kenny vs. Spenny 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}