{"link": "https://www.themoviedb.org/tv/21544?language=en", "title": "My Fair Lady", "resume": "My Fair Lady is a 2009 South Korean television series, starring Yoon Eun-hye, Yoon Sang-hyun, Jung Il-woo and Moon Chae-won. It aired on KBS2 from August 19 to October 8, 2009 on Wednesdays and Thursdays at 21:55 for 16 episodes.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": ["Yoon Eun-hye", "Yoon Sang-hyun", "Jung Il-woo", "Moon Chae-won", "Kim Young-kwang"], "character": ["Kang Hye-na", "Seo Dong-chan", "Lee Tae-yoon", "Yeo Eui-joo", "Jung Woo-sung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21544   Expand My Fair Lady   (2009) User Score Overview My Fair Lady is a 2009 South Korean television series, starring Yoon Eun-hye, Yoon Sang-hyun, Jung Il-woo and Moon Chae-won. It aired on KBS2 from August 19 to October 8, 2009 on Wednesdays and Thursdays at 21:55 for 16 episodes. Featured Crew Eun-kyeong Yun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Eun-hye Kang Hye-na Yoon Sang-hyun Seo Dong-chan Jung Il-woo Lee Tae-yoon Moon Chae-won Yeo Eui-joo Kim Young-kwang Jung Woo-sung Full Cast & Crew Last Season Season 1 2009 | 16 Episodes Season 1 of My Fair Lady premiered on August 19, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  6 Recommendations   2013-12-09 The Prime Minister and I 7.1    2006-01-11 Princess Hours 6.7    2017-05-22 Fight For My Way 7.3    2017-02-24 Strong Woman Do Bong Soon 6.8  Facts Original Name  아가씨를 부탁해 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.kbs.co.kr/drama/ladycastle Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors N 7 Nightowl.Kr t 6 tmdb38202327 M 5 Maria180493 s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}