{"link": "https://www.themoviedb.org/tv/66863?language=en", "title": "Unlimited Fafnir", "resume": "Twenty-five years ago, the world suddenly changed when monsters called “Dragons” appeared; seeking to ravage the earth and find mates. Over time, superhuman girls possessing the powers of the dragons, called “D girls” were born. Yuu Mononobe is the only male “D” in existence and is forced to enroll at Midgar - an academy for D girls. At the academy, he accidentally runs into Iris, a delinquent D girl, while she’s naked, and even reunites with this long lost sister, Mitsuki, whom he was separated with at birth. Will Iris and Yuu, the boy who is supposed to become the strongest assassin, be able to challenge the seven dragons that threaten to destroy the world?", "rate": 0, "genre": ["Action", "Adventure", "Animation"], "cast": ["Yoshitsugu Matsuoka", "Rina Hidaka", "Manami Numakura", "Hisako Kanemoto", "Kana Hanazawa"], "character": ["Yū Mononobe (voice)", "Iris Freyja (voice)", "Mitsuki Mononobe (voice)", "Lisa Highwalker (voice)", "Firill Crest (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66863   Expand Unlimited Fafnir   (2015) User Score Overview Twenty-five years ago, the world suddenly changed when monsters called “Dragons” appeared; seeking to ravage the earth and find mates. Over time, superhuman girls possessing the powers of the dragons, called “D girls” were born. Yuu Mononobe is the only male “D” in existence and is forced to enroll at Midgar - an academy for D girls. At the academy, he accidentally runs into Iris, a delinquent D girl, while she’s naked, and even reunites with this long lost sister, Mitsuki, whom he was separated with at birth. Will Iris and Yuu, the boy who is supposed to become the strongest assassin, be able to challenge the seven dragons that threaten to destroy the world? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshitsugu Matsuoka Yū Mononobe (voice) Rina Hidaka Iris Freyja (voice) Manami Numakura Mitsuki Mononobe (voice) Hisako Kanemoto Lisa Highwalker (voice) Kana Hanazawa Firill Crest (voice) Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Unlimited Fafnir premiered on January  8, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Unlimited Fafnir. You can help by rating TV shows you've seen. Facts Original Name  銃皇無尽のファフニール Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/anime/fafnir/ Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 25 thriem d 20 desert188 7 kiino55 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}