{"link": "https://www.themoviedb.org/tv/19311?language=en", "title": "Charles II: The Power and The Passion", "resume": "Charles II: The Power and the Passion is an award-winning British television mini-series, broadcast on BBC One in 2003, and produced by the BBC in association with the A&E Network in the United States. It was produced by Kate Harwood, directed by Joe Wright and written by award-winning screenwriter Adrian Hodges, whose credits include David Copperfield and The Lost World.", "rate": 58, "genre": ["Drama"], "cast": ["Rufus Sewell", "Mélanie Thierry", "Martin Freeman", "Tabitha Wady", "Graham McTavish"], "character": ["Charles II", "Louise de Kéroualle", "Lord Shaftesbury", "Anne Hyde", "Captain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19311   Expand Charles II: The Power and The Passion   (2003) User Score Overview Charles II: The Power and the Passion is an award-winning British television mini-series, broadcast on BBC One in 2003, and produced by the BBC in association with the A&E Network in the United States. It was produced by Kate Harwood, directed by Joe Wright and written by award-winning screenwriter Adrian Hodges, whose credits include David Copperfield and The Lost World. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rufus Sewell Charles II Mélanie Thierry Louise de Kéroualle Martin Freeman Lord Shaftesbury Tabitha Wady Anne Hyde Graham McTavish Captain Full Cast & Crew Last Season Season 1 2003 | 6 Episodes Season 1 of Charles II: The Power and The Passion premiered on November 16, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Charles II: The Power and The Passion. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords court royal family biography miniseries king historical drama 17th century Content Score 86 Almost there... Top Contributors TB 46 TMDb Bot 11 rudely_murray 8 Banana a 3 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}