{"link": "https://www.themoviedb.org/tv/1029?language=en", "title": "Birdman and the Galaxy Trio", "resume": "Birdman and the Galaxy Trio is an animated science fiction television series created by Alex Toth and produced by Hanna-Barbera. It debuted on NBC on September 9, 1967, and ran on Saturday mornings until September 6, 1969. The program consists of two segments: Birdman, depicting the adventures of a winged superhero powered by the sun, and The Galaxy Trio, centering around the exploits of three extraterrestrial superheroes. NBC ran two new segments of Birdman each Saturday, separated by a segment of The Galaxy Trio.\nThe character of Birdman was revived three decades later in the Cartoon Network/Adult Swim TV series Harvey Birdman, Attorney at Law, and several characters from Birdman and the Galaxy Trio appeared in this revival.", "rate": 61, "genre": ["Sci-Fi", "Fantasy", "Animation"], "cast": ["Don Messick", "John Stephenson", "Dick Beals", "Ted Cassidy", "Virginia Eiler"], "character": ["Falcon 7 (voice)", "Number One (voice)", "Birdboy (voice)", "Meteor Man (voice)", "Gravity Girl (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1029   Expand Birdman and the Galaxy Trio   (1967) User Score Overview Birdman and the Galaxy Trio is an animated science fiction television series created by Alex Toth and produced by Hanna-Barbera. It debuted on NBC on September 9, 1967, and ran on Saturday mornings until September 6, 1969. The program consists of two segments: Birdman, depicting the adventures of a winged superhero powered by the sun, and The Galaxy Trio, centering around the exploits of three extraterrestrial superheroes. NBC ran two new segments of Birdman each Saturday, separated by a segment of The Galaxy Trio. The character of Birdman was revived three decades later in the Cartoon Network/Adult Swim TV series Harvey Birdman, Attorney at Law, and several characters from Birdman and the Galaxy Trio appeared in this revival. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Messick Falcon 7 (voice) John Stephenson Number One (voice) Dick Beals Birdboy (voice) Ted Cassidy Meteor Man (voice) Virginia Eiler Gravity Girl (voice) Full Cast & Crew Last Season Season 1 1967 | 60 Episodes Season 1 of Birdman and the Galaxy Trio premiered on September  9, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1967-09-09 Shazzan 6.5    1978-09-09 Challenge of the Super Friends 8.0    2010-10-25 American Restoration 6.1    1967-09-09 Spider-Man 7.9    1983-09-05 He-Man and the Masters of the Universe 7.1    1988-10-23 Mission: Impossible 6.8    1961-09-27 Top Cat 6.9    1966-09-17 Mission: Impossible 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Animation Keywords superhero Content Score 86 Almost there... Top Contributors 18 Banana TB 2 TMDb Bot 1 minhus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}