{"link": "https://www.themoviedb.org/tv/15935?language=en", "title": "The Blue and the Gray", "resume": "The Blue and the Gray is a television miniseries that first aired on CBS in three installments on November 14, November 16, and November 17, 1982. Set during the American Civil War, the series starred John Hammond, Stacy Keach, Lloyd Bridges, and Gregory Peck as President Abraham Lincoln. It was executive produced by Larry White and Lou Reda, in association with Columbia Pictures Television, then owned by The Coca-Cola Company.", "rate": 78, "genre": ["Drama"], "cast": ["Gregory Peck", "Rip Torn", "Lloyd Bridges", "Robert Vaughn", "Sterling Hayden"], "character": ["Abraham Lincoln", "Ben Geyser"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15935   Expand The Blue and the Gray   (1982) User Score Overview The Blue and the Gray is a television miniseries that first aired on CBS in three installments on November 14, November 16, and November 17, 1982. Set during the American Civil War, the series starred John Hammond, Stacy Keach, Lloyd Bridges, and Gregory Peck as President Abraham Lincoln. It was executive produced by Larry White and Lou Reda, in association with Columbia Pictures Television, then owned by The Coca-Cola Company. Featured Crew John Leekley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gregory Peck Abraham Lincoln Rip Torn Lloyd Bridges Ben Geyser Robert Vaughn Sterling Hayden Full Cast & Crew Last Season Season 1 1982 | 3 Episodes Season 1 of The Blue and the Gray premiered on November 14, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on The Blue and the Gray. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  480m Homepage  - Genres Drama Keywords slavery miniseries american civil war 19th century Content Score 93 Almost there... Top Contributors TB 18 TMDb Bot 11 Banana L 5 Lemmy_6 4 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}