{"link": "https://www.themoviedb.org/tv/10972?language=en", "title": "G vs E", "resume": "G vs E is an American fantasy-based television action series that had its first season air on USA Network during the summer and autumn of 1999. For the second season the series switched to Sci-Fi Channel in early 2000. The series stars Clayton Rohner, Richard Brooks and Marshall Bell.\nG vs E pitted a group of agents who are assigned to \"the Corps\", a secret agency under the command of Heaven, against the \"Morlocks\", a group of evildoers from Hell.\nThe series has a 1970s retro-hip style that is similar to Quentin Tarantino's Pulp Fiction. The show is fast-moving and harkens back to the blaxploitation films of the 1970s. It also mixes spy-fi elements with the end of the millennium Zeitgeist of the late 1990s.\nNBC Universal's horror-themed cable channel Chiller, which launched on March 1, 2007, aired G vs. E as part of its premiere schedule.", "rate": 65, "genre": ["Drama"], "cast": ["Richard Brooks", "Clayton Rohner", "Marshall Bell", "Tony Denman", "Deacon Jones"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10972   Expand G vs E   (1999) User Score Overview G vs E is an American fantasy-based television action series that had its first season air on USA Network during the summer and autumn of 1999. For the second season the series switched to Sci-Fi Channel in early 2000. The series stars Clayton Rohner, Richard Brooks and Marshall Bell. G vs E pitted a group of agents who are assigned to \"the Corps\", a secret agency under the command of Heaven, against the \"Morlocks\", a group of evildoers from Hell. The series has a 1970s retro-hip style that is similar to Quentin Tarantino's Pulp Fiction. The show is fast-moving and harkens back to the blaxploitation films of the 1970s. It also mixes spy-fi elements with the end of the millennium Zeitgeist of the late 1990s. NBC Universal's horror-themed cable channel Chiller, which launched on March 1, 2007, aired G vs. E as part of its premiere schedule. Featured Crew Jonas Pate Creator Josh Pate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Brooks Clayton Rohner Marshall Bell Tony Denman Deacon Jones Full Cast & Crew Last Season Season 2 2000 | 9 Episodes Season 2 of G vs E premiered on March 10, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on G vs E. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}