{"link": "https://www.themoviedb.org/tv/62227?language=en", "title": "Triage X", "resume": "Mochizuki General Hospital boasts some of the most well-trained (and well-endowed) nurses in town. But though these ladies spend much of their day battling sickness, their after-hours are spent fighting a very different sort of disease... Under the leadership of the hospital chairman, a handful of staff members and local teenagers form a group of mercenary assassins, targeting the \"cancers\" of society and excising those individuals before their wickedness spreads.", "rate": 70, "genre": ["Animation", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62227   Expand Triage X   (2015) User Score Overview Mochizuki General Hospital boasts some of the most well-trained (and well-endowed) nurses in town. But though these ladies spend much of their day battling sickness, their after-hours are spent fighting a very different sort of disease... Under the leadership of the hospital chairman, a handful of staff members and local teenagers form a group of mercenary assassins, targeting the \"cancers\" of society and excising those individuals before their wickedness spreads. Featured Crew Shōji Satō Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2015 | 11 Episodes Season 1 of Triage X premiered on April  8, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Triage X. You can help by rating TV shows you've seen. Facts Original Name  トリアージX Status  Cancelled Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://triagex-anime.jp/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors f 12 fwaits 10 Elizabeth Jennings n 7 nicholasaraujo0 TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}