{"link": "https://www.themoviedb.org/tv/48696?language=en", "title": "Family Album", "resume": "Family Album, also known as Danielle Steel's Family Album, is a 1994 television film directed by Jack Bender. The film, which was released in two parts, is based upon the 1985 novel of the same name written by Danielle Steel. The drama centers on the life chronology of a Hollywood actress who becomes a successful film director in an era where directing was dominated by men.", "rate": 35, "genre": ["Drama", "War", "Politics"], "cast": ["Leslie Horan", "Blake Foster", "Jaclyn Smith", "Michael Ontkean", "Joe Flanigan"], "character": ["Anne Thayer O'Hara", "Young Lionel", "Faye Price Thayer", "Ward Thayer", "Lionel Thayer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48696   Expand Family Album   (1994) User Score Overview Family Album, also known as Danielle Steel's Family Album, is a 1994 television film directed by Jack Bender. The film, which was released in two parts, is based upon the 1985 novel of the same name written by Danielle Steel. The drama centers on the life chronology of a Hollywood actress who becomes a successful film director in an era where directing was dominated by men. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leslie Horan Anne Thayer O'Hara Blake Foster Young Lionel Jaclyn Smith Faye Price Thayer Michael Ontkean Ward Thayer Joe Flanigan Lionel Thayer Full Cast & Crew Last Season Season 1 1994 | 2 Episodes Season 1 of Family Album premiered on October 23, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2005-01-01 Hercules 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  200m Homepage  - Genres Drama War & Politics Keywords miniseries actress Content Score 86 Almost there... Top Contributors 25 Banana TB 23 TMDb Bot CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}