{"link": "https://www.themoviedb.org/tv/67335?language=en", "title": "Sin senos sí hay paraíso", "resume": "The tragic story of a young woman named Catalina Santana whose ambition is so strong she'll risk her life over her obsession with having larger breasts in order to attract drug lords and have all the luxuries in this world.", "rate": 59, "genre": ["Action", "Adventure", "Crime", "Drama", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67335   Expand Sin senos sí hay paraíso   (2016) User Score  Play Trailer Overview The tragic story of a young woman named Catalina Santana whose ambition is so strong she'll risk her life over her obsession with having larger breasts in order to attract drug lords and have all the luxuries in this world. Featured Crew Gustavo Bolívar Moreno Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 — | 60 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply m English subtitles Open 0 by missyolie13\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2004-05-17 Rubí 8.0    2002-08-07 La familia P. Luche 6.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  50m Homepage   http://www.telemundo.com/novelas/sin-senos-si-hay-paraiso/capitulos/segunda-temporada Genres Action & Adventure Crime Drama Mystery Keywords telenovela Content Score 71 Just a little bit more... Top Contributors l 22 leskhy 20 Marr 🇳🇱 15 mega peliculas 9 axgalarza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}