{"link": "https://www.themoviedb.org/tv/28877?language=en", "title": "Earth: The Power of the Planet", "resume": "In each episode, geologist Dr. Iain Stewart explains the effects and importance of a specific force of nature, such as wind or volcanism. He also examines the various ways in which it shapes planet earth itself and influences life on it, often in conjunction with other natural forces, and sometimes with lifeforms, as in the 'apocalyptically' grave case of global warming.", "rate": 80, "genre": ["Documentary"], "cast": ["Iain Stewart"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28877   Expand Earth: The Power of the Planet   (2007) User Score  Play Trailer Overview In each episode, geologist Dr. Iain Stewart explains the effects and importance of a specific force of nature, such as wind or volcanism. He also examines the various ways in which it shapes planet earth itself and influences life on it, often in conjunction with other natural forces, and sometimes with lifeforms, as in the 'apocalyptically' grave case of global warming. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Iain Stewart Himself - Presenter Full Cast & Crew Last Season Season 1 2007 | 5 Episodes Season 1 of Earth: The Power of the Planet premiered on November 20, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  6 Recommendations   2009-10-11 Life 8.3    2006-03-05 Planet Earth 8.5    2011-10-02 Homeland 7.3    2011-04-17 Game of Thrones 8.2  Facts Status  Ended Networks Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/sn/tvradio/programmes/earthpoweroftheplanet/page1.shtml Genres Documentary Keywords ocean power volcano earth planet atmosphere Content Score 64 We're so close, yet so far. Top Contributors 26 Elizabeth Jennings g 23 gabrielesiviero T 7 Tommy2015 A 5 Asterix_cz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}