{"link": "https://www.themoviedb.org/tv/44964?language=en", "title": "Queen In Hyun's Man", "resume": "Queen In-hyun's Man is a 2012 South Korean fantasy-romance-action-historical drama television series, starring Ji Hyun-woo and Yoo In-na. The story centers around obscure actress Choi Hee-jin who falls in love with Kim Boong-do, a time-traveling scholar from the Joseon Dynasty who jumps 300 years into the future to the 21st century.\nIt was broadcast on cable channel tvN from April 18 to June 7, 2012 on Wednesdays and Thursdays at 23:00 for 16 episodes.", "rate": 71, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Yoo In-na", "Ji Hyun-woo", "Kim Jin-woo", "Jo Dal-hwan", "Choi Woo-Ri"], "character": ["Choi Hee-Jin", "Kim Boong-do", "Han Dong-min", "Chun-soo", "Inhyeonwanghooui Namja - Royal concubine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44964   Expand Queen In Hyun's Man   (2012) User Score Overview Queen In-hyun's Man is a 2012 South Korean fantasy-romance-action-historical drama television series, starring Ji Hyun-woo and Yoo In-na. The story centers around obscure actress Choi Hee-jin who falls in love with Kim Boong-do, a time-traveling scholar from the Joseon Dynasty who jumps 300 years into the future to the 21st century. It was broadcast on cable channel tvN from April 18 to June 7, 2012 on Wednesdays and Thursdays at 23:00 for 16 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo In-na Choi Hee-Jin Ji Hyun-woo Kim Boong-do Kim Jin-woo Han Dong-min Jo Dal-hwan Chun-soo Choi Woo-Ri Inhyeonwanghooui Namja - Royal concubine Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of Queen In Hyun's Man premiered on April 18, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  6 Recommendations   2016-12-02 Goblin 7.2  Facts Original Name  인현왕후의 남자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  50m Homepage   http://program.interest.me/tvn/queenandi/ Genres Sci-Fi & Fantasy Keywords time travel Content Score 86 Almost there... Top Contributors M 20 Maria180493 N 10 Nightowl.Kr 6 Imzadi t 6 taxigps  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}