{"link": "https://www.themoviedb.org/tv/51756?language=en", "title": "Nang Rai Sai Lab", "resume": "A young actress is forced to become an undercover agent after being wrongfully accuse of a crime.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Rasri Balenciaga", "Peter Corp Dyrendal", "Apinya Sakuljaroensuk", "Gosin Ratchakrome", "Vittavat Singlumpong"], "character": ["Surikarn/Zoe", "Naruebate", "Ploynin", "Ussana", "Nathan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51756   Expand Nang Rai Sai Lab   (2013) User Score  Play Trailer Overview A young actress is forced to become an undercover agent after being wrongfully accuse of a crime. Featured Crew บริษัท กู๊ดฟีลลิ่ง จำกัด Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rasri Balenciaga Surikarn/Zoe Peter Corp Dyrendal Naruebate Apinya Sakuljaroensuk Ploynin Gosin Ratchakrome Ussana Vittavat Singlumpong Nathan Full Cast & Crew Last Season Season 1 2013 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nang Rai Sai Lab. You can help by rating TV shows you've seen. Facts Original Name  นางร้ายสายลับ Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  94m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 36 Crip 3 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}