{"link": "https://www.themoviedb.org/tv/73648?language=en", "title": "Padre Pio: Miracle Man", "resume": "The amazing details and events in Padre Pio's life as a boy and throughout his 50 years as a friar. Padre Pio was a man of great faith and devotion, deep spiritual concern for others, and great compassion for the sick and suffering, but he was persecuted by the church.", "rate": 73, "genre": ["Drama"], "cast": ["Jürgen Prochnow", "Lorenza Indovina", "Raffaele Castria", "Flavio Insinna", "Pierfrancesco Favino"], "character": ["Visitatore", "Cleonice", "Padre Agostino", "Padre Paolino", "Emanuele Brunatto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73648   Expand Padre Pio: Miracle Man   (2000) User Score Overview The amazing details and events in Padre Pio's life as a boy and throughout his 50 years as a friar. Padre Pio was a man of great faith and devotion, deep spiritual concern for others, and great compassion for the sick and suffering, but he was persecuted by the church. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jürgen Prochnow Visitatore Lorenza Indovina Cleonice Raffaele Castria Padre Agostino Flavio Insinna Padre Paolino Pierfrancesco Favino Emanuele Brunatto Full Cast & Crew Last Season Season 1 2000 | 2 Episodes Season 1 of Padre Pio: Miracle Man premiered on April 17, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2010-07-23 The Pillars of the Earth 7.9    1990-11-18 It 6.4  Facts Original Name  Padre Pio Status  Ended Network Certification  - Type  Miniseries Original Language  Italian Runtime  100m Homepage   http://fiction.mediaset.it/padre-pio/stagione-1/ Genres Drama Keywords miniseries Content Score 86 Almost there... Top Contributors TB 41 TMDb Bot 39 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}