{"link": "https://www.themoviedb.org/tv/72436?language=en", "title": "Slam Dance the Series", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 100, "genre": ["Drama", "Family", "News"], "cast": ["Luewisetphaibun Pimchanok", "Rattanaruangwattana Pluem", "Sattabut laeditee", "Chutavuth Pattarakampol", "Korn Khunatipapisiri"], "character": ["Fang", "Ryu", "Pop", "Sing", "Ken"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72436   Expand Slam Dance the Series   (2017) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Surachan Setthawongsiri Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luewisetphaibun Pimchanok Fang Rattanaruangwattana Pluem Ryu Sattabut laeditee Pop Chutavuth Pattarakampol Sing Korn Khunatipapisiri Ken Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Slam Dance the Series premiered on May 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Slam Dance the Series. You can help by rating TV shows you've seen. Facts Original Name  Slam Dance - The Series Status  Returning Series Network Certification น 15+ Meaning Nor 15+ Movies appropriate for audiences aged 15 and older. Some violence, brutality, inhumanity, bad language or indecent gestures allowed. Type  Scripted Original Language  Thai Runtime  45m Homepage  - Genres Drama Family News Keywords dance gay romance Content Score 93 Almost there... Top Contributors c 56 camus2563 9 Elizabeth Jennings 9 gayso 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}