{"link": "https://www.themoviedb.org/tv/60659?language=en", "title": "Coppelion", "resume": "Many years after a great tragedy killed 90% of the people in Japan, three girls arrive in the ruins of Tokyo. In the devastated capital, their unusually clean clothes set them apart. But that's not the only strange thing about them - they also each wield supernatural powers. They call themselves “Coppelion,” and are on a mission to save the people of Tokyo.", "rate": 60, "genre": ["Comedy", "Animation", "Adventure"], "cast": ["Haruka Tomatsu", "Kana Hanazawa", "Satomi Akesaka"], "character": ["Ibara Naruse", "Aoi Fukasaku", "Taeko Nomura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60659   Expand Coppelion   (2013) User Score Overview Many years after a great tragedy killed 90% of the people in Japan, three girls arrive in the ruins of Tokyo. In the devastated capital, their unusually clean clothes set them apart. But that's not the only strange thing about them - they also each wield supernatural powers. They call themselves “Coppelion,” and are on a mission to save the people of Tokyo. Featured Crew Shingo Suzuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruka Tomatsu Ibara Naruse Kana Hanazawa Aoi Fukasaku Satomi Akesaka Taeko Nomura Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Coppelion premiered on October  2, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Coppelion. You can help by rating TV shows you've seen. Facts Original Name  コッペリオン Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Comedy Animation Adventure Keywords based on manga anime Content Score 64 We're so close, yet so far. Top Contributors 28 Elizabeth Jennings D 27 Dlensky 9 sp1ti c 9 coffinbearer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}