{"link": "https://www.themoviedb.org/tv/5464?language=en", "title": "The Visitors", "resume": "It's the year 2484 and the Earth is threatened by a rogue comet which could fatally change its orbit. The solution is surprising - Adam Bernau, the greatest genius of 20th century developed 500 years ago an ingenious formula for easy transporting of continents and even worlds. Unfortunately, he made this discovery at the age of 11 and the exercise book containing it was destroyed in the fire. But this is not a challenge to Academic Filip who decides to send an expedition back in time to retrieve the precious exercise book from the fire. But everything is not so simple as it seems...", "rate": 83, "genre": ["Comedy", "Family", "Sci-Fi", "Fantasy"], "cast": ["Dagmar Patrasová", "Josef Bláha", "Josef Dvořák", "Jiří Datel Novotný", "Dagmar Veškrnová-Havlová"], "character": ["Emília Fernandez", "prof. Richard", "Emil Karas", "dr. Jacques Michell", "matka Adama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5464   Expand The Visitors   (1983) User Score Overview It's the year 2484 and the Earth is threatened by a rogue comet which could fatally change its orbit. The solution is surprising - Adam Bernau, the greatest genius of 20th century developed 500 years ago an ingenious formula for easy transporting of continents and even worlds. Unfortunately, he made this discovery at the age of 11 and the exercise book containing it was destroyed in the fire. But this is not a challenge to Academic Filip who decides to send an expedition back in time to retrieve the precious exercise book from the fire. But everything is not so simple as it seems... Featured Crew Ota Hofman Creator Jindřich Polák Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  15 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dagmar Patrasová Emília Fernandez Josef Bláha prof. Richard Josef Dvořák Emil Karas Jiří Datel Novotný dr. Jacques Michell Dagmar Veškrnová-Havlová matka Adama Full Cast & Crew Last Season Season 1 1983 | 15 Episodes Season 1 of The Visitors premiered on November  5, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  15 Recommendations We don't have enough data to suggest any TV shows based on The Visitors. You can help by rating TV shows you've seen. Facts Original Name  Návštěvníci Status  Ended Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  Czech Runtime  30m Homepage  - Genres Comedy Family Sci-Fi & Fantasy Keywords time travel Content Score 100 Yes! Looking good! Top Contributors 89 Arakir 21 dannyvl 19 Jiří Doubravský  VS 13 Vit Sindlar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}