{"link": "https://www.themoviedb.org/tv/4050?language=en", "title": "Louis Theroux's Weird Weekends", "resume": "Louis Theroux which delves into the weirder fringes of American society.", "rate": 84, "genre": ["Documentary"], "cast": ["Louis Theroux"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4050   Expand Louis Theroux's Weird Weekends   (1998) User Score Overview Louis Theroux which delves into the weirder fringes of American society. Featured Crew Louis Theroux Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Louis Theroux Full Cast & Crew Last Season Season 3 2000 | 6 Episodes Season 3 of Louis Theroux's Weird Weekends premiered on September 24, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2014-03-23 Louis Theroux's LA Stories 8.2    2011-05-22 Louis Theroux: Miami Mega-Jail 8.2    2009-04-16 Horrible Histories 8.6    2015-03-22 Louis Theroux: By Reason of Insanity 7.5    1999-01-13 Chewin' the Fat 8.2    2010-12-25 Come Fly With Me 6.6    2010-06-22 Memphis Beat 6.0    2007-08-27 Outnumbered 7.2  Facts Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Documentary Original Language  English Runtime  50m, 60m Homepage   http://www.bbc.co.uk/programmes/b006w7gn Genres Documentary Keywords usa documentary Content Score 64 We're so close, yet so far. Top Contributors 19 Banana 9 Joe Carson 9 Patrik Selin a 7 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}