{"link": "https://www.themoviedb.org/tv/70580?language=en", "title": "The Perfect Match", "resume": "What do netizens know? Ting En (Chris Wu) is a celebrated chef whose fine-dining restaurant is a destination for food lovers from all over the world. When Ting En stumbles upon comments on the Internet from people who can’t afford to eat at his high-priced restaurant, they blow his mind. Netizens claim that the culinary creations made by Fen Qing (Ivy Shao) at the night market are just as satisfying as Ting En’s Michelin-worthy food. Determined to debunk such preposterous claims, Ting En goes to the night market to find Fen Qing and show her what true culinary talent really is. Whose cuisine will reign supreme? “The Perfect Match” is a 2017 Taiwanese drama series.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Ivy Shao", "Chris Wu", "Shuangbao Wang", "Ben Wu", "Liu Lawrence"], "character": ["Wei Fen Qing", "Huo Ting En", "Meng Ru Xi \"Gina\"", "Meng Shao Wei", "Peng Xiao Bin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70580   Expand The Perfect Match   (2017) User Score  Play Trailer Overview What do netizens know? Ting En (Chris Wu) is a celebrated chef whose fine-dining restaurant is a destination for food lovers from all over the world. When Ting En stumbles upon comments on the Internet from people who can’t afford to eat at his high-priced restaurant, they blow his mind. Netizens claim that the culinary creations made by Fen Qing (Ivy Shao) at the night market are just as satisfying as Ting En’s Michelin-worthy food. Determined to debunk such preposterous claims, Ting En goes to the night market to find Fen Qing and show her what true culinary talent really is. Whose cuisine will reign supreme? “The Perfect Match” is a 2017 Taiwanese drama series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ivy Shao Wei Fen Qing Chris Wu Huo Ting En Shuangbao Wang Meng Ru Xi \"Gina\" Ben Wu Meng Shao Wei Liu Lawrence Peng Xiao Bin Full Cast & Crew Last Season Season 1 2017 | 22 Episodes Season 1 of The Perfect Match premiered on March  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Perfect Match. You can help by rating TV shows you've seen. Facts Original Name  極品絕配 Status  Ended Network Sanlih E-Television Certification  - Type  Scripted Original Language  Chinese Runtime  70m Homepage  - Genres Comedy Drama Keywords romance Content Score 93 Almost there... Top Contributors 21 mp4soju u 6 ufsean TB 3 TMDb Bot S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}