{"link": "https://www.themoviedb.org/tv/15095?language=en", "title": "To Catch a Predator", "resume": "To Catch a Predator is an American reality television series that features hidden camera investigations by the television newsmagazine program Dateline NBC. It was devoted to impersonating underage people and detaining male adults who contacted them over the Internet for sexual liaisons. People were lured to meet with a decoy under the pretense of sexual contact and then confronted. Show host Chris Hansen clarified in an interview with NPR News that these subjects should be labeled as potential sexual predators, and not pedophiles. \"Pedophiles have a very specific definition, people who are interested in prepubescent sex,\" he stated.\nThe series premiered in November 2004, and featured 12 investigations in total held across the United States. The investigations were conducted as undercover sting operations with the help of on-line watchdog group Perverted-Justice. Since the third installment, law enforcement and other officials were also involved, leading to the arrests of most individuals caught. No new episodes have aired since December 2007.\nNBC affiliates WTMJ in Milwaukee, KSHB in Kansas City and WBRE have also done local versions of To Catch a Predator. Various spin-offs have aired in the same format, including To Catch a Con Man, To Catch an ID Thief, To Catch a Car Thief and To Catch an i-Jacker, which featured iPod thieves. To Catch a Predator is also aired on FX and Crime & Investigation Network in the United Kingdom, the Crime & Investigation Network in Australia and New Zealand and FOX Crime in Portugal.", "rate": 90, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15095   Expand To Catch a Predator   (2004) User Score Overview To Catch a Predator is an American reality television series that features hidden camera investigations by the television newsmagazine program Dateline NBC. It was devoted to impersonating underage people and detaining male adults who contacted them over the Internet for sexual liaisons. People were lured to meet with a decoy under the pretense of sexual contact and then confronted. Show host Chris Hansen clarified in an interview with NPR News that these subjects should be labeled as potential sexual predators, and not pedophiles. \"Pedophiles have a very specific definition, people who are interested in prepubescent sex,\" he stated. The series premiered in November 2004, and featured 12 investigations in total held across the United States. The investigations were conducted as undercover sting operations with the help of on-line watchdog group Perverted-Justice. Since the third installment, law enforcement and other officials were also involved, leading to the arrests of most individuals caught. No new episodes have aired since December 2007. NBC affiliates WTMJ in Milwaukee, KSHB in Kansas City and WBRE have also done local versions of To Catch a Predator. Various spin-offs have aired in the same format, including To Catch a Con Man, To Catch an ID Thief, To Catch a Car Thief and To Catch an i-Jacker, which featured iPod thieves. To Catch a Predator is also aired on FX and Crime & Investigation Network in the United Kingdom, the Crime & Investigation Network in Australia and New Zealand and FOX Crime in Portugal. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2004 | 20 Episodes Season 1 of To Catch a Predator premiered on November 11, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply These predators... Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on To Catch a Predator. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.msnbc.msn.com/id/10912603/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}