{"link": "https://www.themoviedb.org/tv/3591?language=en", "title": "The Jewel in the Crown", "resume": "The Jewel in the Crown, based upon the Raj Quartet novels by Paul Scott, is a British television serial about the final days of the British Raj in India during World War II. The story begins with an unjust arrest for rape. The consequences of this echo through the series. Questions of identity and personal responsibility are explored against a background of war and personal intrigue. The series was produced by Granada Television for the ITV network.", "rate": 78, "genre": ["Drama"], "cast": ["Tim Pigott-Smith", "Geraldine James", "Wendy Morgan", "Judy Parfitt", "Rosemary Leach"], "character": ["Ronald Merrick", "Sarah Layton", "Susan Layton", "Mildred Layton", "Aunt Fenny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3591   Expand The Jewel in the Crown   (1984) User Score Overview The Jewel in the Crown, based upon the Raj Quartet novels by Paul Scott, is a British television serial about the final days of the British Raj in India during World War II. The story begins with an unjust arrest for rape. The consequences of this echo through the series. Questions of identity and personal responsibility are explored against a background of war and personal intrigue. The series was produced by Granada Television for the ITV network. Featured Crew Irene Shubik Creator Paul Scott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Pigott-Smith Ronald Merrick Geraldine James Sarah Layton Wendy Morgan Susan Layton Judy Parfitt Mildred Layton Rosemary Leach Aunt Fenny Full Cast & Crew Last Season Miniseries 1984 | 14 Episodes Season 1 of The Jewel in the Crown premiered on January  9, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on The Jewel in the Crown. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 50m Homepage  - Genres Drama Keywords rape based on novel or book world war ii miniseries india period drama 1940s british raj Content Score 93 Almost there... Top Contributors TB 19 TMDb Bot 8 genplant29 R 8 Rebecca r 5 racci  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}