{"link": "https://www.themoviedb.org/tv/41956?language=en", "title": "Death in Paradise", "resume": "Detective Inspector Richard Poole is transferred to Sainte Marie, an island in the Caribbean. Totally unsuited to the Caribbean way of life, Richard hates the sun, sea and sand and isn't used to the Sainte Marie style of policing. Working with the exotic Camille each week Richard investigates intricate and intriguing murders.", "rate": 76, "genre": ["Comedy", "Crime", "Drama", "Mystery"], "cast": ["Don Warrington"], "character": ["Commissioner Selwyn Patterson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41956   Expand Death in Paradise   (2011) User Score  Play Trailer Overview Detective Inspector Richard Poole is transferred to Sainte Marie, an island in the Caribbean. Totally unsuited to the Caribbean way of life, Richard hates the sun, sea and sand and isn't used to the Sainte Marie style of policing. Working with the exotic Camille each week Richard investigates intricate and intriguing murders. Featured Crew Robert Thorogood Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  16 Posters  7 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Warrington Commissioner Selwyn Patterson Full Cast & Crew Current Season Season 7 2018 | 8 Episodes Season 7 of Death in Paradise premiered on January  4, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply l Dwayne Open 0 by lima-2\n      \n     b Jack Mooney Open 8 by  lima-2 Go to Discussions Media Most Popular Videos  3 Backdrops  16 Posters  7 Recommendations   2010-08-15 Vexed 7.2    2013-02-01 The Doctor Blake Mysteries 7.6    2008-11-30 Wallander 7.6    2004-09-02 Doc Martin 8.1    2015-09-12 Goldie & Bear 5.4    2011-09-05 Zig and Sharko 5.3    2011-07-27 The Code 6.7    2015-01-10 My Sunshine 7.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b01pvmf6 Genres Comedy Crime Drama Mystery Keywords caribbean islands police detective murder investigation british humour Content Score 71 Just a little bit more... Top Contributors 70 Elizabeth Jennings M 29 Manu 19 Banana 14 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}