{"link": "https://www.themoviedb.org/tv/72788?language=en", "title": "Magical Circle Guruguru", "resume": "The seal that for hundreds of years had confined the demon king Giri has worn off. A young boy named Nike is chosen (against his will) as the hero. Together with Kukuri, a girl who is the lone survivor of the tribe that had used black magic to seal Giri, they set off to save the world, RPG style.", "rate": 80, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72788   Expand Magical Circle Guruguru   (2017) User Score Overview The seal that for hundreds of years had confined the demon king Giri has worn off. A young boy named Nike is chosen (against his will) as the hero. Together with Kukuri, a girl who is the lone survivor of the tribe that had used black magic to seal Giri, they set off to save the world, RPG style. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 24 Episodes Season 1 of Magical Circle Guruguru premiered on July 11, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Magical Circle Guruguru. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Magical Circle Guruguru. You can help by rating TV shows you've seen. Facts Original Name  魔法陣グルグル Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://guruguru-anime.jp/ Genres Action & Adventure Animation Comedy Keywords fantasy parody shounen anime Content Score 56 We're so close, yet so far. Top Contributors D 31 Destr0y 23 sp1ti 8 digr33n TB 8 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}