{"link": "https://www.themoviedb.org/tv/2825?language=en", "title": "The Contender", "resume": "The Contender is a reality television series that follows a group of boxers as they compete with one another in an elimination-style competition, while their lives and relationships with each other and their families are depicted. Produced by Mark Burnett, the show is hosted by Sugar Ray Leonard, who shared hosting duties in the first season with actor Sylvester Stallone. Leonard also serves as a trainer on the show, along with Tommy Gallagher. During the first season, boxing manager Jackie Kallen also served as counsel to the boxers.\nThe show ran for fifteen weeks through 2005 on NBC in the United States of America. The show ran in the UK on ITV2 and was repeated later in the week on ITV1, and now airs on ITV4. It also aired on AXN in India, and on the Spanish language network Telemundo. The second season, featuring welterweight contenders, premiered in the U.S. on Tuesday, July 18, 2006, at 10 pm ET/PT, on ESPN. The third season, featuring super middleweight contenders, premiered in the U.S. on Tuesday, September 4, 2007, at 10 pm ET/PT, on ESPN. The fourth season, featuring cruiserweight contenders, premiered in the U.S. on Wednesday, December 3, 2008, at 10 pm ET/PT, on Versus.", "rate": 80, "genre": ["Reality"], "cast": ["Sylvester Stallone", "Sergio Mora", "Brent Cooper", "Tarick Salmaci", "Najai Turpin"], "character": ["Boxing Mentor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2825   Expand The Contender   (2005) User Score Overview The Contender is a reality television series that follows a group of boxers as they compete with one another in an elimination-style competition, while their lives and relationships with each other and their families are depicted. Produced by Mark Burnett, the show is hosted by Sugar Ray Leonard, who shared hosting duties in the first season with actor Sylvester Stallone. Leonard also serves as a trainer on the show, along with Tommy Gallagher. During the first season, boxing manager Jackie Kallen also served as counsel to the boxers. The show ran for fifteen weeks through 2005 on NBC in the United States of America. The show ran in the UK on ITV2 and was repeated later in the week on ITV1, and now airs on ITV4. It also aired on AXN in India, and on the Spanish language network Telemundo. The second season, featuring welterweight contenders, premiered in the U.S. on Tuesday, July 18, 2006, at 10 pm ET/PT, on ESPN. The third season, featuring super middleweight contenders, premiered in the U.S. on Tuesday, September 4, 2007, at 10 pm ET/PT, on ESPN. The fourth season, featuring cruiserweight contenders, premiered in the U.S. on Wednesday, December 3, 2008, at 10 pm ET/PT, on Versus. Featured Crew Mark Burnett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sylvester Stallone Boxing Mentor Sergio Mora Brent Cooper Tarick Salmaci Najai Turpin Full Cast & Crew Last Season Season 5 2008 | 13 Episodes Season 5 of The Contender premiered on December  3, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Contender. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Reality Original Language  English Runtime  60m Homepage  - Genres Reality Keywords boxer sports show Content Score 93 Almost there... Top Contributors 14 Banana TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}