{"link": "https://www.themoviedb.org/tv/20588?language=en", "title": "Money's Warfare", "resume": "War of Money is a 2007 South Korean television drama series adaptation of Park In-kwon's comic of the same name. Starring Park Shin-yang and Park Jin-hee, it aired on SBS from May 16 to July 19, 2007 on Wednesdays and Thursdays at 21:55 for 20 episodes.\nOriginally scheduled for 16 episodes, due to its popularity it was extended to 20, but only Park Shin-yang starred in the four-episode \"bonus round.\"", "rate": 80, "genre": ["Drama"], "cast": ["Park Shin-yang", "Kim Jung-hwa", "Park Jin-Hee", "Kim Hee-jung", "Jeong So-yeong"], "character": ["Seo Joo-hee", "Ma Dong-po's wife", "Kang Hye-Young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20588   Expand Money's Warfare   (2007) User Score Overview War of Money is a 2007 South Korean television drama series adaptation of Park In-kwon's comic of the same name. Starring Park Shin-yang and Park Jin-hee, it aired on SBS from May 16 to July 19, 2007 on Wednesdays and Thursdays at 21:55 for 20 episodes. Originally scheduled for 16 episodes, due to its popularity it was extended to 20, but only Park Shin-yang starred in the four-episode \"bonus round.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Shin-yang Kim Jung-hwa Park Jin-Hee Seo Joo-hee Kim Hee-jung Ma Dong-po's wife Jeong So-yeong Kang Hye-Young Full Cast & Crew Last Season Money war season 1 2007 | 16 Episodes Season 1 of Money's Warfare premiered on May 16, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Money's Warfare. You can help by rating TV shows you've seen. Facts Original Name  쩐의 전쟁 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://tv.sbs.co.kr/warofmoney Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 7 Nightowl.Kr 5 friend-series.com t 2 tmdb38202327 1 Neirim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}