{"link": "https://www.themoviedb.org/tv/7371?language=en", "title": "The Hollowmen", "resume": "The Hollowmen is an Australian television comedy series set in the offices of the Central Policy Unit, a fictional political advisory unit personally set up by the Prime Minister to help him get re-elected. Their brief is long term vision; to stop worrying about tomorrow's headlines, and focus on next week's.\nThe Hollowmen was first broadcast on Wednesday, 9 July 2008, on ABC1. Each series comprises six half-hour episodes. On the eve of the first episode's national premiere, the series was approved by the ABC for a second series. The second series was screened right after the first, beginning on 13 September 2008.\nThe comedy-drama satire is produced by Working Dog Productions, which was also responsible for Frontline, The Panel and Thank God You're Here. The music used during the opening credits is an edited instrumental version of the 1987 song \"North by North\" by New Zealand band The Bats. A special one-off presentation of The Hollowmen was created by Working Dog and played at Parliament House in Canberra on 11 March 2009, in support of the ABC's funding bid for 2009-12.", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["Stephen Hall", "Zlad!", "Nicola Parry", "Rob Sitch", "Jacqueline Brennan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7371   Expand The Hollowmen   (2008) User Score Overview The Hollowmen is an Australian television comedy series set in the offices of the Central Policy Unit, a fictional political advisory unit personally set up by the Prime Minister to help him get re-elected. Their brief is long term vision; to stop worrying about tomorrow's headlines, and focus on next week's. The Hollowmen was first broadcast on Wednesday, 9 July 2008, on ABC1. Each series comprises six half-hour episodes. On the eve of the first episode's national premiere, the series was approved by the ABC for a second series. The second series was screened right after the first, beginning on 13 September 2008. The comedy-drama satire is produced by Working Dog Productions, which was also responsible for Frontline, The Panel and Thank God You're Here. The music used during the opening credits is an edited instrumental version of the 1987 song \"North by North\" by New Zealand band The Bats. A special one-off presentation of The Hollowmen was created by Working Dog and played at Parliament House in Canberra on 11 March 2009, in support of the ABC's funding bid for 2009-12. Featured Crew Tom Gleisner Creator Rob Sitch Creator Santo Cilauro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Hall Zlad! Nicola Parry Rob Sitch Jacqueline Brennan Full Cast & Crew Last Season Season 2 2008 | 6 Episodes Season 2 of The Hollowmen premiered on September  3, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Hollowmen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/hollowmen/ Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 3 United600 TB 2 TMDb Bot A 1 Alex 1 lemonlyman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}