{"link": "https://www.themoviedb.org/tv/34978?language=en", "title": "Let's Stay Together", "resume": "Let's Stay Together is an American romantic comedy television series created by Jacque Edmonds Cofer. It premiered on BET on January 11, 2011. The title of the series refers to the Al Green landmark 1972 song of the same name. The series premiere drew 4.4 million viewers. Initially, Soul Food star Malinda Williams was cast in the lead role of Stacy. For undisclosed reasons, she was recast with Nadine Ellis.\nOn April 20, 2013, BET announced that the series was renewed for a second season which aired 22 episodes starting in January 2012. For its second season, Erica Hubbard appeared infrequently due to her pregnancy. New cast member Kyla Pratt joined the cast portraying Crystal, Charles and Kita's cousin. At the 2012 BET Upfront on April 13, 2012, it was revealed that the show has been renewed for a third season. The third season premiered on March 26, 2013. In April 2013, BET Networks announced the show had been renewed for a fourth season that will premiere in early 2014.", "rate": 0, "genre": ["Comedy"], "cast": ["RonReaco Lee", "Erica Hubbard", "Joyful Drake", "Kyla Pratt"], "character": ["Tasha Woodson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34978   Expand Let's Stay Together   (2011) User Score Overview Let's Stay Together is an American romantic comedy television series created by Jacque Edmonds Cofer. It premiered on BET on January 11, 2011. The title of the series refers to the Al Green landmark 1972 song of the same name. The series premiere drew 4.4 million viewers. Initially, Soul Food star Malinda Williams was cast in the lead role of Stacy. For undisclosed reasons, she was recast with Nadine Ellis. On April 20, 2013, BET announced that the series was renewed for a second season which aired 22 episodes starting in January 2012. For its second season, Erica Hubbard appeared infrequently due to her pregnancy. New cast member Kyla Pratt joined the cast portraying Crystal, Charles and Kita's cousin. At the 2012 BET Upfront on April 13, 2012, it was revealed that the show has been renewed for a third season. The third season premiered on March 26, 2013. In April 2013, BET Networks announced the show had been renewed for a fourth season that will premiere in early 2014. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast RonReaco Lee Erica Hubbard Joyful Drake Tasha Woodson Kyla Pratt Full Cast & Crew Last Season Season 3 2013 | 10 Episodes Season 3 of Let's Stay Together premiered on March 26, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Let's Stay Together. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 Elizabeth Jennings 1 Mikedeth5 w 1 whitelist 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}