{"link": "https://www.themoviedb.org/tv/61378?language=en", "title": "Madam Secretary", "resume": "Former CIA agent Elizabeth Faulkner McCord is suddenly thrust into the position of US Secretary of State where she must quickly learn to drive international diplomacy, wrangle office politics and balance a complex family life.", "rate": 66, "genre": ["Drama"], "cast": ["Téa Leoni", "Tim Daly", "Bebe Neuwirth", "Sara Ramirez", "Zeljko Ivanek"], "character": ["Elizabeth McCord", "Henry McCord", "Nadine Tolliver", "Kat Sandoval", "Russell Jackson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61378   Expand Madam Secretary   (2014) User Score  Play Trailer Overview Former CIA agent Elizabeth Faulkner McCord is suddenly thrust into the position of US Secretary of State where she must quickly learn to drive international diplomacy, wrangle office politics and balance a complex family life. Featured Crew Barbara Hall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Téa Leoni Elizabeth McCord Tim Daly Henry McCord Bebe Neuwirth Nadine Tolliver Sara Ramirez Kat Sandoval Zeljko Ivanek Russell Jackson Full Cast & Crew Current Season Season 4 2017 | 22 Episodes Season 4 of Madam Secretary premiered on October  7, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply b this show really is getting too much. Open 0 by billr1953\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  9 Recommendations   2012-04-05 Scandal 6.6    2017-01-25 Mary Kills People 7.5    2016-01-07 Shades of Blue 6.2    2015-09-27 Quantico 5.9    2017-10-09 Valor 6.3    2015-06-01 American Genius 7.0    2009-02-25 Burnistoun 7.8    1999-04-29 Grand Designs 7.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbs.com/shows/madam-secretary/ Genres Drama Keywords washington d.c. government politics politician diplomacy usa politics secretary of state Content Score 100 Yes! Looking good! Top Contributors 78 Banana 27 Ravavamouna 26 Elizabeth Jennings 20 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}