{"link": "https://www.themoviedb.org/tv/39198?language=en", "title": "Heartstrings", "resume": "Heartstrings is a South Korean youthful melodrama about the main characters' love, friendship and dreams, set against the backdrop of a university. Prior to its television premier in South Korea the rights to the series were sold to eight countries including Japan, China, and North America.", "rate": 70, "genre": ["Comedy"], "cast": ["Park Shin-hye", "Jung Yong-hwa", "Song Chang-eui", "So Yi-hyun", "Kang Min-Hyuk"], "character": ["Lee Gyu-won", "Lee Shin", "Kim Suk-hyun", "Jung Yoon-soo", "Yeo Joon-hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39198   Expand Heartstrings   (2011) User Score Overview Heartstrings is a South Korean youthful melodrama about the main characters' love, friendship and dreams, set against the backdrop of a university. Prior to its television premier in South Korea the rights to the series were sold to eight countries including Japan, China, and North America. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Shin-hye Lee Gyu-won Jung Yong-hwa Lee Shin Song Chang-eui Kim Suk-hyun So Yi-hyun Jung Yoon-soo Kang Min-Hyuk Yeo Joon-hee Full Cast & Crew Last Season Season 1 2011 | 15 Episodes Season 1 of Heartstrings premiered on June 29, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2009-10-07 You're Beautiful 7.9    2014-04-30 A New Leaf 7.7    2014-12-15 Punch 8.9    2015-11-16 Oh My Venus 7.8    2011-03-16 49 Days 8.9    2015-01-19 Shine or Go Crazy 7.0    2012-01-30 Shut Up Flower Boy Band 7.6    2005-06-01 My Lovely Sam-Soon 8.5  Facts Original Name  넌 내게 반했어 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/fallinlove/index.html Genres Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 11 Maria180493 t 10 tmdb38202327 CM 6 Cherche Moi s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}