{"link": "https://www.themoviedb.org/tv/33144?language=en", "title": "Identity", "resume": "Identity is a British police procedural drama television series starring Aidan Gillen and Keeley Hawes, airing in the UK during July–August 2010. Concerning identity theft, the series was created and written by Ed Whitmore, a writer most noted for his work on the BBC's Waking The Dead and the acclaimed ITV mini-series He Kills Coppers. The remake rights have been sold to the ABC Network in America who are developing their own version of the show. ITV confirmed that the show had been cancelled on 19 October 2010, after a single series.", "rate": 70, "genre": ["Drama"], "cast": ["Shaun Parkes", "Holly Aird", "Aidan Gillen", "Elyes Gabel", "Keeley Hawes"], "character": ["DI John Bloom", "DSI Martha Lawson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33144   Expand Identity   (2010) User Score  Play Trailer Overview Identity is a British police procedural drama television series starring Aidan Gillen and Keeley Hawes, airing in the UK during July–August 2010. Concerning identity theft, the series was created and written by Ed Whitmore, a writer most noted for his work on the BBC's Waking The Dead and the acclaimed ITV mini-series He Kills Coppers. The remake rights have been sold to the ABC Network in America who are developing their own version of the show. ITV confirmed that the show had been cancelled on 19 October 2010, after a single series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shaun Parkes Holly Aird Aidan Gillen DI John Bloom Elyes Gabel Keeley Hawes DSI Martha Lawson Full Cast & Crew Last Season Season 1 2010 | 6 Episodes Season 1 of Identity premiered on July  5, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Identity. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  5 Recommendations   2013-05-10 Life of Crime 6.0    2008-11-19 The Devil's Whore 6.4    1997-05-09 Jonathan Creek 7.7    2013-08-04 Southcliffe 7.4    2007-03-12 The Riches 7.6    2014-11-13 Babylon 7.1    2009-06-17 The Take 7.7    2012-09-06 The Bletchley Circle 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.itv.com/drama/copsandcrime/identity/ Genres Drama Keywords police identity theft Content Score 93 Almost there... Top Contributors 10 Banana w 3 webmaster 2 tigru89 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}