{"link": "https://www.themoviedb.org/tv/66579?language=en", "title": "The Three Sides of Ana", "resume": "Over a road trip, triplets Ana Laura, Ana Leticia, and Ana Lucía, along with their parents, suffer a dramatic accident crashing by the side of a river. The consequences of this event are catastrophic: Both parents die, Ana Laura loses one leg, and Ana Lucía, unconscious, is dragged by the river’s flow. Only Ana Leticia, who actually caused the accident, emerges unscathed. Soledad, a woman who was seriously hurt after her daughter’s death, helps Ana Lucía, whom she finds agonizing. Although Soledad discovers who the girl is, she takes advantage of her memory loss regarding the accident and her family and decides to keep her, making her believe she is her mother. Despite everyone declares Ana Lucía is death, Ernestina, the triplets' grandmother, and Ramiro, their uncle, don’t give up and do everything they can to find Ana Lucía. But years go by, the same as their wishful", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Angelique Boyer", "Sebastián Rulli", "David Zepeda"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66579   Expand The Three Sides of Ana   (2016) User Score Overview Over a road trip, triplets Ana Laura, Ana Leticia, and Ana Lucía, along with their parents, suffer a dramatic accident crashing by the side of a river. The consequences of this event are catastrophic: Both parents die, Ana Laura loses one leg, and Ana Lucía, unconscious, is dragged by the river’s flow. Only Ana Leticia, who actually caused the accident, emerges unscathed. Soledad, a woman who was seriously hurt after her daughter’s death, helps Ana Lucía, whom she finds agonizing. Although Soledad discovers who the girl is, she takes advantage of her memory loss regarding the accident and her family and decides to keep her, making her believe she is her mother. Despite everyone declares Ana Lucía is death, Ernestina, the triplets' grandmother, and Ramiro, their uncle, don’t give up and do everything they can to find Ana Lucía. But years go by, the same as their wishful Featured Crew Jorge Lozano Soriano Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angelique Boyer Sebastián Rulli David Zepeda Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of The Three Sides of Ana premiered on May 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Three Sides of Ana. You can help by rating TV shows you've seen. Facts Original Name  Tres veces Ana Status  Returning Series Networks Certification 12 Meaning Content suitable for viewers over the age of 12. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Soap Drama Keywords romance soap Content Score 64 We're so close, yet so far. Top Contributors 13 Elizabeth Jennings EL 11 Erica L Thompson 11 Alexandre Gomes 9 WLEXT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}