{"link": "https://www.themoviedb.org/tv/31489?language=en", "title": "18 to Life", "resume": "18 to Life is a Canadian television sitcom that debuted on January 4, 2010, on CBC Television. The series is shown in Quebec on Vrak.TV with the title Majeurs et mariés.", "rate": 60, "genre": ["Comedy"], "cast": ["Michael Seater", "Stacey Farber", "Peter Keleghan", "Ellen David", "Alain Goulem"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31489   Expand 18 to Life   (2010) User Score Overview 18 to Life is a Canadian television sitcom that debuted on January 4, 2010, on CBC Television. The series is shown in Quebec on Vrak.TV with the title Majeurs et mariés. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Seater Stacey Farber Peter Keleghan Ellen David Alain Goulem Full Cast & Crew Last Season Season 2 2011 | 13 Episodes Season 2 of 18 to Life premiered on January  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 18 to Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.cbc.ca/18tolife Genres Comedy Keywords neighbor newlywed sitcom young adult married life Content Score 86 Almost there... Top Contributors 9 Banana 6 efeka z 5 zurman1 3 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}