{"link": "https://www.themoviedb.org/tv/74?language=en", "title": "Fievel's American Tails", "resume": "Fievel's American Tails is an American/Canadian animated television series, produced by Steven Spielberg's Amblimation animation studio, Nelvana, and Universal Cartoon Studios. It aired for one season in 1992, and continued Fievel's adventures from the film An American Tail: Fievel Goes West.\nIn 1993 and 1994, MCA/Universal Home Video released twelve episodes on six VHS video-cassettes, two Laserdisc volumes. These have been the only home video releases of the cartoon, at least in the United States. In the United Kingdom, 12 episodes were released on six video-cassettes in 1995, but were in a different episode order to the United States and Vol.4 features the only episode that hasn't been released in the United States. Episodes have been released on DVD in France, Germany, and Italy. Universal currently has no plans to release the show on DVD in the United States, as of November 19, 2009.\nIn Russia, the cartoon, dubbed in Russian but retaining the original English titles and names, was broadcast on First Channel Russian Television in summer 1996 with Woody Woodpecker. Repeat airings were broadcast in Spring 2002 and Winter 2005. In Japan, the cartoon was dubbed into Japanese and aired on TBS from January 7, 1995 until March 25 of the same year, showing all the episodes weekly.", "rate": 65, "genre": ["Western", "Animation", "Family"], "cast": ["Gerrit Graham", "Dom DeLuise", "Phillip Glasser", "Kenneth Mars", "Lloyd Battista"], "character": ["Cat R. Waul (voice)", "Tiger (voice)", "Fievel Mousekewitz (voice)", "Sweet William (voice)", "Papa Mousekewitz (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74   Expand Fievel's American Tails   (1993) User Score Overview Fievel's American Tails is an American/Canadian animated television series, produced by Steven Spielberg's Amblimation animation studio, Nelvana, and Universal Cartoon Studios. It aired for one season in 1992, and continued Fievel's adventures from the film An American Tail: Fievel Goes West. In 1993 and 1994, MCA/Universal Home Video released twelve episodes on six VHS video-cassettes, two Laserdisc volumes. These have been the only home video releases of the cartoon, at least in the United States. In the United Kingdom, 12 episodes were released on six video-cassettes in 1995, but were in a different episode order to the United States and Vol.4 features the only episode that hasn't been released in the United States. Episodes have been released on DVD in France, Germany, and Italy. Universal currently has no plans to release the show on DVD in the United States, as of November 19, 2009. In Russia, the cartoon, dubbed in Russian but retaining the original English titles and names, was broadcast on First Channel Russian Television in summer 1996 with Woody Woodpecker. Repeat airings were broadcast in Spring 2002 and Winter 2005. In Japan, the cartoon was dubbed into Japanese and aired on TBS from January 7, 1995 until March 25 of the same year, showing all the episodes weekly. Featured Crew David Kirschner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gerrit Graham Cat R. Waul (voice) Dom DeLuise Tiger (voice) Phillip Glasser Fievel Mousekewitz (voice) Kenneth Mars Sweet William (voice) Lloyd Battista Papa Mousekewitz (voice) Full Cast & Crew Last Season season 1 1991 | 13 Episodes Season 1 of Fievel's American Tails premiered on September  7, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fievel's American Tails. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Animation Family Keywords cartoon mouse wild west based on movie Content Score 79 Pump it up! We're close now. Top Contributors 13 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}