{"link": "https://www.themoviedb.org/tv/13261?language=en", "title": "Traffic", "resume": "Traffic: The Miniseries is a three-part feature on the United States cable channel USA Network in 2004 featuring an ensemble cast portraying the complex world of drugs, their distribution, the associated violence, and the wide variety of people whose lives are touched by it all. The mini-series was partially shot in Kamloops, Ashcroft, and Cache Creek, B.C. standing in for Afghanistan.\nIt was inspired by the 1989 television miniseries Traffik made by Channel 4 in Britain and the 2000 motion picture Traffic directed by Steven Soderbergh.\nThe American version was nominated for three Emmy Awards. Traffic: The Miniseries was directed by Eric Bross and Stephen Hopkins and written by Ron Hutchinson. The cast is composed of principal actors Cliff Curtis, Martin Donovan, Balthazar Getty, Elias Koteas, Mary McCormack, Ritchie Coster, Nelson Lee, and Tony Musante, while the supporting cast includes Justin Chatwin, Jennifer Rae Westley, Katia Khatchadourian, Johanna Olson, and Brian George.", "rate": 80, "genre": ["Drama"], "cast": ["Mary McCormack", "Balthazar Getty", "Ritchie Coster", "Nelson Lee", "Elias Koteas"], "character": ["Carole McKay", "Ben Edmonds", "Fazal", "Ronny Cho", "Mike McKay"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13261   Expand Traffic   (2004) User Score Overview Traffic: The Miniseries is a three-part feature on the United States cable channel USA Network in 2004 featuring an ensemble cast portraying the complex world of drugs, their distribution, the associated violence, and the wide variety of people whose lives are touched by it all. The mini-series was partially shot in Kamloops, Ashcroft, and Cache Creek, B.C. standing in for Afghanistan. It was inspired by the 1989 television miniseries Traffik made by Channel 4 in Britain and the 2000 motion picture Traffic directed by Steven Soderbergh. The American version was nominated for three Emmy Awards. Traffic: The Miniseries was directed by Eric Bross and Stephen Hopkins and written by Ron Hutchinson. The cast is composed of principal actors Cliff Curtis, Martin Donovan, Balthazar Getty, Elias Koteas, Mary McCormack, Ritchie Coster, Nelson Lee, and Tony Musante, while the supporting cast includes Justin Chatwin, Jennifer Rae Westley, Katia Khatchadourian, Johanna Olson, and Brian George. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary McCormack Carole McKay Balthazar Getty Ben Edmonds Ritchie Coster Fazal Nelson Lee Ronny Cho Elias Koteas Mike McKay Full Cast & Crew Last Season Season 1 2004 | 4 Episodes Season 1 of Traffic premiered on January 26, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Traffic. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  360m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 16 TMDb Bot 5 Darze s 3 speedycars 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}