{"link": "https://www.themoviedb.org/tv/30289?language=en", "title": "Van Dyke and Company", "resume": "Short-lived variety show starring Dick Van Dyke and assorted guests. The show was best known for Dick's pantomime acting and a recurring skit about the dumbest family in the world, coincidently named \"The Bright Family\". Van Dyke & Co also featured appearances by the Los Angeles Mime Company.", "rate": 0, "genre": ["Comedy"], "cast": ["Chuck McCann", "Andy Kaufman", "Richard Kiel", "James R. Stein", "Jack Mendelsohn"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30289   Expand Van Dyke and Company   (1976) User Score Overview Short-lived variety show starring Dick Van Dyke and assorted guests. The show was best known for Dick's pantomime acting and a recurring skit about the dumbest family in the world, coincidently named \"The Bright Family\". Van Dyke & Co also featured appearances by the Los Angeles Mime Company. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chuck McCann Andy Kaufman Richard Kiel James R. Stein Jack Mendelsohn Full Cast & Crew Last Season Season 1 1976 | 11 Episodes Season 1 of Van Dyke and Company premiered on September 20, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Van Dyke and Company. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 22 CouchTater 8 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}