{"link": "https://www.themoviedb.org/tv/13253?language=en", "title": "Traffik", "resume": "Traffik is a 1989 British television serial about the illegal drugs trade. Its three stories are interwoven, with arcs told from the perspectives of Afghan and Pakistani growers and manufacturers, German dealers, and British users. It was nominated for six BAFTA Awards, winning three. It also won an International Emmy Award for best drama.\nThe 2000 crime drama film Traffic, directed by Steven Soderbergh, was based on this television serial. In turn, the 2004 American television miniseries Traffic was based on both versions.", "rate": 88, "genre": ["Drama"], "cast": ["Lindsay Duncan", "Jamal Shah", "Bill Paterson", "Talat Hussain", "Julia Ormond"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13253   Expand Traffik   (1989) User Score Overview Traffik is a 1989 British television serial about the illegal drugs trade. Its three stories are interwoven, with arcs told from the perspectives of Afghan and Pakistani growers and manufacturers, German dealers, and British users. It was nominated for six BAFTA Awards, winning three. It also won an International Emmy Award for best drama. The 2000 crime drama film Traffic, directed by Steven Soderbergh, was based on this television serial. In turn, the 2004 American television miniseries Traffic was based on both versions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lindsay Duncan Jamal Shah Bill Paterson Talat Hussain Julia Ormond Full Cast & Crew Last Season Season 1 1989 | 6 Episodes Season 1 of Traffik premiered on June 22, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Traffik. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords drug dealer drug trade drugs Content Score 86 Almost there... Top Contributors 15 Banana a 3 alexmate 3 denzoid TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}