{"link": "https://www.themoviedb.org/tv/22254?language=en", "title": "Phantom: Requiem for the Phantom", "resume": "Mafia is rife in America where assassinations are a regular occurrence on the streets. Inferno, a mysterious company, is behind most of these dealings through the use of their near-invincible human weapon, \"Phantom.\"\nOne day, a Japanese tourist accidentally witnesses Phantom's latest murder. Desperate to escape, the tourist hides in a secluded building. However, Phantom, revealed to be a young woman named Ein, and the leader of Inferno \"Scythe Master\" captures the tourist and brainwashes him.\nGiven the name \"Zwei,\" this once peaceful tourist is now a puppet of Inferno with no memories. Drawn into a world of lies, deceit, and violence, Zwei must fight to survive, hopefully to one day regain his memories and escape from this world where he is constantly on the brink of death.", "rate": 64, "genre": ["Animation", "Action", "Adventure"], "cast": ["Miyuki Sawashiro", "Ayahi Takagaki", "Aya Hisakawa", "Isshin Chiba", "Akeno Watanabe"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 22254   Expand Phantom: Requiem for the Phantom   (2009) User Score Overview Mafia is rife in America where assassinations are a regular occurrence on the streets. Inferno, a mysterious company, is behind most of these dealings through the use of their near-invincible human weapon, \"Phantom.\" One day, a Japanese tourist accidentally witnesses Phantom's latest murder. Desperate to escape, the tourist hides in a secluded building. However, Phantom, revealed to be a young woman named Ein, and the leader of Inferno \"Scythe Master\" captures the tourist and brainwashes him. Given the name \"Zwei,\" this once peaceful tourist is now a puppet of Inferno with no memories. Drawn into a world of lies, deceit, and violence, Zwei must fight to survive, hopefully to one day regain his memories and escape from this world where he is constantly on the brink of death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyuki Sawashiro Ayahi Takagaki Aya Hisakawa Isshin Chiba Akeno Watanabe Full Cast & Crew Last Season Season 1 2009 | 26 Episodes Season 1 of Phantom: Requiem for the Phantom premiered on April  2, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Phantom: Requiem for the Phantom. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations   2012-04-05 Sankarea: Undying Love 7.0    2011-04-14 Aria the Scarlet Ammo 6.4    2014-10-07 Yona of the Dawn 7.5    2016-01-11 Grimgar of Fantasy and Ash 7.2    2012-09-29 From the New World 8.1    2015-07-07 Overlord 7.6    2013-03-31 Date a Live 7.9    2011-04-17 Blue Exorcist 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 Derians 4 kamwatka m 3 magoozin 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}