{"link": "https://www.themoviedb.org/tv/34189?language=en", "title": "The Irresponsible Captain Tylor", "resume": "The Irresponsible Captain Tylor is an anime series based on The Most Irresponsible Man in Space light novel series by Hitoshi Yoshioka. It was produced by some of Japan's larger studios, including Big West, Tatsunoko Production, King Records and VAP.\nTylor consists of a 26-episodes TV series created by Kōichi Mashimo, and a sequel OVA series of 10 episodes directed by Mashimo and Naoyuki Yoshinaga. The TV show premiered in Japan on TV Tokyo between January 25, 1993 and July 19, 1993, and was broadcast across Latin America by the television network, Magic Kids. Both series were broadcast across the United States by AZN Television. Tylor is distributed across North America by The Right Stuf International.\nIt is usually classified as humorous space opera.\nEnterbrain published a 3-volume manga miniseries in 2001.", "rate": 90, "genre": ["Sci-Fi", "Fantasy", "Animation", "Comedy"], "cast": ["Hiroko Kasahara", "Jōji Yanami", "Yuri Amano", "Masaaki Tsukada", "Mugihito"], "character": ["Azalyn", "Dr. Kitaguchi", "Yuriko Star", "Wang", "Vice Admiral Mifune"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34189   Expand The Irresponsible Captain Tylor   (1993) User Score Overview The Irresponsible Captain Tylor is an anime series based on The Most Irresponsible Man in Space light novel series by Hitoshi Yoshioka. It was produced by some of Japan's larger studios, including Big West, Tatsunoko Production, King Records and VAP. Tylor consists of a 26-episodes TV series created by Kōichi Mashimo, and a sequel OVA series of 10 episodes directed by Mashimo and Naoyuki Yoshinaga. The TV show premiered in Japan on TV Tokyo between January 25, 1993 and July 19, 1993, and was broadcast across Latin America by the television network, Magic Kids. Both series were broadcast across the United States by AZN Television. Tylor is distributed across North America by The Right Stuf International. It is usually classified as humorous space opera. Enterbrain published a 3-volume manga miniseries in 2001. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroko Kasahara Azalyn Jōji Yanami Dr. Kitaguchi Yuri Amano Yuriko Star Masaaki Tsukada Wang Mugihito Vice Admiral Mifune Full Cast & Crew Last Season Season 1 1993 | 26 Episodes Season 1 of The Irresponsible Captain Tylor premiered on January 25, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Irresponsible Captain Tylor. You can help by rating TV shows you've seen. Facts Original Name  無責任艦長タイラー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 15 asura766 15 BrerFox 7 Banana b 5 beachsounddog  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}