{"link": "https://www.themoviedb.org/tv/11019?language=en", "title": "Sport Billy", "resume": "Sport Billy is a 1979 animated television cartoon made by Filmation Associates, initially for broadcast in Germany. In 1982, Filmation carried the show over to the United States for syndication, and as a summer replacement in NBC's Saturday morning children's programming. It was the last first-run series produced by Filmation Associates to air on NBC.", "rate": 83, "genre": ["Animation", "Family"], "cast": ["Joyce Bulifant", "Frank Welker"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11019   Expand Sport Billy   (1979) User Score Overview Sport Billy is a 1979 animated television cartoon made by Filmation Associates, initially for broadcast in Germany. In 1982, Filmation carried the show over to the United States for syndication, and as a summer replacement in NBC's Saturday morning children's programming. It was the last first-run series produced by Filmation Associates to air on NBC. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joyce Bulifant Frank Welker Full Cast & Crew Last Season Season 2 1980 | 12 Episodes Season 2 of Sport Billy premiered on September 14, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sport Billy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Family Keywords sport kids Content Score 56 We're so close, yet so far. Top Contributors 7 Banana 2 Maikkoum b 1 bluwy A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}