{"link": "https://www.themoviedb.org/tv/2022?language=en", "title": "The Batman", "resume": "The Batman is an American animated television series produced by Warner Bros. Animation based on the DC Comics superhero Batman. It ran from September 11, 2004 to March 22, 2008, on the Saturday morning television block Kids' WB.\nAlthough the series borrows many elements from previous Batman storylines, it does not follow the continuity set by the comic books, the film series, nor that of Batman: The Animated Series and its spin-offs. The character designs were provided by Jackie Chan Adventures artist Jeff Matsuda; he also directed the ending. The series won six Daytime Emmy Awards.", "rate": 69, "genre": ["Animation", "Sci-Fi", "Fantasy", "Mystery", "Action", "Adventure"], "cast": ["Rino Romano", "Alastair Duncan", "Ming-Na Wen", "Evan Sabara", "Danielle Judovits"], "character": ["Bruce Wayne", "Alfred Pennyworth", "Dick Grayson / Robin", "Barbara Gordon / Batgirl"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2022   Expand The Batman   (2004) User Score  Play Trailer Overview The Batman is an American animated television series produced by Warner Bros. Animation based on the DC Comics superhero Batman. It ran from September 11, 2004 to March 22, 2008, on the Saturday morning television block Kids' WB. Although the series borrows many elements from previous Batman storylines, it does not follow the continuity set by the comic books, the film series, nor that of Batman: The Animated Series and its spin-offs. The character designs were provided by Jackie Chan Adventures artist Jeff Matsuda; he also directed the ending. The series won six Daytime Emmy Awards. Featured Crew Duane Capizzi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rino Romano Bruce Wayne Alastair Duncan Alfred Pennyworth Ming-Na Wen Evan Sabara Dick Grayson / Robin Danielle Judovits Barbara Gordon / Batgirl Full Cast & Crew Last Season Season 5 2007 | 13 Episodes Season 5 of The Batman premiered on September 22, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  7 Recommendations   2008-11-14 Batman: The Brave and the Bold 7.1    1997-09-20 The New Batman Adventures 7.7    2001-11-17 Justice League 8.2    2000-09-23 Static Shock 7.1    1981-09-12 Spider-Man 6.8    1994-11-19 Spider-Man 7.8    1968-09-14 The Adventures of Batman 7.4    1981-09-12 Spider-Man and His Amazing Friends 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Sci-Fi & Fantasy Mystery Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors R 21 Rebecca 7 niqo19 5 Rafaelasauani 5 batellium  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}