{"link": "https://www.themoviedb.org/tv/67463?language=en", "title": "Love at First Kiss", "resume": "TLC throws out traditional ways of meeting someone and welcomes awkward, sometimes steamy moments that can quickly create emotional and physical sparks. On \"Love at First Kiss,\" an individual goes beyond his or her comfort zone to kiss a total stranger, without introduction, to determine if one kiss can lead to a date in the real world and maybe even a long-term relationship. With unexpected outcomes produced by every smooch, viewers find out how far singles go to find true love", "rate": 32, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67463   Expand Love at First Kiss   (2016) User Score Overview TLC throws out traditional ways of meeting someone and welcomes awkward, sometimes steamy moments that can quickly create emotional and physical sparks. On \"Love at First Kiss,\" an individual goes beyond his or her comfort zone to kiss a total stranger, without introduction, to determine if one kiss can lead to a date in the real world and maybe even a long-term relationship. With unexpected outcomes produced by every smooch, viewers find out how far singles go to find true love Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Love at First Kiss premiered on August  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love at First Kiss. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  42m Homepage   http://tlc.com/tv-shows/love-at-first-kiss Genres Reality Keywords dating show Content Score 64 We're so close, yet so far. Top Contributors 17 Banana a 12 agunk28 o 2 oscar28 1 RonKing  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}