{"link": "https://www.themoviedb.org/tv/21036?language=en", "title": "The New Addams Family", "resume": "The New Addams Family is an American-Canadian sitcom that aired from October 1998 to August 1999 and aired on YTV in Canada and Fox Family in the United States. It was produced by Shavick Entertainment and Saban Entertainment as a new version of the 1960s series The Addams Family.", "rate": 66, "genre": ["Comedy"], "cast": ["Michael Roberds", "Ellie Harvie", "John DeSantis", "Glenn Taranto", "Nicole Fugere"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21036   Expand The New Addams Family   (1998) User Score Overview The New Addams Family is an American-Canadian sitcom that aired from October 1998 to August 1999 and aired on YTV in Canada and Fox Family in the United States. It was produced by Shavick Entertainment and Saban Entertainment as a new version of the 1960s series The Addams Family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Roberds Ellie Harvie John DeSantis Glenn Taranto Nicole Fugere Full Cast & Crew Last Season Season 2 1999 | 13 Episodes Season 2 of The New Addams Family premiered on May 31, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2003-11-01 Tutenstein 6.1    1995-09-16 The Twisted Tales of Felix the Cat 8.5    2000-10-25 As Told by Ginger 5.4    1996-09-28 Psi Factor: Chronicles of the Paranormal 6.3    1997-04-03 Police Academy: The Series 5.6    1997-04-20 The Angry Beavers 6.9    2002-01-25 Mr. Bean: The Animated Series 5.4    1994-03-05 Weird Science 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sitcom addams family Content Score 86 Almost there... Top Contributors w 4 waterhorse 4 Banana s 2 speedycars 1 Mikedeth5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}