{"link": "https://www.themoviedb.org/tv/10632?language=en", "title": "The Librarians", "resume": "The Librarians is an Australian television comedy series which premiered on 31 October 2007 on ABC TV. In Ireland the show airs on RTÉ Two. The series is produced and written by Robyn Butler and Wayne Hope who are also the principal cast members. Hope is also the series' director. The first series comprised six half-hour episodes. The second series with another six episodes began airing on 5 August 2009 and was filmed at the Royal Melbourne Showgrounds.\nThe series centres on the trials and tribulations of Frances O'Brien, a devoutly Catholic and blithely racist head-librarian. Her life unravels when she is forced to employ her ex-best friend, Christine Grimwood – now a drug dealer – as the children's librarian. Frances must do all she can to contain her menacing past and concentrate on the biggest event of the library calendar – Book Week.\nFilming on a third series took place in early 2010 aired on ABC1 that year. The Librarians theme music is an upbeat variation on the popular jazz chart \"A Night in Tunisia\" by Dizzy Gillespie.", "rate": 40, "genre": ["Comedy"], "cast": ["Josh Lawson", "Noni Hazlehurst", "Vince Colosimo", "Bob Franklin", "Kym Gyngell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10632   Expand The Librarians   (2007) User Score  Play Trailer Overview The Librarians is an Australian television comedy series which premiered on 31 October 2007 on ABC TV. In Ireland the show airs on RTÉ Two. The series is produced and written by Robyn Butler and Wayne Hope who are also the principal cast members. Hope is also the series' director. The first series comprised six half-hour episodes. The second series with another six episodes began airing on 5 August 2009 and was filmed at the Royal Melbourne Showgrounds. The series centres on the trials and tribulations of Frances O'Brien, a devoutly Catholic and blithely racist head-librarian. Her life unravels when she is forced to employ her ex-best friend, Christine Grimwood – now a drug dealer – as the children's librarian. Frances must do all she can to contain her menacing past and concentrate on the biggest event of the library calendar – Book Week. Filming on a third series took place in early 2010 aired on ABC1 that year. The Librarians theme music is an upbeat variation on the popular jazz chart \"A Night in Tunisia\" by Dizzy Gillespie. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Lawson Noni Hazlehurst Vince Colosimo Bob Franklin Kym Gyngell Full Cast & Crew Last Season Season 3 2010 | 8 Episodes Season 3 of The Librarians premiered on October 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Librarians. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/librarians Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 4 United600 w 3 webmaster TB 1 TMDb Bot 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}