{"link": "https://www.themoviedb.org/tv/70472?language=en", "title": "Mirage", "resume": "Tragic events in the lives of five people after they have stolen a car with one million dollars in the safe.  This is the job they have all been waiting for. The job that will set them up for life. A million dollars split five ways, who wouldn't be interested? The only catch is that it's the very definition of impossible...or is it? Armed with a brilliant plan, the four men and one woman think they can crack it. But as tensions in the group begin to mount and things start to go wrong, the million dollars feels more out of reach than ever. Even though it is right with them...", "rate": 70, "genre": ["Mystery", "Crime", "Family"], "cast": ["Aivars Silins", "Andris Berzins", "Janis Kluss", "Paul Butkevich", "Mārtiņš Vērdiņš"], "character": ["Michael Birkson", "Thompson", "Bredford", "Delani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70472   Expand Mirage   (1983) User Score Overview Tragic events in the lives of five people after they have stolen a car with one million dollars in the safe.  This is the job they have all been waiting for. The job that will set them up for life. A million dollars split five ways, who wouldn't be interested? The only catch is that it's the very definition of impossible...or is it? Armed with a brilliant plan, the four men and one woman think they can crack it. But as tensions in the group begin to mount and things start to go wrong, the million dollars feels more out of reach than ever. Even though it is right with them... Featured Crew Alvis Lapins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aivars Silins Andris Berzins Michael Birkson Janis Kluss Thompson Paul Butkevich Bredford Mārtiņš Vērdiņš Delani Full Cast & Crew Last Season Season 1 1983 | 3 Episodes Season 1 of Mirage premiered on August 10, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  3 Recommendations   1973-08-11 Seventeen Moments of Spring 7.5    1969-01-01 Nu, pogodi! 6.8  Facts Original Name  Мираж Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Scripted Original Language  Russian Runtime  65m Homepage  - Genres Mystery Crime Family Keywords based on novel or book detective miniseries criminal Content Score 100 Yes! Looking good! Top Contributors 89 zoroman2008N 26 Banana TB 24 TMDb Bot n 5 navarro2018  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}