{"link": "https://www.themoviedb.org/tv/1781?language=en", "title": "Little House on the Prairie", "resume": "Little House on the Prairie is an American Western drama television series, starring Michael Landon, Melissa Gilbert, and Karen Grassle, about a family living on a farm in Walnut Grove, Minnesota, in the 1870s and 1880s.", "rate": 71, "genre": ["Western", "Drama"], "cast": ["Melissa Gilbert", "Michael Landon", "Lindsay Greenbush", "Sidney Greenbush", "Melissa Sue Anderson"], "character": ["Laura Ingalls", "Charles Ingalls", "Carrie Ingalls", "Carrie Ingalls", "Mary Ingalls"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1781   Expand Little House on the Prairie   (1974) User Score  Play Trailer Overview Little House on the Prairie is an American Western drama television series, starring Michael Landon, Melissa Gilbert, and Karen Grassle, about a family living on a farm in Walnut Grove, Minnesota, in the 1870s and 1880s. Featured Crew Ed Friendly Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Melissa Gilbert Laura Ingalls Michael Landon Charles Ingalls Lindsay Greenbush Carrie Ingalls Sidney Greenbush Carrie Ingalls Melissa Sue Anderson Mary Ingalls Full Cast & Crew Last Season Season 10 1983 | 6 Episodes Season 10 of Little House on the Prairie premiered on December 12, 1983. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply n Melissa Gilbert Crying Open 2 by  wonder2wonder M Was Charles Ingalls God? Open 0 by Moonglum9\n      \n     S Sylvia Open 1 by  Moonglum9 Go to Discussions Media Most Popular Videos  2 Backdrops  4 Posters  4 Recommendations   1964-09-17 Bewitched 7.1    1972-09-14 The Waltons 6.6    1965-09-18 I Dream of Jeannie 7.1    1977-09-24 The Love Boat 5.8    1976-09-18 The Muppet Show 7.8    1982-01-07 Fame 6.5    1978-04-02 Dallas 6.1    1976-03-21 Charlie's Angels 5.9  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Western Drama Keywords farm period drama family wild west pioneers 19th century early america Content Score 100 Yes! Looking good! Top Contributors 27 Banana w 20 wonder2wonder 14 SuperMario 12 Baloralys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}