{"link": "https://www.themoviedb.org/tv/13688?language=en", "title": "The Lost Prince", "resume": "The Lost Prince is a British television drama about the life of Prince John, youngest child of Britain's King George V and Queen Mary, who died at the age of 13 in 1919.\nA Talkback Thames production written and directed by Stephen Poliakoff, it was originally broadcast in January 2003. It won an Emmy Award in September 2005.", "rate": 73, "genre": ["Drama"], "cast": ["Gina McKee", "Matthew James Thomas", "Bill Nighy", "Tom Hollander", "Miranda Richardson"], "character": ["Lalla", "Prince John (older) (as Matthew Thomas)", "Stamfordham", "King George V", "Queen Mary"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13688   Expand The Lost Prince   (2003) User Score Overview The Lost Prince is a British television drama about the life of Prince John, youngest child of Britain's King George V and Queen Mary, who died at the age of 13 in 1919. A Talkback Thames production written and directed by Stephen Poliakoff, it was originally broadcast in January 2003. It won an Emmy Award in September 2005. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gina McKee Lalla Matthew James Thomas Prince John (older) (as Matthew Thomas) Bill Nighy Stamfordham Tom Hollander King George V Miranda Richardson Queen Mary Full Cast & Crew Last Season Season 1 2003 | 2 Episodes Season 1 of The Lost Prince premiered on January 19, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Lost Prince. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  180m Homepage  - Genres Drama Keywords epilepsy garden prince gramophone history protector british history governess learning disability epileptic seizure separation from family british royal family Content Score 86 Almost there... Top Contributors 37 genplant29 3 chebs SS 1 Steve Szluck 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}