{"link": "https://www.themoviedb.org/tv/62933?language=en", "title": "I Remember You", "resume": "This drama is a romantic thriller that centers around a criminal profiler, Lee Hyun who previously work as a consultant at the police department in New York. After he returns to south Korea, he’s in charge of a special criminal investigation team. Due to his special insight, he can analyze the crime scene and the suspect at one glance. He works together with an elite detective, Cha Ji An to solve the crimes and they develop a romantic relationship.", "rate": 71, "genre": ["Comedy", "Mystery", "Romance"], "cast": ["Seo In Guk", "Jang Na-ra", "Park Bo-gum", "Lee Chun-hee", "Choi Won-young"], "character": ["Lee Hyun", "Cha Ji-an", "Jung Sun-ho", "Kang Eun-hyuk", "Lee Joon-ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62933   Expand I Remember You   (2015) User Score Overview This drama is a romantic thriller that centers around a criminal profiler, Lee Hyun who previously work as a consultant at the police department in New York. After he returns to south Korea, he’s in charge of a special criminal investigation team. Due to his special insight, he can analyze the crime scene and the suspect at one glance. He works together with an elite detective, Cha Ji An to solve the crimes and they develop a romantic relationship. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  42 Posters  2 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo In Guk Lee Hyun Jang Na-ra Cha Ji-an Park Bo-gum Jung Sun-ho Lee Chun-hee Kang Eun-hyuk Choi Won-young Lee Joon-ho Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of I Remember You premiered on June 22, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  42 Posters  2 Recommendations   2014-09-10 Blade Man 6.4    2016-07-20 W: Two Worlds 7.8  Facts Original Name  너를 기억해 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/hellomonster/ Genres Comedy Mystery Romance Keywords korea Content Score 93 Almost there... Top Contributors 49 Imzadi M 43 Maria180493 6 Elizabeth Jennings t 6 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}