{"link": "https://www.themoviedb.org/tv/13484?language=en", "title": "Kummeli", "resume": "Kummeli is the name of a Finnish comedy crew formed by Heikki Silvennoinen, Timo Kahilainen and Heikki Hela from Tampere. They are also the heads of Porkkana Ryhmä, the crew's production company. Other famous members have included Olli Keskinen, better known for his on-screen persona Eero Kakko, and Heikki Vihinen who replaced Keskinen in the mid-90s.\nKummeli appeared on television between 1991 and 1995. After a successful three-part pilot aired they were given their own show on YLE's channel 2 with a completely new look. The Kummeli TV show was primarily composed of skits with insane characters, but would also feature musical guests as the core crew of the team were actually musicians rather than professional actors. Some episodes would also have a running set of skits that would reach a conclusion at the end of the episode.\nIn the mid-90s, after the end of the show, the Kummeli crew would make random appearances on TV and at different events. During this time Keskinen left the crew and was replaced by Heikki Vihinen.", "rate": 90, "genre": ["Comedy"], "cast": ["Heikki Silvennoinen", "Timo Kahilainen", "Heikki Hela", "Mikko Kivinen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13484   Expand Kummeli   (1991) User Score Overview Kummeli is the name of a Finnish comedy crew formed by Heikki Silvennoinen, Timo Kahilainen and Heikki Hela from Tampere. They are also the heads of Porkkana Ryhmä, the crew's production company. Other famous members have included Olli Keskinen, better known for his on-screen persona Eero Kakko, and Heikki Vihinen who replaced Keskinen in the mid-90s. Kummeli appeared on television between 1991 and 1995. After a successful three-part pilot aired they were given their own show on YLE's channel 2 with a completely new look. The Kummeli TV show was primarily composed of skits with insane characters, but would also feature musical guests as the core crew of the team were actually musicians rather than professional actors. Some episodes would also have a running set of skits that would reach a conclusion at the end of the episode. In the mid-90s, after the end of the show, the Kummeli crew would make random appearances on TV and at different events. During this time Keskinen left the crew and was replaced by Heikki Vihinen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Heikki Silvennoinen Timo Kahilainen Heikki Hela Mikko Kivinen Full Cast & Crew Last Season Season 7 2003 | 6 Episodes Season 7 of Kummeli premiered on November 23, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Kummeli. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2002-10-13 Madventures 7.7    2005-09-19 Surface 6.6    1969-10-05 Monty Python's Flying Circus 8.2    1985-09-29 MacGyver 7.3    1998-10-07 Charmed 6.7    1997-07-12 Oz 8.1    2007-09-24 Chuck 7.7    1987-04-05 Married... with Children 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Finnish Runtime  30m Homepage   http://areena.yle.fi/1-3339547 Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 38 BryGur 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}