{"link": "https://www.themoviedb.org/tv/42444?language=en", "title": "Saint Seiya", "resume": "Ages ago, the goddess Athena was served by fighters called Saints who channeled the power of the Cosmos within them. Now a youth named Seiya has trained to become a Saint himself by earning the mystical Cloth of Pegasus. He is joined by other Saints with Cloths of their own to fight for Athena.", "rate": 77, "genre": ["Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42444   Expand Saint Seiya   (1986) User Score Overview Ages ago, the goddess Athena was served by fighters called Saints who channeled the power of the Cosmos within them. Now a youth named Seiya has trained to become a Saint himself by earning the mystical Cloth of Pegasus. He is joined by other Saints with Cloths of their own to fight for Athena. Featured Crew Masami Kurumada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  20 Posters  24 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 - Soul of Gold 2015 | 13 Episodes Season 9 of Saint Seiya premiered on April 11, 2015. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for Saint Seiya. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  20 Posters  24 Recommendations   2002-11-09 Saint Seiya: The Hades Chapter 8.4    2009-06-24 Saint Seiya The Lost Canvas - The Myth of Hades 9.3    1995-04-10 Street Fighter II: V 7.0    2012-01-10 Waiting in the Summer 6.7    2001-01-13 Disney's House of Mouse 7.6    1996-09-16 Beast Wars: Transformers 7.7    2014-10-10 Your Lie in April 8.2    2007-04-01 Gurren Lagann 7.9  Facts Original Name  聖闘士星矢 Status  Ended Network Certification 14 Meaning Content suitable for viewers over the age of 14. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://saintseiya-gold.com/ Genres Animation Drama Keywords japanese knight zodiac 1980s anime Content Score 64 We're so close, yet so far. Top Contributors 15 P-Gaz m 13 martinogo 13 Rafaelasauani 12 anderbytes  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}