{"link": "https://www.themoviedb.org/tv/32926?language=en", "title": "Countrywise", "resume": "Countrywise is a British television series on ITV, in which broadcaster Paul Heiney and the team of reporters look at the best of Britain's coast and country, with contributions from the ITV regions. Quite often, the classical historian Bettany Hughes appears on the programme, when she is introduced as the \"Countrywise Historian\". The programme began a new series in December 2010 - Countrywise Kitchen, about foraging for food and food connected with different parts of the country. For example, the edition broadcast on 10 December 2010 mentioned gathering mushrooms, and mentioned the cep mushroom. Celebrities who have appeared on the programme include Rachel de Thame, who appeared on the programme on 5 July 2011. The most recent series of the programme began broadcast on 25 June 2012, when it came from the Isle of Man and mentioned the Manx cat. A more recent edition of the programme has come from Ireland.This edition of the programme mentioned how the newest member of the Countrywise team has been the programme's scientist, Charlotte Uhlenbroek, who discussed Finn MacCool when the programme was in Ireland.\nIn late July 2012, the programme was broadcast in Pembrokeshire, Wales, where it visited the smallest city in the United Kingdom, that of St. David's.", "rate": 30, "genre": ["Documentary"], "cast": ["Rachel De Thame"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32926   Expand Countrywise   (2009) User Score Overview Countrywise is a British television series on ITV, in which broadcaster Paul Heiney and the team of reporters look at the best of Britain's coast and country, with contributions from the ITV regions. Quite often, the classical historian Bettany Hughes appears on the programme, when she is introduced as the \"Countrywise Historian\". The programme began a new series in December 2010 - Countrywise Kitchen, about foraging for food and food connected with different parts of the country. For example, the edition broadcast on 10 December 2010 mentioned gathering mushrooms, and mentioned the cep mushroom. Celebrities who have appeared on the programme include Rachel de Thame, who appeared on the programme on 5 July 2011. The most recent series of the programme began broadcast on 25 June 2012, when it came from the Isle of Man and mentioned the Manx cat. A more recent edition of the programme has come from Ireland.This edition of the programme mentioned how the newest member of the Countrywise team has been the programme's scientist, Charlotte Uhlenbroek, who discussed Finn MacCool when the programme was in Ireland. In late July 2012, the programme was broadcast in Pembrokeshire, Wales, where it visited the smallest city in the United Kingdom, that of St. David's. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachel De Thame Full Cast & Crew Last Season Season 2 2010 | 28 Episodes Season 2 of Countrywise premiered on March 29, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Countrywise. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}