{"link": "https://www.themoviedb.org/tv/46639?language=en", "title": "American Gods", "resume": "Based on Neil Gaiman's fantasy novel about an ex-con who becomes the traveling partner of a conman who turns out to be one of the older gods trying to recruit troops to battle the upstart deities.", "rate": 70, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Ricky Whittle", "Ian McShane", "Emily Browning", "Pablo Schreiber", "Bruce Langley"], "character": ["Shadow Moon", "Mr. Wednesday", "Laura Moon", "Mad Sweeney", "Technical Boy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46639   Expand American Gods   (2017) User Score  Play Trailer Overview Based on Neil Gaiman's fantasy novel about an ex-con who becomes the traveling partner of a conman who turns out to be one of the older gods trying to recruit troops to battle the upstart deities. Featured Crew Neil Gaiman Creator Michael Green Creator Bryan Fuller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  19 Content Issues  1 Images Backdrops  20 Posters  18 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ricky Whittle Shadow Moon Ian McShane Mr. Wednesday Emily Browning Laura Moon Pablo Schreiber Mad Sweeney Bruce Langley Technical Boy Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of American Gods premiered on April 30, 2017. View All Seasons Social Reviews  0 Discussions  20 Subject Status Replies Last Reply a GoT has got nothing on that sex scene Open 8 by  NorthernLad Mr. World, Head of the New Gods.. Open 5 by  P. Just watched the first episode... Open 0 by JustinJackFlash\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  20 Posters  18 Recommendations   2016-05-22 Preacher 7.4    2017-02-08 Legion 7.6    2017-08-18 Marvel's The Defenders 7.1    2016-09-30 Marvel's Luke Cage 6.9    2017-01-07 Taboo 8.0    2017-11-17 Marvel's The Punisher 8.0    2016-12-16 The OA 7.3    2017-03-17 Marvel's Iron Fist 6.1  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   https://www.starz.com/series/americangods Genres Drama Mystery Sci-Fi & Fantasy Keywords based on novel or book mythology con man goddess death ex-con gods Content Score 100 Yes! Looking good! Top Contributors 79 Elizabeth Jennings 35 Mustafa t 20 tmdb42368388 a 19 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}