{"link": "https://www.themoviedb.org/tv/1121?language=en", "title": "Sasuke", "resume": "Sasuke is a Japanese sports entertainment television special in which 100 competitors attempt to complete a four stage obstacle course. An edited version, renamed Ninja Warrior, is screened in at least 18 other countries. To date, Sasuke content has been shown in 157 countries.\nShot on location at Midoriyama studio in Yokohama, it airs on the Tokyo Broadcasting System between Japanese television drama seasons. Each 3-hour special covers an entire competition; there are normally 100 participants. There have been 29 specials, approximately one new special per season. The show is produced by Monster9 and is one of the spin-offs of Muscle Ranking, another sports entertainment competition, which currently airs on G4 under the name Unbeatable Banzuke. Until the 10th competition, Sasuke was broadcast as a special part of Muscle Ranking, but it became an independent program when Muscle Ranking was discontinued. The first competition was held indoors, marking the only time Sasuke did not take place outside. Competitions generally start in the daytime and continue until completed regardless of weather or darkness. After Monster9's bankruptcy on November 2011, all rights to the show fell completely into the hands of its broadcaster, Tokyo Broadcasting System. Following their acquisition of all rights to Sasuke, TBS renamed the show, Sasuke Rising.", "rate": 95, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1121   Expand Sasuke   (1997) User Score Overview Sasuke is a Japanese sports entertainment television special in which 100 competitors attempt to complete a four stage obstacle course. An edited version, renamed Ninja Warrior, is screened in at least 18 other countries. To date, Sasuke content has been shown in 157 countries. Shot on location at Midoriyama studio in Yokohama, it airs on the Tokyo Broadcasting System between Japanese television drama seasons. Each 3-hour special covers an entire competition; there are normally 100 participants. There have been 29 specials, approximately one new special per season. The show is produced by Monster9 and is one of the spin-offs of Muscle Ranking, another sports entertainment competition, which currently airs on G4 under the name Unbeatable Banzuke. Until the 10th competition, Sasuke was broadcast as a special part of Muscle Ranking, but it became an independent program when Muscle Ranking was discontinued. The first competition was held indoors, marking the only time Sasuke did not take place outside. Competitions generally start in the daytime and continue until completed regardless of weather or darkness. After Monster9's bankruptcy on November 2011, all rights to the show fell completely into the hands of its broadcaster, Tokyo Broadcasting System. Following their acquisition of all rights to Sasuke, TBS renamed the show, Sasuke Rising. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season season 29 2013 | 1 Episode Season 29 of Sasuke premiered on June 27, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sasuke. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors b 6 blb s 3 speedycars TB 1 TMDb Bot 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}