{"link": "https://www.themoviedb.org/tv/15540?language=en", "title": "Please Don't Eat the Daisies", "resume": "Please Don't Eat the Daisies is an American sitcom that aired on NBC from September 14, 1965 to April 22, 1967. The series was based upon the 1957 book by Jean Kerr and 1960 film starring Doris Day and David Niven.\nThe series ran for 58 half-hour episodes and stars Patricia Crowley and Mark Miller. The show also features Dub Taylor, Clint Howard, and Bonnie Franklin for multiple appearances; Ellen Corby had a recurring role as Martha the housekeeper. Robert Vaughn and David McCallum appeared in the \"Say UNCLE\" episode as Napoleon Solo and Illya Kuryakin, and Stefanie Powers appeared as April Dancer in the \"Remember Lake Serene\" episode, connecting this series to The Man from U.N.C.L.E. and The Girl from U.N.C.L.E..\nIn its first season, the show did fairly well in the ratings. It was scheduled on Tuesday nights opposite the second half of two veteran shows on prime time television, Rawhide on CBS and Combat! on ABC. For its second year, Please Don't Eat The Daisies was moved to Saturday nights where it faced brutal competition against the second half of The Jackie Gleason Show. The ratings fell and NBC canceled the series in the spring of 1967.", "rate": 70, "genre": ["Comedy"], "cast": ["Pat Crowley", "Mark Miller", "Dub Taylor", "Ellen Corby", "Jean Vander Pyl"], "character": ["Joan Nash", "Jim Nash", "Ed Hewley", "Martha", "Ethel Carter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15540   Expand Please Don't Eat the Daisies   (1965) User Score Overview Please Don't Eat the Daisies is an American sitcom that aired on NBC from September 14, 1965 to April 22, 1967. The series was based upon the 1957 book by Jean Kerr and 1960 film starring Doris Day and David Niven. The series ran for 58 half-hour episodes and stars Patricia Crowley and Mark Miller. The show also features Dub Taylor, Clint Howard, and Bonnie Franklin for multiple appearances; Ellen Corby had a recurring role as Martha the housekeeper. Robert Vaughn and David McCallum appeared in the \"Say UNCLE\" episode as Napoleon Solo and Illya Kuryakin, and Stefanie Powers appeared as April Dancer in the \"Remember Lake Serene\" episode, connecting this series to The Man from U.N.C.L.E. and The Girl from U.N.C.L.E.. In its first season, the show did fairly well in the ratings. It was scheduled on Tuesday nights opposite the second half of two veteran shows on prime time television, Rawhide on CBS and Combat! on ABC. For its second year, Please Don't Eat The Daisies was moved to Saturday nights where it faced brutal competition against the second half of The Jackie Gleason Show. The ratings fell and NBC canceled the series in the spring of 1967. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pat Crowley Joan Nash Mark Miller Jim Nash Dub Taylor Ed Hewley Ellen Corby Martha Jean Vander Pyl Ethel Carter Full Cast & Crew Last Season Season 2 1966 | 28 Episodes Season 2 of Please Don't Eat the Daisies premiered on September 17, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1968-09-24 The Mod Squad 6.3    1966-09-12 Family Affair 5.4    1965-01-24 Branded 8.3    1974-09-07 Land of the Lost 6.9    1964-09-24 Daniel Boone 5.9    1967-09-07 The Flying Nun 5.0    1957-09-14 Have Gun – Will Travel 8.3    1963-09-24 Petticoat Junction 5.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Comedy Keywords new york suburb family sitcom Content Score 86 Almost there... Top Contributors 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}