{"link": "https://www.themoviedb.org/tv/16491?language=en", "title": "The Incredible Journey of Mary Bryant", "resume": "The Incredible Journey of Mary Bryant is a 2005 film loosely based on the life of Mary Bryant, a Cornish girl convicted of petty theft who was transported to the Australian Penal Colony on the First Fleet with other prisoners bound for Botany Bay. It is written by Peter Berry and directed by Peter Andrikidis. The film had a budget in excess of A$15 million, making it the largest-budget television mini-series produced in Australia.", "rate": 69, "genre": ["Drama"], "cast": ["Jack Davenport", "Romola Garai", "Alex O'Loughlin", "Sam Neill", "Garry McDonald"], "character": ["Lieutenant Ralph Clarke", "Mary Bryant", "William 'Will' Bryant", "Governor Arthur Phillip", "Reverend Johnson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16491   Expand The Incredible Journey of Mary Bryant   (2005) User Score Overview The Incredible Journey of Mary Bryant is a 2005 film loosely based on the life of Mary Bryant, a Cornish girl convicted of petty theft who was transported to the Australian Penal Colony on the First Fleet with other prisoners bound for Botany Bay. It is written by Peter Berry and directed by Peter Andrikidis. The film had a budget in excess of A$15 million, making it the largest-budget television mini-series produced in Australia. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  10 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Davenport Lieutenant Ralph Clarke Romola Garai Mary Bryant Alex O'Loughlin William 'Will' Bryant Sam Neill Governor Arthur Phillip Garry McDonald Reverend Johnson Full Cast & Crew Last Season Season 1 2005 | 2 Episodes Season 1 of The Incredible Journey of Mary Bryant premiered on October 30, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  10 Recommendations   2007-04-22 Kingdom 7.0    2005-03-27 Colditz 6.3    1993-01-31 Homicide: Life on the Street 7.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Drama Keywords australia miniseries girl heroine female prisoner convict 18th century penal colony Content Score 93 Almost there... Top Contributors TB 69 TMDb Bot 27 Banana w 3 webmaster R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}