{"link": "https://www.themoviedb.org/tv/64072?language=en", "title": "Undeniable", "resume": "Nearly a quarter of a century after she witnessed the murder of her mother, Jane Fielding is married and has a daughter of her own, but the traumatic events of that day still haunt her. She constantly aware that the murderer is still at large. While on a routine visit to hospital, she locks eyes with the man believes killed her mother.", "rate": 56, "genre": ["Drama", "Mystery"], "cast": ["Claire Goose", "Peter Firth", "Christine Bottomley", "Robert Pugh", "Pippa Haywood"], "character": ["Jane Phillips", "Andrew Rawlins", "Emma Rawlins", "Pete", "DI Alison Hall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64072   Expand Undeniable   (2014) User Score Overview Nearly a quarter of a century after she witnessed the murder of her mother, Jane Fielding is married and has a daughter of her own, but the traumatic events of that day still haunt her. She constantly aware that the murderer is still at large. While on a routine visit to hospital, she locks eyes with the man believes killed her mother. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Claire Goose Jane Phillips Peter Firth Andrew Rawlins Christine Bottomley Emma Rawlins Robert Pugh Pete Pippa Haywood DI Alison Hall Full Cast & Crew Last Season Season 1 2014 | 2 Episodes Season 1 of Undeniable premiered on April  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2009-01-12 Unforgiven 7.4    2015-10-28 Cuffs 6.6    2015-05-05 No Offence 7.8    2015-10-08 Unforgotten 7.7    2014-02-05 Inside No. 9 8.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Mystery Keywords murder miniseries witness to murder Content Score 86 Almost there... Top Contributors 30 Banana t 16 tmdb48730457 TB 9 TMDb Bot G 2 GraemePage  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}