{"link": "https://www.themoviedb.org/tv/49482?language=en", "title": "Love and Punishment", "resume": "Aşk ve Ceza is a Turkish television drama series that aired in 2010-2011. Nunu Yeşilçay, Murat Yildirim and Feride Çetin starring, the series were shot in Van, Bodrum and Istanbul. In 2011, this series were broadcast also in Croatia in Nova TV. In Serbia, this series is airing from January 8, 2013 in 1PRVA. In Georgia TV Maestro started broadcasting this series on 15 April 2013.", "rate": 55, "genre": ["Drama"], "cast": ["Tomris İncer", "Oktay Gürsoy", "Nurgül Yeşilçay", "Murat Yildirim", "Feride Çetin"], "character": ["Şahnur Baldar", "Cem", "Yasemin Baldar Ustun", "Savaş Baldar", "Çiçek Baldar Moran"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49482   Expand Love and Punishment   (2010) User Score Overview Aşk ve Ceza is a Turkish television drama series that aired in 2010-2011. Nunu Yeşilçay, Murat Yildirim and Feride Çetin starring, the series were shot in Van, Bodrum and Istanbul. In 2011, this series were broadcast also in Croatia in Nova TV. In Serbia, this series is airing from January 8, 2013 in 1PRVA. In Georgia TV Maestro started broadcasting this series on 15 April 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomris İncer Şahnur Baldar Oktay Gürsoy Cem Nurgül Yeşilçay Yasemin Baldar Ustun Murat Yildirim Savaş Baldar Feride Çetin Çiçek Baldar Moran Full Cast & Crew Last Season 1. 2010 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2009-09-28 Ezel 8.2    2008-09-04 Forbidden Love 5.5    2010-08-02 Teresa 7.7  Facts Original Name  Aşk ve Ceza Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  90m Homepage  - Genres Drama Keywords love Content Score 86 Almost there... Top Contributors V 21 Vaine 5 Elizabeth Jennings 4 Maikkoum CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}