{"link": "https://www.themoviedb.org/tv/56843?language=en", "title": "Inside the American Mob", "resume": "Delve into the secret underworld of the American Mafia, as told by the criminals who lived it and the law enforcers who hunted it. This dramatic six-part series chronicles the true-life story of the modern Mob in America, as former mobsters, informants, and FBI agents expose the takedown of the deadliest and most infamous organized crime ring in U.S. history. A combination of recently declassified files, first-person accounts by federal officials and the mafioso themselves, and rare archival footage sheds a new light on the raw, violent, and corrupt underworld that gripped America for decades.", "rate": 82, "genre": ["Action", "Adventure"], "cast": ["Glenn Alba", "Ralph Bracco", "Kenneth Carrella", "Thomas Logan Crown", "Michael Messina"], "character": ["Mob Underboxx", "Sonny Franzese", "John", "Bartender", "Michael Franzese"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56843   Expand Inside the American Mob   (2013) User Score  Play Trailer Overview Delve into the secret underworld of the American Mafia, as told by the criminals who lived it and the law enforcers who hunted it. This dramatic six-part series chronicles the true-life story of the modern Mob in America, as former mobsters, informants, and FBI agents expose the takedown of the deadliest and most infamous organized crime ring in U.S. history. A combination of recently declassified files, first-person accounts by federal officials and the mafioso themselves, and rare archival footage sheds a new light on the raw, violent, and corrupt underworld that gripped America for decades. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Glenn Alba Mob Underboxx Ralph Bracco Sonny Franzese Kenneth Carrella John Thomas Logan Crown Bartender Michael Messina Michael Franzese Full Cast & Crew Last Season Season 1 2013 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2012-05-11 Barbie: Life in the Dreamhouse 7.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords mobster lieutenant columbo mob boss american mafia Content Score 93 Almost there... Top Contributors c 32 cdizzel99 5 lineker 4 Banana 4 aiman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}