{"link": "https://www.themoviedb.org/tv/34344?language=en", "title": "A Perfect Spy", "resume": "A Perfect Spy is a BBC serial adaptation of John le Carré's spy novel A Perfect Spy. It follows the career of the British MI6 spy Magnus Pym from his early days as a schoolboy to his eventual disappearance as a suspected agent of the Czech secret service.", "rate": 55, "genre": ["Drama"], "cast": ["Peter Egan", "Ray McAnally", "Alan Howard", "Peggy Ashcroft"], "character": ["Magnus Pym", "Rick Pym", "Jack Brotherhood", "Miss Dubber"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34344   Expand A Perfect Spy   (1987) User Score Overview A Perfect Spy is a BBC serial adaptation of John le Carré's spy novel A Perfect Spy. It follows the career of the British MI6 spy Magnus Pym from his early days as a schoolboy to his eventual disappearance as a suspected agent of the Czech secret service. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Egan Magnus Pym Ray McAnally Rick Pym Alan Howard Jack Brotherhood Peggy Ashcroft Miss Dubber Full Cast & Crew Last Season Season 1 1987 | 7 Episodes Season 1 of A Perfect Spy premiered on November  4, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1982-09-20 Smiley's People 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  53m Homepage   http://www.bbc.co.uk/programmes/b008dqld Genres Drama Keywords based on novel or book miniseries british spy Content Score 86 Almost there... Top Contributors TB 11 TMDb Bot R 10 Rebecca i 4 ismax935 t 4 tmdb59661364  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}