{"link": "https://www.themoviedb.org/tv/16505?language=en", "title": "Bullyparade", "resume": "Bullyparade is the title of a German late night comedy sketch show which aired from 1997 to 2002 on German channel ProSieben. Michael Herbig, Rick Kavanian and Christian Tramitz were the main cast of the show.\nThe show featured both taped and live performed sketches, nearly every sketch was part of a series of sketches featuring special characters and settings. The show had a high rate of running gags, too. In Germany, Bullyparade gained strong cult followings even long time after it had been canceled, its status can be compared to Monty Python's Flying Circus in the UK. One thing it had in common with the Flying Circus is the frequent use of drag by the main cast.\nThe movie Manitou's Shoe, a parody on western movies and one of the most successful German films ever made, was based on the characters in this show.\nIn 2004, Michael Herbig produced a second film, Raumschiff Surprise - Periode 1, which was also based on sketches parodying sci-fi shows like Star Trek, and it was very successful as well. A third movie based on characters and sketches from the Bullyparade was released in 2007. Lissi und der wilde Kaiser is an animated film.", "rate": 55, "genre": ["Comedy"], "cast": ["Christian Tramitz", "Rick Kavanian", "Michael Herbig"], "character": ["Bully"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16505   Expand Bullyparade User Score Overview Bullyparade is the title of a German late night comedy sketch show which aired from 1997 to 2002 on German channel ProSieben. Michael Herbig, Rick Kavanian and Christian Tramitz were the main cast of the show. The show featured both taped and live performed sketches, nearly every sketch was part of a series of sketches featuring special characters and settings. The show had a high rate of running gags, too. In Germany, Bullyparade gained strong cult followings even long time after it had been canceled, its status can be compared to Monty Python's Flying Circus in the UK. One thing it had in common with the Flying Circus is the frequent use of drag by the main cast. The movie Manitou's Shoe, a parody on western movies and one of the most successful German films ever made, was based on the characters in this show. In 2004, Michael Herbig produced a second film, Raumschiff Surprise - Periode 1, which was also based on sketches parodying sci-fi shows like Star Trek, and it was very successful as well. A third movie based on characters and sketches from the Bullyparade was released in 2007. Lissi und der wilde Kaiser is an animated film. Featured Crew Michael Herbig Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Tramitz Rick Kavanian Michael Herbig Bully Full Cast & Crew Last Season Season 6 2002 | 15 Episodes Season 6 of Bullyparade premiered on March  6, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  22m Homepage   http://www.bullypara.de/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors f 21 fita24 w 3 werner_ww 2 Elizabeth Jennings 1 Hasenläufer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}