{"link": "https://www.themoviedb.org/tv/76518?language=en", "title": "La Femme Musketeer", "resume": "When the bride-to-be of King Louis XIV is kidnapped, the sons of the original three musketeers rally to rescue her. Much to their surprise, a fourth musketeer joins the fray. And this brilliant swordsman—the most gifted of the lot—turns out to be D'Artagnan's daughter.", "rate": 47, "genre": ["Action", "Adventure"], "cast": ["Gérard Depardieu", "Michael York", "Nastassja Kinski", "Susie Amy", "John Rhys-Davies"], "character": ["Cardinal Mazarin", "D'Artagnan", "Lady Bolton", "Valentine D'Artagnan", "Porthos"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76518   Expand La Femme Musketeer   (2004) User Score  Play Trailer Overview When the bride-to-be of King Louis XIV is kidnapped, the sons of the original three musketeers rally to rescue her. Much to their surprise, a fourth musketeer joins the fray. And this brilliant swordsman—the most gifted of the lot—turns out to be D'Artagnan's daughter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gérard Depardieu Cardinal Mazarin Michael York D'Artagnan Nastassja Kinski Lady Bolton Susie Amy Valentine D'Artagnan John Rhys-Davies Porthos Full Cast & Crew Last Season Miniseries 2004 | 2 Episodes Season 1 of La Femme Musketeer premiered on June 20, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2013-01-04 Zen 7.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage   https://sonarent.com/titles/la-femme-musketeer Genres Action & Adventure Keywords france horse forest swordsman miniseries musketeer 17th century Content Score 93 Almost there... Top Contributors TB 86 TMDb Bot 21 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}