{"link": "https://www.themoviedb.org/tv/59268?language=en", "title": "The Haunted Hathaways", "resume": "\"The Haunted Hathaways\" follows the adventures of a not-so-typical blended family. When Michelle Hathaway relocates to New Orleans, LA., to open a bakery with her daughters Taylor and Frankie, they quickly learn that life in the “Big Easy” is very different. Unbeknownst to them, their new home is already occupied by a ghost family comprised of jazz musician father Ray Preston and his sons Miles and Louie. After agreeing to live under one roof, they come to care about and rely on one another while driving each other crazy – just like any normal family would. Though leery at first, the Hathaways soon discover how much fun life can be when living with ghosts.", "rate": 27, "genre": ["Comedy", "Family"], "cast": ["Amber Montana", "Curtis Harris", "Benjamin Flores Jr.", "Breanna Yde", "Ginifer King"], "character": ["Taylor Hathaway", "Miles Preston", "Louie Preston", "Frankie Hathaway", "Michelle Hathaway"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59268   Expand The Haunted Hathaways   (2013) User Score Overview \"The Haunted Hathaways\" follows the adventures of a not-so-typical blended family. When Michelle Hathaway relocates to New Orleans, LA., to open a bakery with her daughters Taylor and Frankie, they quickly learn that life in the “Big Easy” is very different. Unbeknownst to them, their new home is already occupied by a ghost family comprised of jazz musician father Ray Preston and his sons Miles and Louie. After agreeing to live under one roof, they come to care about and rely on one another while driving each other crazy – just like any normal family would. Though leery at first, the Hathaways soon discover how much fun life can be when living with ghosts. Featured Crew Robert Peacock Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amber Montana Taylor Hathaway Curtis Harris Miles Preston Benjamin Flores Jr. Louie Preston Breanna Yde Frankie Hathaway Ginifer King Michelle Hathaway Full Cast & Crew Last Season Season 2 2014 | 13 Episodes Season 2 of The Haunted Hathaways premiered on June 28, 2014. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Michelle: Happy Birthday Ginifer King! Open 0 by wonder2wonder\n      \n     w Miles: Happy Birthday Curtis Harris! Open 0 by wonder2wonder\n      \n     w Frankie: Happy Birthday Breanna Yde! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2014-05-30 100 Things to Do Before High School 4.0    2014-01-04 Space Dandy 7.5    2015-06-16 Clipped 4.1    2011-07-29 ThunderCats 6.4    2013-06-08 Sam & Cat 5.7  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nick.com/shows/haunted-hathaways/ Genres Comedy Family Keywords new orleans haunted house family ghost sitcom black sitcom Content Score 93 Almost there... Top Contributors 22 Elizabeth Jennings 19 Banana A 6 Atlo v 6 vt70000  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}