{"link": "https://www.themoviedb.org/tv/38181?language=en", "title": "Our America with Lisa Ling", "resume": "Our America with Lisa Ling takes viewers along for an in-depth look at some of the most controversial and thought-provoking issues in the United States today, including religious movements, sex offenders, drug addiction and online brides. In each episode, Lisa immerses herself into the lives of the people she meets, offering compelling accounts of varied experiences and providing insight into some of our nation's most contentious issues. In sharing these stories, Lisa challenges viewers to understand different perspectives and even question what they themselves have always known to be true.", "rate": 80, "genre": ["News", "Documentary"], "cast": ["Lisa Ling"], "character": ["Herself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38181   Expand Our America with Lisa Ling   (2011) User Score Overview Our America with Lisa Ling takes viewers along for an in-depth look at some of the most controversial and thought-provoking issues in the United States today, including religious movements, sex offenders, drug addiction and online brides. In each episode, Lisa immerses herself into the lives of the people she meets, offering compelling accounts of varied experiences and providing insight into some of our nation's most contentious issues. In sharing these stories, Lisa challenges viewers to understand different perspectives and even question what they themselves have always known to be true. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Ling Herself - Host Full Cast & Crew Last Season Season 5 2014 | 10 Episodes Season 5 of Our America with Lisa Ling premiered on May 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Our America with Lisa Ling. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.oprah.com/own/Our-America-with-Lisa-Ling Genres News Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 18 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}