{"link": "https://www.themoviedb.org/tv/14814?language=en", "title": "Keeping Up with the Kardashians", "resume": "A peek inside the exploits and privileged private lives of the blended Kardashian-Jenner family, including sisters Kim, Kourtney and Khloé.", "rate": 36, "genre": ["Reality"], "cast": ["Kim Kardashian", "Khloé Kardashian", "Kourtney Kardashian", "Kris Jenner", "Kylie Jenner"], "character": ["Kim Kardashian", "Khloé Kardashian", "Kourtney Kardashian", "Kris Jenner", "Kylie Jenner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14814   Expand Keeping Up with the Kardashians   (2007) User Score  Play Trailer Overview A peek inside the exploits and privileged private lives of the blended Kardashian-Jenner family, including sisters Kim, Kourtney and Khloé. Featured Crew Ryan Seacrest Creator Eliot Goldberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  10 Posters  4 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Kardashian Kim Kardashian Khloé Kardashian Khloé Kardashian Kourtney Kardashian Kourtney Kardashian Kris Jenner Kris Jenner Kylie Jenner Kylie Jenner Full Cast & Crew Last Season Season 14 2017 | 19 Episodes Season 14 of Keeping Up with the Kardashians premiered on October  1, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Keeping Up with the Kardashians. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  10 Posters  4 Recommendations   2012-08-08 Here Comes Honey Boo Boo 1.9    2012-03-21 Duck Dynasty 4.1    2002-06-11 American Idol 4.4    2005-01-03 The Late Late Show with Craig Ferguson 7.5    2005-04-12 Deadliest Catch 6.6    1979-09-22 Spider-Woman 6.7    1998-01-20 Dawson's Creek 6.0    2004-07-01 The Soup 4.9  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  45m Homepage   http://www.eonline.com/shows/kardashians Genres Reality Keywords sibling relationship los angeles fashion family Content Score 100 Yes! Looking good! Top Contributors 34 d00ziie 23 jameswhickmott 17 Kampfader 17 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}