{"link": "https://www.themoviedb.org/tv/48557?language=en", "title": "Guyana Tragedy: The Story of Jim Jones", "resume": "The story of the Peoples Temple led by Jim Jones and 1978 mass suicide at Jonestown.", "rate": 68, "genre": ["Drama"], "cast": ["Powers Boothe", "Ned Beatty", "Irene Cara", "Veronica Cartwright", "Brad Dourif"], "character": ["Jim Jones", "Leo Ryan", "Alice Jefferson", "Marceline 'Marcy' Jones", "David Langtree"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48557   Expand Guyana Tragedy: The Story of Jim Jones   (1980) User Score Overview The story of the Peoples Temple led by Jim Jones and 1978 mass suicide at Jonestown. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Powers Boothe Jim Jones Ned Beatty Leo Ryan Irene Cara Alice Jefferson Veronica Cartwright Marceline 'Marcy' Jones Brad Dourif David Langtree Full Cast & Crew Last Season Miniseries 1980 | 2 Episodes Season 1 of Guyana Tragedy: The Story of Jim Jones premiered on April 15, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Guyana Tragedy: The Story of Jim Jones. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  96m Homepage  - Genres Drama Keywords suicide poison commune cult miniseries guyana Content Score 86 Almost there... Top Contributors TB 40 TMDb Bot 10 Banana 5 Renato 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}