{"link": "https://www.themoviedb.org/tv/1041?language=en", "title": "Noir", "resume": "Noir is a 26-episode Japanese anime television series produced in 2001 by the Bee Train animation studio. Kōichi Mashimo directed Noir; it was written by Ryoe Tsukimura, and the soundtrack was composed by Yuki Kajiura. The DVD version was released by ADV Films in North America and the United Kingdom and by Madman Entertainment in Australia and New Zealand.\nThe series follows the story of two young female assassins who embark together on a personal journey to seek answers about mysteries from their past. While they seem to be only vaguely related to each other at first, there are clues and hints given throughout the series that there are more than meets their eyes. During the course of the series, they are lured into more and more traps by a secret organization named Les Soldats.\nNoir was followed by two spiritual successors, Madlax and El Cazador de la Bruja. Together, these series constitute a trilogy exploring the \"girls-with-guns\" genre.", "rate": 73, "genre": ["Drama", "Animation", "Action", "Adventure"], "cast": ["Houko Kuwashima", "Kotono Mitsuishi", "Aya Hisakawa", "Tarako"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1041   Expand Noir   (2001) User Score Overview Noir is a 26-episode Japanese anime television series produced in 2001 by the Bee Train animation studio. Kōichi Mashimo directed Noir; it was written by Ryoe Tsukimura, and the soundtrack was composed by Yuki Kajiura. The DVD version was released by ADV Films in North America and the United Kingdom and by Madman Entertainment in Australia and New Zealand. The series follows the story of two young female assassins who embark together on a personal journey to seek answers about mysteries from their past. While they seem to be only vaguely related to each other at first, there are clues and hints given throughout the series that there are more than meets their eyes. During the course of the series, they are lured into more and more traps by a secret organization named Les Soldats. Noir was followed by two spiritual successors, Madlax and El Cazador de la Bruja. Together, these series constitute a trilogy exploring the \"girls-with-guns\" genre. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Houko Kuwashima Kotono Mitsuishi Aya Hisakawa Tarako Full Cast & Crew Last Season (jp) season 1 2001 | 26 Episodes Season 1 of Noir premiered on April  6, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Noir. You can help by rating TV shows you've seen. Facts Original Name  ノワール Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.jvcmusic.co.jp/m-serve/tv/noir/ Genres Drama Animation Action & Adventure Keywords assassin amnesia gun fu emotional vulnerability corsica neo-noir very little dialogue Content Score 86 Almost there... Top Contributors d 23 disturbD W 8 Webfighter D 5 DidgEsilran m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}