{"link": "https://www.themoviedb.org/tv/53727?language=en", "title": "May Queen", "resume": "May Queen is a 2012 South Korean television melodrama series about three people who experience ambition, revenge, betrayal and love, against the backdrop of the shipbuilding industry in Ulsan during Korea's modernization. It stars Han Ji-hye, Kim Jae-won and Jae Hee.", "rate": 0, "genre": ["Drama"], "cast": ["Kim Ji-yeong", "Han Ji-hye", "Seo Young-Joo", "Geum Bo-ra", "Kang Ji-Woo"], "character": ["Lee Bong-hee", "Chun Hae-joo", "young Jang Il-moon", "Jo Dal-soon", "Cheon Young-Joo (young)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53727   Expand May Queen   (2012) User Score Overview May Queen is a 2012 South Korean television melodrama series about three people who experience ambition, revenge, betrayal and love, against the backdrop of the shipbuilding industry in Ulsan during Korea's modernization. It stars Han Ji-hye, Kim Jae-won and Jae Hee. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Ji-yeong Lee Bong-hee Han Ji-hye Chun Hae-joo Seo Young-Joo young Jang Il-moon Geum Bo-ra Jo Dal-soon Kang Ji-Woo Cheon Young-Joo (young) Full Cast & Crew Last Season Season 1 2012 | 38 Episodes Season 1 of May Queen premiered on August  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on May Queen. You can help by rating TV shows you've seen. Facts Original Name  메이퀸 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 8 zurman1 t 6 tmdb38202327 A 5 Aka75 4 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}