{"link": "https://www.themoviedb.org/tv/73681?language=en", "title": "L'Académie", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 0, "genre": ["Drama"], "cast": ["Léa Roy", "Juliette Gosselin", "Sabrina Bégin Tejeda", "Marianne Fortier", "Antoine Desrochers"], "character": ["Agathe", "Marie", "Wendy", "Scarlett", "Clément"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73681   Expand L'Académie   (2017) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Sarah-Maude Beauchesne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Léa Roy Agathe Juliette Gosselin Marie Sabrina Bégin Tejeda Wendy Marianne Fortier Scarlett Antoine Desrochers Clément Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of L'Académie premiered on October 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on L'Académie. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification C8 Meaning Suitable for children ages 8+. Low level violence and fantasy horror is allowed. No foul language is allowed, but occasional \"socially offensive and discriminatory\" language is allowed if in the context of the story. No sexual content of any level allowed. Type  Scripted Original Language  French Runtime  22m Homepage   http://lacademie-serie.ca Genres Drama Keywords boarding school teenager high school student teen drama Content Score 93 Almost there... Top Contributors 83 Banana 2 karaa 2 Guipat TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}