{"link": "https://www.themoviedb.org/tv/79566?language=en", "title": "Sketch", "resume": "Detective Kang Dong-Soo's fiance is killed mysteriously. He works with a female detective who can see 3 days into the future. She sketches what she sees. They set out to capture the murderer. Kim Do-Jin is a former special forces member. His pregnant wife was killed and he plots revenge.", "rate": 60, "genre": ["Mystery", "Drama", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Rain", "Lee Dong-gun", "Lee Sun-Bin", "Jung Jin-young", "Kang Shin-il"], "character": ["Kang Dong-Soo", "Kim Do-Jin", "Yoo Shi-Hyun", "Jang Tae-Joon", "Moon Jae-Hyun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79566   Expand Sketch   (2018) User Score  Play Trailer Overview Detective Kang Dong-Soo's fiance is killed mysteriously. He works with a female detective who can see 3 days into the future. She sketches what she sees. They set out to capture the murderer. Kim Do-Jin is a former special forces member. His pregnant wife was killed and he plots revenge. Featured Crew Im Tae Woo Creator Kang Hyun Sung Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rain Kang Dong-Soo Lee Dong-gun Kim Do-Jin Lee Sun-Bin Yoo Shi-Hyun Jung Jin-young Jang Tae-Joon Kang Shin-il Moon Jae-Hyun Full Cast & Crew Current Season Season 1 2018 | 16 Episodes Season 1 of Sketch premiered on May 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Sketch. You can help by rating TV shows you've seen. Facts Original Name  스케치 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.jtbc.joins.com/sketch Genres Mystery Drama Sci-Fi & Fantasy Action & Adventure Keywords fantasy thriller Content Score 100 Yes! Looking good! Top Contributors M 32 Maria180493 13 Sergiojamon 9 lys h 3 huestory  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}