{"link": "https://www.themoviedb.org/tv/19258?language=en", "title": "Pets", "resume": "Pets is an adult British puppet sitcom, produced by Fit2Fill Productions Limited. It was originally aired on Channel 4 and ran for two series, the first being broadcast in 2001, and the second in 2002. It was also sold to Fox in Australia, MTV in Italy, and the Middle East.\nThe series was created and written by Andrew Barclay and Brian West, who had previously worked together at the Edinburgh Festival, winning an award for an advert for The Jerry Springer Show, and on the sketch show We Know Where You Live.\nA total of 26 episodes of Pets were aired, all approximately 11 minutes long. They were shown in the early hours of the morning, and as a result, the series was fairly unknown, although it did gain a significant cult following. There was a demand on the official website for Pets to be released on DVD. Eventually a limited edition DVD was made available to purchase via the official website. As well as the two series, the DVD included two unbroadcast episodes, a clip show named \"The Trials Of Hamish\", and a behind-the-scenes special named \"The Making Of Pets\".\nSeveral episodes of Pets are currently available as a free podcast downloadable via iTunes. In 2010, a similar show named Mongrels aired on BBC3, sparking controversy between the two. The casts of characters in those two shows are almost similar as well, although Pets had four main characters while Mongrels had five. Also, Mongrels' range of locations is more diverse, while Pets is confined to a single flat.", "rate": 90, "genre": ["Comedy"], "cast": ["Ian Angus Wilkie", "Sally Elsden", "Petros Emmanuel", "Andrew Barclay"], "character": ["Hamish", "Davina", "JP", "Trevor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19258   Expand Pets   (2001) User Score Overview Pets is an adult British puppet sitcom, produced by Fit2Fill Productions Limited. It was originally aired on Channel 4 and ran for two series, the first being broadcast in 2001, and the second in 2002. It was also sold to Fox in Australia, MTV in Italy, and the Middle East. The series was created and written by Andrew Barclay and Brian West, who had previously worked together at the Edinburgh Festival, winning an award for an advert for The Jerry Springer Show, and on the sketch show We Know Where You Live. A total of 26 episodes of Pets were aired, all approximately 11 minutes long. They were shown in the early hours of the morning, and as a result, the series was fairly unknown, although it did gain a significant cult following. There was a demand on the official website for Pets to be released on DVD. Eventually a limited edition DVD was made available to purchase via the official website. As well as the two series, the DVD included two unbroadcast episodes, a clip show named \"The Trials Of Hamish\", and a behind-the-scenes special named \"The Making Of Pets\". Several episodes of Pets are currently available as a free podcast downloadable via iTunes. In 2010, a similar show named Mongrels aired on BBC3, sparking controversy between the two. The casts of characters in those two shows are almost similar as well, although Pets had four main characters while Mongrels had five. Also, Mongrels' range of locations is more diverse, while Pets is confined to a single flat. Featured Crew Andrew Barclay Creator Brian West Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Angus Wilkie Hamish Sally Elsden Davina Petros Emmanuel JP Andrew Barclay Trevor Full Cast & Crew Last Season Season 2 — | 14 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Pets. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  11m Homepage  - Genres Comedy Keywords cat parrot puppet slapstick sexual joke spoof vulgarity dog goldfish dark humor swearing scatological humor sitcom innuendo british humour Content Score 93 Almost there... Top Contributors a 35 alexmate O 3 Ozbourne 2 BlackDelivery TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}