{"link": "https://www.themoviedb.org/tv/40675?language=en", "title": "DCI Banks", "resume": "A thrilling drama based on the novels by Peter Robinson. Stephen Tompkinson and Andrea Lowe star as the tenacious and stubborn Chief Inspector Alan Banks and the feisty and headstrong Detective Sergeant Annie Cabbot.", "rate": 80, "genre": ["Crime", "Drama"], "cast": ["Stephen Tompkinson", "Andrea Lowe", "Caroline Catz", "Jack Deam", "Samuel Anderson"], "character": ["DCI Alan Banks", "DS Annie Cabbot", "DI Helen Morton", "DS Ken Blackstone", "Vince Grady"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40675   Expand DCI Banks   (2011) User Score  Play Trailer Overview A thrilling drama based on the novels by Peter Robinson. Stephen Tompkinson and Andrea Lowe star as the tenacious and stubborn Chief Inspector Alan Banks and the feisty and headstrong Detective Sergeant Annie Cabbot. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Tompkinson DCI Alan Banks Andrea Lowe DS Annie Cabbot Caroline Catz DI Helen Morton Jack Deam DS Ken Blackstone Samuel Anderson Vince Grady Full Cast & Crew Last Season Series 5 2016 | 6 Episodes Season 5 of DCI Banks premiered on August 31, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for DCI Banks. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2007-04-08 Inspector George Gently 8.3    2013-03-10 Shetland 7.5    2011-06-05 Case Histories 8.2    2014-10-06 Grantchester 7.3    2011-09-13 The Body Farm 6.2    2011-05-01 Vera 6.8    2006-01-01 In Justice 6.8    2011-01-13 Kidnap and Ransom 7.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   https://www.itv.com/itvplayer/dci-banks Genres Crime Drama Keywords based on novel or book police detective murder investigation Content Score 93 Almost there... Top Contributors 72 Banana m 35 miro22 16 Elizabeth Jennings S 13 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}