{"link": "https://www.themoviedb.org/tv/60812?language=en", "title": "The Kawai Complex Guide to Manors and Hostel Behavior", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 61, "genre": ["Animation", "Comedy"], "cast": ["Yuuichi Iguchi", "Kana Hanazawa", "Sanae Kobayashi", "Go Shinomiya", "Rina Satou"], "character": ["Kazunari Usa", "Ritsu Kawai", "Sumiko", "Shirosaki", "Mayumi Nishikino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60812   Expand The Kawai Complex Guide to Manors and Hostel Behavior   (2014) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Shigeyuki Miwa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  11 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuichi Iguchi Kazunari Usa Kana Hanazawa Ritsu Kawai Sanae Kobayashi Sumiko Go Shinomiya Shirosaki Rina Satou Mayumi Nishikino Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of The Kawai Complex Guide to Manors and Hostel Behavior premiered on April  4, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Kawai Complex Guide to Manors and Hostel Behavior. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  11 Posters  3 Recommendations   2013-01-07 Amnesia 5.7  Facts Original Name  僕らはみんな河合荘 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tbs.co.jp/anime/kawaisou/ Genres Animation Comedy Keywords romance based on manga anime young king ours Content Score 86 Almost there... Top Contributors 29 benf45 19 CrewMdk 9 sp1ti s 5 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}