{"link": "https://www.themoviedb.org/tv/74706?language=en", "title": "Rikuoh", "resume": "Koichi Miyazawa runs a small, but longstanding company which makes tabi (traditional Japanese socks). He is the CEO of the fourth generation company with about 20 employees. Due to a decrease of demand for tabi, the company is struggling to keep afloat. Koichi Miyazawa thinks about launching a new product line. The new product is running shoes. For the company's surival, Koichi Miyazawa begins to develop running shoes using their accumulated knowledge for making tabi.", "rate": 60, "genre": ["Drama"], "cast": ["Koji Yakusho", "Kento Yamazaki", "Haruka Uchimura", "Ayako Yoshitani", "Yasuko Haru"], "character": ["Koichi Miyazawa", "Daichi Miyazawa", "Toshimitsu Yasuda", "Misaki Nakashita", "Yoneko Mizuhara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74706   Expand Rikuoh   (2017) User Score Overview Koichi Miyazawa runs a small, but longstanding company which makes tabi (traditional Japanese socks). He is the CEO of the fourth generation company with about 20 employees. Due to a decrease of demand for tabi, the company is struggling to keep afloat. Koichi Miyazawa thinks about launching a new product line. The new product is running shoes. For the company's surival, Koichi Miyazawa begins to develop running shoes using their accumulated knowledge for making tabi. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Koji Yakusho Koichi Miyazawa Kento Yamazaki Daichi Miyazawa Haruka Uchimura Toshimitsu Yasuda Ayako Yoshitani Misaki Nakashita Yasuko Haru Yoneko Mizuhara Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Rikuoh premiered on October 15, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply PE Does \"Jupiter\" by Ayaka Hirahara fit this tale of a small Tabi maker vs. giant shoe makers? Open 0 by Patrick E. Abe\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Rikuoh. You can help by rating TV shows you've seen. Facts Original Name  陸王 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.tbs.co.jp/rikuou_tbs/ Genres Drama Keywords japan corporate Content Score 86 Almost there... Top Contributors M 45 Maria180493 g 6 gashtoby C 4 Chintaran j 1 jklmo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}