{"link": "https://www.themoviedb.org/tv/16247?language=en", "title": "Nitro Circus", "resume": "Nitro Circus is an \"action sport collective\" led by Travis Pastrana, featuring his friends and him traveling around the world riding dirtbikes, base jumping, and performing stunts. It has spawned a tour, a second television series based on the tour, and a 3D feature film.", "rate": 63, "genre": ["Action", "Adventure"], "cast": ["Nate Adams"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16247   Expand Nitro Circus   (2009) User Score Overview Nitro Circus is an \"action sport collective\" led by Travis Pastrana, featuring his friends and him traveling around the world riding dirtbikes, base jumping, and performing stunts. It has spawned a tour, a second television series based on the tour, and a 3D feature film. Featured Crew Jeff Tremaine Creator Johnny Knoxville Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nate Adams Full Cast & Crew Last Season Season 2 2009 | 9 Episodes Season 2 of Nitro Circus premiered on August 27, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  3 Recommendations   2004-08-31 Dog the Bounty Hunter 3.4    2003-10-26 Viva La Bam 6.1    2010-12-01 Storage Wars 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.mtv.com/ontv/dyn/nitro_circus/series.jhtml#bio Genres Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 3 Zlogorek r 2 racci M 1 MAthePA f 1 flaeti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}