{"link": "https://www.themoviedb.org/tv/1052?language=en", "title": "Fat Friends", "resume": "Fat Friends was an ITV drama, following a group of overweight people, their laughter and pain and addresses the absurdities of dieting in our modern age. The drama looks at people and how they relate to one another and use body weight as an excuse for all sorts of failings in their relationships, or not living their lives to the full. Four of the cast, Ruth Jones, James Corden, Sheridan Smith and Alison Steadman, went on to appear in Gavin & Stacey.", "rate": 60, "genre": ["Drama"], "cast": ["Gaynor Faye", "Lisa Riley", "Alison Steadman", "Ruth Jones", "Janet Dibley"], "character": ["Lauren Harris", "Rebecca Patterson", "Betty Simpson", "Kelly Chadwick", "Carol McGary"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1052   Expand Fat Friends   (2000) User Score Overview Fat Friends was an ITV drama, following a group of overweight people, their laughter and pain and addresses the absurdities of dieting in our modern age. The drama looks at people and how they relate to one another and use body weight as an excuse for all sorts of failings in their relationships, or not living their lives to the full. Four of the cast, Ruth Jones, James Corden, Sheridan Smith and Alison Steadman, went on to appear in Gavin & Stacey. Featured Crew Kay Mellor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gaynor Faye Lauren Harris Lisa Riley Rebecca Patterson Alison Steadman Betty Simpson Ruth Jones Kelly Chadwick Janet Dibley Carol McGary Full Cast & Crew Last Season Season 4 2005 | 6 Episodes Season 4 of Fat Friends premiered on February 17, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fat Friends. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords northern england yorkshire Content Score 79 Pump it up! We're close now. Top Contributors 9 kcdh O 4 Ozbourne R 2 Rebecca 1 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}