{"link": "https://www.themoviedb.org/tv/60835?language=en", "title": "If Her Flag Breaks", "resume": "Sota Hatate is a boy who has the unique ability to see \"Flags\" above the heads of other people. The \"Flags\" mark critical crossroads in people's lives — when the choices they make will determine love, friendship, victory, and even death. He transfers into Tokyo's elite Hatagaya Academy, but instead of living by himself in the boys' dormitory, he ends up living with many beautiful girls under one roof.", "rate": 75, "genre": ["Animation", "Comedy"], "cast": ["Ryota Ohsaka", "Ibuki Kido", "Kayano Ai", "Kana Hanazawa", "Youko Hikasa"], "character": ["Souta Hatate", "Nanami Knight Bladefield", "Akane Mahougasawa", "Megumu Tōzokuyama", "Rin Eiyūzaki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60835   Expand If Her Flag Breaks   (2014) User Score Overview Sota Hatate is a boy who has the unique ability to see \"Flags\" above the heads of other people. The \"Flags\" mark critical crossroads in people's lives — when the choices they make will determine love, friendship, victory, and even death. He transfers into Tokyo's elite Hatagaya Academy, but instead of living by himself in the boys' dormitory, he ends up living with many beautiful girls under one roof. Featured Crew Ayumu Watanabe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryota Ohsaka Souta Hatate Ibuki Kido Nanami Knight Bladefield Kayano Ai Akane Mahougasawa Kana Hanazawa Megumu Tōzokuyama Youko Hikasa Rin Eiyūzaki Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of If Her Flag Breaks premiered on April  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on If Her Flag Breaks. You can help by rating TV shows you've seen. Facts Original Name  彼女がフラグをおられたら Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 29 benf45 17 Elizabeth Jennings 6 BrerFox CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}