{"link": "https://www.themoviedb.org/tv/8464?language=en", "title": "Operation Repo", "resume": "Operation Repo is an American television program that depicts the world of car repossession with a team that portrays fictionalized tales of repossessions from California's San Fernando Valley. Similar to another truTV show, Southern Fried Stings, the series is filmed in a cinema verité style but consists of scripted and dramatized performances by actors. The show is filmed by recreating scenes in which the cast conducts repossessions of automobiles for finance companies. In the show they also perform repossessions of other exotic and strange items such as luxury boats, planes, limousines, motorcycles, ATVs, Zambonis, ice cream trucks, tow trucks, buses, trucks, expensive bicycles, hot air balloons, wood chippers, forklifts, and tanning beds.", "rate": 20, "genre": ["Documentary"], "cast": ["Sonia Pizarro"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8464   Expand Operation Repo   (2008) User Score Overview Operation Repo is an American television program that depicts the world of car repossession with a team that portrays fictionalized tales of repossessions from California's San Fernando Valley. Similar to another truTV show, Southern Fried Stings, the series is filmed in a cinema verité style but consists of scripted and dramatized performances by actors. The show is filmed by recreating scenes in which the cast conducts repossessions of automobiles for finance companies. In the show they also perform repossessions of other exotic and strange items such as luxury boats, planes, limousines, motorcycles, ATVs, Zambonis, ice cream trucks, tow trucks, buses, trucks, expensive bicycles, hot air balloons, wood chippers, forklifts, and tanning beds. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sonia Pizarro Full Cast & Crew Last Season Season 11 2013 | 20 Episodes Season 11 of Operation Repo premiered on March 27, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Operation Repo. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.trutv.com/shows/operation_repo/index.html Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 5 zurman1 s 3 speedycars 2 pabloelduro 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}