{"link": "https://www.themoviedb.org/tv/1543?language=en", "title": "30 Days", "resume": "30 Days is a reality television show on the FX cable network in the United States, created and hosted by Morgan Spurlock. In each episode, Spurlock, or some other person or group of people, spend 30 days immersing themselves in a particular lifestyle with which they are unfamiliar, while discussing related social issues. As in Spurlock's film, Super Size Me, there are a number of rules unique to each situation which must be followed during each such experiment. At least one episode each season has featured Spurlock as the person spending the month in the particular lifestyle.\nSeason one premiered on June 15, 2005, and its respective DVD set was released July 11, 2006. The second season premiered on July 26, 2006. Season 3 of 30 Days premiered on June 3, 2008. FX said on November 6 that it would not be renewing the series for a fourth season, effectively canceling the show. The show has recently been picked up for re-air by Planet Green, though no new episodes have been ordered.\nIn the United Kingdom, the program is broadcast on More4 and Channel 4. In Australia, the program is broadcast on Network Ten and Lifestyle Channel. It currently airs in Canada on Independent Film Channel and Canal Vie. It also airs on FX in Latin America. In Norway it airs on TV 2. In Sweden it airs on TV4 and Kanal 9.", "rate": 77, "genre": ["Documentary"], "cast": ["Morgan Spurlock"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1543   Expand 30 Days   (2005) User Score Overview 30 Days is a reality television show on the FX cable network in the United States, created and hosted by Morgan Spurlock. In each episode, Spurlock, or some other person or group of people, spend 30 days immersing themselves in a particular lifestyle with which they are unfamiliar, while discussing related social issues. As in Spurlock's film, Super Size Me, there are a number of rules unique to each situation which must be followed during each such experiment. At least one episode each season has featured Spurlock as the person spending the month in the particular lifestyle. Season one premiered on June 15, 2005, and its respective DVD set was released July 11, 2006. The second season premiered on July 26, 2006. Season 3 of 30 Days premiered on June 3, 2008. FX said on November 6 that it would not be renewing the series for a fourth season, effectively canceling the show. The show has recently been picked up for re-air by Planet Green, though no new episodes have been ordered. In the United Kingdom, the program is broadcast on More4 and Channel 4. In Australia, the program is broadcast on Network Ten and Lifestyle Channel. It currently airs in Canada on Independent Film Channel and Canal Vie. It also airs on FX in Latin America. In Norway it airs on TV 2. In Sweden it airs on TV4 and Kanal 9. Featured Crew Morgan Spurlock Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morgan Spurlock Host Full Cast & Crew Last Season Season 3 2008 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on 30 Days. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.fxnetworks.com/shows/originals/30days/ Genres Documentary Keywords reporter tv reporter social documentary based on true events real life real story Content Score 64 We're so close, yet so far. Top Contributors 12 prm96 j 3 jjs23 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}