{"link": "https://www.themoviedb.org/tv/70170?language=en", "title": "A Spot Of Science", "resume": "Viewers ask their craziest science questions, then it’s up to Gus Sorola and Chris Demarais to match wits with evolutionary biologist Sally Le Page in search of an answer.  No science theory is too dumb, but someone on this panel probably is. (It's Chris.)", "rate": 60, "genre": ["Comedy"], "cast": ["Sally Le Page", "Chris Demarais", "Gus Sorola"], "character": ["Host", "Dumb Guy", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70170   Expand A Spot Of Science   (2017) User Score Overview Viewers ask their craziest science questions, then it’s up to Gus Sorola and Chris Demarais to match wits with evolutionary biologist Sally Le Page in search of an answer.  No science theory is too dumb, but someone on this panel probably is. (It's Chris.) Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sally Le Page Host Chris Demarais Dumb Guy Gus Sorola Host Full Cast & Crew Last Season Season 1 2017 | 7 Episodes Season 1 of A Spot Of Science premiered on January 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Spot Of Science. You can help by rating TV shows you've seen. Facts Status  In Production Network Certification  - Type  Talk Show Original Language  English Runtime  15m Homepage   Roosterteeth.com Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors d 24 daniel3032  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}