{"link": "https://www.themoviedb.org/tv/63329?language=en", "title": "Rosewood", "resume": "Dr. Beaumont Rosewood, Jr. is a brilliant private pathologist who uses wildly sophisticated technology and his drive to live life to the fullest to help a tough-as-nails detective and the Miami PD uncover clues no one else can see.", "rate": 60, "genre": ["Drama"], "cast": ["Morris Chestnut", "Jaina Lee Ortiz", "Gabrielle Dennis", "Anna Konkle", "Lorraine Toussaint"], "character": ["Dr. Beaumont Rosewood, Jr.", "Det. Annalise Villa", "Pippy Rosewood", "Tara Milly Izikoff (aka TMI)", "Donna Rosewood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63329   Expand Rosewood   (2015) User Score  Play Trailer Overview Dr. Beaumont Rosewood, Jr. is a brilliant private pathologist who uses wildly sophisticated technology and his drive to live life to the fullest to help a tough-as-nails detective and the Miami PD uncover clues no one else can see. Featured Crew Todd Harthan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morris Chestnut Dr. Beaumont Rosewood, Jr. Jaina Lee Ortiz Det. Annalise Villa Gabrielle Dennis Pippy Rosewood Anna Konkle Tara Milly Izikoff (aka TMI) Lorraine Toussaint Donna Rosewood Full Cast & Crew Last Season Season 2 2016 | 22 Episodes Season 2 of Rosewood premiered on September 23, 2016. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Show Cancelled Open 1 by  littlefingers116 b Slade Open 1 by  Taylorfirst1 b Any guesses Open 2 by  Nicole3461 Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  6 Recommendations   2015-08-23 Noble, My Love 7.4    2014-10-27 Tornado Hunters 6.0    2013-08-22 Crossing Lines 6.8    2017-03-01 Chicago Justice 4.8    2016-01-13 Second Chance 6.5    2015-03-16 Spotless 7.3    2016-01-07 Shades of Blue 6.2    2008-10-12 Stephen Fry in America 8.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.fox.com/rosewood Genres Drama Keywords miami police detective female detective pathologist police department Content Score 100 Yes! Looking good! Top Contributors 41 Elizabeth Jennings 18 d.a. 13 niqo19 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}