{"link": "https://www.themoviedb.org/tv/15530?language=en", "title": "Gemini Division", "resume": "Gemini Division is an American science fiction series of five-to-seven minute long episodes created by Electric Farm Entertainment which went into production in March 2008. Based on an original story by Brent Friedman the online series was developed by Joshua Stern. The show currently airs on NBC.com as part of their online content lineup. The series began August 18, 2008. The series stars Rosario Dawson, who worked with Electric Farm Entertainment on the Webby nominated cult internet series Afterworld. J Alex Reed and Duane Loose will be showrunners, while Brent Friedman and Stan Rowgow serve as executive producers. The writing staff includes Brent Friedman, Andy Black, Lawrence Frank, and Jacqui Zambrano. Stan Rogow is also credited as Director and is presumed to direct a number of the episodes with the rest being directed by Neal Israel. Web content development is being managed by producers Ben Raab and Deric Hugues web content producers.", "rate": 0, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Justin Hartley", "Rick Ravanello", "John Kapelos", "Norbert Weisser", "Allison Scagliotti"], "character": ["Nick Korda", "Hera Theophilus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15530   Expand Gemini Division   (2008) User Score Overview Gemini Division is an American science fiction series of five-to-seven minute long episodes created by Electric Farm Entertainment which went into production in March 2008. Based on an original story by Brent Friedman the online series was developed by Joshua Stern. The show currently airs on NBC.com as part of their online content lineup. The series began August 18, 2008. The series stars Rosario Dawson, who worked with Electric Farm Entertainment on the Webby nominated cult internet series Afterworld. J Alex Reed and Duane Loose will be showrunners, while Brent Friedman and Stan Rowgow serve as executive producers. The writing staff includes Brent Friedman, Andy Black, Lawrence Frank, and Jacqui Zambrano. Stan Rogow is also credited as Director and is presumed to direct a number of the episodes with the rest being directed by Neal Israel. Web content development is being managed by producers Ben Raab and Deric Hugues web content producers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Justin Hartley Nick Korda Rick Ravanello John Kapelos Norbert Weisser Allison Scagliotti Hera Theophilus Full Cast & Crew Last Season Season 1 2008 | 50 Episodes Season 1 of Gemini Division premiered on August 18, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Gemini Division. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  20m, 7m Homepage   http://www.GeminiDivision.com/ Genres Drama Mystery Sci-Fi & Fantasy Keywords new york conspiracy female detective Content Score 86 Almost there... Top Contributors 11 Banana 7 Elizabeth Jennings 1 theChaosCoder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}