{"link": "https://www.themoviedb.org/tv/67282?language=en", "title": "Her Story", "resume": "Her Story is about two trans women in Los Angeles who have given up on love, when suddenly chance encounters give them hope. Violet is drawn to Allie, a reporter who approaches her for an interview, while career-driven Paige meets James, the first man she’s considered opening up to in years. Will they risk letting what they are stand in the way of being loved for who they are?  Trans women in the media have long been punchlines, killers, indications of urban grit, pathetic tragedies, and dangerous sirens. Rarely have they been complex characters who laugh, struggle, and grow, who share strength in sisterhood, who seek and find love. Her Story depicts the unique, complicated, and very human women we see in queer communities, and explores how these women navigate the intersections of label identity and love.", "rate": 75, "genre": ["Drama"], "cast": ["Angelica Ross", "Jen Richards", "Laura Zak"], "character": ["Paige", "Violet", "Allie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67282   Expand Her Story   (2016) User Score  Play Trailer Overview Her Story is about two trans women in Los Angeles who have given up on love, when suddenly chance encounters give them hope. Violet is drawn to Allie, a reporter who approaches her for an interview, while career-driven Paige meets James, the first man she’s considered opening up to in years. Will they risk letting what they are stand in the way of being loved for who they are?  Trans women in the media have long been punchlines, killers, indications of urban grit, pathetic tragedies, and dangerous sirens. Rarely have they been complex characters who laugh, struggle, and grow, who share strength in sisterhood, who seek and find love. Her Story depicts the unique, complicated, and very human women we see in queer communities, and explores how these women navigate the intersections of label identity and love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angelica Ross Paige Jen Richards Violet Laura Zak Allie Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Her Story premiered on January 19, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Her Story. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Her Story. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  12m, 8m, 9m, 10m Homepage   http://herstoryshow.com Genres Drama Keywords los angeles dating relationship lgbt woman director trans woman trans director Content Score 64 We're so close, yet so far. Top Contributors 40 Banana TB 7 TMDb Bot m 1 mea6an  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}