{"link": "https://www.themoviedb.org/tv/5917?language=en", "title": "90210", "resume": "90210 revolves around several students at the fictional West Beverly Hills High School, including new Beverly Hills residents Annie Wilson and Dixon Wilson. Their father, Harry Wilson, has returned from Kansas to his Beverly Hills childhood home with his family to care for his mother, former television and theater actress Tabitha Wilson, who has a drinking problem and clashes with his wife Debbie Wilson. Annie and Dixon struggle to adjust to their new lives while making friends and yet adhering to their parents' wishes.", "rate": 46, "genre": ["Drama"], "cast": ["Shenae Grimes", "Tristan Mack Wilds", "AnnaLynne McCord", "Jessica Stroup", "Michael Steger"], "character": ["Annie Wilson", "Dixon Wilson", "Naomi Clark", "Erin Silver", "Navid Shirazi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5917   Expand 90210   (2009) User Score Overview 90210 revolves around several students at the fictional West Beverly Hills High School, including new Beverly Hills residents Annie Wilson and Dixon Wilson. Their father, Harry Wilson, has returned from Kansas to his Beverly Hills childhood home with his family to care for his mother, former television and theater actress Tabitha Wilson, who has a drinking problem and clashes with his wife Debbie Wilson. Annie and Dixon struggle to adjust to their new lives while making friends and yet adhering to their parents' wishes. Featured Crew Rob Thomas Creator Gabe Sachs Creator Jeff Judah Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  23 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Shenae Grimes Annie Wilson Tristan Mack Wilds Dixon Wilson AnnaLynne McCord Naomi Clark Jessica Stroup Erin Silver Michael Steger Navid Shirazi Full Cast & Crew Last Season Season 5 2012 | 22 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply w Adrianna: Happy Birthday Jessica Lowndes! Open 0 by wonder2wonder\n      \n     w Annie: Happy Birthday Shenae Grimes! Open 0 by wonder2wonder\n      \n     w Erin: Happy Birthday Jessica Stroup! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  23 Posters  13 Recommendations   1992-07-08 Melrose Place 4.9    2013-01-14 The Carrie Diaries 4.9    2011-09-05 Zig and Sharko 5.3    2010-01-18 Life Unexpected 7.4    1987-01-20 Unsolved Mysteries 7.4    1996-08-26 7th Heaven 5.2    2004-02-16 The Catherine Tate Show 5.5    1999-09-19 Judging Amy 7.1  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  40m Homepage   http://www.cwtv.com/shows/90210 Genres Drama Keywords high school friendship california family relationships love los angeles beverly hills teenage romance teen drama wealthy teens Content Score 100 Yes! Looking good! Top Contributors 175 Marr 🇳🇱 67 lineker 22 Banana 9 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}