{"link": "https://www.themoviedb.org/tv/62807?language=en", "title": "Chrisley Knows Best", "resume": "Follows Atlanta-based self-made multimillionaire Todd Chrisley, his devoted wife Julie and their five children who live a seemingly picture-perfect Southern life with everything money can buy.", "rate": 60, "genre": ["Reality"], "cast": ["Chase Chrisley", "Julie Chrisley", "Todd Chrisley", "Savannah Chrisley"], "character": ["himself", "herself", "himself", "herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62807   Expand Chrisley Knows Best   (2014) User Score  Play Trailer Overview Follows Atlanta-based self-made multimillionaire Todd Chrisley, his devoted wife Julie and their five children who live a seemingly picture-perfect Southern life with everything money can buy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chase Chrisley himself Julie Chrisley herself Todd Chrisley himself Savannah Chrisley herself Full Cast & Crew Current Season Season 6 2018 | 9 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Do the husband and wife have a 'beard' agreement? Open 0 by couchplotato\n      \n     Dodging taxes Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   1978-06-02 20/20 7.0    2006-03-21 The Real Housewives of Orange County 5.1    2005-03-06 Intervention 6.1    1988-01-19 48 Hours 7.3    1992-03-31 Dateline NBC 4.3    2004-06-03 The First 48 7.6    2005-04-12 Deadliest Catch 6.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.usanetwork.com/chrisleyknowsbest Genres Reality Keywords rich family Content Score 93 Almost there... Top Contributors k 12 kale229 z 10 zurman1 9 Elizabeth Jennings Y 9 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}