{"link": "https://www.themoviedb.org/tv/63823?language=en", "title": "Aftermath", "resume": "Aftermath is a supernatural crime drama based on the popular Naver webtoon by Kim Sun Kwon (\"Survivors of Those Days,\" \"K Errands Center\"). It is a thrilling story of murder, mystery, and love that was made exclusively for Naver TVCast for viewing on mobile devices. Ahn Dae Yong (Dong Jun) is a quiet high school student who suddenly develops the super power to predict who is a murderer and who is about to die. Those who appear to have red eyes are destined to die soon, while those with blue eyes are about to commit murder. Ahn Dae Yong decides to use this power to save lives and becomes an unexpected hero for the people.", "rate": 63, "genre": ["Mystery", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kim Geun Hyung", "Kim Ri Ah", "Ji Sun", "Chae Hee Jae", "Kim Min-seok"], "character": ["Kim Joon Goo", "Kim Na Ri", "madre de Dae Yong", "Tío de Hee Kyung", "Jo In-ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63823   Expand Aftermath   (2014) User Score Overview Aftermath is a supernatural crime drama based on the popular Naver webtoon by Kim Sun Kwon (\"Survivors of Those Days,\" \"K Errands Center\"). It is a thrilling story of murder, mystery, and love that was made exclusively for Naver TVCast for viewing on mobile devices. Ahn Dae Yong (Dong Jun) is a quiet high school student who suddenly develops the super power to predict who is a murderer and who is about to die. Those who appear to have red eyes are destined to die soon, while those with blue eyes are about to commit murder. Ahn Dae Yong decides to use this power to save lives and becomes an unexpected hero for the people. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Geun Hyung Kim Joon Goo Kim Ri Ah Kim Na Ri Ji Sun madre de Dae Yong Chae Hee Jae Tío de Hee Kyung Kim Min-seok Jo In-ho Full Cast & Crew Last Season Season 2 2014 | 6 Episodes Season 2 of Aftermath premiered on January 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Aftermath. You can help by rating TV shows you've seen. Facts Original Name  후유증 Status  Ended Network Certification  - Type  Scripted Original Language  Thai Runtime  10m Homepage   http://tvcast.naver.com/aftermath Genres Mystery Drama Sci-Fi & Fantasy Keywords korea Content Score 71 Just a little bit more... Top Contributors t 38 tmdb38202327 13 Sergiojamon 5 seksonh 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}