{"link": "https://www.themoviedb.org/tv/13819?language=en", "title": "Die Sendung mit der Maus", "resume": "Die Sendung mit der Maus is a highly acclaimed children's series on German television that has been called \"the school of the nation\". The show first aired on March 10, 1971. Originally called Lach- und Sachgeschichten für Fernsehanfänger, it was controversial because German law prohibited television for children under six years of age. The program was initially condemned by teachers and childcare professionals as bad for children's development, but is now hailed for its ability to convey information to children. The show has received over 75 awards. The first doctoral dissertation on the program was written in 1991. On March 7, 1999, the program's Internet site was launched and received 2,400 e-mails and 4 million hits on the first day.", "rate": 80, "genre": ["Animation", "Family"], "cast": ["Wolfgang Völz"], "character": ["Käpt'n Blaubär"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13819   Expand Die Sendung mit der Maus   (1971) User Score Overview Die Sendung mit der Maus is a highly acclaimed children's series on German television that has been called \"the school of the nation\". The show first aired on March 10, 1971. Originally called Lach- und Sachgeschichten für Fernsehanfänger, it was controversial because German law prohibited television for children under six years of age. The program was initially condemned by teachers and childcare professionals as bad for children's development, but is now hailed for its ability to convey information to children. The show has received over 75 awards. The first doctoral dissertation on the program was written in 1991. On March 7, 1999, the program's Internet site was launched and received 2,400 e-mails and 4 million hits on the first day. Featured Crew Gert Kaspar Müntefering Creator Siegfried Mohrhof Creator Monika Paetow Creator Armin Maiwald Creator Dieter Saldecki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wolfgang Völz Käpt'n Blaubär Full Cast & Crew Last Season Season 2011 2011 | 5 Episodes Season 41 of Die Sendung mit der Maus premiered on January  2, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1982-09-24 Meister Eder und sein Pumuckl 5.6    1981-02-14 Wanna bet, that..? 3.2    1983-10-10 Alice in Wonderland 5.6    1974-04-03 Vicky the Viking 6.1    2002-01-25 Mr. Bean: The Animated Series 5.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  30m Homepage   http://www.die-maus.de/ Genres Animation Family Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors S 10 Samara r 1 roadchen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}