{"link": "https://www.themoviedb.org/tv/71739?language=en", "title": "Ghosted", "resume": "A skeptic is forced to work with a firm believer of the paranormal on unexplained occurrences in Los Angeles.", "rate": 62, "genre": ["Comedy"], "cast": ["Craig Robinson", "Adam Scott", "Amber Stevens", "Ally Walker", "Adeel Akhtar"], "character": ["Leroy Wright", "Max Jennifer / Max Allison", "Annie", "Captain Ava Lafrey", "Dr. Barry Shaw"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71739   Expand Ghosted   (2017) User Score  Play Trailer Overview A skeptic is forced to work with a firm believer of the paranormal on unexplained occurrences in Los Angeles. Featured Crew Tom Gormican Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  3 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig Robinson Leroy Wright Adam Scott Max Jennifer / Max Allison Amber Stevens Annie Ally Walker Captain Ava Lafrey Adeel Akhtar Dr. Barry Shaw Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Canadian TV Order (TV) Season 1 2017 | 13 Episodes Season 1 of Ghosted premiered on October  1, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply So funny Open 7 by  jorgito2001 Doesn't look good Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2017-10-03 The Mayor 6.7    2017-10-01 Wisdom of the Crowd 7.1    2017-10-01 Ten Days in the Valley 6.0    2017-10-09 Valor 6.3    2017-09-25 The Brave 6.6    2017-10-02 The Gifted 7.0    2017-09-26 Law & Order True Crime 6.1    2017-10-02 9JKL 5.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m Homepage   http://www.fox.com/ghosted/ Genres Comedy Keywords secret government organization paranormal investigation security guard buddy cop Content Score 100 Yes! Looking good! Top Contributors 72 Banana 41 Warpath 19 Elizabeth Jennings t 9 thermo6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}