{"link": "https://www.themoviedb.org/tv/5126?language=en", "title": "The Mothers-in-Law", "resume": "The Mothers-in-Law is an American sitcom starring Eve Arden and Kaye Ballard as two matriarchs who were friends and next-door neighbors whose children's elopement rendered them in-laws. The show aired on NBC from September 1967 to April 1969. Produced by Desi Arnaz, the series was created by Bob Carroll, Jr., and Madelyn Davis.", "rate": 70, "genre": ["Comedy"], "cast": ["Roger C. Carmel", "Richard Deacon", "Eve Arden", "Herbert Rudley", "Deborah Walley"], "character": ["Roger Buell", "Roger Buell", "Eve Hubbard", "Herb Hubbard", "Suzie Hubbard Buell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5126   Expand The Mothers-in-Law   (1967) User Score Overview The Mothers-in-Law is an American sitcom starring Eve Arden and Kaye Ballard as two matriarchs who were friends and next-door neighbors whose children's elopement rendered them in-laws. The show aired on NBC from September 1967 to April 1969. Produced by Desi Arnaz, the series was created by Bob Carroll, Jr., and Madelyn Davis. Featured Crew Bob Carroll Creator Madelyn Pugh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roger C. Carmel Roger Buell Richard Deacon Roger Buell Eve Arden Eve Hubbard Herbert Rudley Herb Hubbard Deborah Walley Suzie Hubbard Buell Full Cast & Crew Last Season Season 1 1967 | 22 Episodes Season 1 of The Mothers-in-Law premiered on September 10, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Mothers-in-Law. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords in-laws sitcom living with parents Content Score 93 Almost there... Top Contributors 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}