{"link": "https://www.themoviedb.org/tv/64787?language=en", "title": "The Cage of Love", "resume": "Around the beginning of 1900's, Jiang Yu met Wu Cai Hong and was attracted by her kindness and beauty. He unwittingly discovered she was the daughter of his enemy, and her father sudden death made him the primary suspect. Their path crossed in an effort to find the truth. The closer they worked together, the deeper their mutual attraction, and the harder they hid their feelings. Will the truth give them the permission to love, or will it be their end?", "rate": 0, "genre": ["Drama"], "cast": ["Hawick Lau", "Zheng Shuang", "Li Dongxue"], "character": ["Jiang Yu", "Wu Cai Hong", "Zhou Shao Tian"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64787   Expand The Cage of Love   (2015) User Score Overview Around the beginning of 1900's, Jiang Yu met Wu Cai Hong and was attracted by her kindness and beauty. He unwittingly discovered she was the daughter of his enemy, and her father sudden death made him the primary suspect. Their path crossed in an effort to find the truth. The closer they worked together, the deeper their mutual attraction, and the harder they hid their feelings. Will the truth give them the permission to love, or will it be their end? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hawick Lau Jiang Yu Zheng Shuang Wu Cai Hong Li Dongxue Zhou Shao Tian Full Cast & Crew Last Season Season 1 2015 | 34 Episodes Season 1 of The Cage of Love premiered on May 26, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Cage of Love. You can help by rating TV shows you've seen. Facts Original Name  抓住彩虹的男人 Status  Ended Network Zhejiang Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/u/5065288177 Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors M 27 Maria180493 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}