{"link": "https://www.themoviedb.org/tv/67706?language=en", "title": "Hip Hop Evolution", "resume": "Hip-Hop today is a global culture that has changed music, dance, fashion, language —and even politics. But where did this worldwide cultural movement begin? We trace hip-hop back to its humble beginnings, when the kids of the Bronx crammed into house parties, rec rooms, and public parks to hear music like they’d never heard it before.", "rate": 74, "genre": ["Documentary"], "cast": ["Afrika Bambaataa", "Grandmaster Flash", "Ice Cube", "Ice-T"], "character": ["Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67706   Expand Hip Hop Evolution   (2016) User Score Overview Hip-Hop today is a global culture that has changed music, dance, fashion, language —and even politics. But where did this worldwide cultural movement begin? We trace hip-hop back to its humble beginnings, when the kids of the Bronx crammed into house parties, rec rooms, and public parks to hear music like they’d never heard it before. Featured Crew Darby Wheeler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Afrika Bambaataa Himself Grandmaster Flash Himself Ice Cube Himself Ice-T Himself Full Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of Hip Hop Evolution premiered on September  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hip Hop Evolution. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://hiphopevolution.com Genres Documentary Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors a 22 ampun 5 midnightmark 4 Elizabeth Jennings 2 MichelD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}