{"link": "https://www.themoviedb.org/tv/70305?language=en", "title": "My Brother, My Brother and Me", "resume": "A comedy advice show that barely offers any advice (and usually spirals out of control). In each episode, real-life brothers Justin, Travis, and Griffin McElroy pick a question from a viewer and spin it into a ridiculous adventure set in their hometown of Huntington, West Virginia. With cameras in tow, the brothers end up dragging their families, local luminaries, celebrity guests, and supernatural entities into their whirlpool of comedy chaos", "rate": 100, "genre": ["Comedy"], "cast": ["Justin McElroy", "Travis McElroy", "Griffin McElroy"], "character": ["Justin McElroy", "Travis McElroy", "Griffin McElroy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70305   Expand My Brother, My Brother and Me   (2017) User Score  Play Trailer Overview A comedy advice show that barely offers any advice (and usually spirals out of control). In each episode, real-life brothers Justin, Travis, and Griffin McElroy pick a question from a viewer and spin it into a ridiculous adventure set in their hometown of Huntington, West Virginia. With cameras in tow, the brothers end up dragging their families, local luminaries, celebrity guests, and supernatural entities into their whirlpool of comedy chaos Featured Crew Justin McElroy Creator Travis McElroy Creator Griffin McElroy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Justin McElroy Justin McElroy Travis McElroy Travis McElroy Griffin McElroy Griffin McElroy Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of My Brother, My Brother and Me premiered on February 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on My Brother, My Brother and Me. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  27m Homepage   https://www.seeso.com/view/series/my-brother-my-brother-and-me Genres Comedy Keywords brother advice internet family goofy podcast internet celebrity Content Score 71 Just a little bit more... Top Contributors 34 echelon_four 13 Chimpanzee 5 Elizabeth Jennings 4 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}