{"link": "https://www.themoviedb.org/tv/62034?language=en", "title": "Chefs", "resume": "Every year Le Chef (English: The Chef), owner of the restaurant Le Paris, and a figure in French cuisine incorporates a young offender on probation into his team. Romain, just released from prison, arrives in this new world where gastronomy and excellence mix. After a difficult integration, he shows a real talent for cooking and climbs the ranks.", "rate": 47, "genre": ["Comedy", "Drama"], "cast": ["Clovis Cornillac", "Hugo Becker", "Anne Charrier", "Zinedine Soualem", "Anthony Pho"], "character": ["Le Chef", "Romain", "Delphine", "Karim", "Woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62034   Expand Chefs   (2015) User Score Overview Every year Le Chef (English: The Chef), owner of the restaurant Le Paris, and a figure in French cuisine incorporates a young offender on probation into his team. Romain, just released from prison, arrives in this new world where gastronomy and excellence mix. After a difficult integration, he shows a real talent for cooking and climbs the ranks. Featured Crew Arnaud Malherbe Creator Marion Festraëts Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clovis Cornillac Le Chef Hugo Becker Romain Anne Charrier Delphine Zinedine Soualem Karim Anthony Pho Woo Full Cast & Crew Last Season Season 2 2016 | 8 Episodes Season 2 of Chefs premiered on November 22, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Chefs. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  French Runtime  55m Homepage   http://www.france2.fr/emissions/chefs Genres Comedy Drama Keywords france restaurant chef ex-con Content Score 100 Yes! Looking good! Top Contributors 17 Elizabeth Jennings 10 Razorback121 8 Banana W 8 Wark  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}