{"link": "https://www.themoviedb.org/tv/62693?language=en", "title": "Love Through a Millennium", "resume": "Based of the popular Korean drama Queen In Hyun's Man, this Chinese version tells the same story of a love that happens between two people from different eras. Imperial scholar official, Gong Ming accidently time-travels two thousand years into the present where he meets actress Lin Xiang Xiang. Their story is one of love, fate, and commitment.", "rate": 0, "genre": ["Drama"], "cast": ["Jing Boran", "Zheng Shuang", "Nana", "Zhou Yu Tong"], "character": ["Gong Ming", "Lin Xiang Xiang", "Jo Nana", "Lin Yue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62693   Expand Love Through a Millennium   (2015) User Score Overview Based of the popular Korean drama Queen In Hyun's Man, this Chinese version tells the same story of a love that happens between two people from different eras. Imperial scholar official, Gong Ming accidently time-travels two thousand years into the present where he meets actress Lin Xiang Xiang. Their story is one of love, fate, and commitment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jing Boran Gong Ming Zheng Shuang Lin Xiang Xiang Nana Jo Nana Zhou Yu Tong Lin Yue Full Cast & Crew Last Season Season 1 2015 | 22 Episodes Season 1 of Love Through a Millennium premiered on February 15, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Love Through a Millennium. You can help by rating TV shows you've seen. Facts Original Name  相愛穿梭千年 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords time travel Content Score 86 Almost there... Top Contributors M 60 Maria180493 6 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}