{"link": "https://www.themoviedb.org/tv/63854?language=en", "title": "The Fixer", "resume": "NTSB investigator Ellie Molaro, suspicious of the \"official answers” to an oil rig disaster, spearheads a private investigation with a secret tipster named Carter who claims that a conspiracy of “Fixers” are behind the worst disasters in the country, all rigged to manipulate the stock market, and reap billions for a select few.", "rate": 38, "genre": ["Action", "Adventure"], "cast": ["Eric Dane", "Kathleen Robertson", "Kaniehtiio Horn", "Andrew Airlie", "Kyle Switzer"], "character": ["Carter", "Ellie", "Chloe", "Grant", "Tyler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63854   Expand The Fixer   (2015) User Score Overview NTSB investigator Ellie Molaro, suspicious of the \"official answers” to an oil rig disaster, spearheads a private investigation with a secret tipster named Carter who claims that a conspiracy of “Fixers” are behind the worst disasters in the country, all rigged to manipulate the stock market, and reap billions for a select few. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Dane Carter Kathleen Robertson Ellie Kaniehtiio Horn Chloe Andrew Airlie Grant Kyle Switzer Tyler Full Cast & Crew Last Season Season 1 2015 | 4 Episodes Season 1 of The Fixer premiered on September  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Fixer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 21 Elizabeth Jennings S 9 Shady12 az 4 asep zebrag 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}