{"link": "https://www.themoviedb.org/tv/51926?language=en", "title": "The Enemy's Enemy", "resume": "Someone is killing off Swedish military officers and making it look like the works of Soviet agents. Hamilton has to crack the case before all hell breaks loose and there is a full scale spy-war with the soviets.", "rate": 65, "genre": [], "cast": ["Kjell Lennartsson", "Peter Haber", "Maria Grip", "Sture Djerf", "Bernt Lindqvist"], "character": ["Ulfsson", "Carl Hamilton", "Eva-Britt Jönsson", "DG", "Näslund"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51926   Expand The Enemy's Enemy   (1990) User Score Overview Someone is killing off Swedish military officers and making it look like the works of Soviet agents. Hamilton has to crack the case before all hell breaks loose and there is a full scale spy-war with the soviets. Featured Crew Jan Guillou Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kjell Lennartsson Ulfsson Peter Haber Carl Hamilton Maria Grip Eva-Britt Jönsson Sture Djerf DG Bernt Lindqvist Näslund Full Cast & Crew Last Season Season 1 1990 | 8 Episodes Season 1 of The Enemy's Enemy premiered on December  8, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on The Enemy's Enemy. You can help by rating TV shows you've seen. Facts Original Name  Fiendens fiende Status  Ended Networks - Certification  - Type  Scripted Original Language  Swedish Runtime  8m Homepage  - Genres No genres have been added. Keywords miniseries Content Score 86 Almost there... Top Contributors TB 12 TMDb Bot t 10 tiggly B 8 Blixtgoran c 1 christeevee  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}