{"link": "https://www.themoviedb.org/tv/5178?language=en", "title": "Stairway to Heaven", "resume": "Stairway to Heaven is a 2003 South Korean television series starring Choi Ji-woo, Kwon Sang-woo, Kim Tae-hee, and Shin Hyun-joon. It aired on SBS from December 3, 2003 to February 5, 2004 on Wednesdays and Thursdays at 21:55 for 20 episodes. The hit drama received an average viewership rating of 38.8%, and 45.3% for the finale.", "rate": 60, "genre": ["Drama"], "cast": ["Choi Ji-woo", "Kim Tae-hee", "Shin Hyun-joon", "Lee Wan", "Park Shin-hye"], "character": ["Han Jeong-Seo", "Han Yuri", "Han Tae-hwa", "Han Tae-hwa", "Han Jeong-Seo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5178   Expand Stairway to Heaven   (2003) User Score Overview Stairway to Heaven is a 2003 South Korean television series starring Choi Ji-woo, Kwon Sang-woo, Kim Tae-hee, and Shin Hyun-joon. It aired on SBS from December 3, 2003 to February 5, 2004 on Wednesdays and Thursdays at 21:55 for 20 episodes. The hit drama received an average viewership rating of 38.8%, and 45.3% for the finale. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Ji-woo Han Jeong-Seo Kim Tae-hee Han Yuri Shin Hyun-joon Han Tae-hwa Lee Wan Han Tae-hwa Park Shin-hye Han Jeong-Seo Full Cast & Crew Last Season Season 1 2003 | 20 Episodes Season 1 of Stairway to Heaven premiered on December  3, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Stairway to Heaven. You can help by rating TV shows you've seen. Facts Original Name  천국의 계단 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.tv.sbs.co.kr/paradise/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 10 Nightowl.Kr z 5 zurman1 3 lareina123 3 SkullCollector  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}