{"link": "https://www.themoviedb.org/tv/69407?language=en", "title": "The Memorandum of Kyoko Okitegami", "resume": "Okitegami Kyoko is a beautiful private detective who has a deep love for money. She is also known as the Forgetful Detective. Her memory is reset when she sleeps at night, which means she can strictly adhere to confidentiality requirements. She solves all her cases within a day, whatever they may be. She is the world's fastest detective! There is something really important that Kyoko must never forget, and it is written on her body with a magic pen.\n“I am Okitegami Kyoko, detective. My memory is reset after one day.”\nMeanwhile, even though Yakusuke Kakushidate has a crush on Kyoko Okitegami, he is always mistaken by her as the culprit of a case. No matter how close he gets to Kyoko, she totally forgets about him by the next day.", "rate": 80, "genre": ["Drama", "Mystery"], "cast": ["Yui Aragaki", "Masaki Okada", "Mitsuhiro Oikawa", "Daiki Arioka", "Rio Uchida"], "character": ["Kyoko Okitegami", "Yakusuke Kakushidate", "Horo Kizunai", "Nuru Narikawa", "Makuru Makuma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69407   Expand The Memorandum of Kyoko Okitegami   (2015) User Score Overview Okitegami Kyoko is a beautiful private detective who has a deep love for money. She is also known as the Forgetful Detective. Her memory is reset when she sleeps at night, which means she can strictly adhere to confidentiality requirements. She solves all her cases within a day, whatever they may be. She is the world's fastest detective! There is something really important that Kyoko must never forget, and it is written on her body with a magic pen. “I am Okitegami Kyoko, detective. My memory is reset after one day.” Meanwhile, even though Yakusuke Kakushidate has a crush on Kyoko Okitegami, he is always mistaken by her as the culprit of a case. No matter how close he gets to Kyoko, she totally forgets about him by the next day. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yui Aragaki Kyoko Okitegami Masaki Okada Yakusuke Kakushidate Mitsuhiro Oikawa Horo Kizunai Daiki Arioka Nuru Narikawa Rio Uchida Makuru Makuma Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of The Memorandum of Kyoko Okitegami premiered on October 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-04-14 Public Affairs Office in the Sky 8.0    2011-07-11 Full Throttle Girl 7.6    2016-10-11 We married as a job! 8.3  Facts Original Name  掟上今日子の備忘録 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  57m Homepage  - Genres Drama Mystery Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 12 tmdb983464 7 Danu t 7 taxigps 6 MundoAsian  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}