{"link": "https://www.themoviedb.org/tv/2017?language=en", "title": "Phantom 2040", "resume": "Phantom 2040 is a French-American animated science fiction television series loosely based on the comic strip hero The Phantom, created by Lee Falk. The central character of the series is said to be the 24th Phantom. The unusual character designs are the work of Peter Chung, creator of Æon Flux.\nThe show debuted in 1994 to rave reviews, though it survived only 35 episodes before it was relegated to weekend repeats in 1996. Along with action sequences, stories focused on intelligent plotting and character development, winning the series praise for its subtle teaching of such values as individuality, freedom, and the volatility of humanity. It also spawned comic books tie-ins and other merchandise.\nFeatured voice actors included Scott Valentine, Margot Kidder, Ron Perlman, and Jeff Bennett, while Mark Hamill, Debbie Harry, Rob Paulsen, and Paul Williams had recurring roles.", "rate": 70, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Scott Valentine", "Carrie Snodgress", "Harlan Ellison", "Jeff Bennett", "Margot Kidder"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2017   Expand Phantom 2040   (1994) User Score Overview Phantom 2040 is a French-American animated science fiction television series loosely based on the comic strip hero The Phantom, created by Lee Falk. The central character of the series is said to be the 24th Phantom. The unusual character designs are the work of Peter Chung, creator of Æon Flux. The show debuted in 1994 to rave reviews, though it survived only 35 episodes before it was relegated to weekend repeats in 1996. Along with action sequences, stories focused on intelligent plotting and character development, winning the series praise for its subtle teaching of such values as individuality, freedom, and the volatility of humanity. It also spawned comic books tie-ins and other merchandise. Featured voice actors included Scott Valentine, Margot Kidder, Ron Perlman, and Jeff Bennett, while Mark Hamill, Debbie Harry, Rob Paulsen, and Paul Williams had recurring roles. Featured Crew Lee Falk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Scott Valentine Carrie Snodgress Harlan Ellison Jeff Bennett Margot Kidder Full Cast & Crew Last Season Season 2 — | 15 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Phantom 2040. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 5 Евгений BF 2 Blue Flinko W 1 WaLLY  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}