{"link": "https://www.themoviedb.org/tv/62823?language=en", "title": "Scream", "resume": "What starts as a YouTube video going viral, soon leads to problems for the teenagers of Lakewood and serves as the catalyst for a murder that opens up a window to the town's troubled past. Everyone has secrets. Everyone tells lies. Everyone is fair game.", "rate": 64, "genre": ["Horror"], "cast": ["Willa Fitzgerald", "Bex Taylor-Klaus", "Carlson Young", "John Karna", "Amadeus Serafini"], "character": ["Emma Duvall", "Audrey Jensen", "Brooke Maddox", "Noah Foster", "Kieran Wilcox"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62823   Expand Scream   (2015) User Score  Play Trailer Overview What starts as a YouTube video going viral, soon leads to problems for the teenagers of Lakewood and serves as the catalyst for a murder that opens up a window to the town's troubled past. Everyone has secrets. Everyone tells lies. Everyone is fair game. Featured Crew Jay Beattie Creator Dan Dworkin Creator Jill E. Blotevogel Creator Wes Craven Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  10 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Willa Fitzgerald Emma Duvall Bex Taylor-Klaus Audrey Jensen Carlson Young Brooke Maddox John Karna Noah Foster Amadeus Serafini Kieran Wilcox Full Cast & Crew Last Season Season 2 2016 | 12 Episodes Season 2 of Scream premiered on May 30, 2016. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply w Noah: Happy Birthday John Karna! Open 0 by wonder2wonder\n      \n     OMG horrible news... Tyga has been added to the cast and it won't premiere until March 2018 Open 1 by  poweranimals p Any idea when season 3 starts? Open 1 by  Hulkus Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  7 Recommendations   2015-09-22 Scream Queens 6.3    2016-03-04 Slasher 6.0    2016-06-28 Dead of Summer 5.3    2015-05-21 Between 5.4    2013-04-19 Hemlock Grove 6.4    2017-02-03 Santa Clarita Diet 7.3    2016-09-22 Easy 5.3    2013-03-18 Bates Motel 7.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.mtv.com/shows/scream/ Genres Horror Keywords high school murder serial killer teenager based on movie Content Score 100 Yes! Looking good! Top Contributors 63 Banana 57 Elizabeth Jennings 15 niqo19 e 11 em20  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}