{"link": "https://www.themoviedb.org/tv/287?language=en", "title": "Murder in Mind", "resume": "Murder in Mind is a British television thriller drama anthology series of self-contained stories with a murderous theme seen from the perspective of the murderer.\nIt was created by Anthony Horowitz, and broadcast on BBC One from 2001 to 2003. It included guest stars in every episode and it ran for three series, for a total of twenty-three episodes.", "rate": 88, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 287   Expand Murder in Mind   (2001) User Score Overview Murder in Mind is a British television thriller drama anthology series of self-contained stories with a murderous theme seen from the perspective of the murderer. It was created by Anthony Horowitz, and broadcast on BBC One from 2001 to 2003. It included guest stars in every episode and it ran for three series, for a total of twenty-three episodes. Featured Crew Anthony Horowitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2003 | 8 Episodes Season 3 of Murder in Mind premiered on January 25, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Murder in Mind. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/drama/murder_in_mind.shtml Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 3 rudely_murray k 1 kluder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}