{"link": "https://www.themoviedb.org/tv/52542?language=en", "title": "My Beloved Mafia", "resume": "Chun and Pat Boung meet unexpectedly in a mall and Pat Boung and her friend saves Chun from a mafia group in Thailand while he was visiting on a business trip. He returns home safely to Hong Kong and is just amazed and intrigued by her. So he sends one of his men to find out about this girl.\nChun is now the leader of a mafia, but was only inherited into the mafia because he was an orphan and he was his adopted sister's father. He becomes loyal and shows leadership.\nPat Boung's dad is a very known man in Thai society, but he unfortunately gets hooked onto gambling in Chun's casino in Hong Kong. Chuun figures out that the man was Pat Boung's father. He gets the man into big debt with them, he manipulates Pat Boung's father to sell her to him and he promises that he will not harm his daughter in anyway and seemed liked a good man to Pat Boung's father.\nSo he gets the money he sold his daughter for thinking that he would gamble it and get all the money he owned back and then the deal could be forgotten and he could have his daughter back. At this time, he loses all the money again and ends up in bigger debt than before but this time with no daughter. He returns to Thailand, but before he gets there Chun sends his men for Pat Boung in Thailand.\nChun's bodyguards Chen Hao and Ban are sent to get Pak Boung but in the process of going back to Hong Kong, Pak Boung manages to escape the two bodyguards and she is saved by Min. She thinks she has nothing left in her life because of what her father has done and that they are so far in debt she is a lost soul. Min decides to take Pak Boung in and take care her as if she was his wife but what Pat Boung and Min doesn't know is that Chun's bodyguard already found them. She falls in love with him because he is the only one that is there that cares for her. She and Min fall in love, but that doesn't stop Chun. He finds her and takes her from Min. Min goes to Hong Kong and tries to get Pat Boung back in numerous times, but doesn't succeed.\nDuring the process while Pat Boung is forced to live with this \"cold hearted\" man, she tries every available way to escape Chun to get back to Min. In the process of trying to escape from Chun, she sees that he is not just cold hearted man that he also a very caring man. Unable to get close and help Pak Boung, Min decides to manipulate Chun's little sister Gye' Yhong to get back at Chun for taking Pak Boung from him. As time goes by, Pak Boung starts to fall in love with Chun as Yong starting to fall in love with Min but just as their relationships starts to mend its gets even more complicated when Chun's childhood lover, Lilly, comes back and stir up more trouble for all the couples...", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Chakrit Yamnarm", "Napapa Thantrakul", "Tridsadee Sahawong", "Pitta Na Pattalung", "Giorgio Maiocchi"], "character": ["Peter Chen/Chen Ling", "Pak Boong", "Min", "Dter Yong", "Ball"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52542   Expand My Beloved Mafia   (2007) User Score  Play Trailer Overview Chun and Pat Boung meet unexpectedly in a mall and Pat Boung and her friend saves Chun from a mafia group in Thailand while he was visiting on a business trip. He returns home safely to Hong Kong and is just amazed and intrigued by her. So he sends one of his men to find out about this girl. Chun is now the leader of a mafia, but was only inherited into the mafia because he was an orphan and he was his adopted sister's father. He becomes loyal and shows leadership. Pat Boung's dad is a very known man in Thai society, but he unfortunately gets hooked onto gambling in Chun's casino in Hong Kong. Chuun figures out that the man was Pat Boung's father. He gets the man into big debt with them, he manipulates Pat Boung's father to sell her to him and he promises that he will not harm his daughter in anyway and seemed liked a good man to Pat Boung's father. So he gets the money he sold his daughter for thinking that he would gamble it and get all the money he owned back and then the deal could be forgotten and he could have his daughter back. At this time, he loses all the money again and ends up in bigger debt than before but this time with no daughter. He returns to Thailand, but before he gets there Chun sends his men for Pat Boung in Thailand. Chun's bodyguards Chen Hao and Ban are sent to get Pak Boung but in the process of going back to Hong Kong, Pak Boung manages to escape the two bodyguards and she is saved by Min. She thinks she has nothing left in her life because of what her father has done and that they are so far in debt she is a lost soul. Min decides to take Pak Boung in and take care her as if she was his wife but what Pat Boung and Min doesn't know is that Chun's bodyguard already found them. She falls in love with him because he is the only one that is there that cares for her. She and Min fall in love, but that doesn't stop Chun. He finds her and takes her from Min. Min goes to Hong Kong and tries to get Pat Boung back in numerous times, but doesn't succeed. During the process while Pat Boung is forced to live with this \"cold hearted\" man, she tries every available way to escape Chun to get back to Min. In the process of trying to escape from Chun, she sees that he is not just cold hearted man that he also a very caring man. Unable to get close and help Pak Boung, Min decides to manipulate Chun's little sister Gye' Yhong to get back at Chun for taking Pak Boung from him. As time goes by, Pak Boung starts to fall in love with Chun as Yong starting to fall in love with Min but just as their relationships starts to mend its gets even more complicated when Chun's childhood lover, Lilly, comes back and stir up more trouble for all the couples... Featured Crew Medta Lae Mahaniyom Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chakrit Yamnarm Peter Chen/Chen Ling Napapa Thantrakul Pak Boong Tridsadee Sahawong Min Pitta Na Pattalung Dter Yong Giorgio Maiocchi Ball Full Cast & Crew Last Season Season 1 2007 | 15 Episodes Season 1 of My Beloved Mafia premiered on October  1, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Beloved Mafia. You can help by rating TV shows you've seen. Facts Original Name  มาเฟียที่รัก Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  86m Homepage   http://www.thaitv3.com/%E0%B9%81%E0%B8%9F%E0%B8%8A%E0%B8%B1%E0%B9%88%E0%B8%99/70/%E0%B8%A1%E0%B8%B2%E0%B9%80%E0%B8%9F%E0%B8%B5%E0%B8%A2%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A3%E0%B8%B1%E0%B8%81.html Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 41 Crip 7 Elizabeth Jennings TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}