{"link": "https://www.themoviedb.org/tv/3173?language=en", "title": "The Chris Isaak Show", "resume": "The Chris Isaak Show is a television sitcom which follows a fictionalized version of the life of American rock musician Chris Isaak. The show portrays Isaak and his band members as everyday people with everyday problems. The series was produced for the Showtime channel from 2001–2004, and was filmed in Vancouver, Canada, which stands in for the show's home setting of San Francisco.\nThe series featured Isaak and several members of his band, Silvertone, portraying themselves. Other roles were portrayed by actors, including Jed Rees as Isaak's keyboardist. Rees was hired in place of Isaak's actual keyboardist Brett Tuggle to add some comedy to the show. Other characters featured on the show include Yola Gaylen, Isaak's manager and her colleague, Cody Kurtzman. The final regular character, Mona, appears as a mermaid-of-sorts who lies nude on a revolving circular bed in the basement of Bimbo's, a club Isaak frequents. She typically talks only with Isaak, acting as his conscience or a sounding board for him.", "rate": 80, "genre": ["Comedy"], "cast": ["Chris Isaak", "Jennifer Calvert", "Kristin Dattilo", "Rowland Salley", "Hershel Yatovitz"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3173   Expand The Chris Isaak Show   (2001) User Score Overview The Chris Isaak Show is a television sitcom which follows a fictionalized version of the life of American rock musician Chris Isaak. The show portrays Isaak and his band members as everyday people with everyday problems. The series was produced for the Showtime channel from 2001–2004, and was filmed in Vancouver, Canada, which stands in for the show's home setting of San Francisco. The series featured Isaak and several members of his band, Silvertone, portraying themselves. Other roles were portrayed by actors, including Jed Rees as Isaak's keyboardist. Rees was hired in place of Isaak's actual keyboardist Brett Tuggle to add some comedy to the show. Other characters featured on the show include Yola Gaylen, Isaak's manager and her colleague, Cody Kurtzman. The final regular character, Mona, appears as a mermaid-of-sorts who lies nude on a revolving circular bed in the basement of Bimbo's, a club Isaak frequents. She typically talks only with Isaak, acting as his conscience or a sounding board for him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Isaak Jennifer Calvert Kristin Dattilo Rowland Salley Hershel Yatovitz Full Cast & Crew Last Season Season 3 2004 | 10 Episodes Season 3 of The Chris Isaak Show premiered on January  8, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Chris Isaak Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Comedy Keywords rock star music band sitcom Content Score 86 Almost there... Top Contributors 5 Banana 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}