{"link": "https://www.themoviedb.org/tv/21755?language=en", "title": "Pawn Stars", "resume": "Pawn Stars is an American reality television series, shown on History, and produced by Leftfield Pictures. The series is filmed in Las Vegas, Nevada, where it chronicles the daily activities at the World Famous Gold & Silver Pawn Shop, a 24-hour family business opened in 1989 and operated by patriarch Richard \"Old Man\" Harrison, his son Rick Harrison, Rick's son Corey \"Big Hoss\" Harrison, and Corey's childhood friend, Austin \"Chumlee\" Russell. The show, which became the network's highest rated show, and the No. 2 reality show behind Jersey Shore, debuted on July 26, 2009. Reruns can be seen on History as well as its sister network Lifetime, which added the show in December 2010.\nThe series depicts the staff's interactions with customers, who bring in a variety of artifacts to sell or pawn and who are shown haggling over the price and discussing its historical background, with narration provided by the Harrisons and occasionally Chumlee. The series also follows the interpersonal conflicts among the cast. One reviewer referencing these conflicts described the show as a version of Antiques Roadshow \"hijacked by American Chopper's\" Teutul family. TV Guide has offered a similar description, calling the show \"one part Antiques Roadshow, a pinch of LA Ink and a dash of COPS\".", "rate": 63, "genre": ["Comedy", "Reality"], "cast": ["Richard Benjamin Harrison", "Rick Harrison", "Austin Lee Russell", "Corey Harrison"], "character": ["Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21755   Expand Pawn Stars   (2009) User Score  Play Trailer Overview Pawn Stars is an American reality television series, shown on History, and produced by Leftfield Pictures. The series is filmed in Las Vegas, Nevada, where it chronicles the daily activities at the World Famous Gold & Silver Pawn Shop, a 24-hour family business opened in 1989 and operated by patriarch Richard \"Old Man\" Harrison, his son Rick Harrison, Rick's son Corey \"Big Hoss\" Harrison, and Corey's childhood friend, Austin \"Chumlee\" Russell. The show, which became the network's highest rated show, and the No. 2 reality show behind Jersey Shore, debuted on July 26, 2009. Reruns can be seen on History as well as its sister network Lifetime, which added the show in December 2010. The series depicts the staff's interactions with customers, who bring in a variety of artifacts to sell or pawn and who are shown haggling over the price and discussing its historical background, with narration provided by the Harrisons and occasionally Chumlee. The series also follows the interpersonal conflicts among the cast. One reviewer referencing these conflicts described the show as a version of Antiques Roadshow \"hijacked by American Chopper's\" Teutul family. TV Guide has offered a similar description, calling the show \"one part Antiques Roadshow, a pinch of LA Ink and a dash of COPS\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  3 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Benjamin Harrison Himself Rick Harrison Himself Austin Lee Russell Himself Corey Harrison Himself Full Cast & Crew Current Season Season 15 2017 | 29 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply There are no discussions for Pawn Stars. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  6 Recommendations   2010-12-01 Storage Wars 5.3    2010-01-18 American Pickers 7.4    2010-10-25 American Restoration 6.1    2010-08-16 Hardcore Pawn 4.2    2001-01-06 How It's Made 7.4    2005-07-19 Miami Ink 6.0    2009-08-24 Hoarders 6.2    2010-11-09 Auction Hunters 5.0  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  30m, 23m Homepage   http://www.history.com/shows/pawn-stars Genres Comedy Reality Keywords dysfunctional family pawnshop negotiator Content Score 93 Almost there... Top Contributors 44 Kampfader 24 Elizabeth Jennings q 20 qpr1991 19 Nippi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}