{"link": "https://www.themoviedb.org/tv/9567?language=en", "title": "Closer to Truth", "resume": "Closer to Truth is a continuing television series on PBS & public television originally created, produced and hosted by Robert Lawrence Kuhn. The first premiere series aired in 2000 for 2 seasons, followed by a second series aired in 2003 for a single season.\nThe current / third series of the program, Closer to Truth: Cosmos. Consciousness. God., launched in 2008, with 12 full seasons to date. Robert Lawrence Kuhn is the creator, executive producer, writer and presenter of the series. Peter Getzels is the co-creator and producer / director.\nThe show is centered on on-camera conversations with leading scientists, philosophers, theologians, and scholars, covering a diverse range of topics or questions from the size and nature of the universe, to the existence and essence of God, to the mystery of consciousness and the notion of free will.", "rate": 40, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9567   Expand Closer to Truth   (2000) User Score Overview Closer to Truth is a continuing television series on PBS & public television originally created, produced and hosted by Robert Lawrence Kuhn. The first premiere series aired in 2000 for 2 seasons, followed by a second series aired in 2003 for a single season. The current / third series of the program, Closer to Truth: Cosmos. Consciousness. God., launched in 2008, with 12 full seasons to date. Robert Lawrence Kuhn is the creator, executive producer, writer and presenter of the series. Peter Getzels is the co-creator and producer / director. The show is centered on on-camera conversations with leading scientists, philosophers, theologians, and scholars, covering a diverse range of topics or questions from the size and nature of the universe, to the existence and essence of God, to the mystery of consciousness and the notion of free will. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 14 2012 | 11 Episodes Season 14 of Closer to Truth premiered on November 10, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply It's worse than a drunken dorm-room bull session among freshman philosophy majors Open 0 by Moon Doggie\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Closer to Truth. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors k 1 karina_petrova 1 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}