{"link": "https://www.themoviedb.org/tv/14619?language=en", "title": "Pond Life", "resume": "Pond Life is a British animated television series that was written and directed by Candy Guard and follows the misadventures of its neurotic and self-obsessed protagonist, Dolly Pond. Two series were broadcast on Channel 4 in 1996 and 2000. A series of 13x15minute episodes was screened from 3 to 18 December 1996, mainly at 5.45pm, but two episodes exploring more adult themes were reserved for a double screening at 11.25pm. This series was repeated between March and June 1998. A second series of 7x30minute episodes followed between 19–30 September 2000 to tie-in with Channel 4's Animation Week of 23–29 September 2000.\nThe series began life in 1992 with a pilot episode entitled I Want a Boyfriend ... Or Do I?, co-commissioned by Channel 4 and S4C.\nPond Life was Guard's second breakthrough and was commissioned by Channel 4 in 1996. Scheduling problems marred the series' reception; it was originally intended for broadcast at 9.45pm, but was shown four hours earlier, which required edits to remove adult language. It was shown at the same time as Australian soap Neighbours, and was aimed at the same core audience as the soap. Despite these problems, Pond Life won several awards and received a Writer's Guild nomination for Best Sitcom. Guard was pleased because it was up against several live-action comedy series, including Only Fools and Horses. A second series was broadcast in 2000.", "rate": 90, "genre": ["Animation"], "cast": ["Brian Murphy", "Dominic Guard", "Charlotte Mitchell", "John Thomson", "Emma Chambers"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14619   Expand Pond Life   (1996) User Score Overview Pond Life is a British animated television series that was written and directed by Candy Guard and follows the misadventures of its neurotic and self-obsessed protagonist, Dolly Pond. Two series were broadcast on Channel 4 in 1996 and 2000. A series of 13x15minute episodes was screened from 3 to 18 December 1996, mainly at 5.45pm, but two episodes exploring more adult themes were reserved for a double screening at 11.25pm. This series was repeated between March and June 1998. A second series of 7x30minute episodes followed between 19–30 September 2000 to tie-in with Channel 4's Animation Week of 23–29 September 2000. The series began life in 1992 with a pilot episode entitled I Want a Boyfriend ... Or Do I?, co-commissioned by Channel 4 and S4C. Pond Life was Guard's second breakthrough and was commissioned by Channel 4 in 1996. Scheduling problems marred the series' reception; it was originally intended for broadcast at 9.45pm, but was shown four hours earlier, which required edits to remove adult language. It was shown at the same time as Australian soap Neighbours, and was aimed at the same core audience as the soap. Despite these problems, Pond Life won several awards and received a Writer's Guild nomination for Best Sitcom. Guard was pleased because it was up against several live-action comedy series, including Only Fools and Horses. A second series was broadcast in 2000. Featured Crew Candy Guard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Murphy Dominic Guard Charlotte Mitchell John Thomson Emma Chambers Full Cast & Crew Last Season Season 2 2000 | 8 Episodes Season 2 of Pond Life premiered on September 19, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pond Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords women pub flat cartoon shop dysfunctional family romance animation best friend thirty something neurotic british humour single woman cul-de-sac hand drawn Content Score 100 Yes! Looking good! Top Contributors 18 Charlie Powell L 2 Law TB 1 TMDb Bot O 1 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}