{"link": "https://www.themoviedb.org/tv/7398?language=en", "title": "When We Left Earth: The NASA Missions", "resume": "When We Left Earth: The NASA Missions or NASA's Greatest Missions: When We Left Earth in the UK is a Discovery Channel HD documentary miniseries consisting of six episodes documenting American human spaceflight, spanning from the first Mercury flights through the Gemini program to the Apollo moon landings, the Space Shuttle, and the construction of the International Space Station. It was created in association with NASA to commemorate the agency's fiftieth anniversary in 2008. It first aired on June 8, 2008, and concluded on June 22. Each airing consisted of two hour-long episodes.\nThe miniseries was released on DVD on July 10, 2008, and was released on Blu-ray disc on August 12.\nThe third episode, \"Landing the Eagle\", was re-aired on July 20, 2009 for the 40th anniversary of the Apollo 11 moon landing. It featured improved images from the moonwalk.", "rate": 84, "genre": ["Documentary"], "cast": ["Eugene Cernan", "Gary Sinise"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7398   Expand When We Left Earth: The NASA Missions   (2008) User Score Overview When We Left Earth: The NASA Missions or NASA's Greatest Missions: When We Left Earth in the UK is a Discovery Channel HD documentary miniseries consisting of six episodes documenting American human spaceflight, spanning from the first Mercury flights through the Gemini program to the Apollo moon landings, the Space Shuttle, and the construction of the International Space Station. It was created in association with NASA to commemorate the agency's fiftieth anniversary in 2008. It first aired on June 8, 2008, and concluded on June 22. Each airing consisted of two hour-long episodes. The miniseries was released on DVD on July 10, 2008, and was released on Blu-ray disc on August 12. The third episode, \"Landing the Eagle\", was re-aired on July 20, 2009 for the 40th anniversary of the Apollo 11 moon landing. It featured improved images from the moonwalk. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eugene Cernan Gary Sinise Full Cast & Crew Last Season Season 1 2008 | 6 Episodes Season 1 of When We Left Earth: The NASA Missions premiered on June  8, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   1998-04-05 From the Earth to the Moon 8.3    2009-10-06 30 for 30 7.5    2004-07-21 Rescue Me 7.6    1991-09-08 Darkwing Duck 7.3    2000-02-27 The 10th Kingdom 7.5    1980-09-28 Cosmos: A Personal Voyage 8.2    2007-06-17 Flight of the Conchords 7.9    2009-02-15 Eastbound & Down 7.4  Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  120m Homepage   http://dsc.discovery.com/tv/nasa/nasa.html Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors m 5 misak0007 5 Fludogenerator f 4 flashcg M 3 Markus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}