{"link": "https://www.themoviedb.org/tv/16908?language=en", "title": "Les Filles de Caleb", "resume": "Les Filles de Caleb is a Quebec TV series of 20 one-hour episodes, created by Jean Beaudin, based on the eponymous novel of Arlette Cousture, broadcast in 1990 on Radio-Canada and repeated in 2006 on Prise 2.", "rate": 10, "genre": ["Drama"], "cast": ["Johanne-Marie Tremblay", "Marina Orsini", "Roy Dupuis", "Vincent Bolduc", "Germain Houde"], "character": ["Célina Bordeleau", "Émilie Bordeleau", "Ovila Pronovost", "Napoléon Bordeleau", "Caleb Bordeleau"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16908   Expand Les Filles de Caleb   (1990) User Score Overview Les Filles de Caleb is a Quebec TV series of 20 one-hour episodes, created by Jean Beaudin, based on the eponymous novel of Arlette Cousture, broadcast in 1990 on Radio-Canada and repeated in 2006 on Prise 2. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Johanne-Marie Tremblay Célina Bordeleau Marina Orsini Émilie Bordeleau Roy Dupuis Ovila Pronovost Vincent Bolduc Napoléon Bordeleau Germain Houde Caleb Bordeleau Full Cast & Crew Last Season Season 1 1990 | 20 Episodes Season 1 of Les Filles de Caleb premiered on October 18, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Les Filles de Caleb. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  60m Homepage  - Genres Drama Keywords quebec rural setting 19th century téléroman Content Score 86 Almost there... Top Contributors 31 Banana M 2 MarioCine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}