{"link": "https://www.themoviedb.org/tv/43410?language=en", "title": "Baby Faced Beauty", "resume": "Baby Faced Beauty is a 2011 South Korean television series starring Jang Na-ra, Choi Daniel, Ryu Jin, and Kim Min-seo. It aired on KBS2 from May 2 to July 5, 2011 on Mondays and Tuesdays at 21:55 for 20 episodes. The drama is about an aspiring 34-year-old fashion designer who fakes her age to get a job in a fashion company.\nThe romantic comedy had kicked off with a viewership rating of around 6 percent, but gradually rose and surpassed the 15 percent mark. Originally slated for 18 episodes, it was extended by 2 more episodes due to its popularity. It ranked number one in its primetime timeslot for five consecutive weeks.", "rate": 45, "genre": ["Comedy", "Romance"], "cast": ["Choi Daniel", "Jang Na-ra", "Ryu Jin", "Kim Min-seo", "Clara Lee"], "character": ["Choi Jin-wook", "Lee So-young", "Ji Seung-il", "Kang Yoon-seo", "Choi Seul-ah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43410   Expand Baby Faced Beauty   (2011) User Score Overview Baby Faced Beauty is a 2011 South Korean television series starring Jang Na-ra, Choi Daniel, Ryu Jin, and Kim Min-seo. It aired on KBS2 from May 2 to July 5, 2011 on Mondays and Tuesdays at 21:55 for 20 episodes. The drama is about an aspiring 34-year-old fashion designer who fakes her age to get a job in a fashion company. The romantic comedy had kicked off with a viewership rating of around 6 percent, but gradually rose and surpassed the 15 percent mark. Originally slated for 18 episodes, it was extended by 2 more episodes due to its popularity. It ranked number one in its primetime timeslot for five consecutive weeks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Daniel Choi Jin-wook Jang Na-ra Lee So-young Ryu Jin Ji Seung-il Kim Min-seo Kang Yoon-seo Clara Lee Choi Seul-ah Full Cast & Crew Last Season Season 1 2011 | 20 Episodes Season 1 of Baby Faced Beauty premiered on May  2, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Baby Faced Beauty. You can help by rating TV shows you've seen. Facts Original Name  동안미녀 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/babyface/ Genres Comedy Romance Keywords korea Content Score 86 Almost there... Top Contributors t 31 tmdb38202327 M 7 Maria180493 z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}