{"link": "https://www.themoviedb.org/tv/68780?language=en", "title": "Star", "resume": "Star is a tough-as-nails young woman who came up in the foster care system and decides one day to take control of her destiny. She tracks down her sister, Simone, and her Instagram bestie, Alexandra, and together, the trio journeys to Atlanta with the hope of becoming music superstars.", "rate": 71, "genre": ["Drama"], "cast": ["Jude Demorest", "Ryan Destiny", "Amiyah Scott", "Queen Latifah", "Benjamin Bratt"], "character": ["Star Davis", "Alexandra", "Cotton", "Carlotta Brown", "Jahil Rivera"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68780   Expand Star   (2016) User Score  Play Trailer Overview Star is a tough-as-nails young woman who came up in the foster care system and decides one day to take control of her destiny. She tracks down her sister, Simone, and her Instagram bestie, Alexandra, and together, the trio journeys to Atlanta with the hope of becoming music superstars. Featured Crew Lee Daniels Creator Tom Donaghy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jude Demorest Star Davis Ryan Destiny Alexandra Amiyah Scott Cotton Queen Latifah Carlotta Brown Benjamin Bratt Jahil Rivera Full Cast & Crew Last Season Season 2 2017 | 18 Episodes Season 2 of Star premiered on September 26, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply n Did they show Alexandra um, pleasuring herself in the shower? Open 0 by nemo69\n      \n     Yeah, I'm shocked I watch this Open 8 by  ScorpionQ2 Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   2016-03-13 Houdini & Doyle 5.7    2014-01-07 Being Mary Jane 7.7    2018-03-18 Instinct 5.9    2016-10-27 Pure Genius 6.7    2016-09-22 Notorious 5.8    2016-06-21 Greenleaf 6.8    2016-01-07 Shades of Blue 6.2    2016-03-16 Criminal Minds: Beyond Borders 5.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://fox.com/star Genres Drama Keywords music atlanta Content Score 100 Yes! Looking good! Top Contributors 66 Banana 12 Elizabeth Jennings m 8 misfit_noel b 7 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}