{"link": "https://www.themoviedb.org/tv/63129?language=en", "title": "Nightwing: The Series", "resume": "The story of Batman's former sidekick, Dick Grayson aka Robin. After a falling out with his mentor, Dick abandons Gotham and everyone in it. Emerging in the City of Bludhaven years later, Dick takes on the guise of \"Nightwing” easily defeating the petty criminals who infest it. But he soon realizes he may have bitten off more than he can chew when a mysterious and dangerous assassin only known as ‘Deathstroke, begins targeting Bludhaven citizens. Can he defend his new home and the lives of it's inhabitants from the most dangerous foe he’s ever faced!? Only time will tell in this epic 5 part mini-series!", "rate": 78, "genre": ["Action", "Adventure"], "cast": ["Bob Lee Dysinger", "Deana Deatherage", "Sabrea Lawrence", "Lenna Karacostas", "Noel Schefflin"], "character": ["Slade Wilson / Deathstroke", "Vesper Fairchild", "Jazz Singer", "Barbara Gordon / Oracle", "Jason Todd / Red Hood / Robin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63129   Expand Nightwing: The Series   (2014) User Score Overview The story of Batman's former sidekick, Dick Grayson aka Robin. After a falling out with his mentor, Dick abandons Gotham and everyone in it. Emerging in the City of Bludhaven years later, Dick takes on the guise of \"Nightwing” easily defeating the petty criminals who infest it. But he soon realizes he may have bitten off more than he can chew when a mysterious and dangerous assassin only known as ‘Deathstroke, begins targeting Bludhaven citizens. Can he defend his new home and the lives of it's inhabitants from the most dangerous foe he’s ever faced!? Only time will tell in this epic 5 part mini-series! Featured Crew Danny Shepherd Creator Jeremy Le Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Lee Dysinger Slade Wilson / Deathstroke Deana Deatherage Vesper Fairchild Sabrea Lawrence Jazz Singer Lenna Karacostas Barbara Gordon / Oracle Noel Schefflin Jason Todd / Red Hood / Robin Full Cast & Crew Last Season Season 1 2014 | 5 Episodes Season 1 of Nightwing: The Series premiered on September 29, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Nightwing: The Series. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2014-11-03 Over the Garden Wall 8.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Action & Adventure Keywords dc comics superhero miniseries fan film Content Score 93 Almost there... Top Contributors 33 Elizabeth Jennings TB 27 TMDb Bot p 18 pepecine s 8 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}