{"link": "https://www.themoviedb.org/tv/1804?language=en", "title": "Tanner '88", "resume": "Tanner '88 is a political mockumentary miniseries written by Garry Trudeau and directed by Robert Altman. First broadcast by HBO during the months leading up to the 1988 U.S. presidential election, it purports to tell the behind-the-scenes story of the campaign of a former Michigan U.S. representative Jack Tanner during his bid to secure the Democratic party's nomination for the national race for President of the United States.\nThe story is told from a number of different points of view, including Tanner, his campaign staff, the small army of news reporters that constantly follow the candidate, and volunteers. Many political figures of the time appear, including Bruce Babbitt, Bob Dole, Kitty Dukakis, Gary Hart, Jesse Jackson, and Pat Robertson. Trudeau and Altman revisited the story 16 years later in Tanner on Tanner.", "rate": 0, "genre": ["Comedy", "Documentary", "News", "Reality", "War", "Politics"], "cast": ["Michael Murphy", "Pamela Reed", "Cynthia Nixon", "Ilana Levine", "Jim Fyfe"], "character": ["Jack Tanner", "T.J. Cavanaugh", "Alexandra Tanner", "Andrea Spinelli", "Emil Berkoff"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1804   Expand Tanner '88   (1988) User Score Overview Tanner '88 is a political mockumentary miniseries written by Garry Trudeau and directed by Robert Altman. First broadcast by HBO during the months leading up to the 1988 U.S. presidential election, it purports to tell the behind-the-scenes story of the campaign of a former Michigan U.S. representative Jack Tanner during his bid to secure the Democratic party's nomination for the national race for President of the United States. The story is told from a number of different points of view, including Tanner, his campaign staff, the small army of news reporters that constantly follow the candidate, and volunteers. Many political figures of the time appear, including Bruce Babbitt, Bob Dole, Kitty Dukakis, Gary Hart, Jesse Jackson, and Pat Robertson. Trudeau and Altman revisited the story 16 years later in Tanner on Tanner. Featured Crew Garry Trudeau Creator Robert Altman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Murphy Jack Tanner Pamela Reed T.J. Cavanaugh Cynthia Nixon Alexandra Tanner Ilana Levine Andrea Spinelli Jim Fyfe Emil Berkoff Full Cast & Crew Last Season Season 1 1988 | 12 Episodes Season 1 of Tanner '88 premiered on February 15, 1988. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Tanner '88. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tanner '88. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Comedy Documentary News Reality War & Politics Keywords politics mockumentary miniseries usa politics Content Score 93 Almost there... Top Contributors TB 28 TMDb Bot j 18 jacdeswilliams 6 Banana z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}