{"link": "https://www.themoviedb.org/tv/70617?language=en", "title": "Moominvalley", "resume": "Moominalley is an animated drama series, which follows the life and adventures of Moomintroll, who is curious, kind and idealistic. Moomintroll is a typical hero in a coming-of-age story: he tries to tackle the puzzle of growing up to his true, individualistic self while remaining a beloved part of the family. \nThe show is directed by Steve Box, who is best known for his work with Wallace and Gromit, and produced by Gutsy Animations, a production company based in Finland. First two episodes will be broadcasted at christmas 2018 on Yle and Sky One.", "rate": 0, "genre": ["Animation"], "cast": ["Rosamund Pike", "Matt Berry", "Taron Egerton", "Akiya Henry", "Bel Powley"], "character": ["Moominmamma", "Moominpappa", "Moomintroll", "Snorkmaiden", "Little My"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70617   Expand Moominvalley   (2018) User Score Overview Moominalley is an animated drama series, which follows the life and adventures of Moomintroll, who is curious, kind and idealistic. Moomintroll is a typical hero in a coming-of-age story: he tries to tackle the puzzle of growing up to his true, individualistic self while remaining a beloved part of the family.  The show is directed by Steve Box, who is best known for his work with Wallace and Gromit, and produced by Gutsy Animations, a production company based in Finland. First two episodes will be broadcasted at christmas 2018 on Yle and Sky One. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rosamund Pike Moominmamma Matt Berry Moominpappa Taron Egerton Moomintroll Akiya Henry Snorkmaiden Bel Powley Little My Full Cast & Crew Next Season Season 1 2018 | 1 Episode Season 1 of Moominvalley is set to premiere on December 24, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Facts Status  In Production Networks Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   https://www.gutsy.fi/moominvalley Genres Animation Keywords moominland moomin Content Score 86 Almost there... Top Contributors 37 BryGur 12 Hevinalle s 10 shoebox94 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}