{"link": "https://www.themoviedb.org/tv/54539?language=en", "title": "Unsealed: Alien Files", "resume": "In 2011, a vault of government files were released to the public by the Freedom of Information Act. Among these, the Blue Planet Project, containing thousands of reports on UFO sightings and alien activity...these were the files they didn't want you to see!\nNow Alien Files: Unsealed investigates these recently-released documents and re-examines key evidence and follows developing leads of mass UFO sightings, personal abductions, government cover-ups and breaking alien news from around the world. The show also delves into the \"photoshopping\" of space, the value of Wikileaks, and the role social media plays in alien stories.\nFinally, the newly released documents are analysed to see how alien visitations may have affected our past, and what influence they may have on our future. Exposing the biggest secret on planet Earth, Alien Files: Unsealed will have believers wanting more and skeptics questioning their long-held beliefs!", "rate": 54, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54539   Expand Unsealed: Alien Files   (2012) User Score Overview In 2011, a vault of government files were released to the public by the Freedom of Information Act. Among these, the Blue Planet Project, containing thousands of reports on UFO sightings and alien activity...these were the files they didn't want you to see! Now Alien Files: Unsealed investigates these recently-released documents and re-examines key evidence and follows developing leads of mass UFO sightings, personal abductions, government cover-ups and breaking alien news from around the world. The show also delves into the \"photoshopping\" of space, the value of Wikileaks, and the role social media plays in alien stories. Finally, the newly released documents are analysed to see how alien visitations may have affected our past, and what influence they may have on our future. Exposing the biggest secret on planet Earth, Alien Files: Unsealed will have believers wanting more and skeptics questioning their long-held beliefs! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2012 | 22 Episodes Season 1 of Unsealed: Alien Files premiered on September 17, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   2002-10-14 Escape to the Country 6.3    2016-10-12 Nurses Who Kill 7.3    2014-10-16 Homes By the Sea 7.0    2015-05-29 Paranormal Survivor 4.8    2009-10-14 Alaska State Troopers 7.7    2012-09-24 Unsealed: Conspiracy Files 5.4    2016-05-11 Killer Women with Piers Morgan 7.5    2014-07-20 People Just Do Nothing 8.0  Facts Status  Returning Series Networks - Certification  - Type  Documentary Original Language  English Runtime  - Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 4 david8s95 D 4 DirtRider C 2 Cato 1 arisdios  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}