{"link": "https://www.themoviedb.org/tv/4658?language=en", "title": "ALF", "resume": "A furry alien wiseguy comes to live with a terran family after crashing into their garage.", "rate": 70, "genre": ["Comedy"], "cast": ["Benji Gregory", "Andrea Elson", "Max Wright", "Anne Schedeen", "Paul Fusco"], "character": ["Brian Tanner", "Lynn Tanner", "Willie Tanner", "Kate Tanner", "ALF (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4658   Expand ALF   (1986) User Score  Play Trailer Overview A furry alien wiseguy comes to live with a terran family after crashing into their garage. Featured Crew Paul Fusco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  8 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Benji Gregory Brian Tanner Andrea Elson Lynn Tanner Max Wright Willie Tanner Anne Schedeen Kate Tanner Paul Fusco ALF (voice) Full Cast & Crew Last Season Season 4 1989 | 24 Episodes Season 4 of ALF premiered on September 18, 1989. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for ALF. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  10 Recommendations   1982-09-26 Knight Rider 6.5    1984-09-20 The Cosby Show 6.8    1985-09-29 MacGyver 7.3    1983-01-23 The A-Team 6.9    1960-09-30 The Flintstones 7.0    1983-09-10 Inspector Gadget 6.6    1962-09-23 The Jetsons 6.6    1991-09-17 Home Improvement 7.0  Facts Status  Ended Network Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords alien life-form alien sitcom alf cat eating Content Score 100 Yes! Looking good! Top Contributors 15 Maikkoum S 13 SunHomeMovie 13 BlackDelivery x 13 x'Am  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}