{"link": "https://www.themoviedb.org/tv/62000?language=en", "title": "Coast Australia", "resume": "Coast Australia follows renowned Scottish archaeologist and historian Neil Oliver on his very first trip to Australia, as he and a diverse group of co-hosts gather stories about our spectacular coastline: the history, the people, the archaeology, the geography and the marine life, investigating interesting and little known facts along the way. Oliver’s co-hosts, all experts in their field, are journalist and Australian arts and culture specialist Miriam Corowa, environmentalist Professor Tim Flannery, marine scientist Dr Emma Johnston, anthropologist Dr Xanthe Mallett and television presenter and landscape architect Brendan Moar.", "rate": 60, "genre": ["Documentary"], "cast": ["Neil Oliver", "Miriam Corowa", "Brendan Moar", "Xanthe Mallett", "Jock McIlwain"], "character": ["Himself - Presenter", "Herself - Presenter", "Himself - Presenter", "Herself - Presenter", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62000   Expand Coast Australia   (2013) User Score Overview Coast Australia follows renowned Scottish archaeologist and historian Neil Oliver on his very first trip to Australia, as he and a diverse group of co-hosts gather stories about our spectacular coastline: the history, the people, the archaeology, the geography and the marine life, investigating interesting and little known facts along the way. Oliver’s co-hosts, all experts in their field, are journalist and Australian arts and culture specialist Miriam Corowa, environmentalist Professor Tim Flannery, marine scientist Dr Emma Johnston, anthropologist Dr Xanthe Mallett and television presenter and landscape architect Brendan Moar. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Oliver Himself - Presenter Miriam Corowa Herself - Presenter Brendan Moar Himself - Presenter Xanthe Mallett Herself - Presenter Jock McIlwain Himself Full Cast & Crew Last Season Series 3 2017 | 8 Episodes Season 3 of Coast Australia premiered on January  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Coast Australia. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Documentary Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b05rx6vh Genres Documentary Keywords australia nature nature documentary Content Score 86 Almost there... Top Contributors 29 Elizabeth Jennings v 14 visionmaster1966 R 12 Rebecca SW 9 Shane Whitehead  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}