{"link": "https://www.themoviedb.org/tv/62375?language=en", "title": "Make It Pop", "resume": "What do an aspiring pop diva, a fashionista and a book worm have in common? Music! After being randomly selected to room together at Mackendrick Prep, Sun Hi, Jodi and Corki must learn to live together in harmony... literally. Can they achieve pop stardom in a school where academics come first and the arts come last? How will these rising stars balance music, grades, relationships and crushes? There's only one way to find out! Get ready for fun, drama, and musical comedy with a K-pop twist and an EDM beat!", "rate": 5, "genre": [], "cast": ["Erika Tham", "Megan Lee", "Louriza Tronco", "Dale Whibley"], "character": ["Corki", "Sun Hi", "Jodi", "Caleb Davis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62375   Expand Make It Pop   (2015) User Score Overview What do an aspiring pop diva, a fashionista and a book worm have in common? Music! After being randomly selected to room together at Mackendrick Prep, Sun Hi, Jodi and Corki must learn to live together in harmony... literally. Can they achieve pop stardom in a school where academics come first and the arts come last? How will these rising stars balance music, grades, relationships and crushes? There's only one way to find out! Get ready for fun, drama, and musical comedy with a K-pop twist and an EDM beat! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erika Tham Corki Megan Lee Sun Hi Louriza Tronco Jodi Dale Whibley Caleb Davis Full Cast & Crew Last Season Season 2 2016 | 9 Episodes Season 2 of Make It Pop premiered on January  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Make It Pop. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 15 Elizabeth Jennings 5 DarkMan p 3 paulinestanley231 d 3 diwasta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}