{"link": "https://www.themoviedb.org/tv/10515?language=en", "title": "Here Come the Brides", "resume": "Here Come the Brides is an American comedy Western series from Screen Gems that aired on the ABC television network from September 25, 1968 to April 3, 1970. The series was loosely based upon the Mercer Girls, Asa Mercer's efforts to bring civilization to old Seattle by importing marriageable women from the east coast of the United States in the 1860s, where the ravages of the American Civil War left towns short of men.", "rate": 60, "genre": ["Western"], "cast": ["Robert Brown", "Bobby Sherman", "David Soul", "Mark Lenard", "Bridget Hanley"], "character": ["Joshua Bolt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10515   Expand Here Come the Brides   (1968) User Score Overview Here Come the Brides is an American comedy Western series from Screen Gems that aired on the ABC television network from September 25, 1968 to April 3, 1970. The series was loosely based upon the Mercer Girls, Asa Mercer's efforts to bring civilization to old Seattle by importing marriageable women from the east coast of the United States in the 1860s, where the ravages of the American Civil War left towns short of men. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Brown Bobby Sherman David Soul Joshua Bolt Mark Lenard Bridget Hanley Full Cast & Crew Last Season Season 2 1969 | 26 Episodes Season 2 of Here Come the Brides premiered on September 26, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Here Come the Brides. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 48m Homepage  - Genres Western Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors S 2 Samara 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}