{"link": "https://www.themoviedb.org/tv/76531?language=en", "title": "The Grill Dads", "resume": "Hit the road with Mark and Ryan, BFF dads with a combined love of all things grilled, fried, creative and downright flavorful. They'll showcase some of the most-epic bites to leave you wanting more-and perhaps serve up a few dad jokes while they're at it.", "rate": 0, "genre": ["Reality"], "cast": ["Ryan Fey", "Mark Anderson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76531   Expand The Grill Dads   (2017) User Score  Play Trailer Overview Hit the road with Mark and Ryan, BFF dads with a combined love of all things grilled, fried, creative and downright flavorful. They'll showcase some of the most-epic bites to leave you wanting more-and perhaps serve up a few dad jokes while they're at it. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Fey Mark Anderson Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of The Grill Dads premiered on December 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Grill Dads. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  21m Homepage   http://www.foodnetwork.com/shows/the-grill-dads Genres Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 19 tigru89 14 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}