{"link": "https://www.themoviedb.org/tv/16623?language=en", "title": "Chimera", "resume": "A journalist investigates the death of his girl friend at a fertility clinic where she worked and uncovers a plot to create a new breed of human based on crossing the genetics of a man and an ape.", "rate": 60, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Kenneth Cranham", "David Calder", "John Lynch", "George Costigan", "Pip Torrens"], "character": ["Hennessey", "Dr. Jenner", "Peter Carson", "Schaffer", "Windeler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16623   Expand Chimera   (1991) User Score Overview A journalist investigates the death of his girl friend at a fertility clinic where she worked and uncovers a plot to create a new breed of human based on crossing the genetics of a man and an ape. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenneth Cranham Hennessey David Calder Dr. Jenner John Lynch Peter Carson George Costigan Schaffer Pip Torrens Windeler Full Cast & Crew Last Season Miniseries 1991 | 4 Episodes Season 1 of Chimera premiered on July  7, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Chimera. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Sci-Fi & Fantasy Keywords mutant miniseries Content Score 86 Almost there... Top Contributors TB 13 TMDb Bot R 7 Rebecca 2 kcdh CM 2 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}