{"link": "https://www.themoviedb.org/tv/34988?language=en", "title": "Piers Morgan Live", "resume": "Piers Morgan Live is a talk show on CNN, hosted by Piers Morgan. The show premiered on January 17, 2011 and filled the former Larry King Live timeslot. The theme music is written by Anthony James, composer and CEO of British company Music Candy, and his writing partner Yiorgos Bellapaisiotis, Music Candy's Director. Piers Morgan Live is recorded primarily in CNN's studios at the Time Warner Center in New York City.", "rate": 0, "genre": [], "cast": ["Anderson Cooper", "Piers Morgan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34988   Expand Piers Morgan Live   (2011) User Score Overview Piers Morgan Live is a talk show on CNN, hosted by Piers Morgan. The show premiered on January 17, 2011 and filled the former Larry King Live timeslot. The theme music is written by Anthony James, composer and CEO of British company Music Candy, and his writing partner Yiorgos Bellapaisiotis, Music Candy's Director. Piers Morgan Live is recorded primarily in CNN's studios at the Time Warner Center in New York City. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anderson Cooper Piers Morgan Full Cast & Crew Last Season Piers morgan tonight season 2012 — | 3 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Piers Morgan Live. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cnn.com/piers Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}