{"link": "https://www.themoviedb.org/tv/11732?language=en", "title": "The Adventures of Paddington Bear", "resume": "The Adventures of Paddington Bear was a Canadian/French animated children's television series. It was based on the book Paddington Bear by Michael Bond and written by Bruce Robb. It was produced by Cinar and Protecrea and ran for 117 episodes.\nThe show aired in the United States on the Cookie Jar Toons block on This TV from November 2008 - August 2009. However, all CINAR references in these broadcasts have been replaced by Cookie Jar references. It was also shown on HBO.", "rate": 73, "genre": ["Animation"], "cast": ["Nigel Lambert", "Jonathan Kydd", "Jade Williams", "John R. Hernandez", "Eve Karpf"], "character": ["Mr. Reginald Curry", "Paddington", "Judy", "Mr. Brown", "Mrs. Bird"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11732   Expand The Adventures of Paddington Bear   (1997) User Score Overview The Adventures of Paddington Bear was a Canadian/French animated children's television series. It was based on the book Paddington Bear by Michael Bond and written by Bruce Robb. It was produced by Cinar and Protecrea and ran for 117 episodes. The show aired in the United States on the Cookie Jar Toons block on This TV from November 2008 - August 2009. However, all CINAR references in these broadcasts have been replaced by Cookie Jar references. It was also shown on HBO. Featured Crew Michael Bond Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nigel Lambert Mr. Reginald Curry Jonathan Kydd Paddington Jade Williams Judy John R. Hernandez Mr. Brown Eve Karpf Mrs. Bird Full Cast & Crew Last Season Season 3 2000 | 39 Episodes Season 3 of The Adventures of Paddington Bear premiered on January  3, 2000. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Adventures of Paddington Bear. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1981-09-16 Postman Pat 6.0    2004-08-31 Dog the Bounty Hunter 3.4  Facts Status  Returning Series Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  8m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors N 38 Notamymerrick 4 Banana R 4 Rebecca s 2 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}