{"link": "https://www.themoviedb.org/tv/62610?language=en", "title": "Temptation", "resume": "To pay a debt, a married man (Kwon Sang-Woo) receives billions of won from a woman. In return for the money, the man gives himself to the woman.", "rate": 70, "genre": ["Drama", "Romance"], "cast": ["Kwon Sang-Woo", "Choi Ji-woo", "Park Ha-sun", "Choi Il-hwa", "Lee Jung-Jin"], "character": ["Cha Seok-hoon", "Yoo Se-young", "Na Hong-joo", "Na Shi-chan", "Kang Min-woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62610   Expand Temptation   (2014) User Score Overview To pay a debt, a married man (Kwon Sang-Woo) receives billions of won from a woman. In return for the money, the man gives himself to the woman. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  3 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kwon Sang-Woo Cha Seok-hoon Choi Ji-woo Yoo Se-young Park Ha-sun Na Hong-joo Choi Il-hwa Na Shi-chan Lee Jung-Jin Kang Min-woo Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Temptation premiered on July 14, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Temptation. You can help by rating TV shows you've seen. Facts Original Name  유혹 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000003583 Genres Drama Romance Keywords korea Content Score 93 Almost there... Top Contributors t 36 tmdb38202327 M 15 Maria180493 s 4 sheva_vitali 3 part-mozi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}