{"link": "https://www.themoviedb.org/tv/62999?language=en", "title": "The Jim Gaffigan Show", "resume": "Comedy about a husband and wife trying to raise their five kids in a New York two-bedroom apartment.", "rate": 72, "genre": ["Comedy"], "cast": ["Jim Gaffigan", "Ashley Williams"], "character": ["Jim Gaffigan", "Jeannie Gaffigan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62999   Expand The Jim Gaffigan Show   (2015) User Score  Play Trailer Overview Comedy about a husband and wife trying to raise their five kids in a New York two-bedroom apartment. Featured Crew Peter Tolan Creator Jim Gaffigan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Gaffigan Jim Gaffigan Ashley Williams Jeannie Gaffigan Full Cast & Crew Last Season Season 2 2016 | 12 Episodes Season 2 of The Jim Gaffigan Show premiered on June 19, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2016-06-08 Power Monkeys 7.0    2010-09-28 Whites 6.7    2006-01-01 In Justice 6.8    2010-07-12 The Silence 6.8    2013-09-05 The Guilty 7.0    2004-07-19 The Grid 7.0    2011-05-02 Case Sensitive 5.4    2015-04-15 The Delivery Man 6.5  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  23m Homepage   http://www.tvland.com/shows/the-jim-gaffigan-show Genres Comedy Keywords new york city family stand-up comedian sitcom Content Score 71 Just a little bit more... Top Contributors 16 Elizabeth Jennings 10 Banana 9 Travis Bell TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}