{"link": "https://www.themoviedb.org/tv/16358?language=en", "title": "Total Wipeout", "resume": "Total Wipeout is a British game show, hosted by Richard Hammond and Amanda Byram, which first aired on 3 January 2009. Each week, 20 contestants compete in a series of challenges in an attempt to win £10,000. These challenges are based in large pools of water or mud and generally involve large assault courses that participants must cross.\nTotal Wipeout is a licensed version of Wipeout, the Endemol show that originated in the United States in 2008, with the name slightly altered to avoid confusion with the BBC version of the earlier game show of the same name.\nOn 29 March 2012, BBC confirmed that they are to axe Total Wipeout after its sixth series. The Daily Mirror reported that a BBC spokesperson said: \"After four very successful series of Total Wipeout, and one series of Winter Wipeout, the BBC has taken the decision that the next series, due to transmit later this year, will be the last.\" The remaining 10 episodes from Series 5 began airing on 18 August 2012 and ended the show’s 4-year run on BBC One before 2013.", "rate": 53, "genre": ["Reality"], "cast": ["Richard Hammond", "Paul Daniels"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16358   Expand Total Wipeout   (2009) User Score Overview Total Wipeout is a British game show, hosted by Richard Hammond and Amanda Byram, which first aired on 3 January 2009. Each week, 20 contestants compete in a series of challenges in an attempt to win £10,000. These challenges are based in large pools of water or mud and generally involve large assault courses that participants must cross. Total Wipeout is a licensed version of Wipeout, the Endemol show that originated in the United States in 2008, with the name slightly altered to avoid confusion with the BBC version of the earlier game show of the same name. On 29 March 2012, BBC confirmed that they are to axe Total Wipeout after its sixth series. The Daily Mirror reported that a BBC spokesperson said: \"After four very successful series of Total Wipeout, and one series of Winter Wipeout, the BBC has taken the decision that the next series, due to transmit later this year, will be the last.\" The remaining 10 episodes from Series 5 began airing on 18 August 2012 and ended the show’s 4-year run on BBC One before 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Hammond Presenter Paul Daniels Full Cast & Crew Last Season Season 5 2012 | 12 Episodes Season 5 of Total Wipeout premiered on August 18, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1990-09-27 Rab C. Nesbitt 7.1    2002-11-14 Harry Hill's TV Burp 7.2    1975-04-04 The Good Life 7.0    1978-02-08 Grange Hill 6.9    1991-01-03 The Brittas Empire 7.1    1978-02-24 Going Straight 7.3    1990-11-08 Harry Enfield's Television Programme 7.6    1971-04-10 The Two Ronnies 9.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00gvnn8 Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors N 2 NoemiTalavera 1 Michael TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}