{"link": "https://www.themoviedb.org/tv/55341?language=en", "title": "Nature's Weirdest Events", "resume": "Chris Packham takes us to the scene of some of the weirdest natural phenomena on the planet, telling the real story of the events behind the headlines. \nNature can be cute, scary and stunning, but as Chris Packham discovers in these two packed programs, it can also provide the most awesome, amazing and astonishing sights you’ll ever see – including a car cocooned by caterpillars in Holland; exploding toads in Germany; fish falling from the sky and a storm that turned Sydney crimson. \nWatching original footage and consulting eyewitnesses and scientists, Chris unravels the facts behind some of the most bizarre and mysterious natural wonders to ever appear on the planet – and explains what on earth was going on.", "rate": 64, "genre": ["Documentary"], "cast": ["Chris Packham"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55341   Expand Nature's Weirdest Events   (2012) User Score Overview Chris Packham takes us to the scene of some of the weirdest natural phenomena on the planet, telling the real story of the events behind the headlines.  Nature can be cute, scary and stunning, but as Chris Packham discovers in these two packed programs, it can also provide the most awesome, amazing and astonishing sights you’ll ever see – including a car cocooned by caterpillars in Holland; exploding toads in Germany; fish falling from the sky and a storm that turned Sydney crimson.  Watching original footage and consulting eyewitnesses and scientists, Chris unravels the facts behind some of the most bizarre and mysterious natural wonders to ever appear on the planet – and explains what on earth was going on. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Packham Himself - Presenter Full Cast & Crew Last Season Series 4 2015 | 3 Episodes Season 4 of Nature's Weirdest Events premiered on January 13, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2014-10-16 Homes By the Sea 7.0    2002-10-14 Escape to the Country 6.3    2016-01-06 Empire of the Tsars: Romanov Russia with Lucy Worsley 7.7    2015-05-29 Paranormal Survivor 4.8    2014-07-20 People Just Do Nothing 8.0    2012-09-17 Unsealed: Alien Files 5.4  Facts Status  Returning Series Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Documentary Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b01pqmqq Genres Documentary Keywords nature nature documentary Content Score 56 We're so close, yet so far. Top Contributors 31 Elizabeth Jennings J 8 Jamali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}