{"link": "https://www.themoviedb.org/tv/12298?language=en", "title": "Fantastic Max", "resume": "Fantastic Max is a 1988–90 animated cartoon series as part of the 4th season of The Funtastic World of Hanna-Barbera, created by Kalisto Ltd. and Hanna-Barbera Productions and in association with S4C. It centers on a diaper-wearing toddler with a mohawk named Maxwell \"Fantastic Max\" Young who has adventures in outer space with two of his toys: FX, a pull string alien doll from a planet called Twinkle-Twinkle, and A.B. Sitter, a C-3PO-like android made of blocks.", "rate": 60, "genre": ["Animation"], "cast": ["Elisabeth Harnois", "Benji Gregory", "Paul Eiding", "Nancy Cartwright", "Gail Matthius"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12298   Expand Fantastic Max   (1988) User Score Overview Fantastic Max is a 1988–90 animated cartoon series as part of the 4th season of The Funtastic World of Hanna-Barbera, created by Kalisto Ltd. and Hanna-Barbera Productions and in association with S4C. It centers on a diaper-wearing toddler with a mohawk named Maxwell \"Fantastic Max\" Young who has adventures in outer space with two of his toys: FX, a pull string alien doll from a planet called Twinkle-Twinkle, and A.B. Sitter, a C-3PO-like android made of blocks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elisabeth Harnois Benji Gregory Paul Eiding Nancy Cartwright Gail Matthius Full Cast & Crew Last Season Season 2 1989 | 13 Episodes Season 2 of Fantastic Max premiered on October 29, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fantastic Max. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}