{"link": "https://www.themoviedb.org/tv/38992?language=en", "title": "Spencer", "resume": "Spencer, later titled Under One Roof, is an American teen situation comedy broadcast on NBC for one season starting in December 1984. The show originally starred Chad Lowe as high school student Spencer Winger, Mimi Kennedy as his mother Doris Winger, and Ronny Cox as his father George Winger.\nLowe left the series in 1985 after six episodes and was replaced by Ross Harris, who assumed the role of Spencer. At that time the show's title was changed from Spencer to Under One Roof; the first episode with the new title aired March 23, 1985. Cox also left the show during the retooling, his character written off as having left the family for a 23-year-old woman. Harold Gould and Frances Sternhagen were added to the cast as Spencer's maternal grandparents.\nFormer WKRP in Cincinnati star Richard Sanders played a high school guidance counselor in the series.", "rate": 0, "genre": ["Comedy"], "cast": ["Ross Harris", "Terry Farrell", "Ronny Cox", "Chad Lowe", "Frances Sternhagen"], "character": ["Sally", "Spencer Winger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38992   Expand Spencer   (1984) User Score Overview Spencer, later titled Under One Roof, is an American teen situation comedy broadcast on NBC for one season starting in December 1984. The show originally starred Chad Lowe as high school student Spencer Winger, Mimi Kennedy as his mother Doris Winger, and Ronny Cox as his father George Winger. Lowe left the series in 1985 after six episodes and was replaced by Ross Harris, who assumed the role of Spencer. At that time the show's title was changed from Spencer to Under One Roof; the first episode with the new title aired March 23, 1985. Cox also left the show during the retooling, his character written off as having left the family for a 23-year-old woman. Harold Gould and Frances Sternhagen were added to the cast as Spencer's maternal grandparents. Former WKRP in Cincinnati star Richard Sanders played a high school guidance counselor in the series. Featured Crew Sy Rosen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ross Harris Terry Farrell Sally Ronny Cox Chad Lowe Spencer Winger Frances Sternhagen Full Cast & Crew Last Season Season 1 1984 | 13 Episodes Season 1 of Spencer premiered on December  1, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Spencer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords high school teen comedy sitcom Content Score 79 Pump it up! We're close now. Top Contributors 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}