{"link": "https://www.themoviedb.org/tv/8638?language=en", "title": "Carry On Laughing", "resume": "Carry on Laughing is a British television comedy series produced in 1975 for ATV. Based on the Carry On films, it was an attempt to address the films' declining cinema attendance by transferring the franchise to television. Many of the original cast members were featured in the series.\nCarry on Laughing ran for two seasons, the first for six half-hour episodes and the second for seven episodes. The episode Orgy and Bess featured the final Carry On performances of both Sid James and Hattie Jacques.\nThe TV series is not as widely known as the original films, which - by contrast - are broadcast regularly on British television. It is also considered much less successful at transferring the established formula to the small screen than the Carry On Christmas specials.\nThe series was conceived after the departures of two long-serving Carry On contributors: writer Talbot Rothwell and actor Charles Hawtrey. Furthermore, Kenneth Williams declined to appear in the series. Other Carry On regulars only appeared in a minority of episodes: Sid James in only the first four, Hattie Jacques in only one; and Bernard Bresslaw appeared only in the second series.\nIn the absence of Rothwell, other writers were brought in. Lew Schwarz and experienced Carry On writer Dave Freeman each wrote six, while Barry Cryer and Dick Vosburgh penned Orgy and Bess.", "rate": 60, "genre": ["Comedy"], "cast": ["Jack Douglas", "Barbara Windsor", "Kenneth Connor", "Joan Sims", "David Lodge"], "character": ["Lottie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8638   Expand Carry On Laughing   (1975) User Score Overview Carry on Laughing is a British television comedy series produced in 1975 for ATV. Based on the Carry On films, it was an attempt to address the films' declining cinema attendance by transferring the franchise to television. Many of the original cast members were featured in the series. Carry on Laughing ran for two seasons, the first for six half-hour episodes and the second for seven episodes. The episode Orgy and Bess featured the final Carry On performances of both Sid James and Hattie Jacques. The TV series is not as widely known as the original films, which - by contrast - are broadcast regularly on British television. It is also considered much less successful at transferring the established formula to the small screen than the Carry On Christmas specials. The series was conceived after the departures of two long-serving Carry On contributors: writer Talbot Rothwell and actor Charles Hawtrey. Furthermore, Kenneth Williams declined to appear in the series. Other Carry On regulars only appeared in a minority of episodes: Sid James in only the first four, Hattie Jacques in only one; and Bernard Bresslaw appeared only in the second series. In the absence of Rothwell, other writers were brought in. Lew Schwarz and experienced Carry On writer Dave Freeman each wrote six, while Barry Cryer and Dick Vosburgh penned Orgy and Bess. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Douglas Barbara Windsor Lottie Kenneth Connor Joan Sims David Lodge Full Cast & Crew Last Season Season 2 1975 | 7 Episodes Season 2 of Carry On Laughing premiered on October 26, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Carry On Laughing. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  24m, 25m Homepage  - Genres Comedy Keywords parody double entendre british humour Content Score 71 Just a little bit more... Top Contributors O 3 Ozbourne s 3 speedycars 2 ash77ah H 1 HeadSwitch  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}