{"link": "https://www.themoviedb.org/tv/43313?language=en", "title": "Cinematic Titanic", "resume": "Cinematic Titanic is a project by Mystery Science Theater 3000 creator and original host, Joel Hodgson. The project involves \"riffing\" B-movies, in a manner similar to that of MST3K. Joining Hodgson are many of the original MST3K cast, as well as some cast members who joined later in the show's run. These include Trace Beaulieu, J. Elvis Weinstein, Frank Conniff and Mary Jo Pehl. It was first performed live on December 7, 2007 and first aired on December 22, 2007.\nOn February 16, 2013, it was announced that the touring portion of Cinematic Titanic was going on an indefinite hiatus. According to an email sent out to members of the site, due to \"5 people living in 5 different cities with different lives and projects, it has become increasingly difficult to coordinate our schedules and give Cinematic Titanic the attention it requires to keep growing as a creative enterprise and a business.\" The final tour began on September 23, 2013.", "rate": 0, "genre": ["Comedy"], "cast": ["Joel Hodgson", "Frank Conniff", "J. Elvis Weinstein", "Mary Jo Pehl", "Trace Beaulieu"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43313   Expand Cinematic Titanic   (2007) User Score Overview Cinematic Titanic is a project by Mystery Science Theater 3000 creator and original host, Joel Hodgson. The project involves \"riffing\" B-movies, in a manner similar to that of MST3K. Joining Hodgson are many of the original MST3K cast, as well as some cast members who joined later in the show's run. These include Trace Beaulieu, J. Elvis Weinstein, Frank Conniff and Mary Jo Pehl. It was first performed live on December 7, 2007 and first aired on December 22, 2007. On February 16, 2013, it was announced that the touring portion of Cinematic Titanic was going on an indefinite hiatus. According to an email sent out to members of the site, due to \"5 people living in 5 different cities with different lives and projects, it has become increasingly difficult to coordinate our schedules and give Cinematic Titanic the attention it requires to keep growing as a creative enterprise and a business.\" The final tour began on September 23, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joel Hodgson Frank Conniff J. Elvis Weinstein Mary Jo Pehl Trace Beaulieu Full Cast & Crew Last Season Season 1 2007 | 12 Episodes Season 1 of Cinematic Titanic premiered on December 21, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Cinematic Titanic. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}