{"link": "https://www.themoviedb.org/tv/62466?language=en", "title": "Los Protegidos", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 20, "genre": ["Family", "Comedy"], "cast": ["Antonio Garrido", "Luís Fernández", "Ana Fernández", "Marta Torné", "Mario Marzo"], "character": ["Mario Montero/Mario Castillo Cister", "Ángel Izquierdo «Culebra»/Policarpo «Poli» Castillo Rey", "Sandra Olaiz Benedetti/Sandra Castillo Rey", "Julia Redondo/Julia Casares", "Lucas López Gallego/Lucas Castillo López"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62466   Expand Los Protegidos   (2010) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Darío Madrona Creator Ruth García Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antonio Garrido Mario Montero/Mario Castillo Cister Luís Fernández Ángel Izquierdo «Culebra»/Policarpo «Poli» Castillo Rey Ana Fernández Sandra Olaiz Benedetti/Sandra Castillo Rey Marta Torné Julia Redondo/Julia Casares Mario Marzo Lucas López Gallego/Lucas Castillo López Full Cast & Crew Last Season Season 3 2012 | 14 Episodes Season 3 of Los Protegidos premiered on March  8, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Los Protegidos. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  90m Homepage   http://www.antena3.com/series/los-protegidos/ Genres Family Comedy Keywords supernatural powers Content Score 86 Almost there... Top Contributors 62 prm96 z 5 zurman1 m 4 megacharlespc 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}