{"link": "https://www.themoviedb.org/tv/13477?language=en", "title": "Trumpton", "resume": "Trumpton is a stop-motion children's television show from the producers of Camberwick Green. First shown on the BBC in the 1960s, It was the second series in the Trumptonshire Trilogy, which comprised Camberwick Green, Trumpton, and Chigley.\nTrumpton was narrated by Brian Cant, animation was by Bob Bura, John Hardwick and Pasquale Ferrari. Scripts are by Alison Prince; all other production details were identical to Camberwick Green.", "rate": 88, "genre": ["Animation"], "cast": ["Brian Cant"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13477   Expand Trumpton   (1967) User Score Overview Trumpton is a stop-motion children's television show from the producers of Camberwick Green. First shown on the BBC in the 1960s, It was the second series in the Trumptonshire Trilogy, which comprised Camberwick Green, Trumpton, and Chigley. Trumpton was narrated by Brian Cant, animation was by Bob Bura, John Hardwick and Pasquale Ferrari. Scripts are by Alison Prince; all other production details were identical to Camberwick Green. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Cant Full Cast & Crew Last Season Season 1 1967 | 13 Episodes Season 1 of Trumpton premiered on January  3, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1966-01-03 Camberwick Green 8.3    1976-01-06 Rentaghost 8.0    1975-01-02 The Sweeney 6.4    Randall and Hopkirk (Deceased) 7.0    1986-09-01 Brush Strokes 7.8    1977-04-12 Citizen Smith 7.6    1964-12-16 The Likely Lads 7.8    1983-11-26 The Wind in the Willows 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}