{"link": "https://www.themoviedb.org/tv/75043?language=en", "title": "Adult High School", "resume": "To solve the country's low birthrate problem, the Japanese government set up Otona Koukou (Adult High School). Adults over 30 and have no sexual experience are forcibly enrolled into Otona Koukou by the government.\nEito Arakawa is a 30-year-old single man. He graduated from a prestigious university and works at a bank. He has received recognition for his work there. He is also physically attractive, but he has never had sex.\nOne day, he receives an entrance guide to Otona Koukou.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Haruma Miura", "Katsumi Takahashi", "Ryo Ryusei", "Airi Matsui", "Jutta Yuki"], "character": ["Eito Arakawa", "Kansuke Gonda", "Pegasasu Yamada", "Sakura Himetani", "Karurosu Yu Kawamoto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75043   Expand Adult High School   (2017) User Score Overview To solve the country's low birthrate problem, the Japanese government set up Otona Koukou (Adult High School). Adults over 30 and have no sexual experience are forcibly enrolled into Otona Koukou by the government. Eito Arakawa is a 30-year-old single man. He graduated from a prestigious university and works at a bank. He has received recognition for his work there. He is also physically attractive, but he has never had sex. One day, he receives an entrance guide to Otona Koukou. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruma Miura Eito Arakawa Katsumi Takahashi Kansuke Gonda Ryo Ryusei Pegasasu Yamada Airi Matsui Sakura Himetani Jutta Yuki Karurosu Yu Kawamoto Full Cast & Crew Current Season Season 1 2017 | 8 Episodes Season 1 of Adult High School premiered on October 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Adult High School. You can help by rating TV shows you've seen. Facts Original Name  オトナ高校 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.tv-asahi.co.jp/otonakoukou/ Genres Comedy Drama Keywords romance Content Score 86 Almost there... Top Contributors M 32 Maria180493 5 Elizabeth Jennings 1 friend-series.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}