{"link": "https://www.themoviedb.org/tv/53515?language=en", "title": "Thida Paya Yom", "resume": "Thep Oma is the evil thep and Thep Akara (Kwan dad) was given the task by ‘Jao Sawan’ (heaven owner?) to catch Thep Oma and put him in the 'nilakarn' jail (heaven jail?) which is noone can escape. The 'nilakarn' jail key was divide into 4 part and give to 4 Thep Ongkarak(God Guard?). The 4 gods need to hide at the human world so that noone can find them.\nAkhin is Thep Oma son, there is no prove to put him in the jail so that Thep Akara just keep him at his castle . Akhin find out that ‘nilakar’ key was given to 4 god that hide at the world. At the end Akhin manage escape himself from heaven and go to human world with his 9 killer god guard. ‘Jao Sawan’ so mad at Thep Akara that he not put Akhin in the jail from the begining so now he can escape. Thep Akara admit his fault and he accept the punishment.\nNatcha (Kwan) asking for her mom (Kanwalee) permission to go down to the world to find Akhin to redeem for her dad. But her mom not allow because don’t want her daughter to be in danger. Kanwalee never know that behind the cute, prim and innocent of Nattcha is actually she’s have very skillful and strong heart from her dad. When she still a kid, even her parents not allow her to learn fighting but Nattcha never hear, she secretly went to learn from ‘ajarn Poo’ (which is her dad teacher too). Ajarn Poo admit in Natcha skilled very great and strong, he said Natcha is not Theptida of Thep Phitak but she’s actually Theptida Payayom.\nNatcha escape her mom and go to the world to find Akhin. So there the story started.\nEkapope (New) policeman he’s son one of the 4 God that have ‘nilakarn’ key (half god half human). Nalika(Grace) is Eakapope younger sister. Eakapope know that he have the power but he always hide it. One day Eakapope fight with bad people (which is actually the 9 killer god), Natcha came and help him, she told him that they are the killer god that came to find the key/map. Kraiyut (Aof) also son one of the 4 god. And the other 2 god heirs are Beam & Ping Pong. All of them together fight with Nakhin, Rashen(Hem) and Paranang(Sal) were sent to help Natcahe and Eakapope......blah...blah...blah...blah...There a lot of fighting at the end they win over Nakhin and his 9 killer god.\nWhen the time of separate coming Natcha who is tida of heaven she's god so it make Eakapope not dare to reveal his feeling to her because he have to live at the world but Natcha have to live at heaven. At the end Natcha bring Nakhin back to the heaven for punishment. Krayut end up with Nalika, while Rashen follow Paranang to live with her at the 'samoot world'(sea world?)\n3 months later.. Eakapope fight with the bad people and suddenly Natcha came and help him, both of them smile and walk to each other...", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Wongsakorn Poramathakorn", "Usamanee Vaithayanon", "Chanapol Satya", "Karnklao Duaysienklao", "Hemmawat Nittayaros"], "character": ["Ekapope", "Nacha", "Kraiyut", "Nalika", "Rashen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53515   Expand Thida Paya Yom   (2013) User Score  Play Trailer Overview Thep Oma is the evil thep and Thep Akara (Kwan dad) was given the task by ‘Jao Sawan’ (heaven owner?) to catch Thep Oma and put him in the 'nilakarn' jail (heaven jail?) which is noone can escape. The 'nilakarn' jail key was divide into 4 part and give to 4 Thep Ongkarak(God Guard?). The 4 gods need to hide at the human world so that noone can find them. Akhin is Thep Oma son, there is no prove to put him in the jail so that Thep Akara just keep him at his castle . Akhin find out that ‘nilakar’ key was given to 4 god that hide at the world. At the end Akhin manage escape himself from heaven and go to human world with his 9 killer god guard. ‘Jao Sawan’ so mad at Thep Akara that he not put Akhin in the jail from the begining so now he can escape. Thep Akara admit his fault and he accept the punishment. Natcha (Kwan) asking for her mom (Kanwalee) permission to go down to the world to find Akhin to redeem for her dad. But her mom not allow because don’t want her daughter to be in danger. Kanwalee never know that behind the cute, prim and innocent of Nattcha is actually she’s have very skillful and strong heart from her dad. When she still a kid, even her parents not allow her to learn fighting but Nattcha never hear, she secretly went to learn from ‘ajarn Poo’ (which is her dad teacher too). Ajarn Poo admit in Natcha skilled very great and strong, he said Natcha is not Theptida of Thep Phitak but she’s actually Theptida Payayom. Natcha escape her mom and go to the world to find Akhin. So there the story started. Ekapope (New) policeman he’s son one of the 4 God that have ‘nilakarn’ key (half god half human). Nalika(Grace) is Eakapope younger sister. Eakapope know that he have the power but he always hide it. One day Eakapope fight with bad people (which is actually the 9 killer god), Natcha came and help him, she told him that they are the killer god that came to find the key/map. Kraiyut (Aof) also son one of the 4 god. And the other 2 god heirs are Beam & Ping Pong. All of them together fight with Nakhin, Rashen(Hem) and Paranang(Sal) were sent to help Natcahe and Eakapope......blah...blah...blah...blah...There a lot of fighting at the end they win over Nakhin and his 9 killer god. When the time of separate coming Natcha who is tida of heaven she's god so it make Eakapope not dare to reveal his feeling to her because he have to live at the world but Natcha have to live at heaven. At the end Natcha bring Nakhin back to the heaven for punishment. Krayut end up with Nalika, while Rashen follow Paranang to live with her at the 'samoot world'(sea world?) 3 months later.. Eakapope fight with the bad people and suddenly Natcha came and help him, both of them smile and walk to each other... Featured Crew Kantana Group Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wongsakorn Poramathakorn Ekapope Usamanee Vaithayanon Nacha Chanapol Satya Kraiyut Karnklao Duaysienklao Nalika Hemmawat Nittayaros Rashen Full Cast & Crew Last Season Season 1 2013 | 17 Episodes Season 1 of Thida Paya Yom premiered on September 21, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Thida Paya Yom. You can help by rating TV shows you've seen. Facts Original Name  ธิดาพญายม Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  95m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 38 Crip TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}