{"link": "https://www.themoviedb.org/tv/77287?language=en", "title": "The Good Witch", "resume": "Cha Sun-Hee is a housewife and she is married to Bong Cheon-Dae. Her husband is currently unemployed. She has a twin sister, Cha Do-Hee, who works as a flight attendant. Although they are identical twins, they have completely opposite personalities. Cha Do-Hee becomes involved in a situation which leads to Cha Sun-Hee pretending to be her flight attendant sister. She then meets co-pilot Song Woo-Jin.", "rate": 40, "genre": ["Family", "Drama"], "cast": ["Lee Da-hae", "Ryu Soo-young", "An Woo-yeon", "Bae Soo-bin", "Yoon Se-ah"], "character": ["Cha Sun-Hee / Cha Do-Hee", "Song Woo-Jin", "Oh Tae-Yang", "Bong Cheon-Dae", "Oh Tae-Ri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77287   Expand The Good Witch   (2018) User Score Overview Cha Sun-Hee is a housewife and she is married to Bong Cheon-Dae. Her husband is currently unemployed. She has a twin sister, Cha Do-Hee, who works as a flight attendant. Although they are identical twins, they have completely opposite personalities. Cha Do-Hee becomes involved in a situation which leads to Cha Sun-Hee pretending to be her flight attendant sister. She then meets co-pilot Song Woo-Jin. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Da-hae Cha Sun-Hee / Cha Do-Hee Ryu Soo-young Song Woo-Jin An Woo-yeon Oh Tae-Yang Bae Soo-bin Bong Cheon-Dae Yoon Se-ah Oh Tae-Ri Full Cast & Crew Current Season Season 1 2018 | 40 Episodes Season 1 of The Good Witch premiered on March  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Good Witch. You can help by rating TV shows you've seen. Facts Original Name  착한마녀전 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://programs.sbs.co.kr/drama/nicewitch/ Genres Family Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 37 Maria180493 h 3 huestory 3 andermairena k 2 kunamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}