{"link": "https://www.themoviedb.org/tv/46427?language=en", "title": "The Strange Calls", "resume": "City cop Toby Banks is demoted to night duty at Coolum Beach. He joins local eccentric Gregor to investigate the strange calls: phone calls that expose the paranormal mysteries of the town.", "rate": 68, "genre": ["Comedy"], "cast": ["Barry Crocker", "Toby Truslove", "Patrick Brammall", "Katherine Hicks"], "character": ["Gregor", "Toby Banks", "Neil Lloyd", "Kath"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46427   Expand The Strange Calls   (2012) User Score  Play Trailer Overview City cop Toby Banks is demoted to night duty at Coolum Beach. He joins local eccentric Gregor to investigate the strange calls: phone calls that expose the paranormal mysteries of the town. Featured Crew Daley Pearson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barry Crocker Gregor Toby Truslove Toby Banks Patrick Brammall Neil Lloyd Katherine Hicks Kath Full Cast & Crew Last Season Series 1 2012 | 6 Episodes Season 1 of The Strange Calls premiered on October 16, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2015-06-12 Conspiracy 5.7    2016-11-15 Brown Nation 7.3    2015-05-24 Tales by Light 7.8  Facts Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  29m Homepage   http://thestrangecalls.abc.net.au/ Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 27 United600 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}