{"link": "https://www.themoviedb.org/tv/66292?language=en", "title": "Big Little Lies", "resume": "Subversive, darkly comedic drama Big Little Lies tells the tale of three mothers of first graders whose apparently perfect lives unravel to the point of murder.", "rate": 79, "genre": ["Drama"], "cast": ["Nicole Kidman", "Reese Witherspoon", "Shailene Woodley", "Alexander Skarsgård", "Laura Dern"], "character": ["Celeste Wright", "Madeline Mackenzie", "Jane Chapman", "Perry Wright", "Renata Klein"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66292   Expand Big Little Lies   (2017) User Score  Play Trailer Overview Subversive, darkly comedic drama Big Little Lies tells the tale of three mothers of first graders whose apparently perfect lives unravel to the point of murder. Featured Crew David E. Kelley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  27 Content Issues  0 Images Backdrops  5 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Nicole Kidman Celeste Wright Reese Witherspoon Madeline Mackenzie Shailene Woodley Jane Chapman Alexander Skarsgård Perry Wright Laura Dern Renata Klein Full Cast & Crew Last Season Season 1 2017 | 7 Episodes Season 1 of Big Little Lies premiered on February 19, 2017. View All Seasons Social Reviews  1 Discussions  27 Featured Review A review by Reno  9.0 Written by  Reno  on July 30, 2017 A BIG mystery surrounding LITTLE kids and their LIES. SEASON 01: I neither read the book nor I knew the story. So this was a surprise mini-series. As far I've heard, this one was the finest adaptation. The best ever cast and the episodes were well split with each one had a great opening and the ending. The suspense kept me alive till the final episode, final scene. Meanwhile, I made some guesses, but most of them did not happen. In my opinion, it should have been a feature film duology. Then it would have been considered one of the best film series, as well as mystery film. And the Os...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  5 Posters  13 Recommendations   2017-04-26 The Handmaid's Tale 7.8    2016-09-20 This Is Us 8.1    2017-03-31 13 Reasons Why 7.2    2017-03-05 FEUD 7.9    2014-06-29 The Leftovers 7.7    2017-07-21 Ozark 8.0    2017-02-03 Santa Clarita Diet 7.3    2013-03-18 Bates Motel 7.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m, 60m Homepage   http://www.hbo.com/big-little-lies Genres Drama Keywords mother based on novel or book family secret murder school domestic violence crime parents kids murder mystery Content Score 100 Yes! Looking good! Top Contributors 45 Elizabeth Jennings b 23 broccoli7 20 Banana 19 maikamonroe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}