{"link": "https://www.themoviedb.org/tv/3349?language=en", "title": "Cold Lazarus", "resume": "The year is 2368 and a group of scientists are on the brink of a major breakthrough as they begin to tap into the memory of a man who died in the 1990s.", "rate": 75, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Albert Finney", "Carmen Ejogo", "Ciarán Hinds", "Keeley Hawes", "Rupert Penry-Jones"], "character": ["Daniel Feeld", "Blinda", "Fyodor", "Linda Langer", "Militiaman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3349   Expand Cold Lazarus   (1996) User Score Overview The year is 2368 and a group of scientists are on the brink of a major breakthrough as they begin to tap into the memory of a man who died in the 1990s. Featured Crew Dennis Potter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Albert Finney Daniel Feeld Carmen Ejogo Blinda Ciarán Hinds Fyodor Keeley Hawes Linda Langer Rupert Penry-Jones Militiaman Full Cast & Crew Last Season Miniseries 1996 | 4 Episodes Season 1 of Cold Lazarus premiered on May 25, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1996-04-28 Karaoke 7.4    1986-10-06 The Trap Door 7.3    1990-01-10 Oranges Are Not the Only Fruit 7.6    Randall and Hopkirk (Deceased) 7.0    1983-09-22 Just Good Friends 6.4    2005-02-21 Masterchef Goes Large 4.8    1979-10-29 Only When I Laugh 6.0    1990-01-04 One Foot in the Grave 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  65m, 60m Homepage   http://www.channel4.com/programmes/cold-lazarus Genres Drama Sci-Fi & Fantasy Keywords future technology dystopia sequel scientist Content Score 93 Almost there... Top Contributors 21 Banana TB 13 TMDb Bot 1 kcdh 1 peterstanley  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}