{"link": "https://www.themoviedb.org/tv/21636?language=en", "title": "Wounded Eagle", "resume": "Ranjeni orao was a Serbian television show produced in 2008 and aired on RTS1 during late 2008 and early 2009. The 17 episode series is based on the 1936 novel \"Ranjeni orao\" by Serbian author Mir Jam. The show had unprecedented success with the last episode averaging over 3 million viewers, making it the most watched Serbian television series ever made.", "rate": 100, "genre": ["Drama"], "cast": ["Radomir Radosavljević", "Ksenija Zelenović", "Petar Ćirica", "Jasmina Avramović", "Слобода Мићаловић"], "character": ["Pilot 1", "Ruža Aleksić", "Anđelka Bojanić"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21636   Expand Wounded Eagle   (2008) User Score Overview Ranjeni orao was a Serbian television show produced in 2008 and aired on RTS1 during late 2008 and early 2009. The 17 episode series is based on the 1936 novel \"Ranjeni orao\" by Serbian author Mir Jam. The show had unprecedented success with the last episode averaging over 3 million viewers, making it the most watched Serbian television series ever made. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Radomir Radosavljević Ksenija Zelenović Petar Ćirica Pilot 1 Jasmina Avramović Ruža Aleksić Слобода Мићаловић Anđelka Bojanić Full Cast & Crew Last Season Season 1 2008 | 17 Episodes Season 1 of Wounded Eagle premiered on December 22, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wounded Eagle. You can help by rating TV shows you've seen. Facts Original Name  Ranjeni orao Status  Ended Network Certification  - Type  Scripted Original Language  Serbian Runtime  55m Homepage  - Genres Drama Keywords romance Content Score 71 Just a little bit more... Top Contributors M 48 Mario_Gaborović TB 2 TMDb Bot 2 Banana 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}