{"link": "https://www.themoviedb.org/tv/33544?language=en", "title": "My Girlfriend is a Nine-Tailed Fox", "resume": "My Girlfriend Is a Nine-Tailed Fox is a 2010 South Korean romantic comedy television series starring Lee Seung-gi and Shin Min-ah. It aired on SBS from August 11 to September 30, 2010 on Wednesdays and Thursdays at 21:55 for 16 episodes.", "rate": 76, "genre": ["Comedy", "Drama", "Fantasy", "Romance"], "cast": ["Shin Min-A", "No Min-woo", "Lee Seung-gi", "Park Soo-jin", "Sung Dong-il"], "character": ["Gu Mi-ho", "Park Dong-joo", "Cha Dae-woong", "Eun Hye-in", "Ban Doo-hong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33544   Expand My Girlfriend is a Nine-Tailed Fox   (2010) User Score Overview My Girlfriend Is a Nine-Tailed Fox is a 2010 South Korean romantic comedy television series starring Lee Seung-gi and Shin Min-ah. It aired on SBS from August 11 to September 30, 2010 on Wednesdays and Thursdays at 21:55 for 16 episodes. Featured Crew Hong Mi Ran Creator Hong Jeong Eun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin Min-A Gu Mi-ho No Min-woo Park Dong-joo Lee Seung-gi Cha Dae-woong Park Soo-jin Eun Hye-in Sung Dong-il Ban Doo-hong Full Cast & Crew Last Season Season 1 2010 | 16 Episodes Season 1 of My Girlfriend is a Nine-Tailed Fox premiered on August 11, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   2012-03-21 The King 2 Hearts 8.4    2014-07-23 It's Okay, That's Love 9.3    2014-05-05 Doctor Stranger 7.3    2013-12-09 The Prime Minister and I 7.1    2013-06-05 I Hear Your Voice 8.2    2015-08-05 Yong Pal 7.2    2011-06-29 Heartstrings 7.0    2015-07-03 Oh My Ghostess 7.9  Facts Original Name  내 여자친구는 구미호 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.tv.sbs.co.kr/mygumiho/ Genres Comedy Drama Fantasy Romance Keywords korea Content Score 93 Almost there... Top Contributors M 27 Maria180493 5 refresh_daemon 5 lareina123 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}