{"link": "https://www.themoviedb.org/tv/21276?language=en", "title": "Anne Frank: The Whole Story", "resume": "Anne Frank: The Whole Story is a two-part mini-series based on the book Anne Frank: The Biography by Melissa Müller. The mini-series aired on ABC on May 20 and 21, 2001. The series starred Ben Kingsley, Brenda Blethyn, Hannah Taylor-Gordon, and Lili Taylor. Controversially, but in keeping with the claim made by Melissa Müller, the series asserts that the anonymous betrayer of the Frank family was the office cleaner, when in fact the betrayer's identity has never been established. A disagreement between the producers of the mini-series and the Anne Frank Foundation about validity of this and other details led to the withdrawal of their endorsement of the dramatization, which prevented the use of any quotations from the writings of Anne Frank appearing within the production. Hannah Taylor-Gordon received both Golden Globe and Emmy Award nominations for her performance as Anne Frank, while Ben Kingsley won a Screen Actor's Guild Award for his performance as Otto Frank, Anne's father.", "rate": 100, "genre": ["Drama"], "cast": ["Zdeňka Žádníková-Volencová", "Jelena Šebestová-Juklová", "Hannah Taylor-Gordon", "Ben Kingsley", "Brenda Blethyn"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21276   Expand Anne Frank: The Whole Story   (2001) User Score Overview Anne Frank: The Whole Story is a two-part mini-series based on the book Anne Frank: The Biography by Melissa Müller. The mini-series aired on ABC on May 20 and 21, 2001. The series starred Ben Kingsley, Brenda Blethyn, Hannah Taylor-Gordon, and Lili Taylor. Controversially, but in keeping with the claim made by Melissa Müller, the series asserts that the anonymous betrayer of the Frank family was the office cleaner, when in fact the betrayer's identity has never been established. A disagreement between the producers of the mini-series and the Anne Frank Foundation about validity of this and other details led to the withdrawal of their endorsement of the dramatization, which prevented the use of any quotations from the writings of Anne Frank appearing within the production. Hannah Taylor-Gordon received both Golden Globe and Emmy Award nominations for her performance as Anne Frank, while Ben Kingsley won a Screen Actor's Guild Award for his performance as Otto Frank, Anne's father. Featured Crew Robert Dornhelm Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zdeňka Žádníková-Volencová Jelena Šebestová-Juklová Hannah Taylor-Gordon Ben Kingsley Brenda Blethyn Full Cast & Crew Last Season Season 1 2001 | 2 Episodes Season 1 of Anne Frank: The Whole Story premiered on January  1, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Anne Frank: The Whole Story. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  183m Homepage  - Genres Drama Keywords holocaust anne frank miniseries Content Score 93 Almost there... Top Contributors h 24 hanyny R 15 Rebecca r 14 ragehero c 5 chispy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}