{"link": "https://www.themoviedb.org/tv/10013?language=en", "title": "Do Over", "resume": "Do Over is an American comedy-drama/fantasy series created by Kenny Schwartz and Rick Wiener about a man who gets a chance to relive his childhood. The series, which was originally broadcast on The WB in 2002, stars Penn Badgley.", "rate": 60, "genre": ["Drama", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Natasha Melnick", "Penn Badgley", "Angela Goethals", "Tom Everett Scott", "Gigi Rice"], "character": ["Isabelle Meyers", "Joel Larsen", "Cheryl Larsen", "Joel", "Karen Larsen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10013   Expand Do Over   (2002) User Score Overview Do Over is an American comedy-drama/fantasy series created by Kenny Schwartz and Rick Wiener about a man who gets a chance to relive his childhood. The series, which was originally broadcast on The WB in 2002, stars Penn Badgley. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natasha Melnick Isabelle Meyers Penn Badgley Joel Larsen Angela Goethals Cheryl Larsen Tom Everett Scott Joel Gigi Rice Karen Larsen Full Cast & Crew Last Season Season 1 2002 | 15 Episodes Season 1 of Do Over premiered on September 19, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Do Over. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Drama Comedy Sci-Fi & Fantasy Keywords retro teenager changing the past or future 1980s Content Score 86 Almost there... Top Contributors 26 Banana z 4 zurman1 R 2 Rebecca TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}