{"link": "https://www.themoviedb.org/tv/269?language=en", "title": "One Tree Hill", "resume": "Set in the fictional small town of Tree Hill, North Carolina, this teen-driven drama tells the story of two half brothers, who share a last name and nothing else. Brooding, blue-collar Lucas is a talented street-side basketball player, but his skills are appreciated only by his friends at the river court. Popular, affluent Nathan basks in the hero-worship of the town, as the star of his high school team. And both boys are the son of former college ball player, Dan Scott, whose long ago choice to abandon Lucas and his mother Karen, will haunt him long into his life with wife Deb, and their son Nathan.\nUntil now, Dan has managed to keep his two sons far from each other. But the past and present collide sharply when Tree Hill's basketball coach recruits Lucas for his team, much to the chagrin of Nathan and Daddy Dan. And the siblings natural rivalry only intensifies when they set their sights on the same girl, Peyton Sawyer. The residue of the past lingers far into the future for the residents of Tree Hill, even as a new generation is rising. Tree Hill follows the lives and loves of these two brothers, their friends and their family as they navigate high school, marriage, and finally... adulthood.", "rate": 67, "genre": ["Drama"], "cast": ["James Lafferty", "Bethany Joy Lenz", "Paul Johansson", "Sophia Bush", "Lee Norris"], "character": ["Nathan Scott", "Haley James Scott", "Dan Scott", "Brooke Davis", "Mouth McFadden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 269   Expand One Tree Hill   (2003) User Score  Play Trailer Overview Set in the fictional small town of Tree Hill, North Carolina, this teen-driven drama tells the story of two half brothers, who share a last name and nothing else. Brooding, blue-collar Lucas is a talented street-side basketball player, but his skills are appreciated only by his friends at the river court. Popular, affluent Nathan basks in the hero-worship of the town, as the star of his high school team. And both boys are the son of former college ball player, Dan Scott, whose long ago choice to abandon Lucas and his mother Karen, will haunt him long into his life with wife Deb, and their son Nathan. Until now, Dan has managed to keep his two sons far from each other. But the past and present collide sharply when Tree Hill's basketball coach recruits Lucas for his team, much to the chagrin of Nathan and Daddy Dan. And the siblings natural rivalry only intensifies when they set their sights on the same girl, Peyton Sawyer. The residue of the past lingers far into the future for the residents of Tree Hill, even as a new generation is rising. Tree Hill follows the lives and loves of these two brothers, their friends and their family as they navigate high school, marriage, and finally... adulthood. Featured Crew Mark Schwahn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  16 Content Issues  6 Images Backdrops  27 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Lafferty Nathan Scott Bethany Joy Lenz Haley James Scott Paul Johansson Dan Scott Sophia Bush Brooke Davis Lee Norris Mouth McFadden Full Cast & Crew Last Season Season 9 2012 | 13 Episodes View All Seasons Social Reviews  0 Discussions  22 Subject Status Replies Last Reply M Should they have told Dan Deb tried to kill him? Open 6 by  MickyMac M Did Keith deserve to die? Open 0 by MickyMac\n      \n     M Do you blame Deb for Keith's death? Open 4 by  MickyMac Go to Discussions Media Most Popular Videos  1 Backdrops  27 Posters  10 Recommendations   2007-09-19 Gossip Girl 6.3    2003-08-05 The O.C. 6.9    2010-09-08 Hellcats 5.6    2005-09-23 Ghost Whisperer 5.6    2000-10-05 Gilmore Girls 7.5    2007-07-09 Greek 6.3    2009-01-02 90210 4.6    2006-09-28 Ugly Betty 5.5  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m, 60m, 39m, 44m Homepage   http://www.cwtv.com/shows/one-tree-hill Genres Drama Keywords high school sibling relationship basketball teenage romance teen drama Content Score 100 Yes! Looking good! Top Contributors 110 Marr 🇳🇱 40 Banana c 37 courtneysmith86 16 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}