{"link": "https://www.themoviedb.org/tv/62649?language=en", "title": "Superstore", "resume": "A hilarious workplace comedy about a unique family of employees at a super-sized mega store. From the bright-eyed newbies and the seen-it-all veterans to the clueless summer hires and the in-it-for-life managers, together they hilariously tackle the day-to-day grind of rabid bargain hunters, riot-causing sales and nap-worthy training sessions.", "rate": 67, "genre": ["Comedy"], "cast": ["America Ferrera", "Ben Feldman", "Colton Dunn", "Lauren Ash", "Mark McKinney"], "character": ["Amy Dubanowski", "Jonah Simms", "Garrett McNeill", "Dina Fox", "Glenn Sturgis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62649   Expand Superstore   (2015) User Score  Play Trailer Overview A hilarious workplace comedy about a unique family of employees at a super-sized mega store. From the bright-eyed newbies and the seen-it-all veterans to the clueless summer hires and the in-it-for-life managers, together they hilariously tackle the day-to-day grind of rabid bargain hunters, riot-causing sales and nap-worthy training sessions. Featured Crew Justin Spitzer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  5 Images Backdrops  8 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast America Ferrera Amy Dubanowski Ben Feldman Jonah Simms Colton Dunn Garrett McNeill Lauren Ash Dina Fox Mark McKinney Glenn Sturgis Full Cast & Crew Last Season Original Air Date Original Air Date Custom Order (Original Air Date) Season 3 2017 | 22 Episodes Season 3 of Superstore premiered on September 28, 2017. View All Seasons Social Reviews  1 Discussions  13 Featured Review A review by Reno Written by  Reno  on September  4, 2017 A Superstore not without its super-employees and their super-troubles! SEASON 02: It's a cool series. But I did not think they would renew it for the second season. The episodes were doubled, and I think it deserved that, because each episode were very enjoyable. The first season was an intro, but I felt very comfortable with this. More characters added, though the romance side of the tale is yet to be tapped. Maybe I think I know how it's going to turn out, but the finale of this season created more curiosity, going for the third. Yes, they have renewed the series, that's a wonde...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  8 Posters  3 Recommendations   2015-02-04 Fresh Off the Boat 7.0    2016-09-21 Speechless 7.5    2004-03-12 Wonderfalls 7.8    2017-01-01 The Mick 6.9    2016-10-27 The Great Indoors 5.3    2016-09-19 The Good Place 7.8    2010-07-12 The Silence 6.8    2014-06-21 Almost Royal 6.5  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://nbc.com/superstore Genres Comedy Keywords department store store sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors 61 Banana 27 Nero Kosonen 21 Imzadi 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}