{"link": "https://www.themoviedb.org/tv/69340?language=en", "title": "James May: The Reassembler", "resume": "When we look around our homes, sheds and garages we see an array of household objects that with one click of a button or twist of a knob will spring to life, and - most of the time - do exactly what we want them to. But how on earth do these objects work? To find out, James May (fuelled by endless cups of tea) heads into his workshop with thousands of little pieces to assemble some of our most beloved and recognisable objects from scratch to see what it actually takes to get them to work.", "rate": 78, "genre": ["Documentary"], "cast": ["James May"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69340   Expand James May: The Reassembler   (2016) User Score Overview When we look around our homes, sheds and garages we see an array of household objects that with one click of a button or twist of a knob will spring to life, and - most of the time - do exactly what we want them to. But how on earth do these objects work? To find out, James May (fuelled by endless cups of tea) heads into his workshop with thousands of little pieces to assemble some of our most beloved and recognisable objects from scratch to see what it actually takes to get them to work. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James May Presenter Full Cast & Crew Last Season Series 2 2016 | 4 Episodes Season 2 of James May: The Reassembler premiered on December 28, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2014-08-10 James May's Cars of the People 8.6  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b086t743 Genres Documentary Keywords rebuilding Content Score 56 We're so close, yet so far. Top Contributors p 19 plumpro D 4 DracoAn 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}