{"link": "https://www.themoviedb.org/tv/64324?language=en", "title": "Sweden Laundry", "resume": "Middle child Kim Bom had a difficult childhood because her mother showered all her affection on Bom's older brother Eun-chul and her younger sister Eun-sol. Now that Bom is an adult, she runs a laundromat named Sweden Laundry. But she also has the supernatural ability to understand her customers' worries through their laundry. With the help of her employee Yong Soo-chul, Bom uses this to solve the problems of those around her.", "rate": 0, "genre": ["Comedy", "Drama", "Family", "Fantasy", "Romance"], "cast": ["Changjo", "Song Ha-yoon", "Kim Ian", "Oh Sang-Jin", "Hwang Seung-Eon"], "character": ["Yong Soo-chul", "Kim Bom", "Park Ki-joon", "Kim Eun-chul", "Kim Eun-sol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64324   Expand Sweden Laundry   (2014) User Score Overview Middle child Kim Bom had a difficult childhood because her mother showered all her affection on Bom's older brother Eun-chul and her younger sister Eun-sol. Now that Bom is an adult, she runs a laundromat named Sweden Laundry. But she also has the supernatural ability to understand her customers' worries through their laundry. With the help of her employee Yong Soo-chul, Bom uses this to solve the problems of those around her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Changjo Yong Soo-chul Song Ha-yoon Kim Bom Kim Ian Park Ki-joon Oh Sang-Jin Kim Eun-chul Hwang Seung-Eon Kim Eun-sol Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Sweden Laundry premiered on November 21, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sweden Laundry. You can help by rating TV shows you've seen. Facts Original Name  스웨덴 세탁소 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.mbcplus.com/program/swedenlaundry/ Genres Comedy Drama Family Fantasy Romance Keywords korea Content Score 86 Almost there... Top Contributors t 45 tmdb38202327 M 2 Maria180493 V 1 Violsa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}