{"link": "https://www.themoviedb.org/tv/55841?language=en", "title": "Verbrechen", "resume": "A respected small-town physician has brutally killed his wife, thus ending a four-year martyrdom from which he could not escape by any other means...", "rate": 70, "genre": ["Crime"], "cast": ["Josef Bierbichler", "Edgar Selge", "Annette Paulmann", "Denis Moschitto", "Adam Bousdoukos"], "character": ["Friedrich Leonhardt", "Dr. Friedhelm Fähner (Episode 1)", "Ingrid Fähner (Episode 1)", "Özcan (Episode 2)", "Manolis (Episode 2)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55841   Expand Verbrechen   (2013) User Score Overview A respected small-town physician has brutally killed his wife, thus ending a four-year martyrdom from which he could not escape by any other means... Featured Crew Oliver Berben Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josef Bierbichler Friedrich Leonhardt Edgar Selge Dr. Friedhelm Fähner (Episode 1) Annette Paulmann Ingrid Fähner (Episode 1) Denis Moschitto Özcan (Episode 2) Adam Bousdoukos Manolis (Episode 2) Full Cast & Crew Last Season Season 1 2013 | 6 Episodes Season 1 of Verbrechen premiered on April  7, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Verbrechen. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Verbrechen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Miniseries Original Language  German Runtime  45m Homepage  - Genres Crime Keywords court murder suspense miniseries crime criminal defence lawyer Content Score 93 Almost there... Top Contributors A 30 Abidala TB 20 TMDb Bot L 11 Lysator 8 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}