{"link": "https://www.themoviedb.org/tv/31077?language=en", "title": "My Boss My Hero", "resume": "Sakaki Makio, also known as \"Tornado\" is a tough 27-year-old high school drop-out. By academic standards, he's pretty dumb. His father decides to force Makio to return to high school to receive his diploma and he asks an old friend who happens to be the principal of a nearby school to admit Makio. If Makio doesn't graduate, the position of boss will be given to his younger brother, Mikio. Furthermore, he must pose as a 17-year-old during school hours and in the presence of any classmates or teachers outside of school. If his cover is blown, it would be the end of his high school career as well as his hopes to become boss. Things start out rough and tough as Makio's violent temper is tested. As the lessons and days go by he learns there is much more to school than just tests and studying.", "rate": 73, "genre": ["Drama", "Comedy"], "cast": ["Tomoya Nagase", "Yuya Tegoshi", "Yui Aragaki", "Yuu Kashii", "Chiaki Satō"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31077   Expand My Boss My Hero   (2006) User Score Overview Sakaki Makio, also known as \"Tornado\" is a tough 27-year-old high school drop-out. By academic standards, he's pretty dumb. His father decides to force Makio to return to high school to receive his diploma and he asks an old friend who happens to be the principal of a nearby school to admit Makio. If Makio doesn't graduate, the position of boss will be given to his younger brother, Mikio. Furthermore, he must pose as a 17-year-old during school hours and in the presence of any classmates or teachers outside of school. If his cover is blown, it would be the end of his high school career as well as his hopes to become boss. Things start out rough and tough as Makio's violent temper is tested. As the lessons and days go by he learns there is much more to school than just tests and studying. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomoya Nagase Yuya Tegoshi Yui Aragaki Yuu Kashii Chiaki Satō Full Cast & Crew Last Season My boss, my hero season 1 2006 | 10 Episodes Season 1 of My Boss My Hero premiered on July  8, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for My Boss My Hero. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2011-07-11 Full Throttle Girl 7.6    2008-07-03 Code Blue 8.0    2005-10-15 Nobuta wo Produce 7.3    2012-04-17 Legal High 9.4  Facts Original Name  マイ★ボス マイ★ヒーロー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.ntv.co.jp/boss/ Genres Drama Comedy Keywords high school japan gangster Content Score 86 Almost there... Top Contributors 15 Wendy 6 SWFT 5 tcx4c70 A 4 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}