{"link": "https://www.themoviedb.org/tv/53095?language=en", "title": "Two Weeks", "resume": "Jang Tae San is a man who has been living a meaningless life and  never thinks toward his future. He is on the run after being falsely  accused of murder. Furthermore, he discovers that he has a daughter who  is now suffering from leukemia. The drama spans exactly two weeks, and  tells about Tae San's desperate struggles to save his daughter.", "rate": 80, "genre": ["Action", "Adventure", "Drama"], "cast": ["Lee Joon-gi", "Park Ha-sun", "Kim So-yeon", "Lee Chae-mi", "Im Se-Mi"], "character": ["Jang Tae San", "Seo In Hye", "Park Jae gyeong", "Seo Soo Jin", "Oh Mi-sook"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53095   Expand Two Weeks   (2013) User Score Overview Jang Tae San is a man who has been living a meaningless life and  never thinks toward his future. He is on the run after being falsely  accused of murder. Furthermore, he discovers that he has a daughter who  is now suffering from leukemia. The drama spans exactly two weeks, and  tells about Tae San's desperate struggles to save his daughter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Joon-gi Jang Tae San Park Ha-sun Seo In Hye Kim So-yeon Park Jae gyeong Lee Chae-mi Seo Soo Jin Im Se-Mi Oh Mi-sook Full Cast & Crew Last Season Season 1 2013 | 16 Episodes Season 1 of Two Weeks premiered on August  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Two Weeks. You can help by rating TV shows you've seen. Facts Original Name  투윅스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/2w/ Genres Action & Adventure Drama Keywords korea Content Score 86 Almost there... Top Contributors M 27 Maria180493 N 13 Nightowl.Kr S 6 Siyra CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}