{"link": "https://www.themoviedb.org/tv/2659?language=en", "title": "Maggie and the Ferocious Beast", "resume": "Maggie and the Ferocious Beast is a Canadian animated TV series based on the books by Michael Paraskevas and his mother Betty.\nIn the show, five-year old Maggie creates her own map of her imaginary world called Nowhere Land that, in reality, takes the characters nowhere. She imagines that are her friends. The show also features friends like mice, cows, and rabbits.\nThe theme song for the show is \"Maggie and the Ferocious Beast in Nowhere Land,\" which is an original song by an unknown artist. Maggie and The Ferocious Beast is produced by Nelvana and directed by Jamie Whitney and Stuart Shankly. The series debuted in 2000 and the series aired its last episode 2003. The show was distributed by Nelvana, which owned the distribution rights. In the UK, the show was dubbed with British voice actors, replacing the original American soundtrack.\nThe show is a Teletoon Original Production and first aired on Teletoon on August 26, 2000.\nMaggie and the Ferocious Beast once aired on American children's channel Nick Jr. from July 15, 2000 until October 30, 2010 and has not been shown on any US station ever since.", "rate": 50, "genre": ["Animation"], "cast": ["Steven Ouimette", "Gerrit Schmidt-Foß", "Adrian Truss", "Kristen Bone", "Tamara Bernier"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2659   Expand Maggie and the Ferocious Beast   (2000) User Score Overview Maggie and the Ferocious Beast is a Canadian animated TV series based on the books by Michael Paraskevas and his mother Betty. In the show, five-year old Maggie creates her own map of her imaginary world called Nowhere Land that, in reality, takes the characters nowhere. She imagines that are her friends. The show also features friends like mice, cows, and rabbits. The theme song for the show is \"Maggie and the Ferocious Beast in Nowhere Land,\" which is an original song by an unknown artist. Maggie and The Ferocious Beast is produced by Nelvana and directed by Jamie Whitney and Stuart Shankly. The series debuted in 2000 and the series aired its last episode 2003. The show was distributed by Nelvana, which owned the distribution rights. In the UK, the show was dubbed with British voice actors, replacing the original American soundtrack. The show is a Teletoon Original Production and first aired on Teletoon on August 26, 2000. Maggie and the Ferocious Beast once aired on American children's channel Nick Jr. from July 15, 2000 until October 30, 2010 and has not been shown on any US station ever since. Featured Crew Michael Paraskevas Creator Betty Paraskevas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steven Ouimette Gerrit Schmidt-Foß Adrian Truss Kristen Bone Tamara Bernier Full Cast & Crew Last Season Season 2 2003 | 13 Episodes Season 2 of Maggie and the Ferocious Beast premiered on January  6, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Maggie and the Ferocious Beast. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m, 22m Homepage   http://www.ferociousbeast.com/ Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}