{"link": "https://www.themoviedb.org/tv/80512?language=en", "title": "Каменская - 2", "resume": "The second adaptation of Alexandra Marinina's novels - \"I died yesterday\", \"The stolen dream\", \"Men's games\", \"Everything must be paid for.\" Criminal investigation officer Anastasia Kamenskaya is able to calculate the criminal by the most insignificant details of his actions, character, psychology.", "rate": 100, "genre": ["Action", "Adventure", "Mystery", "Drama", "Comedy", "Crime"], "cast": ["Elena Yakovleva", "Sergey Nikonenko", "Andrey Ilin", "Dmitriy Nagiev", "Sergey Garmash"], "character": ["Анастасия Павловна Каменская (главная роль)", "Виктор Алексеевич Гордеев (\"Колобок\", главная роль, полковник, начальник Каменской)", "Лёша Чистяков (главная роль, муж Насти)", "Михаил Лесников (главная роль, сотрудник Интерпола)", "Юрий Викторович Коротков (главная роль, старший оперуполномоченный, майор)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80512   Expand Каменская - 2   (2002) User Score  Play Trailer Overview The second adaptation of Alexandra Marinina's novels - \"I died yesterday\", \"The stolen dream\", \"Men's games\", \"Everything must be paid for.\" Criminal investigation officer Anastasia Kamenskaya is able to calculate the criminal by the most insignificant details of his actions, character, psychology. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Elena Yakovleva Анастасия Павловна Каменская (главная роль) Sergey Nikonenko Виктор Алексеевич Гордеев (\"Колобок\", главная роль, полковник, начальник Каменской) Andrey Ilin Лёша Чистяков (главная роль, муж Насти) Dmitriy Nagiev Михаил Лесников (главная роль, сотрудник Интерпола) Sergey Garmash Юрий Викторович Коротков (главная роль, старший оперуполномоченный, майор) Full Cast & Crew Last Season Season 1 2002 | 16 Episodes Season 1 of Каменская - 2 premiered on December  7, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  6 Posters  1 Recommendations   2005-12-09 Каменская - 4 10.0    2001-12-22 Black Raven 10.0    2003-09-29 Каменская - 3 10.0    2008-11-16 Kamenskaya - 5 10.0  Facts Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Scripted Original Language  Russian Runtime  - Homepage  - Genres Action & Adventure Mystery Drama Comedy Crime Keywords russian novels russian detective series Content Score 93 Almost there... Top Contributors n 38 navarro2018 11 Elena Sergeeva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}