{"link": "https://www.themoviedb.org/tv/50864?language=en", "title": "The Impostor", "resume": "La Impostora, is a Spanish-language telenovela presumably to be produced by United States-based television network Telemundo Studios, Miami.", "rate": 60, "genre": ["Drama"], "cast": ["Lisette Morelos", "Christian Bach", "Sebastián Zurita", "Manuel Landeta", "Begoña Narváez"], "character": ["Blanca Guerrero / Victoria San Marino \"La Impostora\"", "Raquel Altamira", "Eduardo Leon Altamira", "Adriano Ferrer", "Mariana Serrano"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50864   Expand The Impostor   (2014) User Score Overview La Impostora, is a Spanish-language telenovela presumably to be produced by United States-based television network Telemundo Studios, Miami. Featured Crew Sebastian Arrau Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisette Morelos Blanca Guerrero / Victoria San Marino \"La Impostora\" Christian Bach Raquel Altamira Sebastián Zurita Eduardo Leon Altamira Manuel Landeta Adriano Ferrer Begoña Narváez Mariana Serrano Full Cast & Crew Last Season Season 1 2014 | 4 Episodes Season 1 of The Impostor premiered on January 14, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Impostor. You can help by rating TV shows you've seen. Facts Original Name  La impostora Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  42m Homepage  - Genres Drama Keywords telenovela Content Score 93 Almost there... Top Contributors s 19 shiff7 d 5 dmenendezgonzalez z 5 zurman1 3 vipkoza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}