{"link": "https://www.themoviedb.org/tv/15848?language=en", "title": "The Julekalender", "resume": "The Julekalender is a Norwegian Christmas season television series produced by and starring Travellin' Strawberrys in collaboration with Saks Film and Entertainment and TV 2, 1994. Around 400,000 viewers followed the series in December 1994, and it has since been broadcast anew in 1996, 2003, 2008 and 2012. It was based on the Danish series The Julekalender from 1991, which also inspired a Finnish version in 1997. The original concept and script of the series, as well as its numerous songs came from the Danish trio of De Nattergale.\nThe characters spoke Norwenglish, a pidgin of English and Norwegian. The series consisted of 24 episodes, and its production crew came from Trondheim, Norway.", "rate": 83, "genre": ["Comedy", "Family"], "cast": ["Arve Opsahl", "Tore Johansen", "Erling Mylius", "Ivar Gafseth"], "character": ["Good Old Gammel Nok", "Gjertrud Sand / Hansi", "Benny Jensen / Fritz", "Olaf Sand / Gynter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15848   Expand The Julekalender   (1994) User Score Overview The Julekalender is a Norwegian Christmas season television series produced by and starring Travellin' Strawberrys in collaboration with Saks Film and Entertainment and TV 2, 1994. Around 400,000 viewers followed the series in December 1994, and it has since been broadcast anew in 1996, 2003, 2008 and 2012. It was based on the Danish series The Julekalender from 1991, which also inspired a Finnish version in 1997. The original concept and script of the series, as well as its numerous songs came from the Danish trio of De Nattergale. The characters spoke Norwenglish, a pidgin of English and Norwegian. The series consisted of 24 episodes, and its production crew came from Trondheim, Norway. Featured Crew Hans-Erik Saks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arve Opsahl Good Old Gammel Nok Tore Johansen Gjertrud Sand / Hansi Erling Mylius Benny Jensen / Fritz Ivar Gafseth Olaf Sand / Gynter Full Cast & Crew Last Season Season 1 1994 | 24 Episodes Season 1 of The Julekalender premiered on December  1, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   1984-09-07 'Allo 'Allo! 7.8    1989-01-08 Agatha Christie's Poirot 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Norwegian Runtime  12m Homepage  - Genres Comedy Family Keywords christmas nordic christmas calendar Content Score 93 Almost there... Top Contributors 20 Martin 6 BryGur t 4 tfj1977 4 d00ziie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}