{"link": "https://www.themoviedb.org/tv/74833?language=en", "title": "Anna Karenina", "resume": "In late-19th-century Russian high society, St. Petersburg aristocrat Anna Karenina enters into a life-changing affair with the dashing Count Alexei Vronsky. An eight part adaptation of Leo Tolstoy's \"Anna Karenina\" from Vronsky's point of view.", "rate": 0, "genre": [], "cast": ["Elizaveta Boyarskaya", "Maksim Matveev", "Vitaly Kishchenko", "Kirill Grebenshchikov", "Tatyana Lyutaeva"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74833   Expand Anna Karenina   (2017) User Score Overview In late-19th-century Russian high society, St. Petersburg aristocrat Anna Karenina enters into a life-changing affair with the dashing Count Alexei Vronsky. An eight part adaptation of Leo Tolstoy's \"Anna Karenina\" from Vronsky's point of view. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elizaveta Boyarskaya Maksim Matveev Vitaly Kishchenko Kirill Grebenshchikov Tatyana Lyutaeva Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Anna Karenina premiered on April 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Anna Karenina. You can help by rating TV shows you've seen. Facts Original Name  Анна Каренина Status  Ended Network Certification  - Type  Miniseries Original Language  Russian Runtime  - Homepage   http://karenina.russia.tv Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 16 Homer95 13 Elizabeth Jennings a 3 atom100 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}