{"link": "https://www.themoviedb.org/tv/33868?language=en", "title": "Porterhouse Blue", "resume": "In late-'80s Britain, Porterhouse College Cambridge is an anachronism, its students uniformly male and (in the vast number of cases) privately educated. When the incumbent Master dies (from a stroke brought on by overeating) the government revenges itself on Porterhouse by appointing as his successor an old graduate, the politician Sir Godber Evans. One of the tiny minority of state-school students the college has had forced on it over the years, Evans returns to his alma mater determined to drag this bastion of privilege into the twentieth century. The elderly academic staff cease their bickering and close ranks against him, but the new Master finds his most implacable and unscrupulous opponent in Skullion, the college porter.", "rate": 80, "genre": ["Comedy"], "cast": ["John Sessions", "David Jason", "Paul Rogers", "Griff Rhys Jones", "Harold Innocent"], "character": ["Zipser", "Skullion", "Cornelius Carrington"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33868   Expand Porterhouse Blue   (1987) User Score Overview In late-'80s Britain, Porterhouse College Cambridge is an anachronism, its students uniformly male and (in the vast number of cases) privately educated. When the incumbent Master dies (from a stroke brought on by overeating) the government revenges itself on Porterhouse by appointing as his successor an old graduate, the politician Sir Godber Evans. One of the tiny minority of state-school students the college has had forced on it over the years, Evans returns to his alma mater determined to drag this bastion of privilege into the twentieth century. The elderly academic staff cease their bickering and close ranks against him, but the new Master finds his most implacable and unscrupulous opponent in Skullion, the college porter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Sessions Zipser David Jason Skullion Paul Rogers Griff Rhys Jones Cornelius Carrington Harold Innocent Full Cast & Crew Last Season Season 1 1987 | 4 Episodes Season 1 of Porterhouse Blue premiered on June  3, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Porterhouse Blue. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords college satire cambridge miniseries education system british humour Content Score 86 Almost there... Top Contributors TB 21 TMDb Bot R 6 Rebecca O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}