{"link": "https://www.themoviedb.org/tv/40075?language=en", "title": "Gravity Falls", "resume": "Twin brother and sister Dipper and Mabel Pines are in for an unexpected adventure when they spend the summer helping their great uncle Stan run a tourist trap in the mysterious town of Gravity Falls, Oregon.", "rate": 83, "genre": ["Animation", "Comedy", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Jason Ritter", "Kristen Schaal", "Alex Hirsch", "Linda Cardellini", "Carl Faruolo"], "character": ["Dipper Pines (voice)", "Mabel Pines (voice)", "Grunkle Stan / Soos / Old Man McGucket", "Wendy (voice)", "Grenda (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40075   Expand Gravity Falls   (2012) User Score  Play Trailer Overview Twin brother and sister Dipper and Mabel Pines are in for an unexpected adventure when they spend the summer helping their great uncle Stan run a tourist trap in the mysterious town of Gravity Falls, Oregon. Featured Crew Alex Hirsch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Jason Ritter Dipper Pines (voice) Kristen Schaal Mabel Pines (voice) Alex Hirsch Grunkle Stan / Soos / Old Man McGucket Linda Cardellini Wendy (voice) Carl Faruolo Grenda (voice) Full Cast & Crew Last Season Season 2 2014 | 20 Episodes Season 2 of Gravity Falls premiered on August  1, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Wacky... Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  6 Posters  9 Recommendations   2007-08-17 Phineas and Ferb 7.5    2010-09-06 Regular Show 7.3    2015-08-24 We Bare Bears 7.2    2013-07-21 Axe Cop 5.5    2014-08-22 BoJack Horseman 8.0    2014-11-03 Over the Garden Wall 8.3    2011-05-03 The Amazing World of Gumball 7.7    2003-07-19 Teen Titans 7.6  Facts Status  Ended Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   http://disneyxd.disney.com/gravity-falls Genres Animation Comedy Mystery Sci-Fi & Fantasy Keywords symbolism mystery kids supernatural phenomena tourist trap Content Score 100 Yes! Looking good! Top Contributors 45 Josh Dudley 34 Elizabeth Jennings 25 Aidan Duff 20 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}