{"link": "https://www.themoviedb.org/tv/63814?language=en", "title": "My Best Ex-Boyfriend", "resume": "Parents force the breakup of two couples, but what happens to their lingering feelings years later? Li Tang and Fu Fang Si were high school sweethearts, but the two end up breaking up due to pressures from Li Tang’s father and a misunderstanding. Li Tang eventually stands up to his father and leaves to start his own company. Years later, Fang Si is finally achieving her dreams as a fashion designer and dating Yin Hao Ran. But their relationship gets complicated when Li Tang comes back into Fang Si’s life just as she is struggling professionally. Li Tang is now engaged to Cheng Xiang Nan, a supermodel, who also happens to be Hao Ran’s ex-girlfriend. Xiang Nan was forced to break up with Hao Ran by her ambitious mother, but she has never gotten over her feelings for him. Will Li Tang and Fang Si now have the courage to listen to their own hearts?", "rate": 65, "genre": ["Comedy", "Drama", "Romance"], "cast": ["Jerry Yan", "Ron Ng", "Mi Lu", "Maggie Jiang"], "character": ["Li Tang", "Yin Hao Ran", "Cheng Xiang Nan", "Fu Fang Si"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63814   Expand My Best Ex-Boyfriend   (2015) User Score Overview Parents force the breakup of two couples, but what happens to their lingering feelings years later? Li Tang and Fu Fang Si were high school sweethearts, but the two end up breaking up due to pressures from Li Tang’s father and a misunderstanding. Li Tang eventually stands up to his father and leaves to start his own company. Years later, Fang Si is finally achieving her dreams as a fashion designer and dating Yin Hao Ran. But their relationship gets complicated when Li Tang comes back into Fang Si’s life just as she is struggling professionally. Li Tang is now engaged to Cheng Xiang Nan, a supermodel, who also happens to be Hao Ran’s ex-girlfriend. Xiang Nan was forced to break up with Hao Ran by her ambitious mother, but she has never gotten over her feelings for him. Will Li Tang and Fang Si now have the courage to listen to their own hearts? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Yan Li Tang Ron Ng Yin Hao Ran Mi Lu Cheng Xiang Nan Maggie Jiang Fu Fang Si Full Cast & Crew Last Season Season 1 2015 | 42 Episodes Season 1 of My Best Ex-Boyfriend premiered on August 15, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Best Ex-Boyfriend. You can help by rating TV shows you've seen. Facts Original Name  最佳前男友 Status  Ended Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Comedy Drama Romance Keywords china Content Score 86 Almost there... Top Contributors M 23 Maria180493 z 5 zurman1 3 empireyura T 2 Tigrecito  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}