{"link": "https://www.themoviedb.org/tv/72876?language=en", "title": "Vlug Na Egipte", "resume": "The fact that they are living in the house belonging to the Master - may rest in peace - some residents of Breipaal raise the armor, make others uncomfortable and then there are those who predict that nothing can be done here Not especially after the murder of one of the residents. When Master appeared in the Haasbroek daughter inexplicably one night, things began to take a path that nobody could provide. All four tensions sometimes high and sometimes they sometimes make them sleepy, all at 'The Paal' - Brown and White, Incommers and old residents - are just people who have to overcome many obstacles in order to realize their dreams and ideals and to fear their fears overcome.", "rate": 100, "genre": ["Drama"], "cast": ["Clara Joubert van den Bergh", "Chris van Niekerk", "Leandie du Randt", "Eric Nobbs", "Frank Opperman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72876   Expand Vlug Na Egipte   (2015) User Score Overview The fact that they are living in the house belonging to the Master - may rest in peace - some residents of Breipaal raise the armor, make others uncomfortable and then there are those who predict that nothing can be done here Not especially after the murder of one of the residents. When Master appeared in the Haasbroek daughter inexplicably one night, things began to take a path that nobody could provide. All four tensions sometimes high and sometimes they sometimes make them sleepy, all at 'The Paal' - Brown and White, Incommers and old residents - are just people who have to overcome many obstacles in order to realize their dreams and ideals and to fear their fears overcome. Featured Crew Paul C. Venter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clara Joubert van den Bergh Chris van Niekerk Leandie du Randt Eric Nobbs Frank Opperman Full Cast & Crew Last Season Season 2 2015 | 13 Episodes Season 2 of Vlug Na Egipte premiered on April 14, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Vlug Na Egipte. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Vlug Na Egipte. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  Afrikaans Runtime  48m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 31 rudibuys30 10 Banana TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}