{"link": "https://www.themoviedb.org/tv/3304?language=en", "title": "Probe", "resume": "Probe is a 1988 American television pilot and subsequent TV series, created by television mystery writer William Link and noted science fiction author Isaac Asimov. It aired on ABC. Michael B. Wagner, a veteran television writer, wrote the two-hour pilot, and became Executive Producer for the series. The pilot and series starred Parker Stevenson as Austin James, a misanthropic genius who solved high tech crimes, and Ashley Crow as James' new secretary Mickey Castle.\nThe show began as a mid-season replacement and was canceled after a two-month run of the pilot and six episodes. Entire episodes have made their way on the internet through video-sharing sites such as YouTube.\nSome episodes of the show revolved around Serendip, a company founded by Austin that he has no interest in running. Mickey, his Serendip-appointed secretary, plays Watson to Austin's Holmes.", "rate": 0, "genre": ["Drama"], "cast": ["Parker Stevenson", "Ashley Crow"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3304   Expand Probe   (1988) User Score Overview Probe is a 1988 American television pilot and subsequent TV series, created by television mystery writer William Link and noted science fiction author Isaac Asimov. It aired on ABC. Michael B. Wagner, a veteran television writer, wrote the two-hour pilot, and became Executive Producer for the series. The pilot and series starred Parker Stevenson as Austin James, a misanthropic genius who solved high tech crimes, and Ashley Crow as James' new secretary Mickey Castle. The show began as a mid-season replacement and was canceled after a two-month run of the pilot and six episodes. Entire episodes have made their way on the internet through video-sharing sites such as YouTube. Some episodes of the show revolved around Serendip, a company founded by Austin that he has no interest in running. Mickey, his Serendip-appointed secretary, plays Watson to Austin's Holmes. Featured Crew Isaac Asimov Creator William Link Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Parker Stevenson Ashley Crow Full Cast & Crew Last Season Season 1 1988 | 7 Episodes Season 1 of Probe premiered on March  7, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Probe. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 1 viapicante  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}