{"link": "https://www.themoviedb.org/tv/79885?language=en", "title": "Dukla 61", "resume": "Drama about the family of an elite miner set against the backdrop of the biggest mining disaster of the second half of the 20th century, which left 108 men dead.", "rate": 0, "genre": ["Drama"], "cast": ["Izabela Firlová", "Martha Issová", "Marek Taclík", "Oskar Hes", "Antonie Formanová"], "character": ["Anežka", "Marie Šlachtová", "Milan Šlachta", "Petr Šlachta", "Jana Weissová"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79885   Expand Dukla 61   (2018) User Score Overview Drama about the family of an elite miner set against the backdrop of the biggest mining disaster of the second half of the 20th century, which left 108 men dead. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Izabela Firlová Anežka Martha Issová Marie Šlachtová Marek Taclík Milan Šlachta Oskar Hes Petr Šlachta Antonie Formanová Jana Weissová Full Cast & Crew Current Season Season 1 2018 | 2 Episodes Season 1 of Dukla 61 premiered on May 26, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Dukla 61. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  Czech Runtime  - Homepage   http://www.ceskatelevize.cz/porady/11490475387-dukla-61/ Genres Drama Keywords mining accident Content Score 93 Almost there... Top Contributors b 35 baluator 5 30 5lucina5 22 Banana 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}