{"link": "https://www.themoviedb.org/tv/31911?language=en", "title": "Fullmetal Alchemist: Brotherhood", "resume": "Edward and Alphonse Elric's reckless disregard for alchemy's fun­damental laws ripped half of Ed's limbs from his body and left Al's soul clinging to a cold suit of armor. To restore what was lost, the brothers scour a war-torn land for the Philosopher's Sto­ne, a fabled relic which grants the ability to perform alchemy in impossible ways.\nThe Elrics are not alone in their search; the corrupt State Military is also eager to harness the artifact's power. So too are the strange Homunculi and their shadowy creator. The mythical gem lures exotic alchemists from distant kingdoms, scarring some deeply enough to inspire murder. As the Elrics find their course altered by these enemies and allies, their purpose remains unchanged – and their bond unbreakable.", "rate": 84, "genre": ["Action", "Adventure", "Animation", "Drama", "Mystery"], "cast": ["Romi Park", "Rie Kugimiya", "Shin'ichirou Miki", "Kenta Miyake", "Fumiko Orikasa"], "character": ["Edward Elric", "Alphonse Elric", "Roy Mustang", "Scar", "Riza Hawkeye"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31911   Expand Fullmetal Alchemist: Brotherhood   (2009) User Score  Play Trailer Overview Edward and Alphonse Elric's reckless disregard for alchemy's fun­damental laws ripped half of Ed's limbs from his body and left Al's soul clinging to a cold suit of armor. To restore what was lost, the brothers scour a war-torn land for the Philosopher's Sto­ne, a fabled relic which grants the ability to perform alchemy in impossible ways. The Elrics are not alone in their search; the corrupt State Military is also eager to harness the artifact's power. So too are the strange Homunculi and their shadowy creator. The mythical gem lures exotic alchemists from distant kingdoms, scarring some deeply enough to inspire murder. As the Elrics find their course altered by these enemies and allies, their purpose remains unchanged – and their bond unbreakable. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  13 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Romi Park Edward Elric Rie Kugimiya Alphonse Elric Shin'ichirou Miki Roy Mustang Kenta Miyake Scar Fumiko Orikasa Riza Hawkeye Full Cast & Crew Last Season Season 1 2009 | 64 Episodes Season 1 of Fullmetal Alchemist: Brotherhood premiered on April  5, 2009. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Comic relief overkill Open 0 by movie_nazi\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  13 Posters  8 Recommendations   2003-10-04 Fullmetal Alchemist 8.0    2011-04-06 Steins;Gate 8.2    2006-10-05 Code Geass: Lelouch of the Rebellion 8.1    2013-04-06 Attack on Titan 7.6    1998-04-03 Cowboy Bebop 8.2    2006-10-04 Death Note 8.2    2015-10-04 One-Punch Man 8.2    2011-10-02 Hunter x Hunter 8.5  Facts Original Name  鋼の錬金術師 FULLMETAL ALCHEMIST Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.hagaren.jp/fa/ Genres Action & Adventure Animation Drama Mystery Keywords fantasy politics supernatural conspiracy based on manga alchemy alchemist shounen anime Content Score 93 Almost there... Top Contributors 41 WillofOwn 17 sp1ti 16 Sadwick 9 Razze  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}