{"link": "https://www.themoviedb.org/tv/31?language=en", "title": "French Fields", "resume": "French Fields is a British situation comedy. It ran for 19 episodes from 5 September 1989 to 8 October 1991. It was written by John T. Chapman and Ian Davidson and was produced by Thames Television for ITV.\nThe series starred Anton Rodgers and Julia McKenzie as husband and wife William and Hester Fields and followed the series Fresh Fields, which ran from 7 March 1984 to 23 October 1986. At the end of the last series of Fresh Fields, William accepted a position with a French company. French Fields follows Hester and William after they make the move to Calais.\nOther regular cast included their French real estate agent Chantal, who was also the Fields' neighbour to the left. On the right, were the horrible and snobbish English couple the Trendles. Hester and William also coped with Madame Remoleux, an unintelligible and ancient French woman who lived in and cared for the estate — called Les Hirondelles — where they all lived. Also, popping in on a regular basis, were local farmer and mayor Monsieur Dax and his daughter Marie-Christine, to whom Hester did her best to teach English. Nicholas Courtney also appeared frequently as the Marquis.", "rate": 80, "genre": ["Comedy"], "cast": ["Anton Rodgers", "Julia McKenzie", "Pamela Salem", "Liz Crowther"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31   Expand French Fields   (1989) User Score Overview French Fields is a British situation comedy. It ran for 19 episodes from 5 September 1989 to 8 October 1991. It was written by John T. Chapman and Ian Davidson and was produced by Thames Television for ITV. The series starred Anton Rodgers and Julia McKenzie as husband and wife William and Hester Fields and followed the series Fresh Fields, which ran from 7 March 1984 to 23 October 1986. At the end of the last series of Fresh Fields, William accepted a position with a French company. French Fields follows Hester and William after they make the move to Calais. Other regular cast included their French real estate agent Chantal, who was also the Fields' neighbour to the left. On the right, were the horrible and snobbish English couple the Trendles. Hester and William also coped with Madame Remoleux, an unintelligible and ancient French woman who lived in and cared for the estate — called Les Hirondelles — where they all lived. Also, popping in on a regular basis, were local farmer and mayor Monsieur Dax and his daughter Marie-Christine, to whom Hester did her best to teach English. Nicholas Courtney also appeared frequently as the Marquis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anton Rodgers Julia McKenzie Pamela Salem Liz Crowther Full Cast & Crew Last Season Season 3 1991 | 6 Episodes Season 3 of French Fields premiered on September  3, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on French Fields. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords france sequel neighbor expatriate Content Score 86 Almost there... Top Contributors 4 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}