{"link": "https://www.themoviedb.org/tv/47357?language=en", "title": "Son of the Morning Star", "resume": "The story of George Custer, Crazy Horse and the events prior to the battle of the Little Bighorn, told from the different perspectives of two women.", "rate": 70, "genre": ["Drama"], "cast": ["Gary Cole", "Rosanna Arquette", "Stanley Anderson", "Edward Blatchford", "George Dickerson"], "character": ["George Armstrong Custer", "Libby Custer", "Ulysses S. Grant", "Lt. Cooke", "Gen. Sherman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47357   Expand Son of the Morning Star   (1991) User Score Overview The story of George Custer, Crazy Horse and the events prior to the battle of the Little Bighorn, told from the different perspectives of two women. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Cole George Armstrong Custer Rosanna Arquette Libby Custer Stanley Anderson Ulysses S. Grant Edward Blatchford Lt. Cooke George Dickerson Gen. Sherman Full Cast & Crew Last Season Miniseries 1991 | 2 Episodes Season 1 of Son of the Morning Star premiered on February  3, 1991. View All Seasons Social Reviews  1 Discussions  0 A review by Wuchak  6.0 Written by  Wuchak  on April  7, 2018 Realistic account of events leading up to Little Bighorn RELEASED TO TV IN EARLY 1991 and directed by Mike Robe, \"Son of the Morning Star\" chronicles the story of George Armstrong Custer (Gary Cole) after the Civil War and to his death at Little Bighorn on June 25, 1876. The story is narrated from the different perspectives of two women: Custer’s wife (Rosanna Arquette) and a Cheyenne woman, Kate Bighead (Buffy Sainte-Marie/ Kimberly Guerrero).  This was originally shown in two parts on TV 2.5 months after the theatrical release of 1990’s “Dances with Wolves.” Kevin Costner, the star of “...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Son of the Morning Star. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Drama Keywords native american flashback sequence miniseries sioux wars american civil war ulysses s. grant gold miner crazy horse historical drama american indian wars battle of the little bighorn george armstrong custer Content Score 86 Almost there... Top Contributors TB 32 TMDb Bot 12 Banana a 3 atom100  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}