{"link": "https://www.themoviedb.org/tv/198?language=en", "title": "Bless This House", "resume": "Bless this house is a British sitcom starring Sid James and Diana Coupland that aired on ITV from the 2nd February 1971 to the 22nd April 1976. It was written by Derek Collyer, David Comming, B.C. Cummins, Harry Driver, George Evans, Dave Freeman, Carla Lane, Brian Platt, Vince Powell, Adele Rose, Mike Sharland, Bernie Sharp, Myra Taylor, Jon Watkins and Lawrie Wyman. It was made for the ITV network by Thames Television. In 2004, Bless this house came 67th in Britain's best sitcom.", "rate": 74, "genre": ["Comedy"], "cast": ["Sid James", "Diana Coupland", "Sally Geeson", "Robin Stewart"], "character": ["Sid Abbott", "Jean Abbott", "Sally Abbott", "Mike Abbott"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 198   Expand Bless This House   (1971) User Score Overview Bless this house is a British sitcom starring Sid James and Diana Coupland that aired on ITV from the 2nd February 1971 to the 22nd April 1976. It was written by Derek Collyer, David Comming, B.C. Cummins, Harry Driver, George Evans, Dave Freeman, Carla Lane, Brian Platt, Vince Powell, Adele Rose, Mike Sharland, Bernie Sharp, Myra Taylor, Jon Watkins and Lawrie Wyman. It was made for the ITV network by Thames Television. In 2004, Bless this house came 67th in Britain's best sitcom. Featured Crew Harry Driver Creator Vince Powell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sid James Sid Abbott Diana Coupland Jean Abbott Sally Geeson Sally Abbott Robin Stewart Mike Abbott Full Cast & Crew Last Season Season 6 1976 | 13 Episodes Season 6 of Bless This House premiered on January 29, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   Kermit's Swamp Years 3.8    1979-10-29 Only When I Laugh 6.0    1978-02-24 Going Straight 7.3    Randall and Hopkirk (Deceased) 7.0    1972-04-13 Love Thy Neighbour 8.9    1976-09-06 George and Mildred 6.6    1993-01-27 The Detectives 7.1    1990-08-09 Drop the Dead Donkey 7.5  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords family sitcom british humour Content Score 93 Almost there... Top Contributors m 69 mercman 8 Banana O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}