{"link": "https://www.themoviedb.org/tv/71340?language=en", "title": "Krypton", "resume": "Set two generations before the destruction of the legendary Man of Steel’s home planet, Krypton follows Superman’s grandfather — whose House of El was ostracized and shamed — as he fights to redeem his family’s honor and save his beloved world from chaos.", "rate": 67, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Cameron Cuffe", "Shaun Sipos", "Ann Ogbomo", "Aaron Pierre", "Georgina Campbell"], "character": ["Seg-El", "Adam Strange", "Jayna-Zod", "Dev-Em", "Lyta-Zod"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71340   Expand Krypton   (2018) User Score  Play Trailer Overview Set two generations before the destruction of the legendary Man of Steel’s home planet, Krypton follows Superman’s grandfather — whose House of El was ostracized and shamed — as he fights to redeem his family’s honor and save his beloved world from chaos. Featured Crew David S. Goyer Creator Ian B. Goldberg Creator Damian Kindler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  12 Posters  14 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cameron Cuffe Seg-El Shaun Sipos Adam Strange Ann Ogbomo Jayna-Zod Aaron Pierre Dev-Em Georgina Campbell Lyta-Zod Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Krypton premiered on March 21, 2018. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply D Didn't see that coming Open 0 by Drew007\n      \n     Jayna-Zod is awesome Open 1 by  GForce59 Faily Terrible Open 1 by  tavares1970 Go to Discussions Media Most Popular Videos  2 Backdrops  12 Posters  14 Recommendations   2018-03-18 Instinct 5.9    2018-03-11 Deception 7.0    2018-03-13 For The People 6.5    2018-03-29 Siren 7.3    2014-07-17 Satisfaction 5.0    2018-03-25 Barry 7.2    2013-10-22 Ravenswood 4.5    2018-03-27 Splitting Up Together 5.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.syfy.com/krypton Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords alien planet Content Score 100 Yes! Looking good! Top Contributors 49 Elizabeth Jennings G 42 Gustave2001 R 13 Rebecca 8 Andrew Gill  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}