{"link": "https://www.themoviedb.org/tv/10823?language=en", "title": "Teen Wolf", "resume": "Teen Wolf, known as The Cartoon Adventures of Teen Wolf in the United Kingdom, is an animated American television series broadcast from 1986 to 1987 that was produced by Southern Star Productions in association with Clubhouse Pictures. It was based on the 1985 live-action film, Teen Wolf.", "rate": 70, "genre": ["Action", "Adventure", "Animation"], "cast": ["Jeannie Elias", "Don Most", "June Foray", "Stacy Keach, Sr.", "Townsend Coleman"], "character": ["Boof", "Stiles", "Grandma", "Grandpa", "Scott Howard (Teen Wolf)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10823   Expand Teen Wolf   (1986) User Score Overview Teen Wolf, known as The Cartoon Adventures of Teen Wolf in the United Kingdom, is an animated American television series broadcast from 1986 to 1987 that was produced by Southern Star Productions in association with Clubhouse Pictures. It was based on the 1985 live-action film, Teen Wolf. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeannie Elias Boof Don Most Stiles June Foray Grandma Stacy Keach, Sr. Grandpa Townsend Coleman Scott Howard (Teen Wolf) Full Cast & Crew Last Season Season 2 1987 | 8 Episodes Season 2 of Teen Wolf premiered on September 19, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Teen Wolf. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Animation Keywords cartoon werewolf family based on movie Content Score 71 Just a little bit more... Top Contributors R 32 Rebecca z 5 zurman1 3 Shilvenrha  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}