{"link": "https://www.themoviedb.org/tv/64487?language=en", "title": "Remember", "resume": "Diagnosed with hyperthymesia, Seo Jin Woo possesses an uncanny memory, which he uses to his advantage as a lawyer defending his wrongfully convicted father. But when Jin Woo is afflicted with Alzheimer’s, his only link to his father’s innocence begins to fray. With a mind that’s both his greatest asset and greatest liability, can justice prevail?", "rate": 79, "genre": ["Drama", "Romance"], "cast": ["Yoo Seung-Ho", "Park Min-young", "Park Sung-woong", "Namgoong Min", "Jung Hye-sung"], "character": ["Seo Jin-Woo", "Lee In-A", "Park Dong-Ho", "Nam Gyoo-Man", "Nam Yeo-Kyung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64487   Expand Remember   (2015) User Score Overview Diagnosed with hyperthymesia, Seo Jin Woo possesses an uncanny memory, which he uses to his advantage as a lawyer defending his wrongfully convicted father. But when Jin Woo is afflicted with Alzheimer’s, his only link to his father’s innocence begins to fray. With a mind that’s both his greatest asset and greatest liability, can justice prevail? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  9 Videos Trailers  0 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo Seung-Ho Seo Jin-Woo Park Min-young Lee In-A Park Sung-woong Park Dong-Ho Namgoong Min Nam Gyoo-Man Jung Hye-sung Nam Yeo-Kyung Full Cast & Crew Last Season Season 1 2015 | 20 Episodes Season 1 of Remember premiered on December  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  3 Posters  9 Recommendations   2012-03-21 The King 2 Hearts 8.4    2012-03-21 Rooftop Prince 8.1    2012-01-04 Moon Embracing the Sun 8.4    2015-06-22 I Remember You 7.1    2014-05-05 Doctor Stranger 7.3    2014-12-08 Healer 8.7    2013-06-05 I Hear Your Voice 8.2    2015-11-16 Oh My Venus 7.8  Facts Original Name  리멤버 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/remember2015 Genres Drama Romance Keywords korea Content Score 93 Almost there... Top Contributors M 58 Maria180493 z 10 zurman1 s 5 sheva_vitali 4 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}