{"link": "https://www.themoviedb.org/tv/66439?language=en", "title": "Life, Death and Reincarnation", "resume": "An epic adventure that aims to unravel the mystery at the heart of our existence: the questions of our identity and our destiny.  The series features some of the world’s most baffling real life stories and exciting findings in the fields of consciousness studies, near-death experiences and past-life memories. Adventurous researchers following the evidence where it leads them have discovered that the lines of evidence converge to a conclusion that is refreshingly new – yet perennially known.", "rate": 98, "genre": ["Documentary"], "cast": ["Mike Cooper"], "character": ["Himself-Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66439   Expand Life, Death and Reincarnation   (2015) User Score  Play Trailer Overview An epic adventure that aims to unravel the mystery at the heart of our existence: the questions of our identity and our destiny.  The series features some of the world’s most baffling real life stories and exciting findings in the fields of consciousness studies, near-death experiences and past-life memories. Adventurous researchers following the evidence where it leads them have discovered that the lines of evidence converge to a conclusion that is refreshingly new – yet perennially known.  Featured Crew Varun Sharma Creator Sanjay Sharma Creator Vineeta Kapoor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike Cooper Himself-Narrator Full Cast & Crew Last Season Season 1 2015 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Life, Death and Reincarnation. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Documentary Original Language  English Runtime  52m Homepage   http://lifedeathandreincarnation.com Genres Documentary Keywords buddhism philosophy hinduism reincarnation religion india science consciousness out of body experience past life near-death experience Content Score 56 We're so close, yet so far. Top Contributors s 64 sanjayfsm 6 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}