{"link": "https://www.themoviedb.org/tv/45311?language=en", "title": "White Christmas", "resume": "Kim Yo Han is a psychiatrist who gets involved in a serial murder when his car broke down on Christmas Eve during a sudden storm and he is forced to take shelter at a private high school. Seven students and a teacher are also there over the winter break, but they are gradually murdered one by one as they receive letters from a killer who wants revenge for the death of his mother and sister.", "rate": 85, "genre": ["Mystery"], "cast": ["Sung Joon", "Kim Young-kwang", "Jung Suk-won", "Kim Sang-kyung", "Baek Sung-hyun"], "character": ["Choi Chi-hoon", "Jo Young-jae", "Yoon Jong-il", "Kim Yo-han", "Park Mu-yeol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45311   Expand White Christmas   (2011) User Score Overview Kim Yo Han is a psychiatrist who gets involved in a serial murder when his car broke down on Christmas Eve during a sudden storm and he is forced to take shelter at a private high school. Seven students and a teacher are also there over the winter break, but they are gradually murdered one by one as they receive letters from a killer who wants revenge for the death of his mother and sister.  Featured Crew Korean Broadcasting System Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sung Joon Choi Chi-hoon Kim Young-kwang Jo Young-jae Jung Suk-won Yoon Jong-il Kim Sang-kyung Kim Yo-han Baek Sung-hyun Park Mu-yeol Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of White Christmas premiered on January 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on White Christmas. You can help by rating TV shows you've seen. Facts Original Name  화이트 크리스마스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage  - Genres Mystery Keywords korea Content Score 93 Almost there... Top Contributors M 27 Maria180493 5 empireyura z 5 zurman1 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}