{"link": "https://www.themoviedb.org/tv/32539?language=en", "title": "Rev.", "resume": "Rev. is a British television sitcom produced by Big Talk Productions. The show premiered on BBC Two on 28 June 2010. The show's working titles were The City Vicar and Handle With Prayer. The series revolves around a Church of England priest, played by Tom Hollander, who becomes the vicar of an inner-city London church after leaving a small rural Suffolk parish.\nTom Hollander said,\"[w]e wanted to define ourselves in opposition to the cliché of a country vicar, partly because we wanted to depict England as it is now, rather than having a sort of bucolic-y, over the hills and far away, bird-tweeting England – we wanted the complications of the multi-cultural, multi-ethnic inner-city, where everything is much harder.\"\nOn 1 August 2012, BBC Two renewed Rev. for a third series of six episodes, which is set to air in 2014.", "rate": 85, "genre": ["Comedy", "Drama"], "cast": ["Tom Hollander", "Olivia Colman", "Steve Evets", "Ellen Thomas", "Miles Jupp"], "character": ["Adam", "Alex", "Colin", "Adoha", "Nigel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32539   Expand Rev.   (2010) User Score Overview Rev. is a British television sitcom produced by Big Talk Productions. The show premiered on BBC Two on 28 June 2010. The show's working titles were The City Vicar and Handle With Prayer. The series revolves around a Church of England priest, played by Tom Hollander, who becomes the vicar of an inner-city London church after leaving a small rural Suffolk parish. Tom Hollander said,\"[w]e wanted to define ourselves in opposition to the cliché of a country vicar, partly because we wanted to depict England as it is now, rather than having a sort of bucolic-y, over the hills and far away, bird-tweeting England – we wanted the complications of the multi-cultural, multi-ethnic inner-city, where everything is much harder.\" On 1 August 2012, BBC Two renewed Rev. for a third series of six episodes, which is set to air in 2014. Featured Crew Tom Hollander Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Hollander Adam Olivia Colman Alex Steve Evets Colin Ellen Thomas Adoha Miles Jupp Nigel Full Cast & Crew Last Season Series 3 — | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Rev.. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00sz26s Genres Comedy Drama Keywords england urban church british humour Content Score 93 Almost there... Top Contributors 31 DBD O 6 Ozbourne t 5 tristanb w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}