{"link": "https://www.themoviedb.org/tv/62945?language=en", "title": "The Virus", "resume": "Lee Myung-hyun and his disease control task force investigate a mutant virus that has a 100% fatality rate and kills the infected within three days. Not only must they find an antidote, they must also stop the epidemic from spreading and killing all of mankind.", "rate": 80, "genre": ["Thriller"], "cast": ["Uhm Ki-Joon", "Lee Ki-Woo", "Jo Hee-bong", "Ahn Suk-hwan", "Kim Yu-bin"], "character": ["Lee Myung-hyun", "Kim Se-jin", "Go Soo-kil", "Kim Do-jin", "Lee Joo-young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62945   Expand The Virus   (2013) User Score Overview Lee Myung-hyun and his disease control task force investigate a mutant virus that has a 100% fatality rate and kills the infected within three days. Not only must they find an antidote, they must also stop the epidemic from spreading and killing all of mankind. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Uhm Ki-Joon Lee Myung-hyun Lee Ki-Woo Kim Se-jin Jo Hee-bong Go Soo-kil Ahn Suk-hwan Kim Do-jin Kim Yu-bin Lee Joo-young Full Cast & Crew Last Season Season 1 2013 | 10 Episodes Season 1 of The Virus premiered on March  1, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Virus. You can help by rating TV shows you've seen. Facts Original Name  더 바이러스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/ocn/thevirus Genres Thriller Keywords korea medical drama Content Score 86 Almost there... Top Contributors t 34 tmdb38202327 z 5 zurman1 4 Elizabeth Jennings 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}