{"link": "https://www.themoviedb.org/tv/72027?language=en", "title": "Raven's Home", "resume": "Best friends Raven and Chelsea, now both divorced mothers, are raising their children in a house together. Their house is turned upside down when they realize one of Raven's children inherited the same psychic abilities as their mother.", "rate": 58, "genre": ["Family", "Comedy"], "cast": ["Raven-Symoné", "Issac Ryan Brown", "Navia Robinson", "Jason Maybaum", "Sky Katz"], "character": ["Raven Baxter", "Booker Baxter-Carter", "Nia Baxter-Carter", "Levi Grayson", "Tess"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72027   Expand Raven's Home   (2017) User Score  Play Trailer Overview Best friends Raven and Chelsea, now both divorced mothers, are raising their children in a house together. Their house is turned upside down when they realize one of Raven's children inherited the same psychic abilities as their mother. Featured Crew Scott Thomas Creator Jed Elinoff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Raven-Symoné Raven Baxter Issac Ryan Brown Booker Baxter-Carter Navia Robinson Nia Baxter-Carter Jason Maybaum Levi Grayson Sky Katz Tess Full Cast & Crew Current Season Season 2 2018 | 4 Episodes Season 2 of Raven's Home premiered on June 25, 2018. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply p Raven's Home - Season 2 Episode Titles and Airdates Open 2 by  Taylorfirst1 p Raven's Home Episode Titles and Airdates Open 13 by  poweranimals Did Disney learn nothing from Girl Meets World? Open 4 by  Olivergbyrne Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Raven's Home. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  25m Homepage   http://watchdisneychannel.go.com/ravens-home Genres Family Comedy Keywords psychic power single mother spin off sitcom Content Score 100 Yes! Looking good! Top Contributors 22 Elizabeth Jennings 14 razkoz 14 Banana 8 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}