{"link": "https://www.themoviedb.org/tv/21174?language=en", "title": "Arabian Nights: Sinbad's Adventures", "resume": "Arabian Nights: Sinbad's Adventures is a 52 episode anime series directed by Fumio Kurokawa and produced by Nippon Animation which was first aired in 1975. The story is based on the children story \"Sinbad the Sailor\".", "rate": 75, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Animation"], "cast": ["Kōji Yada", "Akira Kamiya", "Ichirō Nagai", "Mahito Tsujimura", "Noriko Ohara "], "character": ["Baruba (voice)", "Ali Baba (voice)", "Narrator (voice)", "Aladdin (voice)", "Sinbad (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21174   Expand Arabian Nights: Sinbad's Adventures   (1975) User Score Overview Arabian Nights: Sinbad's Adventures is a 52 episode anime series directed by Fumio Kurokawa and produced by Nippon Animation which was first aired in 1975. The story is based on the children story \"Sinbad the Sailor\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kōji Yada Baruba (voice) Akira Kamiya Ali Baba (voice) Ichirō Nagai Narrator (voice) Mahito Tsujimura Aladdin (voice) Noriko Ohara  Sinbad (voice) Full Cast & Crew Last Season Season 1 1975 | 1 Episode Season 1 of Arabian Nights: Sinbad's Adventures premiered on October  1, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Arabian Nights: Sinbad's Adventures. You can help by rating TV shows you've seen. Facts Original Name  アラビアンナイト シンドバットの冒険 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 22 tmdb983464 12 aiman 4 Banana c 2 chroz66  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}