{"link": "https://www.themoviedb.org/tv/63415?language=en", "title": "Uranium: Twisting the Dragon's Tail", "resume": "A stunning new documentary series exploring the incredible story of uranium, from its creation in an exploding star to its deployment in nuclear weapons, nuclear power, and nuclear medicine. It’s a journey across nine countries and more than a century of stories, to discover the rock that made the modern world. It’s part science, part history, and all epic adventure. Join physicist and YouTube phenomenon Dr. Derek Muller as he reveals the untold story of the most wondrous and terrifying rock on Earth.", "rate": 59, "genre": ["Documentary"], "cast": ["Derek Muller"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63415   Expand Uranium: Twisting the Dragon's Tail   (2015) User Score  Play Trailer Overview A stunning new documentary series exploring the incredible story of uranium, from its creation in an exploding star to its deployment in nuclear weapons, nuclear power, and nuclear medicine. It’s a journey across nine countries and more than a century of stories, to discover the rock that made the modern world. It’s part science, part history, and all epic adventure. Join physicist and YouTube phenomenon Dr. Derek Muller as he reveals the untold story of the most wondrous and terrifying rock on Earth. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derek Muller Himself - Host Full Cast & Crew Last Season Original Air Date Original Air Date PBS International Version (TV) Miniseries 2015 | 3 Episodes Season 1 of Uranium: Twisting the Dragon's Tail premiered on August  8, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Uranium: Twisting the Dragon's Tail. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Uranium: Twisting the Dragon's Tail. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Miniseries Original Language  English Runtime  51m Homepage   http://video.pbs.org/program/uranium-twisting-dragons-tail/ Genres Documentary Keywords physics nuclear power plant physicist science nuclear weapons nuclear power uranium Content Score 64 We're so close, yet so far. Top Contributors 52 Elizabeth Jennings 9 Banana 6 jmbis T 5 Tet  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}