{"link": "https://www.themoviedb.org/tv/4341?language=en", "title": "Hey Hey It's Saturday", "resume": "Hey Hey It's Saturday was a long-running variety television program on Australian television. It initially ran for 27 years, debuting on the Nine Network on 9 October 1971 and broadcasting its last episode on 20 November 1999. Its host throughout its entire run was Daryl Somers, who would later become executive producer of the program. The original producer, Gavin Disney, left the program in the 1980s and Somers then jointly formed his own production company, Somers Carroll Productions, with on-screen partner Ernie Carroll, the performer of Somers' puppet sidekick Ossie Ostrich.\nOn 25 July 2009, the Nine Network announced the show would return for two reunion specials in late 2009 and hinted if they rated strongly, the show could return full-time. The first reunion show aired on 30 September 2009 and the second on 7 October and both won the ratings on their respective nights.\nOn 7 December 2009, it was announced that the show was planned to return in 2010 with a speculated run of 20 episodes. During the 2010 premiere on Wednesday 14 April, it was indicated that the 20-episode run would be split into two groups, with a break between them, and the second group was broadcast on Saturday nights from 16 October 2010 with the season finale on 27 November 2010. The show did not return in 2011 and as of 2012, there has been no announcement of it ever coming back on air.", "rate": 0, "genre": ["Comedy"], "cast": ["Livinia Nixon", "Red Symons", "Wilbur Wilde", "Jacki MacDonald"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4341   Expand Hey Hey It's Saturday   (1971) User Score Overview Hey Hey It's Saturday was a long-running variety television program on Australian television. It initially ran for 27 years, debuting on the Nine Network on 9 October 1971 and broadcasting its last episode on 20 November 1999. Its host throughout its entire run was Daryl Somers, who would later become executive producer of the program. The original producer, Gavin Disney, left the program in the 1980s and Somers then jointly formed his own production company, Somers Carroll Productions, with on-screen partner Ernie Carroll, the performer of Somers' puppet sidekick Ossie Ostrich. On 25 July 2009, the Nine Network announced the show would return for two reunion specials in late 2009 and hinted if they rated strongly, the show could return full-time. The first reunion show aired on 30 September 2009 and the second on 7 October and both won the ratings on their respective nights. On 7 December 2009, it was announced that the show was planned to return in 2010 with a speculated run of 20 episodes. During the 2010 premiere on Wednesday 14 April, it was indicated that the 20-episode run would be split into two groups, with a break between them, and the second group was broadcast on Saturday nights from 16 October 2010 with the season finale on 27 November 2010. The show did not return in 2011 and as of 2012, there has been no announcement of it ever coming back on air. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Livinia Nixon Red Symons Wilbur Wilde Jacki MacDonald Full Cast & Crew Last Season Season 2010 2010 | 20 Episodes Season 2010 of Hey Hey It's Saturday premiered on April 14, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hey Hey It's Saturday. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage   http://www.heyhey.tv/ Genres Comedy Keywords variety show Content Score 86 Almost there... Top Contributors 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}