{"link": "https://www.themoviedb.org/tv/46547?language=en", "title": "Tazza", "resume": "Tazza is a 2008 South Korean television series starring Jang Hyuk, Han Ye-seul, Kim Min-joon, Kang Sung-yeon, Son Hyun-joo and Kim Kap-soo. It aired on SBS from September 16 to November 25, 2008 on Mondays and Tuesdays at 21:55 for 18 episodes.\nThe series is based on a comic book by Huh Young-man, which was also made into a live-action film in 2006, Tazza: The High Rollers.", "rate": 70, "genre": ["Action", "Adventure", "Drama"], "cast": ["Yeo Jin-goo", "Jang Hyuk", "Kim Min-joon", "Lee Han-Na", "Han Ye-seul"], "character": ["young Goni", "Kim Goni", "Young-min", "young Nan-sook", "Lee Nan-sook / Mi-na"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46547   Expand Tazza   (2008) User Score Overview Tazza is a 2008 South Korean television series starring Jang Hyuk, Han Ye-seul, Kim Min-joon, Kang Sung-yeon, Son Hyun-joo and Kim Kap-soo. It aired on SBS from September 16 to November 25, 2008 on Mondays and Tuesdays at 21:55 for 18 episodes. The series is based on a comic book by Huh Young-man, which was also made into a live-action film in 2006, Tazza: The High Rollers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yeo Jin-goo young Goni Jang Hyuk Kim Goni Kim Min-joon Young-min Lee Han-Na young Nan-sook Han Ye-seul Lee Nan-sook / Mi-na Full Cast & Crew Last Season Season 1 — | 21 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tazza. You can help by rating TV shows you've seen. Facts Original Name  타짜 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage  - Genres Action & Adventure Drama Keywords korea Content Score 86 Almost there... Top Contributors t 21 tmdb38202327 N 14 Nightowl.Kr CM 6 Cherche Moi 4 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}