{"link": "https://www.themoviedb.org/tv/70476?language=en", "title": "Kamen Sentai Gorider", "resume": "This 3-part net series will feature five characters who \"should not be in this world\". These five characters are Kamen Riders Another Agito, Baron, Marika, Lazer, and Blade. These five were either dead or have disappeared at the end of their respective Kamen Rider series. Actors Takanori Kikuchi, Yutaka Kobayashi, Minami Tsukui, Hayato Onozuka, and Takayuki Tsubaki will repirse their respective Rider roles in this spin-off.  The revival of these heroes are linked both to someone manipulating behind the scenes and the \"ultimate superhero team\" Kamen Sentai Gorider! This all ties into the Kamen Rider and Super Sentai team-up movie, Kamen Rider x Super Sentai: Chou Superhero Taisen!", "rate": 53, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Hiroki Iijima", "Yutaka Kobayashi", "Minami Tsukui", "Takayuki Tsubaki", "Takanori Kikuchi"], "character": ["Emu Hōjō / Kamen Rider Ex-Aid", "Kaito Kumon / Kamen Rider Baron", "Yōko Minato / Kamen Rider Marika", "Kazuma Kenzaki / Kamen Rider Blade", "Kaoru Kino / Another Agito"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70476   Expand Kamen Sentai Gorider   (2017) User Score  Play Trailer Overview This 3-part net series will feature five characters who \"should not be in this world\". These five characters are Kamen Riders Another Agito, Baron, Marika, Lazer, and Blade. These five were either dead or have disappeared at the end of their respective Kamen Rider series. Actors Takanori Kikuchi, Yutaka Kobayashi, Minami Tsukui, Hayato Onozuka, and Takayuki Tsubaki will repirse their respective Rider roles in this spin-off.  The revival of these heroes are linked both to someone manipulating behind the scenes and the \"ultimate superhero team\" Kamen Sentai Gorider! This all ties into the Kamen Rider and Super Sentai team-up movie, Kamen Rider x Super Sentai: Chou Superhero Taisen! Featured Crew Shotaro Ishinomori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroki Iijima Emu Hōjō / Kamen Rider Ex-Aid Yutaka Kobayashi Kaito Kumon / Kamen Rider Baron Minami Tsukui Yōko Minato / Kamen Rider Marika Takayuki Tsubaki Kazuma Kenzaki / Kamen Rider Blade Takanori Kikuchi Kaoru Kino / Another Agito Full Cast & Crew Last Season Season 1 2017 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kamen Sentai Gorider. You can help by rating TV shows you've seen. Facts Original Name  仮面戦隊ゴライダー Status  Returning Series Network Video Pass Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.tv-asahi.co.jp/ex-aid/gorider/ Genres Action & Adventure Sci-Fi & Fantasy Keywords tokusatsu super sentai Content Score 100 Yes! Looking good! Top Contributors 53 J. TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}