{"link": "https://www.themoviedb.org/tv/74902?language=en", "title": "Heidi", "resume": "After charming her reclusive grandfather and falling in love with the beautiful mountain he calls home, Heidi is uprooted and sent to Frankfurt where she befriends Klara, a young girl confined to a wheelchair.", "rate": 71, "genre": ["Family", "Drama"], "cast": ["Michael Simpkins", "Noley Thornton", "Jason Robards", "Jane Seymour", "Siân Phillips"], "character": ["Doctor", "Heidi", "Grandfather", "Fräulein Rottenmeier", "Frau Sesemann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74902   Expand Heidi   (1993) User Score Overview After charming her reclusive grandfather and falling in love with the beautiful mountain he calls home, Heidi is uprooted and sent to Frankfurt where she befriends Klara, a young girl confined to a wheelchair. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Simpkins Doctor Noley Thornton Heidi Jason Robards Grandfather Jane Seymour Fräulein Rottenmeier Siân Phillips Frau Sesemann Full Cast & Crew Last Season Miniseries 1993 | 2 Episodes Season 1 of Heidi premiered on July 17, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1989-04-15 Around the World in 80 Days 6.4    2000-03-05 Anne of Green Gables: The Continuing Story 6.3    1990-11-18 It 6.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Family Drama Keywords miniseries based on children's book Content Score 86 Almost there... Top Contributors 41 Banana TB 17 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}