{"link": "https://www.themoviedb.org/tv/44577?language=en", "title": "Showa Monogatari", "resume": "Shōwa Monogatari is a 2011 Japanese anime film and television series about the Yamazaki family, who live in Tokyo during Shōwa 39, the same year Tokyo hosts the 1964 Summer Olympics. The film, directed by Tadahiro Murakami, was released in Japan on January 29, 2011. Hiroshi Kugimiya directed the 13-episode television series, which had its broadcast run between April and July 2011", "rate": 75, "genre": ["Animation", "Comedy", "Drama", "Family"], "cast": ["Shoya Chiba", "Misato Fukuen", "Makoto Aoki", "Yasunori Matsumoto", "Sakiko Tamagawa"], "character": ["Kouhei Yamazaki", "Yuko Yamazaki", "Taichi Yamazaki", "Yuzou Yamazaki", "Sayoko Yamazaki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44577   Expand Showa Monogatari    (2011) User Score Overview Shōwa Monogatari is a 2011 Japanese anime film and television series about the Yamazaki family, who live in Tokyo during Shōwa 39, the same year Tokyo hosts the 1964 Summer Olympics. The film, directed by Tadahiro Murakami, was released in Japan on January 29, 2011. Hiroshi Kugimiya directed the 13-episode television series, which had its broadcast run between April and July 2011 Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shoya Chiba Kouhei Yamazaki Misato Fukuen Yuko Yamazaki Makoto Aoki Taichi Yamazaki Yasunori Matsumoto Yuzou Yamazaki Sakiko Tamagawa Sayoko Yamazaki Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Showa Monogatari  premiered on April  4, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Showa Monogatari . You can help by rating TV shows you've seen. Facts Original Name  テレビまんが 昭和物語 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://waoworld.com/products/#products2-2 Genres Animation Comedy Drama Family Keywords history memory Content Score 93 Almost there... Top Contributors 44 Erwin D. Glockner 34 kappa-papa n 10 nakamas TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}