{"link": "https://www.themoviedb.org/tv/43324?language=en", "title": "Comedystreet", "resume": "Comedystreet is a German entertainment show created by and starring comedian Simon Gosejohann. The show follows a hidden camera format. Gosejohann takes different roles with the intent of shocking passersby. Many sketches are filmed in North Rhine-Westphalia, especially in the Ruhr area and the cities of Dortmund and Essen. The show is sometimes filmed in Rhine-Ruhr in cities such as Düsseldorf. Other common locations are the islands of Sylt and Norderney. Some skits are also shot in foreign cities such as Paris and Prague. Gosejohann is recorded by a hidden camera, in a similar vein to British comedy series Trigger Happy TV and World Shut Your Mouth by Dom Joly. Simon's brother Thilo is responsible for the filming.\nComedystreet premiered on 2 September 2002 on German TV station ProSieben. Due to the show's ratings, a fifth season was confirmed. In October 2010, the show entered syndication on Comedy Central.\nThe crew consists of the two brothers and a director. The director manages the legal issues and obtains the broadcast licenses and the procedures. All passersby are informed and asked for written permission before their segment is included.", "rate": 20, "genre": ["Comedy"], "cast": ["Simon Gosejohann"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43324   Expand Comedystreet   (2002) User Score Overview Comedystreet is a German entertainment show created by and starring comedian Simon Gosejohann. The show follows a hidden camera format. Gosejohann takes different roles with the intent of shocking passersby. Many sketches are filmed in North Rhine-Westphalia, especially in the Ruhr area and the cities of Dortmund and Essen. The show is sometimes filmed in Rhine-Ruhr in cities such as Düsseldorf. Other common locations are the islands of Sylt and Norderney. Some skits are also shot in foreign cities such as Paris and Prague. Gosejohann is recorded by a hidden camera, in a similar vein to British comedy series Trigger Happy TV and World Shut Your Mouth by Dom Joly. Simon's brother Thilo is responsible for the filming. Comedystreet premiered on 2 September 2002 on German TV station ProSieben. Due to the show's ratings, a fifth season was confirmed. In October 2010, the show entered syndication on Comedy Central. The crew consists of the two brothers and a director. The director manages the legal issues and obtains the broadcast licenses and the procedures. All passersby are informed and asked for written permission before their segment is included. Featured Crew Simon Gosejohann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Gosejohann Full Cast & Crew Last Season Season 6 — | 6 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Comedystreet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 2 Elizabeth Jennings 1 lineker g 1 gismo33  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}