{"link": "https://www.themoviedb.org/tv/73223?language=en", "title": "Black Clover", "resume": "Asta and Yuno were abandoned together at the same church, and have been inseparable since. As children, they promised that they would compete against each other to see who would become the next Emperor Magus. However, as they grew up, some differences between them became plain. Yuno was a genius with magic, with amazing power and control, while Asta could not use magic at all, and tried to make up for his lack by training physically. When they received their Grimoires at age 15, Yuno got a spectacular book with a four-leaf clover (most people receive a three-leaf-clover), while Asta received nothing at all. However, when Yuno was threatened, the truth about Asta's power was revealed, he received a five-leaf clover Grimoire, a \"black clover\"! Now the two friends are heading out in the world, both seeking the same goal!", "rate": 74, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Gakuto Kajiwara", "Nobunaga Shimazaki", "Kana Yuuki", "Asuka Nishi", "Aya Uchida"], "character": ["Asta", "Yuno", "Noelle Silva", "Mimosa Vermilion", "Sylph"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73223   Expand Black Clover   (2017) User Score  Play Trailer Overview Asta and Yuno were abandoned together at the same church, and have been inseparable since. As children, they promised that they would compete against each other to see who would become the next Emperor Magus. However, as they grew up, some differences between them became plain. Yuno was a genius with magic, with amazing power and control, while Asta could not use magic at all, and tried to make up for his lack by training physically. When they received their Grimoires at age 15, Yuno got a spectacular book with a four-leaf clover (most people receive a three-leaf-clover), while Asta received nothing at all. However, when Yuno was threatened, the truth about Asta's power was revealed, he received a five-leaf clover Grimoire, a \"black clover\"! Now the two friends are heading out in the world, both seeking the same goal! Featured Crew Tatsuya Yoshihara Creator Kazuyuki Fudeyasu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gakuto Kajiwara Asta Nobunaga Shimazaki Yuno Kana Yuuki Noelle Silva Asuka Nishi Mimosa Vermilion Aya Uchida Sylph Full Cast & Crew Last Season Season 1 2017 | 38 Episodes Season 1 of Black Clover premiered on October  3, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Black Clover. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   2017-10-06 Kino's Journey: The Beautiful World 7.5    2014-04-06 Haikyu!! 8.3    2017-10-07 The Ancient Magus' Bride 8.2    2014-01-05 Noragami 7.4    2015-04-05 Blood Blockade Battlefront 7.7    2011-04-16 Deadman Wonderland 7.1    2006-01-07 Fate/stay night 7.2    2012-10-04 Love, Chunibyo & Other Delusions 7.6  Facts Original Name  ブラッククローバー Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://bclover.jp/ Genres Action & Adventure Animation Comedy Keywords based on manga shounen anime Content Score 100 Yes! Looking good! Top Contributors 23 UnderDogGamerz 21 sp1ti 10 Sergiojamon 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}