{"link": "https://www.themoviedb.org/tv/44008?language=en", "title": "The Goodwin Games", "resume": "The Goodwin siblings return home after their father's death, and unexpectedly find themselves poised to inherit a vast fortune – if they adhere to their late father's wishes. Where there's a will, there's a way. And when that will's worth more than 20 million dollars, you can bet someone's going to find a way to get the cash.", "rate": 54, "genre": ["Comedy"], "cast": ["Becki Newton", "Scott Foley", "T.J. Miller", "Melissa Tang"], "character": ["Chloe Goodwin", "Henry Goodwin", "Jimmy Goodwin", "April Cho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44008   Expand The Goodwin Games   (2013) User Score  Play Trailer Overview The Goodwin siblings return home after their father's death, and unexpectedly find themselves poised to inherit a vast fortune – if they adhere to their late father's wishes. Where there's a will, there's a way. And when that will's worth more than 20 million dollars, you can bet someone's going to find a way to get the cash. Featured Crew Carter Bays Creator Craig Thomas Creator Chris Harris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Becki Newton Chloe Goodwin Scott Foley Henry Goodwin T.J. Miller Jimmy Goodwin Melissa Tang April Cho Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Absolute) Production Order + Pilot (Production) Season 1 2013 | 7 Episodes Season 1 of The Goodwin Games premiered on May 20, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2014-10-10 Cristela 6.1    2012-09-26 The Neighbors 6.3    2012-08-12 Animal Practice 4.7    2016-10-11 Kim's Convenience 7.2    2013-09-26 The Crazy Ones 5.8    2012-09-11 The New Normal 5.2    2014-09-30 Manhattan Love Story 6.2    2013-09-26 The Michael J. Fox Show 5.6  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords sibling rivalry family Content Score 100 Yes! Looking good! Top Contributors 25 Banana k 6 kmaster 4 NEOhidra w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}