{"link": "https://www.themoviedb.org/tv/21630?language=en", "title": "Coke Studio Pakistan", "resume": "Coke Studio is a Pakistani music television series which features live studio-recorded music performances by various artists. The show is produced by the Coca-Cola Company and Frequency Media. Starting in 2008, Coke Studio has been popular throughout the country, receiving critical acclaim and frequently being rebroadcast on numerous television and radio stations. It is one of the most popular music programmes in Asia and is a local brand product of Coca-Cola.\nThe program focuses on a fusion of the diverse musical influences in Pakistan, including eastern classical, folk, qawwali, bhangra, Sufi and contemporary hip hop, rock and pop music. The show provides a platform for renowned as well as upcoming and less mainstream artists, of various genres, regions and languages, to collaborate musically in live studio recording sessions.", "rate": 90, "genre": ["Western", "Family", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21630   Expand Coke Studio Pakistan   (2008) User Score Overview Coke Studio is a Pakistani music television series which features live studio-recorded music performances by various artists. The show is produced by the Coca-Cola Company and Frequency Media. Starting in 2008, Coke Studio has been popular throughout the country, receiving critical acclaim and frequently being rebroadcast on numerous television and radio stations. It is one of the most popular music programmes in Asia and is a local brand product of Coca-Cola. The program focuses on a fusion of the diverse musical influences in Pakistan, including eastern classical, folk, qawwali, bhangra, Sufi and contemporary hip hop, rock and pop music. The show provides a platform for renowned as well as upcoming and less mainstream artists, of various genres, regions and languages, to collaborate musically in live studio recording sessions. Featured Crew Rohail Hyatt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 10 2017 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Coke Studio Pakistan. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks PlayTV Coke Studio TV 8XM Geo Entertainment Express Entertainment Ary Musik PTV Home A Plus Jalwa Urdu 1 Sea Tv Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cokestudio.com.pk/ Genres Western Family Reality Keywords music sufism Content Score 64 We're so close, yet so far. Top Contributors 372 jawadasif54 32 Elizabeth Jennings 3 rehanone 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}