{"link": "https://www.themoviedb.org/tv/11284?language=en", "title": "Madlax", "resume": "Madlax is a 26-episode Japanese anime television series produced in 2004 by the Bee Train animation studio. Kōichi Mashimo directed Madlax and the soundtrack was composed by Yuki Kajiura. The DVD version was released by ADV Films in North America and the United Kingdom and by Madman Entertainment in Australia and New Zealand.\nThe story revolves around two young women who seemingly have little in common and do not know of the other's existence at the beginning. The eponymous Madlax is a legendary mercenary and assassin in the fictional civil war-torn country of Gazth-Sonika, who cannot remember her past or indeed her real name before twelve years ago, when the war started. The other main character is Margaret Burton, the sole heir of a wealthy aristocratic family in the peaceful European country Nafrece. Twelve years before the story begins, an airliner Margaret and her mother were on crashed over Gazth-Sonika, and its passengers, as well as Margaret's father who led the rescuers, have been missing ever since. Margaret, however, mysteriously traveled back to Nafrece on her own, losing her memories prior to her return; the only thing she recalls is a single word, \"Madlax\". With this thread linking the two girls, they both independently start investigating the powerful crime syndicate Enfant after its enigmatic mastermind shows interest in both of them.", "rate": 0, "genre": ["Animation", "Drama", "Mystery"], "cast": ["Satsuki Yukino", "Toshiyuki Morikawa", "Houko Kuwashima", "Sanae Kobayashi", "Masashi Ebara"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11284   Expand Madlax   (2004) User Score Overview Madlax is a 26-episode Japanese anime television series produced in 2004 by the Bee Train animation studio. Kōichi Mashimo directed Madlax and the soundtrack was composed by Yuki Kajiura. The DVD version was released by ADV Films in North America and the United Kingdom and by Madman Entertainment in Australia and New Zealand. The story revolves around two young women who seemingly have little in common and do not know of the other's existence at the beginning. The eponymous Madlax is a legendary mercenary and assassin in the fictional civil war-torn country of Gazth-Sonika, who cannot remember her past or indeed her real name before twelve years ago, when the war started. The other main character is Margaret Burton, the sole heir of a wealthy aristocratic family in the peaceful European country Nafrece. Twelve years before the story begins, an airliner Margaret and her mother were on crashed over Gazth-Sonika, and its passengers, as well as Margaret's father who led the rescuers, have been missing ever since. Margaret, however, mysteriously traveled back to Nafrece on her own, losing her memories prior to her return; the only thing she recalls is a single word, \"Madlax\". With this thread linking the two girls, they both independently start investigating the powerful crime syndicate Enfant after its enigmatic mastermind shows interest in both of them. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Satsuki Yukino Toshiyuki Morikawa Houko Kuwashima Sanae Kobayashi Masashi Ebara Full Cast & Crew Last Season Season 1 2004 | 26 Episodes Season 1 of Madlax premiered on April  5, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Madlax. You can help by rating TV shows you've seen. Facts Original Name  マドラックス Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Mystery Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors f 4 franfac 3 Zlogorek 3 willemavjc 3 zerotaichou  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}