{"link": "https://www.themoviedb.org/tv/79357?language=en", "title": "Carter", "resume": "An actor returns home after a public meltdown. Partnering with his police detective friend, he tries to use his acting experience to solve real crimes.", "rate": 0, "genre": ["Drama"], "cast": ["Jerry O'Connell", "Sydney Tamiia Poitier", "Kristian Bruun", "Denis Akiyama", "John Bourgeois"], "character": ["Harley Carter", "Sam Shaw", "Dave Leigh", "Koji Yasuda", "Angus Pershing"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79357   Expand Carter   (2018) User Score  Play Trailer Overview An actor returns home after a public meltdown. Partnering with his police detective friend, he tries to use his acting experience to solve real crimes. Featured Crew Garry Campbell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry O'Connell Harley Carter Sydney Tamiia Poitier Sam Shaw Kristian Bruun Dave Leigh Denis Akiyama Koji Yasuda John Bourgeois Angus Pershing Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Carter premiered on May 15, 2018. View All Seasons Social Reviews  1 Discussions  0 M A review by MovieRecipe Written by  MovieRecipe  on May 30, 2018 A light and amazing mystery procedural for those who do not like blood and gore. Great choice for cozy mystery fans. Read All Reviews Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Carter. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  English Runtime  45m Homepage   https://www.bravo.ca/Shows/Carter Genres Drama Keywords crime Content Score 100 Yes! Looking good! Top Contributors 24 United600 16 tatergator 8 Elizabeth Jennings l 6 lYsY  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}