{"link": "https://www.themoviedb.org/tv/60643?language=en", "title": "La Chacala", "resume": "Javier takes Delia, his pregnant wife, to his ranch in a remote village. Although she's surrounded with love and comfort, Delia has an uneasy feeling. One day, Javier goes out hunting and kills a deer, which to his horror turns out to be a man. Javier's servants toss the corpse over a canyon and tell him to forget the incident, but the dead man's ghost seeks out his mother, the local witch, and begs her to avenge his murder. The witch turns up at Javier´s ranch, and under a mysterious and unexpected shower of thunder and lightning, curses the family. Javier's wife shall bear twin daughters, one of which shall be a fearsome demoness. A day later, Delia goes into labor and gives birth to a healthy baby girl. Everybody feels calmer after the birth, yet a couple of hours later, Delia gets labor pains again. This time she's ripped apart by another baby girl. Delia bleeds to death, yet because the two girls look identical, both healthy and beautiful, it´s hard to know which one killed her mother. Several years later, the identical twins have very different personalities. Gilda is an independent doctor and a city dweller. Her twin Liliana is a frail invalid who resides in the ranch. However, one of them harbors inside the dreadful Chacala, which will soon materialize to wreak havoc among those around her.", "rate": 0, "genre": ["Mystery", "Sci-Fi", "Fantasy"], "cast": ["Christian Bach", "Jorge Rivero", "Rafael Sanchez Navarro", "Julia Marichal", "José Alonso"], "character": ["Gilda Almada / Liliana Almada / La Chacala / Delia de Almada", "Javier Almada", "Joaquín García", "Dominga", "Padre Isaías"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60643   Expand La Chacala   (1997) User Score Overview Javier takes Delia, his pregnant wife, to his ranch in a remote village. Although she's surrounded with love and comfort, Delia has an uneasy feeling. One day, Javier goes out hunting and kills a deer, which to his horror turns out to be a man. Javier's servants toss the corpse over a canyon and tell him to forget the incident, but the dead man's ghost seeks out his mother, the local witch, and begs her to avenge his murder. The witch turns up at Javier´s ranch, and under a mysterious and unexpected shower of thunder and lightning, curses the family. Javier's wife shall bear twin daughters, one of which shall be a fearsome demoness. A day later, Delia goes into labor and gives birth to a healthy baby girl. Everybody feels calmer after the birth, yet a couple of hours later, Delia gets labor pains again. This time she's ripped apart by another baby girl. Delia bleeds to death, yet because the two girls look identical, both healthy and beautiful, it´s hard to know which one killed her mother. Several years later, the identical twins have very different personalities. Gilda is an independent doctor and a city dweller. Her twin Liliana is a frail invalid who resides in the ranch. However, one of them harbors inside the dreadful Chacala, which will soon materialize to wreak havoc among those around her. Featured Crew Eric Vonn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Bach Gilda Almada / Liliana Almada / La Chacala / Delia de Almada Jorge Rivero Javier Almada Rafael Sanchez Navarro Joaquín García Julia Marichal Dominga José Alonso Padre Isaías Full Cast & Crew Last Season Season 1 1997 | 1 Episode Season 1 of La Chacala premiered on August 18, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on La Chacala. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Mystery Sci-Fi & Fantasy Keywords supernatural creature telenovela Content Score 79 Pump it up! We're close now. Top Contributors s 33 shiff7 CM 9 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}