{"link": "https://www.themoviedb.org/tv/49934?language=en", "title": "Panda and Hedgehog", "resume": "Ms Panda and Mr Hedgehog is a South Korean romantic comedy television series starring Lee Donghae of Super Junior and Yoon Seung-ah. It was broadcast on Channel A from August 18, 2012 to October 7, 2012. The story is about Go Seung-ji, a prickly patissier who teams up with Pan Da-yang, an easygoing pastry shop owner, to open a successful new cafe.", "rate": 60, "genre": ["Comedy"], "cast": ["Lee Dong-hae", "Yoon Seung-ah", "Choi Jin-hyuk", "Yoo So-young", "Yang Hee-Kyung"], "character": ["Go Seung-ji", "Pan Da-yang", "Choi Won-il", "Kang Eun-bi", "Kim Kap-soon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49934   Expand Panda and Hedgehog   (2012) User Score Overview Ms Panda and Mr Hedgehog is a South Korean romantic comedy television series starring Lee Donghae of Super Junior and Yoon Seung-ah. It was broadcast on Channel A from August 18, 2012 to October 7, 2012. The story is about Go Seung-ji, a prickly patissier who teams up with Pan Da-yang, an easygoing pastry shop owner, to open a successful new cafe. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Dong-hae Go Seung-ji Yoon Seung-ah Pan Da-yang Choi Jin-hyuk Choi Won-il Yoo So-young Kang Eun-bi Yang Hee-Kyung Kim Kap-soon Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of Panda and Hedgehog premiered on August 18, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2014-03-17 Secret Love Affair 7.8    2013-11-28 Let's Eat 7.8  Facts Original Name  판다양과 고슴도치 Status  Ended Networks - Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://tv.ichannela.com/drama/pandango Genres Comedy Keywords korea food Content Score 86 Almost there... Top Contributors M 31 Maria180493 N 8 Nightowl.Kr CM 4 Cherche Moi 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}