{"link": "https://www.themoviedb.org/tv/12187?language=en", "title": "Shine on Harvey Moon", "resume": "Shine on Harvey Moon! is a British comedy-drama series made by Central Television for ITV from 8 January 1982 to 23 August 1985 and briefly revived in 1995 by Meridian.\nThis generally light-hearted series was created by comedy writers Laurence Marks and Maurice Gran. The series is set in the East End of London shortly after the Second World War. Upon being demobbed RAF serviceman Harvey Moon, played by Kenneth Cranham, returns home and finds his family involved in various troubles. His wife Rita, played by Maggie Steed, is not interested in resuming their relationship, and works in a seedy nightclub frequented by American servicemen. He becomes involved with the Labour Party and the union movement.\nThe name of the series is a wordplay on the title of the popular 1908 song 'Shine On, Harvest Moon'. The first series was commissioned and recorded by ATV at their Elstree studios with the remaining series filmed at newly constructed facilities in Nottingham.", "rate": 95, "genre": ["Drama"], "cast": ["Pauline Quirke", "Nigel Planer", "Linda Robson", "Kenneth Cranham", "Maggie Steed"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12187   Expand Shine on Harvey Moon   (1982) User Score Overview Shine on Harvey Moon! is a British comedy-drama series made by Central Television for ITV from 8 January 1982 to 23 August 1985 and briefly revived in 1995 by Meridian. This generally light-hearted series was created by comedy writers Laurence Marks and Maurice Gran. The series is set in the East End of London shortly after the Second World War. Upon being demobbed RAF serviceman Harvey Moon, played by Kenneth Cranham, returns home and finds his family involved in various troubles. His wife Rita, played by Maggie Steed, is not interested in resuming their relationship, and works in a seedy nightclub frequented by American servicemen. He becomes involved with the Labour Party and the union movement. The name of the series is a wordplay on the title of the popular 1908 song 'Shine On, Harvest Moon'. The first series was commissioned and recorded by ATV at their Elstree studios with the remaining series filmed at newly constructed facilities in Nottingham. Featured Crew Laurence Marks Creator Maurice Gran Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pauline Quirke Nigel Planer Linda Robson Kenneth Cranham Maggie Steed Full Cast & Crew Last Season Season 5 1995 | 6 Episodes Season 5 of Shine on Harvey Moon premiered on April 23, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shine on Harvey Moon. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords london england world war ii period drama family east end 1940s british humour Content Score 79 Pump it up! We're close now. Top Contributors O 9 Ozbourne 2 janar 2 kcdh z 2 zoroman2017  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}