{"link": "https://www.themoviedb.org/tv/61138?language=en", "title": "KARA: Secret Love", "resume": "\"Secret Love\" is written as an Omnibus Mini-Series consisting of 5 episodes, focusing on the ups-and-downs of love relationships such as a first love, breakups, secret crushes, etc. Each episode features a member of the girl group KARA, teamed up with a leading man. \"Secret Love\" will be produced in advance, then be aired in Korea, Japan, Hong Kong, Taiwan and other Asian countries.", "rate": 83, "genre": ["Comedy", "Drama", "Fantasy", "Romance"], "cast": ["Han Seung-yeon", "Goo Hara", "Kang Ji-young", "Nicole Jung", "Park Gyuri"], "character": ["Min Ji Hye", "Hyun Jung", "So Yul", "Mary", "Park Sun Woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61138   Expand KARA: Secret Love   (2014) User Score Overview \"Secret Love\" is written as an Omnibus Mini-Series consisting of 5 episodes, focusing on the ups-and-downs of love relationships such as a first love, breakups, secret crushes, etc. Each episode features a member of the girl group KARA, teamed up with a leading man. \"Secret Love\" will be produced in advance, then be aired in Korea, Japan, Hong Kong, Taiwan and other Asian countries.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Seung-yeon Min Ji Hye Goo Hara Hyun Jung Kang Ji-young So Yul Nicole Jung Mary Park Gyuri Park Sun Woo Full Cast & Crew Last Season Season 1 2014 | 5 Episodes Season 1 of KARA: Secret Love premiered on June 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on KARA: Secret Love. You can help by rating TV shows you've seen. Facts Original Name  시크릿 러브 Status  Ended Network DRAMAcube Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   https://www.imtcast.com/cms/index.jsp?spgmdomain=secretlove Genres Comedy Drama Fantasy Romance Keywords korea Content Score 86 Almost there... Top Contributors M 71 Maria180493 22 Elizabeth Jennings 3 Zlogorek 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}