{"link": "https://www.themoviedb.org/tv/5368?language=en", "title": "Lassie", "resume": "Lassie is an American television series that follows the adventures of a female Rough Collie dog named Lassie and her companions, human and animal. The show was the creation of producer Robert Maxwell and animal trainer Rudd Weatherwax and was televised from September 12, 1954, to March 24, 1973. One of the longest-running series on television, the show chalked up seventeen seasons on CBS before entering first-run syndication for its final two seasons. Initially filmed in black and white, the show transitioned to color in 1965.\nThe show's first ten seasons follow Lassie's adventures in a small farming community. Fictional eleven-year-old Jeff Miller, his mother, and his grandfather are Lassie's first human companions until seven-year-old Timmy Martin and his adoptive parents take over in the fourth season. When Lassie's exploits on the farm end in the eleventh season, she finds new adventures in the wilderness with a succession of United States Forest Service Rangers. After traveling without human leads for a year, Lassie finally settles at a children's home for her final two syndicated seasons.\nLassie received critical favor at its debut and won two Emmy Awards in its first years. Stars Jan Clayton and June Lockhart were nominated for Emmys. Merchandise produced during the show's run included books, a Halloween costume, clothing, toys, and other items. Campbell's Soup, the show's lifelong sponsor, offered two premiums, and distributed thousands to fans. A multi-part episode was edited into the feature film Lassie's Great Adventure and released in August 1963. In 1989, the television series The New Lassie brought Lassie star Jon Provost back to television as Steve McCullough. Selected episodes have been released to DVD.", "rate": 60, "genre": ["Action", "Adventure", "Drama"], "cast": ["June Lockhart", "Jon Provost", "Hugh Reilly", "George Cleveland", "Josh Albee"], "character": ["George 'Gramps' Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5368   Expand Lassie   (1954) User Score Overview Lassie is an American television series that follows the adventures of a female Rough Collie dog named Lassie and her companions, human and animal. The show was the creation of producer Robert Maxwell and animal trainer Rudd Weatherwax and was televised from September 12, 1954, to March 24, 1973. One of the longest-running series on television, the show chalked up seventeen seasons on CBS before entering first-run syndication for its final two seasons. Initially filmed in black and white, the show transitioned to color in 1965. The show's first ten seasons follow Lassie's adventures in a small farming community. Fictional eleven-year-old Jeff Miller, his mother, and his grandfather are Lassie's first human companions until seven-year-old Timmy Martin and his adoptive parents take over in the fourth season. When Lassie's exploits on the farm end in the eleventh season, she finds new adventures in the wilderness with a succession of United States Forest Service Rangers. After traveling without human leads for a year, Lassie finally settles at a children's home for her final two syndicated seasons. Lassie received critical favor at its debut and won two Emmy Awards in its first years. Stars Jan Clayton and June Lockhart were nominated for Emmys. Merchandise produced during the show's run included books, a Halloween costume, clothing, toys, and other items. Campbell's Soup, the show's lifelong sponsor, offered two premiums, and distributed thousands to fans. A multi-part episode was edited into the feature film Lassie's Great Adventure and released in August 1963. In 1989, the television series The New Lassie brought Lassie star Jon Provost back to television as Steve McCullough. Selected episodes have been released to DVD. Featured Crew Robert Maxwell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast June Lockhart Jon Provost Hugh Reilly George Cleveland George 'Gramps' Miller Josh Albee Full Cast & Crew Last Season Season 19 1972 | 23 Episodes Season 19 of Lassie premiered on September 16, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   1961-01-05 Mister Ed 7.4    1964-09-19 Flipper 4.6    1959-09-12 Bonanza 5.9    1971-09-14 Cannon 5.6    1963-09-29 My Favorite Martian 5.4    1973-10-24 Kojak 7.4    1967-09-07 The Flying Nun 5.0    1967-09-10 Gentle Ben 5.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 26m, 30m Homepage  - Genres Action & Adventure Drama Keywords dog lassie Content Score 100 Yes! Looking good! Top Contributors 13 dzero 13 Banana XA 9 XAVIER ANIMAL n 7 nipi66  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}