{"link": "https://www.themoviedb.org/tv/481?language=en", "title": "The Brak Show", "resume": "The Brak Show is an animated television series that aired on Cartoon Network's late night programming block, Adult Swim. The Brak Show is a spin-off of the animated television series, Space Ghost Coast to Coast, and featured recurring characters from Space Ghost Coast to Coast and Cartoon Planet. Both programs used stock footage from the Hanna-Barbera cartoon Space Ghost. The protagonist is Brak, voiced by Andy Merrill, who developed a quirky persona for the character.\nAn earlier version of the pilot episode, \"Mr. Bawk Ba Gawk\", originally aired prior to the official launch of Adult Swim on Cartoon Network on December 21, 2000, as part of a preview of upcoming Adult Swim shows. The series made its official debut during the night Adult Swim officially launched on September 2, 2001, and ended on December 31, 2003, with a total of 28 episodes. On May 24, 2007 a webisode for the series was released on Adult Swim Video, ending the series.", "rate": 78, "genre": ["Animation", "Comedy"], "cast": ["Andy Merrill", "George Lowe", "Marsha Crenshaw", "Joanna Daniels"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 481   Expand The Brak Show   (2000) User Score Overview The Brak Show is an animated television series that aired on Cartoon Network's late night programming block, Adult Swim. The Brak Show is a spin-off of the animated television series, Space Ghost Coast to Coast, and featured recurring characters from Space Ghost Coast to Coast and Cartoon Planet. Both programs used stock footage from the Hanna-Barbera cartoon Space Ghost. The protagonist is Brak, voiced by Andy Merrill, who developed a quirky persona for the character. An earlier version of the pilot episode, \"Mr. Bawk Ba Gawk\", originally aired prior to the official launch of Adult Swim on Cartoon Network on December 21, 2000, as part of a preview of upcoming Adult Swim shows. The series made its official debut during the night Adult Swim officially launched on September 2, 2001, and ended on December 31, 2003, with a total of 28 episodes. On May 24, 2007 a webisode for the series was released on Adult Swim Video, ending the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andy Merrill George Lowe Marsha Crenshaw Joanna Daniels Full Cast & Crew Last Season Season 3 2003 | 9 Episodes Season 3 of The Brak Show premiered on October  5, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2000-12-21 Sealab 2021 7.8    1999-04-26 Home Movies 6.6    2014-11-08 Sonic Boom 6.0    1995-09-09 Freakazoid! 7.3    1994-01-26 The Critic 7.7    1999-10-16 The Amanda Show 5.2    1999-11-12 Mike, Lu & Og 3.3    1967-09-09 The Herculoids 7.7  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  15m, 11m Homepage   http://www.adultswim.com/shows/the-brak-show/index.html Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 Timac 2 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}