{"link": "https://www.themoviedb.org/tv/33880?language=en", "title": "The Legend of Korra", "resume": "The Legend of Korra is an American animated television series that premiered on the Nickelodeon television network in 2012. It was created by Bryan Konietzko and Michael Dante DiMartino as a sequel to their series Avatar: The Last Airbender, which aired on Nickelodeon from 2005 to 2008. Several people involved with creating Avatar, including designer Joaquim Dos Santos and composers Jeremy Zuckerman and Benjamin Wynn, returned to work on The Legend of Korra.\nThe series is set in a fictional universe where some people can manipulate, or \"bend\", the elements of water, earth, fire, or air. Only one person, the \"Avatar\", can bend all four elements, and is responsible for maintaining balance in the world. The series follows Avatar Korra, the successor of Aang from the previous series, as she faces political and spiritual unrest in a modernizing world.\nThe series, whose style is strongly influenced by Japanese animation, has been a critical and commercial success. It obtained the highest audience total for an animated series in the United States in 2012. The series was praised by reviewers for its high production values and for addressing difficult sociopolitical issues such as social unrest and terrorism. It was initially conceived as a miniseries of 12 episodes, but it is now set to run for 52 episodes separated into four seasons, each of which tells a separate story.", "rate": 79, "genre": ["Action", "Adventure", "Animation", "Drama", "Family", "Sci-Fi", "Fantasy"], "cast": ["Janet Varney", "David Faustino", "P. J. Byrne", "Maria Bamford", "J.K. Simmons"], "character": ["Korra (voice)", "Mako (voice)", "Bolin (voice)", "Pema (voice)", "Tenzin (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33880   Expand The Legend of Korra   (2012) User Score  Play Trailer Overview The Legend of Korra is an American animated television series that premiered on the Nickelodeon television network in 2012. It was created by Bryan Konietzko and Michael Dante DiMartino as a sequel to their series Avatar: The Last Airbender, which aired on Nickelodeon from 2005 to 2008. Several people involved with creating Avatar, including designer Joaquim Dos Santos and composers Jeremy Zuckerman and Benjamin Wynn, returned to work on The Legend of Korra. The series is set in a fictional universe where some people can manipulate, or \"bend\", the elements of water, earth, fire, or air. Only one person, the \"Avatar\", can bend all four elements, and is responsible for maintaining balance in the world. The series follows Avatar Korra, the successor of Aang from the previous series, as she faces political and spiritual unrest in a modernizing world. The series, whose style is strongly influenced by Japanese animation, has been a critical and commercial success. It obtained the highest audience total for an animated series in the United States in 2012. The series was praised by reviewers for its high production values and for addressing difficult sociopolitical issues such as social unrest and terrorism. It was initially conceived as a miniseries of 12 episodes, but it is now set to run for 52 episodes separated into four seasons, each of which tells a separate story. Featured Crew Michael Dante DiMartino Creator Bryan Konietzko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  20 Posters  16 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Janet Varney Korra (voice) David Faustino Mako (voice) P. J. Byrne Bolin (voice) Maria Bamford Pema (voice) J.K. Simmons Tenzin (voice) Full Cast & Crew Last Season Book Four: Balance 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply T Alright, I know I'll draw flack for this, but... Open 0 by Tsavo\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  20 Posters  16 Recommendations   2005-02-21 Avatar: The Last Airbender 8.2    2003-10-04 Fullmetal Alchemist 8.0    2009-04-05 Fullmetal Alchemist: Brotherhood 8.3    2007-04-01 Gurren Lagann 7.9    2000-09-09 Jackie Chan Adventures 7.1    2001-11-17 Justice League 8.2    1999-03-28 Futurama 8.2    1995-10-04 Neon Genesis Evangelion 8.0  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.nick.com/shows/legend-of-korra/ Genres Action & Adventure Animation Drama Family Sci-Fi & Fantasy Keywords good vs evil friendship martial arts buddhism asia romance coming of age spirituality steampunk fantasy world political corruption companionship spirits Content Score 100 Yes! Looking good! Top Contributors T 201 Tsavo 42 Banana 35 RainingBullets 27 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}