{"link": "https://www.themoviedb.org/tv/10025?language=en", "title": "Adderly", "resume": "Adderly is a Canadian television drama series, first aired in 1986.", "rate": 80, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Winston Rekert", "Ken Pogue", "Dixie Seatle", "Jonathan Welsh"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10025   Expand Adderly   (1986) User Score Overview Adderly is a Canadian television drama series, first aired in 1986. Featured Crew Elliott Baker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Winston Rekert Ken Pogue Dixie Seatle Jonathan Welsh Full Cast & Crew Last Season Season 2 1987 | 22 Episodes Season 2 of Adderly premiered on August  7, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Adderly. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Crime Drama Keywords bureaucracy basement office former spy Content Score 79 Pump it up! We're close now. Top Contributors PE 13 Patrick E. Abe 6 Banana 3 Joe Carson 3 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}