{"link": "https://www.themoviedb.org/tv/1613?language=en", "title": "Otherworld", "resume": "Otherworld is an American science fiction series that aired for only eight episodes from January 26 to March 16, 1985 on CBS. It was created by Roderick Taylor as a sort of Lost in Space on Earth. Taylor gave himself a cameo role in each episode.", "rate": 35, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Chris Hebert", "Gretchen Corbett", "Tony O'Dell", "Jonathan Banks", "Jonna Lee"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1613   Expand Otherworld   (1985) User Score Overview Otherworld is an American science fiction series that aired for only eight episodes from January 26 to March 16, 1985 on CBS. It was created by Roderick Taylor as a sort of Lost in Space on Earth. Taylor gave himself a cameo role in each episode. Featured Crew Roderick Taylor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Hebert Gretchen Corbett Tony O'Dell Jonathan Banks Jonna Lee Full Cast & Crew Last Season Season 1 1985 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Otherworld. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 48m Homepage  - Genres Sci-Fi & Fantasy Keywords fish out of water parallel world Content Score 93 Almost there... Top Contributors 5 Banana z 4 zurman1 w 3 webmaster 3 capkronos00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}