{"link": "https://www.themoviedb.org/tv/61498?language=en", "title": "The Great Fire", "resume": "Inspired by the historical events of 1666 and with the decadent backdrop of King Charles II’s court, The Great Fire focuses on the circumstances which led to the catastrophic fire, Thomas Farriner’s family life at the bakery in Pudding Lane, the playboy King’s extravagant lifestyle, and Farriner’s complex relationship with his fictional sister in law, Sarah.", "rate": 47, "genre": ["Drama"], "cast": ["Andrew Buchan", "Rose Leslie", "Geoff Bell", "Uriel Emil Pollack", "Amy McAllister"], "character": ["Thomas Farriner", "Sarah", "Wilson", "Signor Romero", "Ruth"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61498   Expand The Great Fire   (2014) User Score  Play Trailer Overview Inspired by the historical events of 1666 and with the decadent backdrop of King Charles II’s court, The Great Fire focuses on the circumstances which led to the catastrophic fire, Thomas Farriner’s family life at the bakery in Pudding Lane, the playboy King’s extravagant lifestyle, and Farriner’s complex relationship with his fictional sister in law, Sarah. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Buchan Thomas Farriner Rose Leslie Sarah Geoff Bell Wilson Uriel Emil Pollack Signor Romero Amy McAllister Ruth Full Cast & Crew Last Season Season 1 2014 | 4 Episodes Season 1 of The Great Fire premiered on October 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Great Fire. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   https://itvstudios.com/programmes/the-great-fire--2 Genres Drama Keywords london england fire suppressed past disaster miniseries king period drama historical based on true events historical drama london fire 17th century Content Score 93 Almost there... Top Contributors TB 31 TMDb Bot 18 Steve 16 Banana 12 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}