{"link": "https://www.themoviedb.org/tv/19826?language=en", "title": "Barney and the Backyard Gang", "resume": "Barney and the Backyard Gang is a direct-to-video series produced by The Lyons Group and was produced from October 13, 1988 to October 20, 1991. This series launched the stardom of the PBS television show Barney & Friends.\nThe first three episodes from 1988 and 1989 include American actress Sandy Duncan as Michael and Amy's Mother. Music for the Barney and the Backyard Gang videos was created by Stephen Bates Baltes and Phillip Parker, and Lory Lazarus wrote the first original song produced for Barney, \"Friends Are Forever\", sung by Sandy Duncan. In the first five videos, \"I Love You\" was sung at the beginning.\nThe series was a regional success, but only a moderate success throughout the rest of the country. Then one day, in 1991, Larry Rifkin, then head of Connecticut Public Television, rented a Barney video for his daughter Leora. He liked the concept and talked to Leach about possibly putting Barney on television through the Public Broadcasting Service. Rock with Barney was the last video in the series before the television show debuted. Also, only four of the kids from the videos were carried over to the television show.", "rate": 0, "genre": [], "cast": ["Bob West"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19826   Expand Barney and the Backyard Gang   (1988) User Score Overview Barney and the Backyard Gang is a direct-to-video series produced by The Lyons Group and was produced from October 13, 1988 to October 20, 1991. This series launched the stardom of the PBS television show Barney & Friends. The first three episodes from 1988 and 1989 include American actress Sandy Duncan as Michael and Amy's Mother. Music for the Barney and the Backyard Gang videos was created by Stephen Bates Baltes and Phillip Parker, and Lory Lazarus wrote the first original song produced for Barney, \"Friends Are Forever\", sung by Sandy Duncan. In the first five videos, \"I Love You\" was sung at the beginning. The series was a regional success, but only a moderate success throughout the rest of the country. Then one day, in 1991, Larry Rifkin, then head of Connecticut Public Television, rented a Barney video for his daughter Leora. He liked the concept and talked to Leach about possibly putting Barney on television through the Public Broadcasting Service. Rock with Barney was the last video in the series before the television show debuted. Also, only four of the kids from the videos were carried over to the television show. Featured Crew Sheryl Leach Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob West Full Cast & Crew Last Season Season 1 1988 | 8 Episodes Season 1 of Barney and the Backyard Gang premiered on October  1, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Barney and the Backyard Gang. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}