{"link": "https://www.themoviedb.org/tv/42035?language=en", "title": "The Boat", "resume": "A global cataclysm, caused by a fatal accident in Geneva (Switzerland) during the implementation of the particle accelerator will lead to the crew and students of the school-ship Polar Star to live the greatest adventure of their lives. Isolated and aware that we only have each other, the ship will become their only home.", "rate": 51, "genre": ["Action", "Adventure", "Mystery", "Drama"], "cast": ["Mario Casas", "Luis Callejo", "Juanjo Artero", "Blanca Suárez", "Marina Salas"], "character": ["Ulises Garmendia", "Julián de la Cuadra", "Ricardo Montero", "Ainhoa Montero", "Vilma Llorente"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42035   Expand The Boat   (2011) User Score  Play Trailer Overview A global cataclysm, caused by a fatal accident in Geneva (Switzerland) during the implementation of the particle accelerator will lead to the crew and students of the school-ship Polar Star to live the greatest adventure of their lives. Isolated and aware that we only have each other, the ship will become their only home. Featured Crew Álex Pina Creator Iván Escobar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mario Casas Ulises Garmendia Luis Callejo Julián de la Cuadra Juanjo Artero Ricardo Montero Blanca Suárez Ainhoa Montero Marina Salas Vilma Llorente Full Cast & Crew Last Season Season 3 2012 | 17 Episodes Season 3 of The Boat premiered on October 18, 2012. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for The Boat. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2011-03-07 Crematorio 7.7    2008-01-09 Sin Tetas No Hay Paraíso 2.7    2014-04-20 Filthy Riches 6.7    2007-05-17 Embarrassing Bodies 6.8    2005-01-16 Aída 4.0    2011-10-09 Brain Games 7.6    2013-04-10 MasterChef 7.3    2015-09-02 Atelier 7.2  Facts Original Name  El barco Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  75m Homepage   http://www.antena3.com/series/el-barco/ Genres Action & Adventure Mystery Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 65 prm96 v 35 veotele m 22 misak0007 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}