{"link": "https://www.themoviedb.org/tv/5311?language=en", "title": "Dancing with the Stars", "resume": "Dancing with the Stars is a New Zealand television series based on the British series Strictly Come Dancing. The show introduces eight local celebrities paired with professional ballroom danceers who each week compete against each other in a competition to impress a panel of judges and the viewing public in order to survive potential elimination. Through a telephone poll, viewers vote for those couples who should stay. 50% of the public votes and the average score given by the panel of judges goes towards deciding who should leave. Proceeds from the voting will go to the celebrity contestant's charity of choice.", "rate": 0, "genre": ["Reality"], "cast": ["Sharyn Casey", "Camilla Sacre-Dallerup", "Julz Tocker", "Rachel White", "Dai Henwood"], "character": ["Host", "Judge", "Judge", "Judge", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5311   Expand Dancing with the Stars User Score Overview Dancing with the Stars is a New Zealand television series based on the British series Strictly Come Dancing. The show introduces eight local celebrities paired with professional ballroom danceers who each week compete against each other in a competition to impress a panel of judges and the viewing public in order to survive potential elimination. Through a telephone poll, viewers vote for those couples who should stay. 50% of the public votes and the average score given by the panel of judges goes towards deciding who should leave. Proceeds from the voting will go to the celebrity contestant's charity of choice. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Sharyn Casey Host Camilla Sacre-Dallerup Judge Julz Tocker Judge Rachel White Judge Dai Henwood Host Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  90m, 60m, 47m Homepage   http://www.tvnz.co.nz/view/tvone_minisite_index_skin/tvone_dancing_with_the_stars_group/ Genres Reality Keywords dancing reality game show Content Score 86 Almost there... Top Contributors E 18 Edytor 6 tigru89 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}