{"link": "https://www.themoviedb.org/tv/42014?language=en", "title": "¡Rob!", "resume": "Rob is an American comedy television series that premiered on CBS on January 12, 2012, at 8:30 pm as a midseason replacement for Rules of Engagement, and ended on March 1, 2012. The series stars Rob Schneider alongside Cheech Marin, Claudia Bassols, Diana Maria Riva, Eugenio Derbez, Ricky Rico, and Lupe Ontiveros. The show was produced by Two and a Half Men's The Tannenbaum Company and CBS Television Studios. On May 13, 2012, CBS canceled the series.", "rate": 48, "genre": ["Comedy"], "cast": ["Eugenio Derbez", "Rob Schneider", "Claudia Bassols", "Cheech Marin", "Diana Maria Riva"], "character": ["Hector", "Rob", "Maggie", "Fernando", "Rosa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42014   Expand ¡Rob!   (2012) User Score  Play Trailer Overview Rob is an American comedy television series that premiered on CBS on January 12, 2012, at 8:30 pm as a midseason replacement for Rules of Engagement, and ended on March 1, 2012. The series stars Rob Schneider alongside Cheech Marin, Claudia Bassols, Diana Maria Riva, Eugenio Derbez, Ricky Rico, and Lupe Ontiveros. The show was produced by Two and a Half Men's The Tannenbaum Company and CBS Television Studios. On May 13, 2012, CBS canceled the series. Featured Crew Lewis Morton Creator Rob Schneider Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eugenio Derbez Hector Rob Schneider Rob Claudia Bassols Maggie Cheech Marin Fernando Diana Maria Riva Rosa Full Cast & Crew Last Season Season 1 2012 | 8 Episodes Season 1 of ¡Rob! premiered on January 12, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on ¡Rob!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords family mexican american sitcom family of color Content Score 100 Yes! Looking good! Top Contributors 22 Banana s 3 speedycars e 3 error666 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}