{"link": "https://www.themoviedb.org/tv/76948?language=en", "title": "Segodon", "resume": "The NHK 2018 taiga historical drama is based on the life story of Takamori Saigo, also known as \"Segodon\", a hero of the Meiji Restoration who later rebelled against the government.", "rate": 0, "genre": ["Drama", "War", "Politics"], "cast": ["Ryohei Suzuki", "Haru Kuroki", "Morio Kazama", "Keiko Matsuzaka", "Nanami Sakuraba"], "character": ["Takamori Saigo", "Ito Iwayama", "Kichibe", "Masako", "Koto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76948   Expand Segodon   (2018) User Score Overview The NHK 2018 taiga historical drama is based on the life story of Takamori Saigo, also known as \"Segodon\", a hero of the Meiji Restoration who later rebelled against the government. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryohei Suzuki Takamori Saigo Haru Kuroki Ito Iwayama Morio Kazama Kichibe Keiko Matsuzaka Masako Nanami Sakuraba Koto Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Segodon premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Segodon. You can help by rating TV shows you've seen. Facts Original Name  西郷どん Status  In Production Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   https://www.nhk.or.jp/segodon/ Genres Drama War & Politics Keywords taiga drama Content Score 71 Just a little bit more... Top Contributors 28 thirstyhippo A 7 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}