{"link": "https://www.themoviedb.org/tv/34808?language=en", "title": "Inukami!", "resume": "Inukami! is a Japanese light novel series written by Mamizu Arisawa, with illustrations by Kanna Wakatsuki. The series originally started serialization in volume seventeen of ASCII Media Works' now-defunct light novel magazine Dengeki hp on April 18, 2002. Four more chapters were published until the first bound novel of the series was released, though more chapters were later serialized in the magazine. Fourteen main novels, plus two additional bonus novels with illustrations by Mari Matsuzawa, were published by ASCII Media Works under their Dengeki Bunko label between January 10, 2003 and December 10, 2008. The series revolves around a dog goddess named Yōko and her master Keita Kawahira as they fight against various troublesome spirits. Several more inukami besides Yōko also play an important role, most notably the inukami of Kaoru Kawahira.\nA manga adaptation by Mari Matsuzawa was serialized in MediaWorks' now-defunct shōnen manga magazine Dengeki Comic Gao! between October 2005 and February 2008. The manga has been licensed by Seven Seas Entertainment for distribution in North America; the first volume was released in November 2008. A twenty-six episode anime adaptation of the series produced by Seven Arcs aired between April and September 2006 on TV Tokyo in Japan. An Internet radio show was also produced, along with a visual novel released by ASCII Media Works, and a twenty-five minute long film released in Japanese theaters in April 2007. Another light novel entitled Inukami Special Edition was only released as a promotional gift for the animated film.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Yuki Matsuoka", "Yui Horie", "Kaori Nazuka", "Ryouko Shintani", "Shizuka Hasegawa"], "character": ["Sendan", "Yoko", "Nadeshiko", "Sayoka", "Tomohane"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34808   Expand Inukami!   (2006) User Score Overview Inukami! is a Japanese light novel series written by Mamizu Arisawa, with illustrations by Kanna Wakatsuki. The series originally started serialization in volume seventeen of ASCII Media Works' now-defunct light novel magazine Dengeki hp on April 18, 2002. Four more chapters were published until the first bound novel of the series was released, though more chapters were later serialized in the magazine. Fourteen main novels, plus two additional bonus novels with illustrations by Mari Matsuzawa, were published by ASCII Media Works under their Dengeki Bunko label between January 10, 2003 and December 10, 2008. The series revolves around a dog goddess named Yōko and her master Keita Kawahira as they fight against various troublesome spirits. Several more inukami besides Yōko also play an important role, most notably the inukami of Kaoru Kawahira. A manga adaptation by Mari Matsuzawa was serialized in MediaWorks' now-defunct shōnen manga magazine Dengeki Comic Gao! between October 2005 and February 2008. The manga has been licensed by Seven Seas Entertainment for distribution in North America; the first volume was released in November 2008. A twenty-six episode anime adaptation of the series produced by Seven Arcs aired between April and September 2006 on TV Tokyo in Japan. An Internet radio show was also produced, along with a visual novel released by ASCII Media Works, and a twenty-five minute long film released in Japanese theaters in April 2007. Another light novel entitled Inukami Special Edition was only released as a promotional gift for the animated film. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuki Matsuoka Sendan Yui Horie Yoko Kaori Nazuka Nadeshiko Ryouko Shintani Sayoka Shizuka Hasegawa Tomohane Full Cast & Crew Last Season Season 1 2006 | 26 Episodes Season 1 of Inukami! premiered on April  5, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Inukami!. You can help by rating TV shows you've seen. Facts Original Name  いぬかみっ! Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 7 BrerFox 4 yoshizuka m 3 magoozin s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}