{"link": "https://www.themoviedb.org/tv/61537?language=en", "title": "Amber", "resume": "The disappearance of 14 year old Amber Bailey sets off a two-year search during which her family will go through unimaginable pressures. As the days, months and years progress the mystery deepens, and strange and terrifying clues come to light, raising yet even more questions. The world becomes gripped by the mystery of the missing teen. What happened to Amber?", "rate": 75, "genre": ["Drama"], "cast": ["Eva Birthistle", "David Murray", "Lauryn Canny", "Levi O'Sullivan", "Justine Mitchell"], "character": ["Sarah Bailey", "Ben Bailey", "Amber Bailey", "Eamon Bailey", "Maeve Flynn-Dunne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61537   Expand Amber   (2014) User Score Overview The disappearance of 14 year old Amber Bailey sets off a two-year search during which her family will go through unimaginable pressures. As the days, months and years progress the mystery deepens, and strange and terrifying clues come to light, raising yet even more questions. The world becomes gripped by the mystery of the missing teen. What happened to Amber? Featured Crew Rob Cawley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eva Birthistle Sarah Bailey David Murray Ben Bailey Lauryn Canny Amber Bailey Levi O'Sullivan Eamon Bailey Justine Mitchell Maeve Flynn-Dunne Full Cast & Crew Last Season Season 1 2014 | 4 Episodes Season 1 of Amber premiered on January 19, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Amber. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.rte.ie/drama/tv/featured/amber/ Genres Drama Keywords dublin ireland missing person missing child missing persons case crime investigation missing daughter Content Score 93 Almost there... Top Contributors 43 Elizabeth Jennings 15 Banana p 5 pete12345 D 4 Dee  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}