{"link": "https://www.themoviedb.org/tv/72368?language=en", "title": "The Gong Show", "resume": "Unique performers demonstrate their artistry in front of Hollywood judges in this update of the kitschy '70s talent show, which features the worst performances being cut short by bangs on the titular gong.", "rate": 76, "genre": ["Comedy"], "cast": ["Mike Myers"], "character": ["Tommy Maitland - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72368   Expand The Gong Show   (2017) User Score  Play Trailer Overview Unique performers demonstrate their artistry in front of Hollywood judges in this update of the kitschy '70s talent show, which features the worst performances being cut short by bangs on the titular gong. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike Myers Tommy Maitland - Host Full Cast & Crew Current Season Season 2 2018 | 5 Episodes Season 2 of The Gong Show premiered on June 21, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply T Mike Myers as Tommy Maitland Open 0 by TheBayHarborButcher\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Gong Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  42m Homepage   http://abc.go.com/shows/the-gong-show Genres Comedy Keywords variety show Content Score 64 We're so close, yet so far. Top Contributors 57 Elizabeth Jennings 9 TheOneManBoxOffice 1 szab TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}