{"link": "https://www.themoviedb.org/tv/63157?language=en", "title": "Turbo FAST", "resume": "After Turbo the Snail's improbable win at the Indianapolis 500, the superfast racer finds his life forever changed after he returns from his victory tour. Namely, Tito, his human companion, has built Starlite City, a massive miniature city with an elaborate adjoining race track for Turbo and his fellow snails to live and race in. However, Turbo finds his new life no less hectic as he and his friends face new rivals of all varieties eager to take the champion on. Regardless of the danger, Turbo and his colleagues of the Fast Action Stunt Team are ready for the challenge.", "rate": 70, "genre": ["Animation", "Family"], "cast": ["Reid Scott", "Eric Bauza", "Mike Bell", "John Eric Bentley", "Grey DeLisle"], "character": ["Turbo", "Chet", "White Shadow", "Whiplash", "Burn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63157   Expand Turbo FAST   (2013) User Score Overview After Turbo the Snail's improbable win at the Indianapolis 500, the superfast racer finds his life forever changed after he returns from his victory tour. Namely, Tito, his human companion, has built Starlite City, a massive miniature city with an elaborate adjoining race track for Turbo and his fellow snails to live and race in. However, Turbo finds his new life no less hectic as he and his friends face new rivals of all varieties eager to take the champion on. Regardless of the danger, Turbo and his colleagues of the Fast Action Stunt Team are ready for the challenge. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Reid Scott Turbo Eric Bauza Chet Mike Bell White Shadow John Eric Bentley Whiplash Grey DeLisle Burn Full Cast & Crew Last Season season 3 2016 | 1 Episode Season 3 of Turbo FAST premiered on February  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2009-04-05 Beyblade: Metal Fusion 3.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   https://www.netflix.com/title/70271773 Genres Animation Family Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors LC 9 Legit Corporation c 8 chapichapo 6 pee-wee herman 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}