{"link": "https://www.themoviedb.org/tv/61218?language=en", "title": "Discovery of Romance", "resume": "Han Yeo-reum is a furniture designer who owns a workshop space that she shares with other designers. For the past three years, she's been dating Nam Ha-jin, a plastic surgeon with a sweet and gentle personality. But Yeo-reum's peaceful existence is shaken when her ex-boyfriend Kang Tae-ha suddenly reappears in her life. The CEO of an interior design company, Tae-ha is a smart, confident man with a strong competitive edge who always gets what he wants. Meanwhile, Ha-jin's childhood friend Ahn Ah-rim has secretly been carrying a torch for him all these years. As she begins working with Tae-ha, Yeo-reum is forced to reevaluate her romantic history, which sets her off on a search for true love.", "rate": 83, "genre": ["Comedy", "Romance"], "cast": ["Eric Mun", "Jung Yu-mi", "Sung Joon", "Yoon Jin-yi", "Kim Seul-Gi"], "character": ["Kang Tae-ha", "Han Yeo-reum", "Nam Ha-jin", "Ahn Ah-rim", "Yoon Sol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61218   Expand Discovery of Romance   (2014) User Score  Play Trailer Overview Han Yeo-reum is a furniture designer who owns a workshop space that she shares with other designers. For the past three years, she's been dating Nam Ha-jin, a plastic surgeon with a sweet and gentle personality. But Yeo-reum's peaceful existence is shaken when her ex-boyfriend Kang Tae-ha suddenly reappears in her life. The CEO of an interior design company, Tae-ha is a smart, confident man with a strong competitive edge who always gets what he wants. Meanwhile, Ha-jin's childhood friend Ahn Ah-rim has secretly been carrying a torch for him all these years. As she begins working with Tae-ha, Yeo-reum is forced to reevaluate her romantic history, which sets her off on a search for true love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Mun Kang Tae-ha Jung Yu-mi Han Yeo-reum Sung Joon Nam Ha-jin Yoon Jin-yi Ahn Ah-rim Kim Seul-Gi Yoon Sol Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Discovery of Romance premiered on August 18, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Discovery of Romance. You can help by rating TV shows you've seen. Facts Original Name  연애의 발견 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/discoverlove/index.html Genres Comedy Romance Keywords korea Content Score 93 Almost there... Top Contributors M 46 Maria180493 s 3 seanjk s 3 sheva_vitali 3 lelouchvib  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}