{"link": "https://www.themoviedb.org/tv/27436?language=en", "title": "The Adventures of the Little Prince", "resume": "The Adventures of the Little Prince is an anime series based on the book by Antoine de Saint-Exupéry. Made by the animation studio Knack Productions, the series, originally titled Hoshi no Ōjisama Puchi Puransu, aired in Japan on the TV Asahi network from July 1978 to March 1979. Dubbed into English, the series premiered in the United States in 1985 on Nickelodeon and was rerun through June 1, 1985 to December 29, 1989. Yoshikazu Yasuhiko, of Mobile Suit Gundam fame, was involved in this series as a director and character designer.\nThe series showed the extended adventures of the Little Prince, Swifty The Space Bird, and the Rose Girl. In total there were 26 episodes aired in English, with 39 episodes made for the original Japanese run.", "rate": 70, "genre": ["Animation"], "cast": ["Masaaki Yajima", "Taiki Matsuno", "Hiroko Maruyama", "Nobuo Tanaka"], "character": ["narrator", "Little Prince", "Claude", "Frank"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27436   Expand The Adventures of the Little Prince   (1978) User Score Overview The Adventures of the Little Prince is an anime series based on the book by Antoine de Saint-Exupéry. Made by the animation studio Knack Productions, the series, originally titled Hoshi no Ōjisama Puchi Puransu, aired in Japan on the TV Asahi network from July 1978 to March 1979. Dubbed into English, the series premiered in the United States in 1985 on Nickelodeon and was rerun through June 1, 1985 to December 29, 1989. Yoshikazu Yasuhiko, of Mobile Suit Gundam fame, was involved in this series as a director and character designer. The series showed the extended adventures of the Little Prince, Swifty The Space Bird, and the Rose Girl. In total there were 26 episodes aired in English, with 39 episodes made for the original Japanese run. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masaaki Yajima narrator Taiki Matsuno Little Prince Hiroko Maruyama Claude Nobuo Tanaka Frank Full Cast & Crew Last Season Season 1 1978 | 39 Episodes Season 1 of The Adventures of the Little Prince premiered on July  4, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of the Little Prince. You can help by rating TV shows you've seen. Facts Original Name  星の王子さま プチ・プランス Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 19 BrerFox m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}