{"link": "https://www.themoviedb.org/tv/14951?language=en", "title": "Nature", "resume": "Consistently stunning documentaries transport viewers to far-flung locations ranging from the torrid African plains to the chilly splendours of icy Antarctica. The show's primary focus is on animals and ecosystems around the world. A comic book based on the show, meant to be used an as educational tool for kids, was briefly distributed to museums and schools at no cost in the mid-2000s.", "rate": 84, "genre": ["Documentary", "News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14951   Expand Nature   (1982) User Score  Play Trailer Overview Consistently stunning documentaries transport viewers to far-flung locations ranging from the torrid African plains to the chilly splendours of icy Antarctica. The show's primary focus is on animals and ecosystems around the world. A comic book based on the show, meant to be used an as educational tool for kids, was briefly distributed to museums and schools at no cost in the mid-2000s. Featured Crew George Page Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  16 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 35 2016 | 7 Episodes Season 35 of Nature premiered on October 11, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  16 Posters  5 Recommendations   2008-02-04 Life in Cold Blood 9.0    2002-11-20 The Life of Mammals 9.1    1986-03-03 Matlock 6.9    1970-09-24 The Odd Couple 7.1    2005-11-23 Life in the Undergrowth 8.4    1999-09-19 Judging Amy 7.1    1984-10-03 Charles in Charge 5.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  55m, 60m Homepage   http://www.pbs.org/wnet/nature/ Genres Documentary News Keywords nature documentary Content Score 71 Just a little bit more... Top Contributors 38 Elizabeth Jennings TB 9 TMDb Bot 5 Banana MC 4 Mike Costa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}