{"link": "https://www.themoviedb.org/tv/61178?language=en", "title": "Corpse Party: Tortured Souls", "resume": "One rainy night after a school festival, a group of students from Kisaragi Academy decide to perform the \"Sachiko Ever After\" charm, which will unite them forever as friends. Once the ritual is done, a sudden earthquake transports them to Heavenly Host, a torn down elementary school. Unbeknownst to Satoshi and his friends, however, is the horrific past behind it which culminated in its demolition. As they look for each other and try to escape from Heavenly Host, they soon find out their lives are at the mercy of those affected by that same bloodied past.", "rate": 74, "genre": ["Animation"], "cast": ["Hiro Shimono", "Asami Imai", "Rina Satou", "Tetsuya Kakihara", "Yuichi Nakamura"], "character": ["Satoshi MOCHIDA", "Ayumi SHINOZAKI", "Naomi NAKASHIMA", "Sakutarou MORISHIGE", "Yoshiki Kishinuma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61178   Expand Corpse Party: Tortured Souls   (2013) User Score Overview One rainy night after a school festival, a group of students from Kisaragi Academy decide to perform the \"Sachiko Ever After\" charm, which will unite them forever as friends. Once the ritual is done, a sudden earthquake transports them to Heavenly Host, a torn down elementary school. Unbeknownst to Satoshi and his friends, however, is the horrific past behind it which culminated in its demolition. As they look for each other and try to escape from Heavenly Host, they soon find out their lives are at the mercy of those affected by that same bloodied past. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiro Shimono Satoshi MOCHIDA Asami Imai Ayumi SHINOZAKI Rina Satou Naomi NAKASHIMA Tetsuya Kakihara Sakutarou MORISHIGE Yuichi Nakamura Yoshiki Kishinuma Full Cast & Crew Last Season Season 1 2013 | 4 Episodes Season 1 of Corpse Party: Tortured Souls premiered on July 23, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Corpse Party: Tortured Souls. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2006-10-03 Ghost Hunt 7.4    2016-07-09 91 Days 7.3    2012-01-10 Another 7.2    2007-07-05 Higurashi When They Cry 7.6    2011-04-16 Deadman Wonderland 7.1    2010-07-05 Highschool of the Dead 7.0    2004-04-06 Monster 7.7    2004-07-25 Elfen Lied 7.6  Facts Original Name  コープスパーティー Tortured Souls Status  Ended Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Video Original Language  Japanese Runtime  29m Homepage  - Genres Animation Keywords supernatural gore mystery miniseries blood demon death based on video game Content Score 86 Almost there... Top Contributors 23 Ronnie Borgquist 22 Elizabeth Jennings TB 9 TMDb Bot CM 7 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}