{"link": "https://www.themoviedb.org/tv/71935?language=en", "title": "Coming Out", "resume": "The explosive lives, loves and losses of an intermingled group of Montréalers are explored as they confront the subject of difference. Managing a modern relationship can be a mess. Single? Attached? Married? Divorced? Open? Closed? The most common answer is ‘It’s complicated.’", "rate": 0, "genre": ["Drama"], "cast": ["Sébastien Beaulac", "Marc-André Poliquin", "Mathieu Blanchard", "Mélanie Pilon", "Patrick Martin"], "character": ["Olivier", "Ian", "Mat", "Caroline", "Hugo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71935   Expand Coming Out   (2013) User Score Overview The explosive lives, loves and losses of an intermingled group of Montréalers are explored as they confront the subject of difference. Managing a modern relationship can be a mess. Single? Attached? Married? Divorced? Open? Closed? The most common answer is ‘It’s complicated.’ Featured Crew Mathieu Blanchard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sébastien Beaulac Olivier Marc-André Poliquin Ian Mathieu Blanchard Mat Mélanie Pilon Caroline Patrick Martin Hugo Full Cast & Crew Last Season Season 2 2014 | 12 Episodes Season 2 of Coming Out premiered on September 25, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Coming Out. You can help by rating TV shows you've seen. Facts Status  Cancelled Networks Sympatico Kebweb.tv enVedette Certification  - Type  Scripted Original Language  French Runtime  13m, 12m, 11m, 10m Homepage  - Genres Drama Keywords gay montreal gay relationship lgbt Content Score 100 Yes! Looking good! Top Contributors 48 Banana p 19 pvarry 6 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}