{"link": "https://www.themoviedb.org/tv/77018?language=en", "title": "Ben", "resume": "A recently divorced reporter moves back to her hometown of Nantes with her daughter, but painful memories await her there… When she was just 16, her Jehovah’s Witness parents forced her to give up her newborn son, a decision that drove her to run away from home and leave Nantes.", "rate": 0, "genre": ["Drama"], "cast": ["Barbara Schulz", "Axelle Dodier", "Samir Guesmi", "Sigrid Bouaziz", "Anne Girouard"], "character": ["Ben Marceau", "Rose Marceau", "Laurent Wagner", "Axelle Robin", "Anne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77018   Expand Ben   (2018) User Score Overview A recently divorced reporter moves back to her hometown of Nantes with her daughter, but painful memories await her there… When she was just 16, her Jehovah’s Witness parents forced her to give up her newborn son, a decision that drove her to run away from home and leave Nantes. Featured Crew Marine Rambach Creator Anne Rambach Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barbara Schulz Ben Marceau Axelle Dodier Rose Marceau Samir Guesmi Laurent Wagner Sigrid Bouaziz Axelle Robin Anne Girouard Anne Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Ben premiered on February 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ben. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  French Runtime  52m Homepage   https://www.france.tv/france-2/ben/ Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 9 Elizabeth Jennings m 9 michael47 D 8 Destr0y 6 scorpio686  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}