{"link": "https://www.themoviedb.org/tv/48904?language=en", "title": "The Fire Next Time", "resume": "In the near future, the unrelenting heat waves and coastal flooding brought on by the greenhouse effect are ravaging the Earth. While scientists and politicians argue and lay blame, ordinary citizens pay the price for a world sickened by pollution and economic disaster. The Fire Next Time is the story of an American family forced to confront this ruinous legacy.\nEmmy Award-winning actor Craig T. Nelson leads his embattled family through a Grapes of Wrath for the modern era. Through this harrowing odyssey, the Morgan family stands as a paradigm of courage, faith, and family unity in the face of adversity on a cataclysmic scale.", "rate": 59, "genre": ["Action", "Adventure", "Drama", "Family"], "cast": ["Craig T. Nelson", "Bonnie Bedelia", "Richard Farnsworth", "Jürgen Prochnow", "Justin Whalin"], "character": ["Drew Morgan", "Suzanne Morgan", "Frank Morgan", "Larry Richter", "Paul Morgan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48904   Expand The Fire Next Time   (1993) User Score Overview In the near future, the unrelenting heat waves and coastal flooding brought on by the greenhouse effect are ravaging the Earth. While scientists and politicians argue and lay blame, ordinary citizens pay the price for a world sickened by pollution and economic disaster. The Fire Next Time is the story of an American family forced to confront this ruinous legacy. Emmy Award-winning actor Craig T. Nelson leads his embattled family through a Grapes of Wrath for the modern era. Through this harrowing odyssey, the Morgan family stands as a paradigm of courage, faith, and family unity in the face of adversity on a cataclysmic scale. Featured Crew James S. Henerson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig T. Nelson Drew Morgan Bonnie Bedelia Suzanne Morgan Richard Farnsworth Frank Morgan Jürgen Prochnow Larry Richter Justin Whalin Paul Morgan Full Cast & Crew Last Season Season 1 1993 | 2 Episodes Season 1 of The Fire Next Time premiered on April 18, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Fire Next Time. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  96m, 97m Homepage  - Genres Action & Adventure Drama Family Keywords future greenhouse effect natural disaster global warming disaster miniseries family greenhouse gases environmental destruction Content Score 79 Pump it up! We're close now. Top Contributors 57 Ted Fraraccio 15 Banana CM 8 Cherche Moi TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}