{"link": "https://www.themoviedb.org/tv/28156?language=en", "title": "Moonfleet", "resume": "Ray Winstone leads a gang of smugglers in our brand new family drama, Moonfleet. Written by Ashley Pharoah (Life on Mars, Ashes to Ashes), this two-part adaptation of the much-loved John Meade Falkner novel is set in the small Dorset village of Moonfleet. In the story, young John Trenchard (Aneurin Barnard - The Truth About Emanuel, The White Queen) is desperate to join the local band of smugglers led by Elzevir Block (Winstone - The Departed, Hugo, Snow White And The Huntsman). Together they embark on an adventure full of action, friendship, and humour, and hunt for a fabled lost diamond. Their journey takes them from 18th Century Dorset, to the jewellery quarter of The Hague, and on to a gripping, final sea voyage. Newcomer Sophie Cookson joins the cast as John's first love, Grace, who is also the daughter of Moonfleet's anti-smuggling magistrate, Mohune, played by Ben Chaplin", "rate": 38, "genre": ["Drama"], "cast": ["Ben Chaplin", "Lorcan Cranitch", "Lesley Vickerage", "Ray Winstone", "Aneurin Barnard"], "character": ["Elzevir Block", "John Trenchard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28156   Expand Moonfleet   (2013) User Score  Play Trailer Overview Ray Winstone leads a gang of smugglers in our brand new family drama, Moonfleet. Written by Ashley Pharoah (Life on Mars, Ashes to Ashes), this two-part adaptation of the much-loved John Meade Falkner novel is set in the small Dorset village of Moonfleet. In the story, young John Trenchard (Aneurin Barnard - The Truth About Emanuel, The White Queen) is desperate to join the local band of smugglers led by Elzevir Block (Winstone - The Departed, Hugo, Snow White And The Huntsman). Together they embark on an adventure full of action, friendship, and humour, and hunt for a fabled lost diamond. Their journey takes them from 18th Century Dorset, to the jewellery quarter of The Hague, and on to a gripping, final sea voyage. Newcomer Sophie Cookson joins the cast as John's first love, Grace, who is also the daughter of Moonfleet's anti-smuggling magistrate, Mohune, played by Ben Chaplin Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Chaplin Lorcan Cranitch Lesley Vickerage Ray Winstone Elzevir Block Aneurin Barnard John Trenchard Full Cast & Crew Last Season Miniseries 2013 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Moonfleet. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Miniseries Original Language  English Runtime  30m Homepage  - Genres Drama Keywords smuggler seaside village dorset Content Score 79 Pump it up! We're close now. Top Contributors 13 Steve TB 12 TMDb Bot n 7 nicb19 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}