{"link": "https://www.themoviedb.org/tv/42995?language=en", "title": "Cobras & Lagartos", "resume": "Cobras & Lagartos is a Brazilian telenovela that was produced and aired by TV Globo from April 24 and November 18, 2006, totaling 179 chapters.\nFeatured Mariana Ximenes, Daniel de Oliveira, Lázaro Ramos, Henri Castelli, Taís Araújo and Carolina Dieckmann in the lead roles.\nThe plot was nominated in 2007 for best actor Emmy for his performance of Lázaro Ramos.", "rate": 0, "genre": ["Drama", "Soap", "Family"], "cast": ["Lázaro Ramos", "Carolina Dieckmann", "Daniel de Oliveira", "Mariana Ximenes", "Henri Castelli"], "character": ["Foguinho / Daniel 'Foguinho' Miranda Café", "Leona Pasquim Montini", "Duda / Daniel Miranda", "Bel / Isabel Pasquim", "Estevão"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42995   Expand Cobras & Lagartos   (2006) User Score Overview Cobras & Lagartos is a Brazilian telenovela that was produced and aired by TV Globo from April 24 and November 18, 2006, totaling 179 chapters. Featured Mariana Ximenes, Daniel de Oliveira, Lázaro Ramos, Henri Castelli, Taís Araújo and Carolina Dieckmann in the lead roles. The plot was nominated in 2007 for best actor Emmy for his performance of Lázaro Ramos. Featured Crew João Emanuel Carneiro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lázaro Ramos Foguinho / Daniel 'Foguinho' Miranda Café Carolina Dieckmann Leona Pasquim Montini Daniel de Oliveira Duda / Daniel Miranda Mariana Ximenes Bel / Isabel Pasquim Henri Castelli Estevão Full Cast & Crew Last Season Season 1 2006 | 179 Episodes Season 1 of Cobras & Lagartos premiered on April 24, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cobras & Lagartos. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  60m Homepage  - Genres Drama Soap Family Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 54 Amanda s 3 speedycars 1 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}