{"link": "https://www.themoviedb.org/tv/14771?language=en", "title": "Middlemarch", "resume": "Middlemarch is a 1994 television adaptation of the 1871 novel of the same name by George Eliot. Produced by the BBC in seven episodes, it is the second such adaptation for television of the novel. It was directed by Anthony Page from a screenplay by Andrew Davies, and starred Juliet Aubrey, Rufus Sewell, Douglas Hodge and Patrick Malahide.", "rate": 80, "genre": ["Drama"], "cast": ["Rufus Sewell", "Juliet Aubrey", "Peter Jeffrey", "Trevyn McDowell", "Douglas Hodge"], "character": ["Will Ladislaw", "Dorothea Brooke", "Bulstrode", "Rosamond Vincy", "Dr. Tertius Lydgate"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14771   Expand Middlemarch   (1994) User Score Overview Middlemarch is a 1994 television adaptation of the 1871 novel of the same name by George Eliot. Produced by the BBC in seven episodes, it is the second such adaptation for television of the novel. It was directed by Anthony Page from a screenplay by Andrew Davies, and starred Juliet Aubrey, Rufus Sewell, Douglas Hodge and Patrick Malahide. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rufus Sewell Will Ladislaw Juliet Aubrey Dorothea Brooke Peter Jeffrey Bulstrode Trevyn McDowell Rosamond Vincy Douglas Hodge Dr. Tertius Lydgate Full Cast & Crew Last Season Miniseries 1994 | 6 Episodes Season 1 of Middlemarch premiered on April 10, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2001-11-11 The Way We Live Now 7.9    2002-11-23 Daniel Deronda 7.2    2009-10-04 Emma 7.7    2004-11-14 North & South 8.2    2010-07-23 The Pillars of the Earth 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords journalist based on novel or book industrial revolution priest miniseries hospital doctor period drama 19th century Content Score 86 Almost there... Top Contributors TB 43 TMDb Bot R 10 Rebecca z 10 zurman1 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}