{"link": "https://www.themoviedb.org/tv/10138?language=en", "title": "James at 15", "resume": "James at 15 is an American drama series that aired on NBC during the 1977-1978 season. The series was preceded by the 1977 made-for-TV movie James at 15, which aired on Monday September 5, 1977 and was intended as a pilot for the series. Both were written by Dan Wakefield, a journalist and fiction writer whose novel Going All the Way, a tale of coming of age in the 1950s, had led to his being contacted by David Sontag of Twentieth Century Fox. David Sontag had had a lunch meeting in NY with Paul Klein, the head of programming at NBC. At lunch Klein said he needed a series for Sunday night. On the spot Sontag created the idea for a coming of age series seen through the eyes of a teenage boy including his dreams, fantasies, and hopes. Klein loved the idea and asked Sontag who would write it. Sontag suggested Dan Wakefield.", "rate": 48, "genre": ["Drama"], "cast": ["Lance Kerwin", "Lynn Carlin", "Linden Chiles", "Kim Richards", "David Raynr"], "character": ["James Hunter", "Meg Hunter", "Paul Hunter", "Sandy Hunter", "Ludwig 'Sly' Hazeltine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10138   Expand James at 15   (1977) User Score  Play Trailer Overview James at 15 is an American drama series that aired on NBC during the 1977-1978 season. The series was preceded by the 1977 made-for-TV movie James at 15, which aired on Monday September 5, 1977 and was intended as a pilot for the series. Both were written by Dan Wakefield, a journalist and fiction writer whose novel Going All the Way, a tale of coming of age in the 1950s, had led to his being contacted by David Sontag of Twentieth Century Fox. David Sontag had had a lunch meeting in NY with Paul Klein, the head of programming at NBC. At lunch Klein said he needed a series for Sunday night. On the spot Sontag created the idea for a coming of age series seen through the eyes of a teenage boy including his dreams, fantasies, and hopes. Klein loved the idea and asked Sontag who would write it. Sontag suggested Dan Wakefield. Featured Crew Dan Wakefield Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lance Kerwin James Hunter Lynn Carlin Meg Hunter Linden Chiles Paul Hunter Kim Richards Sandy Hunter David Raynr Ludwig 'Sly' Hazeltine Full Cast & Crew Last Season Season 1 1977 | 21 Episodes Season 1 of James at 15 premiered on September  5, 1977. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply j .....Used to watch this when I was ten.... Open 0 by jpowell180\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on James at 15. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords boston teen drama Content Score 86 Almost there... Top Contributors 18 Banana 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}