{"link": "https://www.themoviedb.org/tv/35175?language=en", "title": "Glass Mask", "resume": "Her father passed away very early and her mother lives and works in a crowded Chinese restaurant. Kitajima Maya, a 13-year old girl, has to carry the burden of making ends meet as she fights against her ill fate. However, she is able to overcome the trials and tribulations in her life with her passion and enthusiasm. She happens to encounter the reclusive actress Tsukikage who decides to train and mould her into the foremost actress of her generation.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Sanae Kobayashi", "Megumi Toyoguchi", "Toshiyuki Morikawa", "Toshiko Fujita", "Akiko Yajima"], "character": ["Maya Kitajima", "Taiko Kasuga", "Masumi Hayami", "Chigusa Tsukikage", "Ayumi Himekawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35175   Expand Glass Mask   (2005) User Score Overview Her father passed away very early and her mother lives and works in a crowded Chinese restaurant. Kitajima Maya, a 13-year old girl, has to carry the burden of making ends meet as she fights against her ill fate. However, she is able to overcome the trials and tribulations in her life with her passion and enthusiasm. She happens to encounter the reclusive actress Tsukikage who decides to train and mould her into the foremost actress of her generation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sanae Kobayashi Maya Kitajima Megumi Toyoguchi Taiko Kasuga Toshiyuki Morikawa Masumi Hayami Toshiko Fujita Chigusa Tsukikage Akiko Yajima Ayumi Himekawa Full Cast & Crew Last Season Season 1 2005 | 51 Episodes Season 1 of Glass Mask premiered on April  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Glass Mask. You can help by rating TV shows you've seen. Facts Original Name  Glass no Kamen Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tv-tokyo.co.jp/anime/garasunokamen/ Genres Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 15 deanzel p 3 perikoman 3 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}