{"link": "https://www.themoviedb.org/tv/3366?language=en", "title": "Keep It in the Family", "resume": "Keep It in the Family is a British sitcom that aired for five series between 1980 and 1983. It is about a likable and mischievous cartoonist, Dudley Rush. Also featured were Dudley's wife, Muriel and their two daughters, Jacqui and Susan. Dudley's literary agent, Duncan Thomas, was also featured.\nIt was made by Thames Television for the ITV network.\nA remake of Keep It in the Family was produced in the United States under the title Too Close for Comfort, starring Ted Knight.", "rate": 80, "genre": ["Comedy"], "cast": ["Pauline Yates", "Glyn Houston", "Sabina Franklyn", "Robert Gillespie", "Stacy Dorning"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3366   Expand Keep It in the Family   (1980) User Score Overview Keep It in the Family is a British sitcom that aired for five series between 1980 and 1983. It is about a likable and mischievous cartoonist, Dudley Rush. Also featured were Dudley's wife, Muriel and their two daughters, Jacqui and Susan. Dudley's literary agent, Duncan Thomas, was also featured. It was made by Thames Television for the ITV network. A remake of Keep It in the Family was produced in the United States under the title Too Close for Comfort, starring Ted Knight. Featured Crew Brian Cooke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pauline Yates Glyn Houston Sabina Franklyn Robert Gillespie Stacy Dorning Full Cast & Crew Last Season (1980) season 5 1983 | 6 Episodes Season 5 of Keep It in the Family premiered on September  7, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Keep It in the Family. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords family sitcom cartoonist british humour Content Score 93 Almost there... Top Contributors O 6 Ozbourne 1 Joe Carson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}