{"link": "https://www.themoviedb.org/tv/74577?language=en", "title": "The End of the F***ing World", "resume": "James is 17 and is pretty sure he is a psychopath. Alyssa, also 17, is the cool and moody new girl at school. The pair make a connection and she persuades him to embark on a darkly comedic road trip in search of her real father.", "rate": 79, "genre": ["Comedy", "Drama"], "cast": ["Alex Lawther", "Jessica Barden", "Gemma Whelan", "Wunmi Mosaku", "Christine Bottomley"], "character": ["James", "Alyssa", "DC Eunice Noon", "DC Teri Donoghue", "Gwen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74577   Expand The End of the F***ing World   (2017) User Score  Play Trailer Overview James is 17 and is pretty sure he is a psychopath. Alyssa, also 17, is the cool and moody new girl at school. The pair make a connection and she persuades him to embark on a darkly comedic road trip in search of her real father. Featured Crew Charlie Covell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alex Lawther James Jessica Barden Alyssa Gemma Whelan DC Eunice Noon Wunmi Mosaku DC Teri Donoghue Christine Bottomley Gwen Full Cast & Crew Current Season Season 1 2017 | 8 Episodes Season 1 of The End of the F***ing World premiered on October 24, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Enjoyable Open 0 by Kewl Kat\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2017-12-01 Dark 7.9    2017-09-29 Big Mouth 7.8    2017-07-21 Ozark 8.0    2018-02-02 Altered Carbon 7.9    2015-11-06 Master of None 8.0    2017-10-13 Mindhunter 7.4    2017-11-17 Marvel's The Punisher 8.0    2017-03-31 13 Reasons Why 7.2  Facts Status  Returning Series Networks Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Scripted Original Language  English Runtime  21m Homepage   http://www.channel4.com/programmes/the-end-of-the-ing-world Genres Comedy Drama Keywords dark comedy road trip teenager british humour Content Score 100 Yes! Looking good! Top Contributors 20 Elizabeth Jennings J 19 Jkrilin 6 bstarko Y 6 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}