{"link": "https://www.themoviedb.org/tv/68102?language=en", "title": "Brave Witches", "resume": "The Neuroi, an enemy of mankind, suddenly appeared mainly in Europe in the 1930s. Only girls with special magical powers called Witches could confront the Neuroi who were difficult to destroy with ordinary weapons. In 1944, the Neuroi nest above the republic of Gallia was eradicated, and safety of western Europe has been ensured. The allied forces earnestly began planning for an oppositional operation towards central and eastern Europe. An order to scramble is given to the 502nd Joint Fighter Wing \"Brave Witches\" whose base is in Peterburg within the Orussian Empire.", "rate": 65, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68102   Expand Brave Witches   (2016) User Score  Play Trailer Overview The Neuroi, an enemy of mankind, suddenly appeared mainly in Europe in the 1930s. Only girls with special magical powers called Witches could confront the Neuroi who were difficult to destroy with ordinary weapons. In 1944, the Neuroi nest above the republic of Gallia was eradicated, and safety of western Europe has been ensured. The allied forces earnestly began planning for an oppositional operation towards central and eastern Europe. An order to scramble is given to the 502nd Joint Fighter Wing \"Brave Witches\" whose base is in Peterburg within the Orussian Empire. Featured Crew Kazuhiro Takamura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Original Air Date Original Air Date Absolute Order (Absolute) Chronological Order (Absolute) Season 1 2016 | 12 Episodes Season 1 of Brave Witches premiered on October  5, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Brave Witches. You can help by rating TV shows you've seen. Facts Original Name  ブレイブウィッチーズ Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://w-witch.jp/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 15 Banana 9 Elizabeth Jennings 7 ioneakatzuki 5 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}