{"link": "https://www.themoviedb.org/tv/5026?language=en", "title": "Space Rangers", "resume": "Space Rangers is an American futuristic science fiction drama. The short lived series aired on CBS in 1993. The show was created by Pen Densham and Trilogy Entertainment Group.", "rate": 43, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Cary-Hiroyuki Tagawa", "Gottfried John", "Danny Quinn", "Jack McGee", "Linda Hunt"], "character": ["Zylyn", "Erich Weiss", "Daniel Kincaid", "Doc", "Cmdr. Chennault"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5026   Expand Space Rangers   (1993) User Score Overview Space Rangers is an American futuristic science fiction drama. The short lived series aired on CBS in 1993. The show was created by Pen Densham and Trilogy Entertainment Group. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cary-Hiroyuki Tagawa Zylyn Gottfried John Erich Weiss Danny Quinn Daniel Kincaid Jack McGee Doc Linda Hunt Cmdr. Chennault Full Cast & Crew Last Season Season 1 1993 | 6 Episodes Season 1 of Space Rangers premiered on January 27, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1984-01-22 Airwolf 6.6    1980-12-11 Magnum, P.I. 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords future space space station Content Score 86 Almost there... Top Contributors 20 Banana PE 8 Patrick E. Abe O 4 Onofrete 4 Евгений  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}