{"link": "https://www.themoviedb.org/tv/3888?language=en", "title": "Party Animals", "resume": "Party Animals presents Westminster from the ground up – the young researchers and advisors shouldering huge responsibility in a frantic, high-stakes world. It's no wonder their personal lives are so messy. Sons of an ex-Labour MP, Scott and Danny Foster have politics in their blood.", "rate": 90, "genre": ["Comedy"], "cast": ["Peter Wight", "Shelley Conn", "Matt Smith", "Andrea Riseborough", "Raquel Cassidy"], "character": ["George Morgan", "Ashika Chandirimani", "Danny Foster", "Kirsty MacKenzie", "Jo Porter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3888   Expand Party Animals   (2007) User Score Overview Party Animals presents Westminster from the ground up – the young researchers and advisors shouldering huge responsibility in a frantic, high-stakes world. It's no wonder their personal lives are so messy. Sons of an ex-Labour MP, Scott and Danny Foster have politics in their blood. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Wight George Morgan Shelley Conn Ashika Chandirimani Matt Smith Danny Foster Andrea Riseborough Kirsty MacKenzie Raquel Cassidy Jo Porter Full Cast & Crew Last Season Season 1 2007 | 8 Episodes Season 1 of Party Animals premiered on January 31, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Party Animals. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Party Animals. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b006v0d7 Genres Comedy Keywords parliament miniseries british politics Content Score 86 Almost there... Top Contributors TB 17 TMDb Bot L 11 Lurin 9 Elizabeth Jennings R 8 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}