{"link": "https://www.themoviedb.org/tv/67749?language=en", "title": "Killer Instinct with Chris Hansen", "resume": "Chris Hansen brings his unrivaled journalistic skills to a series revealing the hidden truth behind America's most shocking murders. His trade-mark interviewing excellence guides the viewer through every twist and turn of an enthralling criminal drama.", "rate": 80, "genre": ["Crime", "Drama", "Documentary"], "cast": ["Chris Hansen"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67749   Expand Killer Instinct with Chris Hansen   (2015) User Score Overview Chris Hansen brings his unrivaled journalistic skills to a series revealing the hidden truth behind America's most shocking murders. His trade-mark interviewing excellence guides the viewer through every twist and turn of an enthralling criminal drama. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Hansen Himself - Host Full Cast & Crew Last Season Season 3 2017 | 4 Episodes Season 3 of Killer Instinct with Chris Hansen premiered on September  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Killer Instinct with Chris Hansen. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  - Homepage   https://www.investigationdiscovery.com/tv-shows/killer-instinct-with-chris-hansen/ Genres Crime Drama Documentary Keywords docudrama Content Score 56 We're so close, yet so far. Top Contributors 27 Elizabeth Jennings h 5 hollerlouder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}