{"link": "https://www.themoviedb.org/tv/46002?language=en", "title": "Missing You", "resume": "Missing You is a 2012 South Korean television series, starring Yoon Eun-hye, Park Yoochun and Yoo Seung-ho. It aired on Munhwa Broadcasting Corporation from November 7, 2012 to January 17, 2013 on Wednesdays and Thursdays at 21:55 for 21 episodes.\nHigh school sweethearts Jung-woo and Soo-yeon were separated in a horrifying tragedy that continues to weigh down on them as adults. Now a guilt-ridden detective, Jung-woo has been desperately searching for Soo-yeon for years, but when he crosses paths with her again, she has already become someone else with a new identity.", "rate": 93, "genre": ["Drama"], "cast": ["Park Yoo-chun", "Yeo Jin-goo", "Yoon Eun-hye", "Kim So-hyun", "Yoo Seung-Ho"], "character": ["Han Jung-woo", "Han Jung-woo (young)", "Lee Soo-yeon", "Lee Soo-yeon (young)", "Kang Hyung-joon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46002   Expand Missing You   (2012) User Score Overview Missing You is a 2012 South Korean television series, starring Yoon Eun-hye, Park Yoochun and Yoo Seung-ho. It aired on Munhwa Broadcasting Corporation from November 7, 2012 to January 17, 2013 on Wednesdays and Thursdays at 21:55 for 21 episodes. High school sweethearts Jung-woo and Soo-yeon were separated in a horrifying tragedy that continues to weigh down on them as adults. Now a guilt-ridden detective, Jung-woo has been desperately searching for Soo-yeon for years, but when he crosses paths with her again, she has already become someone else with a new identity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  23 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Yoo-chun Han Jung-woo Yeo Jin-goo Han Jung-woo (young) Yoon Eun-hye Lee Soo-yeon Kim So-hyun Lee Soo-yeon (young) Yoo Seung-Ho Kang Hyung-joon Full Cast & Crew Last Season Season 1 2012 | 21 Episodes Season 1 of Missing You premiered on November  7, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  23 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Missing You. You can help by rating TV shows you've seen. Facts Original Name  보고싶다 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/bogo/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 46 Maria180493 z 10 zurman1 5 Elizabeth Jennings t 4 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}