{"link": "https://www.themoviedb.org/tv/2942?language=en", "title": "The Tudors", "resume": "The Tudors is a history-based drama series following the young, vibrant King Henry VIII, a competitive and lustful monarch who navigates the intrigues of the English court and the human heart with equal vigor and justifiable suspicion.", "rate": 77, "genre": ["Drama", "History", "Romance"], "cast": ["Jonathan Rhys Meyers", "Henry Cavill", "Sarah Bolger", "Max Brown", "Joss Stone"], "character": ["Henry VIII of England", "Charles Brandon", "Mary Tudor", "Edward Seymour", "Anne of Cleves"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2942   Expand The Tudors   (2007) User Score  Play Trailer Overview The Tudors is a history-based drama series following the young, vibrant King Henry VIII, a competitive and lustful monarch who navigates the intrigues of the English court and the human heart with equal vigor and justifiable suspicion. Featured Crew Michael Hirst Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  35 Posters  10 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Jonathan Rhys Meyers Henry VIII of England Henry Cavill Charles Brandon Sarah Bolger Mary Tudor Max Brown Edward Seymour Joss Stone Anne of Cleves Full Cast & Crew Last Season Season 4 2010 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply n What is the choral work in S3 E3 at 3:00? Open 0 by nanonta\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  35 Posters  10 Recommendations   2011-06-24 The Borgias 7.5    2005-08-28 Rome 8.2    2010-01-22 Spartacus 7.8    2010-09-19 Boardwalk Empire 7.7    2005-08-07 Weeds 7.1    2010-09-26 Downton Abbey 8.0    2003-09-14 Carnivàle 8.1    2006-03-12 Big Love 7.6  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  55m Homepage   http://www.sho.com/the-tudors Genres Drama History Romance Keywords england royal family historical drama 16th century Content Score 100 Yes! Looking good! Top Contributors 109 Marr 🇳🇱 58 lineker b 38 beautiful49 e 37 enzo94  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}