{"link": "https://www.themoviedb.org/tv/61435?language=en", "title": "Orenchi no Furo Jijou", "resume": "Tatsumi is a high school student who lives on his own, until a merman named Wakasa takes up residence in his bathtub. His solitary lifestyle is turned upside down by the self-centered (but handsome) new roommate.", "rate": 60, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61435   Expand Orenchi no Furo Jijou   (2014) User Score Overview Tatsumi is a high school student who lives on his own, until a merman named Wakasa takes up residence in his bathtub. His solitary lifestyle is turned upside down by the self-centered (but handsome) new roommate. Featured Crew Aoi Sayo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Orenchi no Furo Jijou premiered on October  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Orenchi no Furo Jijou. You can help by rating TV shows you've seen. Facts Original Name  オレん家のフロ事情 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  4m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Keywords shoujo anime Content Score 64 We're so close, yet so far. Top Contributors 19 sp1ti S 16 SuperTouch 8 Elizabeth Jennings CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}