{"link": "https://www.themoviedb.org/tv/66580?language=en", "title": "Jeong Do-jeon", "resume": "Set between late Koryo Dynasty and early Choson Dynasty period. Jung Do-Jeon plans for the new country of \"Choson\" and new culture as an influential advisor to King Taejo. Jung Do-Jeon resistance among those that want to keep Koryo.", "rate": 90, "genre": ["Drama"], "cast": ["Jo Jae-hyeon", "Yoo Dong-geun", "Park Young-gyu", "Im Ho", "Ahn Jae-mo"], "character": ["Jeong Do-jeon", "Yi Seong-gye", "Yi In-im", "Jeong Mong-ju", "Yi Bang-won"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66580   Expand Jeong Do-jeon   (2014) User Score  Play Trailer Overview Set between late Koryo Dynasty and early Choson Dynasty period. Jung Do-Jeon plans for the new country of \"Choson\" and new culture as an influential advisor to King Taejo. Jung Do-Jeon resistance among those that want to keep Koryo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jo Jae-hyeon Jeong Do-jeon Yoo Dong-geun Yi Seong-gye Park Young-gyu Yi In-im Im Ho Jeong Mong-ju Ahn Jae-mo Yi Bang-won Full Cast & Crew Last Season Season 1 2014 | 50 Episodes Season 1 of Jeong Do-jeon premiered on January  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jeong Do-jeon. You can help by rating TV shows you've seen. Facts Original Name  정도전 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  50m Homepage   http://www.kbs.co.kr/drama/jeongdojeon/ Genres Drama Keywords politics korea historical Content Score 93 Almost there... Top Contributors t 35 tmdb38202327 3 lemonlyman t 2 tmdb983464 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}