{"link": "https://www.themoviedb.org/tv/68595?language=en", "title": "Planet Earth II", "resume": "David Attenborough presents a documentary series exploring how animals meet the challenges of surviving in the most iconic habitats on earth.", "rate": 84, "genre": ["Documentary", "Family"], "cast": ["David Attenborough"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68595   Expand Planet Earth II   (2016) User Score  Play Trailer Overview David Attenborough presents a documentary series exploring how animals meet the challenges of surviving in the most iconic habitats on earth. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  34 Posters  16 Videos Trailers  3 Teasers  0 Clips  4 Featurettes  6 Opening Credits  0 Top Billed Cast David Attenborough Himself - Presenter Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Planet Earth II premiered on November  6, 2016. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Definitely better than Planet Earth (2006) Open 0 by Ben Caesar™\n      \n     MY Just watching now EP1    SPOILERS Open 0 by Mrs. Y\n      \n     Go to Discussions Media Most Popular Videos  13 Backdrops  34 Posters  16 Recommendations   2006-03-05 Planet Earth 8.5    2009-10-11 Life 8.3    2001-09-12 The Blue Planet 8.4    2011-01-13 Human Planet 8.2    2011-10-26 Frozen Planet 8.3    2013-01-02 Africa 8.2    1990-01-01 Mr. Bean 7.8    1991-09-08 Darkwing Duck 7.3  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p02544td Genres Documentary Family Keywords fish sea island ocean mountain bird earth forest savannah jungle miniseries desert animal nature cities nature documentary sea creature Content Score 64 We're so close, yet so far. Top Contributors 79 Elizabeth Jennings TB 44 TMDb Bot l 25 llluqiang 23 david8s95  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}