{"link": "https://www.themoviedb.org/tv/13531?language=en", "title": "The Beatles", "resume": "The Beatles is an American animated television series featuring the fanciful and musical misadventures of the popular English rock band of the same name. It ran from 1965 to 1969 on ABC in the US. The series debuted on September 25, 1965 and ended on September 7, 1969. A total of 39 episodes were produced. The series was shown on Saturday mornings at 10:30 AM EST until the 1967 third season when it was moved to 12:00 PM EST. For the fourth season, which consisted of reruns, the series was shown at 9:30 AM EST on Sunday mornings. Each episode has a name of a Beatles song, so the story is based on its lyrics and it is also played at some time in the episode. The original series was rebroadcast in syndication by MTV in 1986 and 1987 and on the Disney Channel. The series was a historical milestone as the first weekly television series to feature animated versions of real, living people.", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Paul Frees", "Ringo Starr", "Paul McCartney", "Lance Percival", "John Lennon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13531   Expand The Beatles   (1965) User Score Overview The Beatles is an American animated television series featuring the fanciful and musical misadventures of the popular English rock band of the same name. It ran from 1965 to 1969 on ABC in the US. The series debuted on September 25, 1965 and ended on September 7, 1969. A total of 39 episodes were produced. The series was shown on Saturday mornings at 10:30 AM EST until the 1967 third season when it was moved to 12:00 PM EST. For the fourth season, which consisted of reruns, the series was shown at 9:30 AM EST on Sunday mornings. Each episode has a name of a Beatles song, so the story is based on its lyrics and it is also played at some time in the episode. The original series was rebroadcast in syndication by MTV in 1986 and 1987 and on the Disney Channel. The series was a historical milestone as the first weekly television series to feature animated versions of real, living people. Featured Crew Al Brodax Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Frees Ringo Starr Paul McCartney Lance Percival John Lennon Full Cast & Crew Last Season Season 2 1966 | 20 Episodes Season 2 of The Beatles premiered on February  5, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Beatles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 18m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}