{"link": "https://www.themoviedb.org/tv/69714?language=en", "title": "Evil Minds", "resume": "A gifted criminal profiler lost someone important to him while he was helping the police solve a bizarre campus serial killing. The lost crippled his mind and left him unable to profile again. But when another serial killing threatened the city, he had to confront his inner demon in order to track down the serial killer.", "rate": 0, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Chen Ruo Xuan", "Wang Long Zheng"], "character": ["Fang Mu", "Tai Wei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69714   Expand Evil Minds   (2015) User Score Overview A gifted criminal profiler lost someone important to him while he was helping the police solve a bizarre campus serial killing. The lost crippled his mind and left him unable to profile again. But when another serial killing threatened the city, he had to confront his inner demon in order to track down the serial killer. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chen Ruo Xuan Fang Mu Wang Long Zheng Tai Wei Full Cast & Crew Last Season Season 2 2016 | 24 Episodes Season 2 of Evil Minds premiered on December  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Evil Minds. You can help by rating TV shows you've seen. Facts Original Name  心理罪 Status  Ended Networks LeTV Certification  - Type  Scripted Original Language  Chinese Runtime  30m Homepage   http://baike.baidu.com/subview/1356099/16951143.htm Genres Crime Drama Mystery Keywords china suspense Content Score 56 We're so close, yet so far. Top Contributors M 27 Maria180493 e 21 eMo318 2 bookser R 2 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}