{"link": "https://www.themoviedb.org/tv/13802?language=en", "title": "The Palace", "resume": "The Palace was a British drama television series that aired on ITV in 2008. Produced by Company Pictures for the ITV network, it was created by Tom Grieves and follows a fictional British Royal Family in the aftermath of the death of King James III and the succession of his 24-year-old son, Richard IV, played by Rupert Evans. It also stars Jane Asher and Zoe Telford. The series was filmed on location in Lithuania in 2007 and broadcast from January to March 2008. It was axed after one series due to low viewing figures.", "rate": 0, "genre": ["Drama"], "cast": ["Zoe Telford", "Jane Asher", "Roy Marsden", "Rupert Evans", "Sophie Winkleman"], "character": ["Abigail Thomas", "Queen Charlotte", "Sir Iain Ratalick", "King Richard IV", "Princess Eleanor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13802   Expand The Palace   (2008) User Score Overview The Palace was a British drama television series that aired on ITV in 2008. Produced by Company Pictures for the ITV network, it was created by Tom Grieves and follows a fictional British Royal Family in the aftermath of the death of King James III and the succession of his 24-year-old son, Richard IV, played by Rupert Evans. It also stars Jane Asher and Zoe Telford. The series was filmed on location in Lithuania in 2007 and broadcast from January to March 2008. It was axed after one series due to low viewing figures. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zoe Telford Abigail Thomas Jane Asher Queen Charlotte Roy Marsden Sir Iain Ratalick Rupert Evans King Richard IV Sophie Winkleman Princess Eleanor Full Cast & Crew Last Season Season 1 2008 | 8 Episodes Season 1 of The Palace premiered on January 14, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Palace. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 45m, 60m Homepage   http://www.itv.com/Drama/contemporary/ThePalace/default.html Genres Drama Keywords england royal family Content Score 86 Almost there... Top Contributors 17 Banana 5 galani 3 lineker s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}