{"link": "https://www.themoviedb.org/tv/21409?language=en", "title": "Dinosaur King", "resume": "Dinosaur King is a card-based arcade game from Sega that uses the same gameplay mechanics from Mushiking but uses super-powered dinosaurs instead of beetles. The game was revealed in JAMMA 2005 and is available in Japanese and English versions. A Nintendo DS version has also been released in North America.\nIn the fall of 2008, Upper Deck Company released a Dinosaur King Trading Card Game. This card game is not to be confused with the cards used for the arcade machines.\nThe series has been adapted into an anime TV series, Ancient Ruler Dinosaur King DKidz Adventure, which is made by Sunrise and premiered on TV Asahi on February 4, 2007. As of 2008, an English adaptation aired on the 4Kids TV block on the Fox Network, but moved to The CW's The CW4Kids block on September 6, 2008.\nA sequel was announced called \"Ancient Ruler Dinosaur King DKidz Adventure: Pterosaur Legend,\" which debuted February 3, 2008 in Japan.\nThe show ended its run in Japan in late 2008.", "rate": 55, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy", "Action", "Adventure"], "cast": ["Amanda Brown", "Tetsuo Goto"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21409   Expand Dinosaur King   (2007) User Score Overview Dinosaur King is a card-based arcade game from Sega that uses the same gameplay mechanics from Mushiking but uses super-powered dinosaurs instead of beetles. The game was revealed in JAMMA 2005 and is available in Japanese and English versions. A Nintendo DS version has also been released in North America. In the fall of 2008, Upper Deck Company released a Dinosaur King Trading Card Game. This card game is not to be confused with the cards used for the arcade machines. The series has been adapted into an anime TV series, Ancient Ruler Dinosaur King DKidz Adventure, which is made by Sunrise and premiered on TV Asahi on February 4, 2007. As of 2008, an English adaptation aired on the 4Kids TV block on the Fox Network, but moved to The CW's The CW4Kids block on September 6, 2008. A sequel was announced called \"Ancient Ruler Dinosaur King DKidz Adventure: Pterosaur Legend,\" which debuted February 3, 2008 in Japan. The show ended its run in Japan in late 2008. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Brown Tetsuo Goto Full Cast & Crew Last Season Season 2 2010 | 30 Episodes Season 2 of Dinosaur King premiered on March 20, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dinosaur King. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 5 zurman1 3 jokebume 2 danimados  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}