{"link": "https://www.themoviedb.org/tv/34891?language=en", "title": "Jake and the Never Land Pirates", "resume": "A crew of kid pirates - leader Jake and pals Izzy and Cubby - and their Never Land adventures as they work to outwit two infamous characters, the one and only Captain Hook and Smee.", "rate": 56, "genre": ["Family", "Animation", "Action", "Adventure"], "cast": ["David Arquette", "Madison Pettis", "Corey Burton", "Jonathan Morgan Heit", "Jeff Bennett"], "character": ["Skully", "Izzy", "Captain Hook", "Chubby", "Mr. Smee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34891   Expand Jake and the Never Land Pirates   (2011) User Score Overview A crew of kid pirates - leader Jake and pals Izzy and Cubby - and their Never Land adventures as they work to outwit two infamous characters, the one and only Captain Hook and Smee. Featured Crew Roberts Gannaway Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  10 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Arquette Skully Madison Pettis Izzy Corey Burton Captain Hook Jonathan Morgan Heit Chubby Jeff Bennett Mr. Smee Full Cast & Crew Last Season Season 4 2015 | 35 Episodes Season 4 of Jake and the Never Land Pirates premiered on September 19, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Jake and the Never Land Pirates. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Jake and the Never Land Pirates. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  22m Homepage   http://disneyjunior.com/jake-and-the-never-land-pirates Genres Family Animation Action & Adventure Keywords peter pan children pirate Content Score 100 Yes! Looking good! Top Contributors S 28 Sander w 19 wil001 14 Banana R 12 Raabi2208  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}