{"link": "https://www.themoviedb.org/tv/74739?language=en", "title": "Unikitty", "resume": "As ruler of the kingdom, Unikitty has busy days full of royal responsibilities. Unikitty is most interested in making sure everyone is happy and ridding the kingdom of negativity, but don't misunderstand her optimism, she is one kitty not to be crossed. While she may be full of boundless energy and creativity, Unikitty is a force to be reckoned with if anyone gets in the way of spreading her positive vibes, especially if anyone makes her little brother and best friend, Puppycorn, sad. Also living in the castle are Dr. Fox, the resident scientist, and Unikitty's trusty bodyguard, Hawkodile. Through it all, Unikitty and her friends make sure that every day is the happiest and most creative ever.", "rate": 100, "genre": ["Family", "Animation", "Comedy"], "cast": ["Tara Strong", "Grey DeLisle", "Kate Micucci", "Roger Craig Smith"], "character": ["Unikitty", "Puppycorn", "Dr. Fox", "Hawkodile, Richard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74739   Expand Unikitty   (2017) User Score  Play Trailer Overview As ruler of the kingdom, Unikitty has busy days full of royal responsibilities. Unikitty is most interested in making sure everyone is happy and ridding the kingdom of negativity, but don't misunderstand her optimism, she is one kitty not to be crossed. While she may be full of boundless energy and creativity, Unikitty is a force to be reckoned with if anyone gets in the way of spreading her positive vibes, especially if anyone makes her little brother and best friend, Puppycorn, sad. Also living in the castle are Dr. Fox, the resident scientist, and Unikitty's trusty bodyguard, Hawkodile. Through it all, Unikitty and her friends make sure that every day is the happiest and most creative ever. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tara Strong Unikitty Grey DeLisle Puppycorn Kate Micucci Dr. Fox Roger Craig Smith Hawkodile, Richard Full Cast & Crew Current Season Season 1 2017 | 3 Episodes Season 1 of Unikitty premiered on October 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Unikitty. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification ALL Meaning This rating is for programming that is appropriate for all ages. This program usually involves programs designed for children or families. Type  Scripted Original Language  English Runtime  11m Homepage  - Genres Family Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 7 AngelWorks 7 tigru89 m 6 mehlizorg s 6 stom7714  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}