{"link": "https://www.themoviedb.org/tv/21855?language=en", "title": "07-Ghost", "resume": "Set in a gothic fantasy world, this is the story of Teito Klein, an orphaned slave who became the top military academy student. However, an unexpected turn of events left him pursued by the forces of the Barsburg Empire. Now an escaping convict, Teito's sheltered by the church and its law of sanctuary. Here, he discovered many mysteries surrounding himself, the church, and the Empire itself. The fact that he might be connected to a dethroned king and the mystical stone of god, \"The Eye of Mikhael\", made him the target of the empire more than ever. Fortunately the church is under the mythical 7 Ghost protection. But who are the Ghosts really. Will Teito be free from the military's clutch, and what of his said mission to uncover the history. And who is the military's Chief-of-Staff Ayanami exactly. Teito's future seems to have spiraled into an unexpectedly perilous path.", "rate": 73, "genre": ["Animation"], "cast": ["Hiroki Takahashi", "Mitsuki Saiga", "Kazuya Nakai", "Daisuke Kishio", "Hatano Wataru"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21855   Expand 07-Ghost   (2009) User Score Overview Set in a gothic fantasy world, this is the story of Teito Klein, an orphaned slave who became the top military academy student. However, an unexpected turn of events left him pursued by the forces of the Barsburg Empire. Now an escaping convict, Teito's sheltered by the church and its law of sanctuary. Here, he discovered many mysteries surrounding himself, the church, and the Empire itself. The fact that he might be connected to a dethroned king and the mystical stone of god, \"The Eye of Mikhael\", made him the target of the empire more than ever. Fortunately the church is under the mythical 7 Ghost protection. But who are the Ghosts really. Will Teito be free from the military's clutch, and what of his said mission to uncover the history. And who is the military's Chief-of-Staff Ayanami exactly. Teito's future seems to have spiraled into an unexpectedly perilous path. Featured Crew Yukino Ichihara Creator Yuki Amemiya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroki Takahashi Mitsuki Saiga Kazuya Nakai Daisuke Kishio Hatano Wataru Full Cast & Crew Last Season Season 1 2009 | 25 Episodes Season 1 of 07-Ghost premiered on April  6, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for 07-Ghost. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 07-Ghost. You can help by rating TV shows you've seen. Facts Original Name  セブンゴースト Status  Ended Network Certification 12 Meaning Not recommended for children under 12. Not allowed air before 10:00 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Keywords fantasy magic church demon military Content Score 100 Yes! Looking good! Top Contributors T 36 Tinobe Z 22 Zayrus 20 Elizabeth Jennings 8 Jhoellys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}