{"link": "https://www.themoviedb.org/tv/1250?language=en", "title": "Duty Free", "resume": "Duty Free is a British sitcom written by Eric Chappell and Jean Warr that aired on ITV from 1984 to 1986. It was made by Yorkshire Television.", "rate": 85, "genre": ["Comedy"], "cast": ["Gwen Taylor", "Keith Barron", "Joanna Van Gyseghem", "Neil Stacy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1250   Expand Duty Free   (1984) User Score Overview Duty Free is a British sitcom written by Eric Chappell and Jean Warr that aired on ITV from 1984 to 1986. It was made by Yorkshire Television. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gwen Taylor Keith Barron Joanna Van Gyseghem Neil Stacy Full Cast & Crew Last Season Season 3 1986 | 8 Episodes Season 3 of Duty Free premiered on January  8, 1986. View All Seasons Social Reviews  1 Discussions  0 A review by Ian Phillips Written by  Ian Phillips  on October  7, 2017 Time seems to have eclipsed exactly how popular this BAFTA-nominated British sitcom once was in its heyday. In its time it regularly topped the UK TV ratings, even elbowing Coronation Street and EastEnders from the top spot on occasions. This was definitely one of ITV's better sitcoms of the day and was often hailed as \"ITV's answer to Fawlty Towers\". This is something of an overstatement as it's not a patch on Fawlty Towers, but it certainly has SOMETHING going for it. Strictly lightweight fare, this is, perhaps, perfect viewing for a rainy Sunday afternoon (if you like this sort of thing that...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Duty Free. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords married couple honeymoon briton abroad sitcom british humour Content Score 86 Almost there... Top Contributors O 9 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}