{"link": "https://www.themoviedb.org/tv/43390?language=en", "title": "Made in Jersey", "resume": "A young working-class woman who uses her street smarts to compete among her pedigreed Manhattan colleagues at a prestigious New York law firm.", "rate": 75, "genre": ["Drama"], "cast": ["Janet Montgomery", "Kyle MacLachlan", "Kristoffer Polaha", "Megalyn Echikunwoke", "Toni Trucks"], "character": ["Martina Garretti", "Donovan Stark", "Nolan Adams", "Riley Prescott", "Cyndi Vega"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43390   Expand Made in Jersey   (2012) User Score  Play Trailer Overview A young working-class woman who uses her street smarts to compete among her pedigreed Manhattan colleagues at a prestigious New York law firm. Featured Crew Dana Calvo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Janet Montgomery Martina Garretti Kyle MacLachlan Donovan Stark Kristoffer Polaha Nolan Adams Megalyn Echikunwoke Riley Prescott Toni Trucks Cyndi Vega Full Cast & Crew Last Season Season 1 2012 | 8 Episodes Season 1 of Made in Jersey premiered on September 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Made in Jersey. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Drama Keywords new york italian american lawyer law firm Content Score 100 Yes! Looking good! Top Contributors 33 Banana s 17 stingray23 w 4 webmaster V 1 VintageSmoke  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}