{"link": "https://www.themoviedb.org/tv/42418?language=en", "title": "Kiddy Girl-and", "resume": "Kiddy GiRL-AND is a 2009 sequel to the science fiction anime series Kiddy Grade, created by gímik and Satelight and directed by Keiji Gotoh. The manga adaptation Kiddy Girl-and Pure, illustrated by Yukari Higa, ran in Comp Ace and was released as two collected volumes.", "rate": 100, "genre": ["Action", "Adventure", "Animation"], "cast": ["Aya Uchida", "Chiharu Kitaoka", "Yumeha Takahashi", "Norio Wakamoto", "Kaori Mizuhashi"], "character": ["Ascoeur", "Q-feuille", "Di-air", "T.A.M.A", "Hiver"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42418   Expand Kiddy Girl-and   (2009) User Score Overview Kiddy GiRL-AND is a 2009 sequel to the science fiction anime series Kiddy Grade, created by gímik and Satelight and directed by Keiji Gotoh. The manga adaptation Kiddy Girl-and Pure, illustrated by Yukari Higa, ran in Comp Ace and was released as two collected volumes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  22 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aya Uchida Ascoeur Chiharu Kitaoka Q-feuille Yumeha Takahashi Di-air Norio Wakamoto T.A.M.A Kaori Mizuhashi Hiver Full Cast & Crew Last Season Season 1 2009 | 24 Episodes Season 1 of Kiddy Girl-and premiered on October 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  22 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kiddy Girl-and. You can help by rating TV shows you've seen. Facts Original Name  キディ・ガーランド Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.kiddygirl-and.com/ Genres Action & Adventure Animation Keywords anime Content Score 86 Almost there... Top Contributors 7 greenglass 3 Banana T 3 TexBill m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}