{"link": "https://www.themoviedb.org/tv/17381?language=en", "title": "I Survived...", "resume": "What would you do if you were confronted with death? What gives someone the strength to survive? Is it luck, chance, instinct? In a stripped-down, simple-yet-cinematic interview style, “I Survived…” allows survivors to explain, in their own words, how they overcame unbelievable circumstances — offering insight into what got them through the experience that changed their lives forever.", "rate": 77, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17381   Expand I Survived...   (2008) User Score Overview What would you do if you were confronted with death? What gives someone the strength to survive? Is it luck, chance, instinct? In a stripped-down, simple-yet-cinematic interview style, “I Survived…” allows survivors to explain, in their own words, how they overcame unbelievable circumstances — offering insight into what got them through the experience that changed their lives forever. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 8 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply k This show is so difficult to watch... Open 0 by kucios\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I Survived.... You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 60m Homepage   http://www.biography.com/isurvived/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors t 2 tukul123 MP 1 Mr. Peanutbutter 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}