{"link": "https://www.themoviedb.org/tv/50719?language=en", "title": "We Are Men", "resume": "We Are Men is about four single guys living in a short-term apartment complex who unexpectedly find camaraderie over their many missteps in love.", "rate": 53, "genre": ["Comedy"], "cast": ["Tony Shalhoub", "Jerry O'Connell", "Kal Penn", "Christopher Nicholas Smith", "Rebecca Breeds"], "character": ["Frank Russo", "Stuart Weber", "Gil Bartis", "Carter Thomas", "Abby Russo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50719   Expand We Are Men   (2013) User Score Overview We Are Men is about four single guys living in a short-term apartment complex who unexpectedly find camaraderie over their many missteps in love. Featured Crew Rob Greenberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tony Shalhoub Frank Russo Jerry O'Connell Stuart Weber Kal Penn Gil Bartis Christopher Nicholas Smith Carter Thomas Rebecca Breeds Abby Russo Full Cast & Crew Last Season Season 1 2013 | 8 Episodes Season 1 of We Are Men premiered on September 30, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2013-09-26 The Crazy Ones 5.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  20m Homepage   https://www.cbs.com/shows/we-are-men/ Genres Comedy Keywords male friendship divorce sitcom Content Score 93 Almost there... Top Contributors 22 United600 19 Banana w 3 webmaster e 3 error666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}