{"link": "https://www.themoviedb.org/tv/10097?language=en", "title": "Dastardly and Muttley in Their Flying Machines", "resume": "Dastardly and Muttley in Their Flying Machines is a cartoon produced by Hanna-Barbera Productions for CBS. Originally the series was broadcast as a Saturday morning cartoon, airing from September 13, 1969 to January 3, 1970. The show focuses on the efforts of Dick Dastardly and his canine sidekick Muttley to catch Yankee Doodle Pigeon, a carrier pigeon who carries secret messages. The cartoon was a combination of Red Baron-era Snoopy, Wacky Races, and the film Those Magnificent Men in Their Flying Machines.\nThe show is widely known as Stop the Pigeon based on the show's original working title and the show's theme song, written by William Hanna and Joseph Barbera which repeats that phrase so often that it is frequently mistaken as the show's actual title. In the UK, the series remains best known by the shorter name Dastardly and Muttley.\nThe show had only two voice actors: Paul Winchell as Dick Dastardly and the indistinctly heard General, and Don Messick as everybody else. Each 22-minute show was broadcast over half an hour on the network, including network breaks, and contained: two Dastardly & Muttley stories, one Magnificent Muttley story, and two or three short Wing Dings.", "rate": 68, "genre": ["Animation", "Comedy"], "cast": ["Paul Winchell", "Don Messick", "Wally Boag"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10097   Expand Dastardly and Muttley in Their Flying Machines   (1969) User Score Overview Dastardly and Muttley in Their Flying Machines is a cartoon produced by Hanna-Barbera Productions for CBS. Originally the series was broadcast as a Saturday morning cartoon, airing from September 13, 1969 to January 3, 1970. The show focuses on the efforts of Dick Dastardly and his canine sidekick Muttley to catch Yankee Doodle Pigeon, a carrier pigeon who carries secret messages. The cartoon was a combination of Red Baron-era Snoopy, Wacky Races, and the film Those Magnificent Men in Their Flying Machines. The show is widely known as Stop the Pigeon based on the show's original working title and the show's theme song, written by William Hanna and Joseph Barbera which repeats that phrase so often that it is frequently mistaken as the show's actual title. In the UK, the series remains best known by the shorter name Dastardly and Muttley. The show had only two voice actors: Paul Winchell as Dick Dastardly and the indistinctly heard General, and Don Messick as everybody else. Each 22-minute show was broadcast over half an hour on the network, including network breaks, and contained: two Dastardly & Muttley stories, one Magnificent Muttley story, and two or three short Wing Dings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Winchell Don Messick Wally Boag Full Cast & Crew Last Season Season 1 1969 | 35 Episodes Season 1 of Dastardly and Muttley in Their Flying Machines premiered on September 20, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1961-01-30 The Yogi Bear Show 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 10 Jorge Torre B 6 Boxi88 d 6 denis z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}