{"link": "https://www.themoviedb.org/tv/73660?language=en", "title": "Mysticons", "resume": "The tale of four girls who transform into legendary warriors known as Mysticons. The Mysticons must use their powers to save their realm from Necrafa, an evil queen.", "rate": 0, "genre": ["Action", "Adventure", "Animation"], "cast": ["David Berni", "Alyson Court", "Ana Sani", "Nicki Burke"], "character": ["Gawayne (voice)", "Arkayna Goodfey / Mysticon Dragon Mage (voice)", "Piper Willowbrook", "Mysticon Ranger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73660   Expand Mysticons   (2017) User Score  Play Trailer Overview The tale of four girls who transform into legendary warriors known as Mysticons. The Mysticons must use their powers to save their realm from Necrafa, an evil queen. Featured Crew Sean Jara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Berni Gawayne (voice) Alyson Court Arkayna Goodfey / Mysticon Dragon Mage (voice) Ana Sani Piper Willowbrook Nicki Burke Mysticon Ranger Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Mysticons premiered on August 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mysticons. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 8 FredG89 m 5 mehlizorg c 4 coffinbearer 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}