{"link": "https://www.themoviedb.org/tv/74733?language=en", "title": "Delicious Destiny", "resume": "Li Yu Zhe is a Western cuisine chef who is obsessed with gourmet food. When he participates in a TV cooking program, he meets the playwright-director Song Jia Ming who has an amazing sense of taste. The two quarrel a lot at first, but soon they’re attracted to each other.", "rate": 0, "genre": ["Drama"], "cast": ["Pirath Nitipaisankul", "Mao Xiao Tong"], "character": ["Li Yuzhe", "Song Jiaming"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74733   Expand Delicious Destiny   (2017) User Score Overview Li Yu Zhe is a Western cuisine chef who is obsessed with gourmet food. When he participates in a TV cooking program, he meets the playwright-director Song Jia Ming who has an amazing sense of taste. The two quarrel a lot at first, but soon they’re attracted to each other. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pirath Nitipaisankul Li Yuzhe Mao Xiao Tong Song Jiaming Full Cast & Crew Last Season Season 1 2017 | 0 Episodes Season 1 of Delicious Destiny premiered on September 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Delicious Destiny. You can help by rating TV shows you've seen. Facts Original Name  美味奇缘 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Drama Keywords romance food Content Score 56 We're so close, yet so far. Top Contributors 16 sansalayne d 11 davita 3 FullAnimess TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}