{"link": "https://www.themoviedb.org/tv/46080?language=en", "title": "Masha and the Bear", "resume": "Masha is an energetic three-year-old who can’t seem to keep herself out of trouble. Bear is a warm, fatherly figure that does his best to guide his friend and keep her from harm, often ending up the unintended victim of her misadventures.", "rate": 69, "genre": ["Animation", "Family", "Kids"], "cast": ["Barbara Sarantseva", "Boris Kutnevich"], "character": ["Masha (voice)", "Bear (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46080   Expand Masha and the Bear   (2009) User Score  Play Trailer Overview Masha is an energetic three-year-old who can’t seem to keep herself out of trouble. Bear is a warm, fatherly figure that does his best to guide his friend and keep her from harm, often ending up the unintended victim of her misadventures. Featured Crew Oleg Kuzovkov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  31 Images Backdrops  7 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barbara Sarantseva Masha (voice) Boris Kutnevich Bear (voice) Full Cast & Crew Last Season Season 3 2015 | 17 Episodes Season 3 of Masha and the Bear premiered on November 28, 2015. View All Seasons Social Reviews  0 Discussions  31 Subject Status Replies Last Reply There are no discussions for Masha and the Bear. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  15 Recommendations   2014-09-27 The Lava Field 6.4    2015-01-10 My Sunshine 7.4    2015-09-12 Goldie & Bear 5.4    2014-02-23 Griselda Blanco: The Black Widow 6.2    2011-04-02 Tiger & Bunny 6.5    2016-01-23 Chelsea Does 7.2    2012-08-07 DreamWorks Dragons 7.2  Facts Original Name  Ма́ша и Медве́дь Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  Russian Runtime  7m Homepage   http://mashabear.com Genres Animation Family Kids Keywords bear kids cartoon bear Content Score 71 Just a little bit more... Top Contributors 33 Banana E 28 EightNine S 21 Soxiz 18 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}