{"link": "https://www.themoviedb.org/tv/4695?language=en", "title": "Battle of the Planets", "resume": "Battle of the Planets cast five young people as G-Force, consisting of Mark, Jason, Princess, Keyop, and Tiny. G-Force protects Earth from planet Spectra and other attacks from beyond space. The most prominent field commander of the Spectra forces was a villainous, masked individual known as Zoltar, who received his orders directly from the \"Luminous One\".\nBattle of the Planets is an American adaptation of the Japanese anime series Science Ninja Team Gatchaman.", "rate": 71, "genre": ["Animation", "Action", "Adventure"], "cast": ["Janet Waldo", "Casey Kasem", "Alan Young", "Keye Luke", "Ronnie Schell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4695   Expand Battle of the Planets   (1978) User Score Overview Battle of the Planets cast five young people as G-Force, consisting of Mark, Jason, Princess, Keyop, and Tiny. G-Force protects Earth from planet Spectra and other attacks from beyond space. The most prominent field commander of the Spectra forces was a villainous, masked individual known as Zoltar, who received his orders directly from the \"Luminous One\". Battle of the Planets is an American adaptation of the Japanese anime series Science Ninja Team Gatchaman. Featured Crew Tatsuo Yoshida Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Janet Waldo Casey Kasem Alan Young Keye Luke Ronnie Schell Full Cast & Crew Last Season Season 1 1978 | 85 Episodes Season 1 of Battle of the Planets premiered on September  1, 1978. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Watching Episodes Open 2 by  GForce59 live action Open 1 by  GForce59 Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations   1977-02-10 The New Adventures of Batman 6.0    1985-09-30 M.A.S.K. 5.4    1988-10-25 Midnight Caller 8.0    1983-03-08 The Fall Guy 6.4    1985-09-09 She-Ra: Princess of Power 6.2    1983-09-17 Dungeons & Dragons 7.6  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors d 14 denis t 7 tmdb983464 5 t0by 3 martinbm76  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}