{"link": "https://www.themoviedb.org/tv/71146?language=en", "title": "Condor", "resume": "Young CIA analyst Joe Turner has his idealism tested when he learns that the CIA has been using an algorithm he developed to spy on American citizens, leading the organization to a terrorist plot that threatens the lives of millions.  Inspired by Sydney Pollack’s 1975 political thriller Three Days of the Condor.", "rate": 60, "genre": ["Drama"], "cast": ["Max Irons", "William Hurt", "Leem Lubany", "Mira Sorvino", "Brendan Fraser"], "character": ["Joe Turner", "Bob Partridge", "Gabrielle Joubert", "Marty Frost", "Nathan Fowler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71146   Expand Condor   (2018) User Score  Play Trailer Overview Young CIA analyst Joe Turner has his idealism tested when he learns that the CIA has been using an algorithm he developed to spy on American citizens, leading the organization to a terrorist plot that threatens the lives of millions.  Inspired by Sydney Pollack’s 1975 political thriller Three Days of the Condor. Featured Crew Jason Smilovic Creator Todd Katzberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Max Irons Joe Turner William Hurt Bob Partridge Leem Lubany Gabrielle Joubert Mira Sorvino Marty Frost Brendan Fraser Nathan Fowler Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Condor premiered on June  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Condor. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  53m Homepage   http://start.att.net/exclusive/audience/condor Genres Drama Keywords cia thriller government conspiracy political thriller Content Score 100 Yes! Looking good! Top Contributors 62 Elizabeth Jennings H 4 Honigschnitzel s 3 speedycars P 3 PlexRowe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}