{"link": "https://www.themoviedb.org/tv/38885?language=en", "title": "Survivor Turkey", "resume": "Survivor Turkey is the Turkish version of the popular reality Survivor. This version of the show has aired on both Kanal D in 2005, and on Show TV in 2006, 2007, and 2010. From the beginning Survivor was a success in Turkey, however the cost of producing the show proved to be too much for Kanal D and even Show TV couldn't afford to produce the show on a yearly basis. Because of production costs the show was put on hiatus in 2007 and was brought back three years later. The prize for the first seasons of the show was 150,000 euros, for the second and third seasons 250,000 euros, and 500,000 dollars for the fourth season.", "rate": 90, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38885   Expand Survivor Turkey User Score Overview Survivor Turkey is the Turkish version of the popular reality Survivor. This version of the show has aired on both Kanal D in 2005, and on Show TV in 2006, 2007, and 2010. From the beginning Survivor was a success in Turkey, however the cost of producing the show proved to be too much for Kanal D and even Show TV couldn't afford to produce the show on a yearly basis. Because of production costs the show was put on hiatus in 2007 and was brought back three years later. The prize for the first seasons of the show was 150,000 euros, for the second and third seasons 250,000 euros, and 500,000 dollars for the fourth season. Featured Crew Acun Ilıcalı Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 12 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 16 ontiptv f 3 ferman k 1 kaynakiptv@gmail.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}