{"link": "https://www.themoviedb.org/tv/53135?language=en", "title": "Ip Man", "resume": "Ip Man is a 2013 Chinese television series based on the life of the Wing Chun grandmaster Ip Man. Directed by Fan Xiaotian, the series starred Kevin Cheng as the titular character and was first aired on Astro On Demand between March and May 2013.", "rate": 60, "genre": ["Drama", "Action", "Adventure"], "cast": ["Liu Xiaofeng", "Kevin Cheng", "Chrissie Chau", "Yu Rong-Guang", "Ka-Yan Leung"], "character": ["Lin Qingshan", "Ye Wen", "Jenny", "Yu Fengjiu", "Meister Hong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53135   Expand Ip Man (TV series)    (2013) User Score Overview Ip Man is a 2013 Chinese television series based on the life of the Wing Chun grandmaster Ip Man. Directed by Fan Xiaotian, the series starred Kevin Cheng as the titular character and was first aired on Astro On Demand between March and May 2013. Featured Crew Fan Xiaotian Creator Ren Sha Creator Zhu Yili Creator Charcoal Tan    Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liu Xiaofeng Lin Qingshan Kevin Cheng Ye Wen Chrissie Chau Jenny Yu Rong-Guang Yu Fengjiu Ka-Yan Leung Meister Hong Full Cast & Crew Last Season Season 1 2013 | 10 Episodes Season 1 of Ip Man (TV series)  premiered on February 24, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ip Man (TV series) . You can help by rating TV shows you've seen. Facts Original Name  叶问 Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors S 13 Shady12 b 6 brucechew MD 5 Monkey D Mills M 4 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}