{"link": "https://www.themoviedb.org/tv/61202?language=en", "title": "Tokyo ESP", "resume": "Rinka Urushiba is a normal high school girl, until she encounters a penguin and shoals of glowing fish swimming through the sky. She looses consciousness only to awaken with the power to move through inanimate objects. At first she thought it was a hallucination if it were not for Kyotaro Azuma who witnessed the event and who, incidentally, has the ability to teleport. They decide to use their powers to combat people who might use their powers for evil.", "rate": 70, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61202   Expand Tokyo ESP   (2014) User Score Overview Rinka Urushiba is a normal high school girl, until she encounters a penguin and shoals of glowing fish swimming through the sky. She looses consciousness only to awaken with the power to move through inanimate objects. At first she thought it was a hallucination if it were not for Kyotaro Azuma who witnessed the event and who, incidentally, has the ability to teleport. They decide to use their powers to combat people who might use their powers for evil. Featured Crew Shigehito Takayanagi Creator Hideyuki Kurata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Tokyo ESP premiered on July 11, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tokyo ESP. You can help by rating TV shows you've seen. Facts Original Name  東京ESP Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tokyo-esp.org Genres Action & Adventure Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 20 Elizabeth Jennings 19 Sierrda CM 6 Cherche Moi B 4 Bonsai  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}