{"link": "https://www.themoviedb.org/tv/9386?language=en", "title": "Backpackers", "resume": "Backpackers is a mixed genre travel-reality television program created by and starring friends Mick Middleton, James Grech and Lee Mahoney from Colac, Victoria.\nThe show was shot on three cameras over a year as Middleton, Grech and Mahoney left everything behind and backpacked on a shoestring budget around Europe.\nIt began airing in Australia on 13 November 2006 on Foxtel's Channel V, but had already been picked up and aired in other countries throughout the world, including OLN Canada, C4 New Zealand, Extreme sports channel Extreme Sports Channelin England, in Turkey, Dream TV Turkey and Channel V in Malaysia.\nThe program has received mixed reviews and cult recognition due to the nature in which the three backpackers went about making the show on small cameras and traveling on their own funds, interviewing, partying and recording all the random moments that occurred throughout the trip.\nBackpackers has been both criticized and praised for its honest portrayal of a year of budget travel and has received a small cult base. Backpackers has also been criticized for not being easy to find on the Internet.", "rate": 30, "genre": ["Action", "Adventure", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9386   Expand Backpackers   (2013) User Score Overview Backpackers is a mixed genre travel-reality television program created by and starring friends Mick Middleton, James Grech and Lee Mahoney from Colac, Victoria. The show was shot on three cameras over a year as Middleton, Grech and Mahoney left everything behind and backpacked on a shoestring budget around Europe. It began airing in Australia on 13 November 2006 on Foxtel's Channel V, but had already been picked up and aired in other countries throughout the world, including OLN Canada, C4 New Zealand, Extreme sports channel Extreme Sports Channelin England, in Turkey, Dream TV Turkey and Channel V in Malaysia. The program has received mixed reviews and cult recognition due to the nature in which the three backpackers went about making the show on small cameras and traveling on their own funds, interviewing, partying and recording all the random moments that occurred throughout the trip. Backpackers has been both criticized and praised for its honest portrayal of a year of budget travel and has received a small cult base. Backpackers has also been criticized for not being easy to find on the Internet. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2015 | 24 Episodes Season 2 of Backpackers premiered on May 11, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Backpackers. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://cwseed.com/shows/backpackers Genres Action & Adventure Comedy Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors LD 8 Lloyd Davis M 5 Maxime84 5 Elizabeth Jennings CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}