{"link": "https://www.themoviedb.org/tv/8880?language=en", "title": "Space Cobra", "resume": "Cobra is a Japanese manga series written and illustrated by Buichi Terasawa. Set in the far future, the series tells the story of Cobra, who lived an adventurous life until his enemies began to hunt him down. Cobra surgically altered his face and erased his own memory in order to hide from his foes and lead a normal life. Eventually, he regains his memories and re-unites with his old partner Lady Armaroid and his ship Tortuga. Cobra travels the galaxy, fighting the outlaw Pirate Guild, but also fleeing the law-enforcing Milky Way Patrol. Along with his charm and wit, Cobra survives thanks to his Psycho-Gun, a weapon embedded in his left arm.\nThe manga was originally serialized in Shueisha's Weekly Shōnen Jump from 1978 to 1984. The individual chapters were collected and published in 18 tankōbon volumes by Shueisha. The Cobra manga spawned various sequel manga series, one-shots, a feature-length anime film, two anime series —a 1982 anime with 31 episodes retelling the film's story and a 13-episode broadcast in 2010—, two original video animations, audio albums, video games, and other merchandise. In 2010, the production of a live-action film was announced by Alexandre Aja.", "rate": 85, "genre": ["Action", "Adventure", "Animation"], "cast": ["Nachi Nozawa", "Toshiko Fujita", "Kiyoshi Kobayashi", "Yoshiko Sakakibara", "Reiko Tajima"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8880   Expand Space Cobra   (1982) User Score  Play Trailer Overview Cobra is a Japanese manga series written and illustrated by Buichi Terasawa. Set in the far future, the series tells the story of Cobra, who lived an adventurous life until his enemies began to hunt him down. Cobra surgically altered his face and erased his own memory in order to hide from his foes and lead a normal life. Eventually, he regains his memories and re-unites with his old partner Lady Armaroid and his ship Tortuga. Cobra travels the galaxy, fighting the outlaw Pirate Guild, but also fleeing the law-enforcing Milky Way Patrol. Along with his charm and wit, Cobra survives thanks to his Psycho-Gun, a weapon embedded in his left arm. The manga was originally serialized in Shueisha's Weekly Shōnen Jump from 1978 to 1984. The individual chapters were collected and published in 18 tankōbon volumes by Shueisha. The Cobra manga spawned various sequel manga series, one-shots, a feature-length anime film, two anime series —a 1982 anime with 31 episodes retelling the film's story and a 13-episode broadcast in 2010—, two original video animations, audio albums, video games, and other merchandise. In 2010, the production of a live-action film was announced by Alexandre Aja. Featured Crew Buichi Terasawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nachi Nozawa Toshiko Fujita Kiyoshi Kobayashi Yoshiko Sakakibara Reiko Tajima Full Cast & Crew Last Season Space adventure  season 1 1982 | 31 Episodes Season 1 of Space Cobra premiered on October  7, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Space Cobra. You can help by rating TV shows you've seen. Facts Original Name  スペースコブラ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Animation Keywords space adventure Content Score 100 Yes! Looking good! Top Contributors 10 guitsou f 7 flecomte95 m 5 maintest z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}