{"link": "https://www.themoviedb.org/tv/4153?language=en", "title": "Not The Nine O'Clock News", "resume": "Not the Nine O'Clock News is a television comedy sketch show which was broadcast on BBC2 from 1979 to 1982. Originally shown as a comedy alternative to the Nine O'Clock News on BBC1, it featured satirical sketches on current news stories and popular culture, as well as parody songs, comedy sketches, re-edited videos, and spoof television formats. The show featured Rowan Atkinson, Pamela Stephenson, Mel Smith, and Griff Rhys Jones, as well as Chris Langham in the first series. The format was a deliberate departure from the Monty Python's Flying Circus stream-of-consciousness meta-comedy, returning to a more conventional sketch show format. Sketches were mostly self-contained, lasting from a few seconds to a few minutes and often had a degree of naturalism in performance. The series launched the careers of several high-profile actors and writers, and also led to other comedy series including Blackadder, Mr. Bean, and Alas Smith and Jones.", "rate": 80, "genre": ["Comedy"], "cast": ["Rowan Atkinson", "Mel Smith", "Pamela Stephenson", "Griff Rhys Jones", "Chris Langham"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4153   Expand Not The Nine O'Clock News   (1979) User Score Overview Not the Nine O'Clock News is a television comedy sketch show which was broadcast on BBC2 from 1979 to 1982. Originally shown as a comedy alternative to the Nine O'Clock News on BBC1, it featured satirical sketches on current news stories and popular culture, as well as parody songs, comedy sketches, re-edited videos, and spoof television formats. The show featured Rowan Atkinson, Pamela Stephenson, Mel Smith, and Griff Rhys Jones, as well as Chris Langham in the first series. The format was a deliberate departure from the Monty Python's Flying Circus stream-of-consciousness meta-comedy, returning to a more conventional sketch show format. Sketches were mostly self-contained, lasting from a few seconds to a few minutes and often had a degree of naturalism in performance. The series launched the careers of several high-profile actors and writers, and also led to other comedy series including Blackadder, Mr. Bean, and Alas Smith and Jones. Featured Crew John Lloyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rowan Atkinson Mel Smith Pamela Stephenson Griff Rhys Jones Chris Langham Full Cast & Crew Last Season Season 4 1982 | 6 Episodes Season 4 of Not The Nine O'Clock News premiered on February  1, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Not The Nine O'Clock News. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords satire sketch comedy british humour Content Score 93 Almost there... Top Contributors O 5 Ozbourne R 2 Rebecca 2 kcdh 1 davidsben  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}