{"link": "https://www.themoviedb.org/tv/50718?language=en", "title": "Spell of the Moon", "resume": "She is a young reporter aiming to write a story about a secretive Casino owner named Sama, unbeknowst to her they have a history together. When she was a kid, he gave her money to care for her sick mother who later died. In return for his kindness, she saved him from being killed by hoodlums at a casino. As an adult she has a lot of prejudices for gambling and casinos because her father was a gambler who abandoned them when her, her ailing mother, and twin sister needed him the most.", "rate": 80, "genre": ["Soap", "Drama"], "cast": ["Chatchai Plengpanich", "Kanyarat Jirarachakij", "Pawinar Chaleewsakul", "Khemasorn Nukhao", "Thongkhao Pattarachokchai"], "character": ["Nok", "Tik", "Pun", "Milk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50718   Expand Spell of the Moon   (2013) User Score  Play Trailer Overview She is a young reporter aiming to write a story about a secretive Casino owner named Sama, unbeknowst to her they have a history together. When she was a kid, he gave her money to care for her sick mother who later died. In return for his kindness, she saved him from being killed by hoodlums at a casino. As an adult she has a lot of prejudices for gambling and casinos because her father was a gambler who abandoned them when her, her ailing mother, and twin sister needed him the most.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chatchai Plengpanich Nok Kanyarat Jirarachakij Tik Pawinar Chaleewsakul Pun Khemasorn Nukhao Milk Thongkhao Pattarachokchai Full Cast & Crew Last Season Season 1 2013 | 11 Episodes Season 1 of Spell of the Moon premiered on May  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Spell of the Moon. You can help by rating TV shows you've seen. Facts Original Name  มนต์จันทรา Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  98m Homepage   http://th.wikipedia.org/wiki/%E0%B8%A1%E0%B8%99%E0%B8%95%E0%B9%8C%E0%B8%88%E0%B8%B1%E0%B8%99%E0%B8%97%E0%B8%A3%E0%B8%B2 Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 41 Crip 8 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}