{"link": "https://www.themoviedb.org/tv/62001?language=en", "title": "Point of Honor", "resume": "At the start of the Civil War, a prominent Virginia family makes the controversial decision to defend the South while freeing all of their slaves, pitting the family against one another and testing their strength, courage and love.", "rate": 0, "genre": ["Drama"], "cast": ["Luke Benward", "Patrick Heusinger", "Lucien Laviscount", "Hanna Mangan Lawrence", "Christopher O'Shea"], "character": ["Garland Rhodes", "Colonel Palmer Kane", "Elijah", "Estella Rhodes", "Robert Sumner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62001   Expand Point of Honor   (2015) User Score Overview At the start of the Civil War, a prominent Virginia family makes the controversial decision to defend the South while freeing all of their slaves, pitting the family against one another and testing their strength, courage and love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Benward Garland Rhodes Patrick Heusinger Colonel Palmer Kane Lucien Laviscount Elijah Hanna Mangan Lawrence Estella Rhodes Christopher O'Shea Robert Sumner Full Cast & Crew Last Season Season 1 2015 | 1 Episode Season 1 of Point of Honor premiered on January 15, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Point of Honor. You can help by rating TV shows you've seen. Facts Status  Pilot Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  57m, 60m Homepage   http://www.amazon.com/Point-of-Honor-HD/dp/B00RSGFYQE Genres Drama Keywords civil war american civil war historical drama 19th century Content Score 86 Almost there... Top Contributors 29 United600 13 Elizabeth Jennings 10 Banana z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}