{"link": "https://www.themoviedb.org/tv/1406?language=en", "title": "Deadwood", "resume": "The story of the early days of Deadwood, South Dakota; woven around actual historic events with most of the main characters based on real people. Deadwood starts as a gold mining camp and gradually turns from a lawless wild-west community into an organized wild-west civilized town. The story focuses on the real-life characters Seth Bullock and Al Swearengen.", "rate": 81, "genre": ["Crime", "Drama", "Western"], "cast": ["Timothy Olyphant", "Ian McShane", "Molly Parker", "Jim Beaver", "W. Earl Brown"], "character": ["Seth Bullock", "Al Swearengen", "Alma Garret", "Whitney Ellsworth", "Dan Dority"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1406   Expand Deadwood   (2004) User Score  Play Trailer Overview The story of the early days of Deadwood, South Dakota; woven around actual historic events with most of the main characters based on real people. Deadwood starts as a gold mining camp and gradually turns from a lawless wild-west community into an organized wild-west civilized town. The story focuses on the real-life characters Seth Bullock and Al Swearengen. Featured Crew David Milch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  0 Images Backdrops  23 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Timothy Olyphant Seth Bullock Ian McShane Al Swearengen Molly Parker Alma Garret Jim Beaver Whitney Ellsworth W. Earl Brown Dan Dority Full Cast & Crew Last Season Season 3 2006 | 12 Episodes View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Any confirmed movie news in 2017? Open 7 by  WalkGood w Whitney Ellsworth: Happy Birthday Jim Beaver! Open 0 by wonder2wonder\n      \n     MY Garret Dillahunt .... Open 4 by  Mrs. Y Go to Discussions Media Most Popular Videos  1 Backdrops  23 Posters  11 Recommendations   2010-03-16 Justified 7.9    2010-09-19 Boardwalk Empire 7.7    2002-03-12 The Shield 8.1    2005-08-28 Rome 8.2    1999-01-10 The Sopranos 8.3    2002-06-02 The Wire 8.4    2001-06-03 Six Feet Under 8.2    1997-07-12 Oz 8.1  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  55m, 60m Homepage   http://www.hbo.com/deadwood Genres Crime Drama Western Keywords saloon gold rush goldmine saloon owner wild west historical drama 19th century Content Score 100 Yes! Looking good! Top Contributors 48 Elizabeth Jennings 24 United600 16 Travis Bell t 14 tinybutstrong  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}