{"link": "https://www.themoviedb.org/tv/79950?language=en", "title": "All or Nothing: New Zealand All Blacks", "resume": "For the first time ever, The New Zealand All Blacks rugby team, one of the most successful teams in global sports history, allow cameras to join them as they face one of their most difficult seasons yet. Follow them, as they face the demands of the most physically grueling team sport on the planet to uphold a legacy of excellence and dominance that goes back well over a century.", "rate": 0, "genre": ["Documentary", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79950   Expand All or Nothing: New Zealand All Blacks   (2018) User Score  Play Trailer Overview For the first time ever, The New Zealand All Blacks rugby team, one of the most successful teams in global sports history, allow cameras to join them as they face one of their most difficult seasons yet. Follow them, as they face the demands of the most physically grueling team sport on the planet to uphold a legacy of excellence and dominance that goes back well over a century. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of All or Nothing: New Zealand All Blacks premiered on May 31, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on All or Nothing: New Zealand All Blacks. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Documentary Original Language  English Runtime  - Homepage   https://www.amazon.com/dp/B07CXJ9YZY Genres Documentary Reality Keywords rugby Content Score 64 We're so close, yet so far. Top Contributors 15 Elizabeth Jennings 14 United600 k 6 kershaw1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}