{"link": "https://www.themoviedb.org/tv/69158?language=en", "title": "The Good Fight", "resume": "Picking up one year after the events of the final broadcast episode of \"The Good Wife\", an enormous financial scam has destroyed the reputation of a young lawyer, Maia Rindell, while simultaneously wiping out her mentor and godmother Diane Lockhart's savings. Forced out of her law firm, now called \"Lockhart, Deckler, Gussman, Lee, Lyman, Gilbert, Lurie, Kagan, Tannebaum & Associates\", they join Lucca Quinn at one of Chicago's preeminent law firms.", "rate": 75, "genre": ["Drama"], "cast": ["Christine Baranski", "Cush Jumbo", "Rose Leslie", "Sarah Steele", "Justin Bartha"], "character": ["Diane Lockhart", "Lucca Quinn", "Maia Rindell", "Marissa Gold", "Colin Morrello"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69158   Expand The Good Fight   (2017) User Score  Play Trailer Overview Picking up one year after the events of the final broadcast episode of \"The Good Wife\", an enormous financial scam has destroyed the reputation of a young lawyer, Maia Rindell, while simultaneously wiping out her mentor and godmother Diane Lockhart's savings. Forced out of her law firm, now called \"Lockhart, Deckler, Gussman, Lee, Lyman, Gilbert, Lurie, Kagan, Tannebaum & Associates\", they join Lucca Quinn at one of Chicago's preeminent law firms. Featured Crew Phil Alden Robinson Creator Michelle King Creator Robert King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  19 Content Issues  4 Images Backdrops  16 Posters  13 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  2 Opening Credits  1 Top Billed Cast Christine Baranski Diane Lockhart Cush Jumbo Lucca Quinn Rose Leslie Maia Rindell Sarah Steele Marissa Gold Justin Bartha Colin Morrello Full Cast & Crew Current Season Season 2 2018 | 13 Episodes View All Seasons Social Reviews  0 Discussions  23 Subject Status Replies Last Reply Kalinda? Open 0 by janar\n      \n     Sorry about the mess. ... Open 0 by janar\n      \n     e Is anyone watching this? Open 6 by  mechajutaro Go to Discussions Media Most Popular Videos  5 Backdrops  16 Posters  13 Recommendations   2017-10-01 Ten Days in the Valley 6.0    2017-09-11 Rellik 6.2    2018-06-04 Dietland 8.0    2018-05-14 Innocent 9.5    2018-04-08 Killing Eve 8.7    2016-03-30 The Path 6.6    2009-09-22 The Good Wife 7.2    2017-09-11 Liar 6.8  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   http://www.cbs.com/shows/the-good-fight Genres Drama Keywords chicago government investigation lawyer courtroom ponzi scheme law firm 21st century case of the week Content Score 100 Yes! Looking good! Top Contributors 489 janar 47 Elizabeth Jennings 17 Imzadi 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}