{"link": "https://www.themoviedb.org/tv/1753?language=en", "title": "Goodness Gracious Me", "resume": "Goodness Gracious Me is a BBC English language sketch comedy show originally aired on BBC Radio 4 from 1996 to 1998 and later televised on BBC Two from 1998 to 2001. The ensemble cast were four British Indian actors, Sanjeev Bhaskar, Kulvinder Ghir, Meera Syal and Nina Wadia. The show explored the conflict and integration between traditional Indian culture and modern British life. Some sketches reversed the roles to view the British from an Indian perspective, and others poked fun at Indian stereotypes. In the television series most of the white characters were played by Dave Lamb and Fiona Allen; in the radio series those parts were played by the cast themselves.\nThe show's title and theme tune is a bhangra rearrangement of a hit comedy song of the same name. The original was performed by Peter Sellers and Sophia Loren reprising their characters from the 1960 film The Millionairess. The show's original working title was \"Peter Sellers is Dead\", but was changed because the cast generally liked Peter Sellers. In her 1996 novel Anita and Me, Syal had referred to British parodies of Asian speech as \"a goodness-gracious-me accent\".\nOne of the more famous sketches featured the cast \"going out for an English\" after a few lassis. They mispronounce the waiter's name, order the blandest thing on the menu and ask for twenty-four plates of chips. The sketch parodies often-drunk English people \"going out for an Indian\", ordering chicken phall and too many papadums. This sketch was voted the 6th Greatest Comedy Sketch on a Channel 4 list show.", "rate": 70, "genre": ["Comedy"], "cast": ["Nina Wadia", "Meera Syal", "Kulvinder Ghir", "Sanjeev Bhaskar", "Konnie Huq"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1753   Expand Goodness Gracious Me   (1996) User Score Overview Goodness Gracious Me is a BBC English language sketch comedy show originally aired on BBC Radio 4 from 1996 to 1998 and later televised on BBC Two from 1998 to 2001. The ensemble cast were four British Indian actors, Sanjeev Bhaskar, Kulvinder Ghir, Meera Syal and Nina Wadia. The show explored the conflict and integration between traditional Indian culture and modern British life. Some sketches reversed the roles to view the British from an Indian perspective, and others poked fun at Indian stereotypes. In the television series most of the white characters were played by Dave Lamb and Fiona Allen; in the radio series those parts were played by the cast themselves. The show's title and theme tune is a bhangra rearrangement of a hit comedy song of the same name. The original was performed by Peter Sellers and Sophia Loren reprising their characters from the 1960 film The Millionairess. The show's original working title was \"Peter Sellers is Dead\", but was changed because the cast generally liked Peter Sellers. In her 1996 novel Anita and Me, Syal had referred to British parodies of Asian speech as \"a goodness-gracious-me accent\". One of the more famous sketches featured the cast \"going out for an English\" after a few lassis. They mispronounce the waiter's name, order the blandest thing on the menu and ask for twenty-four plates of chips. The sketch parodies often-drunk English people \"going out for an Indian\", ordering chicken phall and too many papadums. This sketch was voted the 6th Greatest Comedy Sketch on a Channel 4 list show. Featured Crew Meera Syal Creator Sanjeev Bhaskar Creator Anil Gupta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nina Wadia Meera Syal Kulvinder Ghir Sanjeev Bhaskar Konnie Huq Full Cast & Crew Last Season Season 3 2000 | 7 Episodes Season 3 of Goodness Gracious Me premiered on February 25, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Goodness Gracious Me. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.bbc.co.uk/comedy/guide/articles/g/goodnessgracious_66601650.shtml Genres Comedy Keywords culture clash satire sketch comedy british humour Content Score 93 Almost there... Top Contributors O 6 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}