{"link": "https://www.themoviedb.org/tv/37100?language=en", "title": "Akane-iro ni Somaru Saka", "resume": "Akaneiro ni Somaru Saka, also known in short as Akasaka, is a Japanese adult visual novel developed by Feng and first released for the PC as a DVD on July 27, 2007. A version without adult content was released under the title Akaneiro ni Somaru Saka: Parallel on July 31, 2008 by GN Software for the PlayStation 2. A port of this version of the game was released for the PlayStation Portable on December 17, 2009 under the title Akaneiro ni Somaru Saka: Portable. The gameplay in Akaneiro ni Somaru Saka follows a plot line which offers pre-determined scenarios with courses of interaction, and focuses on the appeal of the six female main characters. Two light novels were produced in December 2007 and February 2008 written by different authors, and an Internet radio show began in April 2008. A manga adaptation began serialization in Kadokawa Shoten's seinen magazine Comp Ace on June 26, 2008 illustrated by Homare Sakazuki. An anime adaptation produced by TNK and directed by Keitaro Motonaga aired in Japan between October and December 2008.", "rate": 0, "genre": ["Drama", "Animation", "Comedy"], "cast": ["Rie Kugimiya", "Aya Hirano", "Marina Inoue", "Rie Tanaka", "Hatano Wataru"], "character": ["Yuuhi Katagiri", "Minato Nagase", "Tsukasa Kiryu", "Mitsuki Siina", "Jun'ichi Nagase"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37100   Expand Akane-iro ni Somaru Saka   (2008) User Score Overview Akaneiro ni Somaru Saka, also known in short as Akasaka, is a Japanese adult visual novel developed by Feng and first released for the PC as a DVD on July 27, 2007. A version without adult content was released under the title Akaneiro ni Somaru Saka: Parallel on July 31, 2008 by GN Software for the PlayStation 2. A port of this version of the game was released for the PlayStation Portable on December 17, 2009 under the title Akaneiro ni Somaru Saka: Portable. The gameplay in Akaneiro ni Somaru Saka follows a plot line which offers pre-determined scenarios with courses of interaction, and focuses on the appeal of the six female main characters. Two light novels were produced in December 2007 and February 2008 written by different authors, and an Internet radio show began in April 2008. A manga adaptation began serialization in Kadokawa Shoten's seinen magazine Comp Ace on June 26, 2008 illustrated by Homare Sakazuki. An anime adaptation produced by TNK and directed by Keitaro Motonaga aired in Japan between October and December 2008. Featured Crew Makoto Uezu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Kugimiya Yuuhi Katagiri Aya Hirano Minato Nagase Marina Inoue Tsukasa Kiryu Rie Tanaka Mitsuki Siina Hatano Wataru Jun'ichi Nagase Full Cast & Crew Last Season Akane-iro ni somaru saka season 1 2008 | 12 Episodes Season 1 of Akane-iro ni Somaru Saka premiered on October  2, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Akane-iro ni Somaru Saka. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Drama Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors n 11 nakamas C 4 Carlosmls 4 yoshizuka 4 Oriknox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}