{"link": "https://www.themoviedb.org/tv/3570?language=en", "title": "Sailor Moon", "resume": "One day, Usagi Tsukino, clumsy 2nd-year middle school student (8th grader), stumbles upon a talking cat named Luna. Luna tells her that she is destined to be Sailor Moon, \"champion of love and justice\", and she must search for the fabled Moon Princess. Usagi finds friends that turn out to be destined senshi as well, and together they fight to save the world from the certain doom brought upon by the Dark Kingdom (Queen Beryl, the generals, Metallia).", "rate": 69, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kotono Mitsuishi", "Aya Hisakawa", "Michie Tomizawa", "Emi Shinohara", "Rica Fukami"], "character": ["Usagi Tsukino/Sailor Moon (voice)", "Ami Mizuno/Sailor Mercury (voice)", "Rei Hino/Sailor Mars (voice)", "Makoto Kino/Sailor Jupiter (voice)", "Minako Aino/Sailor Venus (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3570   Expand Sailor Moon   (1992) User Score Overview One day, Usagi Tsukino, clumsy 2nd-year middle school student (8th grader), stumbles upon a talking cat named Luna. Luna tells her that she is destined to be Sailor Moon, \"champion of love and justice\", and she must search for the fabled Moon Princess. Usagi finds friends that turn out to be destined senshi as well, and together they fight to save the world from the certain doom brought upon by the Dark Kingdom (Queen Beryl, the generals, Metallia). Featured Crew Naoko Takeuchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  7 Images Backdrops  10 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kotono Mitsuishi Usagi Tsukino/Sailor Moon (voice) Aya Hisakawa Ami Mizuno/Sailor Mercury (voice) Michie Tomizawa Rei Hino/Sailor Mars (voice) Emi Shinohara Makoto Kino/Sailor Jupiter (voice) Rica Fukami Minako Aino/Sailor Venus (voice) Full Cast & Crew Last Season Season 5 1996 | 34 Episodes Season 5 of Sailor Moon premiered on March  9, 1996. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply There are no discussions for Sailor Moon. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  6 Recommendations   2002-03-01 Digimon Tamers 5.9    Digimon Adventure 02 5.6    Digimon Frontier 6.3    2004-07-10 DearS 5.0    1988-09-17 Garfield and Friends 6.6    1969-11-10 Sesame Street 7.4    2001-08-11 Cubix 4.3    2006-09-08 Black Blood Brothers 7.4  Facts Original Name  美少女戦士セーラームーン Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  20m, 22m Homepage  - Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords based on manga anime sailor moon nakayoshi Content Score 93 Almost there... Top Contributors d 61 desert188 47 sp1ti 21 Elizabeth Jennings L 14 Leah  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}