{"link": "https://www.themoviedb.org/tv/10498?language=en", "title": "High Incident", "resume": "High Incident is a police drama series produced by DreamWorks Television for the ABC network. The show was created by Steven Spielberg, Michael Pavone, Eric Bogosian and Dave Alan Johnson. It first aired on March 4, 1996, running a total of 32 episodes.", "rate": 70, "genre": ["Drama"], "cast": ["Lisa Vidal", "Blair Underwood", "David Keith", "Louis Mustillo", "Matt Craven"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10498   Expand High Incident   (1996) User Score Overview High Incident is a police drama series produced by DreamWorks Television for the ABC network. The show was created by Steven Spielberg, Michael Pavone, Eric Bogosian and Dave Alan Johnson. It first aired on March 4, 1996, running a total of 32 episodes. Featured Crew Steven Spielberg Creator Eric Bogosian Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Vidal Blair Underwood David Keith Louis Mustillo Matt Craven Full Cast & Crew Last Season Season 2 1996 | 22 Episodes Season 2 of High Incident premiered on September 17, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on High Incident. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors T 3 Torq00 t 2 teddymeksavanh n 1 nixskits  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}