{"link": "https://www.themoviedb.org/tv/750?language=en", "title": "Where the Heart Is", "resume": "Where the Heart Is is a British television family drama series set in the fictional Yorkshire town of Skelthwaite. First shown in 1997, it was created by Ashley Pharoah and Vicky Featherstone, and focuses on the professional and personal lives of the district nurses who work in the town. The original leads were Sarah Lancashire and Pam Ferris, who played sisters-in-law and colleagues at the Skelthwaite Health Centre. Both actresses had left the series by 2000; however, the format of at least two female leads continued with various different actresses until the show's end. A typical episode would focus on one or two medical storylines interweaved with personal stories featuring one or both nurses.\nOne of ITV's longest-running shows, Where the Heart Is was known for being what has been described as a haven for former soap stars, including Lancashire, Philip Middlemiss, Samantha Giles, Kerrie Taylor, Brian Capron and Shobna Gulati. In October 2006, the series was cancelled after nine years, despite viewing figures of well over 7 million.\nThe theme song \"Where the Heart is\" was performed by Prefab Sprout. It was released as a single and appears on the band's 38 Carat Collection.", "rate": 0, "genre": ["Drama"], "cast": ["Marsha Thomason", "Sarah Lancashire", "Tony Haygarth", "Adam Paul Harvey", "Alex Carter"], "character": ["Jacqui Richards", "Ruth Goddard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 750   Expand Where the Heart Is   (1997) User Score Overview Where the Heart Is is a British television family drama series set in the fictional Yorkshire town of Skelthwaite. First shown in 1997, it was created by Ashley Pharoah and Vicky Featherstone, and focuses on the professional and personal lives of the district nurses who work in the town. The original leads were Sarah Lancashire and Pam Ferris, who played sisters-in-law and colleagues at the Skelthwaite Health Centre. Both actresses had left the series by 2000; however, the format of at least two female leads continued with various different actresses until the show's end. A typical episode would focus on one or two medical storylines interweaved with personal stories featuring one or both nurses. One of ITV's longest-running shows, Where the Heart Is was known for being what has been described as a haven for former soap stars, including Lancashire, Philip Middlemiss, Samantha Giles, Kerrie Taylor, Brian Capron and Shobna Gulati. In October 2006, the series was cancelled after nine years, despite viewing figures of well over 7 million. The theme song \"Where the Heart is\" was performed by Prefab Sprout. It was released as a single and appears on the band's 38 Carat Collection. Featured Crew Ashley Pharoah Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marsha Thomason Jacqui Richards Sarah Lancashire Ruth Goddard Tony Haygarth Adam Paul Harvey Alex Carter Full Cast & Crew Last Season Season 5 2001 | 16 Episodes Season 5 of Where the Heart Is premiered on April 22, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Where the Heart Is. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords nurse yorkshire rural setting district nurse Content Score 79 Pump it up! We're close now. Top Contributors 5 rudely_murray m 3 msolap 2 kcdh TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}