{"link": "https://www.themoviedb.org/tv/556?language=en", "title": "Good Morning America", "resume": "Good Morning America is an American morning television show on the ABC television network. It debuted on November 3, 1975, and first expanded to weekends with the debut of a Sunday edition on January 3, 1993, the Sunday edition was later cancelled in 1999 with weekend editions returning on both Saturdays and Sundays on September 4, 2004. The weekday program airs from 7 to 9 a.m. in all U.S. time zones; the weekend edition is one hour long. A third hour of the weekday broadcast aired from 2007 to 2008, exclusively on ABC News Now.\nThe program features news, interviews, weather foreasts, special-interest stories, and feature segments such as \"Pop News\" and \"Play of the Day\". It is produced by ABC News and broadcasts from the Times Square Studios in New York City's Times Square district. The current primary anchors are Robin Roberts and George Stephanopoulos, along with newsreader Josh Elliott, weather anchor Sam Champion and lifestyle anchor Lara Spencer.\nGood Morning America has generally run second in the ratings to NBC's Today since 1995. It overtook its rival for a period from the early to mid-1980s with anchors David Hartman and Joan Lunden, from the late 1980s to the mid-1990s with Charles Gibson and Lunden, and in April 2012 with Roberts and Stephanopoulos. The program has recently started to dominate over its competitors and in August 2013, it celebrated 52 consecutive weeks as the top-rated network morning news program.", "rate": 59, "genre": ["News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 556   Expand Good Morning America   (1975) User Score Overview Good Morning America is an American morning television show on the ABC television network. It debuted on November 3, 1975, and first expanded to weekends with the debut of a Sunday edition on January 3, 1993, the Sunday edition was later cancelled in 1999 with weekend editions returning on both Saturdays and Sundays on September 4, 2004. The weekday program airs from 7 to 9 a.m. in all U.S. time zones; the weekend edition is one hour long. A third hour of the weekday broadcast aired from 2007 to 2008, exclusively on ABC News Now. The program features news, interviews, weather foreasts, special-interest stories, and feature segments such as \"Pop News\" and \"Play of the Day\". It is produced by ABC News and broadcasts from the Times Square Studios in New York City's Times Square district. The current primary anchors are Robin Roberts and George Stephanopoulos, along with newsreader Josh Elliott, weather anchor Sam Champion and lifestyle anchor Lara Spencer. Good Morning America has generally run second in the ratings to NBC's Today since 1995. It overtook its rival for a period from the early to mid-1980s with anchors David Hartman and Joan Lunden, from the late 1980s to the mid-1990s with Charles Gibson and Lunden, and in April 2012 with Roberts and Stephanopoulos. The program has recently started to dominate over its competitors and in August 2013, it celebrated 52 consecutive weeks as the top-rated network morning news program. Featured Crew William F. Baker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1975 | 3 Episodes Season 1 of Good Morning America premiered on January  6, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1959-10-02 The Twilight Zone 8.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage   http://abcnews.go.com/GMA/ Genres News Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 3 SWFT 1 Mikedeth5 PS 1 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}