{"link": "https://www.themoviedb.org/tv/62447?language=en", "title": "Divorce Lawyer in Love", "resume": "Ko Cheok-Hee (Cho Yeo-Jeong) worked as a lawyer and she would do anything to win her case. So Jung-Woo was her office manager. He pointed out any mistake made by Ko Cheok-Hee which irked her. Their relationship was rocky at best.\nNow, they meet again at a law firm, but So Jung-Woo works as a lawyer and Ko Cheok-Hee is the officer manager.", "rate": 70, "genre": ["Comedy", "Romance"], "cast": ["Jo Yeo-jeong", "Yeon Woo-jin", "Shim Hyung-tak", "Wang Ji-won", "Lee Yeol-eum"], "character": ["Go Cheok-hee", "So Jung-woo", "Bong Min-gyu", "Jo Soo-ah", "Woo Yoo-mi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62447   Expand Divorce Lawyer in Love   (2015) User Score Overview Ko Cheok-Hee (Cho Yeo-Jeong) worked as a lawyer and she would do anything to win her case. So Jung-Woo was her office manager. He pointed out any mistake made by Ko Cheok-Hee which irked her. Their relationship was rocky at best. Now, they meet again at a law firm, but So Jung-Woo works as a lawyer and Ko Cheok-Hee is the officer manager. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jo Yeo-jeong Go Cheok-hee Yeon Woo-jin So Jung-woo Shim Hyung-tak Bong Min-gyu Wang Ji-won Jo Soo-ah Lee Yeol-eum Woo Yoo-mi Full Cast & Crew Last Season Season 1 2015 | 18 Episodes Season 1 of Divorce Lawyer in Love premiered on April 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Divorce Lawyer in Love. You can help by rating TV shows you've seen. Facts Original Name  이혼변호사는 연애중 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://tv.sbs.co.kr/divorcelawyer/ Genres Comedy Romance Keywords korea Content Score 86 Almost there... Top Contributors M 47 Maria180493 z 5 zurman1 3 lareina123 2 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}