{"link": "https://www.themoviedb.org/tv/37618?language=en", "title": "Bedlam", "resume": "Bedlam was a British supernatural drama television series created by David Allison, Neil Jones and Chris Parker. It first aired on 7 February 2011 on Sky Living and Sky Living HD. The series finale was aired on 15 March 2011. In December 2011, it was announced that a second series had been commissioned for airing in Spring 2012 with an updated cast. Series 2 began airing in June 2012 with Lacey Turner taking the lead as a suspended paramedic who can see dead people.\nOn 13 November 2012 Jack Roth who plays Max in the series revealed that Bedlam may return for Series 3 and that a decision on the shows future is to be made around Christmas 2012. On 11 March 2013 Roth announced on Twitter that Bedlam would not be returning for a third series.", "rate": 58, "genre": ["Drama", "Mystery"], "cast": ["Lacey Turner", "Gemma Chan", "Jack Roth", "Nikesh Patel", "Hugo Speer"], "character": ["Ellie Flint", "Keira", "Max", "Dan", "Warren Bettany"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37618   Expand Bedlam   (2011) User Score  Play Trailer Overview Bedlam was a British supernatural drama television series created by David Allison, Neil Jones and Chris Parker. It first aired on 7 February 2011 on Sky Living and Sky Living HD. The series finale was aired on 15 March 2011. In December 2011, it was announced that a second series had been commissioned for airing in Spring 2012 with an updated cast. Series 2 began airing in June 2012 with Lacey Turner taking the lead as a suspended paramedic who can see dead people. On 13 November 2012 Jack Roth who plays Max in the series revealed that Bedlam may return for Series 3 and that a decision on the shows future is to be made around Christmas 2012. On 11 March 2013 Roth announced on Twitter that Bedlam would not be returning for a third series. Featured Crew Chris Parker Creator David Allison Creator Neil Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lacey Turner Ellie Flint Gemma Chan Keira Jack Roth Max Nikesh Patel Dan Hugo Speer Warren Bettany Full Cast & Crew Last Season Season 2 2012 | 6 Episodes Season 2 of Bedlam premiered on June  6, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2013-03-03 Mayday 6.7    2015-10-28 Cuffs 6.6  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Italian Runtime  60m Homepage   http://www.skyliving.sky.com/top-shows/bedlam Genres Drama Mystery Keywords medium haunted house neighbor apartment building ghost former asylum Content Score 100 Yes! Looking good! Top Contributors 25 Banana 11 Elizabeth Jennings m 7 monkeeeboy CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}