{"link": "https://www.themoviedb.org/tv/2571?language=en", "title": "Cutting It", "resume": "Allie Henshall and Gavin Ferraday are partners in love and business. They own Henshall Ferraday hair salon, where Allie's sisters Darcey and Sydney work alongside them. As Allie and Gavin consider taking over a vacant property across the road, they are rocked by the news that a rival hairdresser has bought it. To make matters worse, Allie discovers that the new salon, Blade Runner, is run by her ex, Finn, and his wife, Mia Bevan. Finn fathered the child Allie claimed to have aborted. He left her when he found out she was pregnant, but he's back in town to try and woo Allie.", "rate": 65, "genre": ["Drama"], "cast": ["Amanda Holden", "Sarah Parish", "Sian Reeves", "Angela Griffin", "Ben Daniels"], "character": ["Mia Bevan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2571   Expand Cutting It   (2002) User Score Overview Allie Henshall and Gavin Ferraday are partners in love and business. They own Henshall Ferraday hair salon, where Allie's sisters Darcey and Sydney work alongside them. As Allie and Gavin consider taking over a vacant property across the road, they are rocked by the news that a rival hairdresser has bought it. To make matters worse, Allie discovers that the new salon, Blade Runner, is run by her ex, Finn, and his wife, Mia Bevan. Finn fathered the child Allie claimed to have aborted. He left her when he found out she was pregnant, but he's back in town to try and woo Allie. Featured Crew Debbie Horsfield Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Holden Mia Bevan Sarah Parish Sian Reeves Angela Griffin Ben Daniels Full Cast & Crew Last Season Season 4 2005 | 6 Episodes Season 4 of Cutting It premiered on June  7, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cutting It. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords northern england hairdresser business salon Content Score 93 Almost there... Top Contributors O 4 Ozbourne R 3 Rebecca 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}