{"link": "https://www.themoviedb.org/tv/61709?language=en", "title": "Dragon Ball Z Kai", "resume": "Rejoin Goku and his friends in a series of cosmic battles! Toei has redubbed, recut, and cleaned up the animation of the original 1989 animated series. The show's story arc has been refined to better follow the comic book series on which it is based. The show also features a new opening and ending. In the series, martial artist Goku, and his various friends, battle increasingly powerful enemies to defend the world against evil. Can Earth's defender defeat demons, aliens, and other villains?", "rate": 53, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure", "Comedy"], "cast": ["Masako Nozawa", "Jōji Yanami", "Mayumi Tanaka", "Ryou Horikawa", "Toshio Furukawa"], "character": ["Goku (voice)", "Narrator (voice)", "Krillin (voice)", "Vegeta (voice)", "Piccolo (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61709   Expand Dragon Ball Z Kai   (2009) User Score Overview Rejoin Goku and his friends in a series of cosmic battles! Toei has redubbed, recut, and cleaned up the animation of the original 1989 animated series. The show's story arc has been refined to better follow the comic book series on which it is based. The show also features a new opening and ending. In the series, martial artist Goku, and his various friends, battle increasingly powerful enemies to defend the world against evil. Can Earth's defender defeat demons, aliens, and other villains? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  126 Images Backdrops  12 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masako Nozawa Goku (voice) Jōji Yanami Narrator (voice) Mayumi Tanaka Krillin (voice) Ryou Horikawa Vegeta (voice) Toshio Furukawa Piccolo (voice) Full Cast & Crew Last Season Season 6 2014 | 26 Episodes Season 6 of Dragon Ball Z Kai premiered on December 13, 2014. View All Seasons Social Reviews  0 Discussions  126 Subject Status Replies Last Reply There are no discussions for Dragon Ball Z Kai. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  12 Posters  3 Recommendations   1986-02-26 Dragon Ball 8.1    1996-02-07 Dragon Ball GT 5.7    1989-04-26 Dragon Ball Z 8.1    2004-07-01 The Soup 4.9    2004-11-19 Hi Hi Puffy AmiYumi 4.0    2004-10-05 Bleach 7.5    2015-07-05 Dragon Ball Super 6.9    2007-09-08 iCarly 6.3  Facts Original Name  ドラゴンボール改「カイ」 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  26m Homepage   http://www.dragonballz.com Genres Sci-Fi & Fantasy Animation Action & Adventure Comedy Keywords martial arts japan super power anime Content Score 93 Almost there... Top Contributors 88 SWFT 31 Banana j 23 josetto 19 BudsieBuds  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}