{"link": "https://www.themoviedb.org/tv/3043?language=en", "title": "12 oz. Mouse", "resume": "12 oz. Mouse revolves around Mouse Fitzgerald, nicknamed \"Fitz\", an alcoholic mouse who performs odd jobs so he can buy more beer. Together with his chinchilla companion Skillet, Fitz begins to recover suppressed memories that he once had a wife and a child who have now vanished. This leads him to seek answers about his past and the shadowy forces that seem to be manipulating his world.", "rate": 68, "genre": ["Animation", "Comedy", "Mystery"], "cast": ["Dave Willis", "Adam Reed", "Matt Thompson", "Matt Maiellaro"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3043   Expand 12 oz. Mouse   (2005) User Score Overview 12 oz. Mouse revolves around Mouse Fitzgerald, nicknamed \"Fitz\", an alcoholic mouse who performs odd jobs so he can buy more beer. Together with his chinchilla companion Skillet, Fitz begins to recover suppressed memories that he once had a wife and a child who have now vanished. This leads him to seek answers about his past and the shadowy forces that seem to be manipulating his world. Featured Crew Matt Maiellaro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Willis Adam Reed Matt Thompson Matt Maiellaro Full Cast & Crew Last Season Season 2 2006 | 13 Episodes Season 2 of 12 oz. Mouse premiered on September 24, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for 12 oz. Mouse. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1998-08-19 Upright Citizens Brigade 8.0    2005-10-30 Lucy, the Daughter of the Devil 7.0    2004-08-01 Stroker and Hoop 7.0    1997-07-15 I Am Weasel 7.4    2006-03-02 Charlie Brooker's Screenwipe 9.2    2005-06-29 Stella 7.0    2006-10-16 Frisky Dingo 8.1    2000-12-21 Sealab 2021 7.8  Facts Status  Ended Network Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  English Runtime  15m Homepage   http://www.adultswim.com/shows/12-oz-mouse/index.html Genres Animation Comedy Mystery Keywords bizarre Content Score 93 Almost there... Top Contributors 12 Ailurus Fulgens m 3 morrison A 2 AnthonyAtkins232 1 erikraul31  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}