{"link": "https://www.themoviedb.org/tv/41302?language=en", "title": "JoNaLu", "resume": "JoNaLu is a German animated television series for young children. The main characters are a male mouse called Jojo, a female mouse called Naya and a ladybug called Ludwig.", "rate": 88, "genre": ["Animation", "Kids"], "cast": ["Cedric Eich", "Marie-Madeleine Ipoumb", "Ilona Schulz"], "character": ["Jo", "Naya", "Lu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41302   Expand JoNaLu   (2010) User Score Overview JoNaLu is a German animated television series for young children. The main characters are a male mouse called Jojo, a female mouse called Naya and a ladybug called Ludwig. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cedric Eich Jo Marie-Madeleine Ipoumb Naya Ilona Schulz Lu Full Cast & Crew Last Season Season 2 2016 | 13 Episodes Season 2 of JoNaLu premiered on February 22, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for JoNaLu. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on JoNaLu. You can help by rating TV shows you've seen. Facts Status  Planned Network Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  German Runtime  35m Homepage   http://www.kika.de/index.html Genres Animation Kids Keywords dancing music children singing drawing cartoon mouse Content Score 56 We're so close, yet so far. Top Contributors 34 lovebootcaptain 8 lineker 5 Banana 3 Adame  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}