{"link": "https://www.themoviedb.org/tv/50214?language=en", "title": "In the Building", "resume": "La Bloc este un serial TV de comedie românesc regizat în 2002, produs de Media Pro Pictures și difuzat de ProTV. Filmul este inspirat din umorul românesc, de „scara blocului”. Regizat și scenariu de Răzvan Andrei, Radu Dragomir, Dradoș Moștenescu. Are 524 de episoade și a durat a șase ani.\nCifrele serialului: 2.620 de ore de filmare, 13 sezoane, 524 episoade, 270 de ore de emisie, 6 ani și jumătate, 1 copil născut în direct.\nProducătorul este Andrei Borcea, care a mai realizat și La Servici, Fete cu lipici și noul serial Meseriașii.", "rate": 25, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50214   Expand In the Building   (2002) User Score Overview La Bloc este un serial TV de comedie românesc regizat în 2002, produs de Media Pro Pictures și difuzat de ProTV. Filmul este inspirat din umorul românesc, de „scara blocului”. Regizat și scenariu de Răzvan Andrei, Radu Dragomir, Dradoș Moștenescu. Are 524 de episoade și a durat a șase ani. Cifrele serialului: 2.620 de ore de filmare, 13 sezoane, 524 episoade, 270 de ore de emisie, 6 ani și jumătate, 1 copil născut în direct. Producătorul este Andrei Borcea, care a mai realizat și La Servici, Fete cu lipici și noul serial Meseriașii. Featured Crew Dragoș Moștenescu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2004 | 1 Episode Season 3 of In the Building premiered on March  8, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on In the Building. You can help by rating TV shows you've seen. Facts Original Name  La Bloc Status  Ended Network Certification  - Type  Scripted Original Language  Romanian Runtime  30m Homepage   http://www.labloc.ro/ Genres Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors SM 69 Surry Mether 3 Banana 1 petronelcl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}