{"link": "https://www.themoviedb.org/tv/65355?language=en", "title": "Splash Splash Love", "resume": "Dan-Bi (Kim Seul-Gi) is a senior high school student. She has a special ability which allows her to transport to anywhere on rainy days. For her university entrance exam, Dan-Bi can't deal with the pressure and runs off to a playground. Without knowing why, she goes into a puddle and finds herself transported to the Joseon period. There, she meets Lee Do (Yoon Doo-Joon). He is a young King of the Joseon period. Lee Do is in a difficult situation due to droughts and the spread of an epidemic.", "rate": 90, "genre": ["Fantasy", "Romance"], "cast": ["Kim Seul-Gi", "Yoon Doo-Joon", "Jin Ki-joo", "Ahn Hyo-Seop"], "character": ["Jang Dan-bi / Go Sam", "King Yi Do", "Queen Sohun", "Che Ah-jik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65355   Expand Splash Splash Love   (2015) User Score Overview Dan-Bi (Kim Seul-Gi) is a senior high school student. She has a special ability which allows her to transport to anywhere on rainy days. For her university entrance exam, Dan-Bi can't deal with the pressure and runs off to a playground. Without knowing why, she goes into a puddle and finds herself transported to the Joseon period. There, she meets Lee Do (Yoon Doo-Joon). He is a young King of the Joseon period. Lee Do is in a difficult situation due to droughts and the spread of an epidemic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Seul-Gi Jang Dan-bi / Go Sam Yoon Doo-Joon King Yi Do Jin Ki-joo Queen Sohun Ahn Hyo-Seop Che Ah-jik Full Cast & Crew Last Season Season 1 2015 | 2 Episodes Season 1 of Splash Splash Love premiered on December 13, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Splash Splash Love. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Splash Splash Love. You can help by rating TV shows you've seen. Facts Original Name  퐁당퐁당 Love Status  Ended Networks Certification  - Type  Miniseries Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/pdpd/ Genres Fantasy Romance Keywords korea high school student Content Score 86 Almost there... Top Contributors M 26 Maria180493 6 Charles TB 6 TMDb Bot 4 maik72  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}