{"link": "https://www.themoviedb.org/tv/38861?language=en", "title": "49 Days", "resume": "Shin Ji Hyun was enjoying absolute bliss as she was about to marry her fiancé, Kang Min Ho, but her perfect life is shattered when she gets into a car accident that leaves her in a coma. She is given a second chance at life by a reaper, but it comes with a condition: she has to find three people outside of her family who would cry genuine tears for her. In order to do this, she borrows the body of Yi Kyung, a part-time employee at a convenience store for 49 days.\n49 Days is a 2011 South Korean television drama series, starring Lee Yo-won, Jo Hyun-jae, Jung Il-woo, Bae Soo-bin, Nam Gyu-ri and Seo Ji-hye. It aired on SBS from March 16 to May 19, 2011 on Wednesdays and Thursdays at 21:55 for 20 episodes.", "rate": 89, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Seo Ji-hye", "Jo Hyun-jae", "Bae Soo-bin", "Lee Yo-won", "Nam Gyu-ri"], "character": ["Shin In-jung", "Han Kang", "Kang Min-ho", "Song Yi-kyung", "Shin Ji-hyun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38861   Expand 49 Days   (2011) User Score Overview Shin Ji Hyun was enjoying absolute bliss as she was about to marry her fiancé, Kang Min Ho, but her perfect life is shattered when she gets into a car accident that leaves her in a coma. She is given a second chance at life by a reaper, but it comes with a condition: she has to find three people outside of her family who would cry genuine tears for her. In order to do this, she borrows the body of Yi Kyung, a part-time employee at a convenience store for 49 days. 49 Days is a 2011 South Korean television drama series, starring Lee Yo-won, Jo Hyun-jae, Jung Il-woo, Bae Soo-bin, Nam Gyu-ri and Seo Ji-hye. It aired on SBS from March 16 to May 19, 2011 on Wednesdays and Thursdays at 21:55 for 20 episodes. Featured Crew Jo Young-Gwan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo Ji-hye Shin In-jung Jo Hyun-jae Han Kang Bae Soo-bin Kang Min-ho Lee Yo-won Song Yi-kyung Nam Gyu-ri Shin Ji-hyun Full Cast & Crew Last Season Season 1 2011 | 20 Episodes Season 1 of 49 Days premiered on March 16, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2014-06-25 The Joseon Gunman 6.3    2014-05-05 Doctor Stranger 7.3    2011-06-29 Heartstrings 7.0    2015-12-09 Remember 7.9    2013-12-09 The Prime Minister and I 7.1    2015-01-07 Kill Me, Heal Me 8.7    2009-10-07 You're Beautiful 7.9    2011-05-25 City Hunter 7.5  Facts Original Name  49일 Status  Ended Network Certification  - Type  Scripted Original Language  Thai Runtime  1200m Homepage   http://www.tv.sbs.co.kr/49/ Genres Drama Sci-Fi & Fantasy Keywords korea Content Score 93 Almost there... Top Contributors N 23 Nightowl.Kr t 11 tmdb38202327 7 seksonh M 7 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}