{"link": "https://www.themoviedb.org/tv/67719?language=en", "title": "Crunch Time", "resume": "Crunch Time begins when four grad students accidentally open up a black hole that could be the end of the world. After recklessly handling cutting-edge tech in their school lab, this brilliant team of jackasses creates a small, but potentially earth shattering, black hole that grabs the attention of government operatives. Since the “wanna-be” scientists can’t pinpoint exactly where their experiment went wrong, they must work with the secret government agency sent in to save the day by detailing EVERY illegal thing they’ve done in the lab thus far.", "rate": 60, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Avery Monsen", "Jessy Hodges", "Nick Rutherford", "Samm Levine", "Kirk C. Johnson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67719   Expand Crunch Time   (2016) User Score Overview Crunch Time begins when four grad students accidentally open up a black hole that could be the end of the world. After recklessly handling cutting-edge tech in their school lab, this brilliant team of jackasses creates a small, but potentially earth shattering, black hole that grabs the attention of government operatives. Since the “wanna-be” scientists can’t pinpoint exactly where their experiment went wrong, they must work with the secret government agency sent in to save the day by detailing EVERY illegal thing they’ve done in the lab thus far. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Avery Monsen Jessy Hodges Nick Rutherford Samm Levine Kirk C. Johnson Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Crunch Time premiered on September 11, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Who was the guy who joined the party? (spoilers) Open 0 by Daddie0\n      \n     This Show is Great but You Should Not Watch It Open 1 by  Daddie0 Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crunch Time. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://roosterteeth.com/show/crunch-time Genres Sci-Fi & Fantasy Comedy Keywords black hole Content Score 86 Almost there... Top Contributors t 28 tmdb48730457 6 Elizabeth Jennings z 3 zyck f 3 flashcg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}