{"link": "https://www.themoviedb.org/tv/76135?language=en", "title": "The Nemanjic Family - The Reign of the Kingdom", "resume": "Story about one of the most influential Serbian dynasties of the middle ages.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Milos Djurovic", "Meto Jovanovski", "Vučić Perović", "Novak Bilbija", "Zafir Hadžimanov"], "character": ["Stefan Nemanjic", "Manuel I Komnenos", "Bogdan", "Friedrich Barbarossa", "Theodore I Laskaris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76135   Expand The Nemanjic Family - The Reign of the Kingdom   (2018) User Score Overview Story about one of the most influential Serbian dynasties of the middle ages. Featured Crew Marko Marinković Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Milos Djurovic Stefan Nemanjic Meto Jovanovski Manuel I Komnenos Vučić Perović Bogdan Novak Bilbija Friedrich Barbarossa Zafir Hadžimanov Theodore I Laskaris Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of The Nemanjic Family - The Reign of the Kingdom premiered on February 17, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Nemanjic Family - The Reign of the Kingdom. You can help by rating TV shows you've seen. Facts Original Name  Nemanjići - rađanje kraljevine Status  Returning Series Network Certification  - Type  Scripted Original Language  Serbian Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords dynasty serbia medieval Content Score 100 Yes! Looking good! Top Contributors b 51 birdreina M 10 Mario_Gaborović 7 Elizabeth Jennings TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}