{"link": "https://www.themoviedb.org/tv/18660?language=en", "title": "Miami Medical", "resume": "Miami Medical is a medical drama television series created by Jeffrey Lieber. It follows the professional and private lives of a team of trauma surgeons.\nThe series was produced by Jerry Bruckheimer Television and Warner Bros. Television. It premiered on CBS on April 2, 2010. In May 2010, CBS announced that the series had been canceled, with the final episode airing on July 2, 2010.", "rate": 77, "genre": ["Drama"], "cast": ["Omar Gooding", "Jeremy Northam", "Lana Parrilla", "Elisabeth Harnois", "Mike Vogel"], "character": ["Tuck Brody", "Matthew Proctor", "Eva Zambrano", "Serena Warren", "Chris Deleo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18660   Expand Miami Medical   (2010) User Score Overview Miami Medical is a medical drama television series created by Jeffrey Lieber. It follows the professional and private lives of a team of trauma surgeons. The series was produced by Jerry Bruckheimer Television and Warner Bros. Television. It premiered on CBS on April 2, 2010. In May 2010, CBS announced that the series had been canceled, with the final episode airing on July 2, 2010. Featured Crew Jeffrey Lieber Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Omar Gooding Tuck Brody Jeremy Northam Matthew Proctor Lana Parrilla Eva Zambrano Elisabeth Harnois Serena Warren Mike Vogel Chris Deleo Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of Miami Medical premiered on April  2, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2011-04-17 Game of Thrones 8.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Drama Keywords miami surgeon doctor medical drama Content Score 93 Almost there... Top Contributors 14 Banana R 6 Rebecca E 3 Eric s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}