{"link": "https://www.themoviedb.org/tv/385?language=en", "title": "Maury", "resume": "Maury is a syndicated American tabloid talk show hosted by Maury Povich.\nWhen the series first aired in 1991, the show was called The Maury Povich Show and was produced by MoPo Productions in association with Paramount Domestic Television. The show adopted the title Maury in the 1995–1996 season. The show was then revamped in the 1998–1999 season, when Studios USA took over production. However, MoPo continues to co-produce with NBCUniversal. For the series' first 18 seasons, it was taped in New York City, but beginning with Season 19, the show has been taped in the Stamford Media Center in Stamford, Connecticut. Maury is one of four NBC Universal syndicated properties to make the move to Connecticut, joining the former Chicago-based Jerry Springer and Steve Wilkos shows. The fourth, the syndicated Deal or No Deal, is no longer in production. The Trisha Goddard Show became the fourth show in production with NBC Universal. The TV rating on Maury is rated TV-PG and TV-14 on the syndicated stations of the United States, based on each episode's content.\nOn September 17, 2012, during the premiere of its 22nd season, episodes of Maury began airing in widescreen. However, like its sister shows, it is still broadcasting 480i standard definition. On March 26, 2013, Maury was renewed for an additional three years until 2016.", "rate": 43, "genre": [], "cast": ["Lawrence Leritz", "Maury Povich", "Thea Vidale"], "character": ["Guest appearance"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 385   Expand Maury   (1991) User Score Overview Maury is a syndicated American tabloid talk show hosted by Maury Povich. When the series first aired in 1991, the show was called The Maury Povich Show and was produced by MoPo Productions in association with Paramount Domestic Television. The show adopted the title Maury in the 1995–1996 season. The show was then revamped in the 1998–1999 season, when Studios USA took over production. However, MoPo continues to co-produce with NBCUniversal. For the series' first 18 seasons, it was taped in New York City, but beginning with Season 19, the show has been taped in the Stamford Media Center in Stamford, Connecticut. Maury is one of four NBC Universal syndicated properties to make the move to Connecticut, joining the former Chicago-based Jerry Springer and Steve Wilkos shows. The fourth, the syndicated Deal or No Deal, is no longer in production. The Trisha Goddard Show became the fourth show in production with NBC Universal. The TV rating on Maury is rated TV-PG and TV-14 on the syndicated stations of the United States, based on each episode's content. On September 17, 2012, during the premiere of its 22nd season, episodes of Maury began airing in widescreen. However, like its sister shows, it is still broadcasting 480i standard definition. On March 26, 2013, Maury was renewed for an additional three years until 2016. Featured Crew Maury Povich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lawrence Leritz Guest appearance Maury Povich Thea Vidale Full Cast & Crew Last Season Season 14 2011 | 158 Episodes Season 14 of Maury premiered on September 19, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1978-06-02 20/20 7.0    1965-09-16 The Dean Martin Show 4.2    1979-02-11 60 Minutes 7.4    2005-08-07 The Girls Next Door 6.1    1992-05-21 The Real World 4.8    1958-09-06 Wanted: Dead or Alive 7.6    2004-01-08 The Celebrity Apprentice 4.2    1988-01-19 48 Hours 7.3  Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.mauryshow.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors TB 4 TMDb Bot 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}