{"link": "https://www.themoviedb.org/tv/3234?language=en", "title": "Whoops Apocalypse", "resume": "Whoops Apocalypse is a six-part 1982 British sitcom by Andrew Marshall and David Renwick, made by London Weekend Television for ITV. Marshall and Renwick later reworked the concept as a 1986 film of the same name from ITC Entertainment, with almost completely different characters and plot, although one or two of the original actors returned in different roles.\nThe series has a big cult audience, and copies of videos are heavily sought after. The British budget label Channel 5 Video released a compilation cassette of all six episodes edited together into one 137-minute chunk in 1987.\nIn 2010 Network DVD released both the complete, unedited series and the movie on a 2-DVD set entitled Whoops Apocalypse: The Complete Apocalypse..\nJohn Otway also recorded a song called \"Whoops Apocalypse\", which was used as the theme song for the film. He occasionally performs it live.", "rate": 70, "genre": ["Comedy"], "cast": ["Barry Morse", "John Barron", "Ed Bishop", "Alexei Sayle", "Rik Mayall"], "character": ["Commissar Solzhenitsyn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3234   Expand Whoops Apocalypse   (1982) User Score Overview Whoops Apocalypse is a six-part 1982 British sitcom by Andrew Marshall and David Renwick, made by London Weekend Television for ITV. Marshall and Renwick later reworked the concept as a 1986 film of the same name from ITC Entertainment, with almost completely different characters and plot, although one or two of the original actors returned in different roles. The series has a big cult audience, and copies of videos are heavily sought after. The British budget label Channel 5 Video released a compilation cassette of all six episodes edited together into one 137-minute chunk in 1987. In 2010 Network DVD released both the complete, unedited series and the movie on a 2-DVD set entitled Whoops Apocalypse: The Complete Apocalypse.. John Otway also recorded a song called \"Whoops Apocalypse\", which was used as the theme song for the film. He occasionally performs it live. Featured Crew Andrew Marshall Creator David Renwick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barry Morse John Barron Ed Bishop Alexei Sayle Commissar Solzhenitsyn Rik Mayall Full Cast & Crew Last Season Season 1 1982 | 6 Episodes Season 1 of Whoops Apocalypse premiered on March 14, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Whoops Apocalypse. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords dark comedy surreal satire apocalypse sitcom political humour british humour workplace comedy Content Score 93 Almost there... Top Contributors O 16 Ozbourne t 3 tfj1977  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}