{"link": "https://www.themoviedb.org/tv/40283?language=en", "title": "Wild Boys", "resume": "Wild Boys is an Australian television period drama series that began airing on the Seven Network on 4 September 2011. It is produced by Julie McGauran and Sarah Smith from Southern Star and John Holmes. The series is set in and around the fictional town of Hopetoun and principally filmed in Wilberforce on the Hawkesbury, Nelson, and Glenworth Valley on the New South Wales Central Coast.The series premiered in the UK on TCM UK on 3 March 2013.\nThe series was not renewed after the first season of 13 episodes.", "rate": 80, "genre": ["Drama", "Western"], "cast": ["Daniel MacPherson", "Nathaniel Dean", "Zoe Ventoura", "Christopher Stollery", "Michael Dorman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40283   Expand Wild Boys   (2011) User Score Overview Wild Boys is an Australian television period drama series that began airing on the Seven Network on 4 September 2011. It is produced by Julie McGauran and Sarah Smith from Southern Star and John Holmes. The series is set in and around the fictional town of Hopetoun and principally filmed in Wilberforce on the Hawkesbury, Nelson, and Glenworth Valley on the New South Wales Central Coast.The series premiered in the UK on TCM UK on 3 March 2013. The series was not renewed after the first season of 13 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel MacPherson Nathaniel Dean Zoe Ventoura Christopher Stollery Michael Dorman Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Wild Boys premiered on September  4, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wild Boys. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Western Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors w 3 webmaster s 3 speedycars 1 t0by J 1 Jenn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}