{"link": "https://www.themoviedb.org/tv/42021?language=en", "title": "Talking Dead", "resume": "Talking Dead is a live talk show in which host Chris Hardwick discusses episodes of the AMC television series The Walking Dead with guests, including celebrity fans, cast members, and crew from the series.", "rate": 73, "genre": ["Drama"], "cast": ["Chris Hardwick"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42021   Expand Talking Dead   (2011) User Score  Play Trailer Overview Talking Dead is a live talk show in which host Chris Hardwick discusses episodes of the AMC television series The Walking Dead with guests, including celebrity fans, cast members, and crew from the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Hardwick Himself - Host Full Cast & Crew Current Season Season 7 2017 | 23 Episodes Season 7 of Talking Dead premiered on October 22, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply St Did anyone here watch Hardwick's new show last night? Open 0 by Satch_the_man\n      \n     Chris Hardwick Open 0 by  Satch_the_man Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2007-06-06 Destination Truth 7.6    2014-09-24 black-ish 7.0    2014-09-12 Z Nation 6.4    1988-10-18 Roseanne 6.7    1984-09-20 The Cosby Show 6.8    2010-09-24 Blue Bloods 6.8    1982-09-30 Cheers 7.5    2016-09-20 This Is Us 8.1  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  60m, 42m Homepage   http://www.amctv.com/shows/talking-dead Genres Drama Keywords talk show the walking dead after show fear the walking dead Content Score 64 We're so close, yet so far. Top Contributors 23 Elizabeth Jennings H 20 HM101 b 12 basher 10 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}