{"link": "https://www.themoviedb.org/tv/1508?language=en", "title": "Dancing with the Stars", "resume": "The American version of the British “Strictly Come Dancing” show sees celebrities perform choreographed dance routines which are judged by a panel of renowned ballroom experts and voted on by viewers. Enjoy sizzling salsas, sambas and spray-tans as they vie for the coveted Mirrorball Trophy.", "rate": 50, "genre": ["Family"], "cast": ["Tom Bergeron", "Len Goodman", "Carrie Ann Inaba", "Bruno Tonioli"], "character": ["Himself - Host", "Himself - Judge", "Herself - Judge", "Himself - Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1508   Expand Dancing with the Stars   (2005) User Score Overview The American version of the British “Strictly Come Dancing” show sees celebrities perform choreographed dance routines which are judged by a panel of renowned ballroom experts and voted on by viewers. Enjoy sizzling salsas, sambas and spray-tans as they vie for the coveted Mirrorball Trophy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  26 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Bergeron Himself - Host Len Goodman Himself - Judge Carrie Ann Inaba Herself - Judge Bruno Tonioli Himself - Judge Full Cast & Crew Current Season Season 26 2018 | 4 Episodes Season 26 of Dancing with the Stars premiered on April 30, 2018. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply New season Open 3 by  Heidi a New Season without IMdB - and Nancy Kerrigan Open 7 by  anne1 Simone cut! Open 2 by  Taylorfirst1 Go to Discussions Media Most Popular Videos  0 Backdrops  26 Posters  11 Recommendations   2002-06-11 American Idol 4.4    1972-09-04 The Price Is Right 8.5    2012-08-08 Here Comes Honey Boo Boo 1.9    2009-02-11 Important Things with Demetri Martin 6.6    2001-11-14 The Bernie Mac Show 5.7    2000-05-31 Survivor 6.3    1993-04-21 Walker, Texas Ranger 5.0    2000-10-02 Yes, Dear 5.8  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  90m, 120m Homepage   http://abc.go.com/shows/dancing-with-the-stars Genres Family Keywords dance competition celebrity Content Score 86 Almost there... Top Contributors 96 Elizabeth Jennings LC 7 Legit Corporation TB 6 TMDb Bot uh 6 udin huut  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}