{"link": "https://www.themoviedb.org/tv/74189?language=en", "title": "UQ Holder!", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 90, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Yuka Takakura", "Yuki Matsuoka", "Yûki Matsuoka", "Kayano Ai", "Yui Ogura"], "character": ["Tota Konohe", "Evangeline A.K. McDowell", "Kuroumaru Tokisaka", "Kirie Sakurame", "Karin Yuuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74189   Expand UQ Holder!   (2017) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Youhei Suzuki Creator Ken Akamatsu Creator Shougo Yasukawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuka Takakura Tota Konohe Yuki Matsuoka Evangeline A.K. McDowell Yûki Matsuoka Kuroumaru Tokisaka Kayano Ai Kirie Sakurame Yui Ogura Karin Yuuki Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of UQ Holder! premiered on October  3, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for UQ Holder!. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on UQ Holder!. You can help by rating TV shows you've seen. Facts Original Name  UQ HOLDER!～魔法先生ネギま！ Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://uqholder.jp/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 19 Jenazad 16 Alex 15 sp1ti 10 Despair-Paradise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}