{"link": "https://www.themoviedb.org/tv/66993?language=en", "title": "Pillow Boys", "resume": "Who’s your ideal boyfriend? You might find just the guy in Makura no Danshi. Each short episode features a different boy who will listen to you and hold you when you need it. Episodes are shown from the viewer’s point of view, and the boys all address the viewer personally. Listen to them talk about their day, then tell them about yours. All the boys have kind hearts and will make you feel special and loved. Each boy has a distinct background, age, and personality, sure to please any kind of viewer taste. Merry is a gentle brown-eyed boy with an open heart. Eiji Kijinami is a punk from your school who is really not as scary as people think. The shy Ryuushi Theodore Emori loves to watch the stars with you, getting lost in the night sky. There are other boys and personalities to discover.", "rate": 10, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66993   Expand Pillow Boys   (2015) User Score Overview Who’s your ideal boyfriend? You might find just the guy in Makura no Danshi. Each short episode features a different boy who will listen to you and hold you when you need it. Episodes are shown from the viewer’s point of view, and the boys all address the viewer personally. Listen to them talk about their day, then tell them about yours. All the boys have kind hearts and will make you feel special and loved. Each boy has a distinct background, age, and personality, sure to please any kind of viewer taste. Merry is a gentle brown-eyed boy with an open heart. Eiji Kijinami is a punk from your school who is really not as scary as people think. The shy Ryuushi Theodore Emori loves to watch the stars with you, getting lost in the night sky. There are other boys and personalities to discover. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Pillow Boys premiered on July 13, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Pillow Boys. You can help by rating TV shows you've seen. Facts Original Name  Makura no Danshi Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  4m Homepage  - Genres Animation Keywords romance shoujo Content Score 43 There's no 'I' in team... Top Contributors 18 dgw m 3 magoozin 3 eduardonek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}