{"link": "https://www.themoviedb.org/tv/19053?language=en", "title": "Augie Doggie and Doggie Daddy", "resume": "Augie Doggie and Doggie Daddy are Hanna-Barbera cartoon characters who debuted on The Quick Draw McGraw Show and appeared in their own segment of that show.", "rate": 93, "genre": ["Animation"], "cast": ["Daws Butler", "Doug Young"], "character": ["Augie Doggie", "Doggie Daddy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19053   Expand Augie Doggie and Doggie Daddy   (1959) User Score Overview Augie Doggie and Doggie Daddy are Hanna-Barbera cartoon characters who debuted on The Quick Draw McGraw Show and appeared in their own segment of that show. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daws Butler Augie Doggie Doug Young Doggie Daddy Full Cast & Crew Last Season Season 3 1961 | 6 Episodes Season 3 of Augie Doggie and Doggie Daddy premiered on September 15, 1961. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Augie Doggie and Doggie Daddy. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 7 Robson Guedes Vieira M 5 Milani-SP 4 minhus j 3 jfarr1978  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}