{"link": "https://www.themoviedb.org/tv/34771?language=en", "title": "Saikano", "resume": "Saikano: The Last Love Song on This Little Planet. is a manga, anime, and OVA series by Shin Takahashi, creator of Iihito and Kimi no Kakera. Saikano was originally serialized in Shogakukan's Big Comic Spirits magazine.\nA live-action movie adaptation was released in Japan on January 28, 2006 with Aki Maeda starring as Chise.\nThe Saikano manga and anime series has been licensed and is being distributed by Viz Media in English in North America. The anime series is distributed in the UK by Manga Entertainment.\nAlthough the city is not mentioned by name in the series, many of the locations used in Saikano can by all probability be found in Otaru-shi, west of Sapporo. The train station, \"Hell Hill\", the Asahi Observation Hill, the view over the harbor, and the school all have similar looking counterparts in the city of Otaru.", "rate": 70, "genre": ["Animation", "Drama"], "cast": ["Miki Itou", "Shin'ichirou Miki", "Shirô Ishimoda", "Fumiko Orikasa", "Yuu Sugimoto"], "character": ["Fuyumi", "Tetsu", "Shuuji", "Chise", "Akemi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34771   Expand Saikano   (2002) User Score Overview Saikano: The Last Love Song on This Little Planet. is a manga, anime, and OVA series by Shin Takahashi, creator of Iihito and Kimi no Kakera. Saikano was originally serialized in Shogakukan's Big Comic Spirits magazine. A live-action movie adaptation was released in Japan on January 28, 2006 with Aki Maeda starring as Chise. The Saikano manga and anime series has been licensed and is being distributed by Viz Media in English in North America. The anime series is distributed in the UK by Manga Entertainment. Although the city is not mentioned by name in the series, many of the locations used in Saikano can by all probability be found in Otaru-shi, west of Sapporo. The train station, \"Hell Hill\", the Asahi Observation Hill, the view over the harbor, and the school all have similar looking counterparts in the city of Otaru. Featured Crew Shin Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miki Itou Fuyumi Shin'ichirou Miki Tetsu Shirô Ishimoda Shuuji Fumiko Orikasa Chise Yuu Sugimoto Akemi Full Cast & Crew Last Season Season 1 2002 | 14 Episodes Season 1 of Saikano premiered on July  2, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Saikano. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors o 4 ovie m 3 magoozin 2 TheDerpMan d 1 dex815  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}