{"link": "https://www.themoviedb.org/tv/35971?language=en", "title": "Pandora Hearts", "resume": "Pandora Hearts is a shōnen manga series written and illustrated by Jun Mochizuki. Individual chapters have been serialized in Monthly GFantasy since June 2006, with bound volumes published by Square Enix. Currently nineteen volumes have been released in Japan. The manga series was originally licensed for an English language release by Broccoli Books but has since been dropped; it has been licensed by Yen Press since then.\nAn anime adaptation produced by Xebec began airing on April 2, 2009, and finished airing on September 24, 2009. On February 11, 2010, NIS America announced it would release the anime series in North America. Nine OVAs were also broadcast in Japan, airing from July 24, 2009 to March 25, 2010.", "rate": 80, "genre": ["Animation", "Mystery", "Drama"], "cast": ["Junko Minagawa", "Ayako Kawasumi", "Akira Ishida", "Kana Hanazawa", "Daisuke Ono"], "character": ["Jack Vessalius"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35971   Expand Pandora Hearts   (2009) User Score Overview Pandora Hearts is a shōnen manga series written and illustrated by Jun Mochizuki. Individual chapters have been serialized in Monthly GFantasy since June 2006, with bound volumes published by Square Enix. Currently nineteen volumes have been released in Japan. The manga series was originally licensed for an English language release by Broccoli Books but has since been dropped; it has been licensed by Yen Press since then. An anime adaptation produced by Xebec began airing on April 2, 2009, and finished airing on September 24, 2009. On February 11, 2010, NIS America announced it would release the anime series in North America. Nine OVAs were also broadcast in Japan, airing from July 24, 2009 to March 25, 2010. Featured Crew Jun Mochizuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junko Minagawa Ayako Kawasumi Akira Ishida Kana Hanazawa Daisuke Ono Jack Vessalius Full Cast & Crew Last Season Season 1 2009 | 25 Episodes Season 1 of Pandora Hearts premiered on April  2, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Pandora Hearts. You can help by rating TV shows you've seen. Facts Original Name  パンドラハーツ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Mystery Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 7 sheva_vitali I 6 IDerr a 4 ani2load 4 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}