{"link": "https://www.themoviedb.org/tv/69857?language=en", "title": "Quartet", "resume": "Maki Maki, Sebuki Suzume, Beppu Tsukasa and Iemori Yutaka happen to meet and form a quartet. They even begin to live together in Karuizawa during the winter, but there is a big hidden secret.\nMaki, who has a negative personality and barely gives her opinions, plays the lead violin in the quartet. She has family and only goes to Karuizawa on the weekends for performances. Suzume, who is unemployed, plays the cello, while Yutaka plays the viola in the quartet. The leader of the quartet and the one providing his grandfather's villa as a base for them is Tsukasa. He plays the second violin in the quartet and comes from a musical family. A man of many secrets, he also works at a donut company.", "rate": 97, "genre": ["Drama"], "cast": ["Ryuhei Matsuda", "Hikari Mitsushima", "Takako Matsu", "Issey Takahashi", "Riho Yoshioka"], "character": ["Tsukasa Beppu", "Suzume Sebuki", "Maki Maki", "Yutaka Iemori", "Arisu Kisugi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69857   Expand Quartet   (2017) User Score Overview Maki Maki, Sebuki Suzume, Beppu Tsukasa and Iemori Yutaka happen to meet and form a quartet. They even begin to live together in Karuizawa during the winter, but there is a big hidden secret. Maki, who has a negative personality and barely gives her opinions, plays the lead violin in the quartet. She has family and only goes to Karuizawa on the weekends for performances. Suzume, who is unemployed, plays the cello, while Yutaka plays the viola in the quartet. The leader of the quartet and the one providing his grandfather's villa as a base for them is Tsukasa. He plays the second violin in the quartet and comes from a musical family. A man of many secrets, he also works at a donut company. Featured Crew Yûji Sakamoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryuhei Matsuda Tsukasa Beppu Hikari Mitsushima Suzume Sebuki Takako Matsu Maki Maki Issey Takahashi Yutaka Iemori Riho Yoshioka Arisu Kisugi Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Quartet premiered on January 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Quartet. You can help by rating TV shows you've seen. Facts Original Name  カルテット Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.tbs.co.jp/quartet2017/ Genres Drama Keywords japan quartet Content Score 93 Almost there... Top Contributors 19 thirstyhippo M 12 Maria180493 c 10 coffeerson 7 MundoAsian  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}