{"link": "https://www.themoviedb.org/tv/10199?language=en", "title": "MTV Cribs", "resume": "MTV Cribs and CMT Cribs, depending on which channel it airs, is a franchise reality television program that originated on the MTV Networks' MTV. It later aired on its CMT channel that features tours of the houses and mansions of celebrities. The first show aired September 2000. By 2005, Cribs had featured tours of the homes of over 185 celebrities, musicians, actors, and athletes over the course of 13 seasons. The show was originally narrated by Ananda Lewis, then narrated by Su-chin Pak of MTV News. It was developed by Nina L. Díaz, who has gone on to develop My Super Sweet 16, also for MTV.\nThe most watched and replayed episode of Cribs was a special one-hour edition touring Mariah Carey's New York penthouse. In 2005/2006, MTV Canada produced a series of Canadian-made Cribs episodes.\nA new season of Cribs, filmed in high definition, started in August 2007 with a new format, title sequences, and on-screen graphics. The show is also no longer voiced by Pak. A 'Priciest Pads' special was created to kick off the new season, hosted by Kimora Lee Simmons.\nThe show was put into syndication in September 2007, to be offered by local television stations on a weekday basis in the United States by Litton Entertainment. However, the Litton versions of the program were severely edited and changed. Any references to MTV were scrubbed out, and the program received a new logo referring to it as just Cribs, while all music that was played in the original episodes was replaced by production music to avoid royalty fees. Although Lewis and Pak were still listed in the episode credits as narrators, all narration was stripped in the re-edited episodes, and 'coming up' segments were either silent or voiced by an uncredited announcer. The syndicated version was unsuccessful and offered in barter form, mainly on the lower-rated stations in many markets in abysmal timeslots, and was removed in September 2008 from the market.", "rate": 47, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10199   Expand MTV Cribs User Score Overview MTV Cribs and CMT Cribs, depending on which channel it airs, is a franchise reality television program that originated on the MTV Networks' MTV. It later aired on its CMT channel that features tours of the houses and mansions of celebrities. The first show aired September 2000. By 2005, Cribs had featured tours of the homes of over 185 celebrities, musicians, actors, and athletes over the course of 13 seasons. The show was originally narrated by Ananda Lewis, then narrated by Su-chin Pak of MTV News. It was developed by Nina L. Díaz, who has gone on to develop My Super Sweet 16, also for MTV. The most watched and replayed episode of Cribs was a special one-hour edition touring Mariah Carey's New York penthouse. In 2005/2006, MTV Canada produced a series of Canadian-made Cribs episodes. A new season of Cribs, filmed in high definition, started in August 2007 with a new format, title sequences, and on-screen graphics. The show is also no longer voiced by Pak. A 'Priciest Pads' special was created to kick off the new season, hosted by Kimora Lee Simmons. The show was put into syndication in September 2007, to be offered by local television stations on a weekday basis in the United States by Litton Entertainment. However, the Litton versions of the program were severely edited and changed. Any references to MTV were scrubbed out, and the program received a new logo referring to it as just Cribs, while all music that was played in the original episodes was replaced by production music to avoid royalty fees. Although Lewis and Pak were still listed in the episode credits as narrators, all narration was stripped in the re-edited episodes, and 'coming up' segments were either silent or voiced by an uncredited announcer. The syndicated version was unsuccessful and offered in barter form, mainly on the lower-rated stations in many markets in abysmal timeslots, and was removed in September 2008 from the market. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage  - Genres Reality Keywords house celebrity Content Score 50 Still needs a little work. Top Contributors 7 Banana A 6 Aerykbacon 4 janar s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}