{"link": "https://www.themoviedb.org/tv/14363?language=en", "title": "Midnight Man", "resume": "Midnight Man is a 2008 British television serial produced by Carnival Films for the ITV network. The three-part serial stars James Nesbitt as Max Raban, a former investigative journalist who discovers an international conspiracy involving government policy groups and death squads. It co-stars Catherine McCormack as Alice Ross, a policy advisor who helps Raban, and Reece Dinsdale as Blake, the head of the death squad.\nThe serial was written by David Kane in response to national paranoia in the wake of the War on Terror. Kane was inspired by the way the films Three Days of the Condor, The Parallax View and The Conversation reflected a post-Vietnam paranoia in the United States. The director David Drury had the predominantly nighttime-set serial filmed in the winter, to maximise the use of darkness and keep down production costs. His inspiration for the look of the serial came from The Godfather, which featured rich colours.\nReaction to the serial was generally positive; critics believed the drama was formulaic and uninspired, but appreciated the direction and acting. Nesbitt received a Best Actor nomination at the 2008 ITV3 Crime Thriller Awards.", "rate": 55, "genre": ["Drama"], "cast": ["Reece Dinsdale", "Ian Puleston-Davies", "Peter Capaldi", "James Nesbitt", "Catherine McCormack"], "character": ["Blake", "Jimmy Kerrigan", "Trevor", "Max Raban", "Alice Ross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14363   Expand Midnight Man   (2008) User Score Overview Midnight Man is a 2008 British television serial produced by Carnival Films for the ITV network. The three-part serial stars James Nesbitt as Max Raban, a former investigative journalist who discovers an international conspiracy involving government policy groups and death squads. It co-stars Catherine McCormack as Alice Ross, a policy advisor who helps Raban, and Reece Dinsdale as Blake, the head of the death squad. The serial was written by David Kane in response to national paranoia in the wake of the War on Terror. Kane was inspired by the way the films Three Days of the Condor, The Parallax View and The Conversation reflected a post-Vietnam paranoia in the United States. The director David Drury had the predominantly nighttime-set serial filmed in the winter, to maximise the use of darkness and keep down production costs. His inspiration for the look of the serial came from The Godfather, which featured rich colours. Reaction to the serial was generally positive; critics believed the drama was formulaic and uninspired, but appreciated the direction and acting. Nesbitt received a Best Actor nomination at the 2008 ITV3 Crime Thriller Awards. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Reece Dinsdale Blake Ian Puleston-Davies Jimmy Kerrigan Peter Capaldi Trevor James Nesbitt Max Raban Catherine McCormack Alice Ross Full Cast & Crew Last Season Season 1 2008 | 3 Episodes Season 1 of Midnight Man premiered on May  8, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Midnight Man. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  180m, 60m Homepage  - Genres Drama Keywords journalist conspiracy miniseries government corruption Content Score 86 Almost there... Top Contributors TB 10 TMDb Bot 8 Steve R 5 Rebecca 1 3 1regent  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}