{"link": "https://www.themoviedb.org/tv/4293?language=en", "title": "Sleepwalkers", "resume": "Sleepwalkers is an American science fiction series which began airing on NBC in late 1997. It tells the story of a team of researchers who used technology to enter the dreams of psychiatric patients in order to diagnose their problems.\nThe show was created by Stephen Kronish and David S. Goyer, who would go on to produce the Blade films.", "rate": 0, "genre": ["Mystery"], "cast": ["Abraham Benrubi", "Bruce Greenwood", "Naomi Watts", "Jeff Doucette", "Jeffrey D. Sams"], "character": ["Kate Russell", "Detective Burke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4293   Expand Sleepwalkers   (1997) User Score Overview Sleepwalkers is an American science fiction series which began airing on NBC in late 1997. It tells the story of a team of researchers who used technology to enter the dreams of psychiatric patients in order to diagnose their problems. The show was created by Stephen Kronish and David S. Goyer, who would go on to produce the Blade films. Featured Crew David S. Goyer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Abraham Benrubi Bruce Greenwood Naomi Watts Kate Russell Jeff Doucette Detective Burke Jeffrey D. Sams Full Cast & Crew Last Season Season 1 1997 | 9 Episodes Season 1 of Sleepwalkers premiered on November  1, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Sleepwalkers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 48m Homepage  - Genres Mystery Keywords dream scientist mind walking Content Score 93 Almost there... Top Contributors 9 Banana 9 roland5262 S 3 Shady12 R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}