{"link": "https://www.themoviedb.org/tv/66662?language=en", "title": "Mon ex à moi", "resume": "Love gives you wings, puts stars in your eyes and butterflies in your stomach…but it can also make you blind and crazy! Amélie’s world falls apart when François, the man of her dreams, suddenly leaves her. Amélie may be a bright financial planner in her 20s, but when it comes to re-conquering her ex, she loses it and becomes a total crackpot. With her loyal friends Marilou and Mathieu by her side, Amélie will go to any lengths and try any hair-brained, absurd or extravagant scheme to get her man back. As she clings to the hope of reuniting with François, her perseverance – and her imagination – know no bounds.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": ["Sophie Desmarais", "Catherine Paquin-Béchard", "Mickaël Gouin", "Jean-François Nadeau"], "character": ["Amélie Boutet", "Marilou Lemieux", "Mathieu Bouchard", "François Vaillancourt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66662   Expand Mon ex à moi   (2015) User Score Overview Love gives you wings, puts stars in your eyes and butterflies in your stomach…but it can also make you blind and crazy! Amélie’s world falls apart when François, the man of her dreams, suddenly leaves her. Amélie may be a bright financial planner in her 20s, but when it comes to re-conquering her ex, she loses it and becomes a total crackpot. With her loyal friends Marilou and Mathieu by her side, Amélie will go to any lengths and try any hair-brained, absurd or extravagant scheme to get her man back. As she clings to the hope of reuniting with François, her perseverance – and her imagination – know no bounds. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sophie Desmarais Amélie Boutet Catherine Paquin-Béchard Marilou Lemieux Mickaël Gouin Mathieu Bouchard Jean-François Nadeau François Vaillancourt Full Cast & Crew Last Season Season 2 2016 | 16 Episodes Season 2 of Mon ex à moi premiered on April 13, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mon ex à moi. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  23m Homepage   http://seriesplus.com/emissions/mon-ex-moi Genres Drama Comedy Keywords canada montreal dating relationship twenty something young adult Content Score 86 Almost there... Top Contributors 30 Banana 5 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}