{"link": "https://www.themoviedb.org/tv/19824?language=en", "title": "Campion", "resume": "Campion is a television show made by the BBC, adapting the Albert Campion mystery novels written by Margery Allingham. Two series were made, in 1989 and 1990, starring Peter Davison as Campion, Brian Glover as his manservant Magersfontein Lugg and Andrew Burt as his policeman friend Stanislaus Oates.\nA total of eight novels were adapted, four in each series, each of which was originally broadcast as two separate hour-long episodes. Peter Davison sang the title music for the first series himself; in the second series, it was replaced with an instrumental version.", "rate": 70, "genre": ["Mystery", "Drama", "Comedy"], "cast": ["Peter Davison", "Brian Glover", "Andrew Burt"], "character": ["Albert Campion"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19824   Expand Campion   (1989) User Score Overview Campion is a television show made by the BBC, adapting the Albert Campion mystery novels written by Margery Allingham. Two series were made, in 1989 and 1990, starring Peter Davison as Campion, Brian Glover as his manservant Magersfontein Lugg and Andrew Burt as his policeman friend Stanislaus Oates. A total of eight novels were adapted, four in each series, each of which was originally broadcast as two separate hour-long episodes. Peter Davison sang the title music for the first series himself; in the second series, it was replaced with an instrumental version. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Davison Albert Campion Brian Glover Andrew Burt Full Cast & Crew Last Season Season 2 1990 | 8 Episodes Season 2 of Campion premiered on January 12, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Campion. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Mystery Drama Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}