{"link": "https://www.themoviedb.org/tv/34775?language=en", "title": "Reideen", "resume": "Reideen is a Japanese animated television series remake of the 1975 Super Robot anime Brave Raideen. It was produced by Production I.G and directed by Mitsuru Hongo. Which was originally broadcast on the satellite network WOWOW in 2007.\nThe anime series has been adapted into a manga.", "rate": 0, "genre": ["Animation"], "cast": ["Shozo Iizuka", "Shin'ichirou Miki", "Keiji Fujiwara", "Sayuri", "Saeko Chiba"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34775   Expand Reideen   (2007) User Score Overview Reideen is a Japanese animated television series remake of the 1975 Super Robot anime Brave Raideen. It was produced by Production I.G and directed by Mitsuru Hongo. Which was originally broadcast on the satellite network WOWOW in 2007. The anime series has been adapted into a manga. Featured Crew Mitsuru Hongo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shozo Iizuka Shin'ichirou Miki Keiji Fujiwara Sayuri Saeko Chiba Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of Reideen premiered on March  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Reideen. You can help by rating TV shows you've seen. Facts Original Name  REIDEEN Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 3 Banana 1 minusha97  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}