{"link": "https://www.themoviedb.org/tv/62625?language=en", "title": "Granite Flats", "resume": "It's the 1960s. The height of the Cold War. The rural town of Granite Flats, Colorado, suddenly becomes a hotbed for mystery and intrigue.\nAlmost a year after Hershel Jenkins was released from jail, mystery is still a permanent resident in Granite Flats, Colorado. From small concerns plaguing the citizens of the small town to ongoing FBI investigations, Arthur, Timmy, and Madeline are eager to put their developing detective skills to the test. Their sleuthing goes further than ever before, and they may be biting off more than they can chew. And as it turns out, sleuthing is a family affair. The parents of all three miniature detectives have dipped their toes in the water. Chief Sanders works side by side with the FBI to find a citizen who is disloyal to the country, Beth is embroiled in the center of experimental work at the hospital, and the Doctors Andrews are the masterminds behind the shady experiments. This season, everyone has got a secret and nobody is ready to admit it.", "rate": 80, "genre": ["Drama"], "cast": ["Jonathan Morgan Heit", "Richard Gunn", "Charlie Plummer", "Malia Tyler", "Jessica Wright"], "character": ["Arthur Milligan", "John Sanders", "Timmy Sanders", "Madeline Andrews", "Regina Clark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62625   Expand Granite Flats   (2013) User Score Overview It's the 1960s. The height of the Cold War. The rural town of Granite Flats, Colorado, suddenly becomes a hotbed for mystery and intrigue. Almost a year after Hershel Jenkins was released from jail, mystery is still a permanent resident in Granite Flats, Colorado. From small concerns plaguing the citizens of the small town to ongoing FBI investigations, Arthur, Timmy, and Madeline are eager to put their developing detective skills to the test. Their sleuthing goes further than ever before, and they may be biting off more than they can chew. And as it turns out, sleuthing is a family affair. The parents of all three miniature detectives have dipped their toes in the water. Chief Sanders works side by side with the FBI to find a citizen who is disloyal to the country, Beth is embroiled in the center of experimental work at the hospital, and the Doctors Andrews are the masterminds behind the shady experiments. This season, everyone has got a secret and nobody is ready to admit it. Featured Crew Beth Howard Creator James Shores Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Morgan Heit Arthur Milligan Richard Gunn John Sanders Charlie Plummer Timmy Sanders Malia Tyler Madeline Andrews Jessica Wright Regina Clark Full Cast & Crew Last Season Season 3 2015 | 8 Episodes Season 3 of Granite Flats premiered on April  4, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply c Great show! Open 5 by  cinna_mini_me k SPOILERS Inspired by real events. Open 0 by klondike6\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Granite Flats. You can help by rating TV shows you've seen. Facts Status  Ended Network BYU Television Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  40m Homepage   http://www.byutv.org/show/0aea4804-47dc-470f-b80a-35c8f23d0f27/granite-flats Genres Drama Keywords cold war detective Content Score 93 Almost there... Top Contributors 35 Elizabeth Jennings LC 5 Legit Corporation 1 curtisgibby l 1 lucybenson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}