{"link": "https://www.themoviedb.org/tv/16234?language=en", "title": "What Would You Do?", "resume": "What Would You Do? is an American television news magazine and hidden camera show broadcast on ABC since 2008 as part of the Primetime series. The series is hosted by news correspondent John Quiñones. In the series, actors act out scenes of conflict or illegal activity in public settings while hidden cameras videotape the scene, and the focus is on whether or not bystanders intervene, and how. Variations are also usually included, such as changing the genders, the races or the clothing of the actors performing the scene, to see if bystanders react differently. Quiñones appears at the end to interview the bystanders about their reactions. As the experiment goes on, psychology professors, teachers, or club members watch and discuss the video with Quiñones, explaining and making inferences on the bystanders' reactions.", "rate": 66, "genre": ["News", "Reality"], "cast": ["John Quiñones"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16234   Expand What Would You Do?   (2008) User Score Overview What Would You Do? is an American television news magazine and hidden camera show broadcast on ABC since 2008 as part of the Primetime series. The series is hosted by news correspondent John Quiñones. In the series, actors act out scenes of conflict or illegal activity in public settings while hidden cameras videotape the scene, and the focus is on whether or not bystanders intervene, and how. Variations are also usually included, such as changing the genders, the races or the clothing of the actors performing the scene, to see if bystanders react differently. Quiñones appears at the end to interview the bystanders about their reactions. As the experiment goes on, psychology professors, teachers, or club members watch and discuss the video with Quiñones, explaining and making inferences on the bystanders' reactions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Quiñones Himself - Host Full Cast & Crew Last Season Season 9 2014 | 8 Episodes Season 9 of What Would You Do? premiered on May 23, 2014. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Stealing Mother Open 0 by Asharah\n      \n     Pregnant Wife Open 0 by Asharah\n      \n     AIDS Paranoia Open 2 by  Asharah Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on What Would You Do?. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://abcnews.go.com/whatwouldyoudo/ Genres News Reality Keywords bullying hidden camera bigotry illegal activity Content Score 56 We're so close, yet so far. Top Contributors 27 Elizabeth Jennings PE 7 Patrick E. Abe TB 2 TMDb Bot 1 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}