{"link": "https://www.themoviedb.org/tv/61511?language=en", "title": "Father Brown", "resume": "Father Brown is based on G. K. Chesterton's detective stories about a Catholic priest who doubles as an amateur detective in order to try and solve mysteries.", "rate": 72, "genre": ["Drama", "Crime", "Mystery"], "cast": ["Mark Williams", "Sorcha Cusack"], "character": ["Father Brown", "Mrs. McCarthy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61511   Expand Father Brown   (2013) User Score  Play Trailer Overview Father Brown is based on G. K. Chesterton's detective stories about a Catholic priest who doubles as an amateur detective in order to try and solve mysteries. Featured Crew Tahsin Guner Creator Rachel Flowerday Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Williams Father Brown Sorcha Cusack Mrs. McCarthy Full Cast & Crew Current Season Season 6 2017 | 10 Episodes Season 6 of Father Brown premiered on December 18, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w **SPOILERS**: S2E06 \"The Daughters of Jerusalem\" Open 0 by wonder2wonder\n      \n     w **SPOILERS**: S2E05 \"The Mysteries of the Rosary\" Open 0 by wonder2wonder\n      \n     w **SPOILERS**: S2E04 \"The Shadow of the Scaffold\" Open 2 by  wonder2wonder Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  3 Recommendations   2011-09-05 Zig and Sharko 5.3    2012-02-05 Glitter Force 6.3    2014-01-06 Some Assembly Required 4.7    2013-03-25 Max Steel 4.8  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.bbc.co.uk/programmes/b03pmw4m Genres Drama Crime Mystery Keywords detective amateur detective priest preacher united kingdom historical society costume drama Content Score 71 Just a little bit more... Top Contributors 113 Marr 🇳🇱 50 Elizabeth Jennings m 42 miro22 13 SuperMario  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}