{"link": "https://www.themoviedb.org/tv/11336?language=en", "title": "That Was The Week That Was", "resume": "That Was the Week That Was, informally TWTWTW or TW3, is a satirical television comedy programme on BBC Television in 1962 and 1963. It was devised, produced and directed by Ned Sherrin and presented by David Frost. An American version by the same name aired on NBC from 1964 to 1965, also featuring Frost.\nThe programme is considered a significant element of the satire boom in the United Kingdom in the early 1960s. It broke ground in comedy through lampooning the establishment and political figures. Its broadcast coincided with coverage of the politically charged Profumo affair and John Profumo, the politician at the centre of the affair, became a target for derision. TW3 was first broadcast on Saturday 24 November 1962.", "rate": 80, "genre": ["Comedy"], "cast": ["Millicent Martin", "Lance Percival", "Kenneth Cope", "Roy Kinnear", "David Frost"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11336   Expand That Was The Week That Was   (1962) User Score Overview That Was the Week That Was, informally TWTWTW or TW3, is a satirical television comedy programme on BBC Television in 1962 and 1963. It was devised, produced and directed by Ned Sherrin and presented by David Frost. An American version by the same name aired on NBC from 1964 to 1965, also featuring Frost. The programme is considered a significant element of the satire boom in the United Kingdom in the early 1960s. It broke ground in comedy through lampooning the establishment and political figures. Its broadcast coincided with coverage of the politically charged Profumo affair and John Profumo, the politician at the centre of the affair, became a target for derision. TW3 was first broadcast on Saturday 24 November 1962. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Millicent Martin Lance Percival Kenneth Cope Roy Kinnear David Frost Full Cast & Crew Last Season Season 2 1963 | 14 Episodes Season 2 of That Was The Week That Was premiered on September 28, 1963. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on That Was The Week That Was. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Comedy Keywords satire sketch comedy political humour british humour Content Score 71 Just a little bit more... Top Contributors O 7 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}