{"link": "https://www.themoviedb.org/tv/2366?language=en", "title": "Reunion", "resume": "Reunion is an American television series that aired on FOX in late 2005. The series was intended to chronicle 20 years in the lives of a group of six high school friends from Bedford, New York, with each episode following one year in the lives of the six, beginning with their high school graduation year 1986. Each episode also featured scenes in the present where Detective Marjorino is investigating the brutal murder of one of the group during the night of their 20-year class reunion in 2006. The identity of the murder victim was not revealed until the fifth episode, \"1990\".\nDue to low ratings, the series was canceled after only nine episodes, and the identity of the killer remained unrevealed in the aired episodes.", "rate": 80, "genre": ["Drama"], "cast": ["Dave Annable", "Amanda Righetti", "Alexa Davalos", "Chyler Leigh", "Will Estes"], "character": ["Jenna Moretti", "Samantha Carlton", "Carla Noll"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2366   Expand Reunion   (2005) User Score Overview Reunion is an American television series that aired on FOX in late 2005. The series was intended to chronicle 20 years in the lives of a group of six high school friends from Bedford, New York, with each episode following one year in the lives of the six, beginning with their high school graduation year 1986. Each episode also featured scenes in the present where Detective Marjorino is investigating the brutal murder of one of the group during the night of their 20-year class reunion in 2006. The identity of the murder victim was not revealed until the fifth episode, \"1990\". Due to low ratings, the series was canceled after only nine episodes, and the identity of the killer remained unrevealed in the aired episodes. Featured Crew Jon Amiel Creator Jon Harmon Feldman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Annable Amanda Righetti Jenna Moretti Alexa Davalos Samantha Carlton Chyler Leigh Carla Noll Will Estes Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of Reunion premiered on September  8, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Reunion. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 41m Homepage  - Genres Drama Keywords new york group of friends high school reunion murder mystery Content Score 93 Almost there... Top Contributors 5 Banana R 4 Rebecca 3 MacFly 🇫🇷 2 seawolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}