{"link": "https://www.themoviedb.org/tv/73637?language=en", "title": "Sidetracked", "resume": "It is autumn and the people in the otherwise peaceful small town Ystad settle down. But for Kurt Wallander broken idyll of a young woman burned to death in a cornfield.  Soon after hitting a serial killer with a series of increasingly brutal murder. What is the relationship between a retired attorney general, a successful art dealer and an ordinary petty thief? Why scalp killer his victims?", "rate": 60, "genre": [], "cast": ["Rolf Lassgård", "Henrik Persson", "Siw Erixon", "Christer Fant", "Lars Melin"], "character": ["Wallander", "Stefan", "Ann-Britt Höglund", "Svedberg", "Martinsson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73637   Expand Sidetracked   (2001) User Score Overview It is autumn and the people in the otherwise peaceful small town Ystad settle down. But for Kurt Wallander broken idyll of a young woman burned to death in a cornfield.  Soon after hitting a serial killer with a series of increasingly brutal murder. What is the relationship between a retired attorney general, a successful art dealer and an ordinary petty thief? Why scalp killer his victims? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rolf Lassgård Wallander Henrik Persson Stefan Siw Erixon Ann-Britt Höglund Christer Fant Svedberg Lars Melin Martinsson Full Cast & Crew Last Season Season 1 2001 | 3 Episodes Season 1 of Sidetracked premiered on October 19, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Sidetracked. You can help by rating TV shows you've seen. Facts Original Name  Villospår Status  Ended Networks - Certification  - Type  Miniseries Original Language  Swedish Runtime  54m Homepage  - Genres No genres have been added. Keywords miniseries wallander Content Score 79 Pump it up! We're close now. Top Contributors VA 36 Viktor Andersson TB 35 TMDb Bot R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}