{"link": "https://www.themoviedb.org/tv/42910?language=en", "title": "Love & Hip Hop Atlanta", "resume": "Love & Hip Hop: Atlanta is the Atlanta based spin-off of Love & Hip Hop. It premiered on June 18, 2012, on VH1 and chronicles the lives of several women who are involved with hip hop. The second season premiered on April 22, 2013, with new cast members: Atlanta DJ and radio personality Traci Steele plus DJ Babey Drew, Traci's ex and father of their son Little Drew.", "rate": 50, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42910   Expand Love & Hip Hop Atlanta   (2012) User Score  Play Trailer Overview Love & Hip Hop: Atlanta is the Atlanta based spin-off of Love & Hip Hop. It premiered on June 18, 2012, on VH1 and chronicles the lives of several women who are involved with hip hop. The second season premiered on April 22, 2013, with new cast members: Atlanta DJ and radio personality Traci Steele plus DJ Babey Drew, Traci's ex and father of their son Little Drew. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 7 2018 | 16 Episodes Season 7 of Love & Hip Hop Atlanta premiered on March 19, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Can we talk about Karlie holding that baby?!?! Open 0 by mountaingirl\n      \n     IMDb Open 4 by  MelNichelle Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2017-03-28 Rebel 7.8    2011-01-11 Teen Mom 2 4.8    2014-05-06 Alaskan Bush People 5.4    2012-11-12 Catfish: The TV Show 6.3    2006-03-21 The Real Housewives of Orange County 5.1    2010-10-14 The Real Housewives of Beverly Hills 6.4    2014-09-09 Tyler Perry's If Loving You Is Wrong 6.8    2014-09-24 black-ish 7.0  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.vh1.com/shows/love_and_hip_hop_atlanta/ Genres Reality Keywords hip-hop atlanta spin off black woman Content Score 64 We're so close, yet so far. Top Contributors 11 Elizabeth Jennings 10 oldboy3 7 Banana C 4 Carulux  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}