{"link": "https://www.themoviedb.org/tv/6225?language=en", "title": "Method & Red", "resume": "Method & Red, sometimes written Meth and Red, is a short lived television program that ran on Fox TV from June 16 to September 15, 2004. It starred hip hop recording artists Method Man & Redman, portraying fictionalized versions of themselves who move to a predominately white upper-class suburb in New Jersey.\nFox cancelled the show in September 2004 with 4 of the 13 produced episodes remaining unaired after heated meetings with Method Man & Redman, who were not pleased with the show. The duo publicly criticized Fox several times after this.\nMethod Man was disappointed about the series for having a laugh track and Fox doing a bad job on editing. He had wanted it to be in the vein of Arrested Development, of which he is a fan.", "rate": 65, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6225   Expand Method & Red   (2004) User Score Overview Method & Red, sometimes written Meth and Red, is a short lived television program that ran on Fox TV from June 16 to September 15, 2004. It starred hip hop recording artists Method Man & Redman, portraying fictionalized versions of themselves who move to a predominately white upper-class suburb in New Jersey. Fox cancelled the show in September 2004 with 4 of the 13 produced episodes remaining unaired after heated meetings with Method Man & Redman, who were not pleased with the show. The duo publicly criticized Fox several times after this. Method Man was disappointed about the series for having a laugh track and Fox doing a bad job on editing. He had wanted it to be in the vein of Arrested Development, of which he is a fan. Featured Crew Method Man Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2004 | 13 Episodes Season 1 of Method & Red premiered on June 16, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Method & Red. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 20m Homepage  - Genres Comedy Keywords hip-hop new jersey sitcom black sitcom Content Score 64 We're so close, yet so far. Top Contributors 7 Banana 4 Евгений R 2 Rebecca 1 ᴄᴋ ᴄᴋᴎᴅ.mov  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}