{"link": "https://www.themoviedb.org/tv/10218?language=en", "title": "The Duck Factory", "resume": "The Duck Factory is a 1984 NBC television series produced by MTM Enterprises that is perhaps most notable for being Jim Carrey's first lead role in a Hollywood production.\nThe show was co-created by Allan Burns. The premiere episode introduces Skip Tarkenton, a somewhat naive and optimistic young man who has come to Hollywood looking for a job as a cartoonist. When he arrives at a low-budget animation company called Buddy Winkler Productions, he finds out Buddy Winkler has just died, and the company desperately needs new blood. So Skip gets an animation job at the firm, which is nicknamed \"The Duck Factory\" as their main cartoon is \"The Dippy Duck Show\".\nOther Duck Factory employees seen regularly on the show were man-of-a-thousand-cartoon voices Wally Wooster; comedy writer Marty Fenneman; artists Brooks Carmichael and Roland Culp, editor Andrea Lewin, and business manager Aggie Aylesworth. Buddy Winkler Productions was now owned by his young, ditzy widow, Mrs Sheree Winkler, who had been married to Buddy for all of three weeks before his death.\nThe Duck Factory lasted thirteen episodes; it premiered April 12, 1984. The show initially aired at 9:30 on Thursday nights, directly after Cheers, and replaced Buffalo Bill on NBC's schedule. Jay Tarses, an actor on The Duck Factory, had been the co-creator and executive producer of Buffalo Bill, which had its final network telecast on Thursday, April 5, 1984.", "rate": 50, "genre": ["Comedy"], "cast": ["Jack Gilford", "Jim Carrey", "Jay Tarses", "Teresa Ganzel", "Don Messick"], "character": ["Brooks Carmichael", "Skip Tarkenton", "Marty Fenneman", "Mrs. Sheree Winkler", "Wally Wooster"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10218   Expand The Duck Factory   (1984) User Score Overview The Duck Factory is a 1984 NBC television series produced by MTM Enterprises that is perhaps most notable for being Jim Carrey's first lead role in a Hollywood production. The show was co-created by Allan Burns. The premiere episode introduces Skip Tarkenton, a somewhat naive and optimistic young man who has come to Hollywood looking for a job as a cartoonist. When he arrives at a low-budget animation company called Buddy Winkler Productions, he finds out Buddy Winkler has just died, and the company desperately needs new blood. So Skip gets an animation job at the firm, which is nicknamed \"The Duck Factory\" as their main cartoon is \"The Dippy Duck Show\". Other Duck Factory employees seen regularly on the show were man-of-a-thousand-cartoon voices Wally Wooster; comedy writer Marty Fenneman; artists Brooks Carmichael and Roland Culp, editor Andrea Lewin, and business manager Aggie Aylesworth. Buddy Winkler Productions was now owned by his young, ditzy widow, Mrs Sheree Winkler, who had been married to Buddy for all of three weeks before his death. The Duck Factory lasted thirteen episodes; it premiered April 12, 1984. The show initially aired at 9:30 on Thursday nights, directly after Cheers, and replaced Buffalo Bill on NBC's schedule. Jay Tarses, an actor on The Duck Factory, had been the co-creator and executive producer of Buffalo Bill, which had its final network telecast on Thursday, April 5, 1984. Featured Crew Herbert Klynn Creator Allan Burns Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Gilford Brooks Carmichael Jim Carrey Skip Tarkenton Jay Tarses Marty Fenneman Teresa Ganzel Mrs. Sheree Winkler Don Messick Wally Wooster Full Cast & Crew Last Season Season 1 1984 | 13 Episodes Season 1 of The Duck Factory premiered on April 12, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Duck Factory. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords hollywood cartoonist Content Score 93 Almost there... Top Contributors 13 Banana D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}