{"link": "https://www.themoviedb.org/tv/43062?language=en", "title": "King David", "resume": "Our story begins in Bethlehem, an Israelite territory, in the year 1045 B.C. David is 10 years old and is preparing to herd his father Jesse’s flock of sheep. Being the youngest of seven brothers, David is tasked with being the household servant. He’s been relegated beneath his brothers because they all have the honor of being brave warriors for King Saul.", "rate": 0, "genre": [], "cast": ["Leonardo Brício"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43062   Expand King David   (2012) User Score Overview Our story begins in Bethlehem, an Israelite territory, in the year 1045 B.C. David is 10 years old and is preparing to herd his father Jesse’s flock of sheep. Being the youngest of seven brothers, David is tasked with being the household servant. He’s been relegated beneath his brothers because they all have the honor of being brave warriors for King Saul. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leonardo Brício Full Cast & Crew Last Season 1ª Temporada 2012 | 29 Episodes Season 1 of King David premiered on January 24, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on King David. You can help by rating TV shows you've seen. Facts Original Name  Rei Davi Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  - Homepage   http://entretenimento.r7.com/rei-davi/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors VF 10 Vitor Fernandes 5 franklinlizano 4 d1992 z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}