{"link": "https://www.themoviedb.org/tv/44495?language=en", "title": "Historias para no dormir", "resume": "Historias para no dormir was a horror Spanish television series written and directed by Narciso Ibáñez Serrador and broadcast from 1966 by TVE-1.", "rate": 68, "genre": ["Mystery", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44495   Expand Historias para no dormir   (1965) User Score Overview Historias para no dormir was a horror Spanish television series written and directed by Narciso Ibáñez Serrador and broadcast from 1966 by TVE-1. Featured Crew Narciso Ibáñez Serrador Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1965 | 19 Episodes Season 1 of Historias para no dormir premiered on January  1, 1965. View All Seasons Social Reviews  1 Discussions  0 A review by Milo_Jeeder  9.0 Written by  Milo_Jeeder  on February 14, 2017 We all grew up hearing the same classic horror stories written by famous authors such as Edgar Allan Poe and Ray Bradbury. Yet... we don't seem to get tired of them, do we?. Well, 'Historias para no dormir' demonstrates that even if we have already seen these stories before, that doesn't really mean that we won't find any interest in seeing them again. The main reason why this show can captivate many horror lovers nowadays, is mostly because of the beautiful display of Gothic imagery. It's a fact that sometimes it's all about the right atmosphere and imagery. Narciso Ibañez Serrador, the creato...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Historias para no dormir. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  16m Homepage   1966 Genres Mystery Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors d 8 dr9mp7 c 6 chispy 3 woodstaff 1 emicantero  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}