{"link": "https://www.themoviedb.org/tv/10914?language=en", "title": "Late World with Zach", "resume": "Late World with Zach was a television show on VH1 during the spring of 2002, starring Zach Galifianakis who appeared without his now-trademark beard for most of the show's run.\nLate World's theme song was Frank Black's \"Los Angeles\", a nod to the studio's location. The show began with a monologue, like many late night talk shows, but with Galifianakis' unique style, usually involving a piano and non-sequiturs interlaced with topical humor. After this, one or two skits starring Zach followed. One of the running skits was footage of red carpet interviews, edited later with Zach asking humorously different questions. Last, Zach met with a guest like Mathew St. Patrick, Bradley Cooper or had a musical guest, Rhett Miller. The show was canceled after nine weeks of production due to poor ratings. The series is not currently slated for DVD release. A then-unknown Kevin Federline had a small, non-speaking role in one of the show's last episodes.", "rate": 0, "genre": ["Comedy"], "cast": ["Zach Galifianakis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10914   Expand Late World with Zach User Score Overview Late World with Zach was a television show on VH1 during the spring of 2002, starring Zach Galifianakis who appeared without his now-trademark beard for most of the show's run. Late World's theme song was Frank Black's \"Los Angeles\", a nod to the studio's location. The show began with a monologue, like many late night talk shows, but with Galifianakis' unique style, usually involving a piano and non-sequiturs interlaced with topical humor. After this, one or two skits starring Zach followed. One of the running skits was footage of red carpet interviews, edited later with Zach asking humorously different questions. Last, Zach met with a guest like Mathew St. Patrick, Bradley Cooper or had a musical guest, Rhett Miller. The show was canceled after nine weeks of production due to poor ratings. The series is not currently slated for DVD release. A then-unknown Kevin Federline had a small, non-speaking role in one of the show's last episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zach Galifianakis Full Cast & Crew Last Season Season 1 2002 | 35 Episodes Season 1 of Late World with Zach premiered on March  4, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}