{"link": "https://www.themoviedb.org/tv/71592?language=en", "title": "Elizabeth I", "resume": "Elizabeth I may be remembered as the greatest monarch to rule England, but during her lifetime she was beset by enemies and hers was a life of constant battling.", "rate": 0, "genre": ["Documentary", "Drama"], "cast": ["Lily Cole", "Dan Jones", "Audrey L'Ebrellec", "Darren Bransford"], "character": ["Elizabeth I", "Himself - Presenter", "Mary, Queen of Scots", "Earl of Bothwell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71592   Expand Elizabeth I   (2017) User Score Overview Elizabeth I may be remembered as the greatest monarch to rule England, but during her lifetime she was beset by enemies and hers was a life of constant battling. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lily Cole Elizabeth I Dan Jones Himself - Presenter Audrey L'Ebrellec Mary, Queen of Scots Darren Bransford Earl of Bothwell Full Cast & Crew Last Season Season 1 2017 | 3 Episodes Season 1 of Elizabeth I premiered on May  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Elizabeth I. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.channel5.com/show/elizabeth-i/ Genres Documentary Drama Keywords queen royal family palace intrigue 16th century Content Score 86 Almost there... Top Contributors 13 Ash 9 Banana 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}