{"link": "https://www.themoviedb.org/tv/61782?language=en", "title": "Little Women: LA", "resume": "The adventures of a unique group of smart, sexy and funny girlfriends with big hearts and big personalities – who all happen to be little people. Viewers walk in their shoes as they deal with relationships, parenting, careers and the ups and downs of friendships. They laugh, cry, compete and fight with one another, but despite it all they share a special unbreakable bond.", "rate": 60, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61782   Expand Little Women: LA   (2014) User Score Overview The adventures of a unique group of smart, sexy and funny girlfriends with big hearts and big personalities – who all happen to be little people. Viewers walk in their shoes as they deal with relationships, parenting, careers and the ups and downs of friendships. They laugh, cry, compete and fight with one another, but despite it all they share a special unbreakable bond. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 7 2018 | 15 Episodes Season 7 of Little Women: LA premiered on March 21, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply The Newest LW Open 0 by Poetist\n      \n     Terra's hernias, etc. Open 1 by  blacknyellowsquid New Season - Christy's narrative Open 5 by  Poetist Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2016-01-27 Little Women: Atlanta 4.8    2011-10-21 Boss 7.7  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://www.mylifetime.com/shows/little-women-la Genres Reality Keywords women los angeles little people Content Score 56 We're so close, yet so far. Top Contributors 21 Elizabeth Jennings 14 Banana 12 szab b 11 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}