{"link": "https://www.themoviedb.org/tv/42529?language=en", "title": "Fallout: Nuka Break", "resume": "Fallout: Nuka Break is a live-action fan-made web series made by Wayside Creations and set in the Fallout video game universe. Its direct setting is derived from both Fallout 3 and Fallout: New Vegas. Nuka Break features three main characters, a \"Vault dweller, his ghoul companion, and a slave they free from New Vegas\". Along with the sets, puppets are used for some of the scenes, along with CGI for the gun battles and other scenes. The series features actor Doug Jones as a guest star, playing Mayor Conners, and voice actor Vic Mignogna as the merchant/narrator.\nThe series was originally conceived as a film titled Fallout: Nuka Break - The Movie, which was released in early 2011 on YouTube. The film was so popular that Wayside Creations, a non-profit made up of \"a team of Fallout fans\", decided to turn it into a full miniseries, with the first episode being released in September 2011. A second season, funded via Kickstarter, is currently in production.", "rate": 63, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Zack Finfrock", "Aaron Giles", "Tybee Diskin"], "character": ["Twig", "Ben", "Scarlett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42529   Expand Fallout: Nuka Break   (2011) User Score Overview Fallout: Nuka Break is a live-action fan-made web series made by Wayside Creations and set in the Fallout video game universe. Its direct setting is derived from both Fallout 3 and Fallout: New Vegas. Nuka Break features three main characters, a \"Vault dweller, his ghoul companion, and a slave they free from New Vegas\". Along with the sets, puppets are used for some of the scenes, along with CGI for the gun battles and other scenes. The series features actor Doug Jones as a guest star, playing Mayor Conners, and voice actor Vic Mignogna as the merchant/narrator. The series was originally conceived as a film titled Fallout: Nuka Break - The Movie, which was released in early 2011 on YouTube. The film was so popular that Wayside Creations, a non-profit made up of \"a team of Fallout fans\", decided to turn it into a full miniseries, with the first episode being released in September 2011. A second season, funded via Kickstarter, is currently in production. Featured Crew Zack Finfrock Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zack Finfrock Twig Aaron Giles Ben Tybee Diskin Scarlett Full Cast & Crew Last Season Season 2 2013 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2006-10-01 Dexter 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://www.vtfilms.com/nukabreak/ Genres Action & Adventure Comedy Keywords fallout Content Score 64 We're so close, yet so far. Top Contributors 32 schnetf LB 19 L. Breede z 4 zurman1 R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}