{"link": "https://www.themoviedb.org/tv/65655?language=en", "title": "Red Band", "resume": "Braccialetti Rossi is a story of friendship, values and life, a modern tale about the power of sharing, where protagonists are six young guys that the destiny brings together within a hospital. While laughing, playing, crying and gets excited, as only young people can do, a group is created taking the center of the story.", "rate": 58, "genre": ["Drama"], "cast": ["Carlotta Natoli", "Carmine Buschini", "Raffaele Vannoli", "Niccolò Senni", "Aurora Ruffino"], "character": ["Dottoressa Lisandri", "Leo", "Ulisse", "Dottor Carlo", "Cris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65655   Expand Red Band   (2014) User Score  Play Trailer Overview Braccialetti Rossi is a story of friendship, values and life, a modern tale about the power of sharing, where protagonists are six young guys that the destiny brings together within a hospital. While laughing, playing, crying and gets excited, as only young people can do, a group is created taking the center of the story. Featured Crew Guido Simonetti Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carlotta Natoli Dottoressa Lisandri Carmine Buschini Leo Raffaele Vannoli Ulisse Niccolò Senni Dottor Carlo Aurora Ruffino Cris Full Cast & Crew Last Season Season 1 2014 | 6 Episodes Season 1 of Red Band premiered on January 26, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Red Band. You can help by rating TV shows you've seen. Facts Original Name  Braccialetti rossi Status  In Production Network Certification  - Type  Reality Original Language  Italian Runtime  100m Homepage   http://www.braccialettirossi.rai.it/dl/siti/Page-7d4691ae-de52-4a3c-8d0c-836bc7250722.html Genres Drama Keywords braccialetti rossi Content Score 100 Yes! Looking good! Top Contributors 32 matt547 E 7 Edytor 2 tigru89 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}