{"link": "https://www.themoviedb.org/tv/1067?language=en", "title": "Phyllis", "resume": "Phyllis is an American television sitcom that aired on CBS from September 8, 1975 to March 13, 1977.\nCreated by Ed Weinberger and Stan Daniels. it was the second spin-off series from The Mary Tyler Moore Show. The show starred Cloris Leachman as Phyllis Lindstrom, who was previously Mary Richards' landlady on The Mary Tyler Moore Show. In the new series, Phyllis and her daughter Bess Lindstrom moved from Minneapolis to San Francisco, after the death of her husband, Dr. Lars Lindstrom. It was revealed that San Francisco was Phyllis and Lars' original hometown, prior to their moving to Minneapolis, and that his mother and stepfather still resided there.", "rate": 65, "genre": ["Comedy"], "cast": ["Cloris Leachman", "Henry Jones", "Jane Rose"], "character": ["Phyllis Lindstrom", "Judge Jonathan Dexter", "Audrey Dexter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1067   Expand Phyllis   (1975) User Score Overview Phyllis is an American television sitcom that aired on CBS from September 8, 1975 to March 13, 1977. Created by Ed Weinberger and Stan Daniels. it was the second spin-off series from The Mary Tyler Moore Show. The show starred Cloris Leachman as Phyllis Lindstrom, who was previously Mary Richards' landlady on The Mary Tyler Moore Show. In the new series, Phyllis and her daughter Bess Lindstrom moved from Minneapolis to San Francisco, after the death of her husband, Dr. Lars Lindstrom. It was revealed that San Francisco was Phyllis and Lars' original hometown, prior to their moving to Minneapolis, and that his mother and stepfather still resided there. Featured Crew Stan Daniels Creator Ed. Weinberger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cloris Leachman Phyllis Lindstrom Henry Jones Judge Jonathan Dexter Jane Rose Audrey Dexter Full Cast & Crew Last Season Season 2 1976 | 24 Episodes Season 2 of Phyllis premiered on September 20, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Phyllis. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Comedy Keywords san francisco single mother in-laws sitcom Content Score 64 We're so close, yet so far. Top Contributors 19 Steve 5 Banana T 3 TheCritic  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}