{"link": "https://www.themoviedb.org/tv/18233?language=en", "title": "Anmitsu Hime: From Amakara Castle", "resume": "Anmitsu Hime is a manga series by Shosuke Kurakane.\nThe story was originally produced in 1949-1955.\nIn 1986-1987, Izumi Takemoto retold the original manga series, releasing it under the same title.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Animation", "Comedy"], "cast": ["Mami Koyama", "Hisako Kyouda", "Jōji Yanami", "Kei Tomiyama", "Kumiko Nishihara"], "character": ["Anmitsu Hime", "Shibucha", "Hikozaemon Abekawa", "Gen'ai Hiraga", "Kinako"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18233   Expand Anmitsu Hime: From Amakara Castle   (1986) User Score Overview Anmitsu Hime is a manga series by Shosuke Kurakane. The story was originally produced in 1949-1955. In 1986-1987, Izumi Takemoto retold the original manga series, releasing it under the same title. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mami Koyama Anmitsu Hime Hisako Kyouda Shibucha Jōji Yanami Hikozaemon Abekawa Kei Tomiyama Gen'ai Hiraga Kumiko Nishihara Kinako Full Cast & Crew Last Season Season 1 1986 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Anmitsu Hime: From Amakara Castle. You can help by rating TV shows you've seen. Facts Original Name  あんみつ姫 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Animation Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 45 BrerFox t 16 tmdb983464 3 TheDerpMan t🇧 3 ticao2 🇧🇷 pt-BR  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}