{"link": "https://www.themoviedb.org/tv/14672?language=en", "title": "Captain Nice", "resume": "Carter Nash was a chemist in a police department who discovered a liquid which could turn him into Captain Nice, an odd sort of superhero: very shy and dominated by his mother. Captain Nice flew (he feared heights) in his tattered leotards, fighting bad guys because his mother told him to do so.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["William Daniels", "Alice Ghostley", "Ann Prentiss", "Liam Dunn", "Bill Zuckert"], "character": ["Carter Nash", "Mrs. Nash", "Candy Kane", "Mayor Finney", "Chief Segal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14672   Expand Captain Nice   (1967) User Score Overview Carter Nash was a chemist in a police department who discovered a liquid which could turn him into Captain Nice, an odd sort of superhero: very shy and dominated by his mother. Captain Nice flew (he feared heights) in his tattered leotards, fighting bad guys because his mother told him to do so. Featured Crew Buck Henry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Daniels Carter Nash Alice Ghostley Mrs. Nash Ann Prentiss Candy Kane Liam Dunn Mayor Finney Bill Zuckert Chief Segal Full Cast & Crew Last Season Season 1 1967 | 15 Episodes Season 1 of Captain Nice premiered on January  9, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Captain Nice. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords superhero scientist Content Score 79 Pump it up! We're close now. Top Contributors 9 Banana 5 Elizabeth Jennings TB 2 TMDb Bot 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}