{"link": "https://www.themoviedb.org/tv/70530?language=en", "title": "Adam Carolla and Friends Build Stuff Live", "resume": "Acclaimed comedian and master carpenter Adam Carolla builds stuff with some of his big name Hollywood friends. He also tackles home improvement projects via social media, making us laugh the whole way. Since the show is live, anything could happen.", "rate": 27, "genre": ["Comedy", "Talk"], "cast": ["Adam Carolla"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70530   Expand Adam Carolla and Friends Build Stuff Live   (2017) User Score  Play Trailer Overview Acclaimed comedian and master carpenter Adam Carolla builds stuff with some of his big name Hollywood friends. He also tackles home improvement projects via social media, making us laugh the whole way. Since the show is live, anything could happen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Carolla Himself - Host Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Adam Carolla and Friends Build Stuff Live premiered on March 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Adam Carolla and Friends Build Stuff Live. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  - Homepage   http://www.spike.com/shows/adam-carolla-and-friends-build-stuff-live Genres Comedy Talk Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 29 Elizabeth Jennings D 6 Derek.Jo.Lee88 TB 1 TMDb Bot 1 hammahmed  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}