{"link": "https://www.themoviedb.org/tv/1855?language=en", "title": "Star Trek: Voyager", "resume": "Pulled to the far side of the galaxy, where the Federation is 75 years away at maximum warp speed, a Starfleet ship must cooperate with Maquis rebels to find a way home.", "rate": 78, "genre": ["Sci-Fi", "Fantasy", "Drama", "Action", "Adventure"], "cast": ["Kate Mulgrew", "Robert Beltran", "Jeri Ryan", "Roxann Dawson", "Robert Duncan McNeill"], "character": ["Kathryn Janeway", "Chakotay", "Seven of Nine", "B'Elanna Torres", "Tom Paris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1855   Expand Star Trek: Voyager   (1995) User Score  Play Trailer Overview Pulled to the far side of the galaxy, where the Federation is 75 years away at maximum warp speed, a Starfleet ship must cooperate with Maquis rebels to find a way home. Featured Crew Michael Piller Creator Jeri Taylor Creator Rick Berman Creator Gene Roddenberry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  21 Content Issues  5 Images Backdrops  21 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Mulgrew Kathryn Janeway Robert Beltran Chakotay Jeri Ryan Seven of Nine Roxann Dawson B'Elanna Torres Robert Duncan McNeill Tom Paris Full Cast & Crew Last Season Season 7 2000 | 26 Episodes Season 7 of Star Trek: Voyager premiered on October  4, 2000. View All Seasons Social Reviews  1 Discussions  26 A review by Hydro Philic  8.0 Written by  Hydro Philic  on February 28, 2017 Star Trek Voyager follows the experience of multiple factions (Federation, Maquis, Borg, etc.) who are stuck together on a solitary Federation ship, named Voyager, in a desperate attempt to return home (the Alpha quadrant [in particular, Earth]) after being stranded 75,000 light-years from home (approximately 70 years of \"maximum warp-drive\", based on the original warp-engine of Voyager). At the beginning, the captain of Voyager (Janeway) chooses to save a species known as the \"Ocampan\", but this decision strands the Voyager/Maquis crew in the Delta Quadrant (many, many years from home).  Be...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  21 Posters  8 Recommendations   1993-01-03 Star Trek: Deep Space Nine 7.8    2001-09-26 Star Trek: Enterprise 7.4    1987-09-28 Star Trek: The Next Generation 8.2    1966-09-08 Star Trek 8.1    1994-01-26 Babylon 5 8.1    1997-07-27 Stargate SG-1 8.0    2004-07-15 Stargate Atlantis 7.8    2004-10-18 Battlestar Galactica 8.1  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://www.startrek.com/page/star-trek-voyager Genres Sci-Fi & Fantasy Drama Action & Adventure Keywords time warp hologram space travel alien spaceship alien planet alien contact space opera trapped in space distant  planet Content Score 100 Yes! Looking good! Top Contributors 18 Dave Andreoli 17 niqo19 AS 15 Alexandre Simões de Carvalho a 13 alexcel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}