{"link": "https://www.themoviedb.org/tv/7695?language=en", "title": "In the Name of Love", "resume": "En Nombre Del Amor is a Mexican telenovela produced by Televisa. It is a remake of Cadenas de Amargura. En Nombre Del Amor was produced by Carlos Moreno, and filming began on August 4, 2008. It premiered in the United States July 7, 2009 on Univision and ended its run on March 7, 2010 in a two-hour grand finale on a Sunday.\nStarring for Allison Lozz and Sebastián Zurita, as adult stars Victoria Ruffo, Arturo Peniche with Leticia Calderón as the villain protagonist and main villain, co-starring for Laura Flores, Alfredo Adame, Víctor Cámara, and the participation of Altair Jarabo as youth antagonist.", "rate": 90, "genre": ["Drama"], "cast": ["Allisson Lozz", "Sebastián Zurita", "Leticia Calderón", "Victoria Ruffo", "Arturo Peniche"], "character": ["Paloma Espinoza de los Monteros", "Emiliano Sáenz", "Carlota Espinoza de los Monteros", "Macarena Espinoza de los Monteros", "Padre Juan Cristóbal Gamboa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7695   Expand In the Name of Love   (2008) User Score Overview En Nombre Del Amor is a Mexican telenovela produced by Televisa. It is a remake of Cadenas de Amargura. En Nombre Del Amor was produced by Carlos Moreno, and filming began on August 4, 2008. It premiered in the United States July 7, 2009 on Univision and ended its run on March 7, 2010 in a two-hour grand finale on a Sunday. Starring for Allison Lozz and Sebastián Zurita, as adult stars Victoria Ruffo, Arturo Peniche with Leticia Calderón as the villain protagonist and main villain, co-starring for Laura Flores, Alfredo Adame, Víctor Cámara, and the participation of Altair Jarabo as youth antagonist. Featured Crew Martha Carrillo Creator Cristina Garcia Creator Cuauhtémoc Blanco Creator María del Carmen Peña Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Allisson Lozz Paloma Espinoza de los Monteros Sebastián Zurita Emiliano Sáenz Leticia Calderón Carlota Espinoza de los Monteros Victoria Ruffo Macarena Espinoza de los Monteros Arturo Peniche Padre Juan Cristóbal Gamboa Full Cast & Crew Last Season Season 1 2008 | 170 Episodes Season 1 of In the Name of Love premiered on October 13, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on In the Name of Love. You can help by rating TV shows you've seen. Facts Original Name  En nombre del amor Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www2.esmas.com/en-nombre-del-amor/ Genres Drama Keywords telenovela Content Score 100 Yes! Looking good! Top Contributors 41 Amanda s 28 shiff7 V 5 Vaine 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}