{"link": "https://www.themoviedb.org/tv/65957?language=en", "title": "Battery", "resume": "Meet Harada Takumi – not even in junior high and he’s the best pitcher in the region, although he’s frustrated and ready to give up, because he can’t find a catcher who is good enough to keep up with how he pitches in this backwater town his family has just moved to. Then along comes a kid named Nagakura Gou…", "rate": 55, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65957   Expand Battery   (2016) User Score  Play Trailer Overview Meet Harada Takumi – not even in junior high and he’s the best pitcher in the region, although he’s frustrated and ready to give up, because he can’t find a catcher who is good enough to keep up with how he pitches in this backwater town his family has just moved to. Then along comes a kid named Nagakura Gou… Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 11 Episodes Season 1 of Battery premiered on July 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Battery. You can help by rating TV shows you've seen. Facts Original Name  バッテリー Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://battery-anime.com/ Genres Animation Keywords based on novel or book sport anime Content Score 64 We're so close, yet so far. Top Contributors 18 sp1ti J 9 JohnyB0y 4 Oriknox m 4 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}