{"link": "https://www.themoviedb.org/tv/13782?language=en", "title": "Timecop", "resume": "Timecop is an American science fiction television series. The show was broadcast on the ABC network and first aired in 1997. The series is based on the Timecop movie and the \"Time Cop\" feature which had appeared in the comic book series Dark Horse Comics. Thirteen episodes of the series were ordered, but only nine episodes aired.", "rate": 70, "genre": [], "cast": ["Ted King", "Kurt Fuller", "Don Stark", "Cristi Conaway"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13782   Expand Timecop   (1997) User Score Overview Timecop is an American science fiction television series. The show was broadcast on the ABC network and first aired in 1997. The series is based on the Timecop movie and the \"Time Cop\" feature which had appeared in the comic book series Dark Horse Comics. Thirteen episodes of the series were ordered, but only nine episodes aired. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ted King Kurt Fuller Don Stark Cristi Conaway Full Cast & Crew Last Season Season 1 1997 | 9 Episodes Season 1 of Timecop premiered on September 22, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Timecop. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors s 3 speedycars L 1 Law  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}