{"link": "https://www.themoviedb.org/tv/6304?language=en", "title": "The Grimleys", "resume": "The Grimleys is a nostalgic comedy-drama television series set on a council estate in Dudley, West Midlands, England in the mid-1970s. It was first broadcast by Granada TV for ITV in 1999, following a pilot in 1997, and concluded in 2001 after three series.\nThe show was written by Jed Mercurio, who had trained as a doctor and whose first series, Cardiac Arrest - written under the pseudonym 'John MacUre' - had attracted critical plaudits for its dark portrayal of life in a disintegrating British National Health Service.\nThe filming of the school took place in Salford, Buile Hill High, Hope High and Pendleton College, although the filming of the characters' homes actually took place some 80 miles away in the Dudley area itself; around Parkes Hall Road on the Dudley-Sedgley border.", "rate": 90, "genre": ["Comedy"], "cast": ["Amanda Holden", "Jan Ravens", "Craig Kelly", "Brian Conley", "Ryan Cartwright"], "character": ["Geraldine Titley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6304   Expand The Grimleys   (1999) User Score Overview The Grimleys is a nostalgic comedy-drama television series set on a council estate in Dudley, West Midlands, England in the mid-1970s. It was first broadcast by Granada TV for ITV in 1999, following a pilot in 1997, and concluded in 2001 after three series. The show was written by Jed Mercurio, who had trained as a doctor and whose first series, Cardiac Arrest - written under the pseudonym 'John MacUre' - had attracted critical plaudits for its dark portrayal of life in a disintegrating British National Health Service. The filming of the school took place in Salford, Buile Hill High, Hope High and Pendleton College, although the filming of the characters' homes actually took place some 80 miles away in the Dudley area itself; around Parkes Hall Road on the Dudley-Sedgley border. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Holden Geraldine Titley Jan Ravens Craig Kelly Brian Conley Ryan Cartwright Full Cast & Crew Last Season Season 3 2001 | 6 Episodes Season 3 of The Grimleys premiered on January 22, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Grimleys. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords northern england 1970s school british humour Content Score 71 Just a little bit more... Top Contributors O 6 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}