{"link": "https://www.themoviedb.org/tv/48469?language=en", "title": "The King of Dramas", "resume": "A satirical dramedy about what goes on behind the scenes in making a TV drama.", "rate": 60, "genre": ["Comedy", "Drama"], "cast": ["Kim Myung-min", "Jung Ryeo-won", "Choi Si-won", "Jeong Man-sik", "Oh Ji-eun"], "character": ["Anthony Kim", "Lee Go-eun", "Kang Hyun-min", "Oh Jin-wan", "Sung Min-ah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48469   Expand The King of Dramas   (2012) User Score Overview A satirical dramedy about what goes on behind the scenes in making a TV drama. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Myung-min Anthony Kim Jung Ryeo-won Lee Go-eun Choi Si-won Kang Hyun-min Jeong Man-sik Oh Jin-wan Oh Ji-eun Sung Min-ah Full Cast & Crew Last Season Season 1 2012 | 18 Episodes Season 1 of The King of Dramas premiered on November  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The King of Dramas. You can help by rating TV shows you've seen. Facts Original Name  드라마의 제왕 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://wizard2.sbs.co.kr/dramaking/ Genres Comedy Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors M 23 Maria180493 CM 6 Cherche Moi z 5 zurman1 S 3 Sergey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}