{"link": "https://www.themoviedb.org/tv/3940?language=en", "title": "Judge Judy", "resume": "Judge Judy is an American arbitration-based reality court show presided over by retired Manhattan Family Court Judge Judith Sheindlin. The show features Sheindlin adjudicating real-life small claims disputes within a simulated courtroom set. All parties involved must sign contracts, agreeing to arbitration under Sheindlin. The series is in first-run syndication and distributed by CBS Television Distribution.\nJudge Judy, which premiered on September 16, 1996, reportedly revitalized the court show genre. Only two other arbitration-based reality court shows preceded it, The People's Court and Jones and Jury. Sheindlin has been credited with introducing the \"tough\" adjudicating approach into the judicial genre, which has led to several imitators. The two court shows that outnumber Judge Judy's seasons, The People's Court and Divorce Court, have both lasted via multiple lives of production and shifting arbiters, making Sheindlin's span as a television arbiter the longest.\nBy 2011, Judge Judy had been nominated 14 consecutive years for Daytime Emmy Awards without ever winning. On June 14, 2013, however, Judge Judy won its first Daytime Emmy for Outstanding Legal/Courtroom Program on its 15th nomination. It is the first long-running, highly-rated court show to win an Emmy.", "rate": 51, "genre": ["Reality", "Crime"], "cast": ["Judith Sheindlin", "Petri Hawkins-Byrd"], "character": ["Judge", "Bailiff"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3940   Expand Judge Judy   (1996) User Score Overview Judge Judy is an American arbitration-based reality court show presided over by retired Manhattan Family Court Judge Judith Sheindlin. The show features Sheindlin adjudicating real-life small claims disputes within a simulated courtroom set. All parties involved must sign contracts, agreeing to arbitration under Sheindlin. The series is in first-run syndication and distributed by CBS Television Distribution. Judge Judy, which premiered on September 16, 1996, reportedly revitalized the court show genre. Only two other arbitration-based reality court shows preceded it, The People's Court and Jones and Jury. Sheindlin has been credited with introducing the \"tough\" adjudicating approach into the judicial genre, which has led to several imitators. The two court shows that outnumber Judge Judy's seasons, The People's Court and Divorce Court, have both lasted via multiple lives of production and shifting arbiters, making Sheindlin's span as a television arbiter the longest. By 2011, Judge Judy had been nominated 14 consecutive years for Daytime Emmy Awards without ever winning. On June 14, 2013, however, Judge Judy won its first Daytime Emmy for Outstanding Legal/Courtroom Program on its 15th nomination. It is the first long-running, highly-rated court show to win an Emmy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Judith Sheindlin Judge Petri Hawkins-Byrd Bailiff Full Cast & Crew Last Season Season 22 — | 2 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply SB Terrible decision Open 2 by  Strange Bedfellows Woman who posted a gay male ad on Craigslist Open 1 by  TheShredder Anyone from imdb Open 7 by  AusFem Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1991-09-09 Maury 3.8    1987-01-20 Unsolved Mysteries 7.4    1994-09-21 Touched by an Angel 5.3    1963-09-18 The Patty Duke Show 5.6    1979-09-13 Benson 7.2    1994-09-18 Chicago Hope 7.3    1988-11-14 Murphy Brown 6.5    1958-09-06 Wanted: Dead or Alive 7.6  Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Reality Original Language  English Runtime  22m Homepage   http://www.judgejudy.com/ Genres Reality Crime Keywords court court show Content Score 56 We're so close, yet so far. Top Contributors F 35 FrankTMDB TB 14 TMDb Bot D 10 Damienlee69 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}