{"link": "https://www.themoviedb.org/tv/7120?language=en", "title": "Perfect World", "resume": "Perfect World is a television show that was first shown on BBC television in the UK from 25 February 2000 to 25 June 2001. It is set around the life of Bob Slay, an obnoxious, lazy and amoral phony marketing executive for a leading toiletries company. Yet Bob has a swish office, an attractive girlfriend and is well regarded by his manager.\nThe television show was written by Mark Grant and Mark Chapman who was a co-writer for the second series and provided additional material for the first series. Mark Chapman also directed the first series and produced both series with Nick Wood directing the second. The show's other producer was Lucy Robinson and had executive producers Danielle Lux and Charles Brand.", "rate": 100, "genre": [], "cast": ["Michael Cochrane", "Nina Wadia", "Derren Litten", "Paul Kaye", "Tasha de Vasconcelos"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7120   Expand Perfect World   (2000) User Score Overview Perfect World is a television show that was first shown on BBC television in the UK from 25 February 2000 to 25 June 2001. It is set around the life of Bob Slay, an obnoxious, lazy and amoral phony marketing executive for a leading toiletries company. Yet Bob has a swish office, an attractive girlfriend and is well regarded by his manager. The television show was written by Mark Grant and Mark Chapman who was a co-writer for the second series and provided additional material for the first series. Mark Chapman also directed the first series and produced both series with Nick Wood directing the second. The show's other producer was Lucy Robinson and had executive producers Danielle Lux and Charles Brand. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Cochrane Nina Wadia Derren Litten Paul Kaye Tasha de Vasconcelos Full Cast & Crew Last Season Season 2 2001 | 7 Episodes Season 2 of Perfect World premiered on May 14, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Perfect World. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}