{"link": "https://www.themoviedb.org/tv/40285?language=en", "title": "Killing Time", "resume": "Killing Time is an Australian television drama series on TV1 subscription television channel which first screened in 2011. It is based on the true story of disgraced lawyer Andrew Fraser. In New Zealand it screens on Prime Television.\nThe ten part series is written by Ian David, Mac Gudgeon, Katherine Thompson and Shaun Grant. The executive producer is Jason Stephens. The series was initially due to screen in 2010 but was deferred due to strong violence and horror content scenes of the mini-series, which jeopardised a series of gangland trials that were in progress.", "rate": 0, "genre": ["Drama"], "cast": ["David Wenham", "Colin Friels", "Diana Glenn", "Kris McQuade", "Richard Cawthorne"], "character": ["Andrew Fraser"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40285   Expand Killing Time   (2011) User Score Overview Killing Time is an Australian television drama series on TV1 subscription television channel which first screened in 2011. It is based on the true story of disgraced lawyer Andrew Fraser. In New Zealand it screens on Prime Television. The ten part series is written by Ian David, Mac Gudgeon, Katherine Thompson and Shaun Grant. The executive producer is Jason Stephens. The series was initially due to screen in 2010 but was deferred due to strong violence and horror content scenes of the mini-series, which jeopardised a series of gangland trials that were in progress. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Wenham Andrew Fraser Colin Friels Diana Glenn Kris McQuade Richard Cawthorne Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of Killing Time premiered on April 12, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Killing Time. You can help by rating TV shows you've seen. Facts Status  Ended Network TV1 Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 5 zurman1 4 efeka 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}