{"link": "https://www.themoviedb.org/tv/29421?language=en", "title": "Number 10", "resume": "Drama series about the private lives of seven British prime ministers who lived in Number 10 Downing Street between the 1780s and the 1920s: William Pitt the Younger, the Duke of Wellington (Arthur Wellesley), Benjamin Disraeli, William Ewart Gladstone, David Lloyd-George, Herbert Henry Asquith and James Ramsay MacDonald.", "rate": 0, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29421   Expand Number 10   (1983) User Score Overview Drama series about the private lives of seven British prime ministers who lived in Number 10 Downing Street between the 1780s and the 1920s: William Pitt the Younger, the Duke of Wellington (Arthur Wellesley), Benjamin Disraeli, William Ewart Gladstone, David Lloyd-George, Herbert Henry Asquith and James Ramsay MacDonald. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Miniseries — | 7 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Number 10. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  55m Homepage   https://itvstudios.com/programmes/number-10 Genres Drama Keywords miniseries british prime minister Content Score 56 We're so close, yet so far. Top Contributors R 12 Rebecca TB 5 TMDb Bot 1 kcdh t 1 tmdb15589237  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}