{"link": "https://www.themoviedb.org/tv/2687?language=en", "title": "Mister Sterling", "resume": "Mister Sterling is an American television serial drama created by Lawrence O'Donnell that ran from January to March in 2003. It starred Josh Brolin as an idealistic United States Senator, and featured Audra McDonald, William Russ, David Noroña, and James Whitmore as members of his staff. Despite mostly positive reviews, the show, which aired on NBC on Friday nights, was cancelled after 10 episodes after the show only ranked 58th in the yearly ratings\nAlthough it had numerous similarities to The West Wing in style and tone, it was not set in the same universe as O'Donnell's other political show. It is unknown if a cross-over would have ever occurred had Mister Sterling not been cancelled; however Steven Culp played presidential aspirant Sen. Ron Garland on Mister Sterling and House Speaker Jeff Haffley on The West Wing, and Democrats appeared to be in the majority in the US Senate on Mr Sterling, while in The West Wing consistent Republican control of both Houses of Congress was a key plot point.\nJames Whitmore was nominated for a 2003 Emmy Award for Outstanding Guest Actor in a Drama Series for playing former Governor Bill Sterling, the senator's father.", "rate": 75, "genre": ["Drama", "War", "Politics"], "cast": ["Josh Brolin", "David Norona", "Audra McDonald", "William Russ", "James Whitmore"], "character": ["Bill Sterling"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2687   Expand Mister Sterling   (2003) User Score Overview Mister Sterling is an American television serial drama created by Lawrence O'Donnell that ran from January to March in 2003. It starred Josh Brolin as an idealistic United States Senator, and featured Audra McDonald, William Russ, David Noroña, and James Whitmore as members of his staff. Despite mostly positive reviews, the show, which aired on NBC on Friday nights, was cancelled after 10 episodes after the show only ranked 58th in the yearly ratings Although it had numerous similarities to The West Wing in style and tone, it was not set in the same universe as O'Donnell's other political show. It is unknown if a cross-over would have ever occurred had Mister Sterling not been cancelled; however Steven Culp played presidential aspirant Sen. Ron Garland on Mister Sterling and House Speaker Jeff Haffley on The West Wing, and Democrats appeared to be in the majority in the US Senate on Mr Sterling, while in The West Wing consistent Republican control of both Houses of Congress was a key plot point. James Whitmore was nominated for a 2003 Emmy Award for Outstanding Guest Actor in a Drama Series for playing former Governor Bill Sterling, the senator's father. Featured Crew Lawrence O'Donnell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Brolin Bill Sterling David Norona Audra McDonald William Russ James Whitmore Full Cast & Crew Last Season Season 1 2003 | 10 Episodes Season 1 of Mister Sterling premiered on January 10, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mister Sterling. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama War & Politics Keywords politics u.s. senator usa politics Content Score 79 Pump it up! We're close now. Top Contributors 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}