{"link": "https://www.themoviedb.org/tv/39537?language=en", "title": "Love Keeps Going", "resume": "Love Keeps Going is a 2011 Taiwanese drama starring Cyndi Wang, Mike He and Eli Shih. It is based on Taiwanese novel, Wang's Love Song.\nIt was first broadcast in Taiwan on free-to-air China Television from 5 June 2011, every Sunday at 22:00 to 23:30 and on cable TV Gala Television Variety Show/CH 28 on 11 June 2011, every Sunday at 21:00 to 22:30. The premiere episode on CTV achieved an average rating of 1.84.", "rate": 60, "genre": ["Comedy", "Romance"], "cast": ["Eli Shih", "Mike He", "Cyndi Wang"], "character": ["Han Yi Feng", "Han Yi Lie", "Cha Mei Le"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39537   Expand Love Keeps Going   (2011) User Score Overview Love Keeps Going is a 2011 Taiwanese drama starring Cyndi Wang, Mike He and Eli Shih. It is based on Taiwanese novel, Wang's Love Song. It was first broadcast in Taiwan on free-to-air China Television from 5 June 2011, every Sunday at 22:00 to 23:30 and on cable TV Gala Television Variety Show/CH 28 on 11 June 2011, every Sunday at 21:00 to 22:30. The premiere episode on CTV achieved an average rating of 1.84. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eli Shih Han Yi Feng Mike He Han Yi Lie Cyndi Wang Cha Mei Le Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Love Keeps Going premiered on June  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love Keeps Going. You can help by rating TV shows you've seen. Facts Original Name  美樂。加油 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://www.gtv.com.tw/Program/S051420110118U/index.html Genres Comedy Romance Keywords taiwanese Content Score 56 We're so close, yet so far. Top Contributors M 14 Maria180493 1 helloskies  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}