{"link": "https://www.themoviedb.org/tv/11609?language=en", "title": "Secret Agent Man", "resume": "Secret Agent Man is a spy-fi television series that aired on UPN in 2000.\nThe series, created by writer Richard Regen, starred Costas Mandylor as Monk, a gallivanting secret agent, who was one of a team of agents that included Holliday, played by Dina Meyer and Davis, played by Dondre Whitfield. The team reported to Brubeck, played by Paul Guilfoyle. The frequent guest villain is the former agent Prima, played by Musetta Vander.\nAll the lead characters share the last names of jazz musicians Thelonious Monk, Billie Holiday, Miles Davis, and Dave Brubeck.\nThe series used an updated version of the 1960s Johnny Rivers hit, \"Secret Agent Man\", performed by Supreme Beings of Leisure, for its theme song. Because the original version of this song was also used as the theme song for American broadcasts of another television series, the 1960s British TV series, Danger Man, there were some mistaken impressions that this series was somehow a spin off or remake of the earlier program, but other than the theme song, no connections were made evident.\nOnly 12 episodes were broadcast before the series was cancelled due to poor ratings.", "rate": 80, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Dina Meyer", "Costas Mandylor", "Dondre Whitfield", "Musetta Vander", "Paul Guilfoyle"], "character": ["Holiday"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11609   Expand Secret Agent Man   (2000) User Score Overview Secret Agent Man is a spy-fi television series that aired on UPN in 2000. The series, created by writer Richard Regen, starred Costas Mandylor as Monk, a gallivanting secret agent, who was one of a team of agents that included Holliday, played by Dina Meyer and Davis, played by Dondre Whitfield. The team reported to Brubeck, played by Paul Guilfoyle. The frequent guest villain is the former agent Prima, played by Musetta Vander. All the lead characters share the last names of jazz musicians Thelonious Monk, Billie Holiday, Miles Davis, and Dave Brubeck. The series used an updated version of the 1960s Johnny Rivers hit, \"Secret Agent Man\", performed by Supreme Beings of Leisure, for its theme song. Because the original version of this song was also used as the theme song for American broadcasts of another television series, the 1960s British TV series, Danger Man, there were some mistaken impressions that this series was somehow a spin off or remake of the earlier program, but other than the theme song, no connections were made evident. Only 12 episodes were broadcast before the series was cancelled due to poor ratings. Featured Crew Barry Sonnenfeld Creator Barry Josephson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dina Meyer Holiday Costas Mandylor Dondre Whitfield Musetta Vander Paul Guilfoyle Full Cast & Crew Last Season Season 1 2000 | 12 Episodes Season 1 of Secret Agent Man premiered on March  7, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Secret Agent Man. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords spy secret agent Content Score 93 Almost there... Top Contributors 6 Banana CM 5 Cherche Moi 3 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}