{"link": "https://www.themoviedb.org/tv/31074?language=en", "title": "Secret Girlfriend", "resume": "Secret Girlfriend is an American television series which aired in October and November 2009 on Comedy Central. The show features the viewer as the \"star\" of a dating satire, with the show's actors addressing the camera as if it were the lead character.\nSecret Girlfriend originated as a Web series created by Jay Rondot and Ross Novie, who are executive producers on the TV adaptation. The showrunner is Eric Weinberg, also an executive producer. The series was recast for television. Each half-hour episode includes two eleven-minute segments.\nOn April 29, 2010, though no media websites officially announced the show's cancelation, Novie announced via Twitter that there would be no second season.", "rate": 57, "genre": ["Comedy"], "cast": ["Taylor Cole", "Italia Ricci", "Derek Miller", "Michael Blaiklock", "Alexis Krause"], "character": ["Martina the Hot Neighbor", "Sasha", "Phil", "Sam", "Mandy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31074   Expand Secret Girlfriend   (2009) User Score Overview Secret Girlfriend is an American television series which aired in October and November 2009 on Comedy Central. The show features the viewer as the \"star\" of a dating satire, with the show's actors addressing the camera as if it were the lead character. Secret Girlfriend originated as a Web series created by Jay Rondot and Ross Novie, who are executive producers on the TV adaptation. The showrunner is Eric Weinberg, also an executive producer. The series was recast for television. Each half-hour episode includes two eleven-minute segments. On April 29, 2010, though no media websites officially announced the show's cancelation, Novie announced via Twitter that there would be no second season. Featured Crew Ross Novie Creator Jay Rondot Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Taylor Cole Martina the Hot Neighbor Italia Ricci Sasha Derek Miller Phil Michael Blaiklock Sam Alexis Krause Mandy Full Cast & Crew Last Season Season 1 2009 | 12 Episodes Season 1 of Secret Girlfriend premiered on October  7, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2014-04-09 Deadbeat 6.2    2007-09-25 Reaper 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.comedycentral.com/shows/secret_girlfriend/index.jhtml Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors N 7 Nadine D 2 Daniel 1 bigyellowbird s 1 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}