{"link": "https://www.themoviedb.org/tv/648?language=en", "title": "The Incredible Hulk", "resume": "The Incredible Hulk is an American television series based on the Marvel Comics character, the Hulk. The series aired on the CBS television network and starred Bill Bixby as David Banner, Lou Ferrigno as the Hulk, and Jack Colvin as Jack McGee.\nIn the TV series, Dr. David Banner, a widowed physician and scientist, who is presumed dead, travels across America under assumed names, and finds himself in positions where he helps others in need despite his terrible secret: in times of extreme anger, he transforms into a huge, incredibly strong green creature, who has been given the name \"The Hulk”. In his travels, Banner earns money by working temporary jobs while searching for a way to control his condition.\nThe series was originally broadcast by CBS from 1978 to 1982, with 82 episodes over five seasons. The two-hour pilot movie, which established the Hulk's origins, aired on November 4, 1977. It was developed and produced by Kenneth Johnson, who also wrote or directed some episodes.\nAfter the series ended, the fate of David Banner was a cliffhanger until 1988. The franchise was purchased from CBS by rival NBC. They produced three made-for-television films: The Incredible Hulk Returns, The Trial of the Incredible Hulk and The Death of the Incredible Hulk. Since its debut, The Incredible Hulk series has garnered a worldwide fan base.", "rate": 66, "genre": ["Action", "Adventure", "Drama"], "cast": ["Bill Bixby", "Lou Ferrigno", "Jack Colvin", "Charles Napier"], "character": ["Dr. David Bruce Banner", "The Incredible Hulk", "Jack McGee", "Hulk voice/roar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 648   Expand The Incredible Hulk   (1978) User Score  Play Trailer Overview The Incredible Hulk is an American television series based on the Marvel Comics character, the Hulk. The series aired on the CBS television network and starred Bill Bixby as David Banner, Lou Ferrigno as the Hulk, and Jack Colvin as Jack McGee. In the TV series, Dr. David Banner, a widowed physician and scientist, who is presumed dead, travels across America under assumed names, and finds himself in positions where he helps others in need despite his terrible secret: in times of extreme anger, he transforms into a huge, incredibly strong green creature, who has been given the name \"The Hulk”. In his travels, Banner earns money by working temporary jobs while searching for a way to control his condition. The series was originally broadcast by CBS from 1978 to 1982, with 82 episodes over five seasons. The two-hour pilot movie, which established the Hulk's origins, aired on November 4, 1977. It was developed and produced by Kenneth Johnson, who also wrote or directed some episodes. After the series ended, the fate of David Banner was a cliffhanger until 1988. The franchise was purchased from CBS by rival NBC. They produced three made-for-television films: The Incredible Hulk Returns, The Trial of the Incredible Hulk and The Death of the Incredible Hulk. Since its debut, The Incredible Hulk series has garnered a worldwide fan base. Featured Crew Kenneth Johnson Creator Jack Kirby Creator Stan Lee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  14 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Bill Bixby Dr. David Bruce Banner Lou Ferrigno The Incredible Hulk Jack Colvin Jack McGee Charles Napier Hulk voice/roar Full Cast & Crew Last Season Season 5 1981 | 7 Episodes Season 5 of The Incredible Hulk premiered on October  2, 1981. View All Seasons Social Reviews  0 Discussions  14 Subject Status Replies Last Reply M Imagine if the same show was made today Open 8 by  MickyMac M Is the show really a Hulk adaptation? Open 0 by MickyMac\n      \n     w The Hulk: Happy Birthday Lou Ferrigno! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  6 Posters  4 Recommendations   1976-03-21 Charlie's Angels 5.9    1978-11-03 Diff'rent Strokes 5.7    1965-09-18 I Dream of Jeannie 7.1    1966-01-12 Batman 7.0    1964-09-24 The Munsters 7.1    1989-09-19 Doogie Howser, M.D. 5.7    1980-12-11 Magnum, P.I. 7.1    1978-09-12 Taxi 7.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords superhero based on comic scientist hulk Content Score 100 Yes! Looking good! Top Contributors 17 Banana 11 Steve d 10 denis 8 juzza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}