{"link": "https://www.themoviedb.org/tv/12209?language=en", "title": "Edward and Mrs Simpson", "resume": "While still the Prince of Wales, the future Edward VIII meets the married American socialite, Wallis Simpson. Their relationship causes furor in the palace and in parliament, especially when King George V dies, Mrs. Simpson gets divorced, and King Edward announces his intentions to marry her.", "rate": 60, "genre": ["Drama"], "cast": ["Cynthia Harris", "Edward Fox", "Wensley Pithey", "John Shrapnel", "John Kidd"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12209   Expand Edward and Mrs Simpson   (1978) User Score Overview While still the Prince of Wales, the future Edward VIII meets the married American socialite, Wallis Simpson. Their relationship causes furor in the palace and in parliament, especially when King George V dies, Mrs. Simpson gets divorced, and King Edward announces his intentions to marry her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cynthia Harris Edward Fox Wensley Pithey John Shrapnel John Kidd Full Cast & Crew Last Season Season 1 1978 | 7 Episodes Season 1 of Edward and Mrs Simpson premiered on November  8, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Edward and Mrs Simpson. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 4 Rebecca 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}