{"link": "https://www.themoviedb.org/tv/69960?language=en", "title": "The Listening Post", "resume": "Listening Post is Al Jazeera English's weekly media review show. It casts a critical eye over not just what gets reported, but how it's reported - covering the coverage of the news & analyzing global events through the prism of the media.", "rate": 0, "genre": ["News", "War", "Politics"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69960   Expand The Listening Post User Score Overview Listening Post is Al Jazeera English's weekly media review show. It casts a critical eye over not just what gets reported, but how it's reported - covering the coverage of the news & analyzing global events through the prism of the media. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season 2017 2017 | 9 Episodes Season 12 of The Listening Post premiered on January 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Facts Status  Returning Series Network Certification  - Type  News Original Language  English Runtime  - Homepage   http://www.aljazeera.com/programmes/listeningpost/ Genres News War & Politics Keywords politics journalism freedom of the press media manipulation media criticism media landscape Content Score 50 Still needs a little work. Top Contributors b 42 bielcarvalho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}