{"link": "https://www.themoviedb.org/tv/65571?language=en", "title": "Mysterious Transfer Student", "resume": "Iwata Koichi and Kagawa Midori are second-year students at Tozaiyama High School. One day, while coming home from school, they discover a shooting star rising up in the sky. The next day, Midori sees a shining figure in school and everyone on the school grounds starts talking about a ghost. At that point, a mysterious transfer student called Yamazawa Norio suddenly arrives at the school and moves in to live next door to Koichi. Strange things begin to happen frequently around Koichi whenever Norio appears. The reason and objective of Norio’s arrival in this world is gradually revealed.", "rate": 70, "genre": ["Drama", "Mystery", "Science", "Fiction"], "cast": ["Aoi Nakamura", "Kanata Hongo", "Minami Sakurai", "Hana Sugisaki", "Yûta Nakano"], "character": ["Iwata Kouichi", "Yamazawa Norio", "Kagawa Midori", "Asuka", "Azegami"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65571   Expand Mysterious Transfer Student   (2014) User Score Overview Iwata Koichi and Kagawa Midori are second-year students at Tozaiyama High School. One day, while coming home from school, they discover a shooting star rising up in the sky. The next day, Midori sees a shining figure in school and everyone on the school grounds starts talking about a ghost. At that point, a mysterious transfer student called Yamazawa Norio suddenly arrives at the school and moves in to live next door to Koichi. Strange things begin to happen frequently around Koichi whenever Norio appears. The reason and objective of Norio’s arrival in this world is gradually revealed. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aoi Nakamura Iwata Kouichi Kanata Hongo Yamazawa Norio Minami Sakurai Kagawa Midori Hana Sugisaki Asuka Yûta Nakano Azegami Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Mysterious Transfer Student premiered on January 10, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mysterious Transfer Student. You can help by rating TV shows you've seen. Facts Original Name  なぞの転校生 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Drama Mystery Science Fiction Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 45 saltofstones A 1 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}