{"link": "https://www.themoviedb.org/tv/40222?language=en", "title": "Pompeii: The Last Day", "resume": "Pompeii: The Last Day is a 2003 dramatized documentary that tells of the eruption of Mount Vesuvius on 24 August 79 AD. This eruption covered the Roman cities of Pompeii and Herculaneum in ash and pumice, killing all those trapped between the volcano and the sea. The documentary portrayed the different phases of the eruption. It was directed by Peter Nicholson and written by Edward Canfor-Dumas.", "rate": 60, "genre": ["Documentary"], "cast": ["Tim Pigott-Smith", "Jim Carter", "Jonathan Firth", "F. Murray Abraham"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40222   Expand Pompeii: The Last Day   (2003) User Score Overview Pompeii: The Last Day is a 2003 dramatized documentary that tells of the eruption of Mount Vesuvius on 24 August 79 AD. This eruption covered the Roman cities of Pompeii and Herculaneum in ash and pumice, killing all those trapped between the volcano and the sea. The documentary portrayed the different phases of the eruption. It was directed by Peter Nicholson and written by Edward Canfor-Dumas. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Pigott-Smith Jim Carter Jonathan Firth F. Murray Abraham Narrator Full Cast & Crew Last Season Season 1 — | 2 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Pompeii: The Last Day. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://www.bbc.co.uk/history/ancient/romans/pompeii_portents_01.shtml Genres Documentary Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 Clownsun z 3 zach24 SS 1 Steve Szluck  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}