{"link": "https://www.themoviedb.org/tv/12427?language=en", "title": "Happy Lesson", "resume": "A high school student is adopted by five teachers.", "rate": 0, "genre": ["Animation", "Drama", "Comedy"], "cast": ["Daisuke Kishio", "Kikuko Inoue", "Kaoru Sasajima", "Ruri Asano", "Shawn Sides"], "character": ["Hitose Chitose", "Sanzei Yayoi", "Gokazyo Satsuki", "Ichimonji Mitsuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12427   Expand Happy Lesson   (2002) User Score Overview A high school student is adopted by five teachers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daisuke Kishio Hitose Chitose Kikuko Inoue Sanzei Yayoi Kaoru Sasajima Gokazyo Satsuki Ruri Asano Ichimonji Mitsuki Shawn Sides Full Cast & Crew Last Season Original Air Date Original Air Date Comprehensive Order (Absolute) Happy Lesson Advance 2003 | 13 Episodes Season 2 of Happy Lesson premiered on July  6, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Happy Lesson. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Happy Lesson. You can help by rating TV shows you've seen. Facts Original Name  HAPPY☆LESSON Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  27m Homepage  - Genres Animation Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 28 Banana 20 BrerFox 8 Sergiojamon 5 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}