{"link": "https://www.themoviedb.org/tv/2386?language=en", "title": "Sto Para Pente", "resume": "Sto Para Pente, is a popular Greek comedy-drama television series, which was broadcast on Mega Channel for two seasons, from September 27, 2005 until June 18, 2007.\nThe script was written by Giorgos Kapoutzidis, who had also written the successful Greek TV series, Savvatogenimenes, that aired on that same network for the 2003-2004 season. The director was Antonis Aggelopoulos. Being an instant critical and popular success, Sto Para Pente was the biggest television hit of both the 2005-2006 and the 2006-2007 seasons and is regarded as one of the most famed and successful shows in Greek television history. The series was originally supposed to include only one season but its immense popularity resulted to a second season consisting of 23 more episodes. The first episode of Season 2 aired on October 2, 2006. Despite early, widespread calls for the creation of a third season, Kapoutzidis made it clear that the second would be the last season of the show. The highly anticipated series finale attracted an audience of nearly 3 million viewers, making this 70-minute-long special episode the third most watched episode of any television series ever in Greece since ratings began. \"Sto Para Pente\" also met great success abroad within Greek diaspora communities.", "rate": 83, "genre": ["Mystery", "Comedy"], "cast": ["Zeta Makripoulia"], "character": ["Amalia Antonopoulou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2386   Expand Sto Para Pente   (2005) User Score Overview Sto Para Pente, is a popular Greek comedy-drama television series, which was broadcast on Mega Channel for two seasons, from September 27, 2005 until June 18, 2007. The script was written by Giorgos Kapoutzidis, who had also written the successful Greek TV series, Savvatogenimenes, that aired on that same network for the 2003-2004 season. The director was Antonis Aggelopoulos. Being an instant critical and popular success, Sto Para Pente was the biggest television hit of both the 2005-2006 and the 2006-2007 seasons and is regarded as one of the most famed and successful shows in Greek television history. The series was originally supposed to include only one season but its immense popularity resulted to a second season consisting of 23 more episodes. The first episode of Season 2 aired on October 2, 2006. Despite early, widespread calls for the creation of a third season, Kapoutzidis made it clear that the second would be the last season of the show. The highly anticipated series finale attracted an audience of nearly 3 million viewers, making this 70-minute-long special episode the third most watched episode of any television series ever in Greece since ratings began. \"Sto Para Pente\" also met great success abroad within Greek diaspora communities. Featured Crew Giorgos Kapoutzidis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zeta Makripoulia Amalia Antonopoulou Full Cast & Crew Last Season Season 2 2006 | 23 Episodes Season 2 of Sto Para Pente premiered on October  2, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   Konstadinou kai Elenis 7.3    10i entoli 8.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.megatv.com Genres Mystery Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 1 Leonidas Ntalkadopapadopoulos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}