{"link": "https://www.themoviedb.org/tv/19802?language=en", "title": "Alex Haley's Queen", "resume": "Queen is the story about Easter, the illegitimate daughter of James Jackson, III and her lifelong affair with plantation owner Tim Daly, which would result in the birth of Queen. Queen's story revolves around her early years as a slave who yearns to know who her father is, and her condition as a fair skin mixed race woman who spends her life trying to figure out where exactly she fits in.", "rate": 70, "genre": ["Drama"], "cast": ["Halle Berry", "Ann-Margret", "Jane Krakowski", "Frances Conroy", "Raven-Symoné"], "character": ["Queen", "Sally Jackson", "Jane", "Mrs. Benson", "Queen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19802   Expand Alex Haley's Queen   (1993) User Score Overview Queen is the story about Easter, the illegitimate daughter of James Jackson, III and her lifelong affair with plantation owner Tim Daly, which would result in the birth of Queen. Queen's story revolves around her early years as a slave who yearns to know who her father is, and her condition as a fair skin mixed race woman who spends her life trying to figure out where exactly she fits in. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Halle Berry Queen Ann-Margret Sally Jackson Jane Krakowski Jane Frances Conroy Mrs. Benson Raven-Symoné Queen Full Cast & Crew Last Season Miniseries 1993 | 3 Episodes Season 1 of Alex Haley's Queen premiered on February 14, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1993-01-01 Dr. Quinn, Medicine Woman 6.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords civil war based on novel or book slavery plantation miniseries slave period drama 19th century Content Score 86 Almost there... Top Contributors 28 Banana TB 13 TMDb Bot 5 Elizabeth Jennings s 2 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}