{"link": "https://www.themoviedb.org/tv/9826?language=en", "title": "The Tom Green Show", "resume": "The Tom Green Show is a North American television show that first aired in September 1994 on Rogers Television 22, a community channel in Ottawa, Ontario, until 1996, and was later picked up by The Comedy Network in 1997 and debuted on February 13, 1998. The first season was 13 episodes. The second season of 13 episodes began on December 4, 1998.\nIn January 1999, the show moved to the United States and aired on MTV. The MTV show stopped production when Green was diagnosed with testicular cancer in March 2000, but continued to appear on the channel via reruns and other promotional materials. In 2002, it was ranked #41 on TV Guide's 50 Worst TV Shows of All Time. In 2003, the show was revived as The New Tom Green Show. In 2006, Green launched Tom Green Live, a live call-in show for his website. Later renamed Tom Green's House Tonight, the show takes place in his living room.", "rate": 64, "genre": ["Comedy"], "cast": ["Phil Giroux", "Tom Green"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9826   Expand The Tom Green Show User Score Overview The Tom Green Show is a North American television show that first aired in September 1994 on Rogers Television 22, a community channel in Ottawa, Ontario, until 1996, and was later picked up by The Comedy Network in 1997 and debuted on February 13, 1998. The first season was 13 episodes. The second season of 13 episodes began on December 4, 1998. In January 1999, the show moved to the United States and aired on MTV. The MTV show stopped production when Green was diagnosed with testicular cancer in March 2000, but continued to appear on the channel via reruns and other promotional materials. In 2002, it was ranked #41 on TV Guide's 50 Worst TV Shows of All Time. In 2003, the show was revived as The New Tom Green Show. In 2006, Green launched Tom Green Live, a live call-in show for his website. Later renamed Tom Green's House Tonight, the show takes place in his living room. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil Giroux Tom Green Full Cast & Crew Last Season Season 2 — | 13 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}