{"link": "https://www.themoviedb.org/tv/68880?language=en", "title": "First Love Again", "resume": "Lee Ha Jin (Myung Se Bin) is a woman who had forgotten memories of her first love. Meanwhile, Cha Do Yoon (Kim Seung Soo) is a man who is trapped in the memories of his first love. Two of them meet again after 8 years.", "rate": 80, "genre": ["Family"], "cast": ["Wang Bit-na", "Park Jung Chul", "Kim Seung-soo", "Myung Se-bin"], "character": ["Baek Min Hee", "Choi Jung Woo", "Cha Do Yoon", "Lee Ha Jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68880   Expand First Love Again   (2016) User Score Overview Lee Ha Jin (Myung Se Bin) is a woman who had forgotten memories of her first love. Meanwhile, Cha Do Yoon (Kim Seung Soo) is a man who is trapped in the memories of his first love. Two of them meet again after 8 years. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wang Bit-na Baek Min Hee Park Jung Chul Choi Jung Woo Kim Seung-soo Cha Do Yoon Myung Se-bin Lee Ha Jin Full Cast & Crew Last Season Season 1 2016 | 104 Episodes Season 1 of First Love Again premiered on November 28, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on First Love Again. You can help by rating TV shows you've seen. Facts Original Name  다시, 첫사랑 Status  Ended Networks - Certification  - Type  Scripted Original Language  Korean Runtime  50m Homepage   http://www.kbs.co.kr/drama/loveagain/ Genres Family Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 7 mp4soju 7 valueasset21 n 2 nubie 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}