{"link": "https://www.themoviedb.org/tv/40087?language=en", "title": "The Yard", "resume": "The Yard is a Canadian mockumentary comedy series that originally aired on HBO Canada in 2011. Set in a schoolyard, the series depicts the interactions of two rival gangs of elementary school students, with the plot of each episode serving as a parody of an adult-oriented crime drama series such as The Sopranos or The Wire. In the United States it is available for online streaming exclusively on Hulu in both \"censored\" and \"uncensored\" versions and for 1080p HD digital download on the iTunes Store.", "rate": 88, "genre": ["Comedy"], "cast": ["Olivia Scriven"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40087   Expand The Yard   (2011) User Score Overview The Yard is a Canadian mockumentary comedy series that originally aired on HBO Canada in 2011. Set in a schoolyard, the series depicts the interactions of two rival gangs of elementary school students, with the plot of each episode serving as a parody of an adult-oriented crime drama series such as The Sopranos or The Wire. In the United States it is available for online streaming exclusively on Hulu in both \"censored\" and \"uncensored\" versions and for 1080p HD digital download on the iTunes Store. Featured Crew David Eddie Creator Michael Mabbott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Olivia Scriven Full Cast & Crew Last Season Season 1 2011 | 6 Episodes Season 1 of The Yard premiered on July  8, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Yard. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Yard. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords parody elementary school rivalry mockumentary kids Content Score 64 We're so close, yet so far. Top Contributors 7 Banana s 5 supacat 3 rtentser 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}