{"link": "https://www.themoviedb.org/tv/34996?language=en", "title": "Teen Mom 2", "resume": "Jenelle, Chelsea, Kailyn, and Leah are four young women navigating complicated lives. It's not always easy being a young mom.", "rate": 48, "genre": ["Reality"], "cast": ["Jenelle Evans", "Chelsea DeBoer", "Kailyn Lowry", "Leah Messer"], "character": ["Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34996   Expand Teen Mom 2   (2011) User Score Overview Jenelle, Chelsea, Kailyn, and Leah are four young women navigating complicated lives. It's not always easy being a young mom. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  40 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jenelle Evans Herself Chelsea DeBoer Herself Kailyn Lowry Herself Leah Messer Herself Full Cast & Crew Current Season Season 9 2018 | 9 Episodes Season 9 of Teen Mom 2 premiered on May  7, 2018. View All Seasons Social Reviews  0 Discussions  40 Subject Status Replies Last Reply c Way to go, Jase! Open 0 by cflr\n      \n     c What I have learned from the Teen Mom franchise Open 1 by  TheCheetahPeach T I like Brianna but.... Open 1 by  Poetist Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2009-12-08 Teen Mom 4.9    2012-11-12 Catfish: The TV Show 6.3    2012-06-18 Love & Hip Hop Atlanta 4.6    2011-04-26 The Voice 4.6    2013-09-16 Sleepy Hollow 6.4    2011-06-05 Teen Wolf 6.9    2011-09-20 New Girl 6.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://mtv.com/shows/teen-mom-2 Genres Reality Keywords spin off teenage pregnancy Content Score 86 Almost there... Top Contributors D 13 DillanG96 b 11 basher 8 Elizabeth Jennings TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}