{"link": "https://www.themoviedb.org/tv/46836?language=en", "title": "The Jeselnik Offensive", "resume": "The Jeselnik Offensive is an American late-night television program that airs on Comedy Central. It is hosted by stand-up comedian Anthony Jeselnik, who extends his onstage character into weekly, topical humor with a sociopathic, dark twist. The show primarily consists of a monologue and two panelists who join Jeselnik in adding a humorous take on shocking, lurid news stories.\nThe series premiered February 19, 2013, on Comedy Central. It was renewed for a second season on April 26, 2013, and aired July 9, 2013.", "rate": 80, "genre": ["Comedy"], "cast": ["Anthony Jeselnik"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46836   Expand The Jeselnik Offensive   (2013) User Score  Play Trailer Overview The Jeselnik Offensive is an American late-night television program that airs on Comedy Central. It is hosted by stand-up comedian Anthony Jeselnik, who extends his onstage character into weekly, topical humor with a sociopathic, dark twist. The show primarily consists of a monologue and two panelists who join Jeselnik in adding a humorous take on shocking, lurid news stories. The series premiered February 19, 2013, on Comedy Central. It was renewed for a second season on April 26, 2013, and aired July 9, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anthony Jeselnik Host Full Cast & Crew Last Season Season 2 2013 | 8 Episodes Season 2 of The Jeselnik Offensive premiered on July  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Jeselnik Offensive. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 15 Elizabeth Jennings TB 1 TMDb Bot 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}