{"link": "https://www.themoviedb.org/tv/62111?language=en", "title": "Shadows", "resume": "Relu is a family man. He has two children, a wife and a double life. Seen through the eyes of his family, Relu Oncescu appears to be an ordinary taxi driver. No one suspects that Relu works as a collector for Capitanu', a local mobster. Neither of the two worlds (his family and the mafia) knows of the other's existence. Relu manages to keep everything under control, but not for long. After accidentally killing a man, he tries to get out of the underworld, but he can't find his way back. Day by day, the secrets he keeps become increasingly oppressive and the lies begin to surface, one by one.", "rate": 85, "genre": ["Crime", "Drama"], "cast": ["Șerban Pavlu", "Maria Obretin", "Stefan Velniciuc", "Andreea Vasile"], "character": ["Relu", "Gina", "Nea Puiu'", "Nico"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62111   Expand Shadows   (2014) User Score Overview Relu is a family man. He has two children, a wife and a double life. Seen through the eyes of his family, Relu Oncescu appears to be an ordinary taxi driver. No one suspects that Relu works as a collector for Capitanu', a local mobster. Neither of the two worlds (his family and the mafia) knows of the other's existence. Relu manages to keep everything under control, but not for long. After accidentally killing a man, he tries to get out of the underworld, but he can't find his way back. Day by day, the secrets he keeps become increasingly oppressive and the lies begin to surface, one by one. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Șerban Pavlu Relu Maria Obretin Gina Stefan Velniciuc Nea Puiu' Andreea Vasile Nico Full Cast & Crew Current Season Season 2 2017 | 6 Episodes Season 2 of Shadows premiered on November 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2014-04-06 Silicon Valley 7.9    2014-03-19 The 100 6.4  Facts Original Name  Umbre Status  Returning Series Network Certification  - Type  Scripted Original Language  Romanian Runtime  - Homepage   http://www.hbo.ro/series/umbre Genres Crime Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 17 Elizabeth Jennings S 12 SerialeOnline2015 c 7 count_vertigo 7 bmanipani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}