{"link": "https://www.themoviedb.org/tv/72249?language=en", "title": "Sketchbook ~full color's~", "resume": "No matter where she goes, Sora takes her sketchbook along. The world is full of mysterious and beautiful things, after all, and Sora doesn't want to miss a single one. The best way she knows to capture each moment is by drawing and sketching, watching and learning.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Kana Hanazawa", "Asuka Nakase", "Yui Makino", "Masumi Asano", "Natsuko Kuwatani"], "character": ["Sora Kajiwara (voice)", "Natsumi Asou (voice)", "Hazuki Torikai (voice)", "Ryo Tanabe (voice)", "Fu Himuro (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72249   Expand Sketchbook ~full color's~   (2007) User Score Overview No matter where she goes, Sora takes her sketchbook along. The world is full of mysterious and beautiful things, after all, and Sora doesn't want to miss a single one. The best way she knows to capture each moment is by drawing and sketching, watching and learning. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Sora Kajiwara (voice) Asuka Nakase Natsumi Asou (voice) Yui Makino Hazuki Torikai (voice) Masumi Asano Ryo Tanabe (voice) Natsuko Kuwatani Fu Himuro (voice) Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of Sketchbook ~full color's~ premiered on October  2, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sketchbook ~full color's~. You can help by rating TV shows you've seen. Facts Original Name  スケッチブック ～full color'S～ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.mag-garden.co.jp/sketchbook/index.html Genres Animation Comedy Keywords high school cat arts slice of life drawing anime based on 4-koma feel good Content Score 71 Just a little bit more... Top Contributors 83 Marr 🇳🇱 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}