{"link": "https://www.themoviedb.org/tv/50076?language=en", "title": "Aiura", "resume": "They don't always see eye-to-eye, but that just makes these high school girls' daily lives more fun. \"Their lives happen when nothing is happening\".", "rate": 58, "genre": ["Animation", "Comedy"], "cast": ["Yui Nakajima", "Yuuko Iida", "Nao Tamura"], "character": ["Kanaka Amaya (voice)", "Saki Iwasawa (voice)", "Ayuko Uehara (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50076   Expand Aiura   (2013) User Score Overview They don't always see eye-to-eye, but that just makes these high school girls' daily lives more fun. \"Their lives happen when nothing is happening\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yui Nakajima Kanaka Amaya (voice) Yuuko Iida Saki Iwasawa (voice) Nao Tamura Ayuko Uehara (voice) Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Aiura premiered on April 10, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Aiura. You can help by rating TV shows you've seen. Facts Original Name  あいうら Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  4m Homepage   http://www.tv-tokyo.co.jp/anime/aiura/index2.html Genres Animation Comedy Keywords high school slice of life school aftercreditsstinger anime watercolour style based on 4-koma short episodes Content Score 43 There's no 'I' in team... Top Contributors 45 Marr 🇳🇱 12 sp1ti 7 Panayotis m 4 maruino  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}