{"link": "https://www.themoviedb.org/tv/13402?language=en", "title": "The Monocled Mutineer", "resume": "The Monocled Mutineer TV series follows the rebellion that took place at the notorious Etaples Training Camp in northern France on the eve of \"The Battle of Passchendaele\" in 1917. After the mutiny, the dashing Percy Toplis takes flight, dressed as a British officer, soon to embark on a love affair with beautiful young widow, Dorothy. A solder in the First World War, the real Percy Toplis was a rake, rogue and master of disguise who became the most wanted man in Britain. This controversial, acclaimed 1986 four-part BBC dramatisation of high romance, hilarious impudence and savage retribution was adapted by Alan Bleasdale from the book by William Allison and John Fairley.", "rate": 80, "genre": ["Drama"], "cast": ["Paul McGann", "Philip McGough", "Cherie Lunghi", "Jerome Flynn", "Timothy West"], "character": ["Percy Toplis", "Franny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13402   Expand The Monocled Mutineer   (1986) User Score Overview The Monocled Mutineer TV series follows the rebellion that took place at the notorious Etaples Training Camp in northern France on the eve of \"The Battle of Passchendaele\" in 1917. After the mutiny, the dashing Percy Toplis takes flight, dressed as a British officer, soon to embark on a love affair with beautiful young widow, Dorothy. A solder in the First World War, the real Percy Toplis was a rake, rogue and master of disguise who became the most wanted man in Britain. This controversial, acclaimed 1986 four-part BBC dramatisation of high romance, hilarious impudence and savage retribution was adapted by Alan Bleasdale from the book by William Allison and John Fairley. Featured Crew Alan Bleasdale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul McGann Percy Toplis Philip McGough Cherie Lunghi Jerome Flynn Franny Timothy West Full Cast & Crew Last Season Season 1 1986 | 4 Episodes Season 1 of The Monocled Mutineer premiered on August 31, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Monocled Mutineer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  70m Homepage  - Genres Drama Keywords mutiny based on novel or book world war i miniseries Content Score 93 Almost there... Top Contributors R 9 Rebecca 4 Markxist 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}