{"link": "https://www.themoviedb.org/tv/70484?language=en", "title": "Britannia", "resume": "An epic drama set in 43AD as the Roman Imperial Army – determined and terrified in equal measure - returns to crush the Celtic heart of Britannia - a mysterious land ruled by warrior women and powerful druids who can channel the powerful forces of the underworld. Or so they say.", "rate": 66, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Kelly Reilly", "David Morrissey", "Nikolaj Lie Kaas", "Zoë Wanamaker", "Stanley Weber"], "character": ["Kerra", "General Aulus Plautius", "Divis", "Queen Antedia", "Lindon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70484   Expand Britannia   (2018) User Score Overview An epic drama set in 43AD as the Roman Imperial Army – determined and terrified in equal measure - returns to crush the Celtic heart of Britannia - a mysterious land ruled by warrior women and powerful druids who can channel the powerful forces of the underworld. Or so they say. Featured Crew Jez Butterworth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  5 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kelly Reilly Kerra David Morrissey General Aulus Plautius Nikolaj Lie Kaas Divis Zoë Wanamaker Queen Antedia Stanley Weber Lindon Full Cast & Crew Current Season Season 1 2018 | 9 Episodes Season 1 of Britannia premiered on January 18, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  5 Recommendations   2017-12-06 Knightfall 6.2    2017-11-07 Damnation 7.2    2017-01-25 Cardinal 6.9    2012-02-24 Miss Fisher's Murder Mysteries 7.3    2017-10-02 The Gifted 7.0    2017-04-25 Genius 7.0    2016-10-16 Berlin Station 7.4    2012-12-30 Ripper Street 7.3  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   https://www.sky.com/watch/title/series/britannia Genres Drama Sci-Fi & Fantasy Keywords druid celtic roman army britannia Content Score 100 Yes! Looking good! Top Contributors 82 Elizabeth Jennings 8 Medianoche 5 Ash M 5 Megacine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}