{"link": "https://www.themoviedb.org/tv/70515?language=en", "title": "The Partner", "resume": "Marcus Lemonis, serial entrepreneur and host of CNBC’s The Profit, has invested nearly $50 million dollars in different companies over the course of three seasons. And now, he’s looking for the perfect partner to help him run it all.", "rate": 100, "genre": ["Reality"], "cast": ["Marcus Lemonis"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70515   Expand The Partner   (2017) User Score Overview Marcus Lemonis, serial entrepreneur and host of CNBC’s The Profit, has invested nearly $50 million dollars in different companies over the course of three seasons. And now, he’s looking for the perfect partner to help him run it all. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marcus Lemonis Himself Full Cast & Crew Last Season Season 1 2017 | 5 Episodes Season 1 of The Partner premiered on March  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Partner. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://www.cnbc.com/the-partner/ Genres Reality Keywords business competition reality competition employment Content Score 56 We're so close, yet so far. Top Contributors 25 Elizabeth Jennings j 7 jacobmeliana 3 szab 1 Marco  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}