{"link": "https://www.themoviedb.org/tv/39945?language=en", "title": "SAV des Emissions", "resume": "Le Service après-vente des émissions or SAV des émissions is a French short comedy television series hosted by the comic duo Omar and Fred since 2005 on Canal+. The show is a segment of Le Grand Journal, a news show hosted by Michel Denisot. The series is rebroadcast, in the morning, on Virgin Radio.", "rate": 65, "genre": ["Comedy"], "cast": ["Fred Testot", "Omar Sy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39945   Expand SAV des Emissions   (2005) User Score Overview Le Service après-vente des émissions or SAV des émissions is a French short comedy television series hosted by the comic duo Omar and Fred since 2005 on Canal+. The show is a segment of Le Grand Journal, a news show hosted by Michel Denisot. The series is rebroadcast, in the morning, on Virgin Radio. Featured Crew Fred Testot Creator Omar Sy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Testot Omar Sy Full Cast & Crew Last Season Season 6 2011 | 30 Episodes Season 6 of SAV des Emissions premiered on May  2, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on SAV des Emissions. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  - Homepage   http://www.omar-et-fred.com/television.php Genres Comedy Keywords comedian Content Score 64 We're so close, yet so far. Top Contributors d 17 denis J 11 JojoRoulettes 11 AmazeLee t 6 trawreb  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}