{"link": "https://www.themoviedb.org/tv/65946?language=en", "title": "Tonkatsu DJ Agetarou", "resume": "Agetarou works at his family's tonkatsu restaurant in Shibuya, but he's not very excited by the work. One day, he takes a delivery to the staff of a night club, and the worker lets him in to enjoy the club for a while. Agetarou finds that he loves the club, with its relaxed people and cute girls, all enjoying the music supplied by the DJ. He continues going to the club, until the night comes when the guest American DJ Big Master Fly puts on a show. Agetarou is inspired by Big Master Fly, and realizes that the groove of being a DJ is very similar to the groove of being a tonkatsu chef. Now Agetarou is determined to master both disciplines, though he is most excited to become a DJ!", "rate": 0, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65946   Expand Tonkatsu DJ Agetarou   (2016) User Score Overview Agetarou works at his family's tonkatsu restaurant in Shibuya, but he's not very excited by the work. One day, he takes a delivery to the staff of a night club, and the worker lets him in to enjoy the club for a while. Agetarou finds that he loves the club, with its relaxed people and cute girls, all enjoying the music supplied by the DJ. He continues going to the club, until the night comes when the guest American DJ Big Master Fly puts on a show. Agetarou is inspired by Big Master Fly, and realizes that the groove of being a DJ is very similar to the groove of being a tonkatsu chef. Now Agetarou is determined to master both disciplines, though he is most excited to become a DJ! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Tonkatsu DJ Agetarou premiered on April 10, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tonkatsu DJ Agetarou. You can help by rating TV shows you've seen. Facts Original Name  とんかつDJアゲ太郎 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  11m Homepage   http://www.tonkatsudj.tokyo/ Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 14 sp1ti 7 deanzel 4 seboseboss m 4 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}