{"link": "https://www.themoviedb.org/tv/14506?language=en", "title": "Thuis", "resume": "Thuis is a Belgian television soap opera, which airs on één, which is in the hands of VRT, the national broadcasting channel of the Dutch-speaking region of Belgium.\nThuis first aired on 23 December 1995, featuring Pol Goossen, Janine Bischops, Merel De Vilder Robier, Sally-Jane Van Horebeeck, Annick Segal, Monika Van Lierde, Rik Andries and the late Donald Madder.\nThuis grew to become Flanders' number one soap, gaining 900,000 viewers, and therefore beating competing channel vtm's soap operas Familie and former series Wittekerke. Thuis is currently in its 18th season. On May 27, 2011 episode number 3000 was aired.", "rate": 0, "genre": [], "cast": ["Pol Goossen", "Annick Segal", "Janine Bischops", "Monika Van Lierde", "Leah Thys"], "character": ["Frank Bomans", "Rosa Verbeeck", "Jenny Verbeeck", "Ann De Decker", "Marianne Bastiaens"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14506   Expand Thuis   (1995) User Score Overview Thuis is a Belgian television soap opera, which airs on één, which is in the hands of VRT, the national broadcasting channel of the Dutch-speaking region of Belgium. Thuis first aired on 23 December 1995, featuring Pol Goossen, Janine Bischops, Merel De Vilder Robier, Sally-Jane Van Horebeeck, Annick Segal, Monika Van Lierde, Rik Andries and the late Donald Madder. Thuis grew to become Flanders' number one soap, gaining 900,000 viewers, and therefore beating competing channel vtm's soap operas Familie and former series Wittekerke. Thuis is currently in its 18th season. On May 27, 2011 episode number 3000 was aired. Featured Crew Luc Beerten Creator Winnie Enghien Creator Jan Matterne Jr. Creator Paul Schellekens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pol Goossen Frank Bomans Annick Segal Rosa Verbeeck Janine Bischops Jenny Verbeeck Monika Van Lierde Ann De Decker Leah Thys Marianne Bastiaens Full Cast & Crew Last Season Season 1 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Thuis. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  25m Homepage   http://www.een.be/programmas/thuis Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors p 3 pipolala e 2 elibiva 1 HPauwelyn TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}