{"link": "https://www.themoviedb.org/tv/18048?language=en", "title": "Burden of Guilt", "resume": "Mi pecado is a Mexican telenovela that was produced by Televisa and aired on Canal de las Estrellas from 15 June 2009 through 13 November 2009. Starring Maite Perroni, Eugenio Siller and as adult protagonist Daniela Castro who is also the main villain. Mi pecado tells the story of young lovers Lucrecia and Julián, who are torn apart by their feuding families following the tragic death of Lucrecia's brother César when the three are just children.", "rate": 0, "genre": ["Drama"], "cast": ["Maite Perroni", "Eugenio Siller", "Daniela Castro", "Roberto Blandon", "Sabine Moussier"], "character": ["Lucrecia Córdoba", "Julián Huerta", "Rosario Pedraza de Córdoba", "Paulino Córdoba", "Justina Aldama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18048   Expand Burden of Guilt   (2009) User Score Overview Mi pecado is a Mexican telenovela that was produced by Televisa and aired on Canal de las Estrellas from 15 June 2009 through 13 November 2009. Starring Maite Perroni, Eugenio Siller and as adult protagonist Daniela Castro who is also the main villain. Mi pecado tells the story of young lovers Lucrecia and Julián, who are torn apart by their feuding families following the tragic death of Lucrecia's brother César when the three are just children. Featured Crew Cuauhtémoc Blanco Creator María del Carmen Peña Creator Víctor Manuel Medina Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maite Perroni Lucrecia Córdoba Eugenio Siller Julián Huerta Daniela Castro Rosario Pedraza de Córdoba Roberto Blandon Paulino Córdoba Sabine Moussier Justina Aldama Full Cast & Crew Last Season Season 1 2009 | 1 Episode Season 1 of Burden of Guilt premiered on June 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Burden of Guilt. You can help by rating TV shows you've seen. Facts Original Name  Mi pecado Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www2.esmas.com/entretenimiento/telenovelas/mi-pecado/ Genres Drama Keywords telenovela Content Score 79 Pump it up! We're close now. Top Contributors s 26 shiff7 s 3 speedycars a 3 asusar b 3 bluwy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}