{"link": "https://www.themoviedb.org/tv/61969?language=en", "title": "Angie Tribeca", "resume": "Lone-wolf detective Angie Tribeca and a squad of committed LAPD detectives investigate the most serious cases, from the murder of a ventriloquist to a rash of baker suicides.", "rate": 67, "genre": ["Comedy"], "cast": ["Rashida Jones", "Hayes MacArthur", "Jere Burns", "Deon Cole", "Andree Vermeulen"], "character": ["Angie Tribeca", "Jay Geils", "Chet Atkins", "DJ Tanner", "Monica Scholls"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61969   Expand Angie Tribeca   (2016) User Score  Play Trailer Overview Lone-wolf detective Angie Tribeca and a squad of committed LAPD detectives investigate the most serious cases, from the murder of a ventriloquist to a rash of baker suicides. Featured Crew Nancy Carell Creator Steve Carell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rashida Jones Angie Tribeca Hayes MacArthur Jay Geils Jere Burns Chet Atkins Deon Cole DJ Tanner Andree Vermeulen Monica Scholls Full Cast & Crew Last Season Season 3 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply If you loved \"Airplane\", you'll like this show. Open 2 by  Taylorfirst1 Fantastic Show Open 10 by  Taylorfirst1 T Season 3 Premiere's April 10th Open 0 by TheBayHarborButcher\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   2016-10-19 HIM 6.2    2014-04-09 Deadbeat 6.2    2016-05-26 Neil Gaiman's Likely Stories 5.8    2016-03-15 Crowded 6.4    2013-08-05 Quick Draw 6.3    2016-01-13 Teachers 7.1    2016-03-01 Loosely Exactly Nicole 5.8    2010-08-17 Melissa & Joey 6.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.tbs.com/shows/angie-tribeca.html Genres Comedy Keywords police satire spoof los angeles female cop lapd male cop Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings 13 seawolf S 9 Shady12 9 SergentKeroro  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}