{"link": "https://www.themoviedb.org/tv/1499?language=en", "title": "The Newsroom", "resume": "The Newsroom is a Canadian television comedy-drama series which ran on CBC Television in the 1996–97, 2003–04 and 2004–05 seasons. A two-hour television movie, Escape from the Newsroom, was broadcast in 2002.\nThe show is set in the newsroom of a television station which is never officially named, but is generally understood to be based on the CBC itself. Inspired by American series The Larry Sanders Show and similar to such earlier series as the British Drop the Dead Donkey and the Australian Frontline, the series mined a dark vein of comedy from the political machinations and the sheer incompetence of the people involved in producing City Hour, the station's nightly newscast.\nAlthough not originally intended as an ongoing series, the initial run of 13 episodes led The Newsroom to become one of the most critically acclaimed programs on Canadian television in the 1990s.\nFollowing the end of The Newsroom, Finkleman produced three different short-run series for the CBC, More Tears, Foolish Heart and Foreign Objects, all of which included Findlay as a linking character.", "rate": 0, "genre": ["Comedy"], "cast": ["Ken Finkleman", "Peter Keleghan", "Karen Hines", "Tanya Allen", "Jeremy Hotz"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1499   Expand The Newsroom   (1996) User Score Overview The Newsroom is a Canadian television comedy-drama series which ran on CBC Television in the 1996–97, 2003–04 and 2004–05 seasons. A two-hour television movie, Escape from the Newsroom, was broadcast in 2002. The show is set in the newsroom of a television station which is never officially named, but is generally understood to be based on the CBC itself. Inspired by American series The Larry Sanders Show and similar to such earlier series as the British Drop the Dead Donkey and the Australian Frontline, the series mined a dark vein of comedy from the political machinations and the sheer incompetence of the people involved in producing City Hour, the station's nightly newscast. Although not originally intended as an ongoing series, the initial run of 13 episodes led The Newsroom to become one of the most critically acclaimed programs on Canadian television in the 1990s. Following the end of The Newsroom, Finkleman produced three different short-run series for the CBC, More Tears, Foolish Heart and Foreign Objects, all of which included Findlay as a linking character. Featured Crew Ken Finkleman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Finkleman Peter Keleghan Karen Hines Tanya Allen Jeremy Hotz Full Cast & Crew Last Season Season 3 2005 | 6 Episodes Season 3 of The Newsroom premiered on February 14, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Newsroom. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors T 1 Torq00 b 1 bonjour1992 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}