{"link": "https://www.themoviedb.org/tv/34899?language=en", "title": "Magnificent Century", "resume": "Muhteşem Yüzyıl is a prime time historical Turkish television series. It was originally broadcast on Show TV and then transferred to Star TV. It is based on the life of Suleiman the Magnificent, the longest reigning Sultan of the Ottoman Empire, and his wife Hürrem Sultan, a slave girl who became a Sultan.", "rate": 66, "genre": ["Drama", "Action", "Adventure"], "cast": ["Halit Ergenç", "Meryem Uzerli", "Nur Fettahoglu", "Selim Bayraktar", "Selma Ergeç"], "character": ["Suleiman the Magnificent", "Hurrem Sultan", "Mahidevran Sultan", "Sümbül Ağa", "Hatice Sultan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34899   Expand Magnificent Century   (2011) User Score Overview Muhteşem Yüzyıl is a prime time historical Turkish television series. It was originally broadcast on Show TV and then transferred to Star TV. It is based on the life of Suleiman the Magnificent, the longest reigning Sultan of the Ottoman Empire, and his wife Hürrem Sultan, a slave girl who became a Sultan. Featured Crew Timur Savcı Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Halit Ergenç Suleiman the Magnificent Meryem Uzerli Hurrem Sultan Nur Fettahoglu Mahidevran Sultan Selim Bayraktar Sümbül Ağa Selma Ergeç Hatice Sultan Full Cast & Crew Last Season Season 4 2013 | 36 Episodes Season 4 of Magnificent Century premiered on September 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  7 Recommendations   2007-05-17 Embarrassing Bodies 6.8    2014-04-20 Filthy Riches 6.7    2012-09-04 Highway Thru Hell 7.0    1997-11-24 Breaking the Magician's Code: Magic's Biggest Secrets Finally Revealed 7.6  Facts Original Name  Muhteşem Yüzyıl Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://en.muhtesemyuzyil.tv/ Genres Drama Action & Adventure Keywords royal family historical drama 16th century ottoman empire Content Score 100 Yes! Looking good! Top Contributors 94 purplelammashta b 15 bluwy RK 12 Ramazan KAYHÜYÜK 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}