{"link": "https://www.themoviedb.org/tv/64608?language=en", "title": "The Divorce", "resume": "A witty & sophisticated 'soap opera' with a stellar line-up of performers including Lisa McCune, Marina Prior, Hugh Sheridan & Kate Miller-Heidke. The Divorce takes a playful look at love, passion, regret, morality & longing.", "rate": 25, "genre": ["Comedy"], "cast": ["Marina Prior", "John O'May", "Lisa McCune", "Hugh Sheridan", "Kate Miller-Heidke"], "character": ["Iris", "Jed", "Louise", "Toby", "Caroline"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64608   Expand The Divorce   (2015) User Score  Play Trailer Overview A witty & sophisticated 'soap opera' with a stellar line-up of performers including Lisa McCune, Marina Prior, Hugh Sheridan & Kate Miller-Heidke. The Divorce takes a playful look at love, passion, regret, morality & longing. Featured Crew Sharon Horgan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marina Prior Iris John O'May Jed Lisa McCune Louise Hugh Sheridan Toby Kate Miller-Heidke Caroline Full Cast & Crew Last Season Series 1 2015 | 4 Episodes Season 1 of The Divorce premiered on December  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Divorce. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/programs/divorce/ Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 27 United600 TB 4 TMDb Bot z 2 zyck 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}