{"link": "https://www.themoviedb.org/tv/44673?language=en", "title": "Aryana", "resume": "Aryana is a 2012 Philippine fantasy drama that aired on ABS-CBN. It stars teen star Ella Cruz in her first leading role. The series is composed of three seasons and two hundred episodes. The first season had ended on August 17, 2012 about \"The Return of Aryana as a Human Again\". The second season aired on August 20, 2012 about \"The True Identity of Aryana\", and the 3RD Season aired on October 29, 2012 until it ended on January 25, 2013.", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Michelle Vito", "Ella Cruz", "Dominic Roque", "Paul Salas", "Francis Magundayao"], "character": ["Megan Mendez", "Aryana Mendez", "Hubert Francisco", "Marlon Salvador", "Adrian \"Ian\" Alejandro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44673   Expand Aryana User Score Overview Aryana is a 2012 Philippine fantasy drama that aired on ABS-CBN. It stars teen star Ella Cruz in her first leading role. The series is composed of three seasons and two hundred episodes. The first season had ended on August 17, 2012 about \"The Return of Aryana as a Human Again\". The second season aired on August 20, 2012 about \"The True Identity of Aryana\", and the 3RD Season aired on October 29, 2012 until it ended on January 25, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michelle Vito Megan Mendez Ella Cruz Aryana Mendez Dominic Roque Hubert Francisco Paul Salas Marlon Salvador Francis Magundayao Adrian \"Ian\" Alejandro Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  Tagalog Runtime  - Homepage  - Genres Drama Sci-Fi & Fantasy Keywords mermaid Content Score 64 We're so close, yet so far. Top Contributors L 8 Leah W 2 Wakaku  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}