{"link": "https://www.themoviedb.org/tv/18679?language=en", "title": "Past Life", "resume": "Past Life is an American crime drama television series which aired on Fox from February 9 to June 4, 2010. The series premiered on Tuesday, February 9 at 9:00 pm Eastern/8:00 pm Central. After the premiere, subsequent airings were broadcast on Thursdays beginning February 11, during the 9:00 pm Eastern/8:00 pm Central timeslot.\nThe series was created by David Hudgins and inspired by the book The Reincarnationist, a crime thriller by M. J. Rose, whose main character, Josh Ryder, solves a 21st-century crime with memories and clues from his past life in ancient Rome.\nAlthough seven episodes were produced, the series was canceled after three episodes aired due to rapidly declining ratings. The network announced plans to air the remaining episodes on successive Friday nights from May 28 to June 4, 2010. On June 8, Fox announced that they would not air the final two episodes.", "rate": 45, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Richard Schiff", "Kelli Giddish", "Nic Bishop", "Ravi Patel"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18679   Expand Past Life   (2010) User Score Overview Past Life is an American crime drama television series which aired on Fox from February 9 to June 4, 2010. The series premiered on Tuesday, February 9 at 9:00 pm Eastern/8:00 pm Central. After the premiere, subsequent airings were broadcast on Thursdays beginning February 11, during the 9:00 pm Eastern/8:00 pm Central timeslot. The series was created by David Hudgins and inspired by the book The Reincarnationist, a crime thriller by M. J. Rose, whose main character, Josh Ryder, solves a 21st-century crime with memories and clues from his past life in ancient Rome. Although seven episodes were produced, the series was canceled after three episodes aired due to rapidly declining ratings. The network announced plans to air the remaining episodes on successive Friday nights from May 28 to June 4, 2010. On June 8, Fox announced that they would not air the final two episodes. Featured Crew David Hudgins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Schiff Kelli Giddish Nic Bishop Ravi Patel Full Cast & Crew Last Season Season 1 — | 8 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Past Life. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Past Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords reincarnation religion crime investigation past life Content Score 93 Almost there... Top Contributors 7 Banana z 5 zurman1 w 4 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}