{"link": "https://www.themoviedb.org/tv/26883?language=en", "title": "Wife", "resume": "Han Sang Jin is married to Kim Na Young and they have a 7 year old daughter, Min Joo. They live with his mom, younger brother, younger sister, and sister's daughter. One day, Sang Jin vanishes while on a business trip. He remains missing for over 7 years until one day he is spotted by his college friend, Nam Hyun Pil, at a ski resort. Min Joo, now 15, sees him as well but she just thinks he looks like her dad. Hyun Pil begins digging and finds out that the man is called Min Young Tae. Young Tae is married to Hyun Ja and they have a 3 year old son, Ung Pyo. Hyun Ja doesn't care about that all she knows is that he's her husband and the father of her child. Hyun Pil makes the hard decision to tell the truth to Na Young, to whom he's just proposed. The question is now which man will he live as, Han Sang Jin or Min Young Tae, since each man has a different wife.", "rate": 0, "genre": [], "cast": ["Jeong Bo-seok", "Moon Geun-Young", "Lee Yoo-ri", "Kim Hee-ae", "Yoo Dong-geun"], "character": ["Nam Hyun-pil", "Han Min-joo", "Kim Yoon-joo", "Kim Na-young", "Han Sang-jin / Min Young-tae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26883   Expand Wife   (2003) User Score Overview Han Sang Jin is married to Kim Na Young and they have a 7 year old daughter, Min Joo. They live with his mom, younger brother, younger sister, and sister's daughter. One day, Sang Jin vanishes while on a business trip. He remains missing for over 7 years until one day he is spotted by his college friend, Nam Hyun Pil, at a ski resort. Min Joo, now 15, sees him as well but she just thinks he looks like her dad. Hyun Pil begins digging and finds out that the man is called Min Young Tae. Young Tae is married to Hyun Ja and they have a 3 year old son, Ung Pyo. Hyun Ja doesn't care about that all she knows is that he's her husband and the father of her child. Hyun Pil makes the hard decision to tell the truth to Na Young, to whom he's just proposed. The question is now which man will he live as, Han Sang Jin or Min Young Tae, since each man has a different wife. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeong Bo-seok Nam Hyun-pil Moon Geun-Young Han Min-joo Lee Yoo-ri Kim Yoon-joo Kim Hee-ae Kim Na-young Yoo Dong-geun Han Sang-jin / Min Young-tae Full Cast & Crew Last Season Season 1 2003 | 52 Episodes Season 1 of Wife premiered on January  6, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wife. You can help by rating TV shows you've seen. Facts Original Name  아내 Status  Ended Networks - Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors t 14 tmdb38202327 t 10 tmdb983464 N 9 Nightowl.Kr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}