{"link": "https://www.themoviedb.org/tv/71834?language=en", "title": "Manyū Hiken-chō", "resume": "In Edo period of Japan, a clan known as the Manyuu, with ability of a sword strike that could shrink the size of a woman's breasts. This might not seem like an ability that could rule a land, but their large breasts, denote status, wealth, fame, and influence.", "rate": 80, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Minako Kotobuki", "Aki Toyosaki", "Kaoru Mizuhara", "Misato Fukuen", "Kenji Hamada"], "character": ["Chifusa Manyu", "Kaede", "Kagefusa Manyu", "Kokage", "Muneyuki Manyu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71834   Expand Manyū Hiken-chō   (2011) User Score Overview In Edo period of Japan, a clan known as the Manyuu, with ability of a sword strike that could shrink the size of a woman's breasts. This might not seem like an ability that could rule a land, but their large breasts, denote status, wealth, fame, and influence. Featured Crew Hideki Yamada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Minako Kotobuki Chifusa Manyu Aki Toyosaki Kaede Kaoru Mizuhara Kagefusa Manyu Misato Fukuen Kokage Kenji Hamada Muneyuki Manyu Full Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of Manyū Hiken-chō premiered on July 12, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Manyū Hiken-chō. You can help by rating TV shows you've seen. Facts Original Name  魔乳秘剣帖 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Action & Adventure Keywords samurai magic sword japanese edo period ecchi anime bare breasts boobs erotic Content Score 100 Yes! Looking good! Top Contributors 49 Ashley Green M 12 Migi a 6 animexx f 5 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}