{"link": "https://www.themoviedb.org/tv/18009?language=en", "title": "Davy Crockett", "resume": "Davy Crockett is a five-part serial which aired on ABC in one-hour episodes on the Disneyland series. The series stars Fess Parker as real-life frontiersman Davy Crockett and Buddy Ebsen as his friend, George Russel.\nThe first three episodes of the serial were edited together as the 1955 theatrical film Davy Crockett, King of the Wild Frontier, and rebroadcast in color in the 1960s when the Disney program went to NBC. This series and film are known for the catchy theme song, \"The Ballad of Davy Crockett\". It was filmed in color at the Great Smoky Mountains National Park at the Mountain Farm Museum adjacent to the visitor center at Oconaluftee near Qualla Reservation's entrance and Janss Conejo Ranch, California.\nThe final two episodes were edited together as the 1956 theatrical film Davy Crockett and the River Pirates. It was filmed in Cave-In-Rock, Illinois.\nWalt Disney Home Video released a two-film set of this miniseries on DVD September 7, 2004.", "rate": 60, "genre": ["Western"], "cast": ["Buddy Ebsen", "Fess Parker"], "character": ["Georgie Russell", "Davy Crockett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18009   Expand Davy Crockett   (1954) User Score Overview Davy Crockett is a five-part serial which aired on ABC in one-hour episodes on the Disneyland series. The series stars Fess Parker as real-life frontiersman Davy Crockett and Buddy Ebsen as his friend, George Russel. The first three episodes of the serial were edited together as the 1955 theatrical film Davy Crockett, King of the Wild Frontier, and rebroadcast in color in the 1960s when the Disney program went to NBC. This series and film are known for the catchy theme song, \"The Ballad of Davy Crockett\". It was filmed in color at the Great Smoky Mountains National Park at the Mountain Farm Museum adjacent to the visitor center at Oconaluftee near Qualla Reservation's entrance and Janss Conejo Ranch, California. The final two episodes were edited together as the 1956 theatrical film Davy Crockett and the River Pirates. It was filmed in Cave-In-Rock, Illinois. Walt Disney Home Video released a two-film set of this miniseries on DVD September 7, 2004. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Buddy Ebsen Georgie Russell Fess Parker Davy Crockett Full Cast & Crew Last Season Season 1 1954 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Davy Crockett. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Keywords frontiersman Content Score 56 We're so close, yet so far. Top Contributors 12 Banana 7 Daniel Swan J 3 JYB D 2 Doramius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}