{"link": "https://www.themoviedb.org/tv/64437?language=en", "title": "Outsiders", "resume": "A struggle for power and control set in the rugged and mysterious hills of Appalachia, \"Outsiders\" tells the story of the Farrell clan, a family of outsiders who've been in these parts since before anyone can remember. Living off the grid and above the law on their mountaintop homestead, they'll protect their world and defend their way of life using any means necessary.", "rate": 67, "genre": ["Drama"], "cast": ["Joe Anderson", "David Morse", "Ryan Hurst", "Gillian Alexy", "Kyle Gallner"], "character": ["Asa Farrell", "Big Foster", "Lil’ Foster", "G'Winveer", "Hasil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64437   Expand Outsiders   (2016) User Score  Play Trailer Overview A struggle for power and control set in the rugged and mysterious hills of Appalachia, \"Outsiders\" tells the story of the Farrell clan, a family of outsiders who've been in these parts since before anyone can remember. Living off the grid and above the law on their mountaintop homestead, they'll protect their world and defend their way of life using any means necessary. Featured Crew Peter Mattei Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  14 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Anderson Asa Farrell David Morse Big Foster Ryan Hurst Lil’ Foster Gillian Alexy G'Winveer Kyle Gallner Hasil Full Cast & Crew Last Season Season 2 2017 | 13 Episodes Season 2 of Outsiders premiered on January 24, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply These SLAPNUTS cancelled the show Open 4 by  Xsploit random thoughts thread(will contain spoilers) Open 16 by  StrawHat30 Heading into the season finale in two weeks... Open 3 by  booksandcoffee Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  4 Recommendations   2016-03-30 The Path 6.6    2016-01-14 Colony 6.8    2016-01-22 Stan Lee's Lucky Man 7.3    2015-08-25 Public Morals 7.5    2015-02-24 Gangland Undercover 7.4    2009-07-15 Dark Blue 6.6    2014-06-24 Tyrant 6.4    2014-02-27 The Red Road 6.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  44m Homepage   http://www.wgnamerica.com/series/outsiders/ Genres Drama Keywords sheriff appalachia homesteaders outsider off the grid mountaintop Content Score 100 Yes! Looking good! Top Contributors 92 Elizabeth Jennings MO 12 Melody Owens 11 Apollo w 9 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}