{"link": "https://www.themoviedb.org/tv/61856?language=en", "title": "Vikings", "resume": "Vikings is a 2012 BBC television documentary series written and presented by Neil Oliver charting the rise of the Vikings from prehistoric times to the empire of Canute.", "rate": 85, "genre": ["Documentary"], "cast": ["Neil Oliver"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61856   Expand Vikings   (2012) User Score Overview Vikings is a 2012 BBC television documentary series written and presented by Neil Oliver charting the rise of the Vikings from prehistoric times to the empire of Canute. Featured Crew Neil Oliver Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Oliver Himself Full Cast & Crew Last Season Season 1 2012 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Vikings. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Documentary Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b01ms4sh Genres Documentary Keywords viking history Content Score 64 We're so close, yet so far. Top Contributors t 30 tvergeer 11 Elizabeth Jennings G 4 Goldfinger1964 D 3 DracoAn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}