{"link": "https://www.themoviedb.org/tv/62766?language=en", "title": "The Neighbor", "resume": "La vecina, is a comedy-telenovela produced by Lucero Suárez for Televisa. It is the remake of the telenovela La costeña y el cachaco produced in 2003 by RCN TV.", "rate": 78, "genre": ["Comedy", "Drama"], "cast": ["Esmeralda Pimentel", "Juan Diego Covarrubias", "Luis Gatica", "Alejandro Ibarra", "Javier Jattin"], "character": ["Sara Granados", "Antonio Andrade", "Pedro Arango", "Padre Vicente", "Cheo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62766   Expand The Neighbor   (2015) User Score Overview La vecina, is a comedy-telenovela produced by Lucero Suárez for Televisa. It is the remake of the telenovela La costeña y el cachaco produced in 2003 by RCN TV. Featured Crew Carmen Sepúlveda Creator Lucero Suárez Creator Mónica Agudelo Tenorio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Esmeralda Pimentel Sara Granados Juan Diego Covarrubias Antonio Andrade Luis Gatica Pedro Arango Alejandro Ibarra Padre Vicente Javier Jattin Cheo Full Cast & Crew Last Season Season 1 2015 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Neighbor. You can help by rating TV shows you've seen. Facts Original Name  La vecina Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://television.televisa.com/telenovelas/la-vecina/ Genres Comedy Drama Keywords telenovela Content Score 100 Yes! Looking good! Top Contributors s 36 shiff7 CM 6 Cherche Moi JA 5 Juan Arkadio z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}