{"link": "https://www.themoviedb.org/tv/43376?language=en", "title": "Saiyuki Reload Gunlock", "resume": "The Sanzo Ikkou continues its westward journey, on a mission to prevent a demonic resurrection. As Genjo Sanzo, Cho Hakkai, Sha Gojyo, and Son Goku fight their way to their goal, their path is fraught with internal strife. When they encounter a formidable pair of adversaries from the west, the cohesion of the group -- and the fate of the mission -- may be at stake.", "rate": 100, "genre": ["Animation"], "cast": ["Soichiro Hoshi", "Toshihiko Seki", "Hiroaki Hirata", "Akira Ishida", "Hōchū Ōtsuka"], "character": ["Son Goku (voice)", "Genjo Sanzo (voice)", "Sha Gojyo (voice)", "Cho Hakkai (voice)", "Ni Jinyi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43376   Expand Saiyuki Reload Gunlock   (2004) User Score Overview The Sanzo Ikkou continues its westward journey, on a mission to prevent a demonic resurrection. As Genjo Sanzo, Cho Hakkai, Sha Gojyo, and Son Goku fight their way to their goal, their path is fraught with internal strife. When they encounter a formidable pair of adversaries from the west, the cohesion of the group -- and the fate of the mission -- may be at stake. Featured Crew Kazuya Minekura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Soichiro Hoshi Son Goku (voice) Toshihiko Seki Genjo Sanzo (voice) Hiroaki Hirata Sha Gojyo (voice) Akira Ishida Cho Hakkai (voice) Hōchū Ōtsuka Ni Jinyi (voice) Full Cast & Crew Last Season Saiyuki Reload Gunlock 2004 | 26 Episodes Season 1 of Saiyuki Reload Gunlock premiered on April  1, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Saiyuki Reload Gunlock. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Saiyuki Reload Gunlock. You can help by rating TV shows you've seen. Facts Original Name  最遊記RELOAD GUNLOCK Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 42 tmdb983464 4 Banana i 2 ioannis2 2 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}