{"link": "https://www.themoviedb.org/tv/36134?language=en", "title": "The Sacred Blacksmith", "resume": "This show is based on the light novel series by Isao Miura of the same name. Cecily Campbell is the only child of the famous Campbell family. When her father passes away she joins the prestigious Knight Guards to honour her family's legacy. Soon Cecily encounters a strange young man with a unique sword and an even more unique fighting style. Cecily learns that the man is Luke Ainsworth a blacksmith with a very mysterious past. Soon Cecily and Luke become comrades, of sorts, and together with blacksmith's assistant, Lisa and the Demon Sword of Wind, Aria they embark on many adventures together.", "rate": 87, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Megumi Toyoguchi", "Ayumi Fujimura", "Nobuhiko Okamoto", "Aki Toyosaki"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36134   Expand The Sacred Blacksmith   (2009) User Score Overview This show is based on the light novel series by Isao Miura of the same name. Cecily Campbell is the only child of the famous Campbell family. When her father passes away she joins the prestigious Knight Guards to honour her family's legacy. Soon Cecily encounters a strange young man with a unique sword and an even more unique fighting style. Cecily learns that the man is Luke Ainsworth a blacksmith with a very mysterious past. Soon Cecily and Luke become comrades, of sorts, and together with blacksmith's assistant, Lisa and the Demon Sword of Wind, Aria they embark on many adventures together. Featured Crew Miura Isao Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megumi Toyoguchi Ayumi Fujimura Nobuhiko Okamoto Aki Toyosaki Full Cast & Crew Last Season Season 1 2009 | 12 Episodes Season 1 of The Sacred Blacksmith premiered on October  3, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2012-07-06 Aesthetica of a Rogue Hero 7.1    2012-10-04 Love, Chunibyo & Other Delusions 7.6  Facts Original Name  聖剣の刀鍛冶（ブラックスミス） Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords anime Content Score 93 Almost there... Top Contributors 10 jmf2k S 6 Skywow 6 Elizabeth Jennings ce 5 clyde e collins  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}