{"link": "https://www.themoviedb.org/tv/52008?language=en", "title": "Missing", "resume": "Police inspector Maja Silver returns to her hometown in the Swedish Bible Belt as a terrible discovery paralyzes the small community.", "rate": 60, "genre": ["Drama", "Crime"], "cast": ["Helena Bergström", "Molly Nutley", "Johan Widerberg", "Johan H:son Kjellgren", "Mattias Nordkvist"], "character": ["Maja Silver", "Becky Ekelöf", "Pastor Stein", "Ola Björnelid", "Erik Wester"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52008   Expand Missing   (2017) User Score Overview Police inspector Maja Silver returns to her hometown in the Swedish Bible Belt as a terrible discovery paralyzes the small community. Featured Crew Colin Nutley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Helena Bergström Maja Silver Molly Nutley Becky Ekelöf Johan Widerberg Pastor Stein Johan H:son Kjellgren Ola Björnelid Mattias Nordkvist Erik Wester Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of Missing premiered on January  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Missing. You can help by rating TV shows you've seen. Facts Original Name  Saknad Status  Returning Series Network Certification  - Type  Scripted Original Language  Swedish Runtime  45m Homepage   http://www.cmore.se/serie/78344-saknad Genres Drama Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 27 Bendik VA 11 Viktor Andersson 5 Eline TV m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}