{"link": "https://www.themoviedb.org/tv/3980?language=en", "title": "Davey and Goliath", "resume": "Davey and Goliath is a 1960s stop-motion animated children's Christian television series. The programs, produced by the Lutheran Church in America, were produced by Art Clokey after the success of his Gumby series.\nEach 15-minute episode features the adventures of Davey Hansen and his \"talking\" dog Goliath as they learn the love of God through everyday occurrences. Many of the episodes also feature Davey's parents John and Elaine, his sister Sally, as well as Davey's friends; Jimmy, Teddy, and Nathanial in earlier episodes; Jonathan, Jimmy, Nicky and Cisco on later ones.\nThe introductory music is based on the popular Christian hymn \"A Mighty Fortress is Our God\", written by Martin Luther around 1529.\nThe show was aimed at a younger audience, and generally dealt with issues such as respect for authority, sharing, and prejudice. Eventually these themes included more serious issues such as racism, death, religious intolerance, and vandalism. In general, the characters found themselves in situations which had to be overcome by placing their faith in God. Davey's friends, Nathanial and Jonathan Reed on the 70s episodes, were African-American, and some of the first African-American characters to appear as a friend of a television show's lead character. While Our Gang in the 1930s and 1940s had African American children as friends of lead characters, that was a film series prior to television.", "rate": 68, "genre": ["Animation"], "cast": ["Hal Smith", "Dick Beals", "Norma MacMillan", "Ginny Tyler"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3980   Expand Davey and Goliath   (1960) User Score Overview Davey and Goliath is a 1960s stop-motion animated children's Christian television series. The programs, produced by the Lutheran Church in America, were produced by Art Clokey after the success of his Gumby series. Each 15-minute episode features the adventures of Davey Hansen and his \"talking\" dog Goliath as they learn the love of God through everyday occurrences. Many of the episodes also feature Davey's parents John and Elaine, his sister Sally, as well as Davey's friends; Jimmy, Teddy, and Nathanial in earlier episodes; Jonathan, Jimmy, Nicky and Cisco on later ones. The introductory music is based on the popular Christian hymn \"A Mighty Fortress is Our God\", written by Martin Luther around 1529. The show was aimed at a younger audience, and generally dealt with issues such as respect for authority, sharing, and prejudice. Eventually these themes included more serious issues such as racism, death, religious intolerance, and vandalism. In general, the characters found themselves in situations which had to be overcome by placing their faith in God. Davey's friends, Nathanial and Jonathan Reed on the 70s episodes, were African-American, and some of the first African-American characters to appear as a friend of a television show's lead character. While Our Gang in the 1930s and 1940s had African American children as friends of lead characters, that was a film series prior to television. Featured Crew Art Clokey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hal Smith Dick Beals Norma MacMillan Ginny Tyler Full Cast & Crew Last Season Season 1 2004 | 46 Episodes Season 1 of Davey and Goliath premiered on December 19, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply fun show Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Davey and Goliath. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  15m Homepage   http://www.daveyandgoliath.org Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}