{"link": "https://www.themoviedb.org/tv/40392?language=en", "title": "Conspiracy 365", "resume": "Conspiracy 365 is a 12-part Australian television miniseries based on the novels written by Gabrielle Lord. Produced by Circa Media for Family Movie Channel, the series screened from January 2012.\nThe series is based on a series of books written by Gabrielle Lord. It follows the adventures of Callum Ormond, a 15 year old who is forced to become a fugitive as he searches for the truth behind the death of a family member. The book series is in 14 installments, telling the story from January to December, and then Callum's story following the twelfth installment and Winter's story following Callum's.\nThe television series screens in 12 one hour episodes throughout the year, one episode each month. It is supported by an interactive website with games, puzzles, photographs, behind the scene photographs and information, messages and videos from the characters.\nThe series airs exclusively to FMC on the first Saturday of every month in 2012, and the following day the episode is available to download on iTunes or rent from BigPond Movies. Previous episodes are already available for download or rent online. Viewers can sign up to iTunes for a complete season pass download to own all 12 episodes.", "rate": 50, "genre": ["Action", "Adventure"], "cast": ["Kate Kendall", "James Sorensen", "Aaron Jakubenko", "Rob Carlton", "Julia Zemiro"], "character": ["Yuri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40392   Expand Conspiracy 365   (2012) User Score  Play Trailer Overview Conspiracy 365 is a 12-part Australian television miniseries based on the novels written by Gabrielle Lord. Produced by Circa Media for Family Movie Channel, the series screened from January 2012. The series is based on a series of books written by Gabrielle Lord. It follows the adventures of Callum Ormond, a 15 year old who is forced to become a fugitive as he searches for the truth behind the death of a family member. The book series is in 14 installments, telling the story from January to December, and then Callum's story following the twelfth installment and Winter's story following Callum's. The television series screens in 12 one hour episodes throughout the year, one episode each month. It is supported by an interactive website with games, puzzles, photographs, behind the scene photographs and information, messages and videos from the characters. The series airs exclusively to FMC on the first Saturday of every month in 2012, and the following day the episode is available to download on iTunes or rent from BigPond Movies. Previous episodes are already available for download or rent online. Viewers can sign up to iTunes for a complete season pass download to own all 12 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Kendall James Sorensen Aaron Jakubenko Yuri Rob Carlton Julia Zemiro Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Conspiracy 365 premiered on January 14, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Conspiracy 365. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.conspiracy365.com/ Genres Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 5 zurman1 2 Medianoche 1 tigru89 M 1 Muttsy23  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}