{"link": "https://www.themoviedb.org/tv/61215?language=en", "title": "The Sun Beside the Moon", "resume": "Darika is the granddaughter of a funeral director. She is a strong hearted and independent young woman who seeks money as her main refuge. Fate just so happens to have her stumbling head over heels when she meets Prajan, a successful man of perfect background and qualities. We find ourselves here again as we return for part two of Dao Kien Duen.\nThe story begins with Darika, a 23 year old woman whose grandfather is a funeral director. Thuwaiwanjak Phuttan, Darika’s best friend, has to go on a business trip for his job. He asked her to look after his condo. Darika does not hesitate and agrees because this is the only time in her life where she gets to stay in a luxurious place compared to her low monthly rented room that she had rented out since she attended college. In addition, the condo is close to her work place which is even more convenient for her. She can save money from traveling expenses and use it for other things. Darika really loves her job because she gets paid well. It makes her happy to be able to fend for herself and not rely on a man.\nDarika doesn’t take interest in men because she’s afraid that she will experience a failed marriage like her mother’s. Her mother isn’t a very good person because 30 years ago, she fell in love with a police officer and eloped with him, leaving her father to be heartbroken in embarrassment. After a while, his true colors showed and he began to cheat on her. Her mother couldn’t take it anymore and decided to divorce him. She returned back to her father carrying Darika along with her.\nDarika grew up poor. Her house is made from wood taken from a casket. This resulted in her not having any friends come over because they’re afraid of ghosts. However, this optimistic young girl is not ashamed but instead proud of her home. She thinks it’s unique and very chic in design. Her poor status taught Darika the value of money ever since she was little.\nDarika spent a couple days at the condo then had to go back to Warang. Her boss is busy preparing for the 50th anniversary since the company’s opening. Mom Luang Chankaan Thatsanai (Ken) is the head leader. He’s a young man of high status who has graduated with his master’s degree from Harvard at only 26 years of age. He’s the beloved child of Khun Dararai, a reputable and well known person in society. Chan Thatsanai is a charming and famous businessman. Chan is a very formal person who cares a lot about organization. His clothes has to be arranged by the right shades of color.\nHis father gave him time to study and learn about the company for 2 years. After that, he has to accept the position after him and look after the family’s business. Darika currently works at his company and they will eventually cross path. How will the rest of the story play out?", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Phupoom Phongpanu", "Pichukkana Wongsarattanasin", "Thakrit Tawanpong", "Jarinporn Joonkiat", "Tanyares Ramnarong"], "character": ["M.L. Jantarakan Thatsanai", "Darika/Dao", "Vivit", "Ingfah", "Dararai/Dao"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61215   Expand The Sun Beside the Moon   (2014) User Score  Play Trailer Overview Darika is the granddaughter of a funeral director. She is a strong hearted and independent young woman who seeks money as her main refuge. Fate just so happens to have her stumbling head over heels when she meets Prajan, a successful man of perfect background and qualities. We find ourselves here again as we return for part two of Dao Kien Duen. The story begins with Darika, a 23 year old woman whose grandfather is a funeral director. Thuwaiwanjak Phuttan, Darika’s best friend, has to go on a business trip for his job. He asked her to look after his condo. Darika does not hesitate and agrees because this is the only time in her life where she gets to stay in a luxurious place compared to her low monthly rented room that she had rented out since she attended college. In addition, the condo is close to her work place which is even more convenient for her. She can save money from traveling expenses and use it for other things. Darika really loves her job because she gets paid well. It makes her happy to be able to fend for herself and not rely on a man. Darika doesn’t take interest in men because she’s afraid that she will experience a failed marriage like her mother’s. Her mother isn’t a very good person because 30 years ago, she fell in love with a police officer and eloped with him, leaving her father to be heartbroken in embarrassment. After a while, his true colors showed and he began to cheat on her. Her mother couldn’t take it anymore and decided to divorce him. She returned back to her father carrying Darika along with her. Darika grew up poor. Her house is made from wood taken from a casket. This resulted in her not having any friends come over because they’re afraid of ghosts. However, this optimistic young girl is not ashamed but instead proud of her home. She thinks it’s unique and very chic in design. Her poor status taught Darika the value of money ever since she was little. Darika spent a couple days at the condo then had to go back to Warang. Her boss is busy preparing for the 50th anniversary since the company’s opening. Mom Luang Chankaan Thatsanai (Ken) is the head leader. He’s a young man of high status who has graduated with his master’s degree from Harvard at only 26 years of age. He’s the beloved child of Khun Dararai, a reputable and well known person in society. Chan Thatsanai is a charming and famous businessman. Chan is a very formal person who cares a lot about organization. His clothes has to be arranged by the right shades of color. His father gave him time to study and learn about the company for 2 years. After that, he has to accept the position after him and look after the family’s business. Darika currently works at his company and they will eventually cross path. How will the rest of the story play out? Featured Crew Nong Arunosha Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phupoom Phongpanu M.L. Jantarakan Thatsanai Pichukkana Wongsarattanasin Darika/Dao Thakrit Tawanpong Vivit Jarinporn Joonkiat Ingfah Tanyares Ramnarong Dararai/Dao Full Cast & Crew Last Season Season 1 2014 | 14 Episodes Season 1 of The Sun Beside the Moon premiered on July 18, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Sun Beside the Moon. You can help by rating TV shows you've seen. Facts Original Name  ดาวเคียงเดือน Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 45 Crip 6 Elizabeth Jennings TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}