{"link": "https://www.themoviedb.org/tv/43318?language=en", "title": "Chrome Shelled Regios", "resume": "Chrome Shelled Regios is a Japanese light novel series by Shūsuke Amagi, with illustrations by Miyū. A short story light novel series is serialized in Dragon Magazine. A manga adaptation drawn by Miyū is serialized in the shōnen manga magazine Dragon Age Pure. A second manga adaptation drawn by Nodoka Kiyose is serialized in the shōnen manga magazine Monthly Dragon Age. A third manga adaptation drawn by Watari is serialized in Beans Ace magazine. A four-panel comic strip adaptation drawn by Masumi Futaba started serialization in Monthly Dragon Age on November 8, 2008. A science fiction light novel series titled Legend of Regios is set in the past world of Chrome Shelled Regios series, and published by Fujimi Shobo under its Style-F label. An anime adaptation produced by Zexcs aired on January 11, 2009 to June 20, 2009 and is licensed in North America by Funimation Entertainment.", "rate": 60, "genre": ["Animation", "Sci-Fi", "Fantasy", "Drama", "Action", "Adventure"], "cast": ["Mikako Takahashi", "Takehito Koyasu", "Daisuke Sakaguchi", "Ayahi Takagaki", "Nobuhiko Okamoto"], "character": ["Leerin Marfes", "Karian Loss", "Harley Sutton", "Nina Antalk", "Layfon Alseif"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43318   Expand Chrome Shelled Regios   (2009) User Score Overview Chrome Shelled Regios is a Japanese light novel series by Shūsuke Amagi, with illustrations by Miyū. A short story light novel series is serialized in Dragon Magazine. A manga adaptation drawn by Miyū is serialized in the shōnen manga magazine Dragon Age Pure. A second manga adaptation drawn by Nodoka Kiyose is serialized in the shōnen manga magazine Monthly Dragon Age. A third manga adaptation drawn by Watari is serialized in Beans Ace magazine. A four-panel comic strip adaptation drawn by Masumi Futaba started serialization in Monthly Dragon Age on November 8, 2008. A science fiction light novel series titled Legend of Regios is set in the past world of Chrome Shelled Regios series, and published by Fujimi Shobo under its Style-F label. An anime adaptation produced by Zexcs aired on January 11, 2009 to June 20, 2009 and is licensed in North America by Funimation Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mikako Takahashi Leerin Marfes Takehito Koyasu Karian Loss Daisuke Sakaguchi Harley Sutton Ayahi Takagaki Nina Antalk Nobuhiko Okamoto Layfon Alseif Full Cast & Crew Last Season Season 1 2009 | 24 Episodes Season 1 of Chrome Shelled Regios premiered on January 10, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Chrome Shelled Regios. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Sci-Fi & Fantasy Drama Action & Adventure Keywords high technology military training young adult anime travelling cities sword and sorcery Content Score 86 Almost there... Top Contributors ce 14 clyde e collins 10 sp1ti t 6 theusedversion 5 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}