{"link": "https://www.themoviedb.org/tv/76667?language=en", "title": "Super TV", "resume": "A Korean variety show. “There are some who are less crazy, but there’s no one that’s not crazy.”", "rate": 0, "genre": ["Comedy"], "cast": ["Kim Hee-chul", "Choi Si-won", "Lee Dong-hae", "Lee-teuk", "Yesung"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76667   Expand Super TV   (2018) User Score Overview A Korean variety show. “There are some who are less crazy, but there’s no one that’s not crazy.” Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hee-chul Choi Si-won Himself Lee Dong-hae Lee-teuk Yesung Full Cast & Crew Current Season Season 2 2018 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Super TV. You can help by rating TV shows you've seen. Facts Original Name  슈퍼TV Status  Returning Series Network Certification  - Type  Talk Show Original Language  Korean Runtime  50m Homepage   http://program.tving.com/xtvn/supertv Genres Comedy Keywords variety Content Score 71 Just a little bit more... Top Contributors 28 Lumina_B 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}