{"link": "https://www.themoviedb.org/tv/62265?language=en", "title": "Heard It Through the Grapevine", "resume": "Han In Sang and Seo Bom are young and in love, despite major differences in wealth and status. But all of that hangs in the balance when Han In Sang accidentally knocks up Seo Bom, setting off a comedic domino effect that reverberates throughout the snooty Han family and the modest Seo family. Between pride and humiliation, as well as love and duty, will this young couple be able to survive the storm and do what's right for their baby?", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Yu Jun-sang", "Yoo Ho-jeong", "Go Ah-sung", "Lee Joon", "Jang Hyun-sung"], "character": ["Han Jeong-ho", "Choi Yeon-hee", "Seo Bom", "Han In-sang", "Seo Hyeong-shik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62265   Expand Heard It Through the Grapevine   (2015) User Score Overview Han In Sang and Seo Bom are young and in love, despite major differences in wealth and status. But all of that hangs in the balance when Han In Sang accidentally knocks up Seo Bom, setting off a comedic domino effect that reverberates throughout the snooty Han family and the modest Seo family. Between pride and humiliation, as well as love and duty, will this young couple be able to survive the storm and do what's right for their baby? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yu Jun-sang Han Jeong-ho Yoo Ho-jeong Choi Yeon-hee Go Ah-sung Seo Bom Lee Joon Han In-sang Jang Hyun-sung Seo Hyeong-shik Full Cast & Crew Last Season Season 1 2015 | 30 Episodes Season 1 of Heard It Through the Grapevine premiered on February 23, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Heard It Through the Grapevine. You can help by rating TV shows you've seen. Facts Original Name  풍문으로 들었소 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000006730 Genres Comedy Drama Keywords dark comedy korea Content Score 86 Almost there... Top Contributors M 39 Maria180493 d 9 daphie z 4 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}