{"link": "https://www.themoviedb.org/tv/77780?language=en", "title": "Safe Harbour", "resume": "A group of six friends on a yacht trip from Brisbane to Indonesia come to the aid of a broken-down asylum seekers' boat, leading to a tragic series of events that return to haunt them four years later.", "rate": 70, "genre": ["Drama"], "cast": ["Phoebe Tonkin", "Ewen Leslie", "Robert Rabiah", "Jacqueline McKenzie"], "character": ["Olivia", "Ryan", "Bilal", "Helen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77780   Expand Safe Harbour   (2018) User Score  Play Trailer Overview A group of six friends on a yacht trip from Brisbane to Indonesia come to the aid of a broken-down asylum seekers' boat, leading to a tragic series of events that return to haunt them four years later. Featured Crew Belinda Chayko Creator Phil Enchelmaier Creator Simon Kennedy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phoebe Tonkin Olivia Ewen Leslie Ryan Robert Rabiah Bilal Jacqueline McKenzie Helen Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of Safe Harbour premiered on March  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Safe Harbour. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   https://www.sbs.com.au/programs/safe-harbour Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors j 17 johnmitchel 13 Elizabeth Jennings B 2 Bhlue TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}