{"link": "https://www.themoviedb.org/tv/74550?language=en", "title": "Overprotected Kahoko", "resume": "College student Kahoko is the quintessential overprotected child born out of today's Japanese society. Shielded by her parents, Kahoko grew up completely pampered and became somewhat of a miraculously naive \"test tube human.\" She is 21 years old and about to start working for a company, but she has never slept away from home, had a part time job, chosen her own clothes, or even ridden a train alone. Kahoko has had her picture taken, but she has never taken a picture herself.\nNow, Kahoko is about to step out of her germ-free isolation pod and into the germ-infested world. It won't be long until she realizes, \"I'm different from everybody else!\"\nShe has been her mother's best friend all her life and her father can't live without her. As they become emotionally unstable from the changes that Kahoko goes through, their family begins to fall apart. That's when Kahoko herself and the people around her begin to see the strength that hides deep within.", "rate": 0, "genre": ["Family", "Drama"], "cast": ["Mitsuki Takahata", "Hitomi Kuroki", "Saburo Tokito", "Ryoma Takeuchi", "Tokuma Nishioka"], "character": ["Kahoko Nemoto", "Izumi Nemoto", "Masataka Nemoto", "Hajime Mugino", "Fukushi Namiki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74550   Expand Overprotected Kahoko   (2017) User Score Overview College student Kahoko is the quintessential overprotected child born out of today's Japanese society. Shielded by her parents, Kahoko grew up completely pampered and became somewhat of a miraculously naive \"test tube human.\" She is 21 years old and about to start working for a company, but she has never slept away from home, had a part time job, chosen her own clothes, or even ridden a train alone. Kahoko has had her picture taken, but she has never taken a picture herself. Now, Kahoko is about to step out of her germ-free isolation pod and into the germ-infested world. It won't be long until she realizes, \"I'm different from everybody else!\" She has been her mother's best friend all her life and her father can't live without her. As they become emotionally unstable from the changes that Kahoko goes through, their family begins to fall apart. That's when Kahoko herself and the people around her begin to see the strength that hides deep within. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mitsuki Takahata Kahoko Nemoto Hitomi Kuroki Izumi Nemoto Saburo Tokito Masataka Nemoto Ryoma Takeuchi Hajime Mugino Tokuma Nishioka Fukushi Namiki Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Overprotected Kahoko premiered on July 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Overprotected Kahoko. You can help by rating TV shows you've seen. Facts Original Name  過保護のカホコ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.ntv.co.jp/kahogo-kahoko/ Genres Family Drama Keywords japan Content Score 86 Almost there... Top Contributors M 24 Maria180493 g 14 gashtoby 10 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}