{"link": "https://www.themoviedb.org/tv/1190?language=en", "title": "Taina", "resume": "Chronicles the life of a sassy 15-year-old Latina caught between two worlds: the traditional world of her Puerto Rican family and the modern world of her friends and life at the Manhattan School of the Arts.", "rate": 50, "genre": ["Comedy"], "cast": ["Christina Vidal", "Khaliah Adams", "Christopher Knowings", "David Oliver Cohen", "LaTangela"], "character": ["Taina Maria Morales", "Renee Aretha Jones", "Lamar Carlos Johnson", "Daniel Nathaniel McDaniel", "Martiza Hogg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1190   Expand Taina   (2001) User Score Overview Chronicles the life of a sassy 15-year-old Latina caught between two worlds: the traditional world of her Puerto Rican family and the modern world of her friends and life at the Manhattan School of the Arts. Featured Crew Maria Perez-Brown Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christina Vidal Taina Maria Morales Khaliah Adams Renee Aretha Jones Christopher Knowings Lamar Carlos Johnson David Oliver Cohen Daniel Nathaniel McDaniel LaTangela Martiza Hogg Full Cast & Crew Last Season Season 2 2002 | 13 Episodes Season 2 of Taina premiered on January 19, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Taina. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  22m, 23m Homepage  - Genres Comedy Keywords high school latinx lead aspiring singer teen comedy aspiring actor Content Score 79 Pump it up! We're close now. Top Contributors 18 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}