{"link": "https://www.themoviedb.org/tv/62559?language=en", "title": "Hockey Wives", "resume": "Being married to the game comes with its fair share of perks, but make no mistake: managing the pressures of trades, relentless travel, family, career uncertainty, injury, and long periods of separation in the white hot years of your life is a full time job. Meet the off-ice Captains -- sexy, savvy, jet-setting women, stick handling life through another grueling hockey season. From wives who are new to the league, to those whose partners are Stanley Cup winning superstars or nearing retirement, these women form a team of their own, supporting and encouraging one another through personal and professional highs and lows.", "rate": 0, "genre": ["Reality"], "cast": ["Maripier Morin", "Martine Forget", "Tiffany Parros", "Kodette LaBarbera", "Noureen DeWulf"], "character": ["Herself", "Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62559   Expand Hockey Wives   (2015) User Score Overview Being married to the game comes with its fair share of perks, but make no mistake: managing the pressures of trades, relentless travel, family, career uncertainty, injury, and long periods of separation in the white hot years of your life is a full time job. Meet the off-ice Captains -- sexy, savvy, jet-setting women, stick handling life through another grueling hockey season. From wives who are new to the league, to those whose partners are Stanley Cup winning superstars or nearing retirement, these women form a team of their own, supporting and encouraging one another through personal and professional highs and lows. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maripier Morin Herself Martine Forget Herself Tiffany Parros Herself Kodette LaBarbera Herself Noureen DeWulf Herself Full Cast & Crew Last Season Season 3 2017 | 9 Episodes Season 3 of Hockey Wives premiered on April 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hockey Wives. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Reality Original Language  English Runtime  44m Homepage   http://wnetwork.com/shows/hockey-wives Genres Reality Keywords ice hockey professional sports nhl Content Score 86 Almost there... Top Contributors 31 Banana a 4 ayam123 4 Elizabeth Jennings A 4 Anitta60  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}