{"link": "https://www.themoviedb.org/tv/52088?language=en", "title": "365 Days of Love", "resume": "Ken is Tula, he is married to Lanaree (Anne). Tula is a man who is confident in love, as for Lanaree, not so much. Lanaree is described as boisterous, self-centered, kinda like Alin from “Soot Sanaeha (A recipe for love)”.\nOne day, Lanaree had her fortune read by a roadside psychic. The psychic tells her that she and Tula will break up. She doesn’t believe the psychic, so the psychic gives her an old notebook and instructs her to put it under her pillow when she sleeps. When she wakes, she will find out if the prediction that her marriage will end in divorce is true.\nFor several days, Lanaree is very stressed out by the psychic’s prediction and she doesn’t want to believe it and rationalized that the psychic is old and is probably mentally distorted. Nonetheless, she decides to do what the psychic instructed and place the notebook under her pillow before she went to bed.\nThe next day, she wakes up to find herself not at her house with Tula but at her mother’s house. She checks the calender, it’s the correct month and day. But wait, it’s a year ahead. Eventually, Lanaree learns that a year ago, Tula and herself fought severely about something to the point where she packed up her stuff and she moved back in with her mother.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Theeradeth Wonpuapan", "Anne Thongprasom", "Pakkaramai Potranant", "Vorarit Fuangarome", "Louis Scott"], "character": ["Tula (Toon)", "Lanaree (Lan)", "Racha", "Paweet (Weet)", "Nawat (Wat)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52088   Expand 365 Days of Love   (2010) User Score  Play Trailer Overview Ken is Tula, he is married to Lanaree (Anne). Tula is a man who is confident in love, as for Lanaree, not so much. Lanaree is described as boisterous, self-centered, kinda like Alin from “Soot Sanaeha (A recipe for love)”. One day, Lanaree had her fortune read by a roadside psychic. The psychic tells her that she and Tula will break up. She doesn’t believe the psychic, so the psychic gives her an old notebook and instructs her to put it under her pillow when she sleeps. When she wakes, she will find out if the prediction that her marriage will end in divorce is true. For several days, Lanaree is very stressed out by the psychic’s prediction and she doesn’t want to believe it and rationalized that the psychic is old and is probably mentally distorted. Nonetheless, she decides to do what the psychic instructed and place the notebook under her pillow before she went to bed. The next day, she wakes up to find herself not at her house with Tula but at her mother’s house. She checks the calender, it’s the correct month and day. But wait, it’s a year ahead. Eventually, Lanaree learns that a year ago, Tula and herself fought severely about something to the point where she packed up her stuff and she moved back in with her mother. Featured Crew Maker J Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Theeradeth Wonpuapan Tula (Toon) Anne Thongprasom Lanaree (Lan) Pakkaramai Potranant Racha Vorarit Fuangarome Paweet (Weet) Louis Scott Nawat (Wat) Full Cast & Crew Last Season Season 1 2010 | 14 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 365 Days of Love. You can help by rating TV shows you've seen. Facts Original Name  365วันแห่งรัก Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 31 Crip 6 Elizabeth Jennings 3 mariilakorn21 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}