{"link": "https://www.themoviedb.org/tv/33163?language=en", "title": "G.I. Joe: Renegades", "resume": "G.I. Joe: Renegades is an American animated television series based on the G.I. Joe toy franchise. The series aired on Hub Network from November 26, 2010 to July 23, 2011. The series aired on Teletoon in Canada.\nThe series became available for instant streaming through Netflix on April 5, 2012 and was released on DVD and Blu-ray later that year by Shout! Factory.", "rate": 35, "genre": ["Action", "Adventure", "Animation"], "cast": ["Charlie Adler", "Nika Futterman", "Charlie Schlatter", "Natalia Cigliuti", "Kevin Michael Richardson"], "character": ["Scarlett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33163   Expand G.I. Joe: Renegades   (2010) User Score Overview G.I. Joe: Renegades is an American animated television series based on the G.I. Joe toy franchise. The series aired on Hub Network from November 26, 2010 to July 23, 2011. The series aired on Teletoon in Canada. The series became available for instant streaming through Netflix on April 5, 2012 and was released on DVD and Blu-ray later that year by Shout! Factory. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Adler Nika Futterman Charlie Schlatter Natalia Cigliuti Scarlett Kevin Michael Richardson Full Cast & Crew Last Season G.i. joe renegades season 1 2010 | 26 Episodes Season 1 of G.I. Joe: Renegades premiered on November 26, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on G.I. Joe: Renegades. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 21m Homepage   http://www.hubworld.com/gi-joe/shows/renegades Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 1 Michael A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}