{"link": "https://www.themoviedb.org/tv/65556?language=en", "title": "Lovebird", "resume": "Tells the story of Feride, an orphaned young girl who is forced to attend a boarding school. While she visits her aunt during holidays, she falls in love with her cousin Kamran. Soon, their love grows to be mutual and intensifies.", "rate": 100, "genre": ["Family", "Drama", "Romance"], "cast": ["Fahriye Evcen", "Burak Özçivit", "Elif İskender", "Begüm Kütük Yaşaroğlu", "Mehmet Ozgur"], "character": ["Feride", "Kamran", "Besime", "Neriman", "Seyfettin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65556   Expand Lovebird   (2013) User Score  Play Trailer Overview Tells the story of Feride, an orphaned young girl who is forced to attend a boarding school. While she visits her aunt during holidays, she falls in love with her cousin Kamran. Soon, their love grows to be mutual and intensifies. Featured Crew Resat Nuri Güntekin Creator Sevgi Yılmaz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fahriye Evcen Feride Burak Özçivit Kamran Elif İskender Besime Begüm Kütük Yaşaroğlu Neriman Mehmet Ozgur Seyfettin Full Cast & Crew Last Season Season 1 2013 | 30 Episodes Season 1 of Lovebird premiered on September 24, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Lovebird. You can help by rating TV shows you've seen. Facts Original Name  Çalıkuşu Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  100m Homepage   https://www.kanald.com.tr/calikusu Genres Family Drama Romance Keywords orphan young teacher Content Score 100 Yes! Looking good! Top Contributors b 58 bluwy 31 janar 17 Ravshan TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}