{"link": "https://www.themoviedb.org/tv/61915?language=en", "title": "K.C. Undercover", "resume": "K.C. Cooper, a high school math whiz and karate black-belt, learns that her parents are spies when they recruit her to join them in the secret government agency, The Organization. While she now has the latest spy gadgets at her disposal, K.C. has a lot to learn about being a spy, including keeping her new gig a secret from her best friend Marisa. Together, K.C. and her parents, Craig and Kira, and her younger siblings, Ernie and Judy (a humanoid robot), try to balance everyday family life while on undercover missions, near and far, to save the world.", "rate": 50, "genre": ["Comedy", "Family"], "cast": ["Zendaya", "Veronica Dunne", "Kadeem Hardison", "Tammy Townsend", "Kamil McFadden"], "character": ["K.C. Cooper", "Marisa", "Craig Cooper", "Kira Cooper", "Ernie Cooper"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61915   Expand K.C. Undercover   (2015) User Score  Play Trailer Overview K.C. Cooper, a high school math whiz and karate black-belt, learns that her parents are spies when they recruit her to join them in the secret government agency, The Organization. While she now has the latest spy gadgets at her disposal, K.C. has a lot to learn about being a spy, including keeping her new gig a secret from her best friend Marisa. Together, K.C. and her parents, Craig and Kira, and her younger siblings, Ernie and Judy (a humanoid robot), try to balance everyday family life while on undercover missions, near and far, to save the world. Featured Crew Corinne Marshall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zendaya K.C. Cooper Veronica Dunne Marisa Kadeem Hardison Craig Cooper Tammy Townsend Kira Cooper Kamil McFadden Ernie Cooper Full Cast & Crew Last Season Season 3 2017 | 25 Episodes Season 3 of K.C. Undercover premiered on July  7, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply p K.C. Undercover - Season 3 Episode Titles and Airdates Open 20 by  poweranimals w Ernie: Happy Birthday Kamil McFadden! Open 0 by wonder2wonder\n      \n     w K.C. Cooper: Happy Birthday Zendaya! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2015-06-16 Clipped 4.1    2013-10-07 Mighty Med 6.2    2014-05-30 100 Things to Do Before High School 4.0    2013-10-14 The Thundermans 8.2    2016-03-15 Crowded 6.4    2011-12-02 Austin & Ally 5.8    2012-10-12 Dog With a Blog 5.3    2016-10-19 HIM 6.2  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  25m Homepage   http://watchdisneychannel.go.com/k-c-undercover Genres Comedy Family Keywords high school artificial intelligence spy teenager family smart kid black belt teen spy Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings 21 Nero Kosonen 18 Banana b 9 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}