{"link": "https://www.themoviedb.org/tv/42836?language=en", "title": "Fafner in the Azure: Dead Aggressor", "resume": "Tatsumiyajima is the central island in the middle of a small  cluster of islands, in a sleepy backwater of the Japanese isles. Not  much happens there, and the island's young people go to school knowing  that their lives are likely to remain peaceful and undisturbed. Or so  they have been taught...but the truth is different. The fate of mankind  is on the line, and Tatsumiyajima is the last line of defense against a  hostile and incomprehensible enemy. At the center of it all, fighting  for Humanity's continued existence, is the giant robot Fafner, the  dragon that guards this final treasure of mankind.", "rate": 55, "genre": ["Animation", "Drama", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42836   Expand Fafner in the Azure: Dead Aggressor   (2004) User Score Overview Tatsumiyajima is the central island in the middle of a small  cluster of islands, in a sleepy backwater of the Japanese isles. Not  much happens there, and the island's young people go to school knowing  that their lives are likely to remain peaceful and undisturbed. Or so  they have been taught...but the truth is different. The fate of mankind  is on the line, and Tatsumiyajima is the last line of defense against a  hostile and incomprehensible enemy. At the center of it all, fighting  for Humanity's continued existence, is the giant robot Fafner, the  dragon that guards this final treasure of mankind. Featured Crew Nobuyoshi Habara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Fafner in the Azure: Dead Aggressor 2004 | 26 Episodes Season 1 of Fafner in the Azure: Dead Aggressor premiered on July  4, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fafner in the Azure: Dead Aggressor. You can help by rating TV shows you've seen. Facts Original Name  蒼穹のファフナー: Dead Aggressor Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors t 10 tmdb983464 5 a4840639 k 4 katoune0 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}