{"link": "https://www.themoviedb.org/tv/52850?language=en", "title": "The Severing Crime Edge", "resume": "Killing Goods are murder weapons handed down from generation to generation within the families of their owners. They are cursed to compel their current owners to repeat the original murders. The curse also makes them indestructible. Kiri Haimura is the current owner of a pair of shears that can cut seemingly anything, although the only thing he wants to cut is hair. One day he meets Iwai Mushanokoji, a girl of whom he has only heard rumors that her hair cannot be cut, a girl who can grant one wish, any wish, but only to the person who murders her. Every morning he cuts her hair, which grows back every night; and every day he helps protect her from people who know about her curse and who want a wish granted.", "rate": 95, "genre": ["Animation", "Action", "Adventure"], "cast": ["Arisa Noto"], "character": ["Nigi Ubuzato (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52850   Expand The Severing Crime Edge   (2013) User Score Overview Killing Goods are murder weapons handed down from generation to generation within the families of their owners. They are cursed to compel their current owners to repeat the original murders. The curse also makes them indestructible. Kiri Haimura is the current owner of a pair of shears that can cut seemingly anything, although the only thing he wants to cut is hair. One day he meets Iwai Mushanokoji, a girl of whom he has only heard rumors that her hair cannot be cut, a girl who can grant one wish, any wish, but only to the person who murders her. Every morning he cuts her hair, which grows back every night; and every day he helps protect her from people who know about her curse and who want a wish granted. Featured Crew Yamaguchi Yuji Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arisa Noto Nigi Ubuzato (Voice) Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of The Severing Crime Edge premiered on April  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Severing Crime Edge. You can help by rating TV shows you've seen. Facts Original Name  断裁分離のクライムエッジ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 18 CrewMdk 12 benf45 c 6 chcola 3 Oriknox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}