{"link": "https://www.themoviedb.org/tv/34677?language=en", "title": "Race to Mars", "resume": "Race to Mars is a 2007 Canadian television mini-series about a fictitious mission to Mars that is based on contemporary international research. The first part aired on Discovery Channel Canada and its High Definition channel on September 23, 2007 and the second part on September 30. It was produced in association with Galafilm Inc. William Shatner narrates the miniseries.\nA companion book of the same title, written by Dana Berry, was also published in September 2007. It was offered as a selection of the Science Fiction Book Club.\nMars Rising, a companion 6-episode documentary mini-series, aired from October 7 to October 21, 2007, using sequences shot for Race to Mars.", "rate": 55, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Michael Riley", "Lothaire Bluteau", "Pascale Bussières", "Frank Schorpion", "Claudia Ferri"], "character": ["Rick Erwin", "Antoine Hébert", "Jackie Decelles", "Mikhail Cerenkov", "Lucia Alarcon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34677   Expand Race to Mars   (2007) User Score Overview Race to Mars is a 2007 Canadian television mini-series about a fictitious mission to Mars that is based on contemporary international research. The first part aired on Discovery Channel Canada and its High Definition channel on September 23, 2007 and the second part on September 30. It was produced in association with Galafilm Inc. William Shatner narrates the miniseries. A companion book of the same title, written by Dana Berry, was also published in September 2007. It was offered as a selection of the Science Fiction Book Club. Mars Rising, a companion 6-episode documentary mini-series, aired from October 7 to October 21, 2007, using sequences shot for Race to Mars. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Riley Rick Erwin Lothaire Bluteau Antoine Hébert Pascale Bussières Jackie Decelles Frank Schorpion Mikhail Cerenkov Claudia Ferri Lucia Alarcon Full Cast & Crew Last Season Season 1 2007 | 4 Episodes Season 1 of Race to Mars premiered on September 23, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Race to Mars. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords mars miniseries Content Score 86 Almost there... Top Contributors g 17 gits R 11 Rebecca TB 7 TMDb Bot CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}