{"link": "https://www.themoviedb.org/tv/71886?language=en", "title": "Siren", "resume": "The coastal town of Bristol Cove is known for its legend of once being home to mermaids. When the arrival of a mysterious girl proves this folklore all too true, the battle between man and sea takes a very vicious turn as these predatory beings return to reclaim their right to the ocean.", "rate": 74, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Eline Powell", "Alex Roe", "Fola Evans-Akingbola", "Ian Verdun", "Rena Owen"], "character": ["Ryn", "Ben Pownall", "Maddie Bishop", "Xander McClure", "Helen Hubbell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71886   Expand Siren   (2018) User Score  Play Trailer Overview The coastal town of Bristol Cove is known for its legend of once being home to mermaids. When the arrival of a mysterious girl proves this folklore all too true, the battle between man and sea takes a very vicious turn as these predatory beings return to reclaim their right to the ocean. Featured Crew Dean White Creator Eric Wald Creator Nick Copus Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  2 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Eline Powell Ryn Alex Roe Ben Pownall Fola Evans-Akingbola Maddie Bishop Ian Verdun Xander McClure Rena Owen Helen Hubbell Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Siren premiered on March 29, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply a I hate this show Open 0 by acontributor\n      \n     Did they ever say why they(mermaids) came back ? Open 4 by  mechajutaro Digging it. Open 9 by  freesoul Go to Discussions Media Most Popular Videos  4 Backdrops  3 Posters  5 Recommendations   2018-03-18 Instinct 5.9    2018-03-13 For The People 6.5    2018-03-21 Krypton 6.5    2018-04-02 The Crossing 7.8    2018-01-21 The Resident 7.0    2018-03-11 Deception 7.0    2018-03-22 Station 19 6.9    2018-03-13 Rise 6.8  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://freeform.go.com/shows/siren Genres Drama Sci-Fi & Fantasy Keywords mermaid siren Content Score 100 Yes! Looking good! Top Contributors 45 Banana 27 Elizabeth Jennings 14 movietvhub s 12 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}