{"link": "https://www.themoviedb.org/tv/31289?language=en", "title": "The Fugitive: The Chase Continues", "resume": "The Fugitive is a remake of the 1963 TV series of the same name that aired for one season on CBS between October 6, 2000 and May 25, 2001. It stars Tim Daly as Dr. Richard Kimble, Mykelti Williamson as lieutenant Philip Gerard, and Stephen Lang as Ben Charnquist.", "rate": 75, "genre": ["Drama", "Action", "Adventure"], "cast": ["Tim Daly", "Mykelti Williamson", "Stephen Lang"], "character": ["Dr. Richard Kimble", "Lt. Philip Gerard", "Ben Charnquist"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31289   Expand The Fugitive: The Chase Continues   (2000) User Score Overview The Fugitive is a remake of the 1963 TV series of the same name that aired for one season on CBS between October 6, 2000 and May 25, 2001. It stars Tim Daly as Dr. Richard Kimble, Mykelti Williamson as lieutenant Philip Gerard, and Stephen Lang as Ben Charnquist.  Featured Crew Roy Huggins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Daly Dr. Richard Kimble Mykelti Williamson Lt. Philip Gerard Stephen Lang Ben Charnquist Full Cast & Crew Last Season Season 1 2000 | 22 Episodes Season 1 of The Fugitive: The Chase Continues premiered on October  6, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Fugitive: The Chase Continues. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Action & Adventure Keywords on the run man hunt framed escaped prisoner murder suspect Content Score 50 Still needs a little work. Top Contributors 26 Banana t 9 tmdb62905833 z 4 zurman1 i 3 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}