{"link": "https://www.themoviedb.org/tv/61662?language=en", "title": "Schitt's Creek", "resume": "Formerly filthy rich video store magnate Johnny Rose, his soap star wife Moira, and their two kids, über-hipster son David and socialite daughter Alexis, suddenly find themselves broke and forced to live in Schitt's Creek, a small depressing town they once bought as a joke.", "rate": 69, "genre": ["Comedy"], "cast": ["Eugene Levy", "Catherine O'Hara", "Dan Levy", "Annie Murphy", "Emily Hampshire"], "character": ["Johnny Rose", "Moira Rose", "David Rose", "Alexis Rose", "Stevie Budd"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61662   Expand Schitt's Creek   (2015) User Score  Play Trailer Overview Formerly filthy rich video store magnate Johnny Rose, his soap star wife Moira, and their two kids, über-hipster son David and socialite daughter Alexis, suddenly find themselves broke and forced to live in Schitt's Creek, a small depressing town they once bought as a joke. Featured Crew Dan Levy Creator Eugene Levy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  12 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eugene Levy Johnny Rose Catherine O'Hara Moira Rose Dan Levy David Rose Annie Murphy Alexis Rose Emily Hampshire Stevie Budd Full Cast & Crew Current Season Season 4 2018 | 12 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply MY Spoilers .... Patrick .... Spoilers Open 3 by  ScorpionQ2 People need to see this! Open 9 by  ScorpionQ2 Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  7 Recommendations   2016-08-02 Borderline 7.1    2015-03-16 Spotless 7.3    2016-04-25 Flowers 6.7    2017-04-21 Hot Girls Wanted: Turned On 7.6    2014-07-17 Married 6.3    2014-10-06 Strange Empire 6.2    2015-03-17 Ordinary Lies 7.0    2011-02-08 Traffic Light 7.2  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cbc.ca/schittscreek Genres Comedy Keywords small town spoiled child riches to rags simpler life spoiled Content Score 100 Yes! Looking good! Top Contributors 116 Elizabeth Jennings 13 Banana 11 Nero Kosonen 6 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}