{"link": "https://www.themoviedb.org/tv/76808?language=en", "title": "Coach Snoop", "resume": "See a different side of Snoop Dogg in this unique documentary, which details the famous rapper's efforts to mentor young athletes and create opportunities for them to compete at the highest level of youth football. We'll meet the kids and coaches that form Snoop's squad -- and witness the important life lessons they learn with every game.", "rate": 65, "genre": ["Documentary"], "cast": ["Snoop Dogg"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76808   Expand Coach Snoop   (2016) User Score  Play Trailer Overview See a different side of Snoop Dogg in this unique documentary, which details the famous rapper's efforts to mentor young athletes and create opportunities for them to compete at the highest level of youth football. We'll meet the kids and coaches that form Snoop's squad -- and witness the important life lessons they learn with every game. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Snoop Dogg Himself Full Cast & Crew Last Season Season 1 2016 | 9 Episodes Season 1 of Coach Snoop premiered on May 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Coach Snoop. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   https://www.aol.com/coach-snoop/ Genres Documentary Keywords american football football fútbol americano Content Score 64 We're so close, yet so far. Top Contributors 18 dhanny 12 Banana 7 Marso 5 clapton  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}