{"link": "https://www.themoviedb.org/tv/64743?language=en", "title": "Pure Evil", "resume": "On his release from jail, psychopathic leader of The Sons of Saturn sect Hugo Lopez begins tormenting the ex-policeman whose daughter he killed in this macabre and intellectual Argentinian thriller.", "rate": 0, "genre": ["Crime"], "cast": ["Paula Kohan", "Gabriel Goity", "Ana Celentano", "Mario Alarcón", "Juana Viale"], "character": ["Daniel Parodi", "Diana Quaranta", "Ernesto Montes", "Malena Sanz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64743   Expand Pure Evil   (2015) User Score  Play Trailer Overview On his release from jail, psychopathic leader of The Sons of Saturn sect Hugo Lopez begins tormenting the ex-policeman whose daughter he killed in this macabre and intellectual Argentinian thriller. Featured Crew Liliana Escliar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paula Kohan Gabriel Goity Daniel Parodi Ana Celentano Diana Quaranta Mario Alarcón Ernesto Montes Juana Viale Malena Sanz Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Pure Evil premiered on April  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pure Evil. You can help by rating TV shows you've seen. Facts Original Name  Malicia Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  30m Homepage  - Genres Crime Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 24 EveDemocracy CM 4 Cherche Moi 2 Steve TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}