{"link": "https://www.themoviedb.org/tv/1199?language=en", "title": "Time Between Dog And Wolf", "resume": "Time Between Dog and Wolf is a 2007 South Korean action-romance drama, starring Lee Joon-gi, Nam Sang-mi and Jung Kyung-ho. It aired on MBC from July 18 to September 6, 2007 on Wednesdays and Thursdays at 21:55 for 16 episodes.", "rate": 93, "genre": ["Drama"], "cast": ["Lee Joon-gi", "Nam Sang-mi", "Jung Kyung-ho", "Kim Kap-soo", "Lee Ki-young"], "character": ["Lee Soo Hyun", "Seo Ji Woo", "Kang Min Ki", "Jung Hak Soo", "Kang Jung Ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1199   Expand Time Between Dog And Wolf   (2007) User Score Overview Time Between Dog and Wolf is a 2007 South Korean action-romance drama, starring Lee Joon-gi, Nam Sang-mi and Jung Kyung-ho. It aired on MBC from July 18 to September 6, 2007 on Wednesdays and Thursdays at 21:55 for 16 episodes. Featured Crew Kim Jin-min Creator Han Ji Hoon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Joon-gi Lee Soo Hyun Nam Sang-mi Seo Ji Woo Jung Kyung-ho Kang Min Ki Kim Kap-soo Jung Hak Soo Lee Ki-young Kang Jung Ho Full Cast & Crew Last Season Season 1 2007 | 16 Episodes Season 1 of Time Between Dog And Wolf premiered on July 18, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Time Between Dog And Wolf. You can help by rating TV shows you've seen. Facts Original Name  개와 늑대의 시간 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.imbc.com/broad/tv/drama/dog/ Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors N 14 Nightowl.Kr M 8 Maria180493 6 part-mozi t 4 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}