{"link": "https://www.themoviedb.org/tv/2849?language=en", "title": "David the Gnome", "resume": "The World of David the Gnome, originally titled David el Gnomo, is a Spanish animated television series based on the children's book The Secret Book of Gnomes, by the Dutch author Wil Huygen and illustrator Rien Poortvliet. The program was originally created in Spain by BRB Internacional titled David el Gnomo, and retains a sense of the lush illustrations of the original books. Twenty-six episodes were produced. There was also a spin-off series entitled Wisdom of the Gnomes.\nThe English language dub The World of David the Gnome was produced by Canadian studio Cinar, in association with Miramax Films. Christopher Plummer narrated, with the voice of David the Gnome being provided by Tom Bosley.\nDavid the Gnome came to US television in 1987, airing weekdays on the Nickelodeon cable channel, and was part of the fledgling Nick Jr. lineup when that was created shortly thereafter until 1995. It also aired on TLC on its Ready Set Learn block from September 30, 1996 until March 27, 1998. The series is still frequently airing weekday mornings on Irish channel RTÉ Two as of 2006. In Australia, it has aired on ABC, as well as the Australian branch of Nickelodeon, again as part of the Nick Jr. lineup.", "rate": 73, "genre": ["Animation", "Kids"], "cast": ["Tom Bosley", "Christopher Plummer", "Vlasta Vrána", "Adrian Knight"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2849   Expand David the Gnome   (1985) User Score Overview The World of David the Gnome, originally titled David el Gnomo, is a Spanish animated television series based on the children's book The Secret Book of Gnomes, by the Dutch author Wil Huygen and illustrator Rien Poortvliet. The program was originally created in Spain by BRB Internacional titled David el Gnomo, and retains a sense of the lush illustrations of the original books. Twenty-six episodes were produced. There was also a spin-off series entitled Wisdom of the Gnomes. The English language dub The World of David the Gnome was produced by Canadian studio Cinar, in association with Miramax Films. Christopher Plummer narrated, with the voice of David the Gnome being provided by Tom Bosley. David the Gnome came to US television in 1987, airing weekdays on the Nickelodeon cable channel, and was part of the fledgling Nick Jr. lineup when that was created shortly thereafter until 1995. It also aired on TLC on its Ready Set Learn block from September 30, 1996 until March 27, 1998. The series is still frequently airing weekday mornings on Irish channel RTÉ Two as of 2006. In Australia, it has aired on ABC, as well as the Australian branch of Nickelodeon, again as part of the Nick Jr. lineup. Featured Crew Claudio Biern Boyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Bosley Christopher Plummer Vlasta Vrána Adrian Knight Full Cast & Crew Last Season Season 2 1988 | 13 Episodes Season 2 of David the Gnome premiered on April  4, 1988. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply M Corregir Temporadas Open 0 by Melsar\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1999-01-17 7 vidas 5.9    1983-08-01 Around the World with Willy Fog 7.8    1983-09-17 The Charlie Brown and Snoopy Show 7.0    1987-06-17 Once Upon a Time... Life 8.0    1940-11-25 The Woody Woodpecker Show 7.1  Facts Original Name  David el gnomo Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  23m, 30m Homepage  - Genres Animation Kids Keywords children Content Score 93 Almost there... Top Contributors M 22 Melsar S 6 Samara c 5 copmad z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}