{"link": "https://www.themoviedb.org/tv/11066?language=en", "title": "The Princes of Malibu", "resume": "The Princes of Malibu is an American reality television series that originally aired on Fox from July 10 until July 17, 2005. that aired on the Fox Network, premiering on July 10, 2005. The series produced six episodes, two of which were broadcast, and focused on Brandon and Brody Jenner and their friend Spencer Pratt as they found themselves in the midst of various hijinks.", "rate": 20, "genre": ["Reality", "Comedy"], "cast": ["Brandon Jenner", "Brody Jenner", "David Foster", "Linda Thompson", "Spencer Pratt"], "character": ["Himself", "Himself", "Himself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11066   Expand The Princes of Malibu   (2005) User Score Overview The Princes of Malibu is an American reality television series that originally aired on Fox from July 10 until July 17, 2005. that aired on the Fox Network, premiering on July 10, 2005. The series produced six episodes, two of which were broadcast, and focused on Brandon and Brody Jenner and their friend Spencer Pratt as they found themselves in the midst of various hijinks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brandon Jenner Himself Brody Jenner Himself David Foster Himself Linda Thompson Herself Spencer Pratt Himself Full Cast & Crew Last Season Season 1 2005 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Princes of Malibu. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage  - Genres Reality Comedy Keywords sibling relationship malibu wealthy Content Score 86 Almost there... Top Contributors 11 Banana c 7 courtneysmith86  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}