{"link": "https://www.themoviedb.org/tv/4516?language=en", "title": "Toad Patrol", "resume": "Toad Patrol is a Canadian television series which first aired in 1999 on Teletoon, currently airing on the Telefutura Spanish-language network as Patrulla de Sapitos. It was created by George and his wife, Peggy Sarson. Although it is primarily aimed at young children, it has found popularity with pre-teens to young adults because despite the fairly young and lighthearted appearance of the show, it had some rather dark undertones beneath the surface. Its cult appreciation has also stemmed from the fact that Toad Patrol had so much time and effort put into it. This series has a very distinct beginning, middle, and end to each season it airs. The story was in the works since 1985 and was in the development stage as the creators started selling Mistle Toad chocolates and cream pops to raise money. The show eventually managed to get animated overseas in both Korea, AKOM and India, UTV Toons. Although, a lot of the in-betweening and other works were done in Canada at Funbag and Helix studios.\nA show sponsor page has stated that 13 episodes of the series are currently in production. Several fans had assumed that with the passing of Long John Baldry, the series had been halted however, that is not the case. After discovering that Mistle Toad had two voice actors, fans are now sure that if a third season were to appear then that voice actor would take his place. However, after more than five years without an original episode and no further news of any additional planned broadcasts, the possibility of additional episodes of the series remains doubtful at best.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Bryn McAuley", "Terrence Scammell", "Long John Baldry", "Rick Jones", "Sonja Ball"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4516   Expand Toad Patrol   (2002) User Score Overview Toad Patrol is a Canadian television series which first aired in 1999 on Teletoon, currently airing on the Telefutura Spanish-language network as Patrulla de Sapitos. It was created by George and his wife, Peggy Sarson. Although it is primarily aimed at young children, it has found popularity with pre-teens to young adults because despite the fairly young and lighthearted appearance of the show, it had some rather dark undertones beneath the surface. Its cult appreciation has also stemmed from the fact that Toad Patrol had so much time and effort put into it. This series has a very distinct beginning, middle, and end to each season it airs. The story was in the works since 1985 and was in the development stage as the creators started selling Mistle Toad chocolates and cream pops to raise money. The show eventually managed to get animated overseas in both Korea, AKOM and India, UTV Toons. Although, a lot of the in-betweening and other works were done in Canada at Funbag and Helix studios. A show sponsor page has stated that 13 episodes of the series are currently in production. Several fans had assumed that with the passing of Long John Baldry, the series had been halted however, that is not the case. After discovering that Mistle Toad had two voice actors, fans are now sure that if a third season were to appear then that voice actor would take his place. However, after more than five years without an original episode and no further news of any additional planned broadcasts, the possibility of additional episodes of the series remains doubtful at best. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bryn McAuley Terrence Scammell Long John Baldry Rick Jones Sonja Ball Full Cast & Crew Last Season Season 2 2003 | 13 Episodes Season 2 of Toad Patrol premiered on June 30, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Toad Patrol. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m, 25m Homepage   http://www.toadpatrol.com/ Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}