{"link": "https://www.themoviedb.org/tv/31675?language=en", "title": "The Sing-Off", "resume": "The Sing-Off is an American television singing competition featuring a cappella groups. It debuted on NBC on December 14, 2009, and is produced by Sony Pictures Television and Outlaw Productions, with Mark Burnett's One Three Media being added for the fourth season.\nIt is hosted by Nick Lachey, with judges Ben Folds, Shawn Stockman, and originally Nicole Scherzinger, later replaced by Sara Bareilles. Bareilles left the show after one season and was replaced by Jewel. The show's music staff all came from the a cappella community: Deke Sharon, Bill Hare, Ed Boyer, Ben Bram, Robert Dietz, Christopher Diaz and Nick Girard.\nA cappella groups from the United States, including Puerto Rico, were chosen by audition and advanced in the competition based on judges' eliminations until the finale, with the winners being determined by viewer votes.\nThe program has featured guest appearances by various popular artists, including Bobby McFerrin, Natasha Bedingfield, Jay Sean, Smokey Robinson, Neil Diamond, Boyz II Men, and Sara Bareilles.\nThe Sing-Off was renewed for a third season and started airing much earlier on September 19, 2011, although the first two series had been broadcast in December. Unlike previous seasons, the early start in September allowed for the production of more episodes and the number of participant groups increased.", "rate": 17, "genre": ["Reality"], "cast": ["Shawn Stockman", "Ben Folds", "Sara Bareilles", "Nick Lachey", "Nicole Scherzinger"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31675   Expand The Sing-Off   (2009) User Score Overview The Sing-Off is an American television singing competition featuring a cappella groups. It debuted on NBC on December 14, 2009, and is produced by Sony Pictures Television and Outlaw Productions, with Mark Burnett's One Three Media being added for the fourth season. It is hosted by Nick Lachey, with judges Ben Folds, Shawn Stockman, and originally Nicole Scherzinger, later replaced by Sara Bareilles. Bareilles left the show after one season and was replaced by Jewel. The show's music staff all came from the a cappella community: Deke Sharon, Bill Hare, Ed Boyer, Ben Bram, Robert Dietz, Christopher Diaz and Nick Girard. A cappella groups from the United States, including Puerto Rico, were chosen by audition and advanced in the competition based on judges' eliminations until the finale, with the winners being determined by viewer votes. The program has featured guest appearances by various popular artists, including Bobby McFerrin, Natasha Bedingfield, Jay Sean, Smokey Robinson, Neil Diamond, Boyz II Men, and Sara Bareilles. The Sing-Off was renewed for a third season and started airing much earlier on September 19, 2011, although the first two series had been broadcast in December. Unlike previous seasons, the early start in September allowed for the production of more episodes and the number of participant groups increased. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shawn Stockman Ben Folds Sara Bareilles Nick Lachey Nicole Scherzinger Full Cast & Crew Last Season Season 3 2011 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Sing-Off. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  120m Homepage   http://www.nbc.com/sing-off Genres Reality Keywords singing competition acapella Content Score 86 Almost there... Top Contributors 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}