{"link": "https://www.themoviedb.org/tv/79125?language=en", "title": "Siyah İnci", "resume": "Hazal, beautiful young girl is engajed with Kenan, handsome young fisherman. The day before their wedding, Hazal is forced to marry Vural, successful businessman who fall in love with her since the first time he saw her working on his birthday party as a waitress. Vurals first wife, Naz, was just alike Hazal, and thats the reason why Vural fell in love with her so much, since Naz died 2 years ago and now he finds a replacement of her in Hazal. The story is telling us about the love story between Kenan who thought Hazal dumped him just for money and higher society life and who became a successful businessman with the aim of avenging them , and Hazal who tries to forget all she has been through and the way Vural stole her dreams and youth, and of course Vural who is still waiting for Hazal to love him as much as she loves Kenan.", "rate": 0, "genre": ["Drama"], "cast": ["Mehmet Mehmedof", "İpek Bağrıaçık", "Neriman Uğur", "Selin Işık", "Altuğ Orhan Acar"], "character": ["Sinan Demiroğlu", "Defne", "Canan Demiroğlu", "Irmak", "Ali"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79125   Expand Siyah İnci   (2017) User Score Overview Hazal, beautiful young girl is engajed with Kenan, handsome young fisherman. The day before their wedding, Hazal is forced to marry Vural, successful businessman who fall in love with her since the first time he saw her working on his birthday party as a waitress. Vurals first wife, Naz, was just alike Hazal, and thats the reason why Vural fell in love with her so much, since Naz died 2 years ago and now he finds a replacement of her in Hazal. The story is telling us about the love story between Kenan who thought Hazal dumped him just for money and higher society life and who became a successful businessman with the aim of avenging them , and Hazal who tries to forget all she has been through and the way Vural stole her dreams and youth, and of course Vural who is still waiting for Hazal to love him as much as she loves Kenan. Featured Crew Erol Özlevi Creator Sedat İnci Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mehmet Mehmedof Sinan Demiroğlu İpek Bağrıaçık Defne Neriman Uğur Canan Demiroğlu Selin Işık Irmak Altuğ Orhan Acar Ali Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Siyah İnci premiered on September 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Siyah İnci. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 39 moviefars 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}