{"link": "https://www.themoviedb.org/tv/62490?language=en", "title": "The Business", "resume": "Karin, Magali and Luna are three call girls, who decide to apply some marketing knowledge on the world's oldest profession.", "rate": 74, "genre": ["Comedy", "Drama"], "cast": ["Michelle Batista", "Rafaela Mandelli", "Juliana Schalch"], "character": ["Magali Becker", "Karin", "Luna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62490   Expand The Business   (2013) User Score  Play Trailer Overview Karin, Magali and Luna are three call girls, who decide to apply some marketing knowledge on the world's oldest profession. Featured Crew Luca Paiva Mello Creator Rodrigo Castilho Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michelle Batista Magali Becker Rafaela Mandelli Karin Juliana Schalch Luna Full Cast & Crew Current Season Season 4 2018 | 8 Episodes Season 4 of The Business premiered on March 18, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Business. You can help by rating TV shows you've seen. Facts Original Name  O Negócio Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Portuguese Runtime  60m Homepage   https://br.hbomax.tv/serie/O-Negócio-Temporada-04/501505 Genres Comedy Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 27 Elizabeth Jennings 19 Mauricio Farell d 12 domingoss z 8 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}