{"link": "https://www.themoviedb.org/tv/1650?language=en", "title": "North Shore", "resume": "North Shore is an American prime-time soap opera that aired on Fox every Monday at 8 p.m. EST for seven months in 2004 and 2005. It centered around the staff and guests of the fictional Grand Waimea Hotel and Resort on Oahu's North Shore in Hawaii.\nFrom Fox's website:\nNorth Shore premiered on June 14, 2004, with a 13-episode commitment from Fox. The show was canceled in January 2005 after a 21-episode, single-season run. The show ended on a cliffhanger, and the final episode of the series has only had a single airing, not being shown in most territories.", "rate": 63, "genre": ["Soap", "Drama"], "cast": ["James Remar", "Amanda Righetti", "Nikki DeLoach", "Jason Momoa", "Kristoffer Polaha"], "character": ["Tessa Lewis", "Mary Jeanne \"M.J.\" Bevans", "Frankie Seau", "Jason Matthews"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1650   Expand North Shore   (2004) User Score Overview North Shore is an American prime-time soap opera that aired on Fox every Monday at 8 p.m. EST for seven months in 2004 and 2005. It centered around the staff and guests of the fictional Grand Waimea Hotel and Resort on Oahu's North Shore in Hawaii. From Fox's website: North Shore premiered on June 14, 2004, with a 13-episode commitment from Fox. The show was canceled in January 2005 after a 21-episode, single-season run. The show ended on a cliffhanger, and the final episode of the series has only had a single airing, not being shown in most territories. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Remar Amanda Righetti Tessa Lewis Nikki DeLoach Mary Jeanne \"M.J.\" Bevans Jason Momoa Frankie Seau Kristoffer Polaha Jason Matthews Full Cast & Crew Last Season Season 1 — | 3 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on North Shore. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Soap Drama Keywords hotel hawaii Content Score 86 Almost there... Top Contributors 6 Banana a 3 asusar 2 seawolf s 2 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}