{"link": "https://www.themoviedb.org/tv/39692?language=en", "title": "Almost Heroes", "resume": "Almost Heroes was a Canadian comedy TV series that premiered on Thursday, June 2, 2011 on Showcase, and ran for one season before being discontinued by Showcase at the beginning of the 2011 fall season. The series is centered on the lives of two brothers, Pete and Terry, played by Ryan Belleville and Paul Campbell, running their late father's comic book store, \"The Silver Salmon\". The series was created by brothers Jason Belleville and Ryan Belleville. The series also stars well-known Canadian comedian Colin Mochrie. Canadian comedian Fraser Young is one of the writers and story editors for the show.", "rate": 60, "genre": ["Comedy"], "cast": ["Lauren Ash", "Colin Mochrie", "Athena Karkanis", "Ryan Belleville", "Meghan Heffern"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39692   Expand Almost Heroes   (2011) User Score Overview Almost Heroes was a Canadian comedy TV series that premiered on Thursday, June 2, 2011 on Showcase, and ran for one season before being discontinued by Showcase at the beginning of the 2011 fall season. The series is centered on the lives of two brothers, Pete and Terry, played by Ryan Belleville and Paul Campbell, running their late father's comic book store, \"The Silver Salmon\". The series was created by brothers Jason Belleville and Ryan Belleville. The series also stars well-known Canadian comedian Colin Mochrie. Canadian comedian Fraser Young is one of the writers and story editors for the show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lauren Ash Colin Mochrie Athena Karkanis Ryan Belleville Meghan Heffern Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of Almost Heroes premiered on June  2, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Almost Heroes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.showcase.ca/shows/showspage.aspx?Root_Title_Id Genres Comedy Keywords sibling relationship comic book store sitcom workplace comedy Content Score 86 Almost there... Top Contributors 6 Banana D 2 Daniel s 1 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}