{"link": "https://www.themoviedb.org/tv/7089?language=en", "title": "Head Case", "resume": "Head Case is a comedy starring Alexandra Wentworth as Dr. Elizabeth Goode, a therapist who treats Hollywood stars. Celebrities appear on the show as themselves. The show ran for three seasons, airing on the Starz TV Network, Wednesdays, at 10 p.m., EST.", "rate": 85, "genre": ["Comedy"], "cast": ["Steve Landesberg", "Alexandra Wentworth", "Michelle Arthur", "Rob Benedict", "Aris Alvarado"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7089   Expand Head Case   (2007) User Score Overview Head Case is a comedy starring Alexandra Wentworth as Dr. Elizabeth Goode, a therapist who treats Hollywood stars. Celebrities appear on the show as themselves. The show ran for three seasons, airing on the Starz TV Network, Wednesdays, at 10 p.m., EST. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Landesberg Alexandra Wentworth Michelle Arthur Rob Benedict Aris Alvarado Full Cast & Crew Last Season Season 3 2009 | 10 Episodes Season 3 of Head Case premiered on March 20, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply p Where can I see this again? Open 0 by pollyannacowgirl\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Head Case. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.starz.com/originals/HeadCase Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}