{"link": "https://www.themoviedb.org/tv/7517?language=en", "title": "The Kevin Bishop Show", "resume": "The Kevin Bishop Show was a sketch comedy written by and starring English comedian Kevin Bishop, part of the Star Stories team. The show was commissioned by Channel 4 for a six-part series starting on the 25th of July 2008 at 10pm. A pilot was broadcast on the 23rd of November 2007 as part of Channel 4's Comedy Showcase and the programme soon earned interest for its incredibly fast pace; 42 sketches were shown in 23 minutes. The show was nominated for Best New Comedy at the 2008 British Comedy Awards. The show started its second series on Friday the 31st of July 2009 at 10pm on Channel 4.", "rate": 50, "genre": ["Comedy"], "cast": ["Kevin Bishop", "Karen Gillan", "Oliver Maltman", "Hollie-Jay Bowes"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7517   Expand The Kevin Bishop Show   (2008) User Score Overview The Kevin Bishop Show was a sketch comedy written by and starring English comedian Kevin Bishop, part of the Star Stories team. The show was commissioned by Channel 4 for a six-part series starting on the 25th of July 2008 at 10pm. A pilot was broadcast on the 23rd of November 2007 as part of Channel 4's Comedy Showcase and the programme soon earned interest for its incredibly fast pace; 42 sketches were shown in 23 minutes. The show was nominated for Best New Comedy at the 2008 British Comedy Awards. The show started its second series on Friday the 31st of July 2009 at 10pm on Channel 4. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Bishop Karen Gillan Oliver Maltman Hollie-Jay Bowes Full Cast & Crew Last Season Season 2 2009 | 6 Episodes Season 2 of The Kevin Bishop Show premiered on July 31, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Kevin Bishop Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sketch comedy Content Score 86 Almost there... Top Contributors 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}