{"link": "https://www.themoviedb.org/tv/3605?language=en", "title": "Laguna Beach", "resume": "Like other teens in California, the lives of the Laguna Beach teenagers are filled with sandy beaches, beautiful friends and love triangles. But unlike other teens, they had cameras following them around. It may look like fantasyland, but they're not acting: they really are this rich and beautiful. For them, life really is a day at the beach.", "rate": 55, "genre": ["Drama", "Reality"], "cast": ["Raquel Donatell", "Kelan Hurley", "Chase Johnson", "Kyndra Mayo", "Tessa Keller"], "character": ["Herself", "Himself", "Himself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3605   Expand Laguna Beach   (2004) User Score  Play Trailer Overview Like other teens in California, the lives of the Laguna Beach teenagers are filled with sandy beaches, beautiful friends and love triangles. But unlike other teens, they had cameras following them around. It may look like fantasyland, but they're not acting: they really are this rich and beautiful. For them, life really is a day at the beach. Featured Crew Adam DiVello Creator Liz Gateley Creator Gary Auerbach Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Raquel Donatell Herself Kelan Hurley Himself Chase Johnson Himself Kyndra Mayo Herself Tessa Keller Herself Full Cast & Crew Last Season Season 3 2006 | 16 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Laguna Beach. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  22m Homepage   http://www.mtv.com/shows/laguna_beach/ Genres Drama Reality Keywords high school surfing california beach party teenager high school friends group of friends socialite high school sweetheart rich kids wealthy teens Content Score 100 Yes! Looking good! Top Contributors 120 Marr 🇳🇱 53 lmao7 c 23 courtneysmith86 17 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}