{"link": "https://www.themoviedb.org/tv/6214?language=en", "title": "The Stone Tape", "resume": "The Stone Tape is a television play directed by Peter Sasdy and starring Michael Bryant, Jane Asher, Michael Bates and Iain Cuthbertson. It was broadcast on BBC Two as a Christmas ghost story in 1972. Combining aspects of science fiction and horror, the story concerns a team of scientists who move into their new research facility, a renovated Victorian mansion that has a reputation for being haunted. The team investigate the phenomena, trying to determine if the stones of the building are acting as a recording medium for past events. However, their investigations serve only to unleash a darker, more malevolent force.\nThe Stone Tape was written by Nigel Kneale, best known as the writer of Quatermass. Its juxtaposition of science and superstition is a frequent theme in Kneale's work; in particular, his 1952 radio play You Must Listen, about a haunted telephone line, is a notable antecedent of The Stone Tape. The play was also inspired by a visit Kneale had paid to the BBC's research and development department, which is located in an old Victorian house in Kingswood, Surrey. Critically acclaimed at time of broadcast, it remains well regarded to this day as one of Nigel Kneale's best and most terrifying plays. Since its broadcast, the hypothesis of residual haunting – that ghosts are recordings of past events made by the natural environment – has come to be known as the \"Stone Tape Theory\".", "rate": 70, "genre": ["Drama"], "cast": ["Iain Cuthbertson", "Michael Bates", "Jane Asher", "Michael Bryant"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6214   Expand The Stone Tape   (1972) User Score Overview The Stone Tape is a television play directed by Peter Sasdy and starring Michael Bryant, Jane Asher, Michael Bates and Iain Cuthbertson. It was broadcast on BBC Two as a Christmas ghost story in 1972. Combining aspects of science fiction and horror, the story concerns a team of scientists who move into their new research facility, a renovated Victorian mansion that has a reputation for being haunted. The team investigate the phenomena, trying to determine if the stones of the building are acting as a recording medium for past events. However, their investigations serve only to unleash a darker, more malevolent force. The Stone Tape was written by Nigel Kneale, best known as the writer of Quatermass. Its juxtaposition of science and superstition is a frequent theme in Kneale's work; in particular, his 1952 radio play You Must Listen, about a haunted telephone line, is a notable antecedent of The Stone Tape. The play was also inspired by a visit Kneale had paid to the BBC's research and development department, which is located in an old Victorian house in Kingswood, Surrey. Critically acclaimed at time of broadcast, it remains well regarded to this day as one of Nigel Kneale's best and most terrifying plays. Since its broadcast, the hypothesis of residual haunting – that ghosts are recordings of past events made by the natural environment – has come to be known as the \"Stone Tape Theory\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Iain Cuthbertson Michael Bates Jane Asher Michael Bryant Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Stone Tape. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}