{"link": "https://www.themoviedb.org/tv/34186?language=en", "title": "Chi's Sweet Home", "resume": "Chi's Sweet Home is a manga series written and illustrated by Kanata Konami. It has been serialized in Kodansha's seinen manga magazine Weekly Morning since 2004. The manga has been licensed for North American distribution by Vertical Inc. To date, it has been collected in nine volumes, with the most recent being published in August 2012. An anime adaptation began airing on 31 March 2008 and was produced by studio Madhouse New Zealand distribution by Astro Awani.", "rate": 75, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34186   Expand Chi's Sweet Home   (2008) User Score Overview Chi's Sweet Home is a manga series written and illustrated by Kanata Konami. It has been serialized in Kodansha's seinen manga magazine Weekly Morning since 2004. The manga has been licensed for North American distribution by Vertical Inc. To date, it has been collected in nine volumes, with the most recent being published in August 2012. An anime adaptation began airing on 31 March 2008 and was produced by studio Madhouse New Zealand distribution by Astro Awani. Featured Crew Mitsuyuki Masuhara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2016 | 1 Episode Season 3 of Chi's Sweet Home premiered on October  6, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Chi's Sweet Home. You can help by rating TV shows you've seen. Facts Original Name  チーズスイートホーム Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  3m Homepage  - Genres Animation Comedy Keywords anime watercolour style short episodes Content Score 64 We're so close, yet so far. Top Contributors 12 Marr 🇳🇱 7 Despair-Paradise 6 Sergiojamon t 5 tmdb87307992  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}