{"link": "https://www.themoviedb.org/tv/18842?language=en", "title": "My Queen", "resume": "My Queen, also known as Defeated Queen or Queen of No Marriage, is a 2009 Taiwanese idol romantic-comedy television series. The television drama was produced by Sanlih E-Television starring Ethan Ruan as the male main lead and Cheryl Yang as the female main lead. It was first aired on January 4, 2009 on TTV after Invincible Shan Bao Mei and last aired on May 31, 2009.\nThe series was awarded the Best Channel Advertising on the 44th Golden Bell Awards.", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["James Wen", "Chen Bo Zheng", "Cheryl Yang", "Patrick Li", "Mario Ma"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18842   Expand My Queen   (2009) User Score Overview My Queen, also known as Defeated Queen or Queen of No Marriage, is a 2009 Taiwanese idol romantic-comedy television series. The television drama was produced by Sanlih E-Television starring Ethan Ruan as the male main lead and Cheryl Yang as the female main lead. It was first aired on January 4, 2009 on TTV after Invincible Shan Bao Mei and last aired on May 31, 2009. The series was awarded the Best Channel Advertising on the 44th Golden Bell Awards. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Wen Chen Bo Zheng Cheryl Yang Patrick Li Mario Ma Full Cast & Crew Last Season Season 1 2009 | 21 Episodes Season 1 of My Queen premiered on January  4, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Queen. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.iset.com.tw/metro/m123/ Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors k 3 khyungil 2 seawolf 1 Wendy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}