{"link": "https://www.themoviedb.org/tv/78544?language=en", "title": "My Brother Loves Me Too Much", "resume": "Setoka Tachibana is a female high school student who has confessed her feelings to other boys 12 times, but has been rebuffed each time. Her older brother Haruka Tachibana cares for his younger sister deeply, but he keeps secret from her that they are not blood related. One day, Setoka's first love Takane Serikawa appears after many years and approaches her.", "rate": 0, "genre": ["Comedy"], "cast": ["Tao Tsuchiya", "Ryota Katayose", "Yudai Chiba", "Takuya Kusakawa", "Ito Ono"], "character": ["Setoka Tachibana", "Haruka Tachibana", "Takane Serikawa", "Chiaki Mioka", "Chiyuki Mioka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78544   Expand My Brother Loves Me Too Much   (2017) User Score Overview Setoka Tachibana is a female high school student who has confessed her feelings to other boys 12 times, but has been rebuffed each time. Her older brother Haruka Tachibana cares for his younger sister deeply, but he keeps secret from her that they are not blood related. One day, Setoka's first love Takane Serikawa appears after many years and approaches her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tao Tsuchiya Setoka Tachibana Ryota Katayose Haruka Tachibana Yudai Chiba Takane Serikawa Takuya Kusakawa Chiaki Mioka Ito Ono Chiyuki Mioka Full Cast & Crew Last Season Season 1 2017 | 5 Episodes Season 1 of My Brother Loves Me Too Much premiered on April 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Brother Loves Me Too Much. You can help by rating TV shows you've seen. Facts Original Name  兄に愛されすぎて困ってます Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.ntv.co.jp/anikoma-drama/ Genres Comedy Keywords romance school shoujo Content Score 86 Almost there... Top Contributors M 34 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}