{"link": "https://www.themoviedb.org/tv/69507?language=en", "title": "Everest Rescue", "resume": "Journeys to the tops of the treacherous Everest Himalayan Mountains, highlighting the work of a rare breed of pilots who put their lives on the line to save those facing certain death. Featuring exclusive access to a group of diverse helicopter pilots as they manage emergency calls during the climbing season as well as intimate interviews with them and their loved ones.", "rate": 40, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69507   Expand Everest Rescue   (2017) User Score Overview Journeys to the tops of the treacherous Everest Himalayan Mountains, highlighting the work of a rare breed of pilots who put their lives on the line to save those facing certain death. Featuring exclusive access to a group of diverse helicopter pilots as they manage emergency calls during the climbing season as well as intimate interviews with them and their loved ones. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Everest Rescue premiered on January  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Everest Rescue. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://www.discovery.com/tv-shows/everest-rescue/ Genres Reality Keywords rescue mount everest Content Score 56 We're so close, yet so far. Top Contributors r 16 reinoutsmit 6 Elizabeth Jennings AK 3 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}