{"link": "https://www.themoviedb.org/tv/2830?language=en", "title": "It's About Time", "resume": "It's About Time is an American fantasy/science-fiction comedy TV series that aired on CBS for one season of 26 episodes in 1966–1967. The series was created by Sherwood Schwartz, and used sets, props and incidental music from Schwartz's other television series in production at the time, Gilligan's Island.", "rate": 60, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Joe E. Ross", "Imogene Coca", "Frank Aletter", "Jack Mullaney"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2830   Expand It's About Time   (1966) User Score Overview It's About Time is an American fantasy/science-fiction comedy TV series that aired on CBS for one season of 26 episodes in 1966–1967. The series was created by Sherwood Schwartz, and used sets, props and incidental music from Schwartz's other television series in production at the time, Gilligan's Island. Featured Crew Sherwood Schwartz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe E. Ross Imogene Coca Frank Aletter Jack Mullaney Full Cast & Crew Last Season Season 1 1966 | 26 Episodes Season 1 of It's About Time premiered on September 11, 1966. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Coming to DVD soon Open 1 by  Taylorfirst1 Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on It's About Time. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords prehistoric Content Score 79 Pump it up! We're close now. Top Contributors 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}