{"link": "https://www.themoviedb.org/tv/71199?language=en", "title": "Claws", "resume": "Follow the life and crimes of five diverse and treacherous manicurists working at the Nail Artisan of Manatee County salon, where there is a lot more going on than silk wraps and pedicures.", "rate": 58, "genre": ["Comedy", "Drama"], "cast": ["Niecy Nash", "Karrueche Tran", "Carrie Preston", "Jenn Lyon", "Judy Reyes"], "character": ["Desna", "Virginia", "Polly", "Jennifer", "Quiet Ann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71199   Expand Claws   (2017) User Score  Play Trailer Overview Follow the life and crimes of five diverse and treacherous manicurists working at the Nail Artisan of Manatee County salon, where there is a lot more going on than silk wraps and pedicures. Featured Crew Eliot Laurence Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Niecy Nash Desna Karrueche Tran Virginia Carrie Preston Polly Jenn Lyon Jennifer Judy Reyes Quiet Ann Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of Claws premiered on June 10, 2018. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Thoughts on when Roller is free... Open 30 by  ScorpionQ2 Roller is one Effed up Dude. . . Open 8 by  Poetist j Wait ... so (spoilers from 6/25 ep) Open 6 by  ScorpionQ2 Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations   2017-02-07 Imposters 7.6    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1    2018-02-26 Good Girls 5.8    2017-09-27 SEAL Team 6.6    2018-03-13 For The People 6.5    2018-04-08 Killing Eve 8.7    2017-01-06 One Day at a Time 6.6    2016-06-21 Greenleaf 6.8  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  55m Homepage   http://www.tntdrama.com/shows/claws Genres Comedy Drama Keywords dark comedy Content Score 100 Yes! Looking good! Top Contributors 57 Elizabeth Jennings 12 天之行者 s 4 speedycars 3 Mervan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}