{"link": "https://www.themoviedb.org/tv/70597?language=en", "title": "Les Enquêtes du commissaire Maigret", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 100, "genre": ["Crime"], "cast": ["Jean Richard", "François Cadet", "Annick Tanguy", "Jean-François Devaux", "Jean-Pierre Maurin"], "character": ["Commissaire Jules Maigret", "Lucas", "Mme Maigret", "Janvier", "L'inspecteur Janvier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70597   Expand Les Enquêtes du commissaire Maigret   (1967) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Claude Barma Creator Georges Simenon Creator Jacques Rémy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jean Richard Commissaire Jules Maigret François Cadet Lucas Annick Tanguy Mme Maigret Jean-François Devaux Janvier Jean-Pierre Maurin L'inspecteur Janvier Full Cast & Crew Last Season Season 1 1967 | 88 Episodes Season 1 of Les Enquêtes du commissaire Maigret premiered on October 14, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Les Enquêtes du commissaire Maigret. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  French Runtime  - Homepage   https://serierichard.enquetes-de-maigret.com Genres Crime Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 26 zoroman1975 AM 13 Audrey Mann 10 waaw 8 yannkallander  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}