{"link": "https://www.themoviedb.org/tv/3506?language=en", "title": "Talk to Me", "resume": "Talk to Me is a British television serial, written by writer Danny Brocklehurst, produced by Company Pictures for ITV. The four-part serial began on 10 June 2007 and stars Max Beesley as Mitch Moore, a womanising radio host whose producer is also his best mate and about to get married to Claire. She is a new mother, experiencing the emotional crunch of returning to her office job after maternity leave. Mitch was in love with Clare and after Clare had an argument with her fiancé, she and Mitch slept together. Clare walked out on him telling him it was a one-off but later they had sex in his car. Clare eventually breaks her affair with Mitch off, but feeling guilty she tells her fiancé what she has done. He walks out on her and takes their baby son. He then punches Mitch and tells him they are no longer friends. Clare and her fiancé eventually reconcile when Mitch makes a heartfelt plea on his radio station, Mitch is left with no one.\nIt was announced in early 2007 under the working title Is This Love?. ITV commissioned the show in a bid to rebrand their channel for a younger audience, Laura Mackie's first show since becoming controller of drama, she stated that Talk to Me is the template for their new output - sexy, stylish and contemporary. The first episode attracted 4.2 million viewers, growing to 5.5 million in its second week. The series was released on DVD by Granada Ventures on 9 July 2007.", "rate": 50, "genre": ["Drama"], "cast": ["Emma Pierson", "Max Beesley", "Kate Ashfield", "Laura Fraser", "Joseph Millson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3506   Expand Talk to Me   (2007) User Score Overview Talk to Me is a British television serial, written by writer Danny Brocklehurst, produced by Company Pictures for ITV. The four-part serial began on 10 June 2007 and stars Max Beesley as Mitch Moore, a womanising radio host whose producer is also his best mate and about to get married to Claire. She is a new mother, experiencing the emotional crunch of returning to her office job after maternity leave. Mitch was in love with Clare and after Clare had an argument with her fiancé, she and Mitch slept together. Clare walked out on him telling him it was a one-off but later they had sex in his car. Clare eventually breaks her affair with Mitch off, but feeling guilty she tells her fiancé what she has done. He walks out on her and takes their baby son. He then punches Mitch and tells him they are no longer friends. Clare and her fiancé eventually reconcile when Mitch makes a heartfelt plea on his radio station, Mitch is left with no one. It was announced in early 2007 under the working title Is This Love?. ITV commissioned the show in a bid to rebrand their channel for a younger audience, Laura Mackie's first show since becoming controller of drama, she stated that Talk to Me is the template for their new output - sexy, stylish and contemporary. The first episode attracted 4.2 million viewers, growing to 5.5 million in its second week. The series was released on DVD by Granada Ventures on 9 July 2007. Featured Crew Danny Brocklehurst Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emma Pierson Max Beesley Kate Ashfield Laura Fraser Joseph Millson Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Talk to Me. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors g 2 goobster 1 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}