{"link": "https://www.themoviedb.org/tv/779?language=en", "title": "McCallum", "resume": "McCallum is a British television series that was produced by STV Productions.\nDr Iain McCallum was the original lead character, played by John Hannah. McCallum was a forensic pathologist who traveled by Triumph Motorcycle, and solved murders. The character had romantic involvements with two of the other principal characters, Joanna, and later Angela. The last episode did not include McCallum and Angela as the story stated that they had taken jobs in America. They were replaced by Dr. Dan Gallagher and Dr. Charley Fielding.", "rate": 80, "genre": ["Drama"], "cast": ["John Hannah", "James Saxon", "Gerard Murphy", "Richard O'Callaghan", "Zara Turner"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 779   Expand McCallum   (1997) User Score Overview McCallum is a British television series that was produced by STV Productions. Dr Iain McCallum was the original lead character, played by John Hannah. McCallum was a forensic pathologist who traveled by Triumph Motorcycle, and solved murders. The character had romantic involvements with two of the other principal characters, Joanna, and later Angela. The last episode did not include McCallum and Angela as the story stated that they had taken jobs in America. They were replaced by Dr. Dan Gallagher and Dr. Charley Fielding. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Hannah James Saxon Gerard Murphy Richard O'Callaghan Zara Turner Full Cast & Crew Last Season Season 3 1999 | 1 Episode Season 3 of McCallum premiered on December 14, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on McCallum. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 kcdh TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}