{"link": "https://www.themoviedb.org/tv/7246?language=en", "title": "Blackadder", "resume": "Blackadder is the name that encompassed four series of a BBC 1 period British sitcom, along with several one-off instalments. All television episodes starred Rowan Atkinson as anti-hero Edmund Blackadder and Tony Robinson as Blackadder's dogsbody, Baldrick. Each series was set in a different historical period with the two protagonists accompanied by different characters, though several reappear in one series or another, for example Melchett and Lord Flashheart.\nThe first series titled The Black Adder was written by Richard Curtis and Rowan Atkinson, while subsequent episodes were written by Curtis and Ben Elton. The shows were produced by John Lloyd. In 2000 the fourth series, Blackadder Goes Forth, ranked at 16 in the \"100 Greatest British Television Programmes\", a list created by the British Film Institute. Also in the 2004 TV poll to find \"Britain's Best Sitcom\", Blackadder was voted the second-best British sitcom of all time, topped by Only Fools and Horses. It was also ranked as the 20th-best TV show of all time by Empire magazine.", "rate": 78, "genre": ["Comedy", "War", "Politics"], "cast": ["Rowan Atkinson", "Tony Robinson", "Stephen Fry", "Hugh Laurie", "Tim McInnerny"], "character": ["Captain Edmund Blackadder", "Private S. Baldrick", "General Sir Anthony Cecil Hogmanay Melchett", "Lieutenant The Honourable George Colthurst St. Barleigh", "Captain Kevin Darling"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7246   Expand Blackadder   (1983) User Score Overview Blackadder is the name that encompassed four series of a BBC 1 period British sitcom, along with several one-off instalments. All television episodes starred Rowan Atkinson as anti-hero Edmund Blackadder and Tony Robinson as Blackadder's dogsbody, Baldrick. Each series was set in a different historical period with the two protagonists accompanied by different characters, though several reappear in one series or another, for example Melchett and Lord Flashheart. The first series titled The Black Adder was written by Richard Curtis and Rowan Atkinson, while subsequent episodes were written by Curtis and Ben Elton. The shows were produced by John Lloyd. In 2000 the fourth series, Blackadder Goes Forth, ranked at 16 in the \"100 Greatest British Television Programmes\", a list created by the British Film Institute. Also in the 2004 TV poll to find \"Britain's Best Sitcom\", Blackadder was voted the second-best British sitcom of all time, topped by Only Fools and Horses. It was also ranked as the 20th-best TV show of all time by Empire magazine. Featured Crew Richard Curtis Creator Rowan Atkinson Creator Ben Elton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  3 Images Backdrops  10 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rowan Atkinson Captain Edmund Blackadder Tony Robinson Private S. Baldrick Stephen Fry General Sir Anthony Cecil Hogmanay Melchett Hugh Laurie Lieutenant The Honourable George Colthurst St. Barleigh Tim McInnerny Captain Kevin Darling Full Cast & Crew Last Season Blackadder Goes Forth 1989 | 6 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Which series was the best? Open 1 by  SnorreSelmer Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  8 Recommendations   1975-09-19 Fawlty Towers 8.1    1995-04-21 Father Ted 7.9    1988-02-15 Red Dwarf 8.0    1969-10-05 Monty Python's Flying Circus 8.2    1982-11-09 The Young Ones 7.6    2004-05-18 The Mighty Boosh 7.5    2003-09-11 QI 8.2    1990-01-01 Mr. Bean 7.8  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  32m Homepage   http://www.bbc.co.uk/programmes/b006xxw3 Genres Comedy War & Politics Keywords war army england world war i servant prince dark comedy satire queen elizabeth i history middle ages british comedy sitcom british humour period sitcom Content Score 93 Almost there... Top Contributors 67 kcdh 47 ElgarL 36 TonAngel t 33 tmdb55614855  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}