{"link": "https://www.themoviedb.org/tv/33530?language=en", "title": "The Great Rift: Africa's Wild Heart", "resume": "A BBC/Animal Planet co-production, the three-part series focuses on the landscape and wildlife of the Great Rift Valley in East Africa.", "rate": 80, "genre": ["Documentary"], "cast": ["Hugh Quarshie"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33530   Expand The Great Rift: Africa's Wild Heart   (2010) User Score Overview A BBC/Animal Planet co-production, the three-part series focuses on the landscape and wildlife of the Great Rift Valley in East Africa. Featured Crew Phil Chapman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  9 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Quarshie Narrator Full Cast & Crew Last Season Season 1 2010 | 3 Episodes Season 1 of The Great Rift: Africa's Wild Heart premiered on January 24, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Great Rift: Africa's Wild Heart. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  11 Recommendations We don't have enough data to suggest any TV shows based on The Great Rift: Africa's Wild Heart. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00mfldk Genres Documentary Keywords africa gorilla lion hippopotamus coral reef volcano miniseries geography african wilderness nature documentary serengeti Content Score 64 We're so close, yet so far. Top Contributors TB 35 TMDb Bot R 12 Rebecca r 6 robko22 A 5 Asterix_cz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}