{"link": "https://www.themoviedb.org/tv/2452?language=en", "title": "Cha Cha Cha", "resume": "Cha Cha Cha was an Argentine sketch comedy television program aired in the 1990s on América TV, starring Alfredo Casero, Fabio Alberti, Diego Capusotto, and others. It was characterized by absurd humour, sometimes bordering on the surreal. In 2012 it was announced by Casero that the show will return as a motion picture.", "rate": 0, "genre": [], "cast": ["Alfredo Casero", "Diego Capusotto", "Mex Urtizberea"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2452   Expand Cha Cha Cha   (1993) User Score Overview Cha Cha Cha was an Argentine sketch comedy television program aired in the 1990s on América TV, starring Alfredo Casero, Fabio Alberti, Diego Capusotto, and others. It was characterized by absurd humour, sometimes bordering on the surreal. In 2012 it was announced by Casero that the show will return as a motion picture. Featured Crew Alfredo Casero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alfredo Casero Diego Capusotto Mex Urtizberea Full Cast & Crew Last Season Season 4 1997 | 17 Episodes Season 4 of Cha Cha Cha premiered on April 16, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Cha Cha Cha. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 21 Xenus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}