{"link": "https://www.themoviedb.org/tv/3873?language=en", "title": "Strange", "resume": "The world of John Strange is no ordinary place - full of malevolent demons that must be stopped from wreaking havoc upon the Earth. In his quest he is joined by nurse Jude Atkins, computer whiz Toby and Kevin, a man who can pick up on strange vibes. But the mysterious Canon Black remains a thorn in John's side, fervent in his efforts to prove the non-existence of anything remotely demonic or paranormal...", "rate": 60, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Richard Coyle", "Ian Richardson", "Samantha Womack", "Andrew-Lee Potts", "Samuel Barnett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3873   Expand Strange   (2002) User Score Overview The world of John Strange is no ordinary place - full of malevolent demons that must be stopped from wreaking havoc upon the Earth. In his quest he is joined by nurse Jude Atkins, computer whiz Toby and Kevin, a man who can pick up on strange vibes. But the mysterious Canon Black remains a thorn in John's side, fervent in his efforts to prove the non-existence of anything remotely demonic or paranormal... Featured Crew Andrew Marshall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Coyle Ian Richardson Samantha Womack Andrew-Lee Potts Samuel Barnett Full Cast & Crew Last Season Season 1 2002 | 8 Episodes Season 1 of Strange premiered on March  9, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Strange. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/cult/strange/ Genres Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 5 Rebecca 1 rudely_murray 1 Elizabeth Jennings 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}