{"link": "https://www.themoviedb.org/tv/24769?language=en", "title": "Studs Lonigan", "resume": "The story of the Irish-American Lonigan family between 1918 and 1930.", "rate": 95, "genre": ["Drama"], "cast": ["Harry Hamlin", "Brad Dourif", "Charles Durning", "Mare Winningham", "Colleen Dewhurst"], "character": ["Bill 'Studs' Lonigan", "Danny O'Neill", "Paddy Lonigan", "Helen Shyers", "Mary Lonigan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24769   Expand Studs Lonigan   (1979) User Score Overview The story of the Irish-American Lonigan family between 1918 and 1930. Featured Crew James T. Farrell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Harry Hamlin Bill 'Studs' Lonigan Brad Dourif Danny O'Neill Charles Durning Paddy Lonigan Mare Winningham Helen Shyers Colleen Dewhurst Mary Lonigan Full Cast & Crew Last Season Miniseries 1979 | 3 Episodes Season 1 of Studs Lonigan premiered on March  6, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Studs Lonigan. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Drama Keywords chicago immigrant irish-american coming of age miniseries period drama 1920s Content Score 79 Pump it up! We're close now. Top Contributors C 31 CABJ 9 Banana TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}