{"link": "https://www.themoviedb.org/tv/46331?language=en", "title": "Under the Dome", "resume": "Under the Dome is based on the novel of the same name by Stephen King. It tells the story of the residents of the small town of Chester's Mill in Maine, where a massive, transparent, indestructible dome suddenly cuts them off from the rest of the world. With no Internet access, no mobile signals and limited radio communication, the people trapped inside must find their own ways to survive with diminishing resources and rising tensions. While military forces, the government and the media positioned outside of this surrounding barrier attempt to break it down, a small group of people inside attempt to figure out what the dome is, where it came from, and when (and if) it will go away.", "rate": 62, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Mike Vogel", "Rachelle Lefevre", "Alexander Koch", "Eddie Cahill", "Colin Ford"], "character": ["Dale \"Barbie\" Barbara", "Julia Shumway", "Junior Rennie", "Sam Verdreaux", "Joe McAlister"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46331   Expand Under the Dome   (2013) User Score  Play Trailer Overview Under the Dome is based on the novel of the same name by Stephen King. It tells the story of the residents of the small town of Chester's Mill in Maine, where a massive, transparent, indestructible dome suddenly cuts them off from the rest of the world. With no Internet access, no mobile signals and limited radio communication, the people trapped inside must find their own ways to survive with diminishing resources and rising tensions. While military forces, the government and the media positioned outside of this surrounding barrier attempt to break it down, a small group of people inside attempt to figure out what the dome is, where it came from, and when (and if) it will go away. Featured Crew Stephen King Creator Brian K. Vaughan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  14 Posters  19 Videos Trailers  1 Teasers  1 Clips  1 Featurettes  0 Opening Credits  1 Top Billed Cast Mike Vogel Dale \"Barbie\" Barbara Rachelle Lefevre Julia Shumway Alexander Koch Junior Rennie Eddie Cahill Sam Verdreaux Colin Ford Joe McAlister Full Cast & Crew Last Season Season 3 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Such a shame Open 0 by GrandTardigrade\n      \n     Go to Discussions Media Most Popular Videos  4 Backdrops  14 Posters  19 Recommendations   2011-06-19 Falling Skies 6.4    2013-04-15 Defiance 6.2    2012-09-17 Revolution 6.0    2012-05-27 Continuum 7.1    2009-07-07 Warehouse 13 7.2    2008-09-09 Fringe 8.1    2006-09-25 Heroes 6.9    2014-07-09 Extant 6.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/under-the-dome/ Genres Drama Mystery Sci-Fi & Fantasy Keywords small town based on novel or book police officer trapped corrupt politician dome invisible barrier force field Content Score 100 Yes! Looking good! Top Contributors 152 seawolf 56 Elizabeth Jennings 41 Marr 🇳🇱 31 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}