{"link": "https://www.themoviedb.org/tv/1732?language=en", "title": "Flight 29 Down", "resume": "Flight 29 Down is a television series about a group of teenagers who are stranded on an island. It was produced by Discovery Kids. The show was created by Stan Rogow and D. J. MacHale. The executive producers are Rogow, MacHale, Shauna Shapiro Jackson, and Gina & Rann Watumull. The first two seasons aired on Discovery Kids.\nThe \"third season\" of the series, which started filming February 5, 2007, was produced as a four-part film, instead of the episodic format of the first two seasons. A promo debuted for Flight 29 Down: The Movie during the second season finale.\nThe show was filmed in O'ahu, Hawaii.", "rate": 75, "genre": ["Action", "Adventure", "Drama"], "cast": ["John Kapelos", "Allen Alvarado", "Johnny Pacar", "Kristy Wu", "Corbin Bleu"], "character": ["Lex Marin", "Cody Jackson", "Melissa Wu", "Nathan McHugh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1732   Expand Flight 29 Down   (2005) User Score Overview Flight 29 Down is a television series about a group of teenagers who are stranded on an island. It was produced by Discovery Kids. The show was created by Stan Rogow and D. J. MacHale. The executive producers are Rogow, MacHale, Shauna Shapiro Jackson, and Gina & Rann Watumull. The first two seasons aired on Discovery Kids. The \"third season\" of the series, which started filming February 5, 2007, was produced as a four-part film, instead of the episodic format of the first two seasons. A promo debuted for Flight 29 Down: The Movie during the second season finale. The show was filmed in O'ahu, Hawaii. Featured Crew Stan Rogow Creator D. J. MacHale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Kapelos Allen Alvarado Lex Marin Johnny Pacar Cody Jackson Kristy Wu Melissa Wu Corbin Bleu Nathan McHugh Full Cast & Crew Last Season Season 2 2006 | 12 Episodes Season 2 of Flight 29 Down premiered on September  9, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Flight 29 Down. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage   http://www.kids.discovery.com/fansites/29down/29down.html Genres Action & Adventure Drama Keywords survivor airplane crash teenager Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana i 3 ismax935 2 lineker 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}