{"link": "https://www.themoviedb.org/tv/364?language=en", "title": "Sealab 2020", "resume": "Sealab 2020 is an American animated television series produced by Hanna-Barbera. The show premiered on NBC on September 9, 1972. The series aired its 13th and final episode on December 2, 1972, with three episodes unaired. As with most Hanna-Barbera series, the show is in occasional rotation on Boomerang, the TV channel that owns the Hanna-Barbera archives.", "rate": 80, "genre": ["Sci-Fi", "Fantasy", "Animation", "Family"], "cast": ["Pamelyn Ferdin", "John Stephenson", "Jerry Dexter", "Ann Jillian", "Ross Martin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 364   Expand Sealab 2020   (1972) User Score Overview Sealab 2020 is an American animated television series produced by Hanna-Barbera. The show premiered on NBC on September 9, 1972. The series aired its 13th and final episode on December 2, 1972, with three episodes unaired. As with most Hanna-Barbera series, the show is in occasional rotation on Boomerang, the TV channel that owns the Hanna-Barbera archives. Featured Crew Joseph Barbera Creator William Hanna Creator Alex Toth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Pamelyn Ferdin John Stephenson Jerry Dexter Ann Jillian Ross Martin Full Cast & Crew Last Season Season 1 1972 | 15 Episodes Season 1 of Sealab 2020 premiered on September  9, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sealab 2020. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  20m, 30m Homepage  - Genres Sci-Fi & Fantasy Animation Family Keywords future underwater Content Score 100 Yes! Looking good! Top Contributors 11 Banana 2 Steve TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}