{"link": "https://www.themoviedb.org/tv/11222?language=en", "title": "MonsterVision", "resume": "MonsterVision is an American variety series that aired on TNT from March 1, 1993 to September 2000. The series was hosted by Joe Bob Briggs from 1995 to 2000, and featured classic B and cult films from the 1960s, 1970s, and 1980s.\nPenn and Teller guest-hosted MonsterVision marathons before Briggs came on board as the full-time host. Late in its run, the show changed formats, discarded \"Last Call,\" and became Joe Bob's Hollywood Saturday Night and Monstervision.", "rate": 87, "genre": ["Comedy"], "cast": ["John Bloom"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11222   Expand MonsterVision   (1993) User Score Overview MonsterVision is an American variety series that aired on TNT from March 1, 1993 to September 2000. The series was hosted by Joe Bob Briggs from 1995 to 2000, and featured classic B and cult films from the 1960s, 1970s, and 1980s. Penn and Teller guest-hosted MonsterVision marathons before Briggs came on board as the full-time host. Late in its run, the show changed formats, discarded \"Last Call,\" and became Joe Bob's Hollywood Saturday Night and Monstervision. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Bloom Full Cast & Crew Last Season Season 1 1998 | 133 Episodes Season 1 of MonsterVision premiered on October 31, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on MonsterVision. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}