{"link": "https://www.themoviedb.org/tv/2635?language=en", "title": "All Gas and Gaiters", "resume": "All Gas and Gaiters is a British television ecclesiastical sitcom which aired on BBC1 from 1966 to 1971. It was written by Pauline Devaney and Edwin Apps, a husband-and-wife team who used the pseudonym of \"John Wraith\" when writing the pilot. All Gas and Gaiters was also broadcast on BBC Radio from 1971 to 1972.", "rate": 60, "genre": ["Comedy"], "cast": ["John Barron", "Ernest Clark", "Derek Nimmo", "Robertson Hare", "Joan Sanderson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2635   Expand All Gas and Gaiters   (1966) User Score Overview All Gas and Gaiters is a British television ecclesiastical sitcom which aired on BBC1 from 1966 to 1971. It was written by Pauline Devaney and Edwin Apps, a husband-and-wife team who used the pseudonym of \"John Wraith\" when writing the pilot. All Gas and Gaiters was also broadcast on BBC Radio from 1971 to 1972. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Barron Ernest Clark  Derek Nimmo Robertson Hare Joan Sanderson Full Cast & Crew Last Season Season 5 1971 | 6 Episodes Season 5 of All Gas and Gaiters premiered on May 13, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on All Gas and Gaiters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords church sitcom british humour Content Score 71 Just a little bit more... Top Contributors O 7 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}