{"link": "https://www.themoviedb.org/tv/72641?language=en", "title": "Loving U Mr Photographer", "resume": "Because of his dreams of modeling, Aira willingly swallows every temperament and warmth of Jemy. However, without realizing every quarrel gave birth to love. Other people do not know that they are not love, Jemy and Aira are just so ravenous to know new love.", "rate": 0, "genre": ["Drama"], "cast": ["Hannah Delisha", "Syafiq Kyle", "Arash Mohd", "Marisa Yasmin"], "character": ["Aira Qaisara", "Jemy", "Tan Sri Megat", "Marlia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72641   Expand Loving U Mr Photographer   (2017) User Score Overview Because of his dreams of modeling, Aira willingly swallows every temperament and warmth of Jemy. However, without realizing every quarrel gave birth to love. Other people do not know that they are not love, Jemy and Aira are just so ravenous to know new love. Featured Crew Eyra Rahman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hannah Delisha Aira Qaisara Syafiq Kyle Jemy Arash Mohd Tan Sri Megat Marisa Yasmin Marlia Full Cast & Crew Last Season Season 1 2017 | 1 Episode Season 1 of Loving U Mr Photographer premiered on July  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Loving U Mr Photographer. You can help by rating TV shows you've seen. Facts Original Name  Mencintaimu Mr Photographer Status  Returning Series Network Astro Ria Certification  - Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 20 CyberTech 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}