{"link": "https://www.themoviedb.org/tv/43979?language=en", "title": "Dino Mech Gaiking", "resume": "Demon Dragon of the Heavens Gaiking was a Japanese Super Robot mecha anime series produced by Toei Animation.\nIt ran from April 1976 through January 1977 and consisted of 44 26-minute episodes. Gaiking was notable for being one of the few super robot series to take place in real places outside of Japan, and for being the first Super Robot series to have a mobile carrier for the chief robots. In the USA, Gaiking was part of Mattel's popular Shogun Warriors import toy line of the late 1970s and Jim Terry's Force Five anthology series. In 2005, a remake titled \"Gaiking: Legend of Daiku-Maryu\" was produced. In 2009, William Winckler Productions produced three all new English dubbed movie versions edited from the original series. Producer William Winckler, known for Tekkaman the Space Knight, wrote, produced and directed the English films, which are seen on broadband in Japan. On March 28, 2010, a Live-Action Movie based on the series, simply entitled, Gaiking, was announced at the 2010 Tokyo Animation Fair. An international production will be helmed by Toei Animation, Gale Anne Hurd via Valhalla Entertainment and All Nippon Entertainment Works, but the year of production is still unknown.", "rate": 0, "genre": ["Animation"], "cast": ["Keaton Yamada", "Akira Kamiya", "Hidekatsu Shibata", "Mami Koyama", "Noriko Tsukase"], "character": ["Gen Sakon (voice)", "Sanshirō Tsuwabuki (voice)", "Dr. Daimonji (voice)", "Midori Fujiyama (voice)", "Hachiro (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43979   Expand Dino Mech Gaiking   (1976) User Score Overview Demon Dragon of the Heavens Gaiking was a Japanese Super Robot mecha anime series produced by Toei Animation. It ran from April 1976 through January 1977 and consisted of 44 26-minute episodes. Gaiking was notable for being one of the few super robot series to take place in real places outside of Japan, and for being the first Super Robot series to have a mobile carrier for the chief robots. In the USA, Gaiking was part of Mattel's popular Shogun Warriors import toy line of the late 1970s and Jim Terry's Force Five anthology series. In 2005, a remake titled \"Gaiking: Legend of Daiku-Maryu\" was produced. In 2009, William Winckler Productions produced three all new English dubbed movie versions edited from the original series. Producer William Winckler, known for Tekkaman the Space Knight, wrote, produced and directed the English films, which are seen on broadband in Japan. On March 28, 2010, a Live-Action Movie based on the series, simply entitled, Gaiking, was announced at the 2010 Tokyo Animation Fair. An international production will be helmed by Toei Animation, Gale Anne Hurd via Valhalla Entertainment and All Nippon Entertainment Works, but the year of production is still unknown. Featured Crew Gou Nagai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keaton Yamada Gen Sakon (voice) Akira Kamiya Sanshirō Tsuwabuki (voice) Hidekatsu Shibata Dr. Daimonji (voice) Mami Koyama Midori Fujiyama (voice) Noriko Tsukase Hachiro (voice) Full Cast & Crew Last Season Season 1 1976 | 44 Episodes Season 1 of Dino Mech Gaiking premiered on April  1, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dino Mech Gaiking. You can help by rating TV shows you've seen. Facts Original Name  大空魔竜ガイキング Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 13 tmdb983464 7 BlackDelivery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}