{"link": "https://www.themoviedb.org/tv/377?language=en", "title": "So Haunt Me", "resume": "So Haunt Me is a British television sitcom about a family that moves into a home occupied by the ghost of its previous resident, a middle-aged Jewish mother. The show was produced by Cinema Verity for the BBC and originally aired from 1992 to 1994.\nPeter Rokeby loses his job as advertising copywriter, and resolves to become a freelance writer. Owing to this change in circumstances, he and his wife Sally move with their children into a more modest home in Meadow Road, Willesden. The family soon finds that the ghost of a previous owner, Yetta Feldman, still occupies the residence, and has been scaring occupants away for years. Yetta is a stereotypical interfering, middle-aged Jewish mother who died suddenly after choking on a chicken bone. While Sally can both see and speak to their ghost, Peter — much to his frustration — initially cannot. The family agrees to help Yetta find her grown-up daughter Carole.\nSo Haunt Me aired on BBC1 as 18 half-hour episodes in three series and one special from 1992 to 1994. The show was created by Paul Mendelson. The Rokeby children David and Tammy were played by Jeremy Green and Laura Howard respectively. Neighbour Mr Bloom was played by David Graham.", "rate": 73, "genre": ["Comedy"], "cast": ["Tessa Peake-Jones", "Miriam Karlin", "George Costigan", "Laura Howard"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 377   Expand So Haunt Me   (1992) User Score Overview So Haunt Me is a British television sitcom about a family that moves into a home occupied by the ghost of its previous resident, a middle-aged Jewish mother. The show was produced by Cinema Verity for the BBC and originally aired from 1992 to 1994. Peter Rokeby loses his job as advertising copywriter, and resolves to become a freelance writer. Owing to this change in circumstances, he and his wife Sally move with their children into a more modest home in Meadow Road, Willesden. The family soon finds that the ghost of a previous owner, Yetta Feldman, still occupies the residence, and has been scaring occupants away for years. Yetta is a stereotypical interfering, middle-aged Jewish mother who died suddenly after choking on a chicken bone. While Sally can both see and speak to their ghost, Peter — much to his frustration — initially cannot. The family agrees to help Yetta find her grown-up daughter Carole. So Haunt Me aired on BBC1 as 18 half-hour episodes in three series and one special from 1992 to 1994. The show was created by Paul Mendelson. The Rokeby children David and Tammy were played by Jeremy Green and Laura Howard respectively. Neighbour Mr Bloom was played by David Graham. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tessa Peake-Jones Miriam Karlin George Costigan Laura Howard Full Cast & Crew Last Season Season 3 1994 | 6 Episodes Season 3 of So Haunt Me premiered on January  2, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on So Haunt Me. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}