{"link": "https://www.themoviedb.org/tv/73066?language=en", "title": "La Luna Sangre", "resume": "La Luna Sangre is the third installment to Lobo, and Imortal, two series that revolve around the tales of wolves, vampires and humans. From Lyka and Noah’s love that defied fate to Lia and Mateo’s love that conquered the long-standing feud between their clans comes the continuation of Philippine TV’s most powerful love story. Malia, Mateo and Lia’s daughter, finds her place in the world of mortals, while training for the time when she must fight against the cursed vampire, Supremo. But while preparing for her destined battle, she meets Tristan, a man whose past experiences will turn him into someone that will love but also destroy Malia. Witness this action-packed, fantasy-drama starred by the country’s premiere love team and a powerhouse cast!", "rate": 0, "genre": ["Drama", "Action", "Adventure"], "cast": ["Kathryn Bernardo", "Daniel Padilla"], "character": ["Malia Rodriguez", "filikula.co"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73066   Expand La Luna Sangre   (2017) User Score Overview La Luna Sangre is the third installment to Lobo, and Imortal, two series that revolve around the tales of wolves, vampires and humans. From Lyka and Noah’s love that defied fate to Lia and Mateo’s love that conquered the long-standing feud between their clans comes the continuation of Philippine TV’s most powerful love story. Malia, Mateo and Lia’s daughter, finds her place in the world of mortals, while training for the time when she must fight against the cursed vampire, Supremo. But while preparing for her destined battle, she meets Tristan, a man whose past experiences will turn him into someone that will love but also destroy Malia. Witness this action-packed, fantasy-drama starred by the country’s premiere love team and a powerhouse cast! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kathryn Bernardo Malia Rodriguez Daniel Padilla filikula.co Full Cast & Crew Last Season Season 1 2017 | 1 Episode Season 1 of La Luna Sangre premiered on June 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on La Luna Sangre. You can help by rating TV shows you've seen. Facts Status  In Production Networks - Certification  - Type  Scripted Original Language  Tagalog Runtime  - Homepage   https://www.filikula.co Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors a 16 abceejkl 5 denxo A 2 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}