{"link": "https://www.themoviedb.org/tv/66612?language=en", "title": "Neil Gaiman's Likely Stories", "resume": "A unique collection of extraordinary fantastical short stories from the pen of Neil Gaiman, directed by Iain Forsyth & Jane Pollard. With a score by Jarvis Cocker and starring a host of British acting talent led by Tom Hughes, Johnny Vegas, George MacKay, Rita Tushingham and Kenneth Cranham.", "rate": 58, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66612   Expand Neil Gaiman's Likely Stories   (2016) User Score  Play Trailer Overview A unique collection of extraordinary fantastical short stories from the pen of Neil Gaiman, directed by Iain Forsyth & Jane Pollard. With a score by Jarvis Cocker and starring a host of British acting talent led by Tom Hughes, Johnny Vegas, George MacKay, Rita Tushingham and Kenneth Cranham. Featured Crew Neil Gaiman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of Neil Gaiman's Likely Stories premiered on May 26, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   2012-09-11 The New Normal 5.2    2016-10-06 Yuri!!! on Ice 8.3    2003-01-17 That's So Raven 5.6  Facts Status  Returning Series Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  - Homepage   https://www.sky.com/watch/channel/sky-arts/neil-gaimans-likely-stories Genres Drama Keywords anthology based on short story Content Score 71 Just a little bit more... Top Contributors 23 Elizabeth Jennings 4 Banana z 3 zurman1 3 stego77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}