{"link": "https://www.themoviedb.org/tv/202?language=en", "title": "Nighty Night", "resume": "Nighty Night is a British dark comedy sitcom written by and starring Julia Davis. It was first broadcast on 6 January 2004 on BBC Three before moving to BBC2.\nNotorious for its dark humour, the show follows narcissistic sociopath Jill Tyrell – who manages a beauty parlour alongside her moronic, asthmatic assistant Linda – as she learns that her husband has cancer. She uses this fact to manipulate new neighbour Cathy Cole, a wheelchair user with multiple sclerosis whose husband Don, a womanising doctor, Jill has become obsessed with.\nThe theme tune used in the beginning of both series and during the closing credits for the first is an excerpt from the spaghetti western My Name Is Nobody, composed by the Italian film composer Ennio Morricone.\nIn June 2006 it was announced that Sex and the City creator Darren Star would write and be executive producer of a US version, which has been commissioned for a pilot script. Steve Coogan and Henry Normal, founders of the production company Baby Cow, were to be co-Executive-Producers.", "rate": 88, "genre": ["Comedy"], "cast": ["Angus Deayton", "Julia Davis", "Rebecca Front", "Felicity Montagu", "Ruth Jones"], "character": ["Don Cole", "Jill Tyrrell", "Cathy Cole", "Sue Forks", "Linda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 202   Expand Nighty Night   (2004) User Score Overview Nighty Night is a British dark comedy sitcom written by and starring Julia Davis. It was first broadcast on 6 January 2004 on BBC Three before moving to BBC2. Notorious for its dark humour, the show follows narcissistic sociopath Jill Tyrell – who manages a beauty parlour alongside her moronic, asthmatic assistant Linda – as she learns that her husband has cancer. She uses this fact to manipulate new neighbour Cathy Cole, a wheelchair user with multiple sclerosis whose husband Don, a womanising doctor, Jill has become obsessed with. The theme tune used in the beginning of both series and during the closing credits for the first is an excerpt from the spaghetti western My Name Is Nobody, composed by the Italian film composer Ennio Morricone. In June 2006 it was announced that Sex and the City creator Darren Star would write and be executive producer of a US version, which has been commissioned for a pilot script. Steve Coogan and Henry Normal, founders of the production company Baby Cow, were to be co-Executive-Producers. Featured Crew Julia Davis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angus Deayton Don Cole Julia Davis Jill Tyrrell Rebecca Front Cathy Cole Felicity Montagu Sue Forks Ruth Jones Linda Full Cast & Crew Last Season Season 2 2005 | 6 Episodes Season 2 of Nighty Night premiered on September  6, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2010-11-01 The Trip 8.0    1998-09-14 The Royle Family 7.9    2003-11-02 Arrested Development 8.2    2006-09-25 Heroes 6.9  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/nightynight/ Genres Comedy Keywords dark comedy narcissism sitcom british humour Content Score 93 Almost there... Top Contributors 12 Banana R 3 Rebecca 2 EveDemocracy 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}