{"link": "https://www.themoviedb.org/tv/2902?language=en", "title": "Queer As Folk", "resume": "Brash humor and genuine emotion make up this original series revolving around the lives, loves, ambitions, careers and friendships of a group of gay men and women living on Liberty Avenue in contemporary Pittsburgh, PA. The show offers an unapologetic look at modern, urban gay and lesbian lives while addressing the most critical health and political issues affecting the community. Sometimes racy, sometimes sensitive and always straight to the heart.", "rate": 79, "genre": ["Drama"], "cast": ["Gale Harold", "Randy Harrison", "Hal Sparks", "Peter Paige", "Scott Lowell"], "character": ["Brian Kinney", "Justin Taylor", "Michael Novotny", "Emmett Honeycutt", "Ted Schmidt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2902   Expand Queer As Folk   (2000) User Score Overview Brash humor and genuine emotion make up this original series revolving around the lives, loves, ambitions, careers and friendships of a group of gay men and women living on Liberty Avenue in contemporary Pittsburgh, PA. The show offers an unapologetic look at modern, urban gay and lesbian lives while addressing the most critical health and political issues affecting the community. Sometimes racy, sometimes sensitive and always straight to the heart. Featured Crew Daniel Lipman Creator Ron Cowen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  19 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gale Harold Brian Kinney Randy Harrison Justin Taylor Hal Sparks Michael Novotny Peter Paige Emmett Honeycutt Scott Lowell Ted Schmidt Full Cast & Crew Last Season Season 5 2005 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  19 Posters  8 Recommendations   1999-02-23 Queer as Folk 8.0    2014-01-07 Being Mary Jane 7.7    1997-11-24 Breaking the Magician's Code: Magic's Biggest Secrets Finally Revealed 7.6    2015-06-12 Conspiracy 5.7    2013-07-20 Cedar Cove 6.7    2008-10-12 Stephen Fry in America 8.0    2014-12-02 Girlfriends' Guide to Divorce 5.1    2011-08-05 Friends with Benefits 6.1  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.sho.com/queer-as-folk Genres Drama Keywords age difference gay relationship lgbt pittsburgh gay culture Content Score 93 Almost there... Top Contributors 104 Banana 36 Elizabeth Jennings AW 15 Andreas Wooker k 7 kingofcity  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}