{"link": "https://www.themoviedb.org/tv/75952?language=en", "title": "Residential Complex", "resume": "Story depicts the conflicts and growth of families who live at co-operative houses.\nNana Igarashi is 35-years-old and works as a diving instructor. She is married to Daiki who is 32-years-old and works at a toy company. They live in a small apartment, while saving up to buy a house. They enjoy their life. Nana and Daiki decide to buy a co-operative house. They also try to have a baby. Nana and Daiki realize it isn't easy to have baby.", "rate": 0, "genre": ["Family", "Drama"], "cast": ["Kyoko Fukada", "Kenichi Matsuyama", "Hiroyuki Hirayama", "Maryjun Takahashi", "Hidekazu Mashima"], "character": ["Nana Igarashi", "Daiki Igarashi", "Ryoji Kawamura", "Chihiro Sugisaki", "Wataru Hirose"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75952   Expand Residential Complex   (2018) User Score Overview Story depicts the conflicts and growth of families who live at co-operative houses. Nana Igarashi is 35-years-old and works as a diving instructor. She is married to Daiki who is 32-years-old and works at a toy company. They live in a small apartment, while saving up to buy a house. They enjoy their life. Nana and Daiki decide to buy a co-operative house. They also try to have a baby. Nana and Daiki realize it isn't easy to have baby. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kyoko Fukada Nana Igarashi Kenichi Matsuyama Daiki Igarashi Hiroyuki Hirayama Ryoji Kawamura Maryjun Takahashi Chihiro Sugisaki Hidekazu Mashima Wataru Hirose Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Residential Complex premiered on January 18, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Residential Complex. You can help by rating TV shows you've seen. Facts Original Name  隣の家族は青く見える Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.fujitv.co.jp/tonari_no_kazoku/index.html Genres Family Drama Keywords japan Content Score 86 Almost there... Top Contributors M 52 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}