{"link": "https://www.themoviedb.org/tv/5669?language=en", "title": "National Heads-Up Poker Championship", "resume": "The National Heads-Up Poker Championship is an annual poker tournament held in the United States and produced by the NBC television network. It is a $25,000 \"buy-in\" invitation-only tournament organized as a series of one-on-one games of no limit Texas hold 'em matches. The participants include many of the world's most successful poker players, as well as celebrities.\nThe championship was the first poker event to be televised on and produced by a major U.S. television network.\nIn October 2011, NBC announced that the National Heads-Up Poker Championship would not return in 2012, ending the championship's seven-year run.\nAfter a one-year hiatus, the tournament returned in 2013. The $25,000 buy-in event ran from Jan. 24 through 26 at Caesars Palace, the same venue where the event was held from 2006 through 2011.\nThe Heads-Up Championship had been sponsored by online poker companies before Black Friday. The World Series of Poker is the new presenting sponsor.", "rate": 0, "genre": [], "cast": ["Gabe Kaplan", "Tom Schneider", "Mike Matusow", "John D'Agostino", "Patrik Antonius"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5669   Expand National Heads-Up Poker Championship   (2005) User Score Overview The National Heads-Up Poker Championship is an annual poker tournament held in the United States and produced by the NBC television network. It is a $25,000 \"buy-in\" invitation-only tournament organized as a series of one-on-one games of no limit Texas hold 'em matches. The participants include many of the world's most successful poker players, as well as celebrities. The championship was the first poker event to be televised on and produced by a major U.S. television network. In October 2011, NBC announced that the National Heads-Up Poker Championship would not return in 2012, ending the championship's seven-year run. After a one-year hiatus, the tournament returned in 2013. The $25,000 buy-in event ran from Jan. 24 through 26 at Caesars Palace, the same venue where the event was held from 2006 through 2011. The Heads-Up Championship had been sponsored by online poker companies before Black Friday. The World Series of Poker is the new presenting sponsor. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabe Kaplan Tom Schneider Mike Matusow John D'Agostino Patrik Antonius Full Cast & Crew Last Season Season 7 2011 | 11 Episodes Season 7 of National Heads-Up Poker Championship premiered on April 17, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on National Heads-Up Poker Championship. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://nbcsports.msnbc.com/id/23011821 Genres No genres have been added. Keywords poker poker game Content Score 79 Pump it up! We're close now. Top Contributors 7 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}