{"link": "https://www.themoviedb.org/tv/7937?language=en", "title": "Stephen Fry in America", "resume": "Stephen Fry in America is a six-part BBC television series in which Stephen Fry travels across the United States of America, a country in which he was almost born. Just before Fry was born, his father was offered a job at Princeton University, in New Jersey, but chose to turn it down in favour of Hampstead. In the six-part series he travels, mostly in a London cab, through 49 of the 50 U.S. states. While he visited an island in the Mississippi River, he did not visit the state of Arkansas.\nThe episodes are regularly repeated in the UK on Dave, lasting an hour and twenty minutes due to advertising breaks. It was aired in America on HDNet. In Australia, the program screened on ABC1 each Sunday at 7:30pm from 9 August 2009. The ratings were so successful that the broadcaster decided to finally air Fry's other BBC programme, QI the next month.\nThe series was filmed in two segments, the first in October-November 2007, and the second in February-April 2008. Special guests featured on the show include Sting, Jimmy Wales, Morgan Freeman, Buddy Guy, and Ted Turner.", "rate": 80, "genre": ["Documentary"], "cast": ["Stephen Fry"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7937   Expand Stephen Fry in America   (2008) User Score Overview Stephen Fry in America is a six-part BBC television series in which Stephen Fry travels across the United States of America, a country in which he was almost born. Just before Fry was born, his father was offered a job at Princeton University, in New Jersey, but chose to turn it down in favour of Hampstead. In the six-part series he travels, mostly in a London cab, through 49 of the 50 U.S. states. While he visited an island in the Mississippi River, he did not visit the state of Arkansas. The episodes are regularly repeated in the UK on Dave, lasting an hour and twenty minutes due to advertising breaks. It was aired in America on HDNet. In Australia, the program screened on ABC1 each Sunday at 7:30pm from 9 August 2009. The ratings were so successful that the broadcaster decided to finally air Fry's other BBC programme, QI the next month. The series was filmed in two segments, the first in October-November 2007, and the second in February-April 2008. Special guests featured on the show include Sting, Jimmy Wales, Morgan Freeman, Buddy Guy, and Ted Turner. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephen Fry Full Cast & Crew Last Season Miniseries 2008 | 6 Episodes Season 1 of Stephen Fry in America premiered on October 11, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2008-10-20 Danny Dyer's Deadliest Men 7.0    1999-01-11 The League of Gentlemen 7.4  Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords miniseries travelogue north america Content Score 56 We're so close, yet so far. Top Contributors R 8 Rebecca 1 Michael j 1 jamesxff  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}