{"link": "https://www.themoviedb.org/tv/12352?language=en", "title": "Divergence Eve", "resume": "Divergence Eve is a thirteen episode Japanese anime series created by Takumi Tsukumo and directed by Hiroshi Negishi, with production by Operation EVE and animation production from RADIX.\nThe series is a science fiction story set in the far future, incorporating aspects of space opera. The character-driven storyline focuses primarily on the psychology of the main character, her social interactions, her inhuman abilities, and the conspiracy surrounding them. The technology is often secondary to this, but it is not ignored; several aspects, including their means of faster-than-light travel, are explained and loosely based on modern physics.\nThe series was a hit in Japan, which led to the creation of a sequel, Misaki Chronicles, which also ran for 13 episodes.\nIn North America, the television series was released by ADV Films, aired from 2 July 2003 to 24 September 2003, ran for 13 episodes, and was released in 3 volumes on VHS and DVD. Sentai Filmworks will re-release the series in a box set, including Misaki Chronicles.", "rate": 0, "genre": ["Animation"], "cast": ["Takehito Koyasu", "Ikuya Sawaki", "Reiko Kiuchi", "Reiko Takagi", "Sanae Kobayashi"], "character": ["Jean Luc Leblanc", "Wolfgang Woerns", "Lyar Von Ertiana", "Luxandra Frail", "Suzanna Bluestein"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12352   Expand Divergence Eve   (2003) User Score Overview Divergence Eve is a thirteen episode Japanese anime series created by Takumi Tsukumo and directed by Hiroshi Negishi, with production by Operation EVE and animation production from RADIX. The series is a science fiction story set in the far future, incorporating aspects of space opera. The character-driven storyline focuses primarily on the psychology of the main character, her social interactions, her inhuman abilities, and the conspiracy surrounding them. The technology is often secondary to this, but it is not ignored; several aspects, including their means of faster-than-light travel, are explained and loosely based on modern physics. The series was a hit in Japan, which led to the creation of a sequel, Misaki Chronicles, which also ran for 13 episodes. In North America, the television series was released by ADV Films, aired from 2 July 2003 to 24 September 2003, ran for 13 episodes, and was released in 3 volumes on VHS and DVD. Sentai Filmworks will re-release the series in a box set, including Misaki Chronicles. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takehito Koyasu Jean Luc Leblanc Ikuya Sawaki Wolfgang Woerns Reiko Kiuchi Lyar Von Ertiana Reiko Takagi Luxandra Frail Sanae Kobayashi Suzanna Bluestein Full Cast & Crew Last Season Season 2 2004 | 13 Episodes Season 2 of Divergence Eve premiered on January  3, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Divergence Eve. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 seboseboss m 3 magoozin 2 Oriknox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}