{"link": "https://www.themoviedb.org/tv/76120?language=en", "title": "Dame×Prince Anime Caravan", "resume": "The story follows Ani, a princess from the minor nation of Inako. Ani is sent to the signing ceremony that will bring peace to the rival nations of Mildonia, a mighty military country, and Selenfaren, a powerful theocracy. Ani is supposed to help steer the signing ceremony along, but she runs into trouble when she encounters a handful of obstinate princes.", "rate": 80, "genre": ["Sci-Fi", "Fantasy", "Drama", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76120   Expand Dame×Prince Anime Caravan   (2018) User Score Overview The story follows Ani, a princess from the minor nation of Inako. Ani is sent to the signing ceremony that will bring peace to the rival nations of Mildonia, a mighty military country, and Selenfaren, a powerful theocracy. Ani is supposed to help steer the signing ceremony along, but she runs into trouble when she encounters a handful of obstinate princes. Featured Crew Hoshino Makoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Dame×Prince Anime Caravan premiered on January 10, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dame×Prince Anime Caravan. You can help by rating TV shows you've seen. Facts Original Name  ダメプリ ANIME CARAVAN Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://damepri-anime.jp/ Genres Sci-Fi & Fantasy Drama Animation Keywords anime Content Score 64 We're so close, yet so far. Top Contributors 13 sp1ti 6 Despair-Paradise D 5 Destr0y 4 sekaidown04  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}