{"link": "https://www.themoviedb.org/tv/10622?language=en", "title": "Touching Evil", "resume": "Touching Evil is a British television drama serial, which began airing in 1997. It was produced by United Productions for Anglia Television, and screened on the ITV network. The first series consists of six fifty-minute episodes. It was created by Paul Abbott, and written by Abbott with Russell T Davies. The serial was very popular, and led to two sequel serials in 1998 and 1999, although these were not written by Abbott or Davies.\nThe star is popular actor Robson Green, playing a police officer, DCI Dave Creegan, whose injuries after a shooting leaves him with strange abilities to sense criminals. Touching Evil III was co-produced by Green's own independent production company, Coastal Productions. Green's co-star was Nicola Walker, playing Creegan's colleague DI Susan Taylor.", "rate": 70, "genre": ["Drama"], "cast": ["Nicola Walker", "Robson Green", "Michael Feast", "Shaun Dingwall", "Andrew Scarborough"], "character": ["Susan Taylor", "Dave Creegan", "Commander Enwright", "Mark Rivers", "Martin Simmons"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10622   Expand Touching Evil   (1997) User Score Overview Touching Evil is a British television drama serial, which began airing in 1997. It was produced by United Productions for Anglia Television, and screened on the ITV network. The first series consists of six fifty-minute episodes. It was created by Paul Abbott, and written by Abbott with Russell T Davies. The serial was very popular, and led to two sequel serials in 1998 and 1999, although these were not written by Abbott or Davies. The star is popular actor Robson Green, playing a police officer, DCI Dave Creegan, whose injuries after a shooting leaves him with strange abilities to sense criminals. Touching Evil III was co-produced by Green's own independent production company, Coastal Productions. Green's co-star was Nicola Walker, playing Creegan's colleague DI Susan Taylor. Featured Crew Paul Abbott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicola Walker Susan Taylor Robson Green Dave Creegan Michael Feast Commander Enwright Shaun Dingwall Mark Rivers Andrew Scarborough Martin Simmons Full Cast & Crew Last Season Season 1 2004 | 13 Episodes Season 1 of Touching Evil premiered on March 12, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Touching Evil. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2003-08-31 Rosemary & Thyme 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords england police detective injury police inspector crime investigation Content Score 93 Almost there... Top Contributors 56 Banana 3 seawolf 1 kcdh 1 sander1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}