{"link": "https://www.themoviedb.org/tv/3322?language=en", "title": "Oz", "resume": "The daily lives of prisoners in Emerald City, an experimental unit of the Oswald Maximum Security Prison where ingroups - Muslims, Latinos, Italians, Aryans - stick close to their mutual friends and terrorizes their mutual enemies.", "rate": 81, "genre": ["Crime", "Drama"], "cast": ["Harold Perrineau", "Lee Tergesen", "Dean Winters", "Eamonn Walker", "Ernie Hudson"], "character": ["Augustus Hill", "Tobias Beecher", "Ryan O'Reily", "Kareem Saïd", "Leo Glynn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3322   Expand Oz   (1997) User Score  Play Trailer Overview The daily lives of prisoners in Emerald City, an experimental unit of the Oswald Maximum Security Prison where ingroups - Muslims, Latinos, Italians, Aryans - stick close to their mutual friends and terrorizes their mutual enemies. Featured Crew Tom Fontana Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  10 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Harold Perrineau Augustus Hill Lee Tergesen Tobias Beecher Dean Winters Ryan O'Reily Eamonn Walker Kareem Saïd Ernie Hudson Leo Glynn Full Cast & Crew Last Season Season 6 2003 | 8 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Ryan: Happy Birthday Dean Winters! Open 0 by wonder2wonder\n      \n     Anyone else really likes this show? Open 5 by  bratface Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  10 Recommendations   2002-03-12 The Shield 8.1    1999-01-10 The Sopranos 8.3    2004-03-21 Deadwood 8.1    2001-06-03 Six Feet Under 8.2    2002-06-02 The Wire 8.4    2008-09-03 Sons of Anarchy 7.8    2010-03-16 Justified 7.9    2010-09-19 Boardwalk Empire 7.7  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 55m Homepage   http://www.hbo.com/oz/index.html Genres Crime Drama Keywords prison racism prison life Content Score 100 Yes! Looking good! Top Contributors 326 dbowman 40 United600 27 Elizabeth Jennings T 13 Tobby  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}