{"link": "https://www.themoviedb.org/tv/8162?language=en", "title": "Longitude", "resume": "A sweeping adaption of Dava Sobel's best-selling book of high seas adventure and political intrigue. Determined to stop shipping losses on the oceans of the 18th century, Britain's Parliament offers a fabulous cash award to anyone who can devise a way to determine longitute at sea. Convinced he can solve the problem that has defeated England's best minds, rural clock maker John Harrison begins an obsessive, 40-year struggle to claim the Longitude prize with his ingenious marine clock. 200 years later, naval officer Rupert Gould stumbles across Harrison's forgotten chronometers and devotes himself to restoring these long-neglected mechanical masterpieces.", "rate": 80, "genre": ["Drama"], "cast": ["Ian Hart", "Michael Gambon", "Jonathan Coy", "Jeremy Irons", "Peter Cartwright"], "character": ["William Harrison", "John Harrison", "Adm. Sir Cloudsley Shovell", "Rupert Gould", "Army Doctor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8162   Expand Longitude   (2000) User Score Overview A sweeping adaption of Dava Sobel's best-selling book of high seas adventure and political intrigue. Determined to stop shipping losses on the oceans of the 18th century, Britain's Parliament offers a fabulous cash award to anyone who can devise a way to determine longitute at sea. Convinced he can solve the problem that has defeated England's best minds, rural clock maker John Harrison begins an obsessive, 40-year struggle to claim the Longitude prize with his ingenious marine clock. 200 years later, naval officer Rupert Gould stumbles across Harrison's forgotten chronometers and devotes himself to restoring these long-neglected mechanical masterpieces. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Hart William Harrison Michael Gambon John Harrison Jonathan Coy Adm. Sir Cloudsley Shovell Jeremy Irons Rupert Gould Peter Cartwright Army Doctor Full Cast & Crew Last Season Season 1 2000 | 2 Episodes Season 1 of Longitude premiered on January  2, 2000. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Longitude. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Longitude. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  125m Homepage  - Genres Drama Keywords england inventor miniseries 18th century historical drama Content Score 86 Almost there... Top Contributors t🇧 16 ticao2 🇧🇷 pt-BR 7 Banana 6 Elizabeth Jennings 4 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}