{"link": "https://www.themoviedb.org/tv/34391?language=en", "title": "Marvel's Ultimate Spider-Man", "resume": "While being trained by S.H.I.E.L.D., Spider-Man battles evil with a new team of teen colleagues.", "rate": 66, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Drake Bell"], "character": ["Peter Parker / Spider-Man"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34391   Expand Marvel's Ultimate Spider-Man   (2012) User Score  Play Trailer Overview While being trained by S.H.I.E.L.D., Spider-Man battles evil with a new team of teen colleagues. Featured Crew Stan Lee Creator Steve Ditko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Drake Bell Peter Parker / Spider-Man Full Cast & Crew Last Season Season 4: vs the Sinister 6 2016 | 26 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  8 Recommendations   2008-03-08 The Spectacular Spider-Man 7.4    2013-11-09 Marvel's Avengers Assemble 6.5    2010-09-22 The Avengers: Earth's Mightiest Heroes 7.5    2013-08-11 Marvel’s Hulk and the Agents of S.M.A.S.H 5.5    2009-01-23 Wolverine and the X-Men 7.0    2003-07-11 Spider-Man: The New Animated Series 6.5    2000-11-04 X-Men: Evolution 7.3    2010-11-26 Young Justice 8.2  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  21m Homepage   http://disneyxd.disney.com/ultimate-spider-man Genres Action & Adventure Animation Comedy Keywords new york superhero based on comic Content Score 71 Just a little bit more... Top Contributors 34 Elizabeth Jennings 15 Dragonfly17 d 8 denis 7 baba-xyz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}