{"link": "https://www.themoviedb.org/tv/45235?language=en", "title": "We Without Wings", "resume": "Oretachi ni Tsubasa wa Nai - Under the Innocent Sky. is the fifth visual novel developed by Navel. Before the game's release, a prequel game named Oretachi ni Tsubasa wa nai ~Prelude~ containing bonus scenarios and events before the timeline of the game was released on 28 June 2008. This release didn't contain hentai scenes. The limited edition of the game was released on 30 January 2009. A standard version of the game was released on 24 April 2009. A fandisc named Oretachi ni Tsubasa wa Nai AfterStory was released on 30 July 2010. A non-adult version remake, named \"Oretachi ni Tsubasa wa Nai R\", of the PC game was released on 27 May 2011. The game has also received several manga adaptations. An anime adaptation by the studio Nomad started airing on April 4, 2011.", "rate": 65, "genre": ["Animation", "Comedy", "Drama", "Drama"], "cast": ["Mayumi Yoshida", "Ryouko Ono", "Yuko Goto", "Ai Matayoshi", "Yukiko Takaguchi"], "character": ["Asuka Watarai", "Hiyoko Tamaizumi", "Naru Ōtori", "Kobato Haneda", "Miyako Yamashina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45235   Expand We Without Wings   (2011) User Score Overview Oretachi ni Tsubasa wa Nai - Under the Innocent Sky. is the fifth visual novel developed by Navel. Before the game's release, a prequel game named Oretachi ni Tsubasa wa nai ~Prelude~ containing bonus scenarios and events before the timeline of the game was released on 28 June 2008. This release didn't contain hentai scenes. The limited edition of the game was released on 30 January 2009. A standard version of the game was released on 24 April 2009. A fandisc named Oretachi ni Tsubasa wa Nai AfterStory was released on 30 July 2010. A non-adult version remake, named \"Oretachi ni Tsubasa wa Nai R\", of the PC game was released on 27 May 2011. The game has also received several manga adaptations. An anime adaptation by the studio Nomad started airing on April 4, 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mayumi Yoshida Asuka Watarai Ryouko Ono Hiyoko Tamaizumi Yuko Goto Naru Ōtori Ai Matayoshi Kobato Haneda Yukiko Takaguchi Miyako Yamashina Full Cast & Crew Last Season Oretachi ni tsubasa wa nai season 1 2011 | 12 Episodes Season 1 of We Without Wings premiered on April  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on We Without Wings. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Comedy Drama Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}