{"link": "https://www.themoviedb.org/tv/37678?language=en", "title": "The Voice", "resume": "The strongest vocalists from across the United states compete in a blockbusters vocal competition, the winner becomes “The Voice.” The show's innovative format features four stages of competition: the blind auditions, the battle rounds, the knockouts and, finally, the live performance shows.", "rate": 47, "genre": ["Reality"], "cast": ["Carson Daly", "Adam Levine", "Blake Shelton", "Alicia Keys", "Kelly Clarkson"], "character": ["Himself - Host", "Himself - Judge", "Himself - Judge", "Herself - Coach", "Herself - Coach"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37678   Expand The Voice   (2011) User Score Overview The strongest vocalists from across the United states compete in a blockbusters vocal competition, the winner becomes “The Voice.” The show's innovative format features four stages of competition: the blind auditions, the battle rounds, the knockouts and, finally, the live performance shows. Featured Crew John de Mol Creator VanVelzen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  18 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carson Daly Himself - Host Adam Levine Himself - Judge Blake Shelton Himself - Judge Alicia Keys Herself - Coach Kelly Clarkson Herself - Coach Full Cast & Crew Current Season Season 14 2018 | 27 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Voice. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  18 Posters  12 Recommendations   2002-06-11 American Idol 4.4    2004-01-08 The Celebrity Apprentice 4.2    2011-09-21 The X Factor 4.4    2006-08-07 Gene Simmons Family Jewels 4.4    2009-03-02 Late Night with Jimmy Fallon 6.0    1988-01-19 48 Hours 7.3    2012-08-08 Here Comes Honey Boo Boo 1.9    2004-07-01 The Soup 4.9  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  43m Homepage   http://www.nbc.com/the-voice Genres Reality Keywords singer music contest singing competition Content Score 93 Almost there... Top Contributors 73 Elizabeth Jennings 40 cesar_n TB 37 TMDb Bot 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}