{"link": "https://www.themoviedb.org/tv/26588?language=en", "title": "The Boy from Andromeda", "resume": "On a holiday to Mt Tarawera, teenager Jenny finds an odd shard of metal. In this third episode of the kids sci-fi series she meets its owner: 'Drom' — a survivor of an alien mission to deactivate a planet-annihilating space gun (aka Tarawera itself). They find themselves under siege from a Predator-like 'Guardian' of the gun. If Drom and Jenny and local kids Tessa and Lloyd can't defeat the mechanoid, catastrophe is imminent! The South Pacific Pictures series found international sales and cult repute.", "rate": 75, "genre": ["Family", "Sci-Fi", "Fantasy"], "cast": ["Jane Creswell", "Anthony Samuels", "Brian McNeill", "Alex Van Dam", "Dale Corlett"], "character": ["Drom", "Llyod", "Dory", "Hec", "Lysey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26588   Expand The Boy from Andromeda   (1991) User Score Overview On a holiday to Mt Tarawera, teenager Jenny finds an odd shard of metal. In this third episode of the kids sci-fi series she meets its owner: 'Drom' — a survivor of an alien mission to deactivate a planet-annihilating space gun (aka Tarawera itself). They find themselves under siege from a Predator-like 'Guardian' of the gun. If Drom and Jenny and local kids Tessa and Lloyd can't defeat the mechanoid, catastrophe is imminent! The South Pacific Pictures series found international sales and cult repute. Featured Crew Jonathon Gunson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Jane Creswell Drom Anthony Samuels Llyod Brian McNeill Dory Alex Van Dam Hec Dale Corlett Lysey Full Cast & Crew Last Season Season 1 1991 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Boy from Andromeda. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Sci-Fi & Fantasy Keywords monster volcano star alien children spaceship robot Content Score 86 Almost there... Top Contributors 57 CouchTater 34 Elizabeth Jennings CM 5 Cherche Moi w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}