{"link": "https://www.themoviedb.org/tv/15696?language=en", "title": "Rod, Jane and Freddy", "resume": "Join Rod, Jane and Freddy from 'Rainbow' as they set off on their own adventures. Sometimes they may be putting on a mini variety show at a theatre, other times they may leap through the pages of a story book trying to get Mary Mary home. It's always musical and mostly educational.", "rate": 70, "genre": ["Comedy", "Family", "Kids"], "cast": ["Jane Tucker", "Freddy Marks", "Rod Burton"], "character": ["Herself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15696   Expand Rod, Jane and Freddy   (1981) User Score Overview Join Rod, Jane and Freddy from 'Rainbow' as they set off on their own adventures. Sometimes they may be putting on a mini variety show at a theatre, other times they may leap through the pages of a story book trying to get Mary Mary home. It's always musical and mostly educational. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jane Tucker Herself Freddy Marks Himself Rod Burton Himself Full Cast & Crew Last Season Season 8 1991 | 9 Episodes Season 8 of Rod, Jane and Freddy premiered on January  8, 1991. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Rod, Jane and Freddy. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rod, Jane and Freddy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Comedy Family Kids Keywords music mime spin off theater kids music Content Score 56 We're so close, yet so far. Top Contributors N 49 Notamymerrick TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}