{"link": "https://www.themoviedb.org/tv/74793?language=en", "title": "The Endless Love", "resume": "The young gifted painter Gu Ye Bai is affected by a mental disease, to him, the world has lost all its colors. While preparing for an international arts competition, an accident happens that makes him worried a lot. At this time, he gets to know the cute and amiable sunshine Lu You Yan. She will help him heal his mind and fight for his dream of becoming a recognized painter.", "rate": 0, "genre": ["Drama"], "cast": ["wei miles", "An Yue Xi", "Chen Ruo Xuan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74793   Expand The Endless Love   (2017) User Score Overview The young gifted painter Gu Ye Bai is affected by a mental disease, to him, the world has lost all its colors. While preparing for an international arts competition, an accident happens that makes him worried a lot. At this time, he gets to know the cute and amiable sunshine Lu You Yan. She will help him heal his mind and fight for his dream of becoming a recognized painter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast wei miles An Yue Xi Chen Ruo Xuan Full Cast & Crew Current Season The Endless Love 2017 | 0 Episodes Season 1 of The Endless Love premiered on November  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Endless Love. You can help by rating TV shows you've seen. Facts Original Name  路从今夜白之遇见青春 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords romance youth Content Score 43 There's no 'I' in team... Top Contributors j 23 jklmo A 2 Aka75 M 1 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}