{"link": "https://www.themoviedb.org/tv/1903?language=en", "title": "A.T.O.M.", "resume": "A.T.O.M. is a French animated television series, which chronicles the adventures of five teenagers, set in the fictional Landmark City. The Alpha Teens, which consist of Axel Manning, Catalina Leone, Crey Kingston, Zack Hawkes, and Ollie Sharker, test prototype vehicles and weapons for Lee Industries, and use these prototypes to combat criminals, particularly the sadistic Alexander Paine.\nIn the United Kingdom, Australia and Latin America, the series is called Action Man A.T.O.M. and has its own comic book from Panini Comics.", "rate": 70, "genre": ["Action", "Adventure", "Animation"], "cast": ["Clancy Brown", "Tom Kenny", "Brian Donovan", "Charlie Schlatter", "James Arnold Taylor"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1903   Expand A.T.O.M.   (2005) User Score Overview A.T.O.M. is a French animated television series, which chronicles the adventures of five teenagers, set in the fictional Landmark City. The Alpha Teens, which consist of Axel Manning, Catalina Leone, Crey Kingston, Zack Hawkes, and Ollie Sharker, test prototype vehicles and weapons for Lee Industries, and use these prototypes to combat criminals, particularly the sadistic Alexander Paine. In the United Kingdom, Australia and Latin America, the series is called Action Man A.T.O.M. and has its own comic book from Panini Comics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clancy Brown Tom Kenny Brian Donovan Charlie Schlatter James Arnold Taylor Full Cast & Crew Last Season Season 2 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for A.T.O.M.. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2006-06-03 Galactik Football 8.0    2004-12-18 W.I.T.C.H. 6.6    2003-08-23 Sonic X 5.5    2001-11-03 Totally Spies! 5.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage   http://www.alphateensonmachines.co.uk/localise/index.html Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 Banana R 3 Rebecca 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}