{"link": "https://www.themoviedb.org/tv/20618?language=en", "title": "Planet Earth: The Future", "resume": "The three-part complementary series features eminent scientists, theologians and conservationists discussing the environmental and conservation issues at stake and asks how much of the world revealed in Planet Earth will ever be seen again.", "rate": 80, "genre": ["Documentary"], "cast": ["George Fenton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20618   Expand Planet Earth: The Future   (2006) User Score Overview The three-part complementary series features eminent scientists, theologians and conservationists discussing the environmental and conservation issues at stake and asks how much of the world revealed in Planet Earth will ever be seen again. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Fenton Full Cast & Crew Last Season Season 1 2006 | 3 Episodes Season 1 of Planet Earth: The Future premiered on November 26, 2006. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Planet Earth: The Future. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Planet Earth: The Future. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/planetearth Genres Documentary Keywords miniseries Content Score 56 We're so close, yet so far. Top Contributors 31 ____Joker 16 Elizabeth Jennings TB 13 TMDb Bot 11 Chieftl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}