{"link": "https://www.themoviedb.org/tv/77410?language=en", "title": "Muppet Babies", "resume": "The reimagined playroom antics and wacky adventures of the young Kermit the Frog, Piggy, Fozzie Bear, Gonzo, Animal, Summer Penguin, and Miss Nanny.", "rate": 0, "genre": ["Animation", "Comedy", "Family"], "cast": ["Jenny Slate", "Matt Danner", "Melanie Harrison", "Dee Bradley Baker", "Ben Diskin"], "character": ["Miss Nanny (voice)", "Kermit (voice)", "Piggy (voice)", "Animal (voice)", "Gonzo (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77410   Expand Muppet Babies   (2018) User Score  Play Trailer Overview The reimagined playroom antics and wacky adventures of the young Kermit the Frog, Piggy, Fozzie Bear, Gonzo, Animal, Summer Penguin, and Miss Nanny. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  2 Clips  0 Featurettes  2 Opening Credits  1 Top Billed Cast Jenny Slate Miss Nanny (voice) Matt Danner Kermit (voice) Melanie Harrison Piggy (voice) Dee Bradley Baker Animal (voice) Ben Diskin Gonzo (voice) Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Muppet Babies premiered on March 23, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  6 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Muppet Babies. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  22m Homepage   http://watchdisneyjunior.go.com/muppet-babies Genres Animation Comedy Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 45 Elizabeth Jennings TB 6 TMDb Bot o 3 ozzie74 v 1 vortex2035  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}