{"link": "https://www.themoviedb.org/tv/42058?language=en", "title": "Brain", "resume": "Brain is a 2011 South Korean medical drama, starring Shin Ha-kyun, Choi Jung-won, Jung Jin-young and Jo Dong-hyuk. The series revolves around a top neurosurgeon who is obsessed with success and dreams of becoming the hospital director, then finds himself embroiled in professional rivalries and an unexpected romance. The series received positive reviews, particularly for Shin Ha-kyun's performance.\nIt aired on KBS2 from November 14, 2011 to January 17, 2012 on Mondays and Tuesdays at 21:55 for 20 episodes.", "rate": 70, "genre": ["Drama", "Romance"], "cast": ["Choi Jung-won", "Jo Dong-hyuk", "Shin Ha-kyun", "Jung Jin-young", "Claudia Kim"], "character": ["Yoon Ji-hye", "Seo Joon-suk", "Lee Kang-hoon", "Kim Sang-chul", "Jang Yoo-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42058   Expand Brain   (2011) User Score  Play Trailer Overview Brain is a 2011 South Korean medical drama, starring Shin Ha-kyun, Choi Jung-won, Jung Jin-young and Jo Dong-hyuk. The series revolves around a top neurosurgeon who is obsessed with success and dreams of becoming the hospital director, then finds himself embroiled in professional rivalries and an unexpected romance. The series received positive reviews, particularly for Shin Ha-kyun's performance. It aired on KBS2 from November 14, 2011 to January 17, 2012 on Mondays and Tuesdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Jung-won Yoon Ji-hye Jo Dong-hyuk Seo Joon-suk Shin Ha-kyun Lee Kang-hoon Jung Jin-young Kim Sang-chul Claudia Kim Jang Yoo-jin Full Cast & Crew Last Season Season 1 2011 | 20 Episodes Season 1 of Brain premiered on November 14, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Brain. You can help by rating TV shows you've seen. Facts Original Name  브레인 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/brain/ Genres Drama Romance Keywords korea Content Score 93 Almost there... Top Contributors t 19 tmdb38202327 M 18 Maria180493 N 11 Nightowl.Kr 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}