{"link": "https://www.themoviedb.org/tv/47220?language=en", "title": "Intruders", "resume": "When psychiatrist Dr. Neil Chase encounters two women suffering from the same symptoms with similar nightmarish stories, rational explanations just don't seem to fit.", "rate": 71, "genre": ["Sci-Fi", "Fantasy", "Drama", "Mystery"], "cast": ["Richard Crenna", "Mare Winningham", "Susan Blakely", "Daphne Ashbrook", "Alan Autry"], "character": ["Dr. Neil Chase", "Mary Wilkes", "Leigh Holland", "Lesley Hahn", "Joe Wilkes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47220   Expand Intruders   (1992) User Score Overview When psychiatrist Dr. Neil Chase encounters two women suffering from the same symptoms with similar nightmarish stories, rational explanations just don't seem to fit. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Crenna Dr. Neil Chase Mare Winningham Mary Wilkes Susan Blakely Leigh Holland Daphne Ashbrook Lesley Hahn Alan Autry Joe Wilkes Full Cast & Crew Last Season Miniseries 1992 | 2 Episodes Season 1 of Intruders premiered on May 17, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2011-12-11 Bag of Bones 5.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Sci-Fi & Fantasy Drama Mystery Keywords flying saucer alien life-form alien ufo miniseries Content Score 86 Almost there... Top Contributors 44 Banana TB 23 TMDb Bot R 12 Rebecca R 2 Requiem451  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}