{"link": "https://www.themoviedb.org/tv/63021?language=en", "title": "From Darkness", "resume": "The story of Claire Church, a former police officer who moves away to the remote Western Isles in an attempt to escape the past and violence that still haunts her. Soon, Claire is pulled back into an investigation she thought she long left behind, by her former lover and colleague DCI John Hind and his new DS Anthony Boyce.", "rate": 52, "genre": [], "cast": ["Anne-Marie Duff", "Richard Rankin", "Johnny Harris", "Elina Alminas", "Gerry McLaughlin"], "character": ["Claire Church", "Norrie", "DCI John Hind", "Agota Calgys", "Gordon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63021   Expand From Darkness   (2015) User Score Overview The story of Claire Church, a former police officer who moves away to the remote Western Isles in an attempt to escape the past and violence that still haunts her. Soon, Claire is pulled back into an investigation she thought she long left behind, by her former lover and colleague DCI John Hind and his new DS Anthony Boyce. Featured Crew Katie Baxendale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne-Marie Duff Claire Church Richard Rankin Norrie Johnny Harris DCI John Hind Elina Alminas Agota Calgys Gerry McLaughlin Gordon Full Cast & Crew Last Season Season 1 2015 | 4 Episodes Season 1 of From Darkness premiered on October  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2015-09-30 You, Me and the Apocalypse 7.2    2015-05-17 Jonathan Strange & Mr Norrell 7.8    2014-08-28 Hand of God 6.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b06h7yy4 Genres No genres have been added. Keywords scotland murder investigation Content Score 86 Almost there... Top Contributors 18 Elizabeth Jennings t 9 tmdb48730457 5 Banana z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}