{"link": "https://www.themoviedb.org/tv/70168?language=en", "title": "Too Old to Die Young", "resume": "Exploring the criminal underbelly of Los Angeles by following characters' existential journeys from being killers to becoming samurais in the City of Angels.", "rate": 0, "genre": ["Drama", "Crime"], "cast": ["Miles Teller", "Jena Malone", "William Baldwin", "Cristina Rodlo", "Augusto Aguilera"], "character": ["Martin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70168   Expand Too Old to Die Young   (2018) User Score Overview Exploring the criminal underbelly of Los Angeles by following characters' existential journeys from being killers to becoming samurais in the City of Angels. Featured Crew Nicolas Winding Refn Creator Ed Brubaker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miles Teller Martin Jena Malone William Baldwin Cristina Rodlo Augusto Aguilera Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  In Production Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Crime Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors G 22 Gadileth 15 Mikedeth5 11 Elizabeth Jennings m 7 mea6an  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}