{"link": "https://www.themoviedb.org/tv/62047?language=en", "title": "Arthur & George", "resume": "Arthur & George is a three-part adaptation of Julian Barnes' novel about Sherlock Holmes creator Arthur Conan Doyle as played by actor Martin Clunes. \nSet in 1906 in Staffordshire, Hampshire and London the drama follows Sir Arthur and his trusted secretary, Alfred ‘Woodie’ Wood as they investigate the case of George Edalji, a young Anglo-Indian solicitor who was imprisoned for allegedly mutilating animals and writing obscene letters.", "rate": 63, "genre": ["Mystery"], "cast": ["Martin Clunes", "Arsher Ali", "Charles Edwards", "Emma Fielding", "Art Malik"], "character": ["Sir Arthur Conan Doyle", "George Edalji", "Alfred ‘Woodie’ Wood", "Charlotte Edalji", "Reverend Shapurji Edalji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62047   Expand Arthur & George   (2015) User Score Overview Arthur & George is a three-part adaptation of Julian Barnes' novel about Sherlock Holmes creator Arthur Conan Doyle as played by actor Martin Clunes.  Set in 1906 in Staffordshire, Hampshire and London the drama follows Sir Arthur and his trusted secretary, Alfred ‘Woodie’ Wood as they investigate the case of George Edalji, a young Anglo-Indian solicitor who was imprisoned for allegedly mutilating animals and writing obscene letters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Clunes Sir Arthur Conan Doyle Arsher Ali George Edalji Charles Edwards Alfred ‘Woodie’ Wood Emma Fielding Charlotte Edalji Art Malik Reverend Shapurji Edalji Full Cast & Crew Last Season Season 1 2015 | 3 Episodes Season 1 of Arthur & George premiered on March  2, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2015-02-15 Indian Summers 7.2    2002-04-07 The Forsyte Saga 7.7    2014-10-02 Gracepoint 6.5    1965-09-15 Green Acres 6.9    2007-02-18 Inspector Lewis 7.6    2013-01-06 Mr Selfridge 6.6    2013-12-26 Death Comes to Pemberley 6.8    2014-10-06 Grantchester 7.3  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  - Homepage   http://www.itv.com/drama/arthur-george Genres Mystery Keywords england sherlock holmes writer period drama Content Score 86 Almost there... Top Contributors 23 Elizabeth Jennings 15 Steve 8 Banana S 3 SergeiAK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}