{"link": "https://www.themoviedb.org/tv/5394?language=en", "title": "The Biskitts", "resume": "The Biskitts is an animated cartoon television series produced by Hanna-Barbera Productions from 1983 to 1984 and aired on CBS. The series lasted for only one season; Shirt Tales replaced the show in its time slot the following year. The Biskitts returned to that same time slot in March 1985 but only aired reruns in the remainder of that season.\nFollowing the series retirement from CBS, like many other cartoons, it was acquired by the Armed Forces Network and shown throughout much of the 1980s, mainly as entertainment for children of deployed American servicemen in Asia and Europe.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Henry Gibson", "Frank Welker", "Peter Cullen", "Kenneth Mars", "B. J. Ward"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5394   Expand The Biskitts   (1983) User Score Overview The Biskitts is an animated cartoon television series produced by Hanna-Barbera Productions from 1983 to 1984 and aired on CBS. The series lasted for only one season; Shirt Tales replaced the show in its time slot the following year. The Biskitts returned to that same time slot in March 1985 but only aired reruns in the remainder of that season. Following the series retirement from CBS, like many other cartoons, it was acquired by the Armed Forces Network and shown throughout much of the 1980s, mainly as entertainment for children of deployed American servicemen in Asia and Europe. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Henry Gibson Frank Welker Peter Cullen Kenneth Mars B. J. Ward Full Cast & Crew Last Season Season 1 1983 | 26 Episodes Season 1 of The Biskitts premiered on September 17, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Biskitts. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}