{"link": "https://www.themoviedb.org/tv/54190?language=en", "title": "Maya Tawan", "resume": "A young reporter goes undercover as servant for a retired actor to get the scope on his private life.\nStoryline is P'ek is a poor kid whose mother is a prostitute, and he and his sister are raised in the brothel. But seeing his sisters future is going to be like his mothers, they run away and end up living in the temple where they meet lots of other kids. There are two in particular, one ends up being Tawan's best friend and the other becomes his most despised enemy, Shane, who was adopted by an western couple, who actually used him to smuggle drugs. When the kids grow up, Tawan and his friend work low paying job like a waiter just to get by and pay for his sisters uni fees. Shane comes back one day and seduces his sister and sells her to a brothel. Tawan goes looking for her everywhere only to find her one day in a brothel and addicted to drugs. To pay for her hospital fees, he agrees to star in a movie, but unfortunaetly she dies. The movie becomes a hit, he becomes a star but he doesn't like his private life, especially concerning his past and his sister to be made public so he despises reporters.\nFast forward a few years. Tawan no longer stars in movies, instead he has become a top fashion designer.\nN'ek is a reporter, Matana, whose latest scoop is to try and interview Tawan, an anonomys package was delivered to all the newspapers with pictures of Tawan's models in sexy/nude kind of poses, with a note saying that his models are escorts/prostitutes and that Tawan is a pimp. So her boss sends her to Phuket, where Tawan has a holiday home to try and get an interview. While trying to get an interview, she falls sick in front of his house and he has no choice but to take her in ... all the while, Shane has come back and is doing everything he can to bring Tawan down, especially targeting the people that Tawan loves.", "rate": 70, "genre": ["Romance", "Comedy"], "cast": ["Aum Atichart Chumnanon", "Urassaya Sperbund", "Sornram Tappituk", "Ice Apissada Kreurkongka", "Panchanida Seesaamram"], "character": ["Khet-Tawan (Pond)", "Mattana (Matt)", "Shane Cross", "Lisa", "Pang Panchanida Seesaamram"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54190   Expand Maya Tawan   (2012) User Score Overview A young reporter goes undercover as servant for a retired actor to get the scope on his private life. Storyline is P'ek is a poor kid whose mother is a prostitute, and he and his sister are raised in the brothel. But seeing his sisters future is going to be like his mothers, they run away and end up living in the temple where they meet lots of other kids. There are two in particular, one ends up being Tawan's best friend and the other becomes his most despised enemy, Shane, who was adopted by an western couple, who actually used him to smuggle drugs. When the kids grow up, Tawan and his friend work low paying job like a waiter just to get by and pay for his sisters uni fees. Shane comes back one day and seduces his sister and sells her to a brothel. Tawan goes looking for her everywhere only to find her one day in a brothel and addicted to drugs. To pay for her hospital fees, he agrees to star in a movie, but unfortunaetly she dies. The movie becomes a hit, he becomes a star but he doesn't like his private life, especially concerning his past and his sister to be made public so he despises reporters. Fast forward a few years. Tawan no longer stars in movies, instead he has become a top fashion designer. N'ek is a reporter, Matana, whose latest scoop is to try and interview Tawan, an anonomys package was delivered to all the newspapers with pictures of Tawan's models in sexy/nude kind of poses, with a note saying that his models are escorts/prostitutes and that Tawan is a pimp. So her boss sends her to Phuket, where Tawan has a holiday home to try and get an interview. While trying to get an interview, she falls sick in front of his house and he has no choice but to take her in ... all the while, Shane has come back and is doing everything he can to bring Tawan down, especially targeting the people that Tawan loves. Featured Crew Kantana Group Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aum Atichart Chumnanon Khet-Tawan (Pond) Urassaya Sperbund Mattana (Matt) Sornram Tappituk Shane Cross Ice Apissada Kreurkongka Lisa Panchanida Seesaamram Pang Panchanida Seesaamram Full Cast & Crew Last Season Season 1 2012 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Maya Tawan. You can help by rating TV shows you've seen. Facts Original Name  3 ทหารเสือสาวซีรีส์ Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  98m Homepage   http://th.wikipedia.org/wiki/3_ทหารเสือ_(นวนิยายไทย) Genres Romance Comedy Keywords thai lakorn Content Score 93 Almost there... Top Contributors 45 Crip 3 Elizabeth Jennings 3 Sven-Erik Andersen TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}