{"link": "https://www.themoviedb.org/tv/5271?language=en", "title": "Eleventh Hour", "resume": "Professor Ian Hood is a former physics professor recruited by the British government as its on-call scientist/detective and Jensen's Young is the companion bodyguard hired to protect Hood from the people who want to see his work put to an end.", "rate": 60, "genre": ["Drama", "Mystery"], "cast": ["Patrick Stewart", "Ashley Jensen"], "character": ["Ian Hood", "Rachel Young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5271   Expand Eleventh Hour   (2006) User Score Overview Professor Ian Hood is a former physics professor recruited by the British government as its on-call scientist/detective and Jensen's Young is the companion bodyguard hired to protect Hood from the people who want to see his work put to an end. Featured Crew Stephen Gallagher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Stewart Ian Hood Ashley Jensen Rachel Young Full Cast & Crew Last Season Season 1 2006 | 4 Episodes Season 1 of Eleventh Hour premiered on January 19, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Eleventh Hour. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  68m Homepage   https://itvstudios.com/programmes/eleventh-hour--2 Genres Drama Mystery Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 10 United600 PS 2 P. Snoopy 1 Simba63 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}