{"link": "https://www.themoviedb.org/tv/61011?language=en", "title": "Jonah From Tonga", "resume": "Fourteen year old breakdancer and mischievous delinquent, Jonah Takalua, returns from Tonga to start a new life at Holy Cross High School.\nDominating the playground with his gang Fobba-licious, amusing himself with endless filfthy jokes and a schoolyard rivalry with the Rangas, Jonah challenges the school system, getting himself into more trouble than ever before.", "rate": 64, "genre": ["Comedy"], "cast": ["Chris Lilley", "Tama Tauali'i", "Jason Moleli", "Lafaele Tauali'i", "Tana Laasia"], "character": ["Jonah Takalua", "Moses", "Manu", "Israel", "Sonny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61011   Expand Jonah From Tonga   (2014) User Score  Play Trailer Overview Fourteen year old breakdancer and mischievous delinquent, Jonah Takalua, returns from Tonga to start a new life at Holy Cross High School. Dominating the playground with his gang Fobba-licious, amusing himself with endless filfthy jokes and a schoolyard rivalry with the Rangas, Jonah challenges the school system, getting himself into more trouble than ever before. Featured Crew Chris Lilley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Lilley Jonah Takalua Tama Tauali'i Moses Jason Moleli Manu Lafaele Tauali'i Israel Tana Laasia Sonny Full Cast & Crew Last Season Season 1 2014 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2013-10-30 Ja'mie: Private School Girl 6.7    2011-05-11 Angry Boys 6.5    2007-09-05 Summer Heights High 7.4    1993-12-27 Shooting Stars 6.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/programs/jonah-from-tonga/ Genres Comedy Keywords high school juvenile delinquent Content Score 100 Yes! Looking good! Top Contributors 22 Elizabeth Jennings w 9 whysoserious92 4 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}