{"link": "https://www.themoviedb.org/tv/67328?language=en", "title": "The UCB Show", "resume": "A weekly variety showcase for the best sketch, characters and stand-up homegrown at the UCB Theatres in LA and NYC. Hosted by Upright Citizens Brigade co-founders Matt Besser, Amy Poehler, Ian Roberts and Matt Walsh and filmed with a live audience at UCB Sunset in Hollywood.", "rate": 0, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67328   Expand The UCB Show   (2016) User Score Overview A weekly variety showcase for the best sketch, characters and stand-up homegrown at the UCB Theatres in LA and NYC. Hosted by Upright Citizens Brigade co-founders Matt Besser, Amy Poehler, Ian Roberts and Matt Walsh and filmed with a live audience at UCB Sunset in Hollywood. Featured Crew Matt Besser Creator Amy Poehler Creator Ian Roberts Creator Matt Walsh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of The UCB Show premiered on January 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The UCB Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   https://www.seeso.com/view/series/the-ucb-show Genres Comedy Keywords sketch stand-up comedy Content Score 64 We're so close, yet so far. Top Contributors 62 bizzacore 26 Elizabeth Jennings 2 joeynotjoe D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}