{"link": "https://www.themoviedb.org/tv/64096?language=en", "title": "100 Miles From Nowhere", "resume": "From the producers of Naked and Afraid comes 100 Miles From Nowhere, an Animal Planet series that follows adventurer Matt Galland and his two best buddies, Danny Bryson and Blake Josephson. In each episode, the trio of fun-loving regular guys chooses remote, extreme locations throughout the globe where cameras – let alone people – rarely have gone. Matt, Danny and Blake’s mission is straightforward: to get off life’s usual humdrum path for a more exciting, daring and off-the-beaten one. In just three or four days, the guys trek approximately 100 miles and burn up to 10,000 calories on foot, raft, skis and even skateboard while they document and shoot their own escapades with absolutely no crew. Every single second on the ground is self-shot. Each expedition causes major wear and tear on their bodies, so the guys must reach their bear box drops, which are pre-arranged at set points to replenish their supplies, strength and stamina. Their incredible journeys take them to extreme landscapes – including steep mountains, insufferably hot deserts, freezing-cold canyons and snakeinfested jungles. They push their endurance to the limit and sometimes even their friendship. The quests are never easy and are sometimes dangerous, but they always are packed with thrilling surprises and breathtaking footage of the planet’s splendor.", "rate": 28, "genre": ["Documentary"], "cast": ["Matt Galland", "Danny Bryson", "Blake Josephson"], "character": ["Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64096   Expand 100 Miles From Nowhere   (2015) User Score Overview From the producers of Naked and Afraid comes 100 Miles From Nowhere, an Animal Planet series that follows adventurer Matt Galland and his two best buddies, Danny Bryson and Blake Josephson. In each episode, the trio of fun-loving regular guys chooses remote, extreme locations throughout the globe where cameras – let alone people – rarely have gone. Matt, Danny and Blake’s mission is straightforward: to get off life’s usual humdrum path for a more exciting, daring and off-the-beaten one. In just three or four days, the guys trek approximately 100 miles and burn up to 10,000 calories on foot, raft, skis and even skateboard while they document and shoot their own escapades with absolutely no crew. Every single second on the ground is self-shot. Each expedition causes major wear and tear on their bodies, so the guys must reach their bear box drops, which are pre-arranged at set points to replenish their supplies, strength and stamina. Their incredible journeys take them to extreme landscapes – including steep mountains, insufferably hot deserts, freezing-cold canyons and snakeinfested jungles. They push their endurance to the limit and sometimes even their friendship. The quests are never easy and are sometimes dangerous, but they always are packed with thrilling surprises and breathtaking footage of the planet’s splendor. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt Galland Himself Danny Bryson Himself Blake Josephson Himself Full Cast & Crew Last Season Season 1 2015 | 1 Episode Season 1 of 100 Miles From Nowhere premiered on April  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 100 Miles From Nowhere. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  42m Homepage  - Genres Documentary Keywords survival travel endurance extreme activities Content Score 56 We're so close, yet so far. Top Contributors 16 Banana 6 suzen90 j 1 jojoba  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}