{"link": "https://www.themoviedb.org/tv/70218?language=en", "title": "Анна-детективъ", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 100, "genre": ["Mystery", "Drama", "Crime"], "cast": ["Aleksandra Nikiforova", "Dmitry Frid", "Sergey Druzyak", "Boris Khvoshnyanskiy", "Irina Sidorova"], "character": ["Анна Миронова", "Яков Штольман начальник сыскного отделения полиции", "Антон Коробейников помощник Штольмана", "Пётр Миронов дядя Анны", "Мария Миронова мать Анны"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70218   Expand Анна-детективъ   (2016) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Julia Venglovskaya Creator Aleksei Kolmogorov Creator Pavel Kim Creator Sergei Golubev Creator Mariya Kretinina Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aleksandra Nikiforova Анна Миронова Dmitry Frid Яков Штольман начальник сыскного отделения полиции Sergey Druzyak Антон Коробейников помощник Штольмана Boris Khvoshnyanskiy Пётр Миронов дядя Анны Irina Sidorova Мария Миронова мать Анны Full Cast & Crew Last Season Season 1 2016 | 56 Episodes Season 1 of Анна-детективъ premiered on November  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Анна-детективъ. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Scripted Original Language  Russian Runtime  48m Homepage   http://www.starmediafilm.com/ru/serial/anna_detektiv Genres Mystery Drama Crime Keywords detective history Content Score 86 Almost there... Top Contributors n 59 navarro2018 S 8 SergeiAK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}