{"link": "https://www.themoviedb.org/tv/1095?language=en", "title": "Ghost in the Shell: Stand Alone Complex", "resume": "In the future when technological enhancements and robotics are a way of life, Major Motoko Kusanagi and Section 9 take care of the jobs that are too difficult for the police. Section 9 employs hackers, sharpshooters, detectives and cyborgs all in an effort to thwart cyber criminals and their plans to attack the innocent.", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Atsuko Tanaka", "Akio Otsuka", "Kouichi Yamadera", "Kouichi Yamadera", "Osamu Saka"], "character": ["Motoko Kusanagi", "Batou", "Togusa", "Laughing Man", "Daisuke Aramaki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1095   Expand Ghost in the Shell: Stand Alone Complex   (2002) User Score Overview In the future when technological enhancements and robotics are a way of life, Major Motoko Kusanagi and Section 9 take care of the jobs that are too difficult for the police. Section 9 employs hackers, sharpshooters, detectives and cyborgs all in an effort to thwart cyber criminals and their plans to attack the innocent. Featured Crew Masamune Shirow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  12 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Atsuko Tanaka Motoko Kusanagi Akio Otsuka Batou Kouichi Yamadera Togusa Kouichi Yamadera Laughing Man Osamu Saka Daisuke Aramaki Full Cast & Crew Last Season Ghost in the Shell: S.A.C. 2nd GIG 2003 | 26 Episodes Season 2 of Ghost in the Shell: Stand Alone Complex premiered on December 31, 2003. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Does this take place before the events in the original GITS movie? Open 2 by  movie_nazi Go to Discussions Media Most Popular Videos  0 Backdrops  12 Posters  11 Recommendations   2003-10-04 Fullmetal Alchemist 8.0    2003-10-06 Gungrave 7.8    1998-04-02 TRIGUN 7.7    1997-10-07 Berserk 8.1    2004-04-12 GANTZ 6.7    2004-05-20 Samurai Champloo 8.0    1998-04-03 Cowboy Bebop 8.2    2007-06-09 Ergo Proxy 7.3  Facts Original Name  攻殻機動隊 STAND ALONE COMPLEX Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords cyborg cyberpunk robot anime Content Score 93 Almost there... Top Contributors 19 kappa-papa 16 sp1ti 10 SWFT M 9 Migi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}