{"link": "https://www.themoviedb.org/tv/6731?language=en", "title": "Gun", "resume": "Gun is an American television anthology series which aired on ABC on Saturday night from April 12, to May 31, 1997 at 10:00 p.m Eastern time. The series lasted six episodes, each directed by a well-known director, before being cancelled. Each episode involves the same semi-automatic pistol as an important part of the plot. The characters each episode are completely different and appeared unrelated to those who appeared in other episodes. The series was produced by Robert Altman and attracted numerous recognizable stars including Fred Ward, Kathy Baker, Carrie Fisher, Daryl Hannah, Randy Quaid, and Martin Sheen, as well as James Gandolfini in his first television appearance. The theme song was a cover of The Beatles' \"Happiness Is a Warm Gun\", performed by U2.", "rate": 60, "genre": [], "cast": ["Peter Horton", "James Gandolfini", "Rosanna Arquette", "Polly Cusumano", "Jennifer Tilly"], "character": ["Lilly Difideli", "Phyllis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6731   Expand Gun   (1997) User Score Overview Gun is an American television anthology series which aired on ABC on Saturday night from April 12, to May 31, 1997 at 10:00 p.m Eastern time. The series lasted six episodes, each directed by a well-known director, before being cancelled. Each episode involves the same semi-automatic pistol as an important part of the plot. The characters each episode are completely different and appeared unrelated to those who appeared in other episodes. The series was produced by Robert Altman and attracted numerous recognizable stars including Fred Ward, Kathy Baker, Carrie Fisher, Daryl Hannah, Randy Quaid, and Martin Sheen, as well as James Gandolfini in his first television appearance. The theme song was a cover of The Beatles' \"Happiness Is a Warm Gun\", performed by U2. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Horton James Gandolfini Rosanna Arquette Lilly Difideli Polly Cusumano Jennifer Tilly Phyllis Full Cast & Crew Last Season Season 1 1997 | 6 Episodes Season 1 of Gun premiered on April 12, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gun. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors e 2 egbertbos G 1 Gonçalo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}