{"link": "https://www.themoviedb.org/tv/1685?language=en", "title": "Project Runway", "resume": "Heidi Klum hosts a reality series where aspiring fashion designers compete for a chance to break into the industry. Each week, a designer is eliminated from the competition after exhibiting their work in front of a judges' panel.", "rate": 52, "genre": ["Reality"], "cast": ["Tim Gunn", "Heidi Klum", "Nina Garcia", "Zac Posen"], "character": ["Himself - Mentor", "Herself - Host", "Herself - Judge", "Himself - Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1685   Expand Project Runway   (2004) User Score Overview Heidi Klum hosts a reality series where aspiring fashion designers compete for a chance to break into the industry. Each week, a designer is eliminated from the competition after exhibiting their work in front of a judges' panel. Featured Crew Jonathan Murray Creator Mary-Ellis Bunim Creator Eli Holzman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  10 Content Issues  0 Images Backdrops  10 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Gunn Himself - Mentor Heidi Klum Herself - Host Nina Garcia Herself - Judge Zac Posen Himself - Judge Full Cast & Crew Last Season Season 16 2017 | 15 Episodes Season 16 of Project Runway premiered on August 17, 2017. View All Seasons Social Reviews  0 Discussions  10 Subject Status Replies Last Reply Ready, Set, Pick Your All-star! Open 58 by  Poetist Oscars Fashion Rundown Open 29 by  jonnieblack Ready, Set, and Pick! Open 114 by  Poetist Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  12 Recommendations   2003-05-20 America's Next Top Model 4.5    2004-01-08 The Celebrity Apprentice 4.2    2007-08-06 Drunk History 6.6    2012-01-05 Project Runway All Stars 7.4    1994-12-19 The Head 7.3    2005-05-30 Hell's Kitchen 6.3    2013-01-16 Kroll Show 7.1    2011-09-21 The X Factor 4.4  Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  60m, 90m Homepage   http://www.mylifetime.com/shows/project-runway Genres Reality Keywords fashion designer fashion fashion design reality competition Content Score 93 Almost there... Top Contributors 22 Elizabeth Jennings 15 Banana TB 13 TMDb Bot b 9 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}