{"link": "https://www.themoviedb.org/tv/31954?language=en", "title": "The Virtual Revolution", "resume": "Twenty years on from the invention of the World Wide Web, Dr Aleks Krotoski looks at how it is reshaping almost every aspect of our lives. Joined by some of the web's biggest names - including the founders of Facebook, Twitter, Amazon, Apple and Microsoft, and the web's inventor - she explores how far the web has lived up to its early promise.", "rate": 80, "genre": ["Documentary"], "cast": ["Aleks Krotoski", "Stephen Fry"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31954   Expand The Virtual Revolution   (2010) User Score Overview Twenty years on from the invention of the World Wide Web, Dr Aleks Krotoski looks at how it is reshaping almost every aspect of our lives. Joined by some of the web's biggest names - including the founders of Facebook, Twitter, Amazon, Apple and Microsoft, and the web's inventor - she explores how far the web has lived up to its early promise. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aleks Krotoski Stephen Fry Full Cast & Crew Last Season Season 1 2010 | 4 Episodes Season 1 of The Virtual Revolution premiered on January 30, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Virtual Revolution. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Virtual Revolution. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/virtualrevolution/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 6 SWFT R 4 Rebecca q 3 qq1112q 3 dimqua  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}