{"link": "https://www.themoviedb.org/tv/67466?language=en", "title": "Marvel's Runaways", "resume": "Every teenager thinks their parents are evil. What if you found out they actually were? Six diverse teenagers who can barely stand each other must unite against a common foe – their parents.", "rate": 74, "genre": ["Action", "Adventure", "Crime", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Rhenzy Feliz", "Ariela Barer", "Lyrica Okano", "Gregg Sulkin", "Virginia Gardner"], "character": ["Alex Wilder", "Gert Yorkes", "Nico Minoru", "Chase Stein", "Karolina Dean"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67466   Expand Marvel's Runaways   (2017) User Score  Play Trailer Overview Every teenager thinks their parents are evil. What if you found out they actually were? Six diverse teenagers who can barely stand each other must unite against a common foe – their parents. Featured Crew Josh Schwartz Creator Stephanie Savage Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  3 Posters  14 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  2 Opening Credits  0 Top Billed Cast Rhenzy Feliz Alex Wilder Ariela Barer Gert Yorkes Lyrica Okano Nico Minoru Gregg Sulkin Chase Stein Virginia Gardner Karolina Dean Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Marvel's Runaways premiered on November 21, 2017. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Just watched the first 3 episodes. Open 24 by  TheBayHarborButcher How long does it take to build a school? (Spoilers) Open 2 by  Innovator Just watched the trailer... Open 0 by JustinJackFlash\n      \n     Go to Discussions Media Most Popular Videos  4 Backdrops  3 Posters  14 Recommendations   2017-10-02 The Gifted 7.0    2017-09-29 Marvel's Inhumans 5.6    2017-11-17 Marvel's The Punisher 8.0    2017-08-18 Marvel's The Defenders 7.1    2017-09-25 The Brave 6.6    2017-07-12 Salvation 6.5    2018-01-16 Black Lightning 6.1    2017-12-06 HAPPY! 7.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  50m Homepage   https://www.hulu.com/marvels-runaways Genres Action & Adventure Crime Drama Sci-Fi & Fantasy Keywords runaway superhero based on comic teenager super villain marvel cinematic universe Content Score 100 Yes! Looking good! Top Contributors 45 Jessica Drew 41 Elizabeth Jennings 23 Martin AK 13 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}