{"link": "https://www.themoviedb.org/tv/42861?language=en", "title": "Koi Kaze", "resume": "Koi Kaze is a Japanese manga series written and illustrated by Motoi Yoshida. It premiered in the September 2001 issue of Evening and ran for 29 chapters until its conclusion in the October 2004 issue. The individual chapters were collected and published in five tankōbon volumes by Kodansha. The series tells of the love affair that develops between 27-year-old Koshiro, and his 15-year-old sister, Nanoka.\nThe chapters were adapted as a 13-episode anime television series by A.C.G.T. Directed by Takahiro Omori, the episodes premiered on TV Asahi on April 1, 2004 and ran until June 17, 2004. Only twelve episodes of the series aired, with the remaining episode streamed online and later included in both DVD releases and when the series aired in reruns as the eighth episode. The anime series is licensed for release in North American by Geneon Entertainment, which released it across three DVD volumes in 2005.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Kenta Miyake", "Yuuki Nakamura", "Akemi Okamura", "Kousuke Okano", "Ryoka Yuzuki"], "character": ["Koushirou Saeki", "Nanoka Kohinata", "Kaname Chidori", "Kei Odagiri", "Yoiko Akimoto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42861   Expand Koi Kaze   (2004) User Score Overview Koi Kaze is a Japanese manga series written and illustrated by Motoi Yoshida. It premiered in the September 2001 issue of Evening and ran for 29 chapters until its conclusion in the October 2004 issue. The individual chapters were collected and published in five tankōbon volumes by Kodansha. The series tells of the love affair that develops between 27-year-old Koshiro, and his 15-year-old sister, Nanoka. The chapters were adapted as a 13-episode anime television series by A.C.G.T. Directed by Takahiro Omori, the episodes premiered on TV Asahi on April 1, 2004 and ran until June 17, 2004. Only twelve episodes of the series aired, with the remaining episode streamed online and later included in both DVD releases and when the series aired in reruns as the eighth episode. The anime series is licensed for release in North American by Geneon Entertainment, which released it across three DVD volumes in 2005. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenta Miyake Koushirou Saeki Yuuki Nakamura Nanoka Kohinata Akemi Okamura Kaname Chidori Kousuke Okano Kei Odagiri Ryoka Yuzuki Yoiko Akimoto Full Cast & Crew Last Season Season 1 2004 | 13 Episodes Season 1 of Koi Kaze premiered on April  1, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Koi Kaze. You can help by rating TV shows you've seen. Facts Original Name  恋風 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Drama Keywords anime watercolour style Content Score 86 Almost there... Top Contributors M 7 Migi 7 Marr 🇳🇱 4 qw0aszx m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}