{"link": "https://www.themoviedb.org/tv/169?language=en", "title": "Fernwood 2 Night", "resume": "Fernwood 2 Night was a comedic television program that ran from July 1977 – September 1977. It was created by Norman Lear and produced by Alan Thicke as a spin-off/summer replacement from Mary Hartman, Mary Hartman. It was a parody talk show, hosted by Barth Gimble and sidekick/announcer Jerry Hubbard, complete with a stage band, Happy Kyne and His Mirthmakers. Barth was the twin brother of Garth Gimble from Mary Hartman.\nLike Mary Hartman, Fernwood 2 Night was set in the fictional town of Fernwood, Ohio. The show satirized real talk shows as well as the sort of fare one might expect from locally-produced, small-town, midwestern American television programming. Well-known actors usually appeared playing characters or a contrivance had to be written for the celebrity to appear as themselves.\nAfter one season of Fernwood, the producers revamped the show the following year as America 2-Night. In this second version, Barth and Jerry's show moved to California and was broadcast nationally on the fictional UBS network, whose slogan was \"We put U before the BS\". This change allowed the show to now have well-known actors on the show as themselves.", "rate": 90, "genre": [], "cast": ["Fred Willard", "Frank De Vol", "Martin Mull", "Craig Richard Nelson", "Kenneth Mars"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 169   Expand Fernwood 2 Night   (1977) User Score Overview Fernwood 2 Night was a comedic television program that ran from July 1977 – September 1977. It was created by Norman Lear and produced by Alan Thicke as a spin-off/summer replacement from Mary Hartman, Mary Hartman. It was a parody talk show, hosted by Barth Gimble and sidekick/announcer Jerry Hubbard, complete with a stage band, Happy Kyne and His Mirthmakers. Barth was the twin brother of Garth Gimble from Mary Hartman. Like Mary Hartman, Fernwood 2 Night was set in the fictional town of Fernwood, Ohio. The show satirized real talk shows as well as the sort of fare one might expect from locally-produced, small-town, midwestern American television programming. Well-known actors usually appeared playing characters or a contrivance had to be written for the celebrity to appear as themselves. After one season of Fernwood, the producers revamped the show the following year as America 2-Night. In this second version, Barth and Jerry's show moved to California and was broadcast nationally on the fictional UBS network, whose slogan was \"We put U before the BS\". This change allowed the show to now have well-known actors on the show as themselves. Featured Crew Norman Lear Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Willard Frank De Vol Martin Mull Craig Richard Nelson Kenneth Mars Full Cast & Crew Last Season Fernwood 2night season 1 1977 | 65 Episodes Season 1 of Fernwood 2 Night premiered on July  4, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fernwood 2 Night. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}