{"link": "https://www.themoviedb.org/tv/30860?language=en", "title": "Czterdziestolatek", "resume": "Czterdziestolatek or 40-latek was a Polish television comedy series broadcast between 1974 and 1977. The first series enjoyed so much popularity that it has successfully continued and led to the release of a feature film I'm a Butterfly, a 40-year-old Love Affair and a New Year's Eve television program in 1975.\nThe series was written by Jerzy Gruza and Krzysztof Teodor Toeplitz and was broadcast on Telewizja Polska. In total, 21 episodes were produced.\nThe series followed the fate of a Warsaw family and explored topics related to midlife crisis, such as extra-marital affairs, attempts to quit smoking, obsession with hair loss, efforts to maintain physical fitness, pride in achievements and professional life, the desire to seek self-fulfillment through social activities, etc.", "rate": 95, "genre": ["Comedy"], "cast": ["Andrzej Kopiczyński", "Anna Seniuk", "Roman Kłosowski", "Wladyslaw Hancza", "Wacław Kowalski"], "character": ["Karwowski", "Karwowska", "Maliniak", "Grandpa", "Popielak"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30860   Expand Czterdziestolatek User Score Overview Czterdziestolatek or 40-latek was a Polish television comedy series broadcast between 1974 and 1977. The first series enjoyed so much popularity that it has successfully continued and led to the release of a feature film I'm a Butterfly, a 40-year-old Love Affair and a New Year's Eve television program in 1975. The series was written by Jerzy Gruza and Krzysztof Teodor Toeplitz and was broadcast on Telewizja Polska. In total, 21 episodes were produced. The series followed the fate of a Warsaw family and explored topics related to midlife crisis, such as extra-marital affairs, attempts to quit smoking, obsession with hair loss, efforts to maintain physical fitness, pride in achievements and professional life, the desire to seek self-fulfillment through social activities, etc. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrzej Kopiczyński Karwowski Anna Seniuk Karwowska Roman Kłosowski Maliniak Wladyslaw Hancza Grandpa Wacław Kowalski Popielak Full Cast & Crew Last Season Season 2 — | 8 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors m 5 marek2k  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}