{"link": "https://www.themoviedb.org/tv/67117?language=en", "title": "American Housewife", "resume": "A family comedy narrated by Katie, a strong-willed mother, raising her flawed family in a wealthy town filled with perfect wives and their perfect offspring.", "rate": 71, "genre": ["Comedy"], "cast": ["Katy Mixon", "Diedrich Bader", "Meg Donnelly", "Daniel DiMaggio", "Julia Butters"], "character": ["Katie Otto", "Greg Otto", "Taylor Otto", "Oliver Otto", "Anna-Kat Otto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67117   Expand American Housewife   (2016) User Score  Play Trailer Overview A family comedy narrated by Katie, a strong-willed mother, raising her flawed family in a wealthy town filled with perfect wives and their perfect offspring. Featured Crew Sarah Dunn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katy Mixon Katie Otto Diedrich Bader Greg Otto Meg Donnelly Taylor Otto Daniel DiMaggio Oliver Otto Julia Butters Anna-Kat Otto Full Cast & Crew Last Season Season 2 2017 | 25 Episodes Season 2 of American Housewife premiered on September 27, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Taylor: Happy Birthday Meg Donnelly! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  1 Recommendations   2016-03-02 The Real O'Neals 7.7    2016-09-21 Speechless 7.5    2016-10-19 HIM 6.2    2017-02-02 Superior Donuts 6.5    2013-11-24 Getting On 6.8    1988-11-14 Murphy Brown 6.5    2014-09-24 black-ish 7.0    2015-02-04 Fresh Off the Boat 7.0  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  21m Homepage   http://abc.go.com/shows/american-housewife Genres Comedy Keywords suburbia family sitcom Content Score 100 Yes! Looking good! Top Contributors p 31 plumpro 18 Banana 14 Elizabeth Jennings b 9 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}