{"link": "https://www.themoviedb.org/tv/73827?language=en", "title": "País Irmão", "resume": "Reality is much stranger than fiction. There is a scandal that could be revealed and the Portuguese Government is nervous. The Minister of Culture and her team have a crazy idea that, for that reason, can work: to produce, together with Brazil, the biggest and most spectacular telenovela of all time: \"Corte Tropical\".", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Bruna Quintas", "José Raposo", "Afonso Pimentel", "Filipa Areosa", "Dinarte Branco"], "character": ["Mimi", "José Ávila", "Luís Ávila", "Vera", "Fernando"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73827   Expand País Irmão   (2017) User Score Overview Reality is much stranger than fiction. There is a scandal that could be revealed and the Portuguese Government is nervous. The Minister of Culture and her team have a crazy idea that, for that reason, can work: to produce, together with Brazil, the biggest and most spectacular telenovela of all time: \"Corte Tropical\". Featured Crew João Tordo Creator Tiago R. Santos Creator Hugo Gonçalves Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruna Quintas Mimi José Raposo José Ávila Afonso Pimentel Luís Ávila Filipa Areosa Vera Dinarte Branco Fernando Full Cast & Crew Last Season Season 1 2017 | 14 Episodes Season 1 of País Irmão premiered on September 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on País Irmão. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 10AP Meaning Acompanhamento Parental (may not be suitable for children under 10, parental guidance advised). Type  Scripted Original Language  Portuguese Runtime  45m Homepage   http://media.rtp.pt/paisirmao/ Genres Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors HS 58 Hugo S. 7 FilmesPortugueses TB 1 TMDb Bot J 1 JoaoEdu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}