{"link": "https://www.themoviedb.org/tv/32210?language=en", "title": "Srugim", "resume": "Srugim is an Israeli television drama which originally aired on Yes TV between 2008 and 2012. It was directed by Eliezer \"Laizy\" Shapiro, who co-created it with Hava Divon. The series depicted the lives of five national religious single men and women who reside in Jerusalem; the title is a reference to the crocheted skullcaps worn by men of that denomination. Srugim, which dealt with controversial issues in the Religious Zionist society in Israel, caused a public uproar within that sector. It enjoyed high ratings and won five Israeli Academy of Film and Television Awards.", "rate": 0, "genre": ["Drama"], "cast": ["Yael Sharoni", "Amos Tamam"], "character": ["Amir"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32210   Expand Srugim   (2008) User Score Overview Srugim is an Israeli television drama which originally aired on Yes TV between 2008 and 2012. It was directed by Eliezer \"Laizy\" Shapiro, who co-created it with Hava Divon. The series depicted the lives of five national religious single men and women who reside in Jerusalem; the title is a reference to the crocheted skullcaps worn by men of that denomination. Srugim, which dealt with controversial issues in the Religious Zionist society in Israel, caused a public uproar within that sector. It enjoyed high ratings and won five Israeli Academy of Film and Television Awards. Featured Crew Eliezer (Laizy) Shapiro Creator Chava Divon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yael Sharoni Amos Tamam Amir Full Cast & Crew Last Season Season 3 2011 | 15 Episodes Season 3 of Srugim premiered on October 23, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on Srugim. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  40m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}