{"link": "https://www.themoviedb.org/tv/51503?language=en", "title": "The Queen’s Classroom", "resume": "Drama series depicts the conflicts and struggles between a cold-hearted female teacher and her students over a one school year period.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Youn Yuh-jung", "Ko Hyun-jung", "Lee Ki-young", "Jin Kyung", "Kim Hyang-gi"], "character": ["Principal Yong Hyun-ja", "Ma Yeo-jin", "Vice-Principal Song Young-man", "Jung Hwa-shin", "Shim Ha-na"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51503   Expand The Queen’s Classroom   (2013) User Score Overview Drama series depicts the conflicts and struggles between a cold-hearted female teacher and her students over a one school year period. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Youn Yuh-jung Principal Yong Hyun-ja Ko Hyun-jung Ma Yeo-jin Lee Ki-young Vice-Principal Song Young-man Jin Kyung Jung Hwa-shin Kim Hyang-gi Shim Ha-na Full Cast & Crew Last Season Season 1 2013 | 16 Episodes Season 1 of The Queen’s Classroom premiered on June 12, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Queen’s Classroom. You can help by rating TV shows you've seen. Facts Original Name  여왕의 교실 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/qc/ Genres Comedy Drama Keywords korea school Content Score 86 Almost there... Top Contributors t 33 tmdb38202327 z 5 zurman1 3 lareina123 s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}