{"link": "https://www.themoviedb.org/tv/813?language=en", "title": "Hell's Kitchen", "resume": "Hell's Kitchen was a British cookery reality show aired on ITV which featured prospective chefs competing with each other for a final prize. Four series were aired from 2004 to 2009, three presented by Angus Deayton and the latest by Claudia Winkleman.", "rate": 60, "genre": ["Reality"], "cast": ["Angus Deayton", "Al Murray", "Amanda Barrie", "Dwain Chambers", "Edwina Currie"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 813   Expand Hell's Kitchen   (2004) User Score Overview Hell's Kitchen was a British cookery reality show aired on ITV which featured prospective chefs competing with each other for a final prize. Four series were aired from 2004 to 2009, three presented by Angus Deayton and the latest by Claudia Winkleman. Featured Crew Gordon Ramsay Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angus Deayton Al Murray Amanda Barrie Dwain Chambers Edwina Currie Full Cast & Crew Last Season (uk) season 4 2009 | 15 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hell's Kitchen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Reality Keywords kitchen chef Content Score 93 Almost there... Top Contributors 4 david8s95 s 3 speedycars 1 Elizabeth Jennings 1 Ovokx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}