{"link": "https://www.themoviedb.org/tv/356?language=en", "title": "Notes from the Underbelly", "resume": "Notes from the Underbelly is an American sitcom that debuted on ABC as a midseason replacement. The series is based upon the novel of the same name by Risa Green, and is produced by Eric and Kim Tannenbaum for Warner Bros. Television. The title is a parody of Dostoevsky's novel Notes from Underground.\nOriginally, it was supposed to debut on October 5, 2006, along with Big Day, but ABC made a last-minute change in its schedule by moving Ugly Betty to Thursday, thus replacing both sitcoms. After numerous scheduling changes prior to the shows premiere, the show premiered Thursday, April 12, 2007 at 10:00PM Eastern/9:00PM Central, and moved to its regular Wednesday timeslot at 8:30PM Eastern/7:30PM Central on April 18.\nNotes from the Underbelly began its second season on November 26, 2007 in the new timeslot of 9:30PM Eastern/8:30PM Central on Mondays, leading out of fall's second highest rated freshman sitcom, Samantha Who?.\nOn May 13, 2008, ABC opted not to renew the series for a third season.\nIn Russia, all 23 episodes of the series were shown on NTV.", "rate": 40, "genre": ["Comedy"], "cast": ["Sunkrish Bala", "Melanie Paxson", "Rachael Harris", "Michael Weaver", "Peter Cambor"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 356   Expand Notes from the Underbelly   (2007) User Score Overview Notes from the Underbelly is an American sitcom that debuted on ABC as a midseason replacement. The series is based upon the novel of the same name by Risa Green, and is produced by Eric and Kim Tannenbaum for Warner Bros. Television. The title is a parody of Dostoevsky's novel Notes from Underground. Originally, it was supposed to debut on October 5, 2006, along with Big Day, but ABC made a last-minute change in its schedule by moving Ugly Betty to Thursday, thus replacing both sitcoms. After numerous scheduling changes prior to the shows premiere, the show premiered Thursday, April 12, 2007 at 10:00PM Eastern/9:00PM Central, and moved to its regular Wednesday timeslot at 8:30PM Eastern/7:30PM Central on April 18. Notes from the Underbelly began its second season on November 26, 2007 in the new timeslot of 9:30PM Eastern/8:30PM Central on Mondays, leading out of fall's second highest rated freshman sitcom, Samantha Who?. On May 13, 2008, ABC opted not to renew the series for a third season. In Russia, all 23 episodes of the series were shown on NTV. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sunkrish Bala Melanie Paxson Rachael Harris Michael Weaver Peter Cambor Full Cast & Crew Last Season Season 2 2007 | 15 Episodes Season 2 of Notes from the Underbelly premiered on November 26, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Notes from the Underbelly. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.abc.go.com/primetime/notesfromtheunderbelly/ Genres Comedy Keywords pregnancy sitcom Content Score 86 Almost there... Top Contributors 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}