{"link": "https://www.themoviedb.org/tv/4369?language=en", "title": "bro'Town", "resume": "bro'Town is a New Zealand Television animated series. The show used a comedy based format, targeted at a young adult audience.\nThe series is set amongst New Zealand's fast growing Pacific Islander community, and focuses on a central cast of five young boys. bro'Town is heavy with popular culture references, and is based on the performance of the local four-man group The Naked Samoans.\nVale, Valea, Jeff da Māori, Sione and Mack live in the suburb of Morningside, and attend the local college, St Sylvester’s, where their principal is a Fa’afafine and the P.E. teacher is the legendary ex-All Black rugby player Michael Jones.", "rate": 45, "genre": ["Animation", "Comedy"], "cast": ["Oscar Kightley", "David Fane", "Shimpal Lelisi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4369   Expand bro'Town   (2004) User Score Overview bro'Town is a New Zealand Television animated series. The show used a comedy based format, targeted at a young adult audience. The series is set amongst New Zealand's fast growing Pacific Islander community, and focuses on a central cast of five young boys. bro'Town is heavy with popular culture references, and is based on the performance of the local four-man group The Naked Samoans. Vale, Valea, Jeff da Māori, Sione and Mack live in the suburb of Morningside, and attend the local college, St Sylvester’s, where their principal is a Fa’afafine and the P.E. teacher is the legendary ex-All Black rugby player Michael Jones. Featured Crew Oscar Kightley Creator Shimpal Lelisi Creator David Fane Creator Mario Gaoa Creator Elizabeth Mitchell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oscar Kightley David Fane Shimpal Lelisi Full Cast & Crew Last Season Season 5 2009 | 6 Episodes Season 5 of bro'Town premiered on April 19, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on bro'Town. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.brotown.co.nz Genres Animation Comedy Keywords new zealand auckland Content Score 64 We're so close, yet so far. Top Contributors p 12 plumpro  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}