{"link": "https://www.themoviedb.org/tv/33352?language=en", "title": "Õnne 13", "resume": "Õnne 13 is an Estonian dramatic TV series that airs on ETV. The series first aired on 30 October 1993 and was written by Astrid Reinla and as of 1996 by Teet Kallas. Since 1997, the series is produced by BEC, which has also produced Pehmed ja Karvased, Kodu Keset Linna and Ohtlik Lend.\nThe series takes place in the fictional town of Morna, and features an ensemble cast.", "rate": 0, "genre": ["Drama", "Comedy", "Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33352   Expand Õnne 13   (1993) User Score Overview Õnne 13 is an Estonian dramatic TV series that airs on ETV. The series first aired on 30 October 1993 and was written by Astrid Reinla and as of 1996 by Teet Kallas. Since 1997, the series is produced by BEC, which has also produced Pehmed ja Karvased, Kodu Keset Linna and Ohtlik Lend. The series takes place in the fictional town of Morna, and features an ensemble cast. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 20 2012 | 36 Episodes Season 20 of Õnne 13 premiered on September 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Õnne 13. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.etv.err.ee/index.php?0544295 Genres Drama Comedy Family Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}