{"link": "https://www.themoviedb.org/tv/62607?language=en", "title": "Love From Today", "resume": "A drama about a woman who finally becomes a part of a family after re-adoption and man who chooses love over family.", "rate": 95, "genre": ["Drama", "Family", "Romance"], "cast": ["Im Se-Mi", "Park Jin-woo", "Jo Hee-bong", "Ahn Nae-sang", "Choo So-yeong"], "character": ["Yoon Seung Hye", "Kang Do Jin", "Byun Joon-bae", "Yoon Dae-ho", "Yoon Dae-shil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62607   Expand Love From Today   (2015) User Score Overview A drama about a woman who finally becomes a part of a family after re-adoption and man who chooses love over family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Im Se-Mi Yoon Seung Hye Park Jin-woo Kang Do Jin Jo Hee-bong Byun Joon-bae Ahn Nae-sang Yoon Dae-ho Choo So-yeong Yoon Dae-shil Full Cast & Crew Last Season Season 1 2015 | 101 Episodes Season 1 of Love From Today premiered on April  6, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love From Today. You can help by rating TV shows you've seen. Facts Original Name  오늘부터 사랑해 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/todaylove/ Genres Drama Family Romance Keywords korea Content Score 86 Almost there... Top Contributors M 43 Maria180493 t 2 tmdb38202327 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}