{"link": "https://www.themoviedb.org/tv/4832?language=en", "title": "Superstorm", "resume": "Superstorm is a three-part British docudrama miniseries written and directed by Julian Simpson, about a group of scientists that try to divert and weaken hurricanes using cloud seeding.\nSuperstorm originally aired on BBC One for a period of three weeks, totaling three 59 minute episodes, from 15 April 2007 to 29 April 2007. Each episode was followed by a half-hour documentary on BBC Two on extreme weather monitoring and forecasting, called The Science of Superstorms. The series was also aired on the Discovery Channel in the U.S. and Canada during the summer of 2007.\nSuperstorm is a co-production of BBC Worldwide, Discovery Channel and ProSieben, in association with M6 and NHK. Ailsa Orr and Michael Mosley, who made also Supervolcano, are the executive producers for BBC, while Jack E. Smith is the executive producer for Discovery Channel.\nThe miniseries was released on DVD in the United Kingdom on 2 July 2007.", "rate": 58, "genre": ["Drama"], "cast": ["JR Bourne", "Tom Sizemore", "Chris Potter", "Nicola Stephenson", "Nicolas Wright"], "character": ["Lance Resnick", "Katzenberg", "Dan Abrams", "Sara Hughes", "Ralf DeWitt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4832   Expand Superstorm   (2007) User Score Overview Superstorm is a three-part British docudrama miniseries written and directed by Julian Simpson, about a group of scientists that try to divert and weaken hurricanes using cloud seeding. Superstorm originally aired on BBC One for a period of three weeks, totaling three 59 minute episodes, from 15 April 2007 to 29 April 2007. Each episode was followed by a half-hour documentary on BBC Two on extreme weather monitoring and forecasting, called The Science of Superstorms. The series was also aired on the Discovery Channel in the U.S. and Canada during the summer of 2007. Superstorm is a co-production of BBC Worldwide, Discovery Channel and ProSieben, in association with M6 and NHK. Ailsa Orr and Michael Mosley, who made also Supervolcano, are the executive producers for BBC, while Jack E. Smith is the executive producer for Discovery Channel. The miniseries was released on DVD in the United Kingdom on 2 July 2007. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast JR Bourne Lance Resnick Tom Sizemore Katzenberg Chris Potter Dan Abrams Nicola Stephenson Sara Hughes Nicolas Wright Ralf DeWitt Full Cast & Crew Last Season Season 1 2007 | 3 Episodes Season 1 of Superstorm premiered on April 15, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Superstorm. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords hurricane natural disaster miniseries scientist Content Score 86 Almost there... Top Contributors 21 Banana t 7 tmdb45070722 4 Marr 🇳🇱 3 galani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}