{"link": "https://www.themoviedb.org/tv/370?language=en", "title": "Stickin' Around", "resume": "Created by Robin Steele and Brianne Leary, Stickin' Around is a Canadian animated children's television series from Nelvana, which originally aired on YTV in Canada and on ABC in Australia. In Latin America, it was broadcast by Nickelodeon under the title Los Grafitos. It was also aired in the United States on the Fox Family Channel from 1998 to 1999 as part of the series The Three Friends & Jerry, which was adapted on that channel as an anthology series.\nThe show, which originated as a series of 1-minute vignettes on CBS in 1994, is about two children named Stacy and Bradley, their hand-drawn adventures with their friends and family, and their fantasies. Stacy and Bradley, best friends, encounter many problems they must face as they continue to grow up - if it is with school, bullies, friends, and parents. They always come up with imaginative ideas to eliminate these obstacles, such as becoming a superhero, and putting themselves in a different environment where they have no trouble in defeating their enemies.\nAccording to Nelvana, it uses the \"advanced computer graphics of \"Boiler Paint,\" virtually convincing us that kids are creating their own animated series.\" The show won the Gemini Award for \"Best Animated Program or Series\" in the spring of 1998, while being nominated once again during the fall of 1998, for the Gemini of the same award.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Ashley Brown", "Ron Rubin", "Catherine Disher", "Melleny Brown", "Amos Crawley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 370   Expand Stickin' Around   (1996) User Score Overview Created by Robin Steele and Brianne Leary, Stickin' Around is a Canadian animated children's television series from Nelvana, which originally aired on YTV in Canada and on ABC in Australia. In Latin America, it was broadcast by Nickelodeon under the title Los Grafitos. It was also aired in the United States on the Fox Family Channel from 1998 to 1999 as part of the series The Three Friends & Jerry, which was adapted on that channel as an anthology series. The show, which originated as a series of 1-minute vignettes on CBS in 1994, is about two children named Stacy and Bradley, their hand-drawn adventures with their friends and family, and their fantasies. Stacy and Bradley, best friends, encounter many problems they must face as they continue to grow up - if it is with school, bullies, friends, and parents. They always come up with imaginative ideas to eliminate these obstacles, such as becoming a superhero, and putting themselves in a different environment where they have no trouble in defeating their enemies. According to Nelvana, it uses the \"advanced computer graphics of \"Boiler Paint,\" virtually convincing us that kids are creating their own animated series.\" The show won the Gemini Award for \"Best Animated Program or Series\" in the spring of 1998, while being nominated once again during the fall of 1998, for the Gemini of the same award. Featured Crew Brianne Leary Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashley Brown Ron Rubin Catherine Disher Melleny Brown Amos Crawley Full Cast & Crew Last Season Season 3 2004 | 5 Episodes Season 3 of Stickin' Around premiered on September 16, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Stickin' Around. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 26m Homepage   http://www.nelvana.com/show/128/stickin-around Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}