{"link": "https://www.themoviedb.org/tv/63573?language=en", "title": "My Dear Cat", "resume": "While looking for her lost cat, magazine journalist Go Yang-soon meets law school student and part-time photographer Yeom Chi-woong. Soon, they begin to get to know each other and each other's families.", "rate": 85, "genre": ["Comedy", "Family", "Romance"], "cast": ["Choi Yoon-young", "Hyun Woo", "Jun Hyo-seong", "Choi Sung-min", "Ko Won-hee"], "character": ["Go Yang-soon", "Yeom Chi-woong", "Han Soo-ri", "Yum Chi-Joo", "Shin Ji-eun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63573   Expand My Dear Cat   (2014) User Score Overview While looking for her lost cat, magazine journalist Go Yang-soon meets law school student and part-time photographer Yeom Chi-woong. Soon, they begin to get to know each other and each other's families. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Yoon-young Go Yang-soon Hyun Woo Yeom Chi-woong Jun Hyo-seong Han Soo-ri Choi Sung-min Yum Chi-Joo Ko Won-hee Shin Ji-eun Full Cast & Crew Last Season Season 1 2014 | 119 Episodes Season 1 of My Dear Cat premiered on June  9, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Dear Cat. You can help by rating TV shows you've seen. Facts Original Name  고양이는 있다 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/cat/ Genres Comedy Family Romance Keywords korea Content Score 86 Almost there... Top Contributors t 53 tmdb38202327 8 Mervan TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}