{"link": "https://www.themoviedb.org/tv/36837?language=en", "title": "His and Her Circumstances", "resume": "In His and Her Circumstances, like a drug, Yukino Miyazawa was  addicted to admiration and praise from those around her. She worked hard  to become the perfect student, the perfect girl. But that was before…  him. Souichirou Arima. The instant she met him, she hated him. Without  even trying, he snatched the very glory from her hands by easily acing  the high school entrance exam that should have made her the class  representative. To take back what is rightfully hers, Yukino is putting  all her efforts into plotting her revenge – but was love part of the  plan?", "rate": 75, "genre": ["Animation", "Drama"], "cast": ["Atsuko Enomoto", "Chihiro Suzuki"], "character": ["Yukino \"Yuki\" Miyazawa (voice)", "Souichirou Arima (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36837   Expand His and Her Circumstances   (1998) User Score Overview In His and Her Circumstances, like a drug, Yukino Miyazawa was  addicted to admiration and praise from those around her. She worked hard  to become the perfect student, the perfect girl. But that was before…  him. Souichirou Arima. The instant she met him, she hated him. Without  even trying, he snatched the very glory from her hands by easily acing  the high school entrance exam that should have made her the class  representative. To take back what is rightfully hers, Yukino is putting  all her efforts into plotting her revenge – but was love part of the  plan? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Atsuko Enomoto Yukino \"Yuki\" Miyazawa (voice) Chihiro Suzuki Souichirou Arima (voice) Full Cast & Crew Last Season Season 1 1998 | 26 Episodes Season 1 of His and Her Circumstances premiered on October  2, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on His and Her Circumstances. You can help by rating TV shows you've seen. Facts Original Name  彼氏彼女の事情 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.nozomientertainment.com/product/his-and-her-circumstances/ Genres Animation Drama Keywords high school slice of life based on manga teenage romance Content Score 56 We're so close, yet so far. Top Contributors 91 Marr 🇳🇱 6 cwhboy M 4 MGB89 J 3 JohnyB0y  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}