{"link": "https://www.themoviedb.org/tv/14173?language=en", "title": "The Bold Ones: The New Doctors", "resume": "The Bold Ones: The New Doctors is an American medical drama that lasted for four seasons on NBC, from 1969 to 1973.", "rate": 0, "genre": ["Drama"], "cast": ["John Saxon", "Julie Adams", "David Hartman", "E.G. Marshall"], "character": ["Dr. Theodore Stuart", "Lynn Craig", "Dr. Paul Hunter", "Dr. David Craig"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14173   Expand The Bold Ones: The New Doctors   (1969) User Score Overview The Bold Ones: The New Doctors is an American medical drama that lasted for four seasons on NBC, from 1969 to 1973. Featured Crew Steven Bochco Creator Richard H. Landau Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Saxon Dr. Theodore Stuart Julie Adams Lynn Craig David Hartman Dr. Paul Hunter E.G. Marshall Dr. David Craig Full Cast & Crew Last Season Season 4 1972 | 16 Episodes Season 4 of The Bold Ones: The New Doctors premiered on September 19, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Bold Ones: The New Doctors. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords doctor neurosurgeon medical drama medical clinic Content Score 79 Pump it up! We're close now. Top Contributors 10 Banana R 3 Rebecca 3 Elizabeth Jennings 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}