{"link": "https://www.themoviedb.org/tv/7084?language=en", "title": "Lewis Black's Root of All Evil", "resume": "Lewis Black's Root of All Evil is an American television series that premiered on March 12, 2008, on Comedy Central and was hosted by comedian Lewis Black. The series producer was Scott Carter from Real Time with Bill Maher and the writer was David Sacks from The Simpsons. Sometimes there were pre-recorded video segments directed by supervising producer Michael Addis.\nLewis Black's Root of All Evil is formatted as a mock trial acted in deadpan. Black presided over two opposing people or issues; and guest comedians acted as lawyers/advocates arguing that their client/Evil is the Root of All Evil.\nThe series ended on October 1, 2008, with a total of 18 episodes. The series' cancellation was confirmed by Lewis Black in September 2009. The entire first season of Lewis Black's Root of All Evil was released on DVD in the United States on September 30, 2008. The remaining episodes from season two are not currently available on DVD.", "rate": 0, "genre": ["Comedy"], "cast": ["Lewis Black"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7084   Expand Lewis Black's Root of All Evil   (2008) User Score Overview Lewis Black's Root of All Evil is an American television series that premiered on March 12, 2008, on Comedy Central and was hosted by comedian Lewis Black. The series producer was Scott Carter from Real Time with Bill Maher and the writer was David Sacks from The Simpsons. Sometimes there were pre-recorded video segments directed by supervising producer Michael Addis. Lewis Black's Root of All Evil is formatted as a mock trial acted in deadpan. Black presided over two opposing people or issues; and guest comedians acted as lawyers/advocates arguing that their client/Evil is the Root of All Evil. The series ended on October 1, 2008, with a total of 18 episodes. The series' cancellation was confirmed by Lewis Black in September 2009. The entire first season of Lewis Black's Root of All Evil was released on DVD in the United States on September 30, 2008. The remaining episodes from season two are not currently available on DVD. Featured Crew David Sacks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lewis Black Full Cast & Crew Last Season (us) season 2 2008 | 10 Episodes Season 2 of Lewis Black's Root of All Evil premiered on July 30, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Lewis Black's Root of All Evil. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 20m Homepage   http://www.comedycentral.com/shows/root_of_all_evil/index.jhtml Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors b 1 brewtown  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}