{"link": "https://www.themoviedb.org/tv/36084?language=en", "title": "Tears to Tiara", "resume": "Set in a fictitious land during a medieval-like era of magic and fantasy, Tears to Tiara unfolds with the Divine Empire’s rise to power as it conquers and rules lands far and wide. On the island of Erin, still ruled by the Ancient Kingdom, the Goidelic people are attempting to sacrifice priestess Riannon to revive protagonist and demon king Arawn to lead the resistance against the Empire. Although the ritual fails and Riannon survives, the seal imprisoning the demon king is broken and Arawn is resurrected. Armed with mysterious and devastating powers and a human’s demeanour, Arawn joins Riannon, her brother and battalion commander, Arthur, as well as their team of fighters comprising a swordsman, an archer and a quintet of magical pixies, in the epic struggle against the Divine Empire.", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Yuko Goto", "Kaori Nazuka", "Mai Nakahara", "Makoto Ishii", "Rie Tanaka"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36084   Expand Tears to Tiara   (2009) User Score Overview Set in a fictitious land during a medieval-like era of magic and fantasy, Tears to Tiara unfolds with the Divine Empire’s rise to power as it conquers and rules lands far and wide. On the island of Erin, still ruled by the Ancient Kingdom, the Goidelic people are attempting to sacrifice priestess Riannon to revive protagonist and demon king Arawn to lead the resistance against the Empire. Although the ritual fails and Riannon survives, the seal imprisoning the demon king is broken and Arawn is resurrected. Armed with mysterious and devastating powers and a human’s demeanour, Arawn joins Riannon, her brother and battalion commander, Arthur, as well as their team of fighters comprising a swordsman, an archer and a quintet of magical pixies, in the epic struggle against the Divine Empire. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuko Goto Kaori Nazuka Mai Nakahara Makoto Ishii Rie Tanaka Full Cast & Crew Last Season Season 1 2009 | 26 Episodes Season 1 of Tears to Tiara premiered on April  6, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tears to Tiara. You can help by rating TV shows you've seen. Facts Original Name  ティアーズ・トゥ・ティアラ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 8 TheDerpMan 6 seboseboss m 3 magoozin f 2 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}