{"link": "https://www.themoviedb.org/tv/42963?language=en", "title": "Ayakashi: Samurai Horror Tales", "resume": "Ayakashi is a Japanese animated horror anthology television series produced by Toei Animation.\nThe series is made up of three stories: \"Yotsuya Ghost Story\", an adaptation of the classic Japanese ghost story; \"Goddess of the Dark Tower\", based on the play by Kyōka Izumi; and Goblin Cat, an original story by Kenji Nakamura and Michiko Yokote.", "rate": 70, "genre": ["Animation"], "cast": ["Hiroaki Hirata", "Mami Koyama", "Yuko Nagashima", "Keiichi Sonobe", "Ryou Hirohashi"], "character": ["Iemon Tamiya", "Oiwa Tamiya", "Osode Yotsuya", "Gonbei Naosuke", "Oume Ito"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42963   Expand Ayakashi: Samurai Horror Tales   (2006) User Score Overview Ayakashi is a Japanese animated horror anthology television series produced by Toei Animation. The series is made up of three stories: \"Yotsuya Ghost Story\", an adaptation of the classic Japanese ghost story; \"Goddess of the Dark Tower\", based on the play by Kyōka Izumi; and Goblin Cat, an original story by Kenji Nakamura and Michiko Yokote. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroaki Hirata Iemon Tamiya Mami Koyama Oiwa Tamiya Yuko Nagashima Osode Yotsuya Keiichi Sonobe Gonbei Naosuke Ryou Hirohashi Oume Ito Full Cast & Crew Last Season Season 1 2006 | 11 Episodes Season 1 of Ayakashi: Samurai Horror Tales premiered on January 13, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ayakashi: Samurai Horror Tales. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.toei-anim.co.jp/tv/ayakashi/index.html Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 Jaime Neto 3 enams90 m 3 morrison m 1 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}