{"link": "https://www.themoviedb.org/tv/9773?language=en", "title": "Captain Caveman and the Teen Angels", "resume": "Captain Caveman and the Teen Angels is an animated series created by Joe Ruby and Ken Spears and produced by Hanna-Barbera Productions from September 10, 1977 to June 21, 1980 on ABC.\nThe first and second seasons were originally broadcast as segments on the package shows Scooby's All-Star Laff-A-Lympics and Scooby's All-Stars from 1977 to 1979 and the third season featured Captain Caveman and the Teen Angels in their own half-hour timeslot in 1980.", "rate": 62, "genre": ["Animation", "Comedy"], "cast": ["Mel Blanc", "Vernee Watson-Johnson", "Marilyn Schreffler", "Laurel Page"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9773   Expand Captain Caveman and the Teen Angels   (1977) User Score Overview Captain Caveman and the Teen Angels is an animated series created by Joe Ruby and Ken Spears and produced by Hanna-Barbera Productions from September 10, 1977 to June 21, 1980 on ABC. The first and second seasons were originally broadcast as segments on the package shows Scooby's All-Star Laff-A-Lympics and Scooby's All-Stars from 1977 to 1979 and the third season featured Captain Caveman and the Teen Angels in their own half-hour timeslot in 1980. Featured Crew Joe Ruby Creator Ken Spears Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Mel Blanc Vernee Watson-Johnson Marilyn Schreffler Laurel Page Full Cast & Crew Last Season Season 3 1980 | 16 Episodes Season 3 of Captain Caveman and the Teen Angels premiered on March  8, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   1969-09-13 The Perils of Penelope Pitstop 5.7    1958-10-02 The Huckleberry Hound Show 7.0    1977-09-10 Scooby's All-Star Laff-A-Lympics 8.5    The Scooby & Scrappy-Doo/Puppy Hour 6.7    1976-09-11 The Scooby-Doo/Dynomutt Hour 7.1    1975-09-06 The Tom and Jerry Show 7.6    1968-09-14 Wacky Races 7.1    1985-09-09 She-Ra: Princess of Power 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords cavemen Content Score 100 Yes! Looking good! Top Contributors d 5 denis 4 minhus 3 Elizabeth Jennings 3 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}