{"link": "https://www.themoviedb.org/tv/4799?language=en", "title": "Hannay", "resume": "Hannay was a 1988 spin-off from the 1978 film version of John Buchan's novel The Thirty-Nine Steps which had starred Robert Powell as Richard Hannay.\nIn the series, Powell reprised the role of Hannay, an Edwardian mining engineer from Rhodesia of Scottish origin. It features his adventures in pre-World War I Great Britain. These stories had little in common with John Buchan's novels about the character, although some character names are taken from his other novels.\nThere were two series, the first with six episodes, the second with seven. The combined 13 episodes ran for a total of 652 minutes.\nOne episode, A Point of Honour, was based on a story of the same name by Dornford Yates that appeared in his 1914 book The Brother of Daphne, although Yates was not credited.\nAnother episode used a plot device from the Leslie Charteris Saint story The Unblemished Bootlegger, from the 1933 book The Brighter Buccaneer, again uncredited.", "rate": 0, "genre": ["Drama"], "cast": ["Robert Powell"], "character": ["Richard Hannay"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4799   Expand Hannay   (1988) User Score Overview Hannay was a 1988 spin-off from the 1978 film version of John Buchan's novel The Thirty-Nine Steps which had starred Robert Powell as Richard Hannay. In the series, Powell reprised the role of Hannay, an Edwardian mining engineer from Rhodesia of Scottish origin. It features his adventures in pre-World War I Great Britain. These stories had little in common with John Buchan's novels about the character, although some character names are taken from his other novels. There were two series, the first with six episodes, the second with seven. The combined 13 episodes ran for a total of 652 minutes. One episode, A Point of Honour, was based on a story of the same name by Dornford Yates that appeared in his 1914 book The Brother of Daphne, although Yates was not credited. Another episode used a plot device from the Leslie Charteris Saint story The Unblemished Bootlegger, from the 1933 book The Brighter Buccaneer, again uncredited. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Powell Richard Hannay Full Cast & Crew Last Season Season 2 1989 | 7 Episodes Season 2 of Hannay premiered on January 31, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hannay. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m, 60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors TB 2 TMDb Bot K 1 Knossos 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}