{"link": "https://www.themoviedb.org/tv/37425?language=en", "title": "Haken no Hinkaku", "resume": "Oomae Haruko is an A+ Temp worker who never cracks a smile or minces words, and leaves work on the dot. But her cynical nature indicates she has something painful to hide. Satonaka Kensuke has just been promoted to head S&F's new Marketing Division. Saddled with a rag-tag group of subordinates, he is struggling to lift his division off the ground. When Oomae is placed in Kensuke's department, she finds herself doing more work than she's ever done before.\nThis is a timely drama that examines the different attitudes toward temp workers and regular employees, and the ways to overcome frictions in interpersonal relationships. This follows an October report on labor conditions by the Labor Ministry, which showed that, after regulations were relaxed, the proportion of regular employees to Temps had doubled compared to that of eight years ago.", "rate": 0, "genre": ["Drama"], "cast": ["Ryoko Shinohara", "Yo Oizumi", "Ken Yasuda", "Noriko Iriyama", "Kôtarô Koizumi"], "character": ["Haruko Oomae", "Takeshi Shouji", "Shinya Hitotsugi", "Kaoru Shimada", "Kensuke Satonaka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37425   Expand Haken no Hinkaku   (2007) User Score Overview Oomae Haruko is an A+ Temp worker who never cracks a smile or minces words, and leaves work on the dot. But her cynical nature indicates she has something painful to hide. Satonaka Kensuke has just been promoted to head S&F's new Marketing Division. Saddled with a rag-tag group of subordinates, he is struggling to lift his division off the ground. When Oomae is placed in Kensuke's department, she finds herself doing more work than she's ever done before. This is a timely drama that examines the different attitudes toward temp workers and regular employees, and the ways to overcome frictions in interpersonal relationships. This follows an October report on labor conditions by the Labor Ministry, which showed that, after regulations were relaxed, the proportion of regular employees to Temps had doubled compared to that of eight years ago. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryoko Shinohara Haruko Oomae Yo Oizumi Takeshi Shouji Ken Yasuda Shinya Hitotsugi Noriko Iriyama Kaoru Shimada Kôtarô Koizumi Kensuke Satonaka Full Cast & Crew Last Season Season 1 2007 | 10 Episodes Season 1 of Haken no Hinkaku premiered on January 10, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Haken no Hinkaku. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Haken no Hinkaku. You can help by rating TV shows you've seen. Facts Original Name  ハケンの品格 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.ntv.co.jp/haken/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 25 Aka75 a 12 anojoe t 4 taxigps 3 Terence Haejin Lee  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}