{"link": "https://www.themoviedb.org/tv/62905?language=en", "title": "The Spring Day of My Life", "resume": "This is a melodrama about a woman who received heart transplant and a man who loved his late wife very much. Lee Bom Yi decided to live her life to the fullest as a token of gratitude for the donor. She then accidentally met Kang Dong Ha, a single father with two children, unaware that he was the husband of her donor. Kang Dong Ha is baffled that Lee Bom Yi shares many similar traits with his late wife.", "rate": 40, "genre": ["Drama"], "cast": ["Kam Wu-seong", "Choi Soo-young", "Lee Joon-hyuk", "Jang Shin-Young", "Shim Hye-jin"], "character": ["Kang Dong-ha", "Lee Bom-yi", "Kang Dong-wook", "Bae Ji-won", "Jo Myung-hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62905   Expand The Spring Day of My Life   (2014) User Score Overview This is a melodrama about a woman who received heart transplant and a man who loved his late wife very much. Lee Bom Yi decided to live her life to the fullest as a token of gratitude for the donor. She then accidentally met Kang Dong Ha, a single father with two children, unaware that he was the husband of her donor. Kang Dong Ha is baffled that Lee Bom Yi shares many similar traits with his late wife. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kam Wu-seong Kang Dong-ha Choi Soo-young Lee Bom-yi Lee Joon-hyuk Kang Dong-wook Jang Shin-Young Bae Ji-won Shim Hye-jin Jo Myung-hee Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of The Spring Day of My Life premiered on September 10, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Spring Day of My Life. You can help by rating TV shows you've seen. Facts Original Name  내 생애 봄날 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/springday/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 41 Maria180493 6 Elizabeth Jennings 2 sansalayne t 2 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}