{"link": "https://www.themoviedb.org/tv/65424?language=en", "title": "Secret Love Online", "resume": "Awatsaya (Anne) is a fierce boss who secretly falls in love with her new young subordinate, Pranont (Mark). Because she needs to maintain her image as a professional and boss she conceals this secret. In order to get to know him better and court him, she uses an online chat program, MSN, using the alias ‘Khun Ab Ruk (Secret Love).'\nTheir relationship starts to bloom, but is cut short when Awatsaya carelessly reveals her secret to the handsome and cunning Managing Director of the company Lipda (Peter). When Lipda learns of this secret, he tries to help Awatsaya move forward with Pranont. However, he ends up making everything even more troublesome when he secretly falls in love with Awatsaya. The love triangle between Awatsaya, Pranont, and Lipda is unable to end easily when another obstacle like Prip-Praao (Kim) comes into the picture and pretends to be ‘Khun Ab Ruk.'", "rate": 0, "genre": ["Drama", "Romance", "Comedy"], "cast": ["Angie Hastings", "Ekkachai Euasangkomsert", "Deejai Dee Dee Dee", "Siphan Cheuanchongboon", "Daraneenuch Photipiti"], "character": ["Jarawee", "Run", "Nida", "Sandy", "Aunt Prew"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65424   Expand Secret Love Online   (2015) User Score Overview Awatsaya (Anne) is a fierce boss who secretly falls in love with her new young subordinate, Pranont (Mark). Because she needs to maintain her image as a professional and boss she conceals this secret. In order to get to know him better and court him, she uses an online chat program, MSN, using the alias ‘Khun Ab Ruk (Secret Love).' Their relationship starts to bloom, but is cut short when Awatsaya carelessly reveals her secret to the handsome and cunning Managing Director of the company Lipda (Peter). When Lipda learns of this secret, he tries to help Awatsaya move forward with Pranont. However, he ends up making everything even more troublesome when he secretly falls in love with Awatsaya. The love triangle between Awatsaya, Pranont, and Lipda is unable to end easily when another obstacle like Prip-Praao (Kim) comes into the picture and pretends to be ‘Khun Ab Ruk.' Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angie Hastings Jarawee Ekkachai Euasangkomsert Run Deejai Dee Dee Dee Nida Siphan Cheuanchongboon Sandy Daraneenuch Photipiti Aunt Prew Full Cast & Crew Last Season Season 1 2015 | 15 Episodes Season 1 of Secret Love Online premiered on January  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Secret Love Online. You can help by rating TV shows you've seen. Facts Original Name  Ab Ruk Online Status  Ended Network Certification  - Type  Scripted Original Language  Thai Runtime  108m Homepage  - Genres Drama Romance Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 62 Sven-Erik Andersen z 10 zurman1 4 mariilakorn21  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}