{"link": "https://www.themoviedb.org/tv/17649?language=en", "title": "Whispering Smith", "resume": "Whispering Smith is an American Western series that aired on NBC. Based on a 1948 movie, the series stars Audie Murphy as Tom \"Whispering\" Smith, a police detective in Denver, Colorado. Filming of the series began in 1959, but the program did not air until May 8, 1961, because of unexpected production problems.\nWhispering Smith combines elements of CBS's Have Gun – Will Travel starring Richard Boone, NBC's Tales of Wells Fargo starring Dale Robertson, the syndicated Shotgun Slade with Scott Brady, and ABC's The Man From Blackhawk, a Stirling Silliphant production starring Robert Rockwell. While the setting of the series is unique, it is otherwise a standard detective program.", "rate": 0, "genre": ["Western"], "cast": ["Guy Mitchell", "Audie Murphy", "Robert Redford"], "character": ["George Romack", "Tom 'Whispering' Smith", "Johnny Gates"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17649   Expand Whispering Smith   (1961) User Score Overview Whispering Smith is an American Western series that aired on NBC. Based on a 1948 movie, the series stars Audie Murphy as Tom \"Whispering\" Smith, a police detective in Denver, Colorado. Filming of the series began in 1959, but the program did not air until May 8, 1961, because of unexpected production problems. Whispering Smith combines elements of CBS's Have Gun – Will Travel starring Richard Boone, NBC's Tales of Wells Fargo starring Dale Robertson, the syndicated Shotgun Slade with Scott Brady, and ABC's The Man From Blackhawk, a Stirling Silliphant production starring Robert Rockwell. While the setting of the series is unique, it is otherwise a standard detective program. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guy Mitchell George Romack Audie Murphy Tom 'Whispering' Smith Robert Redford Johnny Gates Full Cast & Crew Last Season Season 1 1961 | 26 Episodes Season 1 of Whispering Smith premiered on May  8, 1961. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Whispering Smith. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Keywords railroad detective 19th century Content Score 56 We're so close, yet so far. Top Contributors P 11 PC 10 Banana TB 2 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}