{"link": "https://www.themoviedb.org/tv/65566?language=en", "title": "Intersection", "resume": "Naz who is a paediatrician loses her baby during pregnancy. Even though her husband wants another baby, she refuses to go through the same thing all over again. She goes to Italy for a conference and meets Ali Nejat there.", "rate": 51, "genre": ["Drama"], "cast": ["Ege Aydan", "Rojda Demirer", "Ferit Aktuğ", "Ali Tutal", "Ibrahim Celikkol"], "character": ["Ayhan", "Neslihan", "Genco", "Hasan", "Ali Nejat Karasu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65566   Expand Intersection   (2016) User Score  Play Trailer Overview Naz who is a paediatrician loses her baby during pregnancy. Even though her husband wants another baby, she refuses to go through the same thing all over again. She goes to Italy for a conference and meets Ali Nejat there. Featured Crew Ömer Faruk Sorak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ege Aydan Ayhan Rojda Demirer Neslihan Ferit Aktuğ Genco Ali Tutal Hasan Ibrahim Celikkol Ali Nejat Karasu Full Cast & Crew Last Season Season 2 2016 | 2 Episodes Season 2 of Intersection premiered on September 22, 2016. View All Seasons Social Reviews  1 Discussions  0 p A review by pua588  9.0 Written by  pua588  on June 15, 2017 I love Intersection,the story line and more especially the actors. Iʻm glad subtitles are available.  Iʻm so happy I stopped and took a look see, now Iʻm hooked.  I look forward to the next episode and hopefully another season.  Excellent writing. Read All Reviews Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   1963-04-01 General Hospital 4.7    2005-08-29 Prison Break 7.5    2017-03-31 13 Reasons Why 7.2    2009-09-23 Modern Family 7.3    2013-09-24 Marvel's Agents of S.H.I.E.L.D. 6.7    2005-03-26 Doctor Who 7.0    2014-10-07 The Flash 6.7    2005-09-13 Supernatural 7.2  Facts Original Name  Kördüğüm Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage   http://www.fox.com.tr/Kordugum/ Genres Drama Keywords italy opposites attract failed marriage Content Score 100 Yes! Looking good! Top Contributors b 48 bluwy A 20 Alenp 9 Banana 8 turksauron  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}