{"link": "https://www.themoviedb.org/tv/43120?language=en", "title": "Trust Us with Your Life", "resume": "Trust Us with Your Life is an American improvisational comedy television series, based on the BBC Two program Fast and Loose. It premiered on ABC on July 10, 2012. It is hosted by Fred Willard and stars comedians Wayne Brady, Colin Mochrie, and Jonathan Mangum, with rotating performers that include Greg Proops, Craig Cackowski, Brad Sherwood, Nicole Parker, and Josie Lawrence. Each week they act out scenes in the lives of guest celebrities. Serena Williams, Ricky Gervais, Jerry Springer, Florence Henderson, Mark Cuban, Jack and Kelly Osbourne, David Hasselhoff and Jane Seymour have so far appeared. At least eight episodes have been filmed thus far in London, England.\nThe show is currently on hiatus due to ratings competition with larger events, such as the 2012 Olympic Games. Previously, reports claimed that the show was not cancelled. However, 12 months on, no further episodes had been aired.", "rate": 0, "genre": ["Comedy"], "cast": ["Wayne Brady", "Colin Mochrie", "Jonathan Mangum", "David Armand", "Brad Sherwood"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43120   Expand Trust Us with Your Life   (2012) User Score Overview Trust Us with Your Life is an American improvisational comedy television series, based on the BBC Two program Fast and Loose. It premiered on ABC on July 10, 2012. It is hosted by Fred Willard and stars comedians Wayne Brady, Colin Mochrie, and Jonathan Mangum, with rotating performers that include Greg Proops, Craig Cackowski, Brad Sherwood, Nicole Parker, and Josie Lawrence. Each week they act out scenes in the lives of guest celebrities. Serena Williams, Ricky Gervais, Jerry Springer, Florence Henderson, Mark Cuban, Jack and Kelly Osbourne, David Hasselhoff and Jane Seymour have so far appeared. At least eight episodes have been filmed thus far in London, England. The show is currently on hiatus due to ratings competition with larger events, such as the 2012 Olympic Games. Previously, reports claimed that the show was not cancelled. However, 12 months on, no further episodes had been aired. Featured Crew Dan Patterson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wayne Brady Himself Colin Mochrie Himself Jonathan Mangum Himself David Armand Himself Brad Sherwood Himself Full Cast & Crew Last Season Season 1 2012 | 8 Episodes Season 1 of Trust Us with Your Life premiered on July 10, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Trust Us with Your Life. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  22m, 21m Homepage  - Genres Comedy Keywords improv comedy Content Score 93 Almost there... Top Contributors 16 Daniel Swan 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}