{"link": "https://www.themoviedb.org/tv/65494?language=en", "title": "The Crown", "resume": "The gripping, decades-spanning inside story of Her Majesty Queen Elizabeth II and the Prime Ministers who shaped Britain's post-war destiny. \nThe Crown tells the inside story of two of the most famous addresses in the world – Buckingham Palace and 10 Downing Street – and the intrigues, love lives and machinations behind the great events that shaped the second half of the 20th century. Two houses, two courts, one Crown.", "rate": 80, "genre": ["Drama"], "cast": ["Claire Foy", "Matt Smith", "Vanessa Kirby", "Victoria Hamilton", "John Lithgow"], "character": ["Queen Elizabeth II", "Philip Mountbatten, Duke of Edinburgh", "Princess Margaret", "Queen Elizabeth the Queen Mother", "Sir Winston Churchill"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65494   Expand The Crown   (2016) User Score  Play Trailer Overview The gripping, decades-spanning inside story of Her Majesty Queen Elizabeth II and the Prime Ministers who shaped Britain's post-war destiny.  The Crown tells the inside story of two of the most famous addresses in the world – Buckingham Palace and 10 Downing Street – and the intrigues, love lives and machinations behind the great events that shaped the second half of the 20th century. Two houses, two courts, one Crown. Featured Crew Peter Morgan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  0 Images Backdrops  19 Posters  10 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  2 Opening Credits  0 Top Billed Cast Claire Foy Queen Elizabeth II Matt Smith Philip Mountbatten, Duke of Edinburgh Vanessa Kirby Princess Margaret Victoria Hamilton Queen Elizabeth the Queen Mother John Lithgow Sir Winston Churchill Full Cast & Crew Current Season Season 2 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply A Why did they gloss over Elizabeth's children Open 4 by  Renovatio A Phillip telling Elizabeth to \"get on her knees\" behind closed doors Open 6 by  lmao7 TRIVIA Open 1 by  merryapril Go to Discussions Media Most Popular Videos  5 Backdrops  19 Posters  10 Recommendations   2016-08-28 Victoria 6.5    2010-09-26 Downton Abbey 8.0    2015-11-06 Master of None 8.0    2015-03-08 Poldark 7.9    2017-09-25 Alias Grace 7.5    2017-04-21 Hot Girls Wanted: Turned On 7.6    2015-08-28 Narcos 8.0    2017-07-21 Ozark 8.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  52m Homepage   https://www.netflix.com/title/80025678 Genres Drama Keywords england buckingham palace royal family history royalty british politics palace intrigue british royal family Content Score 100 Yes! Looking good! Top Contributors 119 purplelammashta 91 Elizabeth Jennings p 15 plumpro L 11 Lurin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}