{"link": "https://www.themoviedb.org/tv/61727?language=en", "title": "You Taught Me All the Precious Things", "resume": "Shuji is a young teacher whose confidence and honesty has made him popular with the students. He is engaged to Natsumi, also a teacher at the same high school. At the morning of the new semester, Shuji wakes up with a hangover and no memory of the night before, and a strange young woman in his bed. He feels terrible about possibility of having cheated on his fiancée, but when it turns out the girl is a student in his class Shuji is wrecked with guilt. Things go from bad to worse when the girl, Hikari, makes it clear that she's in love with him and wants to break him and Natsumi apart. Shuji's honest nature makes him want to come clean to everyone about what has happened, but before he has the chance, the secret is out. As his life starts crumbling around him, Shuji still decides to try and save Hikari from herself.", "rate": 0, "genre": ["Drama"], "cast": ["Haruma Miura", "Erika Toda", "Emi Takei", "Hirofumi Arai", "Yasuhiro Arai"], "character": ["Kashiwagi Shuji", "Uemura Natsumi", "Saeki Hikari", "Kashiwagi Koichi", "Uemura Katsumi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61727   Expand You Taught Me All the Precious Things   (2011) User Score Overview Shuji is a young teacher whose confidence and honesty has made him popular with the students. He is engaged to Natsumi, also a teacher at the same high school. At the morning of the new semester, Shuji wakes up with a hangover and no memory of the night before, and a strange young woman in his bed. He feels terrible about possibility of having cheated on his fiancée, but when it turns out the girl is a student in his class Shuji is wrecked with guilt. Things go from bad to worse when the girl, Hikari, makes it clear that she's in love with him and wants to break him and Natsumi apart. Shuji's honest nature makes him want to come clean to everyone about what has happened, but before he has the chance, the secret is out. As his life starts crumbling around him, Shuji still decides to try and save Hikari from herself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruma Miura Kashiwagi Shuji Erika Toda Uemura Natsumi Emi Takei Saeki Hikari Hirofumi Arai Kashiwagi Koichi Yasuhiro Arai Uemura Katsumi Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of You Taught Me All the Precious Things premiered on January 17, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on You Taught Me All the Precious Things. You can help by rating TV shows you've seen. Facts Original Name  大切なことはすべて君が教えてくれた Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage  - Genres Drama Keywords japanese Content Score 71 Just a little bit more... Top Contributors M 28 Maria180493 4 Elizabeth Jennings CM 4 Cherche Moi NS 3 Norte Serra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}