{"link": "https://www.themoviedb.org/tv/4100?language=en", "title": "Outlaws", "resume": "Outlaws is a short-lived action-adventure American television series which aired Saturday nights on CBS. Five cowboys are sent forward through time from 1886 to 1986, and fight crime. The original series began as a 2-hour pilot movie, and was followed by eleven one-hour episodes.", "rate": 75, "genre": ["Western", "Sci-Fi", "Fantasy"], "cast": ["William Lucking", "Charles Napier", "Richard Roundtree", "Rod Taylor", "Patrick Houser"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4100   Expand Outlaws   (1986) User Score Overview Outlaws is a short-lived action-adventure American television series which aired Saturday nights on CBS. Five cowboys are sent forward through time from 1886 to 1986, and fight crime. The original series began as a 2-hour pilot movie, and was followed by eleven one-hour episodes. Featured Crew Nicholas Corea Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Lucking Charles Napier Richard Roundtree Rod Taylor Patrick Houser Full Cast & Crew Last Season Season 1 1986 | 12 Episodes Season 1 of Outlaws premiered on December 28, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Outlaws. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Sci-Fi & Fantasy Keywords time travel private investigator fish out of water Content Score 79 Pump it up! We're close now. Top Contributors 9 Banana 6 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}