{"link": "https://www.themoviedb.org/tv/67028?language=en", "title": "Camilla Läckberg's The Fjällbacka Murders", "resume": "Erica Falck, a successful crime writer and mother of three, moved with her husband and children from the city to her hometown of Fjällbacka, a fishing village on a picturesque island off the coast of Sweden. Her return seems idyllic, but simmering beneath the village's surface lie hidden secrets, twisted desires and deceit waiting to erupt into the ultimate sin - murder.", "rate": 60, "genre": ["Drama", "Crime"], "cast": ["Claudia Galli", "Richard Ulfsäter"], "character": ["Erica Falck", "Patrik Hedström"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67028   Expand Camilla Läckberg's The Fjällbacka Murders   (2012) User Score Overview Erica Falck, a successful crime writer and mother of three, moved with her husband and children from the city to her hometown of Fjällbacka, a fishing village on a picturesque island off the coast of Sweden. Her return seems idyllic, but simmering beneath the village's surface lie hidden secrets, twisted desires and deceit waiting to erupt into the ultimate sin - murder. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Claudia Galli Erica Falck Richard Ulfsäter Patrik Hedström Full Cast & Crew Last Season Season 1 2012 | 5 Episodes Season 1 of Camilla Läckberg's The Fjällbacka Murders premiered on December 26, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Camilla Läckberg's The Fjällbacka Murders. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Camilla Läckberg's The Fjällbacka Murders. You can help by rating TV shows you've seen. Facts Original Name  Camilla Läckbergs Fjällbackamorden Status  Ended Networks Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  Swedish Runtime  90m Homepage   http://www.svt.se/fjallbackamorden/camilla-lackbergs-fjallbackamorden/ Genres Drama Crime Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 55 Marr 🇳🇱 3 Banana TB 2 TMDb Bot 2 originale  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}