{"link": "https://www.themoviedb.org/tv/43901?language=en", "title": "Longmire", "resume": "A Wyoming sheriff rebuilds his life and career following the death of his wife. Based on the “Walt Longmire” series of mystery novels written by best-selling author Craig Johnson.", "rate": 78, "genre": ["Crime", "Drama", "Western"], "cast": ["Robert Taylor", "Lou Diamond Phillips", "Katee Sackhoff", "Cassidy Freeman", "Adam Bartley"], "character": ["Sheriff Walt Longmire", "Henry Standing Bear", "Victoria 'Vic' Moretti", "Cady Longmire", "Ferg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43901   Expand Longmire   (2012) User Score  Play Trailer Overview A Wyoming sheriff rebuilds his life and career following the death of his wife. Based on the “Walt Longmire” series of mystery novels written by best-selling author Craig Johnson. Featured Crew John Coveny Creator Hunt Baldwin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  3 Images Backdrops  7 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Taylor Sheriff Walt Longmire Lou Diamond Phillips Henry Standing Bear Katee Sackhoff Victoria 'Vic' Moretti Cassidy Freeman Cady Longmire Adam Bartley Ferg Full Cast & Crew Current Season Season 6 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  12 Subject Status Replies Last Reply A Very Satisfying Bad Guy Death ****SPOILER WARNING***** Open 0 by Jetfire59\n      \n     Who Sent The Toy Barn? Open 6 by  WatchNext b Longmire Open 4 by  write2topcat Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  6 Recommendations   2010-03-16 Justified 7.9    2011-11-06 Hell on Wheels 7.2    2012-10-11 Copper 6.0    2014-02-06 Bosch 7.9    2013-04-19 Hemlock Grove 6.4    2013-07-10 The Bridge 6.3    2014-02-27 The Red Road 6.0    2015-03-05 Dig 6.4  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   https://www.netflix.com/title/70269479 Genres Crime Drama Western Keywords small town wyoming crime small town sheriff Content Score 100 Yes! Looking good! Top Contributors 25 Elizabeth Jennings 19 Banana w 11 waryrwmn M 10 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}