{"link": "https://www.themoviedb.org/tv/31977?language=en", "title": "Dan for Mayor", "resume": "Dan Phillips is a 30-something bartender who lives and works in the ordinary city of Wessex. Dan's had the same friends since grade school, his most prized possession is a vintage Ms. Pac-Man game and his last serious relationship was with a girl who is now engaged to someone else. His life seems to be firmly on the path to more of the same... until a chance comment suddenly puts him in the running for mayor of Wessex.", "rate": 40, "genre": ["Comedy"], "cast": ["Fred Ewanuick", "Mary Ashton", "Paul Bates", "Benjamin Ayres", "Laurie Murdoch"], "character": ["Dan Phillips", "Claire Kendall", "Jeff", "Mike", "Alan Duffy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31977   Expand Dan for Mayor   (2010) User Score Overview Dan Phillips is a 30-something bartender who lives and works in the ordinary city of Wessex. Dan's had the same friends since grade school, his most prized possession is a vintage Ms. Pac-Man game and his last serious relationship was with a girl who is now engaged to someone else. His life seems to be firmly on the path to more of the same... until a chance comment suddenly puts him in the running for mayor of Wessex. Featured Crew Mark Farrell Creator Paul Mather Creator Kevin White Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Ewanuick Dan Phillips Mary Ashton Claire Kendall Paul Bates Jeff Benjamin Ayres Mike Laurie Murdoch Alan Duffy Full Cast & Crew Last Season Season 2 2011 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dan for Mayor. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification PG Meaning Parental guidance. Moderate violence and moderate profanity is allowed, as is brief nudity and sexual references if important to the context of the story. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.danformayor.ca Genres Comedy Keywords politics slacker mayoral candidate fictional town Content Score 93 Almost there... Top Contributors 61 United600 RT 2 Rob T 1 Banana T 1 Torq00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}