{"link": "https://www.themoviedb.org/tv/34100?language=en", "title": "Akai Kodan Zillion", "resume": "Zillion, full title Akai Kōdan Zillion, is a Japanese anime television series that ran from April 12, 1987 to December 13, 1987 on Nippon Television in Japan and was produced by Tatsunoko Production and Sega. After the production of the anime, Tatsunoko Production and Mitsuhisa Ishikawa, the producer of Zillion, established Production I.G to obstruct the dispersing of the excellent staffs of Tatsunoko branch which had done actual production. Therefore, Zillion is considered to be Production I.G’s first work. Five of the 31 episodes were dubbed into English and released on VHS in the United States by Streamline Pictures. This anime was featured in the music video for Michael and Janet Jackson’s collaboration Scream.", "rate": 80, "genre": ["Animation", "Action", "Adventure"], "cast": ["Chieko Honda", "Kazuhiko Inoue", "Yuko Mizutani", "Daiki Nakamura", "Osamu Kobayashi"], "character": ["Amy", "Champ", "Apple", "Dave", "Chief"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34100   Expand Akai Kodan Zillion   (1987) User Score Overview Zillion, full title Akai Kōdan Zillion, is a Japanese anime television series that ran from April 12, 1987 to December 13, 1987 on Nippon Television in Japan and was produced by Tatsunoko Production and Sega. After the production of the anime, Tatsunoko Production and Mitsuhisa Ishikawa, the producer of Zillion, established Production I.G to obstruct the dispersing of the excellent staffs of Tatsunoko branch which had done actual production. Therefore, Zillion is considered to be Production I.G’s first work. Five of the 31 episodes were dubbed into English and released on VHS in the United States by Streamline Pictures. This anime was featured in the music video for Michael and Janet Jackson’s collaboration Scream. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chieko Honda Amy Kazuhiko Inoue Champ Yuko Mizutani Apple Daiki Nakamura Dave Osamu Kobayashi Chief Full Cast & Crew Last Season Season 1 1987 | 31 Episodes Season 1 of Akai Kodan Zillion premiered on April 12, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Akai Kodan Zillion. You can help by rating TV shows you've seen. Facts Original Name  赤い光弾ジリオン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 13 Renato 11 TheDerpMan p 3 perikoman A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}