{"link": "https://www.themoviedb.org/tv/37103?language=en", "title": "The Top 100: NFL's Greatest Players", "resume": "The Top 100: NFL's Greatest Players was a ten-part television series presented by the NFL Network in 2010. The series was based on a list of the top 100 National Football League players of all time, as compiled by a \"blue-ribbon\" panel assembled by the NFL Network. The members of the panel were current and former NFL coaches, players, executives, and members of the media. Each episode, broadcast each Thursday from September 3 to November 4, 2010, introduced a group of 10 players from the list, starting with the players ranked 100 through 91, and moving up the list each week.\nThe final episode, premiering on November 4, 2010, introduced the top 10 players of all time according to the panel. Jerry Rice was chosen as the top player of all time, with Jim Brown as the second choice. The highest ranked defensive player was Lawrence Taylor, he was voted number three.", "rate": 50, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37103   Expand The Top 100: NFL's Greatest Players   (2010) User Score Overview The Top 100: NFL's Greatest Players was a ten-part television series presented by the NFL Network in 2010. The series was based on a list of the top 100 National Football League players of all time, as compiled by a \"blue-ribbon\" panel assembled by the NFL Network. The members of the panel were current and former NFL coaches, players, executives, and members of the media. Each episode, broadcast each Thursday from September 3 to November 4, 2010, introduced a group of 10 players from the list, starting with the players ranked 100 through 91, and moving up the list each week. The final episode, premiering on November 4, 2010, introduced the top 10 players of all time according to the panel. Jerry Rice was chosen as the top player of all time, with Jim Brown as the second choice. The highest ranked defensive player was Lawrence Taylor, he was voted number three. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2012 2012 | 11 Episodes Season 2012 of The Top 100: NFL's Greatest Players premiered on April 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Top 100: NFL's Greatest Players. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}