{"link": "https://www.themoviedb.org/tv/72915?language=en", "title": "Wednesday 3:30 PM", "resume": "This drama tells the story of a woman who was dumped by her boyfriend and tries win to win back his heart by making him jealous. With her close male friend, she manipulates her social media to create a fake “lovestagram” (love + Instagram). The two characters are childhood friends, and a sweet romance will unfold as they begin to live together.", "rate": 0, "genre": ["Comedy"], "cast": ["Hongbin", "Jin Ki-joo", "Ahn Bo-hyun", "Jung Chang-Hyun"], "character": ["Yoon Jae Won", "Sun Eun Woo", "Baek Seung Kyu", "Gong Na Yun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72915   Expand Wednesday 3:30 PM   (2017) User Score Overview This drama tells the story of a woman who was dumped by her boyfriend and tries win to win back his heart by making him jealous. With her close male friend, she manipulates her social media to create a fake “lovestagram” (love + Instagram). The two characters are childhood friends, and a sweet romance will unfold as they begin to live together. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hongbin Yoon Jae Won Jin Ki-joo Sun Eun Woo Ahn Bo-hyun Baek Seung Kyu Jung Chang-Hyun Gong Na Yun Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Wednesday 3:30 PM premiered on June  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Wednesday 3:30 PM. You can help by rating TV shows you've seen. Facts Original Name  수요일 오후 3시 30분 Status  Ended Network SBS Plus Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres Comedy Keywords romance Content Score 86 Almost there... Top Contributors 16 Elizabeth Jennings a 13 afofrancis 3 galactica_j 2 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}