{"link": "https://www.themoviedb.org/tv/68079?language=en", "title": "Magical Girl Raising Project", "resume": "A social game called The Magical Girl Raising Project allows one in tens of thousands of people to be a \"magical girl\" — possessing extraordinary physical capabilities and looks, as well as special magical powers that set them apart from the rest of the human race. But one day, in a district containing 16 magical girls, the administration announces that it must halve the number of magical girls to solve the problem of magical energy. At first, the 16 magical girls race to collect more \"magical candy\" than their competitors, but the rules quickly become twisted, and it quickly becomes a murderous battle for survival among them.", "rate": 85, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68079   Expand Magical Girl Raising Project   (2016) User Score Overview A social game called The Magical Girl Raising Project allows one in tens of thousands of people to be a \"magical girl\" — possessing extraordinary physical capabilities and looks, as well as special magical powers that set them apart from the rest of the human race. But one day, in a district containing 16 magical girls, the administration announces that it must halve the number of magical girls to solve the problem of magical energy. At first, the 16 magical girls race to collect more \"magical candy\" than their competitors, but the rules quickly become twisted, and it quickly becomes a murderous battle for survival among them. Featured Crew Hiroyuki Hashimoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Magical Girl Raising Project premiered on October  1, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Magical Girl Raising Project. You can help by rating TV shows you've seen. Facts Original Name  魔法少女育成計画 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 10 karaa 5 ioneakatzuki 5 Jenazad 3 dgw  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}