{"link": "https://www.themoviedb.org/tv/45087?language=en", "title": "Manga Sarutobi Sasuke", "resume": "Manga Sarutobi Sasuke is a 24-episode anime series about the young Sarutobi Sasuke, a legendary ninja. It was first aired from October 9, 1979, to April 29, 1980 on Tokyo 12 Channel, and was later dubbed in several languages. The whole 24-episode run was aired in many European and Arabic countries.\nIt is best known to the American fans as Ninja, The Wonder Boy: a highly edited, highly condensed feature-length version of this series. This version, dubbed in English, was produced by Jim Terry Productions of Force Five fame. The names of several characters were changed, with Sarutobi Sasuke becoming \"Duke Hayakawa\", his female companion Sakura being changed to \"Blossom\", and the villain Devilman became \"Dragon.\"", "rate": 0, "genre": ["Animation"], "cast": ["Yōko Matsuoka", "Toku Nishio", "Kōichi Hashimoto", "Kimiko Nozaki", "Run Sasaki"], "character": ["Sarutobi Sasuke", "Kiyomi priest Miyoshi", "Saizo Kirigakure", "Sakura", "Yukino Princess"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45087   Expand Manga Sarutobi Sasuke   (1979) User Score Overview Manga Sarutobi Sasuke is a 24-episode anime series about the young Sarutobi Sasuke, a legendary ninja. It was first aired from October 9, 1979, to April 29, 1980 on Tokyo 12 Channel, and was later dubbed in several languages. The whole 24-episode run was aired in many European and Arabic countries. It is best known to the American fans as Ninja, The Wonder Boy: a highly edited, highly condensed feature-length version of this series. This version, dubbed in English, was produced by Jim Terry Productions of Force Five fame. The names of several characters were changed, with Sarutobi Sasuke becoming \"Duke Hayakawa\", his female companion Sakura being changed to \"Blossom\", and the villain Devilman became \"Dragon.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yōko Matsuoka Sarutobi Sasuke Toku Nishio Kiyomi priest Miyoshi Kōichi Hashimoto Saizo Kirigakure Kimiko Nozaki Sakura Run Sasaki Yukino Princess Full Cast & Crew Last Season Season 1 1979 | 24 Episodes Season 1 of Manga Sarutobi Sasuke premiered on October  9, 1979. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Manga Sarutobi Sasuke. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Manga Sarutobi Sasuke. You can help by rating TV shows you've seen. Facts Original Name  まんが猿飛佐助 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 7 BlackDelivery 5 Banana r 3 romangt  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}