{"link": "https://www.themoviedb.org/tv/1647?language=en", "title": "Go, Diego, Go!", "resume": "Go, Diego, Go! is a children's television series created by Chris Gifferd and Valerie Walsh, and is a spin-off of Dora the Explorer. The show premiered on September 6, 2005 and ended on September 16, 2011 on Nickelodeon. It also aired as part of the Nick Jr. on CBS block from September 17, 2005 to September 9, 2006. On December 20, 2006, Nick Jr. announced that it had ordered twenty new episodes that were in production. Since April 2008, the show has been dubbed into Spanish and airs in the United States on Univision as part of their Planeta U block.", "rate": 49, "genre": ["Animation"], "cast": ["Jake T. Austin", "Rosie Perez"], "character": ["Diego", "Click"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1647   Expand Go, Diego, Go!   (2005) User Score Overview Go, Diego, Go! is a children's television series created by Chris Gifferd and Valerie Walsh, and is a spin-off of Dora the Explorer. The show premiered on September 6, 2005 and ended on September 16, 2011 on Nickelodeon. It also aired as part of the Nick Jr. on CBS block from September 17, 2005 to September 9, 2006. On December 20, 2006, Nick Jr. announced that it had ordered twenty new episodes that were in production. Since April 2008, the show has been dubbed into Spanish and airs in the United States on Univision as part of their Planeta U block. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jake T. Austin Diego Rosie Perez Click Full Cast & Crew Last Season Season 5 — | 4 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2006-03-03 The Wonder Pets 6.3    1981-09-16 Postman Pat 6.0    1990-09-08 The Tom & Jerry Kids Show 6.0    2006-05-06 Mickey Mouse Clubhouse 5.8    2004-05-31 Peppa Pig 5.3    2000-08-13 Dora the Explorer 4.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 31m, 24m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 7 lineker z 5 zurman1 E 3 EightNine s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}