{"link": "https://www.themoviedb.org/tv/34696?language=en", "title": "Yozakura Quartet", "resume": "Yozakura Quartet is a Japanese manga created by Suzuhito Yasuda that began publishing by Kodansha in 2006, and was then published in the US by Del Rey in 2008. The series was animated in Japan and aired from October 2 to December 18, 2008; it comprises 12 episodes, all of which have aired. The anime was produced by Nomad and aired on TBS on Thursdays. Three anime OVAs were released alongside volmunes 9-11 of the manga, between October 10, 2010 to November 9, 2011. A new anime adaptation of the series was announced in April 2013, with the cast returning from the first anime and OVAs, but it will be produced at Tatsunoko Production to be aired in Fall 2013.\nYozakura Quartet is Suzuhito Yasuda's first manga. Before the creation of Yozakura Quartet, he was an illustrator. He drew the original character designs for Yoshikazu Kuwashima's series Kamisama Kazoku and Ryohgo Narita's Durarara!!.", "rate": 50, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34696   Expand Yozakura Quartet   (2008) User Score Overview Yozakura Quartet is a Japanese manga created by Suzuhito Yasuda that began publishing by Kodansha in 2006, and was then published in the US by Del Rey in 2008. The series was animated in Japan and aired from October 2 to December 18, 2008; it comprises 12 episodes, all of which have aired. The anime was produced by Nomad and aired on TBS on Thursdays. Three anime OVAs were released alongside volmunes 9-11 of the manga, between October 10, 2010 to November 9, 2011. A new anime adaptation of the series was announced in April 2013, with the cast returning from the first anime and OVAs, but it will be produced at Tatsunoko Production to be aired in Fall 2013. Yozakura Quartet is Suzuhito Yasuda's first manga. Before the creation of Yozakura Quartet, he was an illustrator. He drew the original character designs for Yoshikazu Kuwashima's series Kamisama Kazoku and Ryohgo Narita's Durarara!!. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2013 | 13 Episodes Season 2 of Yozakura Quartet premiered on October  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Yozakura Quartet. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://yozakura-anime.jp/ Genres Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 8 seboseboss U 5 Uilio n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}