{"link": "https://www.themoviedb.org/tv/4748?language=en", "title": "Les Invincibles", "resume": "Les Invincibles is a comedy/drama television series from Radio-Canada produced by Casablanca Productions and Alliance Atlantis Vivafilm.\nThe story is about four twenty-something men signing a pact ordaining the simultaneous break-up of their current relationships, and the subsequent adoption of a common responsibility-free life.\nIn 2006, the show won an \"Olivier\" for best drama series.\nThe third and last season ended on March 25, 2009.\nA remake of the series was made in France. Filming began in Strasbourg in August 2008 and the show was broadcast on the Franco-German Arte network in Fall 2009.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Patrice Robitaille", "François Létourneau", "Pierre-François Legendre", "Rémi-Pierre Paquin"], "character": ["Steve Chouinard", "Pierre-Antoine 'P.A.' Robitaille", "Carlos Fréchette", "Rémi Durocher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4748   Expand Les Invincibles   (2005) User Score Overview Les Invincibles is a comedy/drama television series from Radio-Canada produced by Casablanca Productions and Alliance Atlantis Vivafilm. The story is about four twenty-something men signing a pact ordaining the simultaneous break-up of their current relationships, and the subsequent adoption of a common responsibility-free life. In 2006, the show won an \"Olivier\" for best drama series. The third and last season ended on March 25, 2009. A remake of the series was made in France. Filming began in Strasbourg in August 2008 and the show was broadcast on the Franco-German Arte network in Fall 2009. Featured Crew François Létourneau Creator Jean-François Rivard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrice Robitaille Steve Chouinard François Létourneau Pierre-Antoine 'P.A.' Robitaille Pierre-François Legendre Carlos Fréchette Rémi-Pierre Paquin Rémi Durocher Full Cast & Crew Last Season Season 3 2009 | 11 Episodes Season 3 of Les Invincibles premiered on January 14, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Les Invincibles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  43m Homepage   http://www.radio-canada.ca/television/les_invincibles/ Genres Comedy Drama Keywords male friendship quebec montreal thirty something Content Score 93 Almost there... Top Contributors 28 Banana c 4 cdrini y 4 yadzik r 3 rogx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}