{"link": "https://www.themoviedb.org/tv/1641?language=en", "title": "The 5 Mrs. Buchanans", "resume": "The 5 Mrs. Buchanans is a U.S. television situation comedy that aired on CBS from September 24, 1994 to March 25, 1995. Set in the fictional town of Mercy, Indiana, the show centers on the small-town misadventures of four disparate women with one thing in common: their loathing for their monster of a mother-in-law.", "rate": 0, "genre": ["Comedy"], "cast": ["Charlotte Ross", "Judith Ivey", "Eileen Heckart", "Harriet Sansom Harris", "Beth Broderick"], "character": ["Bree Buchanan", "Alexandria 'Alex' Buchanan", "Mother Emma Buchanan", "Vivian Buchanan", "Delilah Buchanan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1641   Expand The 5 Mrs. Buchanans   (1994) User Score Overview The 5 Mrs. Buchanans is a U.S. television situation comedy that aired on CBS from September 24, 1994 to March 25, 1995. Set in the fictional town of Mercy, Indiana, the show centers on the small-town misadventures of four disparate women with one thing in common: their loathing for their monster of a mother-in-law. Featured Crew Marc Cherry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlotte Ross Bree Buchanan Judith Ivey Alexandria 'Alex' Buchanan Eileen Heckart Mother Emma Buchanan Harriet Sansom Harris Vivian Buchanan Beth Broderick Delilah Buchanan Full Cast & Crew Last Season Season 1 1994 | 18 Episodes Season 1 of The 5 Mrs. Buchanans premiered on September 24, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The 5 Mrs. Buchanans. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords small town in-laws sitcom Content Score 79 Pump it up! We're close now. Top Contributors 13 Banana 1 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}