{"link": "https://www.themoviedb.org/tv/3784?language=en", "title": "Press Your Luck", "resume": "Press Your Luck is an American television daytime game show created by Bill Carruthers and Jan McCormack. It premiered on September 19, 1983, on CBS and ended on September 26, 1986. In the show, contestants collected spins by answering trivia questions and then used the spins on an 18-space game board to win cash and prizes. The person who amassed the most in cash and prizes at the end of the game won. Peter Tomarken was the show's host, and Rod Roddy was the primary announcer. John Harlan and Charlie O'Donnell filled in as substitute announcers for Roddy on different occasions. Press Your Luck was videotaped before a studio audience at CBS Television City, in Studios 33 and 43 in Hollywood, California. The show was a revival of Second Chance, which was hosted by Jim Peck and aired on ABC from March 7–July 15, 1977.\nThe show was known for the \"Whammy\" –a red cartoon creature wearing a cape. Landing on any of the Whammy's spaces on the game board took away the contestant's money, accompanied by an animation that would show the Whammy taking the loot, but frequently being chased away, blown up, or otherwise humiliated in the process. The Whammies were created and animated by Savage Steve Holland and Bill Kopp, and voiced by Carruthers. Approximately 50 different animations were used.", "rate": 90, "genre": [], "cast": ["Rod Roddy", "Charlie O'Donnell", "Peter Tomarken", "Savage Steve Holland"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3784   Expand Press Your Luck   (1983) User Score Overview Press Your Luck is an American television daytime game show created by Bill Carruthers and Jan McCormack. It premiered on September 19, 1983, on CBS and ended on September 26, 1986. In the show, contestants collected spins by answering trivia questions and then used the spins on an 18-space game board to win cash and prizes. The person who amassed the most in cash and prizes at the end of the game won. Peter Tomarken was the show's host, and Rod Roddy was the primary announcer. John Harlan and Charlie O'Donnell filled in as substitute announcers for Roddy on different occasions. Press Your Luck was videotaped before a studio audience at CBS Television City, in Studios 33 and 43 in Hollywood, California. The show was a revival of Second Chance, which was hosted by Jim Peck and aired on ABC from March 7–July 15, 1977. The show was known for the \"Whammy\" –a red cartoon creature wearing a cape. Landing on any of the Whammy's spaces on the game board took away the contestant's money, accompanied by an animation that would show the Whammy taking the loot, but frequently being chased away, blown up, or otherwise humiliated in the process. The Whammies were created and animated by Savage Steve Holland and Bill Kopp, and voiced by Carruthers. Approximately 50 different animations were used. Featured Crew Bill Carruthers Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rod Roddy Charlie O'Donnell Peter Tomarken Savage Steve Holland Full Cast & Crew Last Season Season 3 1986 | 3 Episodes Season 3 of Press Your Luck premiered on July 25, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Press Your Luck. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}