{"link": "https://www.themoviedb.org/tv/58937?language=en", "title": "Masters of Sex", "resume": "William Masters and Virginia Johnson are real-life pioneers of the science of human sexuality. Their research touched off the sexual revolution and took them from a midwestern teaching hospital to the cover of Time magazine and multiple appearances on Johnny Carson's couch. He is a brilliant scientist out of touch with his own feelings, and she is a single working mother ahead of her time. The series chronicles their unusual lives, romance, and unlikely pop culture trajectory.", "rate": 66, "genre": ["Drama"], "cast": ["Michael Sheen", "Lizzy Caplan", "Caitlin Fitzgerald", "Annaleigh Ashford"], "character": ["Dr. William Masters", "Virginia Johnson", "Libby Masters", "Betty DiMello"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58937   Expand Masters of Sex   (2013) User Score  Play Trailer Overview William Masters and Virginia Johnson are real-life pioneers of the science of human sexuality. Their research touched off the sexual revolution and took them from a midwestern teaching hospital to the cover of Time magazine and multiple appearances on Johnny Carson's couch. He is a brilliant scientist out of touch with his own feelings, and she is a single working mother ahead of her time. The series chronicles their unusual lives, romance, and unlikely pop culture trajectory. Featured Crew Michelle Ashford Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Sheen Dr. William Masters Lizzy Caplan Virginia Johnson Caitlin Fitzgerald Libby Masters Annaleigh Ashford Betty DiMello Full Cast & Crew Last Season Season 4 2016 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  13 Recommendations   2014-08-08 The Knick 7.5    2007-08-13 Californication 7.4    2014-05-11 Penny Dreadful 7.4    2014-06-01 Halt and Catch Fire 7.7    2014-10-12 The Affair 6.5    2013-07-10 The Bridge 6.3    2013-01-11 Banshee 7.9    2013-04-04 Hannibal 7.7  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.sho.com/masters-of-sex Genres Drama Keywords sex unfaithfulness medical research historical drama sexologist human sexuality Content Score 100 Yes! Looking good! Top Contributors 85 Elizabeth Jennings 26 Travis Bell t 23 tinybutstrong 20 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}