{"link": "https://www.themoviedb.org/tv/12072?language=en", "title": "The Secrets of Isis", "resume": "The Secrets of Isis is the syndicated title of a live action CBS television series produced by Filmation in the 1970s originally titled Isis that appeared during the Saturday morning cartoon lineup. The show was also aired in various countries around the world. As indicated on commentary in the 2007 DVD release of the series, and supported by examining broadcast premiere dates, The Secrets of Isis was the first weekly American live-action television series whose lead character was a female superhero, debuting September 6, 1975 and predating the weekly debuts of both The Bionic Woman and Wonder Woman.", "rate": 45, "genre": ["Sci-Fi", "Fantasy"], "cast": ["JoAnna Cameron", "Brian Cutler", "Ronalda Douglas", "Albert Reed, Jr."], "character": ["Andrea Thomas / Isis", "Rick Mason", "Rennie Carol", "Dr. Barnes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12072   Expand The Secrets of Isis   (1975) User Score Overview The Secrets of Isis is the syndicated title of a live action CBS television series produced by Filmation in the 1970s originally titled Isis that appeared during the Saturday morning cartoon lineup. The show was also aired in various countries around the world. As indicated on commentary in the 2007 DVD release of the series, and supported by examining broadcast premiere dates, The Secrets of Isis was the first weekly American live-action television series whose lead character was a female superhero, debuting September 6, 1975 and predating the weekly debuts of both The Bionic Woman and Wonder Woman. Featured Crew Marc Richards Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast JoAnna Cameron Andrea Thomas / Isis Brian Cutler Rick Mason Ronalda Douglas Rennie Carol Albert Reed, Jr. Dr. Barnes Full Cast & Crew Last Season Season 2 1976 | 7 Episodes Season 2 of The Secrets of Isis premiered on September 11, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Secrets of Isis. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Keywords strong woman dc comics superhero superheroine Content Score 93 Almost there... Top Contributors 19 Banana a 3 antrrax D 2 Daniel 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}