{"link": "https://www.themoviedb.org/tv/7861?language=en", "title": "Empire", "resume": "Empire is an hour-long Western television series set on a 1960s 500,000-acre ranch in New Mexico, starring Richard Egan, Terry Moore, and Ryan O'Neal. It ran on NBC from September 25, 1962, to May 14, 1963.\nIn the second abbreviated season, from September 24 to December 31, 1963, it was renamed Redigo after Egan's title character, Jim Redigo, the general manager of the fictitious Garrett ranch in Empire, and reduced to a half-hour.", "rate": 0, "genre": ["Western", "Drama"], "cast": ["Richard Egan", "Ryan O'Neal", "Anne Seymour", "Terry Moore"], "character": ["Jim Redigo", "Tal Garrett", "Lucia Garrett", "Connie Garrett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7861   Expand Empire   (1962) User Score Overview Empire is an hour-long Western television series set on a 1960s 500,000-acre ranch in New Mexico, starring Richard Egan, Terry Moore, and Ryan O'Neal. It ran on NBC from September 25, 1962, to May 14, 1963. In the second abbreviated season, from September 24 to December 31, 1963, it was renamed Redigo after Egan's title character, Jim Redigo, the general manager of the fictitious Garrett ranch in Empire, and reduced to a half-hour. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Egan Jim Redigo Ryan O'Neal Tal Garrett Anne Seymour Lucia Garrett Terry Moore Connie Garrett Full Cast & Crew Last Season Season 1 1962 | 32 Episodes Season 1 of Empire premiered on September 25, 1962. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Empire. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Drama Keywords new mexico ranch Content Score 71 Just a little bit more... Top Contributors 11 Elizabeth Jennings t 7 toeless 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}