{"link": "https://www.themoviedb.org/tv/66750?language=en", "title": "Wind Chime", "resume": "When a young woman leaves her family to go on an epic journey, what truths will she uncover? Sheng Xia is the youngest daughter of the Sheng family, which has inhabited Mount Bawan for many generations. Xia’s mother, Sheng Qing Ping, was the master of the Wind Chime, which gives mystical powers to the bearer. Qing Ping eloped with Qin Shou Cheng, only to be murdered at the hands of his family after giving birth to Xia. As the new master of the Wind Chime, the grown Xia sets off under the name of Ji Tang Tang to uncover the truth behind her mother’s murder. On her journey, Tang Tang meets the dashing Yue Feng. Can Feng help Tang Tang discover the road to her own destiny?", "rate": 0, "genre": ["Crime", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66750   Expand Wind Chime   (2016) User Score Overview When a young woman leaves her family to go on an epic journey, what truths will she uncover? Sheng Xia is the youngest daughter of the Sheng family, which has inhabited Mount Bawan for many generations. Xia’s mother, Sheng Qing Ping, was the master of the Wind Chime, which gives mystical powers to the bearer. Qing Ping eloped with Qin Shou Cheng, only to be murdered at the hands of his family after giving birth to Xia. As the new master of the Wind Chime, the grown Xia sets off under the name of Ji Tang Tang to uncover the truth behind her mother’s murder. On her journey, Tang Tang meets the dashing Yue Feng. Can Feng help Tang Tang discover the road to her own destiny? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 27 Episodes Season 1 of Wind Chime premiered on February 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wind Chime. You can help by rating TV shows you've seen. Facts Original Name  示铃录 Status  Ended Network Sohu Certification  - Type  Scripted Original Language  Chinese Runtime  40m Homepage  - Genres Crime Drama Mystery Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors W 19 WonderfulError TB 2 TMDb Bot 1 MundoAsian 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}