{"link": "https://www.themoviedb.org/tv/907?language=en", "title": "This Morning with Richard Not Judy", "resume": "This Morning With Richard Not Judy or TMWRNJ is a BBC comedy television programme, written by and starring Lee and Herring. Two series were broadcast in 1998 and 1999 on BBC2. The name was a satirical reference to ITV's This Morning which was at the time popularly referred to as This Morning with Richard and Judy.\nThe show was a reworking of old material from their previous work together along with new characters. The show was hosted in a daytime chat show format in front of a live studio audience, although it featured a small proportion of pre-recorded location inserts. It was structured by the often strange obsessions of Richard Herring; examples include his rating of the milk of all creatures and attempting to popularise the acronym of the show. The show featured repetition, with regular and vigilant viewers being rewarded by jokes that would make no sense to casual viewers. The show seemed to oscillate between the intellectual and puerile. However, irony was often used, even though the citing of irony as an excuse was mocked by the show's stars in one of many self-referential jokes.", "rate": 80, "genre": ["Comedy"], "cast": ["Stewart Lee", "Brian Cant", "Emma Kennedy", "Kevin Eldon", "Mark Gatiss"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 907   Expand This Morning with Richard Not Judy   (1998) User Score Overview This Morning With Richard Not Judy or TMWRNJ is a BBC comedy television programme, written by and starring Lee and Herring. Two series were broadcast in 1998 and 1999 on BBC2. The name was a satirical reference to ITV's This Morning which was at the time popularly referred to as This Morning with Richard and Judy. The show was a reworking of old material from their previous work together along with new characters. The show was hosted in a daytime chat show format in front of a live studio audience, although it featured a small proportion of pre-recorded location inserts. It was structured by the often strange obsessions of Richard Herring; examples include his rating of the milk of all creatures and attempting to popularise the acronym of the show. The show featured repetition, with regular and vigilant viewers being rewarded by jokes that would make no sense to casual viewers. The show seemed to oscillate between the intellectual and puerile. However, irony was often used, even though the citing of irony as an excuse was mocked by the show's stars in one of many self-referential jokes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stewart Lee Brian Cant Emma Kennedy Kevin Eldon Mark Gatiss Full Cast & Crew Last Season Season 2 1999 | 10 Episodes Season 2 of This Morning with Richard Not Judy premiered on March 21, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on This Morning with Richard Not Judy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.bbc.co.uk/comedy/thismorningwithrichardnotjudy/ Genres Comedy Keywords parody british humour chat show host Content Score 86 Almost there... Top Contributors 11 Markxist R 4 Rebecca O 4 Ozbourne N 1 Notamymerrick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}