{"link": "https://www.themoviedb.org/tv/66608?language=en", "title": "Criminologist Himura and Mystery Writer Arisugawa", "resume": "Criminologist Himura Hideo gets so much pleasure out of being in crime scenes that he's even confessed to having wanted to kill someone. Constantly seeking out the ultimate crime, he is indeed a man with quite a few issues. Mystery writer Arisugawa Arisu, on the other hand, keeps a close eye on Himura's investigations and writes about them but at times completely misses the point. Not at all the type of guy you'd call dependable, Arisugawa nonetheless professes to be the protector of the clumsy Himura. Although these two men appear like they have no business being in crime scenes, they mitigate each other's shortcomings and use their compelling logic to unravel the elaborately woven tricks left behind by the criminals. It's almost as if Himura and Arisugawa use incredible magical powers to tease out unimaginable truths!", "rate": 0, "genre": ["Drama", "Crime"], "cast": ["Takumi Saito", "Masataka Kubota", "Yuka", "Mizuki Yamamoto", "Makita Sports"], "character": ["Hideo Himura", "Arisu Arisugawa", "Nozomi Ono", "Akemi Kijima", "Masanori Asoda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66608   Expand Criminologist Himura and Mystery Writer Arisugawa   (2016) User Score Overview Criminologist Himura Hideo gets so much pleasure out of being in crime scenes that he's even confessed to having wanted to kill someone. Constantly seeking out the ultimate crime, he is indeed a man with quite a few issues. Mystery writer Arisugawa Arisu, on the other hand, keeps a close eye on Himura's investigations and writes about them but at times completely misses the point. Not at all the type of guy you'd call dependable, Arisugawa nonetheless professes to be the protector of the clumsy Himura. Although these two men appear like they have no business being in crime scenes, they mitigate each other's shortcomings and use their compelling logic to unravel the elaborately woven tricks left behind by the criminals. It's almost as if Himura and Arisugawa use incredible magical powers to tease out unimaginable truths! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takumi Saito Hideo Himura Masataka Kubota Arisu Arisugawa Yuka Nozomi Ono Mizuki Yamamoto Akemi Kijima Makita Sports Masanori Asoda Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Criminologist Himura and Mystery Writer Arisugawa premiered on January 17, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Criminologist Himura and Mystery Writer Arisugawa. You can help by rating TV shows you've seen. Facts Original Name  臨床犯罪学者 火村英生の推理 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage   http://www.ntv.co.jp/himura/ Genres Drama Crime Keywords japan Content Score 86 Almost there... Top Contributors M 33 Maria180493 g 9 gashtoby 2 kappa-papa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}