{"link": "https://www.themoviedb.org/tv/2723?language=en", "title": "Samurai Jack", "resume": "Made by Genndy Tartakovsky, this animated series tells the story of a great warrior displaced to the distant future by the evil shape-shifting wizard Aku. The world has become a bleak place under the rule of Aku, segregated into fantastic tribes and ruled by Aku's evil robot warlords. Jack travels this foreign landscape in search of a time portal that can return him to his home time so he can \"undo the future that is Aku!\".", "rate": 78, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Phil LaMarr", "Mako"], "character": ["Samurai Jack", "Aku"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2723   Expand Samurai Jack   (2001) User Score Overview Made by Genndy Tartakovsky, this animated series tells the story of a great warrior displaced to the distant future by the evil shape-shifting wizard Aku. The world has become a bleak place under the rule of Aku, segregated into fantastic tribes and ruled by Aku's evil robot warlords. Jack travels this foreign landscape in search of a time portal that can return him to his home time so he can \"undo the future that is Aku!\". Featured Crew Genndy Tartakovsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil LaMarr Samurai Jack Mako Aku Full Cast & Crew Last Season Season 5 2017 | 10 Episodes Season 5 of Samurai Jack premiered on March 11, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Seen the new episodes - COOL BEANS! Open 1 by  Taylorfirst1 New episode after 10 years Open 17 by  lockon stratos Did it air on April 1st? Open 1 by  ahrabows Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   1999-01-04 Ed, Edd n Eddy 7.0    1999-01-10 Batman Beyond 7.8    1999-11-12 Courage the Cowardly Dog 7.6    2001-08-24 The Grim Adventures of Billy and Mandy 7.3    2003-07-19 Teen Titans 7.6    1997-07-07 Johnny Bravo 6.6    1997-09-16 Cow and Chicken 6.4    1994-09-10 The Tick 7.7  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.adultswim.com/videos/samurai-jack/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords revenge wanderer code of the samurai Content Score 64 We're so close, yet so far. Top Contributors PE 9 Patrick E. Abe 8 kuzronk D 7 Devil-666 s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}