{"link": "https://www.themoviedb.org/tv/61081?language=en", "title": "End of the String", "resume": "Tithit (Toomtam Yuthana Puengklarng) meets Gandaomanee Girinisuan (View Wannarot Sontichai) in Phrajoit and falls in love with her. Unbeknownst to Thit, Gandaomanee is using her elder twin sister's name, Gandaowasee, for herself, therefore tricking him into thinking her real name is Gandaowasee. She later leaves him when she grows tired of him and finds out that he's the poor son of a merchant (his mother makes Thai desserts). Thit is heart-broken and tries searching for her unsuccessfully.\nOne year later, Thit meets the real Gandaowasee Kitrinisuan at a banquet and is ecstatic upon seeing her. But Gan claims she doesn't know him. Thit is confused and confronts Gan about their relationship. He assumes she doesn't want to remember him because he's poor, therefore denying ever knowing him.\nGan doesn't know that she has a younger twin named Gandaomanee (Nee) from her father's previous marriage, and that Gandaomanee is using Gan's name to cause trouble for people around her. Their parents separated when the twins were born. Their father, Visake, took Gan with him, while Nee is left with their mother. She later remarried a poor man who works as a principal at a school. Nee is bitter about her poor life and blames Visake and Gan for it. Therefore, she uses her older twin sister's name to fool with men around her.\nThit soon inherits a fortune from his father's family and becomes rich. It turns out Visake, Gan's father, is a close friend of Thit's paternal family. Gan finds out that he is the sole heir to the Suriyakan family fortune. He taunts her character, making false accusations about her. A lot of misunderstandings occur because he thinks she is a two-faced person who plays with men's hearts. He also believes that she is stealing her younger stepsister's boyfriend.\nThit's grandmother soon realizes that Thit and Gan have feelings for each other (although he still thinks of Gan as his \"Gandaowasee\" that he met a year ago). She wants to see Thit marry someone he loves, so she proposes they marry each other. Gan refuses the proposal at first, for she knows he is mistaking her for his other Gandaowasee and that he doesn't truly love her. Nareerat (Apple Aitanik Intarasut), Gan's stepsister, is under the impression that Gan is stealing her boyfriend, Brapun (Pukhai Pongsiri Bunluewong). She threatens to kill herself if Gan doesn't marry Thit. Gan gives in, accepting Thit's wedding \"proposal.\"\nThit and Gan marry each other and slowly fall in love. Soon Gandaomanee gets into the picture, trying to win back Tit now that he's rich. She wants a better life for herself and will do anything to get what she wants. Thit is conflicted to who \"Gandaowasee\" really is. The one he met at the beach, or the one he married. Only time will tell who Tit really loves.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Yuttana Puangklang", "Wannarot Sonthichai", "Thephasadin Na Ayutthaya", "Ratchanont Sukprakob", "Alicia Ann Laisuthruklai"], "character": ["Thitit Suriyakan", "Gandaowasee/Gandaomanee Girinisuan", "Wasan", "Wit Asawagrai", "Urai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61081   Expand End of the String    (2013) User Score Overview Tithit (Toomtam Yuthana Puengklarng) meets Gandaomanee Girinisuan (View Wannarot Sontichai) in Phrajoit and falls in love with her. Unbeknownst to Thit, Gandaomanee is using her elder twin sister's name, Gandaowasee, for herself, therefore tricking him into thinking her real name is Gandaowasee. She later leaves him when she grows tired of him and finds out that he's the poor son of a merchant (his mother makes Thai desserts). Thit is heart-broken and tries searching for her unsuccessfully. One year later, Thit meets the real Gandaowasee Kitrinisuan at a banquet and is ecstatic upon seeing her. But Gan claims she doesn't know him. Thit is confused and confronts Gan about their relationship. He assumes she doesn't want to remember him because he's poor, therefore denying ever knowing him. Gan doesn't know that she has a younger twin named Gandaomanee (Nee) from her father's previous marriage, and that Gandaomanee is using Gan's name to cause trouble for people around her. Their parents separated when the twins were born. Their father, Visake, took Gan with him, while Nee is left with their mother. She later remarried a poor man who works as a principal at a school. Nee is bitter about her poor life and blames Visake and Gan for it. Therefore, she uses her older twin sister's name to fool with men around her. Thit soon inherits a fortune from his father's family and becomes rich. It turns out Visake, Gan's father, is a close friend of Thit's paternal family. Gan finds out that he is the sole heir to the Suriyakan family fortune. He taunts her character, making false accusations about her. A lot of misunderstandings occur because he thinks she is a two-faced person who plays with men's hearts. He also believes that she is stealing her younger stepsister's boyfriend. Thit's grandmother soon realizes that Thit and Gan have feelings for each other (although he still thinks of Gan as his \"Gandaowasee\" that he met a year ago). She wants to see Thit marry someone he loves, so she proposes they marry each other. Gan refuses the proposal at first, for she knows he is mistaking her for his other Gandaowasee and that he doesn't truly love her. Nareerat (Apple Aitanik Intarasut), Gan's stepsister, is under the impression that Gan is stealing her boyfriend, Brapun (Pukhai Pongsiri Bunluewong). She threatens to kill herself if Gan doesn't marry Thit. Gan gives in, accepting Thit's wedding \"proposal.\" Thit and Gan marry each other and slowly fall in love. Soon Gandaomanee gets into the picture, trying to win back Tit now that he's rich. She wants a better life for herself and will do anything to get what she wants. Thit is conflicted to who \"Gandaowasee\" really is. The one he met at the beach, or the one he married. Only time will tell who Tit really loves. Featured Crew Chuwong Chayajindaa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuttana Puangklang Thitit Suriyakan Wannarot Sonthichai Gandaowasee/Gandaomanee Girinisuan Thephasadin Na Ayutthaya Wasan Ratchanont Sukprakob Wit Asawagrai Alicia Ann Laisuthruklai Urai Full Cast & Crew Last Season Season 1 2013 | 17 Episodes Season 1 of End of the String  premiered on June 15, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on End of the String . You can help by rating TV shows you've seen. Facts Original Name  Sud Sai Pan Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  69m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 37 Crip 4 mariilakorn21 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}