{"link": "https://www.themoviedb.org/tv/433?language=en", "title": "Terminator: The Sarah Connor Chronicles", "resume": "The series picks up four years after the events of Terminator 2: Judgment Day with John and Sarah Connor trying to stay under-the-radar from the government, as they plot to destroy the computer network, Skynet, in hopes of preventing Armageddon.", "rate": 73, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Lena Headey", "Thomas Dekker", "Summer Glau", "Richard T. Jones", "Brian Austin Green"], "character": ["Sarah Connor", "John Connor", "Cameron", "James Ellison", "Derek Reese"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 433   Expand Terminator: The Sarah Connor Chronicles   (2008) User Score  Play Trailer Overview The series picks up four years after the events of Terminator 2: Judgment Day with John and Sarah Connor trying to stay under-the-radar from the government, as they plot to destroy the computer network, Skynet, in hopes of preventing Armageddon. Featured Crew Josh Friedman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  19 Content Issues  1 Images Backdrops  54 Posters  45 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lena Headey Sarah Connor Thomas Dekker John Connor Summer Glau Cameron Richard T. Jones James Ellison Brian Austin Green Derek Reese Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 2 2008 | 22 Episodes Season 2 of Terminator: The Sarah Connor Chronicles premiered on September  7, 2008. View All Seasons Social Reviews  1 Discussions  20 A review by tomk1  8.0 Written by  tomk1  on March  1, 2017 1st review\nIf you like Terminator movies, battlestar Galatia/Caprica then this will be a treat. I saw bits on TV but never could get the story, that's due to the story arc, you have to watch every episode (except 1). There are slow bits but worth watching for the high bits. S1 is good story character building, each character has back stories or future stories. S2 really hits the high mark except for 1crap episode. S3 never happened just when the show found the Awe-factor. My only con is due to the fact that it is called Sarah Connor Chronicles, some episodes seems like they wrot...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  54 Posters  45 Recommendations   2009-11-03 V 6.2    2006-09-25 Heroes 6.9    2009-02-13 Dollhouse 7.2    2004-07-11 The 4400 6.9    2000-10-03 Dark Angel 7.2    2009-07-07 Warehouse 13 7.2    2009-09-24 FlashForward 6.9    2011-07-11 Alphas 6.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage  - Genres Sci-Fi & Fantasy Keywords time travel robot based on movie Content Score 100 Yes! Looking good! Top Contributors 41 Travis Bell 37 Atanas 20 Banana 10 Julien Lefebvre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}