{"link": "https://www.themoviedb.org/tv/2336?language=en", "title": "Eat Bulaga!", "resume": "Eat Bulaga! is a noon-time variety show in the Philippines produced by Television And Production Exponents Inc. and aired by GMA Network. The show broadcasts from The New TAPE Studios at the GMA Broadway Centrum in New Manila, Quezon City. Eat Bulaga! is aired Weekdays at 12:00pm to 2:30 pm and Saturdays at 11:30am to 2:30pm. The show is also broadcast worldwide through GMA Pinoy TV. The name approximately translates to \"Lunchtime Surprise!\". The show celebrated its 34th year on Philippine television on July 31, 2013, holding the record of being the longest-running noontime variety program on air in the history of local television.\nIts first overseas version was Eat Bulaga! Indonesia, which premiered on Indonesia's SCTV network on July 16, 2012. Eat Bulaga! became the first Philippine show, variety show in particular, to be franchised by another country.", "rate": 80, "genre": ["Comedy"], "cast": ["Toni Gonzaga", "Vic Sotto", "Tito Sotto", "Onemig Bondoc", "Joyce Jimenez"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2336   Expand Eat Bulaga!   (1979) User Score Overview Eat Bulaga! is a noon-time variety show in the Philippines produced by Television And Production Exponents Inc. and aired by GMA Network. The show broadcasts from The New TAPE Studios at the GMA Broadway Centrum in New Manila, Quezon City. Eat Bulaga! is aired Weekdays at 12:00pm to 2:30 pm and Saturdays at 11:30am to 2:30pm. The show is also broadcast worldwide through GMA Pinoy TV. The name approximately translates to \"Lunchtime Surprise!\". The show celebrated its 34th year on Philippine television on July 31, 2013, holding the record of being the longest-running noontime variety program on air in the history of local television. Its first overseas version was Eat Bulaga! Indonesia, which premiered on Indonesia's SCTV network on July 16, 2012. Eat Bulaga! became the first Philippine show, variety show in particular, to be franchised by another country. Featured Crew TAPE Inc. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toni Gonzaga Vic Sotto Tito Sotto Onemig Bondoc Joyce Jimenez Full Cast & Crew Last Season Season 1 1999 | 1 Episode Season 1 of Eat Bulaga! premiered on July 30, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Eat Bulaga!. You can help by rating TV shows you've seen. Facts Status  Ended Network Radio Philippines Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://www.eatbulaga.tv Genres Comedy Keywords variety show Content Score 79 Pump it up! We're close now. Top Contributors W 12 Wakaku  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}