{"link": "https://www.themoviedb.org/tv/34705?language=en", "title": "Return to Treasure Island", "resume": "Return to Treasure Island is a 1986 Disney HTV TV Series, starring Brian Blessed as Long John Silver and Christopher Guard as Jim Hawkins.\nDisney Channel contracted the UK ITV broadcaster HTV Wales, part of Harlech Television Group, to produce the series, and it was shot in Wales, Spain and Jamaica. It was written by John Goldsmith, and directed by Piers Haggard and Alex Kirby. HTV Wales had already produced other Robert Louis Stevenson books for television, namingly Kidnapped in 1979 and The Master of Ballantrae in 1984 and producer Patrick Dromgoole would go on to helm Treasure Island. Their expertise in making these productions was used when Disney chose to work with HTV to produce a series, in 10 parts.", "rate": 0, "genre": [], "cast": ["Brian Blessed", "Kenneth Colley", "Christopher Guard"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34705   Expand Return to Treasure Island   (1986) User Score Overview Return to Treasure Island is a 1986 Disney HTV TV Series, starring Brian Blessed as Long John Silver and Christopher Guard as Jim Hawkins. Disney Channel contracted the UK ITV broadcaster HTV Wales, part of Harlech Television Group, to produce the series, and it was shot in Wales, Spain and Jamaica. It was written by John Goldsmith, and directed by Piers Haggard and Alex Kirby. HTV Wales had already produced other Robert Louis Stevenson books for television, namingly Kidnapped in 1979 and The Master of Ballantrae in 1984 and producer Patrick Dromgoole would go on to helm Treasure Island. Their expertise in making these productions was used when Disney chose to work with HTV to produce a series, in 10 parts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Blessed Kenneth Colley Christopher Guard Full Cast & Crew Last Season Season 1 1986 | 10 Episodes Season 1 of Return to Treasure Island premiered on April  5, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Return to Treasure Island. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords sequel pirate Content Score 50 Still needs a little work. Top Contributors 2 rudely_murray h 2 hanyny 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}