{"link": "https://www.themoviedb.org/tv/1737?language=en", "title": "Four Star Playhouse", "resume": "Four Star Playhouse is an American television anthology series that ran from 1952 to 1956, sponsored in its first bi-weekly season by The Singer Company; Bristol-Myers became an alternate sponsor when it became a weekly series in the fall of 1953. The original premise was that Charles Boyer, Ida Lupino, David Niven, and Dick Powell would take turns starring in episodes. However, several other performers took the lead from time to time, including Ronald Colman and Joan Fontaine.\nBlake Edwards was among the writers and directors who contributed to the series. Edwards created the recurring character of illegal gambling house operator Willie Dante for Dick Powell to play on this series. The character was later revamped and spun off in his own series starring Howard Duff, then-husband of Lupino.\nThe pilot for Meet McGraw, starring Frank Lovejoy, aired here, as did another episode in which Lovejoy recreated his role of Chicago newspaper reporter Randy Stone, from the radio drama Nightbeat.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": ["Dick Powell", "Ida Lupino", "David Niven", "Charles Boyer", "Angela Lansbury"], "character": ["Andy", "Paul", "Joan Robinson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1737   Expand Four Star Playhouse   (1952) User Score Overview Four Star Playhouse is an American television anthology series that ran from 1952 to 1956, sponsored in its first bi-weekly season by The Singer Company; Bristol-Myers became an alternate sponsor when it became a weekly series in the fall of 1953. The original premise was that Charles Boyer, Ida Lupino, David Niven, and Dick Powell would take turns starring in episodes. However, several other performers took the lead from time to time, including Ronald Colman and Joan Fontaine. Blake Edwards was among the writers and directors who contributed to the series. Edwards created the recurring character of illegal gambling house operator Willie Dante for Dick Powell to play on this series. The character was later revamped and spun off in his own series starring Howard Duff, then-husband of Lupino. The pilot for Meet McGraw, starring Frank Lovejoy, aired here, as did another episode in which Lovejoy recreated his role of Chicago newspaper reporter Randy Stone, from the radio drama Nightbeat. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dick Powell Ida Lupino David Niven Andy Charles Boyer Paul Angela Lansbury Joan Robinson Full Cast & Crew Last Season Season 4 1955 | 39 Episodes Season 4 of Four Star Playhouse premiered on October  6, 1955. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Four Star Playhouse. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Comedy Keywords anthology playhouse Content Score 86 Almost there... Top Contributors 10 Banana R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}