{"link": "https://www.themoviedb.org/tv/66599?language=en", "title": "Private Eyes", "resume": "Ex-pro hockey player Matt Shade irrevocably changes his life when he teams up with fierce P.I. Angie Everett to form an unlikely investigative powerhouse.", "rate": 60, "genre": ["Crime", "Drama"], "cast": ["Cindy Sampson", "Jason Priestley", "Ennis Esmer", "Barry Flatman", "Jordyn Negri"], "character": ["Angie Everett", "Matt Shade", "Kurtis Mazhari", "Don Shade", "Jules Shade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66599   Expand Private Eyes   (2016) User Score  Play Trailer Overview Ex-pro hockey player Matt Shade irrevocably changes his life when he teams up with fierce P.I. Angie Everett to form an unlikely investigative powerhouse. Featured Crew Shelley Eriksen Creator Tim Kilby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cindy Sampson Angie Everett Jason Priestley Matt Shade Ennis Esmer Kurtis Mazhari Barry Flatman Don Shade Jordyn Negri Jules Shade Full Cast & Crew Last Season Season 2 2017 | 17 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply b Season 2 Open 2 by  bgirlmagic Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  5 Recommendations   2018-02-01 A.P. Bio 5.8    2013-02-03 Motive 5.9    2017-10-01 Wisdom of the Crowd 7.1    2015-01-12 Eye Candy 5.8    2010-09-29 Todd and the Book of Pure Evil 7.6    2016-01-22 Stan Lee's Lucky Man 7.3    2016-03-15 Crowded 6.4    2017-09-25 The Brave 6.6  Facts Status  Returning Series Network Certification PG Meaning Parental guidance. Moderate violence and moderate profanity is allowed, as is brief nudity and sexual references if important to the context of the story. Type  Scripted Original Language  English Runtime  60m Homepage   http://globaltv.com/privateeyes Genres Crime Drama Keywords canada based on novel or book toronto private investigator Content Score 100 Yes! Looking good! Top Contributors 70 Banana 10 Elizabeth Jennings v 6 vicman_mdb z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}