{"link": "https://www.themoviedb.org/tv/17631?language=en", "title": "League of Super Evil", "resume": "League of Super Evil is a Canadian animated television series inspired by the sketch \"Once Were Heroes\" by Ryan Harper-Brown, co-created by Philippe Ivanusic-Vallee, Davila LeBlanc, Peter Ricq, developed by Asaph Fipke, and produced by Nerd Corps Entertainment in conjunction with YTV. On YTV, it premiered on March 9, 2009, at 10:30 a.m. ET. The show is airing on Nickelodeon in Canada, Spain, the Netherlands, Portugal and on Cartoon Network in most of Southeast Asia, India, Australia, New Zealand, The United States, CBBC in United Kingdom and Canal Plus, Canal J, and Gulli in France. The first season consisted of 26 episodes. The second season consisted of 13 episodes. In total, 52 episodes have aired. In Latin America, it is aired on Disney XD. The second season started airing in Canada in September 2010 and the third season aired from June 2012 to August 2012. The series ended on August 25, 2012.", "rate": 60, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Scott McNeil", "Tabitha St. Germain", "Lee Tockar", "Colin Murdock"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17631   Expand League of Super Evil   (2009) User Score Overview League of Super Evil is a Canadian animated television series inspired by the sketch \"Once Were Heroes\" by Ryan Harper-Brown, co-created by Philippe Ivanusic-Vallee, Davila LeBlanc, Peter Ricq, developed by Asaph Fipke, and produced by Nerd Corps Entertainment in conjunction with YTV. On YTV, it premiered on March 9, 2009, at 10:30 a.m. ET. The show is airing on Nickelodeon in Canada, Spain, the Netherlands, Portugal and on Cartoon Network in most of Southeast Asia, India, Australia, New Zealand, The United States, CBBC in United Kingdom and Canal Plus, Canal J, and Gulli in France. The first season consisted of 26 episodes. The second season consisted of 13 episodes. In total, 52 episodes have aired. In Latin America, it is aired on Disney XD. The second season started airing in Canada in September 2010 and the third season aired from June 2012 to August 2012. The series ended on August 25, 2012. Featured Crew Peter Ricq Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Scott McNeil Tabitha St. Germain Lee Tockar Colin Murdock Full Cast & Crew Last Season Season 1 — | 8 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on League of Super Evil. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.leagueofsuperevil.com/ Genres Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 3 speedycars 1 kuzronk A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}