{"link": "https://www.themoviedb.org/tv/51212?language=en", "title": "V Love", "resume": "Friends living in the SNS generation face challenges to finding love and happiness as they finish university and move on into the world around them.", "rate": 0, "genre": ["Drama"], "cast": ["Vengo Gao", "Dilraba Dilmurat", "Vin Zhang", "Sierra Li", "Yang Mi"], "character": ["Ying Dong", "Wu An Po", "Han Ding Yi", "Kang Wei Wei", "Luo Yi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51212   Expand V Love   (2014) User Score Overview Friends living in the SNS generation face challenges to finding love and happiness as they finish university and move on into the world around them. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vengo Gao Ying Dong Dilraba Dilmurat Wu An Po Vin Zhang Han Ding Yi Sierra Li Kang Wei Wei Yang Mi Luo Yi Full Cast & Crew Last Season Season 1 2014 | 40 Episodes Season 1 of V Love premiered on July 21, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on V Love. You can help by rating TV shows you've seen. Facts Original Name  微时代 Status  Ended Network QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords china romance Content Score 86 Almost there... Top Contributors M 31 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}