{"link": "https://www.themoviedb.org/tv/70785?language=en", "title": "Anne with an E", "resume": "A coming-of-age story about an outsider who, against all odds and numerous challenges, fights for love and acceptance and for her place in the world. The series centers on a young orphaned girl in the late 1890’s, who, after an abusive childhood spent in orphanages and the homes of strangers, is mistakenly sent to live with an elderly woman and her aging brother. Over time, 13-year-old Anne will transform their lives and eventually the small town in which they live with her unique spirit, fierce intellect and brilliant imagination.", "rate": 84, "genre": ["Drama", "Family"], "cast": ["Amybeth McNulty", "Geraldine James", "R.H. Thomson", "Corrine Koslo", "Dalila Bela"], "character": ["Anne Shirley", "Marilla Cuthbert", "Matthew Cuthbert", "Rachel Lynde", "Diana Barry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70785   Expand Anne with an E   (2017) User Score  Play Trailer Overview A coming-of-age story about an outsider who, against all odds and numerous challenges, fights for love and acceptance and for her place in the world. The series centers on a young orphaned girl in the late 1890’s, who, after an abusive childhood spent in orphanages and the homes of strangers, is mistakenly sent to live with an elderly woman and her aging brother. Over time, 13-year-old Anne will transform their lives and eventually the small town in which they live with her unique spirit, fierce intellect and brilliant imagination. Featured Crew Moira Walley-Beckett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  10 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amybeth McNulty Anne Shirley Geraldine James Marilla Cuthbert R.H. Thomson Matthew Cuthbert Corrine Koslo Rachel Lynde Dalila Bela Diana Barry Full Cast & Crew Current Season Season 2 2018 | 1 Episode Season 2 of Anne with an E is set to premiere on July  6, 2018. View All Seasons Social Reviews  1 Discussions  4 A review by Olivergbyrne Written by  Olivergbyrne  on October  4, 2017 I really cannot understand for the life of me how any one would really dislike this charming retelling of Anne of green Gable. It seriously beat the other recent adaptation with Martin Sheen in every category. The actors are all pitch perfect in their role. What this version does better then any other version I seen before is the way it showed Ann struggling to fit in Avonlea. Episode 3 was a hard watch because it basically showed Ann being bullied and judged by all the Avonlea resident.Other version touched a little on that but in this one you really feel for Anne, she sure did not have it eas...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  10 Posters  8 Recommendations   2017-05-05 Spirit: Riding Free 6.3    2012-11-01 Redfern Now 8.0    2017-01-06 One Day at a Time 6.6    2008-10-12 Stephen Fry in America 8.0    2015-10-06 Chewing Gum 7.0    2014-04-06 TURN: Washington's Spies 7.4    2014-07-17 You're the Worst 7.5    2015-11-08 Flesh and Bone 7.0  Facts Status  Returning Series Networks Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  44m Homepage   http://www.cbc.ca/anne/ Genres Drama Family Keywords based on novel or book orphan 19th century Content Score 100 Yes! Looking good! Top Contributors 59 Elizabeth Jennings 11 Patrik Selin 6 BryGur R 6 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}