{"link": "https://www.themoviedb.org/tv/61919?language=en", "title": "Yatterman Night", "resume": "A girl is looking at a remote island on the ocean named The Yatter Kingdom, a country that is said to be ruled by the hero Yatterman. The girl wants to ask the Yattermans for some help to cure her sick mother and decides to venture to the kingdom. She gets kicked out from the kingdom though and her mother dies without receiving any help.\nUnder Dokurobei, the boss of the Dorombo thieves that existed, lies a beauty named Doronjo. The two men, Boyacky and Tonzura, worked under Doronjo but got kicked out from the Yatter Kingdom along with the Doronbo thieves as they lost a fight against the Yatterman. This is the new generation of Dorombo—Doronjo, Boyacky, Tonzura, and new Yatterman—a story of the birth of Gan-chan and Ai-chan.", "rate": 0, "genre": ["Action", "Adventure", "Animation", "Science", "Fiction"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61919   Expand Yatterman Night   (2015) User Score Overview A girl is looking at a remote island on the ocean named The Yatter Kingdom, a country that is said to be ruled by the hero Yatterman. The girl wants to ask the Yattermans for some help to cure her sick mother and decides to venture to the kingdom. She gets kicked out from the kingdom though and her mother dies without receiving any help. Under Dokurobei, the boss of the Dorombo thieves that existed, lies a beauty named Doronjo. The two men, Boyacky and Tonzura, worked under Doronjo but got kicked out from the Yatter Kingdom along with the Doronbo thieves as they lost a fight against the Yatterman. This is the new generation of Dorombo—Doronjo, Boyacky, Tonzura, and new Yatterman—a story of the birth of Gan-chan and Ai-chan. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Yatterman Night premiered on January 11, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Yatterman Night. You can help by rating TV shows you've seen. Facts Original Name  夜ノヤッターマン Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.yatterman.jp Genres Action Adventure Animation Science Fiction Keywords anime Content Score 56 We're so close, yet so far. Top Contributors 42 sp1ti 4 Elizabeth Jennings 4 kappa-papa m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}