{"link": "https://www.themoviedb.org/tv/34726?language=en", "title": "Tokyo Majin Gakuen Kenpucho", "resume": "Tokyo Majin Gakuen Kenpuchō Tō is a Japanese anime series, which premiered in Japan on the anime satellite TV network Animax. A large part of Tokyo Majin Gakuen, it is loosely based on a series of Japan-only video games, and is directed by Shinji Ishihara.\nThe first season first aired on January 19, 2007 and ended on April 20, 2007; all the episodes in the series were called the 'Dark Law Chapters'. A second season, titled Tokyo Majin Gakuen Kenpuchō Tō: Dai Ni Maku started airing on July 27, 2007; its first five episodes are called the 'Martial Fist Chapters', its next five episodes are called the 'Stars of Fate Chapters', and its last two episodes are called the 'Extra'.\nOn June 26, 2007, ADV announced that they had acquired the license to this series. ADV distributed the series under the title of Tokyo Majin, dropping \"Gakuen Kenpuchō Tō\" from the title. In 2008, the anime became one of over 30 ADV titles whose licenses were transferred to Funimation.", "rate": 0, "genre": ["Animation"], "cast": ["Yui Horie", "Satomi Arai", "Hiro Shimono", "Masaki Kawanabe", "Katsui Taira"], "character": ["Aoi Misato", "Komaki Sakurai", "Tatsuma Hiyuu", "Kyouichi Horaiji", "Yuuya Daigo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34726   Expand Tokyo Majin Gakuen Kenpucho   (2007) User Score Overview Tokyo Majin Gakuen Kenpuchō Tō is a Japanese anime series, which premiered in Japan on the anime satellite TV network Animax. A large part of Tokyo Majin Gakuen, it is loosely based on a series of Japan-only video games, and is directed by Shinji Ishihara. The first season first aired on January 19, 2007 and ended on April 20, 2007; all the episodes in the series were called the 'Dark Law Chapters'. A second season, titled Tokyo Majin Gakuen Kenpuchō Tō: Dai Ni Maku started airing on July 27, 2007; its first five episodes are called the 'Martial Fist Chapters', its next five episodes are called the 'Stars of Fate Chapters', and its last two episodes are called the 'Extra'. On June 26, 2007, ADV announced that they had acquired the license to this series. ADV distributed the series under the title of Tokyo Majin, dropping \"Gakuen Kenpuchō Tō\" from the title. In 2008, the anime became one of over 30 ADV titles whose licenses were transferred to Funimation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yui Horie Aoi Misato Satomi Arai Komaki Sakurai Hiro Shimono Tatsuma Hiyuu Masaki Kawanabe Kyouichi Horaiji Katsui Taira Yuuya Daigo Full Cast & Crew Last Season gakuen kenpucho: tou season 1 2007 | 26 Episodes Season 1 of Tokyo Majin Gakuen Kenpucho premiered on January 19, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tokyo Majin Gakuen Kenpucho. You can help by rating TV shows you've seen. Facts Original Name  東京魔人學園剣風帖 龖 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 10 BrerFox m 4 magoozin M 4 MGB89 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}