{"link": "https://www.themoviedb.org/tv/3221?language=en", "title": "Dick Spanner, P.I.", "resume": "Dick Spanner, P.I. is a 1986 British stop-motion animated comedy series which parodied Chandleresque detective shows. The title character and main protagonist was Dick Spanner, voiced by Shane Rimmer, a robotic private detective who works cases in a futuristic urban setting. The show made frequent use of puns and visual gags.\nThe series consisted of 22 six-minute episodes, covering two story arcs of equal length: \"The Case Of The Human Cannonball\" and \"The Case Of The Maltese Parrot\". The programme was originally broadcast in the United Kingdom as a segment of the Sunday morning show Network 7 on Channel 4, and was later repeated on the same channel in a late night spot.\nProduced by Thunderbirds creator Gerry Anderson, the series was created and written by Terry Adlam, who had previously worked on effects for Anderson's Terrahawks. It was also the basis for the Anderson-created Tennants Pilsner advertising campaign using the Lou Tennant character.", "rate": 100, "genre": ["Animation", "Comedy"], "cast": ["Shane Rimmer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3221   Expand Dick Spanner, P.I. User Score Overview Dick Spanner, P.I. is a 1986 British stop-motion animated comedy series which parodied Chandleresque detective shows. The title character and main protagonist was Dick Spanner, voiced by Shane Rimmer, a robotic private detective who works cases in a futuristic urban setting. The show made frequent use of puns and visual gags. The series consisted of 22 six-minute episodes, covering two story arcs of equal length: \"The Case Of The Human Cannonball\" and \"The Case Of The Maltese Parrot\". The programme was originally broadcast in the United Kingdom as a segment of the Sunday morning show Network 7 on Channel 4, and was later repeated on the same channel in a late night spot. Produced by Thunderbirds creator Gerry Anderson, the series was created and written by Terry Adlam, who had previously worked on effects for Anderson's Terrahawks. It was also the basis for the Anderson-created Tennants Pilsner advertising campaign using the Lou Tennant character. Featured Crew Gerry Anderson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shane Rimmer Full Cast & Crew Last Season Dick spanner season 2 — | 2 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  6m Homepage  - Genres Animation Comedy Keywords future parody private investigator stop motion robot british humour Content Score 56 We're so close, yet so far. Top Contributors 6 Banana O 3 Ozbourne m 3 mythman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}