{"link": "https://www.themoviedb.org/tv/61314?language=en", "title": "Apocalypse: World War I", "resume": "Colorized historical footage in ascending order of World War 1. Not only the relatively known Flanders and France battles, but also the generally unknown Italian-Austrian, German-Polish-Russian, Japanese-German, Ottoman Empire- Allied and African German Colonies, and other unknown or forgotten fronts and battles. Original French production retold in English for National Geographic channel as: World War 1: The Apocalypse", "rate": 78, "genre": ["War", "Politics", "Documentary"], "cast": ["Mathieu Kassovitz"], "character": ["Narrateur"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61314   Expand Apocalypse: World War I   (2014) User Score Overview Colorized historical footage in ascending order of World War 1. Not only the relatively known Flanders and France battles, but also the generally unknown Italian-Austrian, German-Polish-Russian, Japanese-German, Ottoman Empire- Allied and African German Colonies, and other unknown or forgotten fronts and battles. Original French production retold in English for National Geographic channel as: World War 1: The Apocalypse Featured Crew Daniel Costelle Creator Isabelle Clarke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Mathieu Kassovitz Narrateur Full Cast & Crew Last Season Season 1 2014 | 5 Episodes Season 1 of Apocalypse: World War I premiered on March 18, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Apocalypse: World War I. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   2009-09-08 Apocalypse: The Second World War 8.2  Facts Original Name  Apocalypse, la Première Guerre Mondiale Status  Ended Network Certification  - Type  Miniseries Original Language  French Runtime  50m Homepage  - Genres War & Politics Documentary Keywords world war i russian revolution 1917 europe miniseries apocalypse british politics Content Score 71 Just a little bit more... Top Contributors TB 26 TMDb Bot M 20 Manu 14 Elizabeth Jennings 12 aiman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}