{"link": "https://www.themoviedb.org/tv/9161?language=en", "title": "Dirty Pair", "resume": "Dirty Pair is a series of sci-fi comedy light novels written by Haruka Takachiho and illustrated by Yoshikazu Yasuhiko that was later adapted into anime and manga versions.\nThe stories take place in the years 2138-43, by which time humanity has spread across some few thousand star systems. A corporation called the World Welfare Works Association helps member systems of the United Galactica federation deal with various planetary-scale problems, for profit, by sending agents called \"trouble consultants\". Probably the most high-profile arm of the organization is the Criminal Investigations section, which works to solve crimes or mysteries. The series focuses on a team of trouble consultants in that section, named Kei and Yuri, who have a reputation for leaving a trail of destruction behind them, for which they are known publicly as the \"Dirty Pair\".\nThe franchise has bounced across multiple formats and production companies, resulting in eight novels and a few shorter stories, a television series, two OVA series, two OVA features, a feature film, a number of graphic novels, and two short Japanese radio series. The series won the Animage Anime Grand Prix prize in 1985.", "rate": 0, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Ikuya Sawaki", "Saeko Shimazu", "Kyōko Tongū", "Shingo Hiromori", "Jūrōta Kosugi"], "character": ["Goolley", "Yuri", "Kei", "Calico", "Darain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9161   Expand Dirty Pair   (1985) User Score Overview Dirty Pair is a series of sci-fi comedy light novels written by Haruka Takachiho and illustrated by Yoshikazu Yasuhiko that was later adapted into anime and manga versions. The stories take place in the years 2138-43, by which time humanity has spread across some few thousand star systems. A corporation called the World Welfare Works Association helps member systems of the United Galactica federation deal with various planetary-scale problems, for profit, by sending agents called \"trouble consultants\". Probably the most high-profile arm of the organization is the Criminal Investigations section, which works to solve crimes or mysteries. The series focuses on a team of trouble consultants in that section, named Kei and Yuri, who have a reputation for leaving a trail of destruction behind them, for which they are known publicly as the \"Dirty Pair\". The franchise has bounced across multiple formats and production companies, resulting in eight novels and a few shorter stories, a television series, two OVA series, two OVA features, a feature film, a number of graphic novels, and two short Japanese radio series. The series won the Animage Anime Grand Prix prize in 1985. Featured Crew Haruka Takachiho Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ikuya Sawaki Goolley Saeko Shimazu Yuri Kyōko Tongū Kei Shingo Hiromori Calico Jūrōta Kosugi Darain Full Cast & Crew Last Season (jp) season 1 1985 | 26 Episodes Season 1 of Dirty Pair premiered on July 15, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dirty Pair. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 1 TheDerpMan b 1 birbaumer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}