{"link": "https://www.themoviedb.org/tv/67979?language=en", "title": "Beyond The Walls", "resume": "Lisa, a young speech therapist, heirs a house from an unknown man who died over 20 years ago. She is not in any way related to this man and she doesn't know him. When she moves into the mysterious building, she becomes trapped in a true labyrinth...", "rate": 62, "genre": ["Drama", "Mystery"], "cast": ["Cédric Lechapelier", "Lila-Rose Gilberti", "Veerle Baetens", "François Deblock", "Geraldine Chaplin"], "character": ["L'homme à la tête de sanglier", "Sophie", "Lisa", "Julien", "Rose"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67979   Expand Beyond The Walls   (2016) User Score Overview Lisa, a young speech therapist, heirs a house from an unknown man who died over 20 years ago. She is not in any way related to this man and she doesn't know him. When she moves into the mysterious building, she becomes trapped in a true labyrinth... Featured Crew Marc Herpoux Creator Hervé Hadmar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cédric Lechapelier L'homme à la tête de sanglier Lila-Rose Gilberti Sophie Veerle Baetens Lisa François Deblock Julien Geraldine Chaplin Rose Full Cast & Crew Last Season Miniseries 2016 | 3 Episodes Season 1 of Beyond The Walls premiered on September 22, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Beyond The Walls. You can help by rating TV shows you've seen. Facts Original Name  Au-delà des murs Status  Ended Network Certification  - Type  Miniseries Original Language  French Runtime  45m Homepage   http://sites.arte.tv/audeladesmurs/fr Genres Drama Mystery Keywords horror miniseries Content Score 93 Almost there... Top Contributors TB 33 TMDb Bot M 29 Minister z 15 zurman1 R 9 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}