{"link": "https://www.themoviedb.org/tv/63217?language=en", "title": "Tiny Times", "resume": "Based on the best-selling novels by Guo Jingming, the story is set in the rapidly growing but beautiful and fashionable city of Shanghai, where high school best friends Lin Xiao, Wan Ru, Gu Li, and Nan Xiang, experience various life events that challenge their values, friendship and overall outlook on life.", "rate": 40, "genre": ["Drama", "Romance"], "cast": ["Ivy Chen", "Jiang Kaitong", "Andrea Chen", "Xu Dongmei", "Peter Ho"], "character": ["Lin Xiao", "Gu Li", "Nan Xiang", "Tang Wan Ru", "Gong Ming"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63217   Expand Tiny Times   (2014) User Score Overview Based on the best-selling novels by Guo Jingming, the story is set in the rapidly growing but beautiful and fashionable city of Shanghai, where high school best friends Lin Xiao, Wan Ru, Gu Li, and Nan Xiang, experience various life events that challenge their values, friendship and overall outlook on life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Ivy Chen Lin Xiao Jiang Kaitong Gu Li Andrea Chen Nan Xiang Xu Dongmei Tang Wan Ru Peter Ho Gong Ming Full Cast & Crew Last Season Season 1 2014 | 32 Episodes Season 1 of Tiny Times premiered on July 10, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tiny Times. You can help by rating TV shows you've seen. Facts Original Name  小時代之折紙時代 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Romance Keywords china university fashion magazine college student Content Score 93 Almost there... Top Contributors 51 Wendy M 1 Maria180493 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}