{"link": "https://www.themoviedb.org/tv/1350?language=en", "title": "Out of the Unknown", "resume": "Out of the Unknown is a British television science fiction anthology drama series, produced by the BBC and broadcast on BBC2 in four series between 1965 and 1971. Each episode was a dramatisation of a science fiction short story. Some were written directly for the series, but most were adaptations of already published stories.\nThe first three years were exclusively science fiction, but that genre was abandoned in the final year in favour of horror/fantasy stories. A number of episodes were wiped during the early 1970s, as was standard procedure at the time. A large number of episodes are still missing but some do turn up from time to time; for instance, Level Seven from series two, originally broadcast on 27 October 1966 was returned to the BBC from the archives of a European broadcaster in January 2006.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1350   Expand Out of the Unknown   (1965) User Score Overview Out of the Unknown is a British television science fiction anthology drama series, produced by the BBC and broadcast on BBC2 in four series between 1965 and 1971. Each episode was a dramatisation of a science fiction short story. Some were written directly for the series, but most were adaptations of already published stories. The first three years were exclusively science fiction, but that genre was abandoned in the final year in favour of horror/fantasy stories. A number of episodes were wiped during the early 1970s, as was standard procedure at the time. A large number of episodes are still missing but some do turn up from time to time; for instance, Level Seven from series two, originally broadcast on 27 October 1966 was returned to the BBC from the archives of a European broadcaster in January 2006. Featured Crew Irene Shubik Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 1971 | 11 Episodes Season 4 of Out of the Unknown premiered on April 21, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Out of the Unknown. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors R 2 Rebecca t 1 tmdb15589237  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}