{"link": "https://www.themoviedb.org/tv/62036?language=en", "title": "Ouroboros", "resume": "\"Ouroboros\" is an ancient symbol that depicts a snake eating its own tail - meaning infinity. Based on a popular comic, a clumsy detective and a cool gang stand up to true evil. Ikuo and Tatsuya grew up in a children's orphanage together. When their favorite teacher, Yuiko, is murdered, a policeman wearing a gold watch covers up the incident. Ikuo and Tatsuya promise each other to avenge their teacher someday. Twenty years later, Ikuo is a detective in Shinjuku second police station investigating various cases with elite detective - Mizuki, while smart and handsome Tatsuya has become one of the top members of a gang group.", "rate": 80, "genre": ["Mystery"], "cast": ["Toma Ikuta", "Shun Oguri", "Juri Ueno", "Yo Yoshida", "Tsuyoshi Muro"], "character": ["Ryuzaki Ikuo", "Danno Tatsuya", "Hibino Mizuki", "Tachibana Tomiko", "Fukamachi Takeshi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62036   Expand Ouroboros   (2015) User Score Overview \"Ouroboros\" is an ancient symbol that depicts a snake eating its own tail - meaning infinity. Based on a popular comic, a clumsy detective and a cool gang stand up to true evil. Ikuo and Tatsuya grew up in a children's orphanage together. When their favorite teacher, Yuiko, is murdered, a policeman wearing a gold watch covers up the incident. Ikuo and Tatsuya promise each other to avenge their teacher someday. Twenty years later, Ikuo is a detective in Shinjuku second police station investigating various cases with elite detective - Mizuki, while smart and handsome Tatsuya has become one of the top members of a gang group. Featured Crew Kazunao Furuya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toma Ikuta Ryuzaki Ikuo Shun Oguri Danno Tatsuya Juri Ueno Hibino Mizuki Yo Yoshida Tachibana Tomiko Tsuyoshi Muro Fukamachi Takeshi Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Ouroboros premiered on January 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ouroboros. You can help by rating TV shows you've seen. Facts Original Name  ウロボロス〜この愛こそ、正義。 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage   http://www.tbs.co.jp/OUROBOROS/ Genres Mystery Keywords japan Content Score 93 Almost there... Top Contributors s 32 sheva_vitali 14 againlin 11 Elizabeth Jennings M 8 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}