{"link": "https://www.themoviedb.org/tv/3453?language=en", "title": "Tommy Lee Goes to College", "resume": "Tommy Lee Goes to College is an NBC reality television show that began broadcasting on Tuesday, August 16, 2005 and on VH1 on Friday, August 19, 2005. It features Mötley Crüe drummer Tommy Lee attending the University of Nebraska and attempting to fit in. Six episodes were produced.\nThe show features Lee, who is a high-school dropout, facing collegiate challenges like finding a roommate, trying out for athletic teams, trying to join a fraternity, studying chemistry, and trying out for the marching band.\nEven though the show is considered a \"reality show,\" much of the plot is scripted. Contrary to what is shown in the show, there were casting calls for parts in the show. The show featured silly things like Lee starting a fraternity called \"House of Lee,\" and its newly recruited members breaking into the art museum at night to vandalize and install their own artwork. A disclaimer at the end of the show revealed that while Lee attended classes, he did not actually enroll at the University of Nebraska and that certain situations were generated or edited for comedic effect.\nThe administration of the University of Nebraska-Lincoln decided to host the reality show in the hopes that it would increase positive exposure to the university for recruiting and public relations purposes.", "rate": 50, "genre": ["Reality"], "cast": ["Tommy Lee"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3453   Expand Tommy Lee Goes to College   (2005) User Score Overview Tommy Lee Goes to College is an NBC reality television show that began broadcasting on Tuesday, August 16, 2005 and on VH1 on Friday, August 19, 2005. It features Mötley Crüe drummer Tommy Lee attending the University of Nebraska and attempting to fit in. Six episodes were produced. The show features Lee, who is a high-school dropout, facing collegiate challenges like finding a roommate, trying out for athletic teams, trying to join a fraternity, studying chemistry, and trying out for the marching band. Even though the show is considered a \"reality show,\" much of the plot is scripted. Contrary to what is shown in the show, there were casting calls for parts in the show. The show featured silly things like Lee starting a fraternity called \"House of Lee,\" and its newly recruited members breaking into the art museum at night to vandalize and install their own artwork. A disclaimer at the end of the show revealed that while Lee attended classes, he did not actually enroll at the University of Nebraska and that certain situations were generated or edited for comedic effect. The administration of the University of Nebraska-Lincoln decided to host the reality show in the hopes that it would increase positive exposure to the university for recruiting and public relations purposes. Featured Crew BT Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tommy Lee Full Cast & Crew Last Season Season 1 2005 | 6 Episodes Season 1 of Tommy Lee Goes to College premiered on August 16, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tommy Lee Goes to College. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Reality Keywords rock star college Content Score 64 We're so close, yet so far. Top Contributors 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}