{"link": "https://www.themoviedb.org/tv/6590?language=en", "title": "South of Sunset", "resume": "South of Sunset is an American TV detective series, starring musician/actor Glenn Frey, that only aired one episode on CBS in 1993.\nFrey played Cody McMahon, a private eye whose offices were located just south of Sunset Boulevard in Beverly Hills. As a result, he calls his business the Beverly Hills Detective Agency, despite the fact he's in the \"low-end\" part of town. Aries Spears co-starred as Cody's young assistant Ziggy Duane, and Maria Pitillo played his cute blond secretary Gina Weston. The show was a combination of comedy and suspense, reminiscent of ABC's hit series Moonlighting. The show was created by John Byrum, who wrote all six of the episodes that were produced, and served as co-executive producer with Stan Rogow. The show was heavily promoted during the 1993 World Series by CBS.\nHowever, only the pilot of South of Sunset ever aired, on October 27, 1993—and not even to the entire country. News coverage of wild fires in Malibu pre-empted the show's lone episode on many West Coast stations, including KCBS in Los Angeles itself. Disappointed with the ratings of the pilot and unwilling to give it a chance to build a base, CBS immediately cancelled the show, much to Frey's chagrin. VH1 later aired four more of the shows as part of their Eagles Family Tree Week.", "rate": 0, "genre": ["Drama"], "cast": ["Aries Spears", "Glenn Frey", "Maria Pitillo"], "character": ["Ziggy Duane", "Cody McMahon", "Gina Weston"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6590   Expand South of Sunset   (1993) User Score Overview South of Sunset is an American TV detective series, starring musician/actor Glenn Frey, that only aired one episode on CBS in 1993. Frey played Cody McMahon, a private eye whose offices were located just south of Sunset Boulevard in Beverly Hills. As a result, he calls his business the Beverly Hills Detective Agency, despite the fact he's in the \"low-end\" part of town. Aries Spears co-starred as Cody's young assistant Ziggy Duane, and Maria Pitillo played his cute blond secretary Gina Weston. The show was a combination of comedy and suspense, reminiscent of ABC's hit series Moonlighting. The show was created by John Byrum, who wrote all six of the episodes that were produced, and served as co-executive producer with Stan Rogow. The show was heavily promoted during the 1993 World Series by CBS. However, only the pilot of South of Sunset ever aired, on October 27, 1993—and not even to the entire country. News coverage of wild fires in Malibu pre-empted the show's lone episode on many West Coast stations, including KCBS in Los Angeles itself. Disappointed with the ratings of the pilot and unwilling to give it a chance to build a base, CBS immediately cancelled the show, much to Frey's chagrin. VH1 later aired four more of the shows as part of their Eagles Family Tree Week. Featured Crew Stan Rogow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aries Spears Ziggy Duane Glenn Frey Cody McMahon Maria Pitillo Gina Weston Full Cast & Crew Last Season Season 1 1993 | 7 Episodes Season 1 of South of Sunset premiered on October 27, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on South of Sunset. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords private investigator los angeles beverly hills detective agency Content Score 50 Still needs a little work. Top Contributors 11 Banana 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}