{"link": "https://www.themoviedb.org/tv/2279?language=en", "title": "Relativity", "resume": "Relativity is an American drama television series which followed a twenty-something couple, Isabel Lukens and Leo Roth, and the lives and loves of their friends and siblings in Los Angeles. The short-lived ABC series was the product of thirtysomething producers Edward Zwick and Marshall Herskovitz The series ran from 1996-1997; it was canceled after 17 episodes due to low ratings.", "rate": 90, "genre": ["Drama"], "cast": ["Kimberly Williams-Paisley", "David Conrad", "Poppy Montgomery", "Lisa Edelstein", "Adam Goldberg"], "character": ["Isabel Lukens", "Leo Roth", "Jennifer Lukens", "Rhonda Roth", "Doug"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2279   Expand Relativity   (1996) User Score Overview Relativity is an American drama television series which followed a twenty-something couple, Isabel Lukens and Leo Roth, and the lives and loves of their friends and siblings in Los Angeles. The short-lived ABC series was the product of thirtysomething producers Edward Zwick and Marshall Herskovitz The series ran from 1996-1997; it was canceled after 17 episodes due to low ratings. Featured Crew Jason Katims Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kimberly Williams-Paisley Isabel Lukens David Conrad Leo Roth Poppy Montgomery Jennifer Lukens Lisa Edelstein Rhonda Roth Adam Goldberg Doug Full Cast & Crew Last Season Season 1 1996 | 16 Episodes Season 1 of Relativity premiered on September 24, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Relativity. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords los angeles twenty something Content Score 79 Pump it up! We're close now. Top Contributors 15 Banana 2 sarahleeab S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}