{"link": "https://www.themoviedb.org/tv/43276?language=en", "title": "Beet the Vandel Buster", "resume": "Beet the Vandel Buster is a manga and anime series written by Riku Sanjo and illustrated by Koji Inada.\nThe manga was published in Shueisha's Monthly Shōnen Jump in Japan until the illustrator Inada became ill. The magazine later ceased publication leaving the future of the manga unknown at this time. VIZ Media publishes the manga in English. The anime was produced by Toei Animation and was aired on TV Tokyo. The anime had 52 episodes and the sequel Beet the Vandel Buster Excellion had 25 episodes. The anime has been licensed in North America by Illumitoon Entertainment, they released one DVD containing 4 episodes with an English dub track, but there is still no word as of this day if there will be any further releases, or if the anime is going to be shown in North America again.\nThe story takes place in a fantasy world where humans have been suffering from the attacks of the demon-like Vandels. Humans can fight back by becoming a Vandel Buster, a paid monster and Vandel assassin. The protagonist of the story, Beet, is a young boy who becomes a Vandel Buster to be like his heroes, the Zenon Warriors.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Toshio Furukawa", "Unsho Ishizuka", "Hikaru Midorikawa", "Reiko Kiuchi", "Ai Maeda"], "character": ["Raio", "Bertoz", "Zenon", "Beet", "Poala"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43276   Expand Beet the Vandel Buster   (2005) User Score Overview Beet the Vandel Buster is a manga and anime series written by Riku Sanjo and illustrated by Koji Inada. The manga was published in Shueisha's Monthly Shōnen Jump in Japan until the illustrator Inada became ill. The magazine later ceased publication leaving the future of the manga unknown at this time. VIZ Media publishes the manga in English. The anime was produced by Toei Animation and was aired on TV Tokyo. The anime had 52 episodes and the sequel Beet the Vandel Buster Excellion had 25 episodes. The anime has been licensed in North America by Illumitoon Entertainment, they released one DVD containing 4 episodes with an English dub track, but there is still no word as of this day if there will be any further releases, or if the anime is going to be shown in North America again. The story takes place in a fantasy world where humans have been suffering from the attacks of the demon-like Vandels. Humans can fight back by becoming a Vandel Buster, a paid monster and Vandel assassin. The protagonist of the story, Beet, is a young boy who becomes a Vandel Buster to be like his heroes, the Zenon Warriors. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshio Furukawa Raio Unsho Ishizuka Bertoz Hikaru Midorikawa Zenon Reiko Kiuchi Beet Ai Maeda Poala Full Cast & Crew Last Season Season 1 2005 | 52 Episodes Season 1 of Beet the Vandel Buster premiered on October  6, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Beet the Vandel Buster. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tv-tokyo.co.jp/anime/beet/ Genres Animation Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}