{"link": "https://www.themoviedb.org/tv/104?language=en", "title": "The Legend of the Condor Heroes", "resume": "The Legend of the Condor Heroes is a Hong Kong television series adapted from Louis Cha's novel of the same title. It was first broadcast on TVB Jade in Hong Kong in 1983. The 59 episodes long series is divided into three parts. This 1983 version is considered by many to be a classic television adaptation of the novel and features the breakthrough role of Barbara Yung, who played Huang Rong.", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Felix Wong", "Barbara Yung", "Bobby Au-Yeung", "Kong Ngai", "Michael Miu"], "character": ["Or Chan-ngok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 104   Expand The Legend of the Condor Heroes   (1983) User Score Overview The Legend of the Condor Heroes is a Hong Kong television series adapted from Louis Cha's novel of the same title. It was first broadcast on TVB Jade in Hong Kong in 1983. The 59 episodes long series is divided into three parts. This 1983 version is considered by many to be a classic television adaptation of the novel and features the breakthrough role of Barbara Yung, who played Huang Rong. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Felix Wong Barbara Yung Bobby Au-Yeung Kong Ngai Or Chan-ngok Michael Miu Full Cast & Crew Last Season Season 3 1983 | 20 Episodes Season 3 of The Legend of the Condor Heroes premiered on June 27, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Legend of the Condor Heroes. You can help by rating TV shows you've seen. Facts Original Name  射鵰英雄傳 Status  Ended Network Certification  - Type  Scripted Original Language  Cantonese Runtime  60m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 9 thirstyhippo g 4 goldmundz t 4 taxigps  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}