{"link": "https://www.themoviedb.org/tv/75219?language=en", "title": "9-1-1", "resume": "Explore the high-pressure experiences of police officers, paramedics and firefighters who are thrust into the most frightening, shocking and heart-stopping situations. These emergency responders must try to balance saving those who are at their most vulnerable with solving the problems in their own lives.", "rate": 67, "genre": ["Drama"], "cast": ["Peter Krause", "Angela Bassett", "Connie Britton", "Oliver Stark", "Aisha Hinds"], "character": ["Bobby Nash", "Athena Grant", "Abby Clark", "Evan Buckley", "Henrietta Wilson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75219   Expand 9-1-1   (2018) User Score  Play Trailer Overview Explore the high-pressure experiences of police officers, paramedics and firefighters who are thrust into the most frightening, shocking and heart-stopping situations. These emergency responders must try to balance saving those who are at their most vulnerable with solving the problems in their own lives. Featured Crew Ryan Murphy Creator Brad Falchuk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Krause Bobby Nash Angela Bassett Athena Grant Connie Britton Abby Clark Oliver Stark Evan Buckley Aisha Hinds Henrietta Wilson Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of 9-1-1 premiered on January  3, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply 9-1-1.    Crazy drama or unintentional comedy? Open 0 by censorshipsucks06\n      \n     N What do you guys think about this? Open 8 by  censorshipsucks06 Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   2018-03-25 Trust 7.4    2017-11-02 S.W.A.T. 6.6    2018-01-21 The Resident 7.0    2018-03-09 Harrow 10.0    2017-09-25 The Good Doctor 7.9    2018-03-11 Deception 7.0    2018-03-22 Station 19 6.9    2017-09-27 SEAL Team 6.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   https://www.fox.com/9-1-1/ Genres Drama Keywords los angeles emergency first responders Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings 9 Banana 7 Gabriel W. Almeida 7 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}