{"link": "https://www.themoviedb.org/tv/62192?language=en", "title": "Barely Famous", "resume": "Introducing \"Barely Famous\": a docu-style comedy series. This show explores the hypocrisy of reality TV by centering around two sisters who say they would never do a reality show, but are being filmed by a camera crew. Over the course of the season, we’ll follow Erin and Sara as they navigate the treacherous LA waters of building a career, dating, and simultaneously trying to prove that they’re “normal”. Each episode of Barely Famous will skewer Hollywood stereotypes and comment on the world of celebrity through the eyes of two D-Listers, desperately trying to insist they don’t care about “Lists” while also trying to get on the A-List. By breaking the 4th wall and occasionally telling both the crew and network to cut, no reality convention is too sacred, and our girls point out the absurdity of the medium itself.", "rate": 57, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62192   Expand Barely Famous   (2015) User Score Overview Introducing \"Barely Famous\": a docu-style comedy series. This show explores the hypocrisy of reality TV by centering around two sisters who say they would never do a reality show, but are being filmed by a camera crew. Over the course of the season, we’ll follow Erin and Sara as they navigate the treacherous LA waters of building a career, dating, and simultaneously trying to prove that they’re “normal”. Each episode of Barely Famous will skewer Hollywood stereotypes and comment on the world of celebrity through the eyes of two D-Listers, desperately trying to insist they don’t care about “Lists” while also trying to get on the A-List. By breaking the 4th wall and occasionally telling both the crew and network to cut, no reality convention is too sacred, and our girls point out the absurdity of the medium itself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2016 | 5 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2011-07-19 Awkward. 6.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.vh1.com/shows/barely-famous/ Genres Comedy Keywords mockumentary Content Score 56 We're so close, yet so far. Top Contributors 36 Elizabeth Jennings z 5 zurman1 b 4 babibu123 R 1 Robert  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}