{"link": "https://www.themoviedb.org/tv/28223?language=en", "title": "NieA_7", "resume": "NieA_7, also known as NieA under 7, is a 13 episode anime series about Mayuko, a poor, introverted student who lives above a Japanese bathhouse, and NieA, a freeloading, freewheeling alien who lives in her closet and eats her food.\nThe series touches lightly upon issues of discrimination, stereotypes, alienation, city life vs small town life, and assimilation. Mayuko, who attends a cram school, is a young girl living away from her family and expresses a lot of melancholy. NieA, who is apparently placed in an inferior class by her fellow aliens due to being a physical minority among them, immediately accuses anyone who calls her a \"stupid no-antenna\" or the like, of discrimination. Other aliens adopt various stereotypical cultural styles, one chooses Indian dress and opens a convenience store, another chooses to associate herself with the Chinese Revolution. This theme of the outsider alien is carried through in the brief comic live-action sequence which ends each episode, \"Dalgit's Tidbit of Indian Information.\"\nNieA7 is based on a doujinshi by graphic designer Yoshitoshi ABe and published by Kadokawa Shoten. Much of NieA7's staff was made up of people who had worked on Serial Experiments Lain; it is commonly supposed that they chose to do this light-hearted series to cool off after the dark and psychologically intense Serial Experiments Lain. This idea is further supported by the character Chiaki, a UFO fanatic who shares a name with Chiaki J. Konaka, the script writer for Lain.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Eric DaRe", "Tricia Dickson", "Josh Phillips", "Casey Strand", "Akira Okamori"], "character": ["Mayuko Chigasaki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28223   Expand NieA_7   (2000) User Score Overview NieA_7, also known as NieA under 7, is a 13 episode anime series about Mayuko, a poor, introverted student who lives above a Japanese bathhouse, and NieA, a freeloading, freewheeling alien who lives in her closet and eats her food. The series touches lightly upon issues of discrimination, stereotypes, alienation, city life vs small town life, and assimilation. Mayuko, who attends a cram school, is a young girl living away from her family and expresses a lot of melancholy. NieA, who is apparently placed in an inferior class by her fellow aliens due to being a physical minority among them, immediately accuses anyone who calls her a \"stupid no-antenna\" or the like, of discrimination. Other aliens adopt various stereotypical cultural styles, one chooses Indian dress and opens a convenience store, another chooses to associate herself with the Chinese Revolution. This theme of the outsider alien is carried through in the brief comic live-action sequence which ends each episode, \"Dalgit's Tidbit of Indian Information.\" NieA7 is based on a doujinshi by graphic designer Yoshitoshi ABe and published by Kadokawa Shoten. Much of NieA7's staff was made up of people who had worked on Serial Experiments Lain; it is commonly supposed that they chose to do this light-hearted series to cool off after the dark and psychologically intense Serial Experiments Lain. This idea is further supported by the character Chiaki, a UFO fanatic who shares a name with Chiaki J. Konaka, the script writer for Lain. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric DaRe Tricia Dickson Mayuko Chigasaki Josh Phillips Casey Strand Akira Okamori Full Cast & Crew Last Season Season 1 2000 | 13 Episodes Season 1 of NieA_7 premiered on April 26, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on NieA_7. You can help by rating TV shows you've seen. Facts Original Name  ニアアンダーセブン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.madman.com.au/actions/catalogue.do?releaseId=3273&method=view Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 9 sheva_vitali J 7 JohnyB0y 7 qw0aszx p 3 perikoman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}