{"link": "https://www.themoviedb.org/tv/34828?language=en", "title": "Beyond the Heavens", "resume": "Sōten Kōro is a Japanese manga by manga artist King Gonta, adapted from an original story by Hagin Yi. It was serialized by Kodansha in the manga anthology magazine Weekly Morning from 1994 to 2005. After Hagin Yi died of cancer in September 1998, King Gonta picked up the story himself. A total of 409 chapters were published and compiled into 36 separate books. In 1998, it won the 22nd Kodansha Manga Award in the general category.\nThere are no published English translations of it, but a color art compilation book released in 2007 has the English subtitle Beyond the Heavens on the cover, suggesting that it is the accepted English translation of the title. In addition, the last chapter of the series is also titled in English Beyond the Heavens.\nIn Japan, Sōten Kōro was advertised by its publisher as \"Neo-Sangokushi\", which may be translated as \"Neo Romance of the Three Kingdoms\".\nIn April 2009, the series was made into an anime series by Madhouse.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Mamoru Miyano", "Isshin Chiba", "Nachi Nozawa", "Kikuko Inoue", "Takeshi Kusao"], "character": ["Cao Cao", "Cao Ren", "Cao Teng", "Cao Cao", "Xiahou Dun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34828   Expand Beyond the Heavens   (2009) User Score Overview Sōten Kōro is a Japanese manga by manga artist King Gonta, adapted from an original story by Hagin Yi. It was serialized by Kodansha in the manga anthology magazine Weekly Morning from 1994 to 2005. After Hagin Yi died of cancer in September 1998, King Gonta picked up the story himself. A total of 409 chapters were published and compiled into 36 separate books. In 1998, it won the 22nd Kodansha Manga Award in the general category. There are no published English translations of it, but a color art compilation book released in 2007 has the English subtitle Beyond the Heavens on the cover, suggesting that it is the accepted English translation of the title. In addition, the last chapter of the series is also titled in English Beyond the Heavens. In Japan, Sōten Kōro was advertised by its publisher as \"Neo-Sangokushi\", which may be translated as \"Neo Romance of the Three Kingdoms\". In April 2009, the series was made into an anime series by Madhouse. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamoru Miyano Cao Cao Isshin Chiba Cao Ren Nachi Nozawa Cao Teng Kikuko Inoue Cao Cao Takeshi Kusao Xiahou Dun Full Cast & Crew Last Season Souten kouro season 1 2009 | 26 Episodes Season 1 of Beyond the Heavens premiered on April  7, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Beyond the Heavens. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Beyond the Heavens. You can help by rating TV shows you've seen. Facts Original Name  蒼天航路 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 11 BrerFox s 3 sheva_vitali 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}