{"link": "https://www.themoviedb.org/tv/10247?language=en", "title": "Dan August", "resume": "Dan August is a Quinn Martin crime drama series which aired on ABC from 1970-1971. The series stars Burt Reynolds as the title character.\nReruns of Dan August aired in prime time on CBS from May to October 1973 and from April to June 1975.", "rate": 70, "genre": ["Drama"], "cast": ["Burt Reynolds", "Norman Fell", "Ned Romero"], "character": ["Det. Lt. Dan August"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10247   Expand Dan August   (1970) User Score  Play Trailer Overview Dan August is a Quinn Martin crime drama series which aired on ABC from 1970-1971. The series stars Burt Reynolds as the title character. Reruns of Dan August aired in prime time on CBS from May to October 1973 and from April to June 1975. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Burt Reynolds Det. Lt. Dan August Norman Fell Ned Romero Full Cast & Crew Last Season Season 1 1970 | 28 Episodes Season 1 of Dan August premiered on September 23, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dan August. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Drama Keywords dan august Content Score 50 Still needs a little work. Top Contributors TM 8 Teófilo Moraes Guimarães 3 Steve TB 1 TMDb Bot 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}