{"link": "https://www.themoviedb.org/tv/67640?language=en", "title": "On: Special Agent Hinako Todo", "resume": "A rookie detective is assigned to the best investigation team at the Tokyo Metropolitan Police.", "rate": 0, "genre": ["Crime"], "cast": ["Haru", "Yu Yokoyama", "Jun Kaname", "Atsuro Watabe", "Kento Hayashi"], "character": ["Hinako Todo", "Yasuhisa Shoji", "Keiichiro Kurashima", "Iwao Atsuta", "Tamotsu Nakajima"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67640   Expand On: Special Agent Hinako Todo   (2016) User Score Overview A rookie detective is assigned to the best investigation team at the Tokyo Metropolitan Police. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haru Hinako Todo Yu Yokoyama Yasuhisa Shoji Jun Kaname Keiichiro Kurashima Atsuro Watabe Iwao Atsuta Kento Hayashi Tamotsu Nakajima Full Cast & Crew Last Season Season 1 2016 | 1 Episode Season 1 of On: Special Agent Hinako Todo premiered on July 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on On: Special Agent Hinako Todo. You can help by rating TV shows you've seen. Facts Original Name  ON 異常犯罪捜査官・藤堂比奈子 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.ktv.jp/on/index.html Genres Crime Keywords detective police investigation Content Score 86 Almost there... Top Contributors 20 thirstyhippo 10 Danu r 5 rogercyk TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}