{"link": "https://www.themoviedb.org/tv/42723?language=en", "title": "Mobile Suit Victory Gundam", "resume": "Mobile Suit Victory Gundam, is a 1993 Japanese science fiction anime television series. It consists of 51 episodes, and was directed by Gundam creator Yoshiyuki Tomino. The series was first broadcast on TV Asahi and later by the anime satellite television network, Animax, across Japan and later its respective networks worldwide, including Hong Kong, Southeast Asia, East Asia, and other regions.", "rate": 0, "genre": ["Animation"], "cast": ["Emi Shinohara", "Keiichi Sonobe", "Kumiko Watanabe", "Tomokazu Seki", "Tomoyuki Dan"], "character": ["Maria Pia Armonia", "Oliver Inoe", "Katejina Loos", "Chris Royd", "Cronicle Asher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42723   Expand Mobile Suit Victory Gundam   (1993) User Score Overview Mobile Suit Victory Gundam, is a 1993 Japanese science fiction anime television series. It consists of 51 episodes, and was directed by Gundam creator Yoshiyuki Tomino. The series was first broadcast on TV Asahi and later by the anime satellite television network, Animax, across Japan and later its respective networks worldwide, including Hong Kong, Southeast Asia, East Asia, and other regions. Featured Crew Yoshiyuki Tomino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emi Shinohara Maria Pia Armonia Keiichi Sonobe Oliver Inoe Kumiko Watanabe Katejina Loos Tomokazu Seki Chris Royd Tomoyuki Dan Cronicle Asher Full Cast & Crew Last Season Season 1 1993 | 51 Episodes Season 1 of Mobile Suit Victory Gundam premiered on April  2, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Victory Gundam. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.v-gundam.net Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 4 Irresponsibletyler w 3 wyxslh h 2 heeroyuy176 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}