{"link": "https://www.themoviedb.org/tv/63439?language=en", "title": "Оттепель", "resume": "The series is set in 1961. Cameraman Viktor Khrustalyov is in a difficult situation; he is suspected of being involved in the death of his friend, talented screenwriter Kostya Parshin, who committed suicide during a drinking-bout. The authorities try to put Khrustalyov in prison by any means. Viktor needs to shoot the comedy \"The Girl and the Brigadier\" in order to get permission to make the film \"Shards\" after the wonderful scenario left from his deceased screenwriter friend. Young director Yegor Myachin wants to adаpt this screenplay. Khrustalyov arranges him as a trainee to the venerable director Krivitsky for a comedy. In the same film act Khrustalev's ex-wife Inga and his young sweetheart Maryana, with whom Yegor Myachin is also in love.", "rate": 50, "genre": ["Drama"], "cast": ["Svetlana Kolpakova", "Яна Сексте", "Нина Дворжецкая", "Yevgeni Tsyganov", "Aleksandr Yatsenko"], "character": ["Nadya Krivitskaya", "Lyusya Polynina", "Regina Markovna", "Viktor Khrustalyov", "Egor Myachin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63439   Expand Оттепель   (2013) User Score Overview The series is set in 1961. Cameraman Viktor Khrustalyov is in a difficult situation; he is suspected of being involved in the death of his friend, talented screenwriter Kostya Parshin, who committed suicide during a drinking-bout. The authorities try to put Khrustalyov in prison by any means. Viktor needs to shoot the comedy \"The Girl and the Brigadier\" in order to get permission to make the film \"Shards\" after the wonderful scenario left from his deceased screenwriter friend. Young director Yegor Myachin wants to adаpt this screenplay. Khrustalyov arranges him as a trainee to the venerable director Krivitsky for a comedy. In the same film act Khrustalev's ex-wife Inga and his young sweetheart Maryana, with whom Yegor Myachin is also in love. Featured Crew Valery Todorovsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Svetlana Kolpakova Nadya Krivitskaya Яна Сексте Lyusya Polynina Нина Дворжецкая Regina Markovna Yevgeni Tsyganov Viktor Khrustalyov Aleksandr Yatsenko Egor Myachin Full Cast & Crew Last Season Season 1 2013 | 1 Episode Season 1 of Оттепель premiered on December  2, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Оттепель. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Russian Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 21 ph07 m 16 mbbvlad 3 StrannikM TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}