{"link": "https://www.themoviedb.org/tv/2087?language=en", "title": "The Hilarious House of Frightenstein", "resume": "The Hilarious House of Frightenstein was a Canadian children's television series produced by Hamilton, Ontario's independent station CHCH-TV in 1971. It was syndicated to television stations across Canada and the United States and occasionally still appears today in some television markets. In Canada, the series is currently airing on Space, TV Land Canada, Drive-In Classics and MTV2.\nA quirky sketch comedy series that included some genuine educational content among the humor, the show's cast included Billy Van, Fishka Rais, Guy Big, Mitch Markowitz, Vincent Price, and Julius Sumner Miller. Van played most of the characters on the show.\nAll 130 episodes were made in a single nine-month span starting in 1971; the scenes with Price and Miller were all filmed within one summer.", "rate": 80, "genre": ["Comedy"], "cast": ["Billy Van", "Julius Sumner Miller", "Vincent Price", "Guy Big", "Fishka Rais"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2087   Expand The Hilarious House of Frightenstein   (1971) User Score  Play Trailer Overview The Hilarious House of Frightenstein was a Canadian children's television series produced by Hamilton, Ontario's independent station CHCH-TV in 1971. It was syndicated to television stations across Canada and the United States and occasionally still appears today in some television markets. In Canada, the series is currently airing on Space, TV Land Canada, Drive-In Classics and MTV2. A quirky sketch comedy series that included some genuine educational content among the humor, the show's cast included Billy Van, Fishka Rais, Guy Big, Mitch Markowitz, Vincent Price, and Julius Sumner Miller. Van played most of the characters on the show. All 130 episodes were made in a single nine-month span starting in 1971; the scenes with Price and Miller were all filmed within one summer. Featured Crew Billy Van Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Billy Van Julius Sumner Miller Vincent Price Guy Big Fishka Rais Full Cast & Crew Last Season Season 1 1971 | 96 Episodes Season 1 of The Hilarious House of Frightenstein premiered on January  1, 1971. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Hilarious House of Frightenstein. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Hilarious House of Frightenstein. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors TB 2 TMDb Bot 2 WmPitcher 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}