{"link": "https://www.themoviedb.org/tv/66558?language=en", "title": "Voltron: Legendary Defender", "resume": "Five unlikely teenage heroes and their flying robot lions unite to form the megapowerful Voltron and defend the universe from evil.", "rate": 74, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Jeremy Shada", "Tyler Labine", "Bex Taylor-Klaus", "Steven Yeun", "Rhys Darby"], "character": ["Lance (voice)", "Hunk (voice)", "Pidge Gunderson / Katie Holt (voice)", "Keith (voice)", "Coran (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66558   Expand Voltron: Legendary Defender   (2016) User Score  Play Trailer Overview Five unlikely teenage heroes and their flying robot lions unite to form the megapowerful Voltron and defend the universe from evil. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  5 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Shada Lance (voice) Tyler Labine Hunk (voice) Bex Taylor-Klaus Pidge Gunderson / Katie Holt (voice) Steven Yeun Keith (voice) Rhys Darby Coran (voice) Full Cast & Crew Current Season Season 6 2018 | 7 Episodes Season 6 of Voltron: Legendary Defender premiered on June 15, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Voltron: Legendary Defender. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  6 Recommendations   1994-09-03 VR Troopers 6.4    2011-09-05 Zig and Sharko 5.3    2013-03-25 Max Steel 4.8    2012-02-05 Glitter Force 6.3    2017-03-17 Julie's Greenroom 7.8    2016-06-09 New Blood 6.5    2012-09-11 The New Normal 5.2    2014-09-30 Manhattan Love Story 6.2  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  24m Homepage   https://www.netflix.com/title/80075595 Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 22 Elizabeth Jennings a 11 agus-rheiza 11 johnny2tons h 8 helmy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}