{"link": "https://www.themoviedb.org/tv/31162?language=en", "title": "Beauty's Rival in Palace", "resume": "A dramatized account of Empress Dou and how her efforts and achievements in the royal court positively influenced the reign of her husband Emperor Wen, which paved the way for the creation of the Rule of Wen and Jing. Set in Chang'an, China during the beginnings of the Han Dynasty.", "rate": 100, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Ruby Lin", "Wang Likun"], "character": ["Du Yunxi, Tian Xianglian", "Nie Shen Er / Wang Zhi Er / Concubine Qi |"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31162   Expand Beauty's Rival in Palace User Score Overview A dramatized account of Empress Dou and how her efforts and achievements in the royal court positively influenced the reign of her husband Emperor Wen, which paved the way for the creation of the Rule of Wen and Jing. Set in Chang'an, China during the beginnings of the Han Dynasty. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Ruby Lin Du Yunxi, Tian Xianglian Wang Likun Nie Shen Er / Wang Zhi Er / Concubine Qi | Full Cast & Crew  Create Episode Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Beauty's Rival in Palace. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Facts Original Name  美人心计 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://ent.sina.com.cn/f/v/mrxjvote/ Genres Drama Sci-Fi & Fantasy Keywords mei ren xin ji Content Score 56 We're so close, yet so far. Top Contributors 56 Mohammed Osama Mohamed 9 Elizabeth Jennings TB 4 TMDb Bot 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}