{"link": "https://www.themoviedb.org/tv/33002?language=en", "title": "Mongrels", "resume": "Mongrels, formerly known under the working titles of We Are Mongrels and The Un-Natural World, is a British puppet-based situation comedy series first broadcast on BBC Three between 22 June and 10 August 2010, with a making-of documentary entitled \"Mongrels Uncovered\" broadcast on 11 August 2010. A second series of Mongrels began airing on 7 November 2011.\nThe series revolves around the lives of five anthropomorphic animals who hang around the back of a pub in Millwall, the Isle of Dogs, London. The characters are Nelson, a metrosexual fox; Destiny, an Afghan hound; Marion, a \"borderline-retarded\" cat; Kali, a grudge-bearing pigeon; and Vince, Nelson's friend, a sociopathic foul-mouthed fox.\nThe show is aimed at an adult audience, features \"neutering, incontinence, cannibalism and catnip overdoses\" and humour styles such as slapstick and farce. For example, the first episode begins with a scene in which Marion, portrayed as desperately trying to revive his deceased owner, learns she has actually been dead for four months, whereupon he casually gives his cat friends permission to eat her. Mongrels has attracted accusations of plagiarism, with claims that Mongrels stole ideas from a similar Channel 4 show called Pets.", "rate": 75, "genre": ["Comedy"], "cast": ["Rufus Jones", "Tony Way", "Paul Kaye", "Lucy Montgomery", "Katy Brand"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33002   Expand Mongrels   (2010) User Score Overview Mongrels, formerly known under the working titles of We Are Mongrels and The Un-Natural World, is a British puppet-based situation comedy series first broadcast on BBC Three between 22 June and 10 August 2010, with a making-of documentary entitled \"Mongrels Uncovered\" broadcast on 11 August 2010. A second series of Mongrels began airing on 7 November 2011. The series revolves around the lives of five anthropomorphic animals who hang around the back of a pub in Millwall, the Isle of Dogs, London. The characters are Nelson, a metrosexual fox; Destiny, an Afghan hound; Marion, a \"borderline-retarded\" cat; Kali, a grudge-bearing pigeon; and Vince, Nelson's friend, a sociopathic foul-mouthed fox. The show is aimed at an adult audience, features \"neutering, incontinence, cannibalism and catnip overdoses\" and humour styles such as slapstick and farce. For example, the first episode begins with a scene in which Marion, portrayed as desperately trying to revive his deceased owner, learns she has actually been dead for four months, whereupon he casually gives his cat friends permission to eat her. Mongrels has attracted accusations of plagiarism, with claims that Mongrels stole ideas from a similar Channel 4 show called Pets. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rufus Jones Tony Way Paul Kaye Lucy Montgomery Katy Brand Full Cast & Crew Last Season Season 2 2011 | 9 Episodes Season 2 of Mongrels premiered on November  7, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mongrels. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  28m Homepage   http://www.bbc.co.uk/programmes/b00swyx1 Genres Comedy Keywords london england puppet vulgarity dark humor swearing sitcom british humour Content Score 86 Almost there... Top Contributors a 8 alexmate O 3 Ozbourne 3 Elizabeth Jennings 2 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}