{"link": "https://www.themoviedb.org/tv/73116?language=en", "title": "Blind Date", "resume": "The chinese version of the popular argentinian drama \"Ciega a Citas\" about modern love and romance with Jiang Xin and Lu Yi. Jiang Xin plays a young woman, who is still single. Her sister is about to be married and one day Jiang Xin overhears her mother talking to her sister, that if she will come to the marriage of her sister with a boyfriend, her mother will pay for the marriage. Jiang Xin has 258 days to find a boyfriend, in order to score off her bothersome mother and to enable her sister a wonderful marriage. Lu Yi plays her counterpart in this fresh and romantic drama.", "rate": 30, "genre": ["Family", "Drama"], "cast": ["Jiang Xin", "Lu Yi"], "character": ["Xia Tian", "Yang Shuo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73116   Expand Blind Date   (2017) User Score Overview The chinese version of the popular argentinian drama \"Ciega a Citas\" about modern love and romance with Jiang Xin and Lu Yi. Jiang Xin plays a young woman, who is still single. Her sister is about to be married and one day Jiang Xin overhears her mother talking to her sister, that if she will come to the marriage of her sister with a boyfriend, her mother will pay for the marriage. Jiang Xin has 258 days to find a boyfriend, in order to score off her bothersome mother and to enable her sister a wonderful marriage. Lu Yi plays her counterpart in this fresh and romantic drama. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jiang Xin Xia Tian Lu Yi Yang Shuo Full Cast & Crew Last Season Season 1 2017 | 1 Episode Season 1 of Blind Date premiered on August 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blind Date. You can help by rating TV shows you've seen. Facts Original Name  盲约 Status  Returning Series Network Zhejiang Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/dsjmangyue?is_hot=1 Genres Family Drama Keywords china romance Content Score 56 We're so close, yet so far. Top Contributors M 21 Maria180493 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}