{"link": "https://www.themoviedb.org/tv/6095?language=en", "title": "Virtual Murder", "resume": "John Cornelius (called JC) is a university don who also works for his city police force as a consultant psychologist. Samantha Valentine is his offbeat personal assistant and lover, while Inspector Cadogan is their police contact and Professor Owen Griffiths is Cornelius's head of department.", "rate": 70, "genre": ["Mystery", "Drama"], "cast": ["Nicholas Clay", "Kim Thomson", "Stephen Yardley", "Jude Akuwudike", "Alan David"], "character": ["Dr. John Cornelius", "Samantha Valentine", "Inspector Cadogan", "Sergeant Gummer", "Professor Owen Griffiths"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6095   Expand Virtual Murder   (1992) User Score Overview John Cornelius (called JC) is a university don who also works for his city police force as a consultant psychologist. Samantha Valentine is his offbeat personal assistant and lover, while Inspector Cadogan is their police contact and Professor Owen Griffiths is Cornelius's head of department. Featured Crew Harry Robertson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Clay Dr. John Cornelius Kim Thomson Samantha Valentine Stephen Yardley Inspector Cadogan Jude Akuwudike Sergeant Gummer Alan David Professor Owen Griffiths Full Cast & Crew Last Season Season 1 1992 | 6 Episodes Season 1 of Virtual Murder premiered on July 24, 1992. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Virtual Murder. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Virtual Murder. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Mystery Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 13 Markxist 7 Marr 🇳🇱 R 5 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}