{"link": "https://www.themoviedb.org/tv/42509?language=en", "title": "Steins;Gate", "resume": "A group of friends have customized their microwave so that it can send text messages to the past. As they perform different experiments, an organization named SERN who has been doing their own research on time travel tracks them down and now the characters have to find a way to avoid being captured by them.", "rate": 82, "genre": ["Action", "Adventure", "Animation", "Mystery", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42509   Expand Steins;Gate   (2011) User Score  Play Trailer Overview A group of friends have customized their microwave so that it can send text messages to the past. As they perform different experiments, an organization named SERN who has been doing their own research on time travel tracks them down and now the characters have to find a way to avoid being captured by them. Featured Crew Yomi Sarachi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  10 Posters  10 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2 2018 | 8 Episodes Season 2 of Steins;Gate premiered on April 11, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Steins;Gate. Login to be first! Go to Discussions Media Most Popular Videos  3 Backdrops  10 Posters  10 Recommendations   2007-04-01 Gurren Lagann 7.9    2006-10-05 Code Geass: Lelouch of the Rebellion 8.1    2009-04-05 Fullmetal Alchemist: Brotherhood 8.3    2012-10-12 Psycho-Pass 7.7    1995-10-04 Neon Genesis Evangelion 8.0    2006-10-04 Death Note 8.2    2015-01-10 Death Parade 7.3    2011-10-02 Hunter x Hunter 8.5  Facts Original Name  シュタインズ・ゲート Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.funimation.com/shows/steins-gate/home Genres Action & Adventure Animation Mystery Sci-Fi & Fantasy Keywords time travel conspiracy anime based on visual novel Content Score 71 Just a little bit more... Top Contributors 33 WillofOwn CM 15 Cherche Moi 11 sp1ti 9 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}