{"link": "https://www.themoviedb.org/tv/2510?language=en", "title": "Saxondale", "resume": "Steve Coogan plays Tommy Saxondale: an ex-roadie with anger management issues and a pest-control business. Tommy is a little arrogant, a little egotistical and feels the world owes him more respect than it typically shows him. He has an assistant named Raymond who lives in a spare room in Tommy's house, a live-in girlfriend named Magz who owns a T-shirt business, and a receptionist named Vicky who has a tendency to drive him up the wall.", "rate": 82, "genre": ["Comedy"], "cast": ["Steve Coogan", "Ruth Jones", "Rasmus Hardiker", "Morwenna Banks", "James Bachman"], "character": ["Tommy Saxondale", "Magz", "Raymond", "Vicky", "Alistair"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2510   Expand Saxondale   (2006) User Score Overview Steve Coogan plays Tommy Saxondale: an ex-roadie with anger management issues and a pest-control business. Tommy is a little arrogant, a little egotistical and feels the world owes him more respect than it typically shows him. He has an assistant named Raymond who lives in a spare room in Tommy's house, a live-in girlfriend named Magz who owns a T-shirt business, and a receptionist named Vicky who has a tendency to drive him up the wall. Featured Crew Steve Coogan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Coogan Tommy Saxondale Ruth Jones Magz Rasmus Hardiker Raymond Morwenna Banks Vicky James Bachman Alistair Full Cast & Crew Last Season Season 2 2007 | 6 Episodes Season 2 of Saxondale premiered on August 23, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1994-01-19 The Day Today 8.3    1973-11-12 Last of the Summer Wine 6.5    1994-09-16 Knowing Me Knowing You with Alan Partridge 7.5    2006-10-06 Not Going Out 7.8    2001-01-14 Phoenix Nights 8.2    2015-04-29 Peter Kay's Car Share 7.5    1976-02-20 Open All Hours 7.7    1962-01-04 Steptoe and Son 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/saxondale/ Genres Comedy Keywords rock 1970s middle class anti conformity roadie suburb pest control baby boomer Content Score 93 Almost there... Top Contributors 21 Markxist O 5 Ozbourne R 4 Rebecca m 3 morrison  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}