{"link": "https://www.themoviedb.org/tv/61865?language=en", "title": "When Calls The Heart", "resume": "Elizabeth Thatcher, a young school teacher from a wealthy Eastern family, migrates from the big city to teach school in a small coal mining town in the west.", "rate": 81, "genre": ["Drama"], "cast": ["Erin Krakow", "Daniel Lissing", "Mark Cummins", "Lori Loughlin", "Loretta Walsh"], "character": ["Elizabeth Thatcher", "Jack Thornton", "Henry Gowen", "Abigail Stanton", "Florence Blakeley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61865   Expand When Calls The Heart   (2014) User Score  Play Trailer Overview Elizabeth Thatcher, a young school teacher from a wealthy Eastern family, migrates from the big city to teach school in a small coal mining town in the west. Featured Crew Michael Landon Jr. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  7 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erin Krakow Elizabeth Thatcher Daniel Lissing Jack Thornton Mark Cummins Henry Gowen Lori Loughlin Abigail Stanton Loretta Walsh Florence Blakeley Full Cast & Crew Current Season Season 5 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Elizabeth: Happy Birthday Erin Krakow! Open 1 by  Zack37 b Intro music Open 5 by  TrentTX Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  5 Recommendations   2015-09-08 Apaches 7.3    2016-07-05 Fangbone! 6.7    2011-09-05 Zig and Sharko 5.3    2017-09-20 Tiempos de guerra 7.0    2016-12-08 The Cuba Libre Story 7.7    2017-01-30 Bonus Family 8.5    2013-03-25 Max Steel 4.8    2012-02-05 Glitter Force 6.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.hallmarkchannel.com/when-calls-the-heart Genres Drama Keywords teacher Content Score 100 Yes! Looking good! Top Contributors 79 Elizabeth Jennings k 13 khedron 6 CouchTater TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}