{"link": "https://www.themoviedb.org/tv/57267?language=en", "title": "Who Are You?", "resume": "Detective Yang Shi-ohn wakes up from a six-year coma. She gets reassigned to the lost and found department, where she discovers that she's gained the supernatural ability to see ghosts connected to the objects left behind there. Along with her new partner, rookie cop Cha Gun-woo who's a hotheaded skeptic, Shi-ohn uses the information to solve cold cases. Gun-woo only believes in tangible things he can see, hear and touch, but he gradually comes to trust Shi-ohn, and together, the bickering partners help the spirits fulfill their dying wishes and unfinished business before passing on to the afterlife.\nOne of the ghosts watching over Shi-ohn is her ex-boyfriend Lee Hyung-joon, another detective who died that night six years ago when Shi-ohn received the serious head injury that nearly killed her and left her comatose. They were working on a big case together, but Shi-ohn has no memory of what happened that fateful night.", "rate": 0, "genre": ["Horror", "Mystery", "Romance"], "cast": ["So Yi-hyun", "Ok Taec-yeon", "Kim Jae-wook", "Kim Chang-wan", "Kim Ye-won"], "character": ["Yang Shi-ohn", "Cha Gun-woo", "Lee Hyung-joon", "Choi Moon-shik", "Jang Hee-bin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57267   Expand Who Are You?   (2013) User Score Overview Detective Yang Shi-ohn wakes up from a six-year coma. She gets reassigned to the lost and found department, where she discovers that she's gained the supernatural ability to see ghosts connected to the objects left behind there. Along with her new partner, rookie cop Cha Gun-woo who's a hotheaded skeptic, Shi-ohn uses the information to solve cold cases. Gun-woo only believes in tangible things he can see, hear and touch, but he gradually comes to trust Shi-ohn, and together, the bickering partners help the spirits fulfill their dying wishes and unfinished business before passing on to the afterlife. One of the ghosts watching over Shi-ohn is her ex-boyfriend Lee Hyung-joon, another detective who died that night six years ago when Shi-ohn received the serious head injury that nearly killed her and left her comatose. They were working on a big case together, but Shi-ohn has no memory of what happened that fateful night. Featured Crew Jo Hyun Tak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast So Yi-hyun Yang Shi-ohn Ok Taec-yeon Cha Gun-woo Kim Jae-wook Lee Hyung-joon Kim Chang-wan Choi Moon-shik Kim Ye-won Jang Hee-bin Full Cast & Crew Last Season Season 1 2013 | 16 Episodes Season 1 of Who Are You? premiered on July 29, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Who Are You?. You can help by rating TV shows you've seen. Facts Original Name  후아유 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/whoareyou Genres Horror Mystery Romance Keywords korea Content Score 93 Almost there... Top Contributors t 34 tmdb38202327 z 5 zurman1 4 andermairena N 3 Nosirus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}