{"link": "https://www.themoviedb.org/tv/59124?language=en", "title": "Outback Truckers", "resume": "Jump in the cab with some of the men and women behind the wheel of monster road trains and reveals what life is really like on the wide-open road. Highly dramatic, often humorous, Outback Truckers reveals the true blue heart and soul of Aussie trucking.", "rate": 70, "genre": ["Reality"], "cast": ["Luke Hewitt"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59124   Expand Outback Truckers   (2012) User Score Overview Jump in the cab with some of the men and women behind the wheel of monster road trains and reveals what life is really like on the wide-open road. Highly dramatic, often humorous, Outback Truckers reveals the true blue heart and soul of Aussie trucking. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Hewitt Himself - Narrator Full Cast & Crew Current Season Season 6 2018 | 8 Episodes Season 6 of Outback Truckers premiered on May  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Outback Truckers. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  44m, 52m Homepage   http://au.tv.yahoo.com/plus7/outback-truckers/ Genres Reality Keywords truck driver australian outback Content Score 56 We're so close, yet so far. Top Contributors 79 United600 9 waaw TB 1 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}