{"link": "https://www.themoviedb.org/tv/39981?language=en", "title": "Digimon Adventure 02", "resume": "Digimon Adventure 02, commonly referred to as Digimon Zero Two and known as the second season of Digimon: Digital Monsters outside of Japan, is a children's television anime series produced by Toei Animation. It is the second series in the Digimon franchise, which takes place three years following the events of the previous season, Digimon Adventure. The series aired in Japan between April 2, 2000, and March 25, 2001. An English language dub produced by Saban Entertainment aired in North America between August 19, 2000, and May 19, 2001. It was succeeded by Digimon Tamers, which takes place in its own timeline.", "rate": 67, "genre": ["Animation", "Action", "Adventure", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39981   Expand Digimon Adventure 02 User Score Overview Digimon Adventure 02, commonly referred to as Digimon Zero Two and known as the second season of Digimon: Digital Monsters outside of Japan, is a children's television anime series produced by Toei Animation. It is the second series in the Digimon franchise, which takes place three years following the events of the previous season, Digimon Adventure. The series aired in Japan between April 2, 2000, and March 25, 2001. An English language dub produced by Saban Entertainment aired in North America between August 19, 2000, and May 19, 2001. It was succeeded by Digimon Tamers, which takes place in its own timeline. Featured Crew Hiroyuki Kakudou Creator Akiyoshi Hongo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  20m Homepage  - Genres Animation Action & Adventure Drama Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors x 12 xXWeresXx 5 Cuerdas m 3 moviedbmailinator TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}