{"link": "https://www.themoviedb.org/tv/2005?language=en", "title": "The New Adventures of Winnie the Pooh", "resume": "The New Adventures of Winnie the Pooh is an American animated children's television series produced by Walt Disney Television that ran from 1988 to 1991, inspired by A. A. Milne's Winnie-the-Pooh stories. It has been released on VHS and DVD.", "rate": 70, "genre": ["Family", "Animation", "Comedy"], "cast": ["John Fiedler", "Jim Cummings", "Ken Sansom", "Michael Gough", "Peter Cullen"], "character": ["Piglet (voice)", "Winnie-the-Pooh / Tigger (voice)", "Rabbit (voice)", "Gopher (voice)", "Eeyore (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2005   Expand The New Adventures of Winnie the Pooh   (1988) User Score Overview The New Adventures of Winnie the Pooh is an American animated children's television series produced by Walt Disney Television that ran from 1988 to 1991, inspired by A. A. Milne's Winnie-the-Pooh stories. It has been released on VHS and DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Fiedler Piglet (voice) Jim Cummings Winnie-the-Pooh / Tigger (voice) Ken Sansom Rabbit (voice) Michael Gough Gopher (voice) Peter Cullen Eeyore (voice) Full Cast & Crew Last Season Season 4 1991 | 11 Episodes Season 4 of The New Adventures of Winnie the Pooh premiered on September 14, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations   1997-09-13 101 Dalmatians: The Series 7.0    2002-09-20 What I Like About You 5.3    2011-09-21 The X Factor 4.4    1993-09-06 Adventures of Sonic the Hedgehog 4.9    1958-10-02 The Huckleberry Hound Show 7.0    2016-11-04 The Crown 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m, 23m Homepage   http://disney.go.com/disneyjunior/winnie-the-pooh Genres Family Animation Comedy Keywords winnie the pooh Content Score 86 Almost there... Top Contributors 45 Banana n 5 naggarok k 4 krzysiekj T 4 Tonza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}