{"link": "https://www.themoviedb.org/tv/63155?language=en", "title": "The Covenant", "resume": "The story of the Covenant (العهد) unfolds in a fantasy world in an unset time and place, in an atmosphere of excitement, crime, horror and drama blended with magic and fantasy. The story of 3 small neighbouring villages and the struggles among the members of Aldiabh family to gain control over the villages and the Covenant which sets the rules of the land. The Family do not hesitate at anything in order to reach their goals, lying, ploting, stealing and even killing the people closest to them.", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Salwa Khattab", "Sherine Reda", "Ghada Adel", "Asser Yasine"], "character": ["Zoomar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63155   Expand The Covenant    (2015) User Score Overview The story of the Covenant (العهد) unfolds in a fantasy world in an unset time and place, in an atmosphere of excitement, crime, horror and drama blended with magic and fantasy. The story of 3 small neighbouring villages and the struggles among the members of Aldiabh family to gain control over the villages and the Covenant which sets the rules of the land. The Family do not hesitate at anything in order to reach their goals, lying, ploting, stealing and even killing the people closest to them. Featured Crew Khaled Marei Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Salwa Khattab Sherine Reda Zoomar Ghada Adel Asser Yasine Full Cast & Crew Last Season Season 1 2015 | 1 Episode Season 1 of The Covenant  premiered on June 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Covenant . You can help by rating TV shows you've seen. Facts Original Name  العهد Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Arabic Runtime  45m Homepage  - Genres Drama Sci-Fi & Fantasy Action & Adventure Keywords egypt Content Score 93 Almost there... Top Contributors m 34 mohd.j.madan 14 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}