{"link": "https://www.themoviedb.org/tv/46539?language=en", "title": "Miss Rose", "resume": "Luo Si Yi seeks out the obligatory services of Lily, a local fortune teller, but when she receives her fortune she’s unwilling to accept the mystical decree that she’s doomed to be a spinster for life. Si Yi wagers that she’ll get married within a year, and if she wins, Lily must pole dance at her wedding. But should Si Yi fail, she’ll truly make a fortune teller out of Lily: Si Yi will pay her one million dollars. Gussied up for the dating circuit, Si Yi soon finds she’s got a challenge in balancing romance with the demands of her boss Gao Cheng Kuan. Is Cheng Kuang just another cosmic obstacle for Si Yi to overcome, or a blessing in disguise?", "rate": 50, "genre": ["Drama"], "cast": ["Roy Chiu", "Megan Lai", "Paul Hsu", "Tia Li", "Puff Kuo"], "character": ["Gao Cheng Kuan", "Luo Si Yi", "Guan Sheng Jun", "Zhong Xiao Ke", "Jiang Wei An"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46539   Expand Miss Rose   (2012) User Score Overview Luo Si Yi seeks out the obligatory services of Lily, a local fortune teller, but when she receives her fortune she’s unwilling to accept the mystical decree that she’s doomed to be a spinster for life. Si Yi wagers that she’ll get married within a year, and if she wins, Lily must pole dance at her wedding. But should Si Yi fail, she’ll truly make a fortune teller out of Lily: Si Yi will pay her one million dollars. Gussied up for the dating circuit, Si Yi soon finds she’s got a challenge in balancing romance with the demands of her boss Gao Cheng Kuan. Is Cheng Kuang just another cosmic obstacle for Si Yi to overcome, or a blessing in disguise? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roy Chiu Gao Cheng Kuan Megan Lai Luo Si Yi Paul Hsu Guan Sheng Jun Tia Li Zhong Xiao Ke Puff Kuo Jiang Wei An Full Cast & Crew Last Season Season 1 2012 | 35 Episodes Season 1 of Miss Rose premiered on July 22, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Miss Rose. You can help by rating TV shows you've seen. Facts Status  Ended Networks TTV Main Channel Sanlih E-Television Certification  - Type  Scripted Original Language  Chinese Runtime  70m Homepage   http://www.ttv.com.tw/drama12/missrose/ Genres Drama Keywords romance taiwan Content Score 86 Almost there... Top Contributors M 32 Maria180493 5 mariilakorn21 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}