{"link": "https://www.themoviedb.org/tv/71266?language=en", "title": "The Real Story with Maria Elena Salinas", "resume": "Investigative journalist Maria Elena Salinas peels back the layers of national headline-making crimes in search of new evidence, unheard perspectives, and updates to the cases.", "rate": 5, "genre": ["Documentary"], "cast": ["María Elena Salinas"], "character": ["Herself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71266   Expand The Real Story with Maria Elena Salinas   (2017) User Score  Play Trailer Overview Investigative journalist Maria Elena Salinas peels back the layers of national headline-making crimes in search of new evidence, unheard perspectives, and updates to the cases. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast María Elena Salinas Herself - Host Full Cast & Crew Current Season Season 2 2018 | 5 Episodes Season 2 of The Real Story with Maria Elena Salinas premiered on June  4, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply A Mother's story and serial killer, Felix Vail Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Real Story with Maria Elena Salinas. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  60m Homepage   https://www.investigationdiscovery.com/tv-shows/the-real-story-with-maria-elena-salinas/ Genres Documentary Keywords newsmagazine Content Score 64 We're so close, yet so far. Top Contributors 25 Elizabeth Jennings 2 Alexandria TB 1 TMDb Bot m 1 melly_indriani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}