{"link": "https://www.themoviedb.org/tv/26201?language=en", "title": "Air", "resume": "Yukito Kunisaki is on a journey in search of the Winged Maiden who was bound to the sky centuries ago, after hearing an old childhood tale from his mother. As Yukito shows his puppet show to people in an attempt to make some money, he finds himself in a small town in which he did not expect to stay very long. However, when he meets an unusual girl named Misuzu, things take a drastic turn as he is invited to stay with her.\nBy staying in the quaint town, Yukito soon becomes friends with the locals. As he gets to know them better, he learns of their problems and decides to help, putting his search for the Winged Maiden on hold. With his search on hold, and his growing attachment to Misuzu and the small town, will Yukito ever find the Winged Maiden, or is she closer than he thought?\n[Written by MAL Rewrite]", "rate": 69, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Nobutoshi Canna", "Kikuko Inoue", "Daisuke Ono", "Aya Hisakawa", "Ryoka Yuzuki"], "character": ["Yukito Kunisaki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26201   Expand Air   (2005) User Score Overview Yukito Kunisaki is on a journey in search of the Winged Maiden who was bound to the sky centuries ago, after hearing an old childhood tale from his mother. As Yukito shows his puppet show to people in an attempt to make some money, he finds himself in a small town in which he did not expect to stay very long. However, when he meets an unusual girl named Misuzu, things take a drastic turn as he is invited to stay with her. By staying in the quaint town, Yukito soon becomes friends with the locals. As he gets to know them better, he learns of their problems and decides to help, putting his search for the Winged Maiden on hold. With his search on hold, and his growing attachment to Misuzu and the small town, will Yukito ever find the Winged Maiden, or is she closer than he thought? [Written by MAL Rewrite] Featured Crew Yukimaru Katsura Creator KEY Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nobutoshi Canna Kikuko Inoue Daisuke Ono Yukito Kunisaki Aya Hisakawa Ryoka Yuzuki Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of Air premiered on January  6, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2012-07-05 Good Luck Girl! 8.0    2005-01-06 Ah! My Goddess: Flights of Fancy 9.5    2014-10-06 When Supernatural Battles Became Commonplace 8.3    2006-04-06 xxxHOLiC 7.7    2014-10-06 Amagi Brilliant Park 7.8    2011-01-08 Freezing 7.4    2002-04-02 Chobits 6.9    2012-07-06 Aesthetica of a Rogue Hero 7.1  Facts Original Name  AIR Status  Ended Network BS-i Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tbs.co.jp/anime/air/ Genres Animation Drama Sci-Fi & Fantasy Keywords supernatural romance tragedy anime bishojo Content Score 93 Almost there... Top Contributors Z 22 Zayrus 16 CrewMdk G 11 Giaten 10 Axeshizzle  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}