{"link": "https://www.themoviedb.org/tv/3186?language=en", "title": "Bombshell", "resume": "Jenna Marston (Zöe Lucker) is an ambitious and committed Army Captain who's nursing a big secret... she's having an affair with her boss, Major Nick Welling (Jeremy Sheffield). It's an affair that could cost them the careers they love, but their passion proves impossible to suppress.\nBack on the parade ground, equal opportunity law means that the British Army now has to open its doors to 'all sorts' and Nick and Jenna find themselves managing a rag tag of raw recruits. The task of turning social misfits into a crack fighting team, ready for deployment in war zones around the world, is one that takes determination and grit.\nJust as Bad Girls opened the doors into the closed world of a women's prison, Bombshell lifts the lid on the British Army - a hierarchical world where men and women are thrust together, living on the edge - trained and prepared to kill...", "rate": 65, "genre": ["Drama"], "cast": ["Alicya Eyo", "Zöe Lucker", "Jeremy Sheffield", "Chris Geere", "Robert Beck"], "character": ["Gunner Gaynor Harvey", "Jenna Marston", "Major Nicholas Welling", "Gunner Dean McGowan", "Bombardier Boyd Billington"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3186   Expand Bombshell   (2006) User Score Overview Jenna Marston (Zöe Lucker) is an ambitious and committed Army Captain who's nursing a big secret... she's having an affair with her boss, Major Nick Welling (Jeremy Sheffield). It's an affair that could cost them the careers they love, but their passion proves impossible to suppress. Back on the parade ground, equal opportunity law means that the British Army now has to open its doors to 'all sorts' and Nick and Jenna find themselves managing a rag tag of raw recruits. The task of turning social misfits into a crack fighting team, ready for deployment in war zones around the world, is one that takes determination and grit. Just as Bad Girls opened the doors into the closed world of a women's prison, Bombshell lifts the lid on the British Army - a hierarchical world where men and women are thrust together, living on the edge - trained and prepared to kill... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alicya Eyo Gunner Gaynor Harvey Zöe Lucker Jenna Marston Jeremy Sheffield Major Nicholas Welling Chris Geere Gunner Dean McGowan Robert Beck Bombardier Boyd Billington Full Cast & Crew Last Season Season 1 2005 | 7 Episodes Season 1 of Bombshell premiered on June  2, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bombshell. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords army affair Content Score 71 Just a little bit more... Top Contributors F 15 Fiona TB 2 TMDb Bot O 2 Ozbourne S 2 Sandor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}