{"link": "https://www.themoviedb.org/tv/74900?language=en", "title": "Schlag den Henssler", "resume": "Schlag den Henssler is a live game show airing on the German television channel ProSieben on Saturday evenings. A candidate who can beat Steffen Henssler in a number of disciplines wins the jackpot.", "rate": 0, "genre": ["Reality"], "cast": ["Steffen Henssler", "Elton", "Elmar Paulke"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74900   Expand Schlag den Henssler   (2017) User Score Overview Schlag den Henssler is a live game show airing on the German television channel ProSieben on Saturday evenings. A candidate who can beat Steffen Henssler in a number of disciplines wins the jackpot. Featured Crew Stefan Raab Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steffen Henssler Elton Elmar Paulke Full Cast & Crew Current Season Season 2 2018 | 2 Episodes Season 2 of Schlag den Henssler premiered on March 27, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Schlag den Henssler. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Schlag den Henssler. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  German Runtime  282m Homepage   https://www.prosieben.de/tv/schlag-den-henssler/ Genres Reality Keywords game show Content Score 64 We're so close, yet so far. Top Contributors r 22 recen 19 trvz 4 martinr92 S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}