{"link": "https://www.themoviedb.org/tv/60862?language=en", "title": "JoJo's Bizarre Adventure", "resume": "Based on the long-running manga by Hirohiko Araki, the first OVA series follows Josef Joestar and his 17-year-old grandson Jotaro as they attempt to finish the family blood feud against the immortal vampire Dio. Josef and Jotaro have gathered several mystical warriors each with powers representing one card from The Stand (a variation of Tarot cards), with Jotaro having powers over the strongest Stand - the Star Platinum. Dio himself has gathered Stand warriors and together they face off for the sake of Jotaro's mother Holly and domination of the world.", "rate": 50, "genre": ["Fantasy", "Animation", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60862   Expand JoJo's Bizarre Adventure   (1993) User Score Overview Based on the long-running manga by Hirohiko Araki, the first OVA series follows Josef Joestar and his 17-year-old grandson Jotaro as they attempt to finish the family blood feud against the immortal vampire Dio. Josef and Jotaro have gathered several mystical warriors each with powers representing one card from The Stand (a variation of Tarot cards), with Jotaro having powers over the strongest Stand - the Star Platinum. Dio himself has gathered Stand warriors and together they face off for the sake of Jotaro's mother Holly and domination of the world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2000 | 7 Episodes Season 2 of JoJo's Bizarre Adventure premiered on May  5, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2012-10-06 JoJo's Bizarre Adventure 7.1  Facts Original Name  ジョジョの奇妙な冒険 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Fantasy Animation Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 27 Elizabeth Jennings 5 Renato t 5 tmdb983464 4 benf45  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}