{"link": "https://www.themoviedb.org/tv/10150?language=en", "title": "Lance et Compte", "resume": "Lance et Compte is a series of Quebec téléromans revolving around a Quebec City ice hockey team. The series aired from 1986 to 1989 on the Radio-Canada network, and revival series on TQS in 2001 and on TVA from 2004 to the present.\nThe first season was filmed in both French and English, the English version appearing on CBC Television as He Shoots, He Scores. It was the first television series to air simultaneously in English on CBC and in French on Radio-Canada.\nThe series was scripted by Réjean Tremblay and Louis Caron for the first season, and by Tremblay and Jacques Jacob after that. Following the end of the regular series, a number of television movies continued to air into the 1990s. A new generation of the series started to air in 2001 and a movie was made in 2010.", "rate": 0, "genre": ["Drama"], "cast": ["Lise Martin", "Dave Morissette", "Sarah Dagenais-Hakim", "Sébastien Delorme", "Jason Roy-Léveillée"], "character": ["Kim Legendre", "Philippe Lalumière", "Ilsa Trépanier", "Roma Gauthier", "Guy Lambert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10150   Expand Lance et Compte   (1986) User Score Overview Lance et Compte is a series of Quebec téléromans revolving around a Quebec City ice hockey team. The series aired from 1986 to 1989 on the Radio-Canada network, and revival series on TQS in 2001 and on TVA from 2004 to the present. The first season was filmed in both French and English, the English version appearing on CBC Television as He Shoots, He Scores. It was the first television series to air simultaneously in English on CBC and in French on Radio-Canada. The series was scripted by Réjean Tremblay and Louis Caron for the first season, and by Tremblay and Jacques Jacob after that. Following the end of the regular series, a number of television movies continued to air into the 1990s. A new generation of the series started to air in 2001 and a movie was made in 2010. Featured Crew Réjean Tremblay Creator Louis Caron Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lise Martin Kim Legendre Dave Morissette Philippe Lalumière Sarah Dagenais-Hakim Ilsa Trépanier Sébastien Delorme Roma Gauthier Jason Roy-Léveillée Guy Lambert Full Cast & Crew Last Season Season 8 2015 | 10 Episodes Season 9 of Lance et Compte premiered on January 12, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lance et Compte. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  French Runtime  46m Homepage   http://tva.canoe.ca/emissions/lanceetcompte/ Genres Drama Keywords sport quebec ice hockey téléroman Content Score 93 Almost there... Top Contributors 61 Banana 7 Xordok  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}