{"link": "https://www.themoviedb.org/tv/59366?language=en", "title": "Scandal: A Shocking and Wrongful Incident", "resume": "Detective Ha Eun-joong uncovers a shocking secret; Ha Myung-geun, the man he believed was his father, had actually kidnapped him as a child. Myung-geun had lost his own son in a building collapse, and as revenge against the man responsible, Jang Tae-ha, he abducted Tae-ha's son and raised him as his own. In the aftermath of revenge, Eun-joong searches for the truth and becomes caught between his two fathers and the woman he loves, Woo Ah-mi.", "rate": 90, "genre": ["Drama", "Family"], "cast": ["Kim Jae-won", "Jo Jae-hyeon", "Park Sang-min", "Shin Eun-kyung", "Jo Yoon-hee"], "character": ["Ha Eun-joong", "Ha Myung-geun", "Jang Tae-ha", "Yoon Hwa-young", "Woo Ah-mi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59366   Expand Scandal: A Shocking and Wrongful Incident   (2013) User Score Overview Detective Ha Eun-joong uncovers a shocking secret; Ha Myung-geun, the man he believed was his father, had actually kidnapped him as a child. Myung-geun had lost his own son in a building collapse, and as revenge against the man responsible, Jang Tae-ha, he abducted Tae-ha's son and raised him as his own. In the aftermath of revenge, Eun-joong searches for the truth and becomes caught between his two fathers and the woman he loves, Woo Ah-mi. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Jae-won Ha Eun-joong Jo Jae-hyeon Ha Myung-geun Park Sang-min Jang Tae-ha Shin Eun-kyung Yoon Hwa-young Jo Yoon-hee Woo Ah-mi Full Cast & Crew Last Season Season 1 2013 | 36 Episodes Season 1 of Scandal: A Shocking and Wrongful Incident premiered on June 29, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Scandal: A Shocking and Wrongful Incident. You can help by rating TV shows you've seen. Facts Original Name  스캔들: 매우 충격적이고 부도덕한 사건 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/scd/ Genres Drama Family Keywords revenge Content Score 86 Almost there... Top Contributors t 47 tmdb38202327 10 Elizabeth Jennings 7 daliasued z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}