{"link": "https://www.themoviedb.org/tv/72705?language=en", "title": "Marvel's Spider-Man", "resume": "An insecure but courageous and intelligent teen named Peter Parker, a new student of Midtown High, is bitten by a radioactive spider and given powers. He becomes a hero named Spider-Man after the death of his uncle and he must adapt to this new way of life.", "rate": 79, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Robbie Daymond ", "Max Mittleman", "Nadji Jeter", "Melanie Minichino", "Fred Tatasciore"], "character": ["Peter Parker / Spider-Man (voice)", "Harry Osborn (voice)", "Miles Morales (voice)", "Anya Corazon (voice)", "Max Modell (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72705   Expand Marvel's Spider-Man   (2017) User Score  Play Trailer Overview An insecure but courageous and intelligent teen named Peter Parker, a new student of Midtown High, is bitten by a radioactive spider and given powers. He becomes a hero named Spider-Man after the death of his uncle and he must adapt to this new way of life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robbie Daymond  Peter Parker / Spider-Man (voice) Max Mittleman Harry Osborn (voice) Nadji Jeter Miles Morales (voice) Melanie Minichino Anya Corazon (voice) Fred Tatasciore Max Modell (voice) Full Cast & Crew Current Season Season 2 2018 | 4 Episodes Season 2 of Marvel's Spider-Man premiered on June 18, 2018. View All Seasons Social Reviews  1 Discussions  0 A review by Ch Walid  8.0 Written by  Ch Walid  on January 24, 2018 I enjoyed this TV Show obviously because it's Spider-Man but that doesn't mean that it's perfect, so i've got some things to say about it: I like the fact that they're trying to do something new with Spider-Man, but i think they focus too much in his hero side more than his normal life side. The animations, the art and the CGI is the worst that i've ever seen in a Spider-Man TV Show, needs a lot of improvement, especially the cars and the backgrounds. Spider-Man is way too cringy, and makes some stupid jokes. there're more things but, the main problem that drives me insane is t...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2012-04-01 Marvel's Ultimate Spider-Man 6.6    1996-09-28 Early Edition 6.7    2014-01-11 When Calls The Heart 8.1    1964-09-17 Bewitched 7.1    2000-10-15 InuYasha 7.4    2017-11-21 Marvel's Runaways 7.3  Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  21m Homepage   http://disneynow.go.com/shows/marvels-spider-man Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 46 Elizabeth Jennings 13 ggTheV b 9 basher 8 Dragonfly17  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}