{"link": "https://www.themoviedb.org/tv/3687?language=en", "title": "Buffy the Animated Series", "resume": "Buffy the Animated Series is an animated television series concept based on Buffy the Vampire Slayer created by Joss Whedon. Initially greenlit by 20th Century Fox in 2002, it went ultimately unproduced and unaired when no network was willing to buy the series. The series would have taken place in the middle of Buffy season 1, as writer Jeph Loeb described the continuity as \"Episode 7.5\".\nWhedon and Loeb would later revisit the style of the series in the Season Eight comic story \"After These Messages... We'll Be Right Back!\".", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Giselle Loren", "Charisma Carpenter", "Nicholas Brendon", "Anthony Stewart Head", "Alyson Hannigan"], "character": ["Rupert Giles", "Willow Rosenberg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3687   Expand Buffy the Animated Series User Score Overview Buffy the Animated Series is an animated television series concept based on Buffy the Vampire Slayer created by Joss Whedon. Initially greenlit by 20th Century Fox in 2002, it went ultimately unproduced and unaired when no network was willing to buy the series. The series would have taken place in the middle of Buffy season 1, as writer Jeph Loeb described the continuity as \"Episode 7.5\". Whedon and Loeb would later revisit the style of the series in the Season Eight comic story \"After These Messages... We'll Be Right Back!\". Featured Crew Joss Whedon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Giselle Loren Charisma Carpenter Nicholas Brendon Anthony Stewart Head Rupert Giles Alyson Hannigan Willow Rosenberg Full Cast & Crew Last Season Season 1 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Pilot Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 Maretoh R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}