{"link": "https://www.themoviedb.org/tv/38817?language=en", "title": "Testament of Youth", "resume": "A dramatization of Vera Brittain's 1933 autobiography Testament of Youth---a memorial to a generation devastated by WWI--- chronicles her experiences as a nurse in London and Malta and at the front lines in France. It opens with 18-year-old Vera, the genteel daughter of a paper-mill owner, nurturing 'hopes of escaping from provincial young ladyhood.' Her plan is to attend Oxford.", "rate": 0, "genre": ["Drama"], "cast": ["Cheryl Campbell", "Emrys James", "Jane Wenham", "Peter Woodward", "Rosalie Crutchley"], "character": ["Vera Brittain"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38817   Expand Testament of Youth   (1979) User Score Overview A dramatization of Vera Brittain's 1933 autobiography Testament of Youth---a memorial to a generation devastated by WWI--- chronicles her experiences as a nurse in London and Malta and at the front lines in France. It opens with 18-year-old Vera, the genteel daughter of a paper-mill owner, nurturing 'hopes of escaping from provincial young ladyhood.' Her plan is to attend Oxford. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cheryl Campbell Vera Brittain Emrys James Jane Wenham Peter Woodward Rosalie Crutchley Full Cast & Crew Last Season Miniseries 1979 | 5 Episodes Season 1 of Testament of Youth premiered on November  4, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Testament of Youth. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  48m Homepage  - Genres Drama Keywords world war i miniseries based on memoir or autobiography 1910s Content Score 86 Almost there... Top Contributors TB 83 TMDb Bot R 9 Rebecca 1 GodHunter 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}