{"link": "https://www.themoviedb.org/tv/1025?language=en", "title": "The Rocky and Bullwinkle Show", "resume": "The Rocky & Bullwinkle Show is an American animated television series that originally aired from November 19, 1959, to June 27, 1964, on the ABC and NBC television networks. Produced by Jay Ward Productions, the series is structured as a variety show, with the main feature being the serialized adventures of the two title characters, the anthropomorphic moose Bullwinkle and flying squirrel Rocky. The main adversaries in most of their adventures are the Russian-like spies Boris Badenov and Natasha Fatale. Supporting segments include Dudley Do-Right, Peabody's Improbable History, and Fractured Fairy Tales, among others.\nRocky & Bullwinkle is known for quality writing and wry humor. Mixing puns, cultural and topical satire, and self-referential humor, it appealed to adults as well as children. It was also one of the first cartoons whose animation was outsourced; storyboards were shipped to Gamma Productions, a Mexican studio also employed by Total Television. Thus the art has a choppy, unpolished look and the animation is extremely limited even by television animation standards. Yet the series has long been held in high esteem by those who have seen it; some critics described the series as a well-written radio program with pictures.", "rate": 84, "genre": ["Animation", "Comedy", "Family"], "cast": ["June Foray", "Bill Scott", "Paul Frees"], "character": ["Rocket J. Squirrel (voice)", "Bullwinkle J. Moose (voice)", "Boris Badenov (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1025   Expand The Rocky and Bullwinkle Show   (1959) User Score Overview The Rocky & Bullwinkle Show is an American animated television series that originally aired from November 19, 1959, to June 27, 1964, on the ABC and NBC television networks. Produced by Jay Ward Productions, the series is structured as a variety show, with the main feature being the serialized adventures of the two title characters, the anthropomorphic moose Bullwinkle and flying squirrel Rocky. The main adversaries in most of their adventures are the Russian-like spies Boris Badenov and Natasha Fatale. Supporting segments include Dudley Do-Right, Peabody's Improbable History, and Fractured Fairy Tales, among others. Rocky & Bullwinkle is known for quality writing and wry humor. Mixing puns, cultural and topical satire, and self-referential humor, it appealed to adults as well as children. It was also one of the first cartoons whose animation was outsourced; storyboards were shipped to Gamma Productions, a Mexican studio also employed by Total Television. Thus the art has a choppy, unpolished look and the animation is extremely limited even by television animation standards. Yet the series has long been held in high esteem by those who have seen it; some critics described the series as a well-written radio program with pictures. Featured Crew Bill Scott Creator Jay Ward Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast June Foray Rocket J. Squirrel (voice) Bill Scott Bullwinkle J. Moose (voice) Paul Frees Boris Badenov (voice) Full Cast & Crew Last Season Season 5 1962 | 165 Episodes Season 5 of The Rocky and Bullwinkle Show premiered on August 19, 1962. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply R.I.P. June Foray Open 2 by  genplant29 Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1965-01-24 Branded 8.3    1957-09-18 Wagon Train 6.3    1983-09-18 Hardcastle and McCormick 6.1    1964-09-18 Twelve O'Clock High 8.2    1964-09-24 Daniel Boone 5.9    1954-10-27 Walt Disney's Wonderful World of Color 6.8    1987-09-26 Jake and the Fatman 4.9    1982-09-26 Matt Houston 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Comedy Family Keywords squirrel moose professor peabody boris badenov fractured fairy tale Content Score 64 We're so close, yet so far. Top Contributors PE 15 Patrick E. Abe 14 Banana 10 Elizabeth Jennings z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}