{"link": "https://www.themoviedb.org/tv/38532?language=en", "title": "Rio: Rainbow Gate!", "resume": "Rio: Rainbow Gate! is an anime series produced by Xebec under the direction of Takao Kato. Based on Tecmo's Rio Series of pachinko games, the series revolves around titular character Rio Rollins, a popular casino dealer working at the Howard Resort, and the thirteen cards called Gates which are used to determine the world's most skilled dealer. The anime aired on Tokyo MX and related channels between January 4, 2011 and March 29, 2011.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Marina Inoue", "Ayana Taketatsu", "Chiaki Takahashi", "Eri Kitamura"], "character": ["Rio Rollins Tachibana", "Mint Clark", "Rina Goltschmidt Tachibana", "Misery"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38532   Expand Rio: Rainbow Gate!   (2011) User Score Overview Rio: Rainbow Gate! is an anime series produced by Xebec under the direction of Takao Kato. Based on Tecmo's Rio Series of pachinko games, the series revolves around titular character Rio Rollins, a popular casino dealer working at the Howard Resort, and the thirteen cards called Gates which are used to determine the world's most skilled dealer. The anime aired on Tokyo MX and related channels between January 4, 2011 and March 29, 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  19 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marina Inoue Rio Rollins Tachibana Ayana Taketatsu Mint Clark Chiaki Takahashi Rina Goltschmidt Tachibana Eri Kitamura Misery Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Rio: Rainbow Gate! premiered on January  4, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  19 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on Rio: Rainbow Gate!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://riorainbowgate.com/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 21 kappa-papa K 5 KingCalifornia m 3 magoozin o 3 ouranos06  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}