{"link": "https://www.themoviedb.org/tv/40410?language=en", "title": "Work It", "resume": "Work It is an American television sitcom that ran on ABC from January 3 to January 10, 2012 as a mid-season replacement for the canceled Man Up!. The series is set in St. Louis, and is about two men who must dress as women in order to keep a job in a bad economy.\nThe series had received overwhelmingly negative reviews. The series premiere was watched by an American audience of 6.16 million. Ratings dropped to 4.9 million viewers in the second episode, and the series was canceled by ABC on January 13, 2012.", "rate": 0, "genre": ["Comedy"], "cast": ["John Caparulo", "Kate Reinders", "Benjamin Koldyke", "Amaury Nolasco", "Rebecca Mader"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40410   Expand Work It   (2012) User Score Overview Work It is an American television sitcom that ran on ABC from January 3 to January 10, 2012 as a mid-season replacement for the canceled Man Up!. The series is set in St. Louis, and is about two men who must dress as women in order to keep a job in a bad economy. The series had received overwhelmingly negative reviews. The series premiere was watched by an American audience of 6.16 million. Ratings dropped to 4.9 million viewers in the second episode, and the series was canceled by ABC on January 13, 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Caparulo Kate Reinders Benjamin Koldyke Amaury Nolasco Rebecca Mader Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Work It premiered on January  3, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Work It. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.abc.go.com/shows/work-it Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 3 speedycars 1 Michael J 1 Jenn t 1 tm2000  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}