{"link": "https://www.themoviedb.org/tv/62214?language=en", "title": "Your Family or Mine", "resume": "Based on an enormously popular Israeli comedy, Your Family or Mine comes from the producers of Friends, Will & Grace, How I Met Your Mother and Happy Endings. The new series revolves around Oliver and Kelli, who are living proof of the adage, \"When you marry someone, you don't just marry them, you marry their whole family\".\nIt is a family comedy with an unusual structure - each episode focuses on a different side of the family: one week featuring the couple dealing with Kelli's family, the next spent with Oliver's.", "rate": 46, "genre": ["Comedy"], "cast": ["Kyle Howard", "Kat Foster", "Richard Dreyfuss", "JoBeth Williams", "Ed Begley Jr."], "character": ["Oliver Weston", "Kelli Weston", "Louis", "Ricky", "Gil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62214   Expand Your Family or Mine   (2015) User Score  Play Trailer Overview Based on an enormously popular Israeli comedy, Your Family or Mine comes from the producers of Friends, Will & Grace, How I Met Your Mother and Happy Endings. The new series revolves around Oliver and Kelli, who are living proof of the adage, \"When you marry someone, you don't just marry them, you marry their whole family\". It is a family comedy with an unusual structure - each episode focuses on a different side of the family: one week featuring the couple dealing with Kelli's family, the next spent with Oliver's. Featured Crew Jamie Tarses Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kyle Howard Oliver Weston Kat Foster Kelli Weston Richard Dreyfuss Louis JoBeth Williams Ricky Ed Begley Jr. Gil Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Your Family or Mine premiered on April  8, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2015-01-22 Banana 7.8    2015-03-31 Weird Loners 5.8    2016-03-15 Crowded 6.4    2015-01-22 Backstrom 6.4    2015-03-17 One Big Happy 6.0    2013-11-14 Ground Floor 6.1    2014-05-29 Undateable 6.2    2014-03-06 Sirens 7.3  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.tbs.com/shows/your-family-or-mine.html Genres Comedy Keywords marriage family in-laws Content Score 100 Yes! Looking good! Top Contributors 44 Nero Kosonen 11 Elizabeth Jennings 9 Banana z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}