{"link": "https://www.themoviedb.org/tv/20112?language=en", "title": "Brain Powerd", "resume": "Brain Powerd is a Japanese anime television series created by Sunrise. The series is set on a future, decimated Earth after the discovery of a mysterious, alien spacecraft dubbed \"Orphan\". A group of researchers scour the planet for Orphan's disc plates using mecha called \"Antibodies\" in order to revive the craft, an event that would result in the utter destruction of all lifeforms on Earth. The protagonists Yu Isami and Hime Utsumiya must utilize a special Antibody called \"Brain Powerd\" to counter the Orphan plans and save humanity. Brain Powerd was directed and written by Gundam creator Yoshiyuki Tomino. The series features mecha designs by Mamoru Nagano, character designs by Mutsumi Inomata, and music by Yoko Kanno.\nThe 26-episode Brain Powerd television series originally premiered across Japan on the satellite channel WOWOW between April 8 and November 11, 1998. The series was also aired across Japan on the anime network Animax, which also later broadcast the series across its respective networks worldwide, including its English language networks in Southeast Asia and South Asia. Animax aired Bandai Entertainment's localization, the series' English language television premiere. The anime series was licensed by Bandai and distributed across the region on DVD under the title Brain Powered. The series was also adapted into a manga, with art by Yukiru Sugisaki, which was serialized in Japan's Kadokawa Shoten magazine Shōnen Ace and later published in the United States in English by Tokyopop. A series of light novels, music CDs, and other merchandise relating to Brain Powerd also exist.", "rate": 50, "genre": ["Animation"], "cast": ["Romi Park", "Run Sasaki", "Maria Kawamura", "Kumiko Watanabe", "Akino Murata"], "character": ["Kanan Gimms", "Kant Kestner", "Higgins Saz", "Quincy Issa", "Hime Utsumiya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20112   Expand Brain Powerd   (1998) User Score Overview Brain Powerd is a Japanese anime television series created by Sunrise. The series is set on a future, decimated Earth after the discovery of a mysterious, alien spacecraft dubbed \"Orphan\". A group of researchers scour the planet for Orphan's disc plates using mecha called \"Antibodies\" in order to revive the craft, an event that would result in the utter destruction of all lifeforms on Earth. The protagonists Yu Isami and Hime Utsumiya must utilize a special Antibody called \"Brain Powerd\" to counter the Orphan plans and save humanity. Brain Powerd was directed and written by Gundam creator Yoshiyuki Tomino. The series features mecha designs by Mamoru Nagano, character designs by Mutsumi Inomata, and music by Yoko Kanno. The 26-episode Brain Powerd television series originally premiered across Japan on the satellite channel WOWOW between April 8 and November 11, 1998. The series was also aired across Japan on the anime network Animax, which also later broadcast the series across its respective networks worldwide, including its English language networks in Southeast Asia and South Asia. Animax aired Bandai Entertainment's localization, the series' English language television premiere. The anime series was licensed by Bandai and distributed across the region on DVD under the title Brain Powered. The series was also adapted into a manga, with art by Yukiru Sugisaki, which was serialized in Japan's Kadokawa Shoten magazine Shōnen Ace and later published in the United States in English by Tokyopop. A series of light novels, music CDs, and other merchandise relating to Brain Powerd also exist. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Romi Park Kanan Gimms Run Sasaki Kant Kestner Maria Kawamura Higgins Saz Kumiko Watanabe Quincy Issa Akino Murata Hime Utsumiya Full Cast & Crew Last Season Season 1 1998 | 26 Episodes Season 1 of Brain Powerd premiered on April  8, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Brain Powerd. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}