{"link": "https://www.themoviedb.org/tv/68953?language=en", "title": "The Crusades, An Arab Perspective", "resume": "The Crusades: An Arab Perspective is a four-part series produced by Al Jazeera English, which presents the dramatic story of the medieval religious war through Arab eyes. The series provides a new perspective on the history of the Crusades for a global, English-speaking audience, that has largely read about or studied the famous struggle from a primarily Christian and Western point of view.", "rate": 90, "genre": ["War", "Politics", "Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68953   Expand The Crusades, An Arab Perspective   (2016) User Score Overview The Crusades: An Arab Perspective is a four-part series produced by Al Jazeera English, which presents the dramatic story of the medieval religious war through Arab eyes. The series provides a new perspective on the history of the Crusades for a global, English-speaking audience, that has largely read about or studied the famous struggle from a primarily Christian and Western point of view. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of The Crusades, An Arab Perspective premiered on November 30, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Crusades, An Arab Perspective. You can help by rating TV shows you've seen. Facts Original Name  الحروب الصليبية Status  Ended Network Al Jazeera Documentary Certification  - Type  Documentary Original Language  Arabic Runtime  55m Homepage   http://doc.aljazeera.net/crusades Genres War & Politics Documentary Keywords crusade dark ages Content Score 64 We're so close, yet so far. Top Contributors 29 aiman 6 ahmedalnazari TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}