{"link": "https://www.themoviedb.org/tv/185?language=en", "title": "Carnivàle", "resume": "Carnivàle is an American television series set in the United States during the Great Depression and Dust Bowl. In tracing the lives of two disparate groups of people, its overarching story depicts the battle between good and evil and the struggle between free will and destiny; the storyline mixes Christian theology with gnosticism and Masonic lore, particularly that of the Knights Templar.", "rate": 81, "genre": ["Sci-Fi", "Fantasy", "Mystery", "Drama"], "cast": ["Michael J. Anderson", "Adrienne Barbeau", "Clancy Brown", "Debra Christofferson", "Tim DeKay"], "character": ["Samson", "Ruthie", "Brother Justin", "Lila", "Clayton Jones"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 185   Expand Carnivàle   (2003) User Score  Play Trailer Overview Carnivàle is an American television series set in the United States during the Great Depression and Dust Bowl. In tracing the lives of two disparate groups of people, its overarching story depicts the battle between good and evil and the struggle between free will and destiny; the storyline mixes Christian theology with gnosticism and Masonic lore, particularly that of the Knights Templar. Featured Crew Daniel Knauf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  14 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael J. Anderson Samson Adrienne Barbeau Ruthie Clancy Brown Brother Justin Debra Christofferson Lila Tim DeKay Clayton Jones Full Cast & Crew Last Season Season 2 2005 | 12 Episodes Season 2 of Carnivàle premiered on January  9, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Favourite TV series Open 3 by  Invidia Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  6 Recommendations   2004-03-21 Deadwood 8.1    2001-06-03 Six Feet Under 8.2    2010-09-19 Boardwalk Empire 7.7    2005-08-28 Rome 8.2    2007-10-02 Pushing Daisies 7.8    2013-04-19 Hemlock Grove 6.4    1997-07-12 Oz 8.1    2007-02-26 The Black Donnellys 7.4  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://hbo.com/carnivale/ Genres Sci-Fi & Fantasy Mystery Drama Keywords carnival great depression period drama circus freak freak show 1930s Content Score 100 Yes! Looking good! Top Contributors 51 rantamplan 11 Elizabeth Jennings 10 Travis Bell s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}