{"link": "https://www.themoviedb.org/tv/18150?language=en", "title": "River Monsters", "resume": "Extreme angler Jeremy Wade is on the hunt for fish with a taste for human flesh. This rip-roaring ride mixes action and adventure with mysteries, edge-of-the-seat chase and a battle of wills between man and nature.", "rate": 83, "genre": ["Action", "Adventure", "Documentary"], "cast": ["Jeremy Wade"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18150   Expand River Monsters   (2009) User Score  Play Trailer Overview Extreme angler Jeremy Wade is on the hunt for fish with a taste for human flesh. This rip-roaring ride mixes action and adventure with mysteries, edge-of-the-seat chase and a battle of wills between man and nature. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Wade Himself Full Cast & Crew Last Season Season 9 2017 | 11 Episodes Season 9 of River Monsters premiered on April 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  14 Posters  10 Recommendations   2010-11-02 Mysteries at the Museum 8.8    2007-06-06 Destination Truth 7.6    2013-07-20 Cedar Cove 6.7    2007-10-31 MonsterQuest 7.2    1999-04-29 The Planets 8.5    2005-07-25 Anthony Bourdain: No Reservations 7.9    2010-12-01 Storage Wars 5.3    2015-09-21 Life in Pieces 7.5  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m, 45m Homepage   http://www.animalplanet.com/tv-shows/river-monsters/ Genres Action & Adventure Documentary Keywords humor danger fresh water horrors salt water monsters Content Score 64 We're so close, yet so far. Top Contributors 28 Elizabeth Jennings GB 13 Guillaume Beyssac PE 11 Patrick E. Abe L 8 Limitless  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}