{"link": "https://www.themoviedb.org/tv/62669?language=en", "title": "Orange Marmalade", "resume": "Despite a 200-year-old treaty between humans and vampires, both races still don't get along. Amidst the looming tension, Jung Jae Min, a posh yet kindhearted high school student, quickly falls for the mysterious new girl Baek Ma Ri. But can Ma Ri conceal her true vampire identity and give love an honest chance? If these star-crossed lovers can find the courage to make the leap, Jae Min and Ma Ri may just be the key to a final resolution between humans and vampires...", "rate": 77, "genre": ["Fantasy", "Romance"], "cast": ["Yeo Jin-goo", "Kim Seol-hyun", "Lee Jong-hyun", "Song Jong-ho", "Lee Il-hwa"], "character": ["Jung Jae-min", "Baek Ma-ri", "Han Shi-hoo", "Han Yoon-jae", "Kang Min-ha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62669   Expand Orange Marmalade   (2015) User Score  Play Trailer Overview Despite a 200-year-old treaty between humans and vampires, both races still don't get along. Amidst the looming tension, Jung Jae Min, a posh yet kindhearted high school student, quickly falls for the mysterious new girl Baek Ma Ri. But can Ma Ri conceal her true vampire identity and give love an honest chance? If these star-crossed lovers can find the courage to make the leap, Jae Min and Ma Ri may just be the key to a final resolution between humans and vampires... Featured Crew Seok Woo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yeo Jin-goo Jung Jae-min Kim Seol-hyun Baek Ma-ri Lee Jong-hyun Han Shi-hoo Song Jong-ho Han Yoon-jae Lee Il-hwa Kang Min-ha Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Orange Marmalade premiered on May 15, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Orange Marmalade. You can help by rating TV shows you've seen. Facts Original Name  오렌지 마말레이드 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  55m, 45m Homepage   http://www.kbs.co.kr/drama/orange/ Genres Fantasy Romance Keywords vampire korea Content Score 100 Yes! Looking good! Top Contributors M 41 Maria180493 11 Elizabeth Jennings z 4 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}