{"link": "https://www.themoviedb.org/tv/61701?language=en", "title": "Plus Nine Boys", "resume": "This is a romantic comedy series about four boys at the ages of 9, 19, 29 and 39 who each confront different challenges in love and work at the cusp of a new decade in their lives.", "rate": 0, "genre": ["Comedy"], "cast": ["Kim Young-kwang", "Oh Jung-se", "Yook Sung-jae", "Choi Ro-woon", "Kyung Soo-jin"], "character": ["Kang Jin-gu", "Gu Kwang-soo", "Kang Min-gu", "Kang Dong-gu", "Ma Se-young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61701   Expand Plus Nine Boys   (2014) User Score  Play Trailer Overview This is a romantic comedy series about four boys at the ages of 9, 19, 29 and 39 who each confront different challenges in love and work at the cusp of a new decade in their lives. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Young-kwang Kang Jin-gu Oh Jung-se Gu Kwang-soo Yook Sung-jae Kang Min-gu Choi Ro-woon Kang Dong-gu Kyung Soo-jin Ma Se-young Full Cast & Crew Last Season Season 1 2014 | 14 Episodes Season 1 of Plus Nine Boys premiered on August 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Plus Nine Boys. You can help by rating TV shows you've seen. Facts Original Name  아홉수 소년 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://program.interest.me/tvn/9thboy/ Genres Comedy Keywords korea Content Score 93 Almost there... Top Contributors M 37 Maria180493 CM 4 Cherche Moi t 4 tmdb38202327 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}