{"link": "https://www.themoviedb.org/tv/42878?language=en", "title": "Anger Management", "resume": "Charlie is a non-traditional therapist specializing in anger management. He has a successful private practice and he performs pro bono counseling for an inmate group at a state prison. Prior to his career as a therapist, he was a major league baseball player whose career was put on the shelf for good by his own struggle with anger issues.", "rate": 60, "genre": ["Comedy"], "cast": ["Charlie Sheen", "Selma Blair", "Shawnee Smith", "Michael Arden", "Daniela Bobadilla"], "character": ["Charlie Goodson", "Kate Wales", "Jennifer Goodson", "Patrick", "Sam Goodson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42878   Expand Anger Management   (2012) User Score  Play Trailer Overview Charlie is a non-traditional therapist specializing in anger management. He has a successful private practice and he performs pro bono counseling for an inmate group at a state prison. Prior to his career as a therapist, he was a major league baseball player whose career was put on the shelf for good by his own struggle with anger issues. Featured Crew Bruce Helford Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  8 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Sheen Charlie Goodson Selma Blair Kate Wales Shawnee Smith Jennifer Goodson Michael Arden Patrick Daniela Bobadilla Sam Goodson Full Cast & Crew Last Season Season 2 2013 | 90 Episodes Season 2 of Anger Management premiered on January 17, 2013. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Charlie: Happy Birthday Charlie Sheen! Open 0 by wonder2wonder\n      \n     w Sean: Happy Birthday Brian Austin Green! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  10 Recommendations   2003-09-22 Two and a Half Men 6.2    1996-09-17 Spin City 7.0    2002-09-23 CSI: Miami 5.8    2009-09-23 Cougar Town 5.8    2013-09-26 The Michael J. Fox Show 5.6    2013-10-02 Super Fun Night 5.3    1987-04-05 Married... with Children 7.4    2012-08-08 Go On 6.2  Facts Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.fxnetworks.com/shows/anger-management/episodes Genres Comedy Keywords therapist therapy sitcom anger management mental health professional Content Score 100 Yes! Looking good! Top Contributors 16 Banana TB 14 TMDb Bot C 9 CaptainBarnius a 9 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}