{"link": "https://www.themoviedb.org/tv/17981?language=en", "title": "Olivia", "resume": "Olivia is a British-American children's animated television series produced by media company Chorion and based on Ian Falconer's books. It is seen on Nick Jr. in the US, Milkshake!, Nick Jr. in the UK and Ireland, and Disney Junior in Latin America and Brazil, Treehouse TV in Canada. The show has won a silver Parents' Choice Award for its positive story lines and characters. New episode are airing on Nick JR in 2013.", "rate": 60, "genre": ["Animation"], "cast": ["Yvonne Craig", "Katie Leigh", "Brianna McCracken", "Danny Katiana"], "character": ["Grandma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17981   Expand Olivia   (2009) User Score Overview Olivia is a British-American children's animated television series produced by media company Chorion and based on Ian Falconer's books. It is seen on Nick Jr. in the US, Milkshake!, Nick Jr. in the UK and Ireland, and Disney Junior in Latin America and Brazil, Treehouse TV in Canada. The show has won a silver Parents' Choice Award for its positive story lines and characters. New episode are airing on Nick JR in 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yvonne Craig Grandma Katie Leigh Brianna McCracken Danny Katiana Full Cast & Crew Last Season Season 2 2010 | 17 Episodes Season 2 of Olivia premiered on November 21, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Olivia. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 15m Homepage   http://www.nickjr.com/shows/olivia/index.jhtml Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}