{"link": "https://www.themoviedb.org/tv/62884?language=en", "title": "Forged in Fire", "resume": "Competitors re-create weapons from historical periods ranging from Japanese katanas to medieval broadswords to ancient throwing blades. Each entry is judged on its artistry as well as its functionality and accuracy.", "rate": 78, "genre": ["Reality"], "cast": ["Wil Willis", "J. Neilson", "David Lain Baker", "Doug Marcaida"], "character": ["Himself - Host", "Himself - Judge", "Himself - Judge", "Himself - Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62884   Expand Forged in Fire   (2015) User Score  Play Trailer Overview Competitors re-create weapons from historical periods ranging from Japanese katanas to medieval broadswords to ancient throwing blades. Each entry is judged on its artistry as well as its functionality and accuracy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wil Willis Himself - Host J. Neilson Himself - Judge David Lain Baker Himself - Judge Doug Marcaida Himself - Judge Full Cast & Crew Current Season Season 5 2018 | 17 Episodes Season 5 of Forged in Fire premiered on March 13, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Forged in Fire. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2014-09-23 NCIS: New Orleans 6.3  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  42m Homepage   http://www.history.com/shows/forged-in-fire Genres Reality Keywords weapon weapons history Content Score 93 Almost there... Top Contributors 46 Elizabeth Jennings 9 oldboy3 b 6 basher LC 5 Legit Corporation  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}