{"link": "https://www.themoviedb.org/tv/64012?language=en", "title": "Midwinter of the Spirit", "resume": "Country vicar Merrily Watkins just happens to be one of the few women priests working as an exorcist. When a man is found murdered by crucifixion, the police, aware of her knowledge of the paranormal underworld, turn to the Vicar for assistance. Before long Merilly is convinced Satanists are behind the crime and the investigation takes them into a very dark and dangerous world.", "rate": 61, "genre": [], "cast": ["Anna Maxwell Martin", "David Threlfall", "Doc Brown", "Siobhan Finneran", "Leila Mimmack"], "character": ["Merrily Watkins", "Rev Huw Owens", "Lol Robinson", "Angela Purefoy", "Rowena Napier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64012   Expand Midwinter of the Spirit   (2015) User Score  Play Trailer Overview Country vicar Merrily Watkins just happens to be one of the few women priests working as an exorcist. When a man is found murdered by crucifixion, the police, aware of her knowledge of the paranormal underworld, turn to the Vicar for assistance. Before long Merilly is convinced Satanists are behind the crime and the investigation takes them into a very dark and dangerous world. Featured Crew Phil Rickman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Maxwell Martin Merrily Watkins David Threlfall Rev Huw Owens Doc Brown Lol Robinson Siobhan Finneran Angela Purefoy Leila Mimmack Rowena Napier Full Cast & Crew Last Season Series 1 2015 | 3 Episodes Season 1 of Midwinter of the Spirit premiered on September 23, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2013-03-10 Shetland 7.5    2013-10-29 Hinterland 7.5    2011-05-05 The Shadow Line 8.1    2005-09-19 Invasion 6.9    2015-10-13 River 7.8    2003-09-28 Cold Case 7.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   https://www.itv.com/itvplayer/midwinter-of-the-spirit Genres No genres have been added. Keywords exorcism satanist paranormal priest miniseries vicar murder investigation Content Score 93 Almost there... Top Contributors 40 Elizabeth Jennings TB 16 TMDb Bot e 3 error666 CM 2 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}