{"link": "https://www.themoviedb.org/tv/37829?language=en", "title": "I'm Gonna Be An Angel!", "resume": "I'm Gonna Be An Angel! is an anime produced by Studio Pierrot. A manga was also released in Japan in 1999. The anime was licensed for release in the United States by Synch-Point, but its domestic distribution license has since expired. The American DVD release was never completed, due to poor marketing and distribution, and thus, poor sales. The manga has not been licensed for release in the United States.", "rate": 10, "genre": ["Animation"], "cast": ["Ayako Kawasumi", "Akira Ishida", "Issei Miyazaki", "Tomoko Kawakami", "Yukana"], "character": ["Sara", "Mikael", "Yuusuke Kamoshita", "Noelle", "Natsumi Suzuhara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37829   Expand I'm Gonna Be An Angel!   (1999) User Score Overview I'm Gonna Be An Angel! is an anime produced by Studio Pierrot. A manga was also released in Japan in 1999. The anime was licensed for release in the United States by Synch-Point, but its domestic distribution license has since expired. The American DVD release was never completed, due to poor marketing and distribution, and thus, poor sales. The manga has not been licensed for release in the United States. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayako Kawasumi Sara Akira Ishida Mikael Issei Miyazaki Yuusuke Kamoshita Tomoko Kawakami Noelle Yukana Natsumi Suzuhara Full Cast & Crew Last Season I'm gonna be an angel season 1 1999 | 22 Episodes Season 1 of I'm Gonna Be An Angel! premiered on April  7, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I'm Gonna Be An Angel!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}