{"link": "https://www.themoviedb.org/tv/34739?language=en", "title": "Fairytale Book", "resume": "The time is 972 A.D. in Kyoto, the capital of ancient Japan. Kyoto is becoming a corrupt and run-down city; selfish samurai and onmyoji, who care only about gaining political power are everywhere. To make matters worse the city is suffering from famine and widespread disease. Unable to ignore the condition of the city any longer, the Imperial Court decides to send Minamoto no Raiko, a famous samurai well-known for his archery skills, to recover a legendary gem said to hold mysterious power to save the world. However Raiko also falls ill to disease. Instead his youngest sister, Hikaru, decides secretely to make the journey in his place. Hikaru meets many people, and has many adventures while on her trip for the legendary gem.", "rate": 0, "genre": ["Animation"], "cast": ["Kumi Sakuma", "Shin'ichirou Miki", "Shin'ichirou Miki", "Kan Tokumaru", "Kenta Miyake"], "character": ["Urabe no Suetake", "Mansairaku", "Minamoto no Raikou", "Abe no Seimei", "Watanabe no Tsuna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34739   Expand Fairytale Book   (2004) User Score Overview The time is 972 A.D. in Kyoto, the capital of ancient Japan. Kyoto is becoming a corrupt and run-down city; selfish samurai and onmyoji, who care only about gaining political power are everywhere. To make matters worse the city is suffering from famine and widespread disease. Unable to ignore the condition of the city any longer, the Imperial Court decides to send Minamoto no Raiko, a famous samurai well-known for his archery skills, to recover a legendary gem said to hold mysterious power to save the world. However Raiko also falls ill to disease. Instead his youngest sister, Hikaru, decides secretely to make the journey in his place. Hikaru meets many people, and has many adventures while on her trip for the legendary gem. Featured Crew Narumi Seto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kumi Sakuma Urabe no Suetake Shin'ichirou Miki Mansairaku Shin'ichirou Miki Minamoto no Raikou Kan Tokumaru Abe no Seimei Kenta Miyake Watanabe no Tsuna Full Cast & Crew Last Season Season 1 2004 | 24 Episodes Season 1 of Fairytale Book premiered on July  6, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fairytale Book. You can help by rating TV shows you've seen. Facts Original Name  お伽草子 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  26m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 15 minusha97  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}