{"link": "https://www.themoviedb.org/tv/32537?language=en", "title": "Need to Know", "resume": "Need to Know is an American public television news program produced by WNET, and broadcast weekly on all Public Broadcasting Service (PBS) affiliate-stations in the United States. It aired from May 2010 until June 2013.\nPBS stated that the show was intended to fill the public-affairs and \"hard\"/investigative news void left by both the one-hour Bill Moyers Journal, and the cancelled, half-hour NOW on PBS. Both departing shows had been long-running, highly rated, and critically acclaimed for their journalistic quality, and focus on issues that deeply impacted regular Americans' lives, yet went largely ignored by commercial TV news outlets. \"NTK\" branded itself the \"TV and Web newsmagazine [that] gives you what you need to know.\" PBS had described the show as “a multi-platform current affairs news magazine, uniting broadcast and web in an innovative approach to newsgathering and reporting”. Initially, it was co-hosted by Alison Stewart; and, journalist, author, and then-Newsweek magazine editor-in-chief Jon Meacham. Later, the show was hosted by one journalist who presented pre-taped correspondent pieces, then asked follow-up questions of the correspondent, in-studio. A short segment followed, in which a prominent person reflected on a difference-making period from his or her past.", "rate": 0, "genre": ["Documentary", "News"], "cast": ["Alison Stewart", "Jon Meacham"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32537   Expand Need to Know   (2010) User Score Overview Need to Know is an American public television news program produced by WNET, and broadcast weekly on all Public Broadcasting Service (PBS) affiliate-stations in the United States. It aired from May 2010 until June 2013. PBS stated that the show was intended to fill the public-affairs and \"hard\"/investigative news void left by both the one-hour Bill Moyers Journal, and the cancelled, half-hour NOW on PBS. Both departing shows had been long-running, highly rated, and critically acclaimed for their journalistic quality, and focus on issues that deeply impacted regular Americans' lives, yet went largely ignored by commercial TV news outlets. \"NTK\" branded itself the \"TV and Web newsmagazine [that] gives you what you need to know.\" PBS had described the show as “a multi-platform current affairs news magazine, uniting broadcast and web in an innovative approach to newsgathering and reporting”. Initially, it was co-hosted by Alison Stewart; and, journalist, author, and then-Newsweek magazine editor-in-chief Jon Meacham. Later, the show was hosted by one journalist who presented pre-taped correspondent pieces, then asked follow-up questions of the correspondent, in-studio. A short segment followed, in which a prominent person reflected on a difference-making period from his or her past. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alison Stewart Jon Meacham Full Cast & Crew Last Season Season 2011 2011 | 51 Episodes Season 2011 of Need to Know premiered on January  7, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Need to Know. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 52m Homepage   http://www.pbs.org/wnet/need-to-know/ Genres Documentary News Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}