{"link": "https://www.themoviedb.org/tv/39823?language=en", "title": "Alpha 0.7 – Der Feind in dir", "resume": "Alpha 0.7 – Der Feind in dir is a German transmedia science fiction series which first aired on 14 November 2010 on SWR TV. It is set in Stuttgart in 2017 where surveillance is omnipresent. It stars Victoria Mayer, Anna Maria Mühe, Arne Lenk, Tobias Schenke, Oliver Stritzel, Thomas Huber and Rolf Kanies.", "rate": 0, "genre": [], "cast": ["Anna Maria Mühe", "Tobias Schenke", "Oliver Stritzel", "Rolf Kanies", "Jella Haase"], "character": ["Mila Antonovic", "Andreas Zander", "Harald Rösler", "Uwe Gonzoldt", "Meike Berger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39823   Expand Alpha 0.7 – Der Feind in dir   (2010) User Score Overview Alpha 0.7 – Der Feind in dir is a German transmedia science fiction series which first aired on 14 November 2010 on SWR TV. It is set in Stuttgart in 2017 where surveillance is omnipresent. It stars Victoria Mayer, Anna Maria Mühe, Arne Lenk, Tobias Schenke, Oliver Stritzel, Thomas Huber and Rolf Kanies. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Maria Mühe Mila Antonovic Tobias Schenke Andreas Zander Oliver Stritzel Harald Rösler Rolf Kanies Uwe Gonzoldt Jella Haase Meike Berger Full Cast & Crew Last Season Miniseries 2010 | 6 Episodes Season 1 of Alpha 0.7 – Der Feind in dir premiered on November 14, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Alpha 0.7 – Der Feind in dir. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  German Runtime  25m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors S 11 Samara 3 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}