{"link": "https://www.themoviedb.org/tv/37732?language=en", "title": "Kriminálka Anděl", "resume": "Kriminálka Anděl is a Czech crime drama television series which premiered on TV Nova in 2008. Third season was shooting since April 2010 and broadcast since March 21, 2011. This TV series has an origin in the Slovak crime series Mesto tieňov.", "rate": 0, "genre": ["Drama"], "cast": ["David Švehlík", "Martin Stropnický", "Marek Taclík", "Helena Dvořáková", "Michal Novotný"], "character": ["Tomáš Benkovský", "Ivan Tomeček", "Oliver Hajn", "Jana Chládková", "Rudolf Uhlíř"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37732   Expand Kriminálka Anděl   (2008) User Score Overview Kriminálka Anděl is a Czech crime drama television series which premiered on TV Nova in 2008. Third season was shooting since April 2010 and broadcast since March 21, 2011. This TV series has an origin in the Slovak crime series Mesto tieňov. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Švehlík Tomáš Benkovský Martin Stropnický Ivan Tomeček Marek Taclík Oliver Hajn Helena Dvořáková Jana Chládková Michal Novotný Rudolf Uhlíř Full Cast & Crew Last Season Season 4 2014 | 16 Episodes Season 4 of Kriminálka Anděl premiered on August 31, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kriminálka Anděl. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://kriminalka.nova.cz/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 13 5lucina5 M 6 Michal.f s 3 speedycars 1 Trottel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}