{"link": "https://www.themoviedb.org/tv/18311?language=en", "title": "X Factor", "resume": "X Factor is a Dutch television music talent show contested by aspiring pop singers drawn from public auditions. It is shown Friday evenings on the RTL4 Network in the Netherlands. The first series of the show aired from October 2006 through to February 2007, while the second series of the show aired from January through to May 2009. The show is produced by Blue Circle and is currently sponsored by Fiat. The \"X Factor\" of the title refers to the undefinable \"something\" that makes for star quality.\nX Factor replaced the highly successful Idols, which was put on indefinite hiatus after its third and fourth series.\nIn the initial televised audition phase of the show, contestants sing in front of the X Factor judges in the hope of getting through to the \"boot camp\". After a further selection process, the judges are each given a category to mentor and the chosen finalists then progress to the second phase of the competition in which the public vote on live performances. The current judges are: Pop Singer and Television host Gordon Heuckeroth, former Dolly Dots member Angela Groothuizen, Rapper Ali Bouali and Alto Saxophonist Candy Dulfer.\nThe first series of X Factor began in October 2006 and ran to February 2007. It was not as popular as Idols. It was won by Sharon Kips. The second series, running from January to May 2009, was more successful. It was won by Lisa Hordijk. The third series was won by Jaap van Reesema. Rochelle Perts won the fourth series. The fifth series was won by Haris Alagic.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18311   Expand X Factor   (2006) User Score Overview X Factor is a Dutch television music talent show contested by aspiring pop singers drawn from public auditions. It is shown Friday evenings on the RTL4 Network in the Netherlands. The first series of the show aired from October 2006 through to February 2007, while the second series of the show aired from January through to May 2009. The show is produced by Blue Circle and is currently sponsored by Fiat. The \"X Factor\" of the title refers to the undefinable \"something\" that makes for star quality. X Factor replaced the highly successful Idols, which was put on indefinite hiatus after its third and fourth series. In the initial televised audition phase of the show, contestants sing in front of the X Factor judges in the hope of getting through to the \"boot camp\". After a further selection process, the judges are each given a category to mentor and the chosen finalists then progress to the second phase of the competition in which the public vote on live performances. The current judges are: Pop Singer and Television host Gordon Heuckeroth, former Dolly Dots member Angela Groothuizen, Rapper Ali Bouali and Alto Saxophonist Candy Dulfer. The first series of X Factor began in October 2006 and ran to February 2007. It was not as popular as Idols. It was won by Sharon Kips. The second series, running from January to May 2009, was more successful. It was won by Lisa Hordijk. The third series was won by Jaap van Reesema. Rochelle Perts won the fourth series. The fifth series was won by Haris Alagic. Featured Crew Simon Cowell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season (nl) season 3 2010 | 19 Episodes Season 3 of X Factor premiered on February  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on X Factor. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.rtl.nl/shows/xfactor2/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}