{"link": "https://www.themoviedb.org/tv/13021?language=en", "title": "RIS Delitti Imperfetti", "resume": "RIS Delitti Imperfetti is an Italian television series, created in 2004 by Daniele Cesarano, Barbara Petronio and Leonardo Valenti, broadcast since January 2005 on Canale 5. The title, where RIS is an acronym for Reparto Investigazioni Scientifiche, could be approximately translated into English as Unit of Scientific Investigations: Imperfect Crimes. As the title indicates, the series is a crime drama, focusing on the scientific aspects of crime investigations, in a similar vein as the popular American TV series CSI: Crime Scene Investigation.\nThe Sixth season has been announced as being aired on Canale 5 every Thursday at 21:10 CET from January 2010.", "rate": 0, "genre": ["Drama"], "cast": ["Giancarlo Judica Cordiglia", "Nicole Grimaudo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13021   Expand RIS Delitti Imperfetti User Score Overview RIS Delitti Imperfetti is an Italian television series, created in 2004 by Daniele Cesarano, Barbara Petronio and Leonardo Valenti, broadcast since January 2005 on Canale 5. The title, where RIS is an acronym for Reparto Investigazioni Scientifiche, could be approximately translated into English as Unit of Scientific Investigations: Imperfect Crimes. As the title indicates, the series is a crime drama, focusing on the scientific aspects of crime investigations, in a similar vein as the popular American TV series CSI: Crime Scene Investigation. The Sixth season has been announced as being aired on Canale 5 every Thursday at 21:10 CET from January 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Giancarlo Judica Cordiglia Nicole Grimaudo Full Cast & Crew Last Season Season 8 2012 | 18 Episodes Season 8 of RIS Delitti Imperfetti premiered on October  3, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.risdelittiimperfetti.tv/ Genres Drama Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}