{"link": "https://www.themoviedb.org/tv/31563?language=en", "title": "Robotomy", "resume": "Robotomy is an American animated television series created by Michael Buckley and Joe Deasy, directed by Christy Karacas, voice directed by Michael Sinterniklaas, and produced by World Leaders Entertainment and Cartoon Network Studios. The series was developed after a long series of unaccepted ideas, and occasionally put in and out of production due to changing executives. It was officially announced on August 31, 2009, and premiered on October 25, 2010, on Cartoon Network. Robotomy was canceled on January 24, 2011. It is Cartoon Network's shortest-running original series, as well as with the least number of episodes. Robotomy was officially removed from Cartoon Network's website on February 11, 2011.\nOn January 11, 2013, the series returned to television in reruns, albeit in a minor role. Episodes of the series could be seen from time to time on the revived Cartoon Planet block.", "rate": 0, "genre": ["Comedy", "Animation", "Action", "Adventure"], "cast": ["Patton Oswalt", "Dana Snyder", "Michael Sinterniklaas", "Kate McKinnon", "Eliza Dushku"], "character": ["Shockzana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31563   Expand Robotomy   (2010) User Score Overview Robotomy is an American animated television series created by Michael Buckley and Joe Deasy, directed by Christy Karacas, voice directed by Michael Sinterniklaas, and produced by World Leaders Entertainment and Cartoon Network Studios. The series was developed after a long series of unaccepted ideas, and occasionally put in and out of production due to changing executives. It was officially announced on August 31, 2009, and premiered on October 25, 2010, on Cartoon Network. Robotomy was canceled on January 24, 2011. It is Cartoon Network's shortest-running original series, as well as with the least number of episodes. Robotomy was officially removed from Cartoon Network's website on February 11, 2011. On January 11, 2013, the series returned to television in reruns, albeit in a minor role. Episodes of the series could be seen from time to time on the revived Cartoon Planet block. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patton Oswalt Dana Snyder Michael Sinterniklaas Kate McKinnon Eliza Dushku Shockzana Full Cast & Crew Last Season Season 1 — | 10 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Robotomy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  11m, 15m Homepage  - Genres Comedy Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 kuzronk R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}