{"link": "https://www.themoviedb.org/tv/34170?language=en", "title": "Nazca", "resume": "Nazca is an anime series created by Yoshihiko Inamoto. It is about a group of people who are reincarnations of ancient Inca warriors who have returned to re-enact a civil war that resulted in the fall of the Inca Empire.\nMiura Kyoji, a dedicated kendo student, discovers that his instructor, Tate Masanari, is a reincarnated Inca warrior named Yawaru who wishes to destroy the world to purify it. Kyoji himself is the warrior Bilka, who foiled Yawaru's plans in their previous lives. As Yawaru gathers other awakened spirits to give him ever more power, Kyoji faces conflicting loyalties; he must decide if he is merely a vessel for the reincarnated soul, destined to fulfill a role given to him and destroy a person he liked and respected in order to save the world, or if he is a free individual who can bring Masanari to his senses and break the cycle of rebirth and human possession.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Kenichi Suzumura", "Takehito Koyasu", "Manabi Mizuno", "Akio Suyama", "Atsushi Kisaichi"], "character": ["Kyoji Miura / Bilka", "Masanari Tate", "Tatsuko Yanagihara / Elela", "Shinri Shiogami", "Kendo judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34170   Expand Nazca   (1998) User Score Overview Nazca is an anime series created by Yoshihiko Inamoto. It is about a group of people who are reincarnations of ancient Inca warriors who have returned to re-enact a civil war that resulted in the fall of the Inca Empire. Miura Kyoji, a dedicated kendo student, discovers that his instructor, Tate Masanari, is a reincarnated Inca warrior named Yawaru who wishes to destroy the world to purify it. Kyoji himself is the warrior Bilka, who foiled Yawaru's plans in their previous lives. As Yawaru gathers other awakened spirits to give him ever more power, Kyoji faces conflicting loyalties; he must decide if he is merely a vessel for the reincarnated soul, destined to fulfill a role given to him and destroy a person he liked and respected in order to save the world, or if he is a free individual who can bring Masanari to his senses and break the cycle of rebirth and human possession. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenichi Suzumura Kyoji Miura / Bilka Takehito Koyasu Masanari Tate Manabi Mizuno Tatsuko Yanagihara / Elela Akio Suyama Shinri Shiogami Atsushi Kisaichi Kendo judge Full Cast & Crew Last Season Season 1 1998 | 12 Episodes Season 1 of Nazca premiered on April  6, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nazca. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 10 Rebecca n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}