{"link": "https://www.themoviedb.org/tv/60884?language=en", "title": "KochiKame: The TV Drama", "resume": "Ryotsu Kankichi, nicknamed Ryo-san, is a senior patrol officer working at the Kamearikoen-mae police box at Katsushika. Because of his daring, hearty, unconventional, haughty and overbearing personality, he is called \"letter of apology Ryo-san\" and everything he does is nonsense. There is endless trouble wherever Ryo-san goes. He makes Akimoto Catherine Reiko and Nakagawa Keiichi, his juniors from the same police box, fearful. His superior, Ohara-buchou, lives each day as if lightning will strike as a fearless power keeps going off day after day. He definitely doesn't have poor ability as a \"patrolman of the police box\" in the mediation of quarrels, taking care of New Year's gifts or discussion of neighbourhood problems but he has a bad temper, gets tired of things easily and detests working. He is a police officer but because he loves gambling, he spends his money recklessly and in addition to this mess, is heavily in debt. He has a weakness for get rich quick schemes, and has a manic desire and knowledge to have fun and make money. Then one day, Ryo-san receives a tempting proposition...", "rate": 10, "genre": ["Drama"], "cast": ["Shingo Katori", "Karina", "Mokomichi Hayami", "Ken'ichi Nagira", "Tsumami Edamame"], "character": ["Kankichi Ryotsu", "Catherine Reiko Akimoto", "Keiichi Nakagawa", "Ueno", "Kumada"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60884   Expand KochiKame: The TV Drama   (2009) User Score Overview Ryotsu Kankichi, nicknamed Ryo-san, is a senior patrol officer working at the Kamearikoen-mae police box at Katsushika. Because of his daring, hearty, unconventional, haughty and overbearing personality, he is called \"letter of apology Ryo-san\" and everything he does is nonsense. There is endless trouble wherever Ryo-san goes. He makes Akimoto Catherine Reiko and Nakagawa Keiichi, his juniors from the same police box, fearful. His superior, Ohara-buchou, lives each day as if lightning will strike as a fearless power keeps going off day after day. He definitely doesn't have poor ability as a \"patrolman of the police box\" in the mediation of quarrels, taking care of New Year's gifts or discussion of neighbourhood problems but he has a bad temper, gets tired of things easily and detests working. He is a police officer but because he loves gambling, he spends his money recklessly and in addition to this mess, is heavily in debt. He has a weakness for get rich quick schemes, and has a manic desire and knowledge to have fun and make money. Then one day, Ryo-san receives a tempting proposition... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shingo Katori Kankichi Ryotsu Karina Catherine Reiko Akimoto Mokomichi Hayami Keiichi Nakagawa Ken'ichi Nagira Ueno Tsumami Edamame Kumada Full Cast & Crew Last Season Season 1 2009 | 8 Episodes Season 1 of KochiKame: The TV Drama premiered on August  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on KochiKame: The TV Drama. You can help by rating TV shows you've seen. Facts Original Name  こちら葛飾区亀有公園前派出所 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors N 27 Nemo_Insune A 12 Aka75 2 PannenkoekenNL 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}