{"link": "https://www.themoviedb.org/tv/42408?language=en", "title": "Hanamaru Kindergarten", "resume": "Anzu, Hiiragi, and Koume are three girls who attend the lively  Hanamaru Kindergarten. There they have lots of adventures with their  classmates and with Naozomi Tsuchida, their teacher who has just started  working fresh out of school.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Satoshi Hino", "Erino Hazuki", "Kaoru Mizuhara", "Naomi Wakabayashi", "Arisa Ogasawara"], "character": ["Naozumi Tsuchida", "Nanako Yamamoto", "Rōze Kusano", "Kawashiro", "Kakogawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42408   Expand Hanamaru Kindergarten   (2010) User Score Overview Anzu, Hiiragi, and Koume are three girls who attend the lively  Hanamaru Kindergarten. There they have lots of adventures with their  classmates and with Naozomi Tsuchida, their teacher who has just started  working fresh out of school. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Satoshi Hino Naozumi Tsuchida Erino Hazuki Nanako Yamamoto Kaoru Mizuhara Rōze Kusano Naomi Wakabayashi Kawashiro Arisa Ogasawara Kakogawa Full Cast & Crew Last Season Hanamaru youchien season 1 2010 | 12 Episodes Season 1 of Hanamaru Kindergarten premiered on January 10, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Hanamaru Kindergarten. You can help by rating TV shows you've seen. Facts Original Name  はなまる幼稚園 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Comedy Keywords watercolour style Content Score 86 Almost there... Top Contributors t 8 tmdb983464 6 Marr 🇳🇱 m 3 magoozin o 3 ouranos06  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}