{"link": "https://www.themoviedb.org/tv/1521?language=en", "title": "Quark", "resume": "Quark is an American science fiction situation comedy starring Richard Benjamin broadcast on NBC. The pilot first aired on May 7, 1977, and the series followed as a mid-season replacement in February 1978. The series was cancelled in April 1978. Quark was created by Buck Henry, co-creator of the spy spoof Get Smart.\nThe show was set on a United Galaxy Sanitation Patrol Cruiser, an interstellar garbage scow operating out of United Galaxies Space Station Perma One in the year 2226. Adam Quark, the main character, works to clean up trash in space by collecting \"space baggies\" with his trusted and highly unusual crew.\nIn its short run, Quark satirized such science fiction as Star Wars, 2001: A Space Odyssey and Flash Gordon. Three of the episodes were direct satires of Star Trek episodes.\nThe series won one Emmy Award nomination, for costume designer Grady Hunt's work in the episode \"All the Emperor's Quasi-Norms, Part 2\".\nThe complete series was released on DVD on October 14, 2008.", "rate": 65, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Richard Benjamin", "Tim Thomerson", "Conrad Janis", "Patricia Barnstable", "Cyb Barnstable"], "character": ["Adam Quark", "Gene", "Palindrome", "Betty", "Betty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1521   Expand Quark   (1977) User Score Overview Quark is an American science fiction situation comedy starring Richard Benjamin broadcast on NBC. The pilot first aired on May 7, 1977, and the series followed as a mid-season replacement in February 1978. The series was cancelled in April 1978. Quark was created by Buck Henry, co-creator of the spy spoof Get Smart. The show was set on a United Galaxy Sanitation Patrol Cruiser, an interstellar garbage scow operating out of United Galaxies Space Station Perma One in the year 2226. Adam Quark, the main character, works to clean up trash in space by collecting \"space baggies\" with his trusted and highly unusual crew. In its short run, Quark satirized such science fiction as Star Wars, 2001: A Space Odyssey and Flash Gordon. Three of the episodes were direct satires of Star Trek episodes. The series won one Emmy Award nomination, for costume designer Grady Hunt's work in the episode \"All the Emperor's Quasi-Norms, Part 2\". The complete series was released on DVD on October 14, 2008. Featured Crew Buck Henry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Benjamin Adam Quark Tim Thomerson Gene Conrad Janis Palindrome Patricia Barnstable Betty Cyb Barnstable Betty Full Cast & Crew Last Season Season 1 1977 | 8 Episodes Season 1 of Quark premiered on May  7, 1977. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply funny Open 1 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1966-09-12 The Rat Patrol 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Sci-Fi & Fantasy Keywords future satire spaceship space spoof sitcom Content Score 93 Almost there... Top Contributors 16 Banana 9 Steve 1 Daemon M 1 Mark  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}