{"link": "https://www.themoviedb.org/tv/24123?language=en", "title": "The Life and Times of Grizzly Adams", "resume": "The Life and Times of Grizzly Adams is an American television series starring Dan Haggerty that aired on NBC from February 9, 1977 to May 12, 1978.", "rate": 76, "genre": ["Western", "Action", "Adventure"], "cast": ["Denver Pyle", "Dan Haggerty", "John Bishop"], "character": ["Grizzly Adams"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24123   Expand The Life and Times of Grizzly Adams   (1977) User Score  Play Trailer Overview The Life and Times of Grizzly Adams is an American television series starring Dan Haggerty that aired on NBC from February 9, 1977 to May 12, 1978. Featured Crew Charles E. Sellier Jr. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Denver Pyle Dan Haggerty Grizzly Adams John Bishop Full Cast & Crew Last Season Season 2 1977 | 26 Episodes Season 2 of The Life and Times of Grizzly Adams premiered on September 28, 1977. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply M Was Grizzly Adams Open 0 by Moonglum9\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1977-01-14 Fantasy Island 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Action & Adventure Keywords mountain grizzly bear bear wild Content Score 71 Just a little bit more... Top Contributors 20 Banana d 7 denis 3 Marr 🇳🇱 w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}