{"link": "https://www.themoviedb.org/tv/18053?language=en", "title": "Nurse Jackie", "resume": "Every day is a matter of life and death in a hectic New York City hospital, but for Nurse Jackie that's the easiest part. Between chronic back pain that won't quit, and a personal life on the constant edge of collapse, it's going to take a white lie here, a bent rule there, and a handful of secret strategies to relieve the pain, and stay one step ahead of total disaster.", "rate": 71, "genre": ["Drama", "Comedy"], "cast": ["Edie Falco", "Paul Schulze", "Peter Facinelli", "Merritt Wever", "Stephen Wallem"], "character": ["Jackie Peyton", "Eddie Walzer", "Dr. Fitch Cooper", "Zoey Barkow", "Thor Lundgren"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18053   Expand Nurse Jackie   (2009) User Score Overview Every day is a matter of life and death in a hectic New York City hospital, but for Nurse Jackie that's the easiest part. Between chronic back pain that won't quit, and a personal life on the constant edge of collapse, it's going to take a white lie here, a bent rule there, and a handful of secret strategies to relieve the pain, and stay one step ahead of total disaster. Featured Crew Linda Wallem Creator Liz Brixius Creator Evan Dunsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  23 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Edie Falco Jackie Peyton Paul Schulze Eddie Walzer Peter Facinelli Dr. Fitch Cooper Merritt Wever Zoey Barkow Stephen Wallem Thor Lundgren Full Cast & Crew Last Season Season 7 2015 | 12 Episodes Season 7 of Nurse Jackie premiered on April 12, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Nurse Jackie: Happy Birthday Edie Falco! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  23 Posters  13 Recommendations   2009-01-18 United States of Tara 7.3    2006-03-12 Big Love 7.6    2015-05-08 Grace and Frankie 7.8    2011-02-07 The Chicago Code 7.3    2006-03-13 Canada's Worst Handyman 5.0    2011-07-27 The Code 6.7    2009-02-25 Burnistoun 7.8    2010-06-28 Huge 5.5  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.sho.com/site/nursejackie/home.do Genres Drama Comedy Keywords nurse parent child relationship drug addiction addiction hospital drugs Content Score 93 Almost there... Top Contributors 107 Elizabeth Jennings 12 Travis Bell s 11 speedycars S 9 Slevin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}