{"link": "https://www.themoviedb.org/tv/14155?language=en", "title": "Step It Up and Dance", "resume": "Step It Up and Dance is an American reality television competition series where contestants are supposed to \"learn what it takes to make it big in the cutthroat dance industry\". Actress and dancer Elizabeth Berkley serves as host, and director and choreographer Jerry Mitchell mentors the 12 dancers chosen from around the country as they learn a variety of dance styles. Director and choreographer Vincent Paterson and choreographer Nancy O'Meara serve as judges for the competition.\nThe show premiered on April 3, 2008 on Bravo.", "rate": 0, "genre": [], "cast": ["Jerry Mitchell", "Nancy O'Meara", "Nick Drago", "Elizabeth Berkley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14155   Expand Step It Up and Dance   (2008) User Score Overview Step It Up and Dance is an American reality television competition series where contestants are supposed to \"learn what it takes to make it big in the cutthroat dance industry\". Actress and dancer Elizabeth Berkley serves as host, and director and choreographer Jerry Mitchell mentors the 12 dancers chosen from around the country as they learn a variety of dance styles. Director and choreographer Vincent Paterson and choreographer Nancy O'Meara serve as judges for the competition. The show premiered on April 3, 2008 on Bravo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Mitchell Nancy O'Meara Nick Drago Elizabeth Berkley Full Cast & Crew Last Season (season 1) 2008 | 11 Episodes Season 1 of Step It Up and Dance premiered on April  3, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Step It Up and Dance. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 60m Homepage   http://www.bravotv.com/Step_It_Up_And_Dance/season/1//index.php Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}