{"link": "https://www.themoviedb.org/tv/61543?language=en", "title": "King of High School", "resume": "Lee Min Suk is just a normal high school hockey player - until he's forced to take his brother's place as the director for a major company. Now he's forced to balance school work, hockey practice, and making multi-million dollar decisions. No big deal?", "rate": 0, "genre": ["Comedy", "Romance"], "cast": ["Seo In Guk", "Lee Ha-Na", "Lee Soo-Hyuk", "Han Jin-hee", "Lee Tae-hwan"], "character": ["Lee Min-seok / Lee Hyung-seok", "Jung Soo-young", "Yoo Jin-woo", "Yoo Jae-guk", "Oh Tae-seok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61543   Expand King of High School   (2014) User Score Overview Lee Min Suk is just a normal high school hockey player - until he's forced to take his brother's place as the director for a major company. Now he's forced to balance school work, hockey practice, and making multi-million dollar decisions. No big deal? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo In Guk Lee Min-seok / Lee Hyung-seok Lee Ha-Na Jung Soo-young Lee Soo-Hyuk Yoo Jin-woo Han Jin-hee Yoo Jae-guk Lee Tae-hwan Oh Tae-seok Full Cast & Crew Last Season Season 1 2014 | 18 Episodes Season 1 of King of High School premiered on June 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on King of High School. You can help by rating TV shows you've seen. Facts Original Name  고교처세왕 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://program.interest.me/tvn/highking/ Genres Comedy Romance Keywords korea Content Score 86 Almost there... Top Contributors M 52 Maria180493 3 Imzadi CM 1 Cherche Moi 1 MundoAsian  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}