{"link": "https://www.themoviedb.org/tv/79218?language=en", "title": "Tammy’s Tiny Tea Time", "resume": "A maladjusted 42-year-old woman with the emotional capacity of a child shrinks herself  to the size of her toys and forces them to entertain her before introducing several unrelated animated shorts.\nIn each episode, the gang enjoys a lively chat, game, or orgy, and then it’s time for Tammy’s Toonz, which consists of several animated short films by various artists. They’re dark, bizarre, and unforgivably crude, and they have absolutely nothing to do with the main storyline.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Rachel Butera", "Nate Corddry", "Peter Gulsvig"], "character": ["Tammy / Dolla (voice)", "Thomas (voice)", "Babette (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79218   Expand Tammy’s Tiny Tea Time   (2018) User Score Overview A maladjusted 42-year-old woman with the emotional capacity of a child shrinks herself  to the size of her toys and forces them to entertain her before introducing several unrelated animated shorts. In each episode, the gang enjoys a lively chat, game, or orgy, and then it’s time for Tammy’s Toonz, which consists of several animated short films by various artists. They’re dark, bizarre, and unforgivably crude, and they have absolutely nothing to do with the main storyline. Featured Crew Peter Gulsvig Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachel Butera Tammy / Dolla (voice) Nate Corddry Thomas (voice) Peter Gulsvig Babette (voice) Full Cast & Crew Current Season Season 1 2018 | 2 Episodes Season 1 of Tammy’s Tiny Tea Time premiered on April 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tammy’s Tiny Tea Time. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  4m, 12m, 15m, 18m, 10m, 7m Homepage   http://cartuna.com/#/our-originals/tammy-s-tiny-tea-time Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 36 Mikedeth5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}