{"link": "https://www.themoviedb.org/tv/66982?language=en", "title": "Достоевский", "resume": "Biopic covering a large portion of Fyodor Mikhailovich Dostoevsky's life, from the Petrashevsky Circle to the writing of The Brothers Karamazov.", "rate": 70, "genre": ["Drama"], "cast": ["Alla Yuganova", "Evgeny Mironov", "Elizaveta Arzamasova", "Pavel Barshak", "Sergey Zamorev"], "character": ["Anna Snitkina", "Dostoyevsky", "Sofia Korvin-Krukovskaya", "Alexandre Vrangel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66982   Expand Достоевский   (2011) User Score Overview Biopic covering a large portion of Fyodor Mikhailovich Dostoevsky's life, from the Petrashevsky Circle to the writing of The Brothers Karamazov. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alla Yuganova Anna Snitkina Evgeny Mironov Dostoyevsky Elizaveta Arzamasova Sofia Korvin-Krukovskaya Pavel Barshak Alexandre Vrangel Sergey Zamorev Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of Достоевский premiered on May 22, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Достоевский. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Russian Runtime  60m Homepage   https://russia.tv/brand/show/brand_id/5307/ Genres Drama Keywords russia biography writer 19th century Content Score 71 Just a little bit more... Top Contributors 29 Banana V 4 VintageSmoke 3 mrtextortexel s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}