{"link": "https://www.themoviedb.org/tv/60603?language=en", "title": "The Curse of Oak Island", "resume": "The Curse of Oak Island follows brothers Marty and Rick Lagina originally from Kingsford, Michigan through their effort to find the speculated - and as of yet undiscovered - buried treasure believed to have been concealed through extraordinary means on Oak Island. The brothers became fascinated with the island after reading the January, 1965 issue of Reader's Digest magazine which featured an article on the Restall family's work to solve the mystery of the so-called \"Money Pit.\"", "rate": 71, "genre": ["Mystery", "Documentary"], "cast": ["Robert Clotworthy", "Rick Lagina", "Marty Lagina"], "character": ["Narrator", "Rick Lagina", "Marty Lagina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60603   Expand The Curse of Oak Island   (2014) User Score  Play Trailer Overview The Curse of Oak Island follows brothers Marty and Rick Lagina originally from Kingsford, Michigan through their effort to find the speculated - and as of yet undiscovered - buried treasure believed to have been concealed through extraordinary means on Oak Island. The brothers became fascinated with the island after reading the January, 1965 issue of Reader's Digest magazine which featured an article on the Restall family's work to solve the mystery of the so-called \"Money Pit.\" Featured Crew Kevin Burns Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Clotworthy Narrator Rick Lagina Rick Lagina Marty Lagina Marty Lagina Full Cast & Crew Current Season Season 5 2017 | 18 Episodes Season 5 of The Curse of Oak Island premiered on November  7, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply g Where are the IM*b posters Open 6 by  jdoe00218 Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations   2012-01-21 America's Book of Secrets 4.8    2014-02-28 Hangar 1: The UFO Files 6.6    2012-03-27 NASA's Unexplained Files 7.7    2015-01-08 Expedition Unknown 7.8    2007-06-06 Destination Truth 7.6    2010-10-25 American Restoration 6.1    2008-01-30 UFO Hunters 6.2    1977-01-30 The Hardy Boys / Nancy Drew Mysteries 6.7  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  60m Homepage   http://history.com/shows/the-curse-of-oak-island Genres Mystery Documentary Keywords treasure hunt Content Score 71 Just a little bit more... Top Contributors C 33 Cato 19 Elizabeth Jennings JM 10 James Maxwel j 9 jwkk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}