{"link": "https://www.themoviedb.org/tv/10347?language=en", "title": "The Amazing Chan and the Chan Clan", "resume": "The Amazing Chan and the Chan Clan is a 1972 TV series made by Australia's Eric Porter Studios for American Hanna-Barbera Studios and CBS. It premiered shortly after what would have been Charlie Chan creator Earl Derr Biggers' 88th birthday. The voice of Mr. Chan, Keye Luke is the only actor of Chinese ancestry to play the title character in any screen adaptation.", "rate": 50, "genre": ["Animation"], "cast": ["Keye Luke", "Don Messick", "Gene Andrusco", "Brian Tochi", "Lennie Weinrib"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10347   Expand The Amazing Chan and the Chan Clan   (1972) User Score Overview The Amazing Chan and the Chan Clan is a 1972 TV series made by Australia's Eric Porter Studios for American Hanna-Barbera Studios and CBS. It premiered shortly after what would have been Charlie Chan creator Earl Derr Biggers' 88th birthday. The voice of Mr. Chan, Keye Luke is the only actor of Chinese ancestry to play the title character in any screen adaptation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Keye Luke Don Messick Gene Andrusco Brian Tochi Lennie Weinrib Full Cast & Crew Last Season Season 2 1972 | 8 Episodes Season 2 of The Amazing Chan and the Chan Clan premiered on November  4, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Amazing Chan and the Chan Clan. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 3 Minicocoxt TB 1 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}