{"link": "https://www.themoviedb.org/tv/72792?language=en", "title": "Safe", "resume": "After his daughter goes missing, a widower begins uncovering the dark secrets of the people closest to him.", "rate": 69, "genre": ["Drama", "Crime"], "cast": ["Michael C. Hall", "Amanda Abbington", "Audrey Fleurot", "Hannah Arterton", "Emmett Scanlan"], "character": ["Tom", "Sophie", "Zoe", "Emma", "Josh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72792   Expand Safe   (2018) User Score  Play Trailer Overview After his daughter goes missing, a widower begins uncovering the dark secrets of the people closest to him. Featured Crew Harlan Coben Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael C. Hall Tom Amanda Abbington Sophie Audrey Fleurot Zoe Hannah Arterton Emma Emmett Scanlan Josh Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Safe premiered on May 10, 2018. View All Seasons Social Reviews  1 Discussions  1 A review by TreesOfEternity  2.0 Written by  TreesOfEternity  on June 28, 2018 A story about a gated community. Oh yes, such things are so common in the UK, aren't they? The story itself isn't so bad. Far-fetched, but that's what one expects from a TV drama. No, the real problem is the appalling acting. Every actor in this show is truly terrible. It's not that the acting is wooden. I could've coped with that. If you've seen the Spinal Tap movie you'll remember they wrote a musical about Jack the Ripper: Saucy Jack. Well this dross is about as close to Saucy Jack as it's possible to get. The acting reaches its nadir with cockney barrow boy knees up dahn the Old Kent Road c...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  10 Posters  4 Recommendations   2017-11-02 Borderliner 6.7    2017-10-06 Suburra: Blood on Rome 7.5    2018-03-26 The Chalet 7.3    2018-02-02 Requiem 6.4    2018-02-23 Seven Seconds 8.2    2018-05-04 The Rain 6.1    2017-10-29 Tabula Rasa 7.8    2017-08-01 Manhunt: Unabomber 7.8  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   https://www.netflix.com/title/80240177 Genres Drama Crime Keywords thriller crime Content Score 100 Yes! Looking good! Top Contributors 44 Elizabeth Jennings 16 Maretoh 9 Alessandro n 8 namsan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}