{"link": "https://www.themoviedb.org/tv/14530?language=en", "title": "The Roy Rogers Show", "resume": "The Roy Rogers Show is an American Western television series that broadcast one hundred episodes on NBC for six seasons between December 30, 1951 and June 9, 1957. The show starred Roy Rogers as a ranch owner, Dale Evans as the proprietress of the Eureka Cafe in fictional Mineral City, and Pat Brady as Roy’s sidekick and Dale's cook. Brady's jeep Nellybelle had a mind of her own and often sped away driverless with Brady in frantic pursuit on foot. Animal stars were Roy's Palomino horse, Trigger and his German Shepherd wonder dog, Bullet.\nThe show was filmed at the Samuel Goldwyn Studio, and originally sponsored by General Foods. The show's theme song, “Happy Trails”, was written by Dale Evans and sung over the end credits by Rogers and Evans.\nThe show received an Emmy nomination in 1955 for Best Western or Adventure Series, but it lost out to the syndicated Stories of the Century, an anthology series starring and narrated by Jim Davis.\nBeginning in 1961, CBS broadcast reruns of The Roy Rogers Show for three and a half seasons on Saturday mornings. Reruns also aired in France in 1962. Reruns are currently being aired on RFD-TV, which also sells T-shirts and plush toys of Trigger and Bullet. Reruns are also currently broadcast on local Christian television channel in Florida, \"Good Life 45\".", "rate": 0, "genre": ["Western"], "cast": ["Roy Rogers", "Dale Evans", "Pat Brady", "Trigger"], "character": ["Roy Rogers", "Dale Evans", "Pat Brady", "Trigger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14530   Expand The Roy Rogers Show   (1951) User Score Overview The Roy Rogers Show is an American Western television series that broadcast one hundred episodes on NBC for six seasons between December 30, 1951 and June 9, 1957. The show starred Roy Rogers as a ranch owner, Dale Evans as the proprietress of the Eureka Cafe in fictional Mineral City, and Pat Brady as Roy’s sidekick and Dale's cook. Brady's jeep Nellybelle had a mind of her own and often sped away driverless with Brady in frantic pursuit on foot. Animal stars were Roy's Palomino horse, Trigger and his German Shepherd wonder dog, Bullet. The show was filmed at the Samuel Goldwyn Studio, and originally sponsored by General Foods. The show's theme song, “Happy Trails”, was written by Dale Evans and sung over the end credits by Rogers and Evans. The show received an Emmy nomination in 1955 for Best Western or Adventure Series, but it lost out to the syndicated Stories of the Century, an anthology series starring and narrated by Jim Davis. Beginning in 1961, CBS broadcast reruns of The Roy Rogers Show for three and a half seasons on Saturday mornings. Reruns also aired in France in 1962. Reruns are currently being aired on RFD-TV, which also sells T-shirts and plush toys of Trigger and Bullet. Reruns are also currently broadcast on local Christian television channel in Florida, \"Good Life 45\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roy Rogers Roy Rogers Dale Evans Dale Evans Pat Brady Pat Brady Trigger Trigger Full Cast & Crew Last Season Season 6 1956 | 15 Episodes Season 6 of The Roy Rogers Show premiered on October 21, 1956. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Roy Rogers Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Western Keywords ranch cowboy fighting crime Content Score 86 Almost there... Top Contributors 18 Banana _ 7 _mce_ 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}