{"link": "https://www.themoviedb.org/tv/46679?language=en", "title": "Further Tales of the City", "resume": "In this third installment of Armistead Maupin's engaging saga, some denizens of 28 Barbary Lane venture beyond the City by the Bay-to the home of a Hollywood icon, even to a remote Alaskan island.", "rate": 85, "genre": ["Drama"], "cast": ["Bruce McCulloch", "Olympia Dukakis", "Laura Linney", "Barbara Garrick", "William Campbell"], "character": ["Father Sean 'Paddy' P. Starr", "Anna Madrigal", "Mary Ann Singleton", "DeDe Halcyon Day", "Dr. Jon Fielding"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46679   Expand Further Tales of the City   (2001) User Score Overview In this third installment of Armistead Maupin's engaging saga, some denizens of 28 Barbary Lane venture beyond the City by the Bay-to the home of a Hollywood icon, even to a remote Alaskan island. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruce McCulloch Father Sean 'Paddy' P. Starr Olympia Dukakis Anna Madrigal Laura Linney Mary Ann Singleton Barbara Garrick DeDe Halcyon Day William Campbell Dr. Jon Fielding Full Cast & Crew Last Season Miniseries 2001 | 4 Episodes Season 1 of Further Tales of the City premiered on May  6, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Further Tales of the City. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Drama Keywords based on novel or book aids gay san francisco lesbian miniseries lgbt Content Score 86 Almost there... Top Contributors 28 Banana TB 13 TMDb Bot l 1 lucybenson S 1 Saltpieter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}