{"link": "https://www.themoviedb.org/tv/34202?language=en", "title": "Dokkoida?!", "resume": "Dokkoida?! is about a boy, Suzuo Sakurazaki, who is hired by a preteen space alien girl, Tanpopo, to try out an experimental new suit developed by the intergalactic toy company that she works for. Suzuo agrees to work for her since he is unemployed and needs the job to pay the rent. The suit gives him super powers, with which he fights bad guys and people from rival intergalactic toy companies and organizations", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Kaori Shimizu", "Kotono Mitsuishi", "Rie Kugimiya", "Namikawa Daisuke", "Kenichi Ogata"], "character": ["Asaka Nogiku", "Sayuri Yurine", "Ruri Umeki", "Suzuo Sakurazaki", "Kurisaburou Kurinohara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34202   Expand Dokkoida?!   (2003) User Score Overview Dokkoida?! is about a boy, Suzuo Sakurazaki, who is hired by a preteen space alien girl, Tanpopo, to try out an experimental new suit developed by the intergalactic toy company that she works for. Suzuo agrees to work for her since he is unemployed and needs the job to pay the rent. The suit gives him super powers, with which he fights bad guys and people from rival intergalactic toy companies and organizations Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaori Shimizu Asaka Nogiku Kotono Mitsuishi Sayuri Yurine Rie Kugimiya Ruri Umeki Namikawa Daisuke Suzuo Sakurazaki Kenichi Ogata Kurisaburou Kurinohara Full Cast & Crew Last Season Dokkoida?! season 1 2003 | 12 Episodes Season 1 of Dokkoida?! premiered on July  5, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dokkoida?!. You can help by rating TV shows you've seen. Facts Original Name  住めば都のコスモス荘・すっとこ大戦ドッコイダーDokkoida?! Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.ufotable.com/cosmos/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 7 tmdb983464 5 cwhboy 2 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}