{"link": "https://www.themoviedb.org/tv/70267?language=en", "title": "Empire", "resume": "Empire is a unique programme that reports on and debates global powers on behalf of an international citizen. It does so in a way whereby it questions those geopolitical, geoeconomic, corporate, and other forms of power that influence citizens across borders. Many of those are not held accountable by any one government or any one nation, and so looking at the world as the global village it has become - with its integrated societies - we try to answer the questions on the minds of many of our viewers: why and how does global power act, react? And how does it throw its weight around?", "rate": 0, "genre": ["Documentary", "News", "War", "Politics"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70267   Expand Empire   (2009) User Score Overview Empire is a unique programme that reports on and debates global powers on behalf of an international citizen. It does so in a way whereby it questions those geopolitical, geoeconomic, corporate, and other forms of power that influence citizens across borders. Many of those are not held accountable by any one government or any one nation, and so looking at the world as the global village it has become - with its integrated societies - we try to answer the questions on the minds of many of our viewers: why and how does global power act, react? And how does it throw its weight around? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season 2017 2017 | 1 Episode Season 7 of Empire premiered on January 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Empire. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  - Homepage   http://www.aljazeera.com/programmes/empire Genres Documentary News War & Politics Keywords war politics democracy global domination geopolitical Content Score 56 We're so close, yet so far. Top Contributors b 30 bielcarvalho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}