{"link": "https://www.themoviedb.org/tv/71769?language=en", "title": "The Alienist", "resume": "Crime reporter, John Moore, meets with psychologist, Dr. Laszlo Kreizler, to investigate a serial killer in New York during the late 19th century.", "rate": 72, "genre": ["Drama", "Crime"], "cast": ["Luke Evans", "Dakota Fanning", "Daniel Brühl", "Martin McCreadie", "Douglas Smith"], "character": ["John Moore", "Sara Howard", "Dr. Laszlo Kreizler", "Sergeant Doyle", "Marcus Isaacson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71769   Expand The Alienist   (2018) User Score  Play Trailer Overview Crime reporter, John Moore, meets with psychologist, Dr. Laszlo Kreizler, to investigate a serial killer in New York during the late 19th century. Featured Crew Cary Fukunaga Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Evans John Moore Dakota Fanning Sara Howard Daniel Brühl Dr. Laszlo Kreizler Martin McCreadie Sergeant Doyle Douglas Smith Marcus Isaacson Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of The Alienist premiered on January 22, 2018. View All Seasons Social Reviews  2 Discussions  3 PE A review by Patrick E. Abe  6.0 Written by  Patrick E. Abe  on February 19, 2018 I just finished episode #4 and this \"journey through the past\" has a blah feel to it. \"Murdoch Mysteries,\" which covers some of the same era has that Something this production lacks. NYC Police Commissioner \"Theodore Roosevelt\" comes across like \"Theodore Cleaver\" of long-ago \"Leave It To Beaver. He's no \"Inspector Brackenreid,\" who is a tough, go-getter, like the historical Teddy Roosevelt. As for the \"Dancing Boys of New York City,\" the criminal exploitation of preteen boys isn't as rage-inducing as present day Afghanistan practices by Rich/Powerful men. Maybe it's the \"lit by weak candles\" d...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  5 Posters  5 Recommendations   2018-03-25 Trust 7.4    2018-05-06 Sweetbitter 8.3    2017-11-07 Damnation 7.2    2018-02-23 Seven Seconds 8.2    2018-05-14 Innocent 9.5    2017-12-10 Counterpart 7.2    2018-02-26 Good Girls 5.8    2018-02-11 Here and Now 7.7  Facts Status  Returning Series Network Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Scripted Original Language  English Runtime  50m Homepage   http://www.tntdrama.com/shows/the-alienist Genres Drama Crime Keywords based on novel or book serial killer historical fiction crime mental illness criminal investigation 19th century Content Score 100 Yes! Looking good! Top Contributors 58 Elizabeth Jennings m 12 misfit_noel 8 AR2030 7 Marso  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}