{"link": "https://www.themoviedb.org/tv/12026?language=en", "title": "Reilly, Ace of Spies", "resume": "Reilly, Ace of Spies is a 1983 television miniseries dramatizing the life of Sidney Reilly, a Russian Jew who became one of the greatest spies ever to work for the British. Among his exploits, in the early 20th century, were the infiltration of the German General Staff in 1917 and a near-overthrow of the Bolsheviks in 1918. His reputation with women was as legendary as his genius for espionage.", "rate": 68, "genre": ["Crime", "Drama"], "cast": ["Sam Neill"], "character": ["Sidney Reilly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12026   Expand Reilly, Ace of Spies   (1983) User Score Overview Reilly, Ace of Spies is a 1983 television miniseries dramatizing the life of Sidney Reilly, a Russian Jew who became one of the greatest spies ever to work for the British. Among his exploits, in the early 20th century, were the infiltration of the German General Staff in 1917 and a near-overthrow of the Bolsheviks in 1918. His reputation with women was as legendary as his genius for espionage. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Neill Sidney Reilly Full Cast & Crew Last Season Miniseries 1983 | 12 Episodes Season 1 of Reilly, Ace of Spies premiered on September  5, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2000-10-01 Unit One 6.9    1982-09-20 Smiley's People 7.9    2012-10-11 Copper 6.0    2005-09-16 Threshold 6.9    1995-09-22 Space: Above and Beyond 6.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Crime Drama Keywords espionage spy miniseries 20th century Content Score 56 We're so close, yet so far. Top Contributors 16 Banana R 6 Rebecca TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}