{"link": "https://www.themoviedb.org/tv/45865?language=en", "title": "Sparkling Girls", "resume": "Sparkling Girls tells the story of three young and lovely, hard-working housekeepers who rise to stardom overnight after an incidentally uploaded online video of their singing performance becomes an unexpected hit.  Penha, Rosário, and Cida, all make an honest living cleaning, cooking, and picking up after their bosses. Besides an everlasting friendship, these three ordinary women also share the similar struggle of finding romantic love. The future music stars never imagined all the glitz and glamour that their lives would turn into.", "rate": 0, "genre": ["Comedy", "Drama", "Music"], "cast": ["Sylvia Nazareth", "Humberto Carrão", "Marcos Palmeira", "Leandra Leal", "Daniel Dantas"], "character": ["Alana", "Elano", "Sandro", "Rosário", "Sidney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45865   Expand Sparkling Girls User Score Overview Sparkling Girls tells the story of three young and lovely, hard-working housekeepers who rise to stardom overnight after an incidentally uploaded online video of their singing performance becomes an unexpected hit.  Penha, Rosário, and Cida, all make an honest living cleaning, cooking, and picking up after their bosses. Besides an everlasting friendship, these three ordinary women also share the similar struggle of finding romantic love. The future music stars never imagined all the glitz and glamour that their lives would turn into.  Featured Crew Felipe Miguez Creator Izabel de Oliveira Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sylvia Nazareth Alana Humberto Carrão Elano Marcos Palmeira Sandro Leandra Leal Rosário Daniel Dantas Sidney Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Original Name  Cheias de Charme Status  Ended Network Certification 10 Meaning Content suitable for viewers over the age of 10. Type  Scripted Original Language  Portuguese Runtime  60m Homepage   http://gshow.globo.com/novelas/cheias-de-charme/index.html Genres Comedy Drama Music Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors VF 32 Vitor Fernandes 4 Tiago Silva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}