{"link": "https://www.themoviedb.org/tv/589?language=en", "title": "Remington Steele", "resume": "Remington Steele is an American television series co-created by Robert Butler and Michael Gleason. The series, starring Stephanie Zimbalist and Pierce Brosnan, was produced by MTM Enterprises and first broadcast on the NBC network from 1982 to 1987. The series blended the genres of romantic comedy, drama, and detective procedural. Remington Steele is best known for launching the career of Pierce Brosnan and for serving as a forerunner of the similar series Moonlighting.\nRemington Steele's premise is that Laura Holt, a licensed private detective played by Stephanie Zimbalist, opened a detective agency under her own name but found that potential clients refused to hire a woman, however qualified. To solve the problem, Laura invents a fictitious male superior whom she names Remington Steele. Through a series of events that unfold in the first episode, \"License to Steele\", Pierce Brosnan's character, a former thief and con man whose real name is never revealed, assumes the identity of Remington Steele. Behind the scenes, Laura remains firmly in charge.", "rate": 71, "genre": ["Drama", "Comedy"], "cast": ["Stephanie Zimbalist", "Pierce Brosnan", "Doris Roberts"], "character": ["Laura Holt", "Remington Steele", "Mildred Krebs"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 589   Expand Remington Steele   (1982) User Score  Play Trailer Overview Remington Steele is an American television series co-created by Robert Butler and Michael Gleason. The series, starring Stephanie Zimbalist and Pierce Brosnan, was produced by MTM Enterprises and first broadcast on the NBC network from 1982 to 1987. The series blended the genres of romantic comedy, drama, and detective procedural. Remington Steele is best known for launching the career of Pierce Brosnan and for serving as a forerunner of the similar series Moonlighting. Remington Steele's premise is that Laura Holt, a licensed private detective played by Stephanie Zimbalist, opened a detective agency under her own name but found that potential clients refused to hire a woman, however qualified. To solve the problem, Laura invents a fictitious male superior whom she names Remington Steele. Through a series of events that unfold in the first episode, \"License to Steele\", Pierce Brosnan's character, a former thief and con man whose real name is never revealed, assumes the identity of Remington Steele. Behind the scenes, Laura remains firmly in charge. Featured Crew Robert Butler Creator Michael Gleason Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  7 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephanie Zimbalist Laura Holt Pierce Brosnan Remington Steele Doris Roberts Mildred Krebs Full Cast & Crew Last Season Season 5 1987 | 7 Episodes Season 5 of Remington Steele premiered on January  5, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  7 Posters  7 Recommendations   1981-11-24 Simon & Simon 6.6    1975-09-10 Starsky & Hutch 6.5    1985-03-03 Moonlighting 7.2    1982-09-26 Matt Houston 6.6    1976-10-03 Quincy, M.E. 7.0    1962-10-04 The Saint 7.2    1973-10-24 Kojak 7.4    1983-10-03 Scarecrow and Mrs. King 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Comedy Keywords con man sexism private investigator private detective detective agency Content Score 71 Just a little bit more... Top Contributors 21 Banana 19 lineker 16 Imzadi p 6 pertolero  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}