{"link": "https://www.themoviedb.org/tv/40401?language=en", "title": "Big Thing", "resume": "Big Thing is a 2010 South Korean television drama based on manhwa artist Park In-kwon's comic Daemul, and stars Go Hyun-jung as Korea's first female president. Number one in its timeslot for 11 consecutive weeks, it gained successful ratings due to its stellar cast and story arcs taken from topical and controversial headlines.", "rate": 0, "genre": ["Drama"], "cast": ["Ko Hyun-jung", "Kwon Sang-Woo", "Cha In-pyo", "Park Hae Mi", "Song Ok-Suk"], "character": ["Seo Hye-rim", "Ha Do-ya", "Madam Min"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40401   Expand Big Thing   (2010) User Score Overview Big Thing is a 2010 South Korean television drama based on manhwa artist Park In-kwon's comic Daemul, and stars Go Hyun-jung as Korea's first female president. Number one in its timeslot for 11 consecutive weeks, it gained successful ratings due to its stellar cast and story arcs taken from topical and controversial headlines. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ko Hyun-jung Seo Hye-rim Kwon Sang-Woo Ha Do-ya Cha In-pyo Park Hae Mi Song Ok-Suk Madam Min Full Cast & Crew Last Season Season 1 2010 | 24 Episodes Season 1 of Big Thing premiered on October  6, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Big Thing. You can help by rating TV shows you've seen. Facts Original Name  대물 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.tv.sbs.co.kr/president/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 9 tmdb38202327 p 9 pureh2o LS 3 Lee Seung-Su A 2 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}