{"link": "https://www.themoviedb.org/tv/18965?language=en", "title": "Once an Eagle", "resume": "Once An Eagle is a 1976 nine-hour American television mini-series directed by Richard Michaels and E.W. Swackhamer. The picture was written by Peter S. Fischer and based on the 1968 Anton Myrer novel of the same name.\nThe first and last installments of the seven-part series were each two-hour broadcasts, while the interim episodes were 60 minutes.\nThe mini-series concerns the thirty year careers of two military men, from the outbreak of World War I to the aftermath of World War II.", "rate": 80, "genre": ["Drama"], "cast": ["Darleen Carr", "Sam Elliott", "Lynda Day George", "Amy Irving", "Dane Clark"], "character": ["Tommy Caldwell", "Sam Damon", "Emily Pawlfrey Massengale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18965   Expand Once an Eagle   (1976) User Score Overview Once An Eagle is a 1976 nine-hour American television mini-series directed by Richard Michaels and E.W. Swackhamer. The picture was written by Peter S. Fischer and based on the 1968 Anton Myrer novel of the same name. The first and last installments of the seven-part series were each two-hour broadcasts, while the interim episodes were 60 minutes. The mini-series concerns the thirty year careers of two military men, from the outbreak of World War I to the aftermath of World War II. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Darleen Carr Tommy Caldwell Sam Elliott Sam Damon Lynda Day George Amy Irving Emily Pawlfrey Massengale Dane Clark Full Cast & Crew Last Season Season 1 1976 | 7 Episodes Season 1 of Once an Eagle premiered on December  2, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Once an Eagle. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords based on novel or book world war i world war ii miniseries Content Score 86 Almost there... Top Contributors TB 15 TMDb Bot 8 Banana R 6 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}