{"link": "https://www.themoviedb.org/tv/2260?language=en", "title": "H2O: Just Add Water", "resume": "H2O: Just Add Water revolves around three teenage girls facing everyday teen problems with an added twist: they cope with the burden of growing a giant fin and transforming into mermaids whenever they come in contact with water.", "rate": 65, "genre": ["Drama", "Family", "Sci-Fi", "Fantasy"], "cast": ["Cariba Heine", "Phoebe Tonkin", "Angus McLaren", "Indiana Evans", "Luke Mitchell"], "character": ["Rikki Chadwick", "Cleo Sertori", "Lewis McCartney", "Isabel \"Bella\" Hartley", "Will Benjamin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2260   Expand H2O: Just Add Water   (2006) User Score Overview H2O: Just Add Water revolves around three teenage girls facing everyday teen problems with an added twist: they cope with the burden of growing a giant fin and transforming into mermaids whenever they come in contact with water. Featured Crew Jonathan M. Shiff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  12 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cariba Heine Rikki Chadwick Phoebe Tonkin Cleo Sertori Angus McLaren Lewis McCartney Indiana Evans Isabel \"Bella\" Hartley Luke Mitchell Will Benjamin Full Cast & Crew Last Season Season 3 2009 | 26 Episodes Season 3 of H2O: Just Add Water premiered on October 10, 2009. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply w Kim Sertori: Happy Birthday Cleo Massey! Open 0 by wonder2wonder\n      \n     w Lewis: Happy Birthday Angus McLaren! Open 0 by wonder2wonder\n      \n     w Rikki: Happy Birthday Cariba Heine! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  12 Posters  9 Recommendations   2013-09-28 Mako: Island of Secrets 5.8    2011-02-08 Traffic Light 7.2    2013-12-24 Turbo FAST 4.7    2014-04-28 Heartless 5.9    1998-02-06 Power Rangers in Space 6.8    2015-06-18 Hoff the Record 6.0    2015-12-01 Real Rob 5.8    2017-01-01 Beau Séjour 7.9  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  24m Homepage   http://h2o.zdfe-b2c.de/season3/index.html Genres Drama Family Sci-Fi & Fantasy Keywords australia mermaid teenager supernatural teen Content Score 93 Almost there... Top Contributors 119 Marr 🇳🇱 10 Atanas x 7 xPR 7 BlackDelivery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}