{"link": "https://www.themoviedb.org/tv/38210?language=en", "title": "Twenty Twelve", "resume": "Twenty Twelve is a BBC television comedy series written and directed by John Morton. Starring Hugh Bonneville, Jessica Hynes and Amelia Bullmore, the programme is a spoof on-location documentary following the organisation of the 2012 Summer Olympics in London. It was first broadcast on UK television station BBC Four in March 2011 to coincide with the 500 day countdown to the opening ceremony.\nTwenty Twelve gained mainly positive reviews from critics, and a four-part second series was announced on 15 April 2011, which began airing on 30 March 2012 on BBC Two. A further three episodes of series 2 began airing from 10 July 2012. The series' last episode was broadcast on 24 July 2012, three days before the opening ceremony of the London Olympic Games.", "rate": 74, "genre": ["Comedy"], "cast": ["Hugh Bonneville", "Olivia Colman", "Jessica Hynes", "Amelia Bullmore", "Karl Theobald"], "character": ["Ian Fletcher", "Sally Owen", "Siobhan Sharpe", "Kay Hope", "Graham Hitchens"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38210   Expand Twenty Twelve   (2011) User Score Overview Twenty Twelve is a BBC television comedy series written and directed by John Morton. Starring Hugh Bonneville, Jessica Hynes and Amelia Bullmore, the programme is a spoof on-location documentary following the organisation of the 2012 Summer Olympics in London. It was first broadcast on UK television station BBC Four in March 2011 to coincide with the 500 day countdown to the opening ceremony. Twenty Twelve gained mainly positive reviews from critics, and a four-part second series was announced on 15 April 2011, which began airing on 30 March 2012 on BBC Two. A further three episodes of series 2 began airing from 10 July 2012. The series' last episode was broadcast on 24 July 2012, three days before the opening ceremony of the London Olympic Games. Featured Crew John Morton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Bonneville Ian Fletcher Olivia Colman Sally Owen Jessica Hynes Siobhan Sharpe Amelia Bullmore Kay Hope Karl Theobald Graham Hitchens Full Cast & Crew Last Season Season 2 2012 | 7 Episodes Season 2 of Twenty Twelve premiered on March 30, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Twenty Twelve. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00yw1t9 Genres Comedy Keywords london england olympic games mockumentary sitcom british humour workplace comedy Content Score 93 Almost there... Top Contributors 17 Markxist O 8 Ozbourne 5 Banana 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}