{"link": "https://www.themoviedb.org/tv/13700?language=en", "title": "Indian Idol", "resume": "Indian Idol is the Indian version of the Pop Idol format. It started airing in India with the first season in 2004–2005 and was followed by second (2005–2006), third (2007) and fourth (2008–2009) seasons. The fifth season of Indian aired on Sony TV in 2010. It was launched by the programming team at SET of Tarun Katial and Anupama Mandloi.\nThe winner of the first season of Indian Idol was Abhijeet Sawant from Mumbai. The season was aired from October 2004 to March 2005 on Sony TV. \nThe second season aired on Sony TV from 21 November 2005 to 22 April 2006. The winner was Sandeep Acharya.\nThe show's third season aired on Sony TV from 4 May 2007 to 23 September 2007. The winner was Prashant Tamang, who hails from Kolkata in West Bengal and of Nepali origin. The runner-up, Amit Paul, was from Shillong, Meghalaya.\nThe fourth season of Indian Idol was aired on Sony TV from 19 September 2008 to 1 March 2009. For the first time in Indian Idol history, there were two women among the top three finalists. Sourabhee Debbarma won the competition and became the first female contestant to do so.\nThe Fifth season of Indian Idol started airing on Sony TV from 26 April 2010 and concluded on 15 August 2010, when Sreeram Chandra, participant from Hyderabad, India was named the Indian Idol 5. In addition to a recording contract with Sony BMG, the winner of Indian Idol 5 was awarded a one-year contract with Sony Entertainment Television worth 50,00,000, a Suzuki GS-150R motorbike, a Tata Winger Platinum car and a chance to be a playback singer in a forthcoming movie of Yash Raj Films, said a press release issued by Sony Entertainment Television. One of the Top 5 Contestants will also be given the opportunity to become an RJ in Radio Mirchi 98.3 FM.\nIndian Idol 6 – started from 1 June 2012 and ended on 1 September 2012. Apart from the last seasons' judges including Anu Malik, Sunidhi Chauhan and Salim Merchant, this season had new judge 'Asha Bhosle' after audition rounds. The winner is Vipul Mehta from Amritsar, Punjab.\nThe show makes a come back on Indian Television after a gap of four years. Sonu Nigam is one of the judges this season. He makes a comeback to the show after a decade.[8] Other judges of the show are Anu Malik and Farah Khan.", "rate": 65, "genre": ["Reality"], "cast": ["Farah Khan", "Anu Malik", "Sonu Nigam", "Karan Wahi"], "character": ["Herself - Judge", "Himself - Judge", "Himself - Judge", "Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13700   Expand Indian Idol   (2004) User Score Overview Indian Idol is the Indian version of the Pop Idol format. It started airing in India with the first season in 2004–2005 and was followed by second (2005–2006), third (2007) and fourth (2008–2009) seasons. The fifth season of Indian aired on Sony TV in 2010. It was launched by the programming team at SET of Tarun Katial and Anupama Mandloi. The winner of the first season of Indian Idol was Abhijeet Sawant from Mumbai. The season was aired from October 2004 to March 2005 on Sony TV.  The second season aired on Sony TV from 21 November 2005 to 22 April 2006. The winner was Sandeep Acharya. The show's third season aired on Sony TV from 4 May 2007 to 23 September 2007. The winner was Prashant Tamang, who hails from Kolkata in West Bengal and of Nepali origin. The runner-up, Amit Paul, was from Shillong, Meghalaya. The fourth season of Indian Idol was aired on Sony TV from 19 September 2008 to 1 March 2009. For the first time in Indian Idol history, there were two women among the top three finalists. Sourabhee Debbarma won the competition and became the first female contestant to do so. The Fifth season of Indian Idol started airing on Sony TV from 26 April 2010 and concluded on 15 August 2010, when Sreeram Chandra, participant from Hyderabad, India was named the Indian Idol 5. In addition to a recording contract with Sony BMG, the winner of Indian Idol 5 was awarded a one-year contract with Sony Entertainment Television worth 50,00,000, a Suzuki GS-150R motorbike, a Tata Winger Platinum car and a chance to be a playback singer in a forthcoming movie of Yash Raj Films, said a press release issued by Sony Entertainment Television. One of the Top 5 Contestants will also be given the opportunity to become an RJ in Radio Mirchi 98.3 FM. Indian Idol 6 – started from 1 June 2012 and ended on 1 September 2012. Apart from the last seasons' judges including Anu Malik, Sunidhi Chauhan and Salim Merchant, this season had new judge 'Asha Bhosle' after audition rounds. The winner is Vipul Mehta from Amritsar, Punjab. The show makes a come back on Indian Television after a gap of four years. Sonu Nigam is one of the judges this season. He makes a comeback to the show after a decade.[8] Other judges of the show are Anu Malik and Farah Khan. Featured Crew Simon Fuller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Farah Khan Herself - Judge Anu Malik Himself - Judge Sonu Nigam Himself - Judge Karan Wahi Himself - Host Full Cast & Crew Last Season Season 7 2016 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Indian Idol. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  Hindi Runtime  60m Homepage   http://www.setindia.com/us-en/shows/indian-idol/23 Genres Reality Keywords singing competition Content Score 79 Pump it up! We're close now. Top Contributors s 299 shahdk L 25 Leah 5 Banana r 3 rina29  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}