{"link": "https://www.themoviedb.org/tv/62271?language=en", "title": "Ho Goo's Love", "resume": "It's not easy being Ho Goo, a low-key guy who can neither score a date nor score high enough on his civil service exams, which he's failed 7 years running. But when he has a chance reunion with national swimming champion Do Hee, the most popular girl of his high school, his luck begins to change — perhaps for the worse. After staying out all night with Do Hee, Ho Goo experiences a rude awakening when he realizes that not only has Do Hee left him, she's also pregnant!", "rate": 70, "genre": ["Comedy", "Drama", "Romance"], "cast": ["Uee", "Choi Woo-shik", "Im Seul-ong", "Lee Soo-kyung", "Kim Hyun-joon"], "character": ["Do Do-hee", "Kang Ho-goo", "Byun Kang-chul", "Kang Ho-kyung", "No Gyeong-woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62271   Expand Ho Goo's Love   (2015) User Score Overview It's not easy being Ho Goo, a low-key guy who can neither score a date nor score high enough on his civil service exams, which he's failed 7 years running. But when he has a chance reunion with national swimming champion Do Hee, the most popular girl of his high school, his luck begins to change — perhaps for the worse. After staying out all night with Do Hee, Ho Goo experiences a rude awakening when he realizes that not only has Do Hee left him, she's also pregnant!  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Uee Do Do-hee Choi Woo-shik Kang Ho-goo Im Seul-ong Byun Kang-chul Lee Soo-kyung Kang Ho-kyung Kim Hyun-joon No Gyeong-woo Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Ho Goo's Love premiered on February  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on Ho Goo's Love. You can help by rating TV shows you've seen. Facts Original Name  호구의 사랑 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/hogoolove Genres Comedy Drama Romance Keywords korea Content Score 86 Almost there... Top Contributors M 44 Maria180493 t 4 tmdb38202327 z 4 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}