{"link": "https://www.themoviedb.org/tv/54217?language=en", "title": "The Deadline", "resume": "It sounds like the rehash version of William Shakespeare’s “The Taming of the Shrew” where the main girl must marry first before her younger sister can. It’s a romantic comedy. The same concept goes for Noon Woranuch and Vee Veeraphap’s upcoming lakorn “Sentai…Salai Soht (A deadline….to end being single)” for Ch7. Noon is playing a woman by the name of “Fah”, she has a younger sister who wants to get marry, but the main rule in their family is that Fah (being the eldest sister) must marry first before her younger sister can. Fah also has a pestering mother who badly wants her to get marry. Her mother even resorts to trickrey in order to do so, she lies to Fah that she dying and begged Fah to find a husband within 2 months. For the sake of her ‘ailing’ mother, Fah uses her talent as the head of the creative department in her company to find a husband. You can guess that Vee is playing the guy that Noon must snatch up to marry.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Veraparb Suparbpaiboon", "Woranuch Bhirompakdee", "Parntong Boontong", "Rattapong Tanaphat", "Malinee Adelaide Coates"], "character": ["Dawdin/DIn", "Namfah/Fah", "KorYa", "Khun Vee", "Fase"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54217   Expand The Deadline   (2011) User Score  Play Trailer Overview It sounds like the rehash version of William Shakespeare’s “The Taming of the Shrew” where the main girl must marry first before her younger sister can. It’s a romantic comedy. The same concept goes for Noon Woranuch and Vee Veeraphap’s upcoming lakorn “Sentai…Salai Soht (A deadline….to end being single)” for Ch7. Noon is playing a woman by the name of “Fah”, she has a younger sister who wants to get marry, but the main rule in their family is that Fah (being the eldest sister) must marry first before her younger sister can. Fah also has a pestering mother who badly wants her to get marry. Her mother even resorts to trickrey in order to do so, she lies to Fah that she dying and begged Fah to find a husband within 2 months. For the sake of her ‘ailing’ mother, Fah uses her talent as the head of the creative department in her company to find a husband. You can guess that Vee is playing the guy that Noon must snatch up to marry.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Veraparb Suparbpaiboon Dawdin/DIn Woranuch Bhirompakdee Namfah/Fah Parntong Boontong KorYa Rattapong Tanaphat Khun Vee Malinee Adelaide Coates Fase Full Cast & Crew Last Season Season 1 2011 | 20 Episodes Season 1 of The Deadline premiered on September 27, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on The Deadline. You can help by rating TV shows you've seen. Facts Original Name  เส้นตาย สลายโสด Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 49 Crip TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}