{"link": "https://www.themoviedb.org/tv/16893?language=en", "title": "Macken", "resume": "Macken is a Swedish 6-part musical sit-com that ran on SVT in 1986. It was produced by Galenskaparna och After Shave and was a major breakthrough for the group. Some of the songs from the show became hits on Svensktoppen and a movie was made in 1990.\nThe title translates as \"the mack\" with \"mack\" in this case being common Swedish slang for gas station.", "rate": 58, "genre": ["Comedy"], "cast": ["Jan Rippe", "Anders Eriksson", "Knut Agnred", "Claes Eriksson", "Per Fritzell"], "character": ["Roger", "Roy", "Övriga roller", "Övriga roller", "Övriga roller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16893   Expand Macken   (1986) User Score Overview Macken is a Swedish 6-part musical sit-com that ran on SVT in 1986. It was produced by Galenskaparna och After Shave and was a major breakthrough for the group. Some of the songs from the show became hits on Svensktoppen and a movie was made in 1990. The title translates as \"the mack\" with \"mack\" in this case being common Swedish slang for gas station. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jan Rippe Roger Anders Eriksson Roy Knut Agnred Övriga roller Claes Eriksson Övriga roller Per Fritzell Övriga roller Full Cast & Crew Last Season Season 1 1986 | 6 Episodes Season 1 of Macken premiered on August 23, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1987-09-05 På spåret 5.0    2011-01-06 The Reckoning 3.7    2016-04-25 After the Thrones 4.6    1999-01-18 Parlamentet 3.0    2004-08-30 John Safran vs God 7.3    2002-10-31 Värsta språket 6.0    2013-11-07 Folkets främsta företrädare 5.0    2012-04-02 TableTop 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Swedish Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors n 15 nilsemil HN 3 Henrik Nyberg 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}