{"link": "https://www.themoviedb.org/tv/39604?language=en", "title": "Injustice", "resume": "On the surface William Travers is a picture of success. An accomplished criminal barrister happily living with his wife in rural Suffolk. However, Travers is still recovering from a traumatic series of events that have shaken his belief in the legal system.\nReluctantly, he is drawn into a case that involves his old friend Martin Newall who faces conspiracy and murder charges while at the same time being investigated by a vicious and vengeful detective DS Mark Wenborn.", "rate": 73, "genre": ["Crime", "Drama"], "cast": ["James Purefoy", "Dervla Kirwan", "Nathaniel Parker", "Charlie Creed-Miles", "Obi Abili"], "character": ["William Travers", "Jane Travers", "Martin Newall", "DI Mark Wenborn", "DS Nick Taylor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39604   Expand Injustice   (2011) User Score  Play Trailer Overview On the surface William Travers is a picture of success. An accomplished criminal barrister happily living with his wife in rural Suffolk. However, Travers is still recovering from a traumatic series of events that have shaken his belief in the legal system. Reluctantly, he is drawn into a case that involves his old friend Martin Newall who faces conspiracy and murder charges while at the same time being investigated by a vicious and vengeful detective DS Mark Wenborn. Featured Crew Anthony Horowitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Purefoy William Travers Dervla Kirwan Jane Travers Nathaniel Parker Martin Newall Charlie Creed-Miles DI Mark Wenborn Obi Abili DS Nick Taylor Full Cast & Crew Last Season Season 1 2011 | 5 Episodes Season 1 of Injustice premiered on June  6, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2006-01-01 In Justice 6.8    2011-01-13 Kidnap and Ransom 7.6    2013-09-05 The Guilty 7.0    2010-07-12 The Silence 6.8    2004-07-19 The Grid 7.0    2016-06-08 Power Monkeys 7.0    2012-08-30 Good Cop 6.6    2011-02-03 Marchlands 7.4  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Drama Keywords conspiracy criminal lawyer legal drama legal system Content Score 100 Yes! Looking good! Top Contributors 32 Banana S 5 Shady12 w 3 webmaster 3 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}