{"link": "https://www.themoviedb.org/tv/2517?language=en", "title": "Oh, Doctor Beeching!", "resume": "Oh, Doctor Beeching! is a British television sitcom written by David Croft and Richard Spendlove in the tradition of Hi-de-Hi!  After a broadcast pilot on 14 August 1995, the show ran for two series from 8 July 1996, with the last episode being broadcast on 28 September 1997. The series is notable for being the last in a series of three comedies by co-writer David Croft to use many of the same actors, starting with Hi-de-Hi!, and followed by You Rang, M'Lord?.", "rate": 75, "genre": ["Comedy"], "cast": ["Jeffrey Holland", "Barbara New", "Stephen Lewis", "Sherrie Hewson", "Felix Bowness"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2517   Expand Oh, Doctor Beeching!   (1995) User Score Overview Oh, Doctor Beeching! is a British television sitcom written by David Croft and Richard Spendlove in the tradition of Hi-de-Hi!  After a broadcast pilot on 14 August 1995, the show ran for two series from 8 July 1996, with the last episode being broadcast on 28 September 1997. The series is notable for being the last in a series of three comedies by co-writer David Croft to use many of the same actors, starting with Hi-de-Hi!, and followed by You Rang, M'Lord?. Featured Crew Richard Spendlove Creator David Croft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeffrey Holland Barbara New Stephen Lewis Sherrie Hewson Felix Bowness Full Cast & Crew Last Season Season 2 1997 | 10 Episodes Season 2 of Oh, Doctor Beeching! premiered on June 29, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Oh, Doctor Beeching!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords train railway station sitcom 1960s british humour workplace comedy period sitcom porter Content Score 93 Almost there... Top Contributors O 11 Ozbourne w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}