{"link": "https://www.themoviedb.org/tv/33108?language=en", "title": "Boston Med", "resume": "Boston Med is an eight-part documentary television series that premiered on ABC in the United States on June 24, 2010. It follows the stories of doctors, nurses, patients and their families at Mass General, Brigham and Women's and Children's. The series was filmed over a four-month period, and edited for a year before airing. It is produced by ABC News.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33108   Expand Boston Med   (2010) User Score Overview Boston Med is an eight-part documentary television series that premiered on ABC in the United States on June 24, 2010. It follows the stories of doctors, nurses, patients and their families at Mass General, Brigham and Women's and Children's. The series was filmed over a four-month period, and edited for a year before airing. It is produced by ABC News. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2010 | 8 Episodes Season 1 of Boston Med premiered on June 24, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Boston Med. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  42m, 60m Homepage   http://www.abc.go.com/shows/boston-med Genres Documentary Keywords documentary miniseries Content Score 56 We're so close, yet so far. Top Contributors R 4 Rebecca 3 Banana 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}