{"link": "https://www.themoviedb.org/tv/46286?language=en", "title": "Ink Master", "resume": "Hosted by rock legend Dave Navarro and judged by icons of the tattoo world, Chris Núñez and Oliver Peck, a group of the country's most creative and skilled tattoo artists compete for a hundred thousand dollars and the title of Ink Master. The stakes couldn't be higher with \"living canvasses\" donating their skin to be permanently marked in this adrenalized competition elimination.", "rate": 72, "genre": ["Reality"], "cast": ["Dave Navarro", "Chris Núñez", "Oliver Peck"], "character": ["Himself - Host", "Himself - Judge", "Himself - Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46286   Expand Ink Master   (2012) User Score  Play Trailer Overview Hosted by rock legend Dave Navarro and judged by icons of the tattoo world, Chris Núñez and Oliver Peck, a group of the country's most creative and skilled tattoo artists compete for a hundred thousand dollars and the title of Ink Master. The stakes couldn't be higher with \"living canvasses\" donating their skin to be permanently marked in this adrenalized competition elimination. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  11 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Navarro Himself - Host Chris Núñez Himself - Judge Oliver Peck Himself - Judge Full Cast & Crew Current Season Return of the Masters 2018 | 16 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply New season! Open 2 by  intothenightalone t ok, i am here, but where are the rest of you nutters from the imdb? Open 6 by therefdotcom\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  5 Recommendations   2005-07-19 Miami Ink 6.0    2007-08-07 LA Ink 6.3    2012-10-16 Tattoo Nightmares 6.3    2011-01-26 Face Off 7.2    1983-09-17 Dungeons & Dragons 7.6    2010-03-16 Justified 7.9    2011-04-03 The Killing 7.5    2007-07-19 Mad Men 8.0  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  42m Homepage   http://www.paramountnetwork.com/shows/ink-master Genres Reality Keywords tattoo tattoo artist Content Score 64 We're so close, yet so far. Top Contributors 42 United600 27 Elizabeth Jennings b 20 basher 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}