{"link": "https://www.themoviedb.org/tv/69406?language=en", "title": "Siren", "resume": "Satomi  Shinobu works in the Mobile Investigation Unit of The Tokyo Metropolitan Police Department. The Mobile Investigation Unit conducts the initial investigation at all crime scenes. He works with Inokuma Yuki. They are a couple, but they keep their relationship a secret at work. They both hope to work at the #1 Investigation Station. One day, they meet beautiful Tachibana Kara at the site where a dead body was found. Kara appears at the other crime scenes involving grotesque murders. She shows an interest in Yuki. Satomi Shinobu thinks it's a bad sign for Yuki. To protect his girlfriend from danger, he struggles to find uncover the truth behind the serial murder cases and Kara’s identity.", "rate": 0, "genre": ["Drama", "Mystery"], "cast": ["Nanao", "Fumino Kimura", "Tori Matsuzaka", "Hiromitsu Kitayama", "Jun Kaname"], "character": ["Kara Tachibana", "Yuki Inokuma", "Shinobu Satomi", "Sho Hayami", "Kei Arimoto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69406   Expand Siren   (2015) User Score Overview Satomi  Shinobu works in the Mobile Investigation Unit of The Tokyo Metropolitan Police Department. The Mobile Investigation Unit conducts the initial investigation at all crime scenes. He works with Inokuma Yuki. They are a couple, but they keep their relationship a secret at work. They both hope to work at the #1 Investigation Station. One day, they meet beautiful Tachibana Kara at the site where a dead body was found. Kara appears at the other crime scenes involving grotesque murders. She shows an interest in Yuki. Satomi Shinobu thinks it's a bad sign for Yuki. To protect his girlfriend from danger, he struggles to find uncover the truth behind the serial murder cases and Kara’s identity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Nanao Kara Tachibana Fumino Kimura Yuki Inokuma Tori Matsuzaka Shinobu Satomi Hiromitsu Kitayama Sho Hayami Jun Kaname Kei Arimoto Full Cast & Crew Last Season Season 1 2015 | 9 Episodes Season 1 of Siren premiered on October 20, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Siren. You can help by rating TV shows you've seen. Facts Original Name  サイレーン Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  49m Homepage   http://www.ktv.jp/siren/ Genres Drama Mystery Keywords police mystery suspense Content Score 79 Pump it up! We're close now. Top Contributors 30 animerika t 10 tmdb983464 7 MundoAsian TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}