{"link": "https://www.themoviedb.org/tv/1050?language=en", "title": "The Games", "resume": "The Games was an Australian mockumentary television series about the 2000 Summer Olympics in Sydney. The series was originally broadcast on the ABC and had two seasons of 13 episodes each, the first in 1998 and the second in 2000.\n'The Games' starred satirists John Clarke and Bryan Dawe along with Australian comedian Gina Riley and actor Nicholas Bell. It was written by John Clarke and Ross Stevenson. The series centred on the Sydney Organising Committee for the Olympic Games and satirised corruption and cronyism in the Olympic movement, bureaucratic ineptness in the New South Wales public service, and unethical behaviour within politics and the media. An unusual feature of the show was that the characters shared the same name as the actors who played them, to enhance the illusion of a documentary on the Sydney Games.", "rate": 0, "genre": ["Comedy"], "cast": ["Gina Riley", "Bryan Dawe", "Nicholas Bell", "Barrie Cassidy", "Andrew Curry"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1050   Expand The Games   (1998) User Score Overview The Games was an Australian mockumentary television series about the 2000 Summer Olympics in Sydney. The series was originally broadcast on the ABC and had two seasons of 13 episodes each, the first in 1998 and the second in 2000. 'The Games' starred satirists John Clarke and Bryan Dawe along with Australian comedian Gina Riley and actor Nicholas Bell. It was written by John Clarke and Ross Stevenson. The series centred on the Sydney Organising Committee for the Olympic Games and satirised corruption and cronyism in the Olympic movement, bureaucratic ineptness in the New South Wales public service, and unethical behaviour within politics and the media. An unusual feature of the show was that the characters shared the same name as the actors who played them, to enhance the illusion of a documentary on the Sydney Games. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gina Riley Bryan Dawe Nicholas Bell Barrie Cassidy Andrew Curry Full Cast & Crew Last Season Season 2 2000 | 13 Episodes Season 2 of The Games premiered on June 19, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Games. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://abc.net.au/tv/thegames Genres Comedy Keywords australia olympic games mockumentary sitcom Content Score 86 Almost there... Top Contributors 8 Banana 5 t0by TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}