{"link": "https://www.themoviedb.org/tv/9519?language=en", "title": "Excel Saga", "resume": "Excel Saga is a manga series written and illustrated by Rikdo Koshi. It has been serialized in Young King OURs since 1996, and its individual chapters were collected and published in tankōbon volumes by Shōnen Gahosha. The series follows the attempts of Across, a \"secret ideological organization,\" to conquer the city of Fukuoka as a first step towards world domination. The titular character of the series, Excel, is a key member of the group working towards this goal, while the city is defended by a shadowy government agency led by Dr. Kabapu.\nThe manga was adapted into an anime television series by Victor Entertainment. Directed by Shinichi Watanabe and featuring animation from J.C.Staff, the series premiered on TV Tokyo in 1999. TV Tokyo only aired twenty-five of the series' twenty-six episodes, with the finale having been intentionally made too violent and obscene for public broadcast. As such, it was only included in the DVD release of the series, although it has since been broadcast in other markets.\nThe series has enjoyed some critical success coupled with respectable sales.", "rate": 71, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Satomi Kōrogi", "Wataru Takagi", "Takehito Koyasu", "Omi Minami", "Kotono Mitsuishi"], "character": ["Menchi", "Koshi Rikudo", "Il Palazzo", "Hyatt", "Excel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9519   Expand Excel Saga   (1999) User Score Overview Excel Saga is a manga series written and illustrated by Rikdo Koshi. It has been serialized in Young King OURs since 1996, and its individual chapters were collected and published in tankōbon volumes by Shōnen Gahosha. The series follows the attempts of Across, a \"secret ideological organization,\" to conquer the city of Fukuoka as a first step towards world domination. The titular character of the series, Excel, is a key member of the group working towards this goal, while the city is defended by a shadowy government agency led by Dr. Kabapu. The manga was adapted into an anime television series by Victor Entertainment. Directed by Shinichi Watanabe and featuring animation from J.C.Staff, the series premiered on TV Tokyo in 1999. TV Tokyo only aired twenty-five of the series' twenty-six episodes, with the finale having been intentionally made too violent and obscene for public broadcast. As such, it was only included in the DVD release of the series, although it has since been broadcast in other markets. The series has enjoyed some critical success coupled with respectable sales. Featured Crew Koshi Rikudo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Satomi Kōrogi Menchi Wataru Takagi Koshi Rikudo Takehito Koyasu Il Palazzo Omi Minami Hyatt Kotono Mitsuishi Excel Full Cast & Crew Last Season (jp) season 1 1999 | 26 Episodes Season 1 of Excel Saga premiered on October  7, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Excel Saga. You can help by rating TV shows you've seen. Facts Original Name  エクセル サーガ Status  Ended Networks Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Drama Keywords based on manga anime young king ours Content Score 93 Almost there... Top Contributors z 20 zurman1 18 sp1ti 8 BlackDelivery 7 Ailurus Fulgens  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}