{"link": "https://www.themoviedb.org/tv/31401?language=en", "title": "The Paradise Club", "resume": "The Paradise Club is a BBC television drama starring Don Henderson and Leslie Grantham as Frank & Danny Kane. Two series were produced and were broadcast between 1989 and 1990.\nThe show focuses upon two brothers, Frank & Danny Kane. Their mother, Ma Kane, is the matriarch of a criminal gang in South London, helped by her son Danny. Frank has become a priest but leaves the church; he inherits The Paradise Club on the death of their mother and returns to London to try and steer Danny away from crime.", "rate": 70, "genre": ["Drama", "Crime"], "cast": ["Leslie Grantham", "Don Henderson", "Barbara Wilshere", "Peter Gowen", "Leon Herbert"], "character": ["Danny Kane", "Frank Kane", "Carol Kane", "Jonjo O'Brady", "Polish Joe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31401   Expand The Paradise Club   (1989) User Score Overview The Paradise Club is a BBC television drama starring Don Henderson and Leslie Grantham as Frank & Danny Kane. Two series were produced and were broadcast between 1989 and 1990. The show focuses upon two brothers, Frank & Danny Kane. Their mother, Ma Kane, is the matriarch of a criminal gang in South London, helped by her son Danny. Frank has become a priest but leaves the church; he inherits The Paradise Club on the death of their mother and returns to London to try and steer Danny away from crime. Featured Crew Murray Smith Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leslie Grantham Danny Kane Don Henderson Frank Kane Barbara Wilshere Carol Kane Peter Gowen Jonjo O'Brady Leon Herbert Polish Joe Full Cast & Crew Last Season Season 2 1990 | 10 Episodes Season 2 of The Paradise Club premiered on September 25, 1990. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Paradise Club. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Paradise Club. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Crime Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 32 Markxist 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}