{"link": "https://www.themoviedb.org/tv/65798?language=en", "title": "Letterkenny", "resume": "Letterkenny follows Wayne, a good-ol’ country boy in Letterkenny, Ontario trying to protect his homegrown way of life on the farm, against a world that is constantly evolving around him. The residents of Letterkenny belong to one of three groups: Hicks, Skids, and Hockey Players. The three groups are constantly feuding with each other over seemingly trivial matters; often ending with someone getting their ass kicked.", "rate": 84, "genre": ["Comedy"], "cast": ["Jared Keeso", "Nathan Dales", "Michelle Mylett", "K. Trevor Wilson", "Lisa Codrington"], "character": ["Wayne", "Daryl", "Katy", "Dan", "Gail"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65798   Expand Letterkenny   (2016) User Score  Play Trailer Overview Letterkenny follows Wayne, a good-ol’ country boy in Letterkenny, Ontario trying to protect his homegrown way of life on the farm, against a world that is constantly evolving around him. The residents of Letterkenny belong to one of three groups: Hicks, Skids, and Hockey Players. The three groups are constantly feuding with each other over seemingly trivial matters; often ending with someone getting their ass kicked. Featured Crew Jared Keeso Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jared Keeso Wayne Nathan Dales Daryl Michelle Mylett Katy K. Trevor Wilson Dan Lisa Codrington Gail Full Cast & Crew Current Season Season 5 2018 | 6 Episodes Season 5 of Letterkenny premiered on June 29, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  2 Recommendations   2004-01-22 Corner Gas 8.3    2008-01-31 Eli Stone 6.7    2015-10-04 One-Punch Man 8.2    2002-03-12 The Shield 8.1    2011-04-03 The Killing 7.5  Facts Status  Returning Series Network Certification PG Meaning Parental guidance. Moderate violence and moderate profanity is allowed, as is brief nudity and sexual references if important to the context of the story. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cravetv.ca/show/34584 Genres Comedy Keywords small town canada sitcom Content Score 100 Yes! Looking good! Top Contributors 38 Elizabeth Jennings 6 Banana C 2 Clarisse451 d 2 detectivestern  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}