{"link": "https://www.themoviedb.org/tv/11341?language=en", "title": "Key West", "resume": "Key West was a short-lived 1993 hour long comedy-drama television series set in Key West, Florida. Thirteen episodes aired on Fox between January and June 1993. It was created by David Beaird and Allan Marcil. The show was produced by Viacom Productions.\nThe main character is Seamus O'Neill, played by Fisher Stevens, a factory worker from New Jersey who dreams of being a writer. When he wins the lottery, he uses his newfound wealth to move to Key West to pursue his writing career, Where his idol, Hemingway, had lived. Seamus finds the island inhabited by eccentrics. He takes a job as a reporter for The Meteor,\" a local newspaper.\nIn addition to Stevens: Jennifer Tilly, Denise Crosby, and Brian Thompson led the large ensemble cast as the town's high-class prostitute, conservative mayor and eccentric sheriff, respectively.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Fisher Stevens", "Jennifer Tilly", "Kim Myers", "Denise Crosby", "Brian Thompson"], "character": ["Savannah Sumner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11341   Expand Key West   (1993) User Score Overview Key West was a short-lived 1993 hour long comedy-drama television series set in Key West, Florida. Thirteen episodes aired on Fox between January and June 1993. It was created by David Beaird and Allan Marcil. The show was produced by Viacom Productions. The main character is Seamus O'Neill, played by Fisher Stevens, a factory worker from New Jersey who dreams of being a writer. When he wins the lottery, he uses his newfound wealth to move to Key West to pursue his writing career, Where his idol, Hemingway, had lived. Seamus finds the island inhabited by eccentrics. He takes a job as a reporter for The Meteor,\" a local newspaper. In addition to Stevens: Jennifer Tilly, Denise Crosby, and Brian Thompson led the large ensemble cast as the town's high-class prostitute, conservative mayor and eccentric sheriff, respectively. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fisher Stevens Jennifer Tilly Savannah Sumner Kim Myers Denise Crosby Brian Thompson Full Cast & Crew Last Season Season 1 1993 | 13 Episodes Season 1 of Key West premiered on January 19, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Key West. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}