{"link": "https://www.themoviedb.org/tv/46302?language=en", "title": "Maoyū Maō Yūsha", "resume": "The story is set in a world embroiled by war between Humans and Demons. The Humans' greatest hero invades the Demon Queen's castle determined to vanquish her. However, instead of fighting back, the Queen proposes an alliance with the Hero. She explains how a sudden end to the war can bring further chaos to the world as the Humans once united to stand against their common enemies would eventually begin fighting among themselves, with similar issues already occurring at the Demon Realm. Convinced by her words, the Hero joins forces with the Queen and together they execute a plan to bring prosperity and a lasting peace to both Humans and Demons alike.", "rate": 73, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Jun Fukuyama"], "character": ["Yuusha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46302   Expand Maoyū Maō Yūsha   (2013) User Score Overview The story is set in a world embroiled by war between Humans and Demons. The Humans' greatest hero invades the Demon Queen's castle determined to vanquish her. However, instead of fighting back, the Queen proposes an alliance with the Hero. She explains how a sudden end to the war can bring further chaos to the world as the Humans once united to stand against their common enemies would eventually begin fighting among themselves, with similar issues already occurring at the Demon Realm. Convinced by her words, the Hero joins forces with the Queen and together they execute a plan to bring prosperity and a lasting peace to both Humans and Demons alike. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Fukuyama Yuusha Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Maoyū Maō Yūsha premiered on March  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Maoyū Maō Yūsha. You can help by rating TV shows you've seen. Facts Original Name  まおゆう魔王勇者 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors a 6 asura766 5 deanzel 5 willemavjc m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}