{"link": "https://www.themoviedb.org/tv/2345?language=en", "title": "Kim Possible", "resume": "Kim Possible is an American animated action-adventure comedy television series about a teenage crime fighter who has the task of dealing with worldwide, family, and school issues every day. The show is action-oriented, but also has a light-hearted atmosphere and often lampoons the conventions and clichés of the secret-agent and action genres. It marked the second animated Disney Channel Original Series, and was the first series to be produced by Walt Disney Television Animation, in association with Disney Channel.\nKim Possible was the Disney Channel's longest running original animated series until it was surpassed by Phineas and Ferb.", "rate": 67, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Gary Cole", "Jean Smart", "Patrick Warburton", "Will Friedle", "Tahj Mowry"], "character": ["Dr. James Timothy Possible", "Dr. Ann Possible", "Mr. Steve Barkin", "Ron Stoppable", "Wade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2345   Expand Kim Possible   (2002) User Score Overview Kim Possible is an American animated action-adventure comedy television series about a teenage crime fighter who has the task of dealing with worldwide, family, and school issues every day. The show is action-oriented, but also has a light-hearted atmosphere and often lampoons the conventions and clichés of the secret-agent and action genres. It marked the second animated Disney Channel Original Series, and was the first series to be produced by Walt Disney Television Animation, in association with Disney Channel. Kim Possible was the Disney Channel's longest running original animated series until it was surpassed by Phineas and Ferb. Featured Crew Mark McCorkle Creator Bob Schooley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Gary Cole Dr. James Timothy Possible Jean Smart Dr. Ann Possible Patrick Warburton Mr. Steve Barkin Will Friedle Ron Stoppable Tahj Mowry Wade Full Cast & Crew Last Season Season 4 2007 | 23 Episodes Season 4 of Kim Possible premiered on February 10, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   1997-09-13 Recess 6.8    2005-01-21 American Dragon: Jake Long 5.9    2007-08-17 Phineas and Ferb 7.5    2001-03-30 The Fairly OddParents 6.7    2003-09-20 Lilo & Stitch: The Series 6.0    2002-07-20 The Adventures of Jimmy Neutron: Boy Genius 6.1    2002-12-06 Codename: Kids Next Door 6.5    1996-04-28 Dexter's Laboratory 7.3  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://disneychannel.disney.com/kim-possible Genres Action & Adventure Animation Comedy Keywords cheerleader nacho best friend teenager girl family female spy boy genius super power sidekick rat school life fighting crime Content Score 100 Yes! Looking good! Top Contributors 35 minusha97 15 Banana 14 Jason Patrick 6 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}