{"link": "https://www.themoviedb.org/tv/36737?language=en", "title": "Lady Chatterley", "resume": "Lady Constance Chatterley is married to the handicapped Sir Clifford Chatterley, who was wounded in the First World War. When they move to his family's estate, Constance (Connie) meets their tough-yet-quiet groundskeeper, Oliver Mellors. Soon, she discovers that the source of her unhappiness is from not being fulfilled in love, and in turning to the arms of Mellors, she has a sexual awakening that will change her thoughts forever.", "rate": 79, "genre": ["Drama"], "cast": ["Joely Richardson", "Sean Bean", "James Wilby", "David Sterne", "Roger Hammond"], "character": ["Lady Chatterley", "Mellors", "Sir Clifford Chatterley", "Field", "Duke of Oaklands"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36737   Expand Lady Chatterley   (1993) User Score Overview Lady Constance Chatterley is married to the handicapped Sir Clifford Chatterley, who was wounded in the First World War. When they move to his family's estate, Constance (Connie) meets their tough-yet-quiet groundskeeper, Oliver Mellors. Soon, she discovers that the source of her unhappiness is from not being fulfilled in love, and in turning to the arms of Mellors, she has a sexual awakening that will change her thoughts forever. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joely Richardson Lady Chatterley Sean Bean Mellors James Wilby Sir Clifford Chatterley David Sterne Field Roger Hammond Duke of Oaklands Full Cast & Crew Last Season Miniseries 1993 | 4 Episodes Season 1 of Lady Chatterley premiered on June  6, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Lady Chatterley. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/p00tx02w Genres Drama Keywords based on novel or book miniseries period drama sexual awakening 1910s Content Score 86 Almost there... Top Contributors TB 36 TMDb Bot R 16 Rebecca z 4 zurman1 3 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}