{"link": "https://www.themoviedb.org/tv/40395?language=en", "title": "Absolute Zero: Special Investigation Unit", "resume": "Zettai Reido is a Japanese police procedural television drama. The first season, subtitled Mikaiketsu Jiken Tokumei Sōsa, was set in a fictional version of the Tokyo Metropolitan Police Department division that specializes in investigating cold cases, which is based on an actual division established in Japan in 2009. The first season aired from April 13 to June 22, 2010 on Fuji TV's Kakku time-slot. It premiered to a 18% rating. A special two-hour long episode which served as conclusion to the first series was aired on July 8, 2011.\nSeason two of Zettai Reido, subtitled Tokushu Hanzai Sennyū Sōsa takes place a year after the events of the special episode, after Sakuragi and her fellow detectives have been transferred to the undercover investigation division which deals with current crimes. The second season aired from July 12 to September 20, 2011 on Fuji TV's Kakku time-slot. It premiered to a 15.4% rating and ended with a season-high rating of 16.3%. The last leg of the second season featured guest star appearances by Yūsuke Santamaria and You Yokoyama.", "rate": 0, "genre": ["Drama"], "cast": ["Aya Ueto", "Sayaka Yamaguchi", "Hiromi Kitagawa", "Ryô Kimura"], "character": ["Izumi Sakuragi", "Ryōko Takamine", "Sae Ōmori", "Shō Takebayashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40395   Expand Absolute Zero: Special Investigation Unit    (2010) User Score Overview Zettai Reido is a Japanese police procedural television drama. The first season, subtitled Mikaiketsu Jiken Tokumei Sōsa, was set in a fictional version of the Tokyo Metropolitan Police Department division that specializes in investigating cold cases, which is based on an actual division established in Japan in 2009. The first season aired from April 13 to June 22, 2010 on Fuji TV's Kakku time-slot. It premiered to a 18% rating. A special two-hour long episode which served as conclusion to the first series was aired on July 8, 2011. Season two of Zettai Reido, subtitled Tokushu Hanzai Sennyū Sōsa takes place a year after the events of the special episode, after Sakuragi and her fellow detectives have been transferred to the undercover investigation division which deals with current crimes. The second season aired from July 12 to September 20, 2011 on Fuji TV's Kakku time-slot. It premiered to a 15.4% rating and ended with a season-high rating of 16.3%. The last leg of the second season featured guest star appearances by Yūsuke Santamaria and You Yokoyama. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aya Ueto Izumi Sakuragi Sayaka Yamaguchi Ryōko Takamine Hiromi Kitagawa Sae Ōmori Ryô Kimura Shō Takebayashi Full Cast & Crew Last Season Season 02 2011 | 11 Episodes Season 2 of Absolute Zero: Special Investigation Unit  premiered on July 12, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Absolute Zero: Special Investigation Unit . You can help by rating TV shows you've seen. Facts Original Name  絶対零度～未解決事件特命捜査～ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  47m Homepage   http://www.fujitv.co.jp/C-273 Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 26 Aka75 3 shadowfurious WL 3 William Lindell 1 Nikki  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}