{"link": "https://www.themoviedb.org/tv/67643?language=en", "title": "Winter Sun", "resume": "The winter sun; In the garden of his house on the day 7.dog twin brother, Mete and friends will witness an event that will change the whole life playing hide and seek with Efe April. The father, without telling anyone, to tell his father to see what is stored in the car. All household Efe while looking in a hurry to leave his father's home with a phone Harun al ...", "rate": 75, "genre": ["Drama"], "cast": ["Şükrü Özyıldız", "Aslı Enver", "Mahir Günşiray", "Şenay Gürler", "Hakan Gercek"], "character": ["Efe / Mete", "Nisan", "Mazhar", "Leyla", "Yakup"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67643   Expand Winter Sun   (2016) User Score  Play Trailer Overview The winter sun; In the garden of his house on the day 7.dog twin brother, Mete and friends will witness an event that will change the whole life playing hide and seek with Efe April. The father, without telling anyone, to tell his father to see what is stored in the car. All household Efe while looking in a hurry to leave his father's home with a phone Harun al ... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Şükrü Özyıldız Efe / Mete Aslı Enver Nisan Mahir Günşiray Mazhar Şenay Gürler Leyla Hakan Gercek Yakup Full Cast & Crew Last Season Season 1 2016 | 18 Episodes Season 1 of Winter Sun premiered on February 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Winter Sun. You can help by rating TV shows you've seen. Facts Original Name  Kış Güneşi Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Drama Keywords romance Content Score 93 Almost there... Top Contributors P 39 Pisac V 2 Vaine b 1 bluwy TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}