{"link": "https://www.themoviedb.org/tv/1464?language=en", "title": "Terry and June", "resume": "Terry and June Medford are both middle aged and beginning to find the trials of life are more difficult as they try to succeed in their daily lives. The couple have just moved to Purley, south-east London... Aunt Lucy and the mynah bird had disappeared, as had the occasionally visiting daughters. Terry and June now mixed with a friendly next door neighbour, Beattie; Terry's chatty work colleague, Malcolm; and their gruff boss Sir Dennis Hodge. Otherwise, things were much as before, with Terry's pigheaded childishness causing no end of problems, usually thwarting June's attempts at leading a cosy life.", "rate": 50, "genre": ["Comedy"], "cast": ["June Whitfield", "Terry Scott", "Terence Alexander", "Patsy Smart", "Tim Barrett"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1464   Expand Terry and June   (1979) User Score Overview Terry and June Medford are both middle aged and beginning to find the trials of life are more difficult as they try to succeed in their daily lives. The couple have just moved to Purley, south-east London... Aunt Lucy and the mynah bird had disappeared, as had the occasionally visiting daughters. Terry and June now mixed with a friendly next door neighbour, Beattie; Terry's chatty work colleague, Malcolm; and their gruff boss Sir Dennis Hodge. Otherwise, things were much as before, with Terry's pigheaded childishness causing no end of problems, usually thwarting June's attempts at leading a cosy life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast June Whitfield Terry Scott Terence Alexander Patsy Smart Tim Barrett Full Cast & Crew Last Season Season 9 1987 | 7 Episodes Season 9 of Terry and June premiered on July 20, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1991-01-03 The Mary Whitehouse Experience 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/terryandjune/ Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}