{"link": "https://www.themoviedb.org/tv/33996?language=en", "title": "Paul Temple", "resume": "Paul Temple is a British-German television series which originally aired on the BBC between 1969 and 1971. It features Francis Matthews as Paul Temple, the fictional detective created by Francis Durbridge, who solves crimes with the assistance of his wife Steve. It aired in 52 episodes each with a running time of around fifty minutes. Producer Derrick Sherwin was reassigned on short notice from the BBC's Doctor Who television series.\nThis was a co-production by the BBC and Taurus films of Munich, West Germany, which had no connection to the earlier BBC radio scripts, which was shown internationally. According to star Matthews, both Paul and Steve Temple became fashion icons of sorts, creating a style that was to be imitated in ITV's The Persuaders!, while, in America, Drinkwater's role was reportedly emulated by Susan Saint James in McMillan & Wife and Stefanie Powers in Hart to Hart. According to Matthews, Drinkwater chose her own \"very expensive\" designer clothes for the part.\nPaul Temple used overseas locations in France, Malta, Germany and elsewhere. The series was intended to last for five years, but, despite its popularity, especially in Germany, the BBC withdrew prematurely. Huw Wheldon, the BBC's managing director for television, later explained to Matthews that it was really \"Lew Grade territory\" and cited the BBC's preference for such historical dramas as The Six Wives of Henry VIII and Elizabeth R. There also appears to have been some disagreement between the BBC and Taurus over the casting of Steve Temple, the BBC wishing to drop Drinkwater, but Taurus favouring her retention.", "rate": 0, "genre": ["Crime"], "cast": ["Francis Matthews", "Ros Drinkwater", "George Sewell", "Blake Butler"], "character": ["Paul Temple", "Steve Temple", "Sammy Carson", "Eric"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33996   Expand Paul Temple   (1969) User Score Overview Paul Temple is a British-German television series which originally aired on the BBC between 1969 and 1971. It features Francis Matthews as Paul Temple, the fictional detective created by Francis Durbridge, who solves crimes with the assistance of his wife Steve. It aired in 52 episodes each with a running time of around fifty minutes. Producer Derrick Sherwin was reassigned on short notice from the BBC's Doctor Who television series. This was a co-production by the BBC and Taurus films of Munich, West Germany, which had no connection to the earlier BBC radio scripts, which was shown internationally. According to star Matthews, both Paul and Steve Temple became fashion icons of sorts, creating a style that was to be imitated in ITV's The Persuaders!, while, in America, Drinkwater's role was reportedly emulated by Susan Saint James in McMillan & Wife and Stefanie Powers in Hart to Hart. According to Matthews, Drinkwater chose her own \"very expensive\" designer clothes for the part. Paul Temple used overseas locations in France, Malta, Germany and elsewhere. The series was intended to last for five years, but, despite its popularity, especially in Germany, the BBC withdrew prematurely. Huw Wheldon, the BBC's managing director for television, later explained to Matthews that it was really \"Lew Grade territory\" and cited the BBC's preference for such historical dramas as The Six Wives of Henry VIII and Elizabeth R. There also appears to have been some disagreement between the BBC and Taurus over the casting of Steve Temple, the BBC wishing to drop Drinkwater, but Taurus favouring her retention. Featured Crew Francis Durbridge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Francis Matthews Paul Temple Ros Drinkwater Steve Temple George Sewell Sammy Carson Blake Butler Eric Full Cast & Crew Last Season Season 4 1971 | 13 Episodes Season 4 of Paul Temple premiered on June  9, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Paul Temple. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Crime Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors S 6 Samara 1 Daemon R 1 Rebecca t🇧 1 ticao2 🇧🇷 pt-BR  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}