{"link": "https://www.themoviedb.org/tv/16613?language=en", "title": "Tractor Tom", "resume": "Tractor Tom is a Dutch animated TV program, produced by Contender Entertainment Group, Hibbert Ralph Entertainment and HiT Entertainment. There are two series of 26 eleven minute episodes produced between 9 February 2003 and 2004. There was also a stage show.\nThe show aired on CITV and Tiny Pop in the UK, and played in New Zealand and Australia. It was now aired on Cartoonito, Nick Jr. and Milkshake! on Channel 5 in 2013.\nSales from DVDs of series one contributed to the Great Ormand Street Hospital Children's Charity. and\nFrom the new DVD cover: \"Tractor Tom lives on Springhill Farm with Farmer Fi, Matt the Farmhand, and all of his fantastic friends. No matter what the problem or the job to be done, it's Tractor Tom who saves the day... with heaps of fun and adventure along the way!\"\nThe slogan for the show was \"Tractor Tom, what would we do without you?\"\nSet on the idyllic Springhill Farm, brave and resourceful Tractor Tom and his human, animal and vehicle friends have fun and adventures at both work and play.\nThe first series featured Liza Tarbuck and James Nesbitt as Farmer Fi and Matt respecitively, but the vehicles only communicated through engine sounds.", "rate": 0, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16613   Expand Tractor Tom User Score Overview Tractor Tom is a Dutch animated TV program, produced by Contender Entertainment Group, Hibbert Ralph Entertainment and HiT Entertainment. There are two series of 26 eleven minute episodes produced between 9 February 2003 and 2004. There was also a stage show. The show aired on CITV and Tiny Pop in the UK, and played in New Zealand and Australia. It was now aired on Cartoonito, Nick Jr. and Milkshake! on Channel 5 in 2013. Sales from DVDs of series one contributed to the Great Ormand Street Hospital Children's Charity. and From the new DVD cover: \"Tractor Tom lives on Springhill Farm with Farmer Fi, Matt the Farmhand, and all of his fantastic friends. No matter what the problem or the job to be done, it's Tractor Tom who saves the day... with heaps of fun and adventure along the way!\" The slogan for the show was \"Tractor Tom, what would we do without you?\" Set on the idyllic Springhill Farm, brave and resourceful Tractor Tom and his human, animal and vehicle friends have fun and adventures at both work and play. The first series featured Liza Tarbuck and James Nesbitt as Farmer Fi and Matt respecitively, but the vehicles only communicated through engine sounds. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}