{"link": "https://www.themoviedb.org/tv/1759?language=en", "title": "The Cosby Show", "resume": "The Cosby Show is an American television situation comedy starring Bill Cosby, which aired for eight seasons on NBC from September 20, 1984 until April 30, 1992. The show focuses on the Huxtable family, an upper middle-class African-American family living in Brooklyn, New York.\nAccording to TV Guide, the show \"was TV's biggest hit in the 1980s, and almost single-handedly revived the sitcom genre and NBC's ratings fortunes\". Originally, the show had been pitched to ABC, which rejected it. Entertainment Weekly stated that The Cosby Show helped to make possible a larger variety of shows based on people of African descent, from In Living Color to The Fresh Prince of Bel-Air. The Cosby Show was based on comedy routines in Cosby's standup act, which were based on his family life. Other sitcoms, such as Home Improvement and Everybody Loves Raymond, would later follow that pattern. The show spawned the spin-off A Different World, which ran for six seasons from 1987 to 1993.", "rate": 68, "genre": ["Comedy"], "cast": ["Bill Cosby", "Phylicia Rashād", "Malcolm-Jamal Warner", "Keshia Knight Pulliam", "Tempestt Bledsoe"], "character": ["Heathcliff Huxtable", "Clair Huxtable", "Theo Huxtable", "Rudy Huxtable", "Vanessa Huxtable"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1759   Expand The Cosby Show   (1984) User Score Overview The Cosby Show is an American television situation comedy starring Bill Cosby, which aired for eight seasons on NBC from September 20, 1984 until April 30, 1992. The show focuses on the Huxtable family, an upper middle-class African-American family living in Brooklyn, New York. According to TV Guide, the show \"was TV's biggest hit in the 1980s, and almost single-handedly revived the sitcom genre and NBC's ratings fortunes\". Originally, the show had been pitched to ABC, which rejected it. Entertainment Weekly stated that The Cosby Show helped to make possible a larger variety of shows based on people of African descent, from In Living Color to The Fresh Prince of Bel-Air. The Cosby Show was based on comedy routines in Cosby's standup act, which were based on his family life. Other sitcoms, such as Home Improvement and Everybody Loves Raymond, would later follow that pattern. The show spawned the spin-off A Different World, which ran for six seasons from 1987 to 1993. Featured Crew Michael J. Leeson Creator Bill Cosby Creator Ed. Weinberger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  3 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Cosby Heathcliff Huxtable Phylicia Rashād Clair Huxtable Malcolm-Jamal Warner Theo Huxtable Keshia Knight Pulliam Rudy Huxtable Tempestt Bledsoe Vanessa Huxtable Full Cast & Crew Last Season Season 8 1991 | 25 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply w Denise Huxtable: Happy Birthday Lisa Bonet! Open 0 by wonder2wonder\n      \n     w Vanessa: Happy Birthday Tempestt Bledsoe! Open 0 by wonder2wonder\n      \n     w Clair: Happy Birthday Phylicia Rashad! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1991-09-17 Home Improvement 7.0    1989-09-22 Family Matters 6.2    1987-09-22 Full House 5.9    1986-09-22 ALF 6.9    1982-09-22 Family Ties 7.0    1984-09-20 Who's the Boss? 6.4    1988-10-18 Roseanne 6.7    1985-09-24 Growing Pains 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m Homepage  - Genres Comedy Keywords brooklyn new york city black family sitcom black sitcom Content Score 93 Almost there... Top Contributors 13 dgw 12 Banana b 9 bugfix 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}