{"link": "https://www.themoviedb.org/tv/62570?language=en", "title": "The Dalek Chronicles", "resume": "On 23rd January 1965, the Daleks made their first appearance in their own full colour comic strip on the back page of the lavish new children's weekly comic TV Century 21. Written largely by David Whitaker, who was the series' original script editor, and illustrated by such legendary comic strip artists as Richard Jennings, Ron Turner and Eric Eden, this popular one-page strip ran for 104 instalments, and finally concluded on the brink of the Daleks' planned attack on the inhabitants of Earth.\nThese strips have been reprinted many times in Dalek Annuals and other Doctor Who-related books, plus Doctor Who Weekly, Doctor Who Monthly and Doctor Who Classic Comics, as well as being issued complete and in colour as a special edition magazine.\nBecause of the difference between a comic strip and a video feature, a certain amount of adaptation was inevitable. If the stories had been transferred exactly as written, then each one would have lasted only about five minutes and been so breathlessly fast-paced as to be virtually incomprehensible. However, so, the adaptations where made as sympathetic to the source material as possible, expanding the original story only in the name of atmosphere, deeper characterisation and the occasional crowd-pleasing reference or in-joke.\nIf the strip contradicts information contained in the TV series (and it does), then that contradiction remained and no attempt was made to reconcile the two... Equally, no matter how bad, embarrassing or unDalek-like a line of dialogue may be, it remained as it featured in the original strip. Added to this, wherever possible the animations and stills where based on the key frames from the strip and all design was based on the images seen in those panels. The aim was to bring the strips to life, not change them into something else.\nThe adaptations were released on VCD between 2004 and 2011", "rate": 80, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Stuart Palmer"], "character": ["Daleks"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62570   Expand The Dalek Chronicles   (2004) User Score Overview On 23rd January 1965, the Daleks made their first appearance in their own full colour comic strip on the back page of the lavish new children's weekly comic TV Century 21. Written largely by David Whitaker, who was the series' original script editor, and illustrated by such legendary comic strip artists as Richard Jennings, Ron Turner and Eric Eden, this popular one-page strip ran for 104 instalments, and finally concluded on the brink of the Daleks' planned attack on the inhabitants of Earth. These strips have been reprinted many times in Dalek Annuals and other Doctor Who-related books, plus Doctor Who Weekly, Doctor Who Monthly and Doctor Who Classic Comics, as well as being issued complete and in colour as a special edition magazine. Because of the difference between a comic strip and a video feature, a certain amount of adaptation was inevitable. If the stories had been transferred exactly as written, then each one would have lasted only about five minutes and been so breathlessly fast-paced as to be virtually incomprehensible. However, so, the adaptations where made as sympathetic to the source material as possible, expanding the original story only in the name of atmosphere, deeper characterisation and the occasional crowd-pleasing reference or in-joke. If the strip contradicts information contained in the TV series (and it does), then that contradiction remained and no attempt was made to reconcile the two... Equally, no matter how bad, embarrassing or unDalek-like a line of dialogue may be, it remained as it featured in the original strip. Added to this, wherever possible the animations and stills where based on the key frames from the strip and all design was based on the images seen in those panels. The aim was to bring the strips to life, not change them into something else. The adaptations were released on VCD between 2004 and 2011 Featured Crew Stuart Palmer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stuart Palmer Daleks Full Cast & Crew Last Season Season 1 2004 | 16 Episodes Season 1 of The Dalek Chronicles premiered on October 10, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Dalek Chronicles. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  - Homepage   http://www.stuartpalmer.karoo.net/html/about_me.html Genres Sci-Fi & Fantasy Keywords time travel dalek Content Score 64 We're so close, yet so far. Top Contributors 31 gazzatrek 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}