{"link": "https://www.themoviedb.org/tv/30991?language=en", "title": "Cowboy Bebop", "resume": "In 2071, roughly fifty years after an accident with a hyperspace gateway made the Earth almost uninhabitable, humanity has colonized most of the rocky planets and moons of the Solar System. Amid a rising crime rate, the Inter Solar System Police (ISSP) set up a legalized contract system, in which registered bounty hunters (also referred to as \"Cowboys\") chase criminals and bring them in alive in return for a reward.", "rate": 83, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kouichi Yamadera", "Unsho Ishizuka", "Megumi Hayashibara", "Aoi Tada", "Norio Wakamoto"], "character": ["Spike Spiegel /\tEin (voice)", "Jet Black (voice)", "Faye Valentine (voice)", "Edward Wong  (voice)", "Vicious  (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30991   Expand Cowboy Bebop   (1998) User Score  Play Trailer Overview In 2071, roughly fifty years after an accident with a hyperspace gateway made the Earth almost uninhabitable, humanity has colonized most of the rocky planets and moons of the Solar System. Amid a rising crime rate, the Inter Solar System Police (ISSP) set up a legalized contract system, in which registered bounty hunters (also referred to as \"Cowboys\") chase criminals and bring them in alive in return for a reward. Featured Crew Shinichiro Watanabe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  4 Images Backdrops  17 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kouichi Yamadera Spike Spiegel /\tEin (voice) Unsho Ishizuka Jet Black (voice) Megumi Hayashibara Faye Valentine (voice) Aoi Tada Edward Wong  (voice) Norio Wakamoto Vicious  (voice) Full Cast & Crew Last Season Original Air Date Original Air Date WOWOW Broadcast (Original Air Date) Season 1 1998 | 26 Episodes Season 1 of Cowboy Bebop premiered on April  2, 1998. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply Who sent Faye the video tape? Open 4 by  movie_nazi Ballad of Fallen Angels - How did Spike survive the fall from the Cathedral? Open 1 by  Patrick E. Abe Spike is alive! Open 3 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  1 Backdrops  17 Posters  15 Recommendations   2004-05-20 Samurai Champloo 8.0    2003-10-04 Fullmetal Alchemist 8.0    2009-04-05 Fullmetal Alchemist: Brotherhood 8.3    1998-04-02 TRIGUN 7.7    1995-10-04 Neon Genesis Evangelion 8.0    2007-04-01 Gurren Lagann 7.9    2011-04-06 Steins;Gate 8.2    2006-10-05 Code Geass: Lelouch of the Rebellion 8.1  Facts Original Name  カウボーイビバップ Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m, 30m Homepage   http://www.sunrise-anime.jp/international/works/detail.php?cid=41 Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords future fantasy bounty hunter jazz philosophy blues space neo-noir anime Content Score 100 Yes! Looking good! Top Contributors m 40 movie28 t 38 tmdb983464 25 Claudio 25 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}