{"link": "https://www.themoviedb.org/tv/34679?language=en", "title": "Fighting Beauty Wulong", "resume": "Fighting Beauty Wulong is a seinen manga series by Yūgo Ishikawa There are currently 19 volumes. The story has been adapted into an anime which spans two series. Both anime series covers volume 00-18. The first series is Fighting Beauty Wulong and the second is Fighting Beauty Wulong: Rebirth. Both series have approximately 25 episodes apiece.\nThe lead character, Mao Ran, a person of Chinese origin born and raised in Japan, has been trained in the secret martial art of her family by her drunken lecherous grandfather Master Mao Hung. Her grandfather has promised her that he'll tell her what happened to her parents to encourage her to train and fight. Without her knowledge, her grandfather signs her up to participate in a televised martial arts competition between female martial artists known as \"Prime Mat\". During the course of the manga and anime it is revealed that Ran's mother married Cao Da Hen and gave birth to Ran's step sister Rin Shen.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Wakana Yamazaki", "Junko Minagawa", "Unsho Ishizuka", "Takeshi Aono", "Shuuhei Sakaguchi"], "character": ["Mao Ran", "Cao Chun Yan", "Cao Da Hen", "Mao Hung", "Masao Oba"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34679   Expand Fighting Beauty Wulong   (2005) User Score Overview Fighting Beauty Wulong is a seinen manga series by Yūgo Ishikawa There are currently 19 volumes. The story has been adapted into an anime which spans two series. Both anime series covers volume 00-18. The first series is Fighting Beauty Wulong and the second is Fighting Beauty Wulong: Rebirth. Both series have approximately 25 episodes apiece. The lead character, Mao Ran, a person of Chinese origin born and raised in Japan, has been trained in the secret martial art of her family by her drunken lecherous grandfather Master Mao Hung. Her grandfather has promised her that he'll tell her what happened to her parents to encourage her to train and fight. Without her knowledge, her grandfather signs her up to participate in a televised martial arts competition between female martial artists known as \"Prime Mat\". During the course of the manga and anime it is revealed that Ran's mother married Cao Da Hen and gave birth to Ran's step sister Rin Shen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wakana Yamazaki Mao Ran Junko Minagawa Cao Chun Yan Unsho Ishizuka Cao Da Hen Takeshi Aono Mao Hung Shuuhei Sakaguchi Masao Oba Full Cast & Crew Last Season Season 1 2005 | 25 Episodes Season 1 of Fighting Beauty Wulong premiered on October  1, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fighting Beauty Wulong. You can help by rating TV shows you've seen. Facts Original Name  格闘美神 武龍 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.tv-tokyo.co.jp/anime/wulong/ Genres Animation Action & Adventure Comedy Keywords martial arts Content Score 86 Almost there... Top Contributors 6 TheDerpMan R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}