{"link": "https://www.themoviedb.org/tv/55550?language=en", "title": "Buying Alaska", "resume": "“Buying Alaska” proves that forgoing basic amenities is a reasonable tradeoff when it comes to breathtaking views and stunning wild surroundings that you can't find anywhere in the lower 48 states. Offering much more than living quarters, these properties are so in tune with the extraordinary landscape that it's often what's beyond the house that proves to be the main attraction - from the ability to hunt and fish from a back deck, to extreme seclusion on your own private island, to self-sustaining features such as smokehouses and greenhouses. However, there are also dangers that come with all the beauty, and living in this rugged and remote terrain can lead to animal attacks and brutal winters that cut you off from society.", "rate": 85, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55550   Expand Buying Alaska   (2012) User Score Overview “Buying Alaska” proves that forgoing basic amenities is a reasonable tradeoff when it comes to breathtaking views and stunning wild surroundings that you can't find anywhere in the lower 48 states. Offering much more than living quarters, these properties are so in tune with the extraordinary landscape that it's often what's beyond the house that proves to be the main attraction - from the ability to hunt and fish from a back deck, to extreme seclusion on your own private island, to self-sustaining features such as smokehouses and greenhouses. However, there are also dangers that come with all the beauty, and living in this rugged and remote terrain can lead to animal attacks and brutal winters that cut you off from society. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2014 | 30 Episodes Season 3 of Buying Alaska premiered on January 11, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Buying Alaska. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage   http://www.destinationamerica.com/tv-shows/buying-alaska Genres Reality Keywords wilderness alaska realty Content Score 43 There's no 'I' in team... Top Contributors 21 Elizabeth Jennings TB 15 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}