{"link": "https://www.themoviedb.org/tv/9190?language=en", "title": "Liberty!", "resume": "Dramatic documentary about the birth of the American Republic and the struggle of a loosely connected group of states to become a nation.", "rate": 73, "genre": ["Documentary"], "cast": ["Victor Garber", "Peter Donaldson", "Colm Feore", "Anthony Heald", "Stephen Lang"], "character": ["John Dickinson", "John Adams", "Alexander Hamilton", "Philip Vickers Fithian", "George Washington"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9190   Expand Liberty!   (1997) User Score Overview Dramatic documentary about the birth of the American Republic and the struggle of a loosely connected group of states to become a nation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Victor Garber John Dickinson Peter Donaldson John Adams Colm Feore Alexander Hamilton Anthony Heald Philip Vickers Fithian Stephen Lang George Washington Full Cast & Crew Last Season Season 1 1997 | 6 Episodes Season 1 of Liberty! premiered on November 23, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1999-10-04 Walking with Dinosaurs 8.0    1955-10-01 The Honeymooners 8.0  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.pbs.org/ktca/liberty/ Genres Documentary Keywords interview historian history miniseries reenactment american revolution american history historical re-enactment early america Content Score 86 Almost there... Top Contributors R 32 Rebecca 7 Elizabeth Jennings 4 Banana D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}