{"link": "https://www.themoviedb.org/tv/34796?language=en", "title": "Sanitka", "resume": "Sanitka was a Czech television, drama series, first broadcast in 1984 and eleven episodes were made. It starred Jaromír Hanzlík, Tomáš Juricka and Zlata Adamovská among others.", "rate": 0, "genre": [], "cast": ["Eva Trejtnarová-Hudečková", "Jaromír Hanzlík", "Zlata Adamovská", "Josef Karlík", "Tomáš Juřička"], "character": ["Eva Houdkova", "Vojta Jandera", "Eliska", "Cyril Jandera", "Jarda Jandera"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34796   Expand Sanitka   (1984) User Score Overview Sanitka was a Czech television, drama series, first broadcast in 1984 and eleven episodes were made. It starred Jaromír Hanzlík, Tomáš Juricka and Zlata Adamovská among others. Featured Crew Jiří Adamec Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eva Trejtnarová-Hudečková Eva Houdkova Jaromír Hanzlík Vojta Jandera Zlata Adamovská Eliska Josef Karlík Cyril Jandera Tomáš Juřička Jarda Jandera Full Cast & Crew Last Season Season 1 1984 | 11 Episodes Season 1 of Sanitka premiered on November 25, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Sanitka. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 11 karak 4 Zlogorek a 3 asusar 1 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}