{"link": "https://www.themoviedb.org/tv/42830?language=en", "title": "Moribito: Guardian of the Spirit", "resume": "Balsa the spearwoman is a wandering warrior, who takes on the task of saving lives, in atonement for a past sin. On her journey, she happens to save a prince, and is tasked with becoming his bodyguard. And he is going to need one, for his own father, the emperor, wants him dead. Throughout the story, Balsa's past will come to light and they will uncover mysteries about Chagum's condition while developing a family-like relationship with each other and others.", "rate": 85, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Animation", "Drama"], "cast": ["Mabuki Andô", "Naoto Adachi", "Yoshinari Kobayashi", "Kōji Tsujitani", "Ako Mayama"], "character": ["Barusa", "Chagumu", "Sagumu", "Tanda", "Torogai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42830   Expand Moribito: Guardian of the Spirit   (2007) User Score Overview Balsa the spearwoman is a wandering warrior, who takes on the task of saving lives, in atonement for a past sin. On her journey, she happens to save a prince, and is tasked with becoming his bodyguard. And he is going to need one, for his own father, the emperor, wants him dead. Throughout the story, Balsa's past will come to light and they will uncover mysteries about Chagum's condition while developing a family-like relationship with each other and others. Featured Crew Nahoko Uehashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mabuki Andô Barusa Naoto Adachi Chagumu Yoshinari Kobayashi Sagumu Kōji Tsujitani Tanda Ako Mayama Torogai Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of Moribito: Guardian of the Spirit premiered on April  7, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2002-01-08 Full Metal Panic! 6.6    2005-10-23 Mushi-Shi 7.8    2002-10-01 Ghost in the Shell: Stand Alone Complex 8.0  Facts Original Name  精霊の守り人 Status  Ended Networks NHK BS2 Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www6.nhk.or.jp/anime/program/detail.html?i=moribito Genres Action & Adventure Sci-Fi & Fantasy Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 50 kappa-papa 9 Elizabeth Jennings W 6 Wiruss m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}