{"link": "https://www.themoviedb.org/tv/76639?language=en", "title": "Great American Railroad Journeys", "resume": "Michael Portillo crosses the Atlantic to ride the railroads of America, armed with Appleton's General Guide to the United States, published in 1879.", "rate": 0, "genre": ["Documentary"], "cast": ["Michael Portillo"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76639   Expand Great American Railroad Journeys   (2016) User Score  Play Trailer Overview Michael Portillo crosses the Atlantic to ride the railroads of America, armed with Appleton's General Guide to the United States, published in 1879. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Portillo Himself - Presenter Full Cast & Crew Current Season Series 3 2018 | 20 Episodes Season 3 of Great American Railroad Journeys premiered on January 22, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Great American Railroad Journeys. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b07mdvbd Genres Documentary Keywords documentary Content Score 64 We're so close, yet so far. Top Contributors a 19 ausley 15 Elizabeth Jennings 7 tigru89 b 1 bengal27  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}