{"link": "https://www.themoviedb.org/tv/61118?language=en", "title": "You're the Worst", "resume": "Narcissistic, brash, and self-destructive Jimmy thinks all relationships are doomed. Cynical, people-pleasing, and stubborn Gretchen knows that relationships aren't for her. So when they meet at a wedding, it's only natural that the two of them go home together and, despite their better judgment, begin to find themselves falling for each other.", "rate": 77, "genre": ["Comedy"], "cast": ["Chris Geere", "Aya Cash", "Desmin Borges", "Kether Donohue"], "character": ["Jimmy Shive-Overly", "Gretchen Cutler", "Edgar Quintero", "Lindsay Jillian"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61118   Expand You're the Worst   (2014) User Score  Play Trailer Overview Narcissistic, brash, and self-destructive Jimmy thinks all relationships are doomed. Cynical, people-pleasing, and stubborn Gretchen knows that relationships aren't for her. So when they meet at a wedding, it's only natural that the two of them go home together and, despite their better judgment, begin to find themselves falling for each other. Featured Crew Stephen Falk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  10 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Geere Jimmy Shive-Overly Aya Cash Gretchen Cutler Desmin Borges Edgar Quintero Kether Donohue Lindsay Jillian Full Cast & Crew Last Season Season 4 2017 | 13 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply MY I need a (possible) spoiler. Open 5 by  ScorpionQ2 r Cinematography in season 4 premiere Open 0 by renatarain\n      \n     Glad it's back, but .... Open 2 by  MirrorMask Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  14 Recommendations   2014-07-17 Married 6.3    2014-06-04 Jennifer Falls 3.2    2015-01-19 Catastrophe 7.3    2014-10-02 Bad Judge 6.1    2015-04-26 HAPPYish 6.9    2015-01-11 Togetherness 6.0    2015-01-14 Man Seeking Woman 6.7    2014-01-22 Broad City 7.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  23m Homepage   http://www.fxnetworks.com/youretheworst/ Genres Comedy Keywords romantic comedy complicated relationships Content Score 100 Yes! Looking good! Top Contributors AK 45 Avshalom Kor 30 Elizabeth Jennings m 23 misfit_noel k 22 kevn57  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}