{"link": "https://www.themoviedb.org/tv/20368?language=en", "title": "Absolute Boyfriend", "resume": "Zettai Kareshi is a 2008 Japanese romance comedy drama television series based on the original manga novel \"Absolute Boyfriend\" by Yuu Watase. Mokomichi Hayami plays Night Tenjo's role while actress Saki Aibu plays Riiko Izawa.", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["Mokomichi Hayami", "Saki Aibu", "Hiro Mizushima", "Kuranosuke Sasaki", "Eisuke Sasai"], "character": ["Tenjo Night", "Riiko Izawa", "Asamoto Soshi", "Shirasagi Yuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20368   Expand Absolute Boyfriend   (2008) User Score Overview Zettai Kareshi is a 2008 Japanese romance comedy drama television series based on the original manga novel \"Absolute Boyfriend\" by Yuu Watase. Mokomichi Hayami plays Night Tenjo's role while actress Saki Aibu plays Riiko Izawa. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mokomichi Hayami Tenjo Night Saki Aibu Riiko Izawa Hiro Mizushima Asamoto Soshi Kuranosuke Sasaki Eisuke Sasai Shirasagi Yuki Full Cast & Crew Last Season Zettai kareshi season 1 2008 | 11 Episodes Season 1 of Absolute Boyfriend premiered on April 15, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2009-07-13 Buzzer Beat 8.2    2009-01-13 Mei-chan's Butler 6.3    2011-06-29 Heartstrings 7.0    2011-06-14 The Nine Lives of Chloe King 6.5    2009-10-07 You're Beautiful 7.9    2009-03-03 The Listener 5.3  Facts Original Name  絶対彼氏 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 14 Wendy NS 4 Norte Serra 3 enams90 A 1 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}