{"link": "https://www.themoviedb.org/tv/65708?language=en", "title": "Taboo", "resume": "Adventurer James Keziah Delaney returns to London from Africa in 1814 along with fourteen stolen diamonds to seek vengeance after the death of his father.", "rate": 80, "genre": ["Drama", "Mystery"], "cast": ["Tom Hardy", "Jonathan Pryce", "Jessie Buckley", "Oona Chaplin", "Michael Kelly"], "character": ["James Keziah Delaney", "Stuart Strange", "Lorna Bow", "Zilpha Geary", "Edgar Dumbarton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65708   Expand Taboo   (2017) User Score  Play Trailer Overview Adventurer James Keziah Delaney returns to London from Africa in 1814 along with fourteen stolen diamonds to seek vengeance after the death of his father. Featured Crew Steven Knight Creator Tom Hardy Creator Chips Hardy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  1 Images Backdrops  18 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Hardy James Keziah Delaney Jonathan Pryce Stuart Strange Jessie Buckley Lorna Bow Oona Chaplin Zilpha Geary Michael Kelly Edgar Dumbarton Full Cast & Crew Last Season Season 1 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  10 Subject Status Replies Last Reply Tom Hardy hints at season 2 Open 12 by  couchplotato Bad Ass Open 8 by  write2topcat PB Seemed like they dropped the James/Zilpha storyline? (SPOILER) Open 2 by  Morgion Go to Discussions Media Most Popular Videos  1 Backdrops  18 Posters  8 Recommendations   2013-09-12 Peaky Blinders 8.2    2014-04-15 Fargo 8.2    2016-10-02 Westworld 8.1    2017-02-08 Legion 7.6    2014-01-12 True Detective 8.1    2015-08-28 Narcos 8.0    2017-04-30 American Gods 6.9    2016-07-10 The Night Of 7.7  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  59m Homepage   http://www.bbc.co.uk/programmes/b088s45m Genres Drama Mystery Keywords east india trading company london england enemy africa blackmail investigation british empire murder conspiracy period drama witchcraft adventurer gunpowder shipping company 19th century regency period skulduggery dark secret slave ship Content Score 100 Yes! Looking good! Top Contributors 54 Elizabeth Jennings 26 Negan 22 Imzadi 17 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}