{"link": "https://www.themoviedb.org/tv/11386?language=en", "title": "Amy Prentiss", "resume": "Amy Prentiss is an American police drama television series which aired on NBC. It is a spinoff of Ironside, and aired as part of the NBC Mystery Movie from 1974-1975.\nJessica Walter stars as Amy Prentiss, a relatively young investigator who becomes the first female Chief of Detectives for the San Francisco Police Department. Helen Hunt, in an early role, played Prentiss' pre-teen daughter, Jill. Four 2-hour episodes were aired.\nGuest stars in the series' brief run included William Shatner, Cameron Mitchell, Don Murray, Joyce Van Patten and Jamie Farr.", "rate": 0, "genre": ["Drama"], "cast": ["Jessica Walter", "Helen Hunt", "Johnny Seven", "Steve Sandor"], "character": ["Amy Prentiss", "Jill Prentiss", "Detective Contreras", "Detective Tony Russell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11386   Expand Amy Prentiss   (1974) User Score Overview Amy Prentiss is an American police drama television series which aired on NBC. It is a spinoff of Ironside, and aired as part of the NBC Mystery Movie from 1974-1975. Jessica Walter stars as Amy Prentiss, a relatively young investigator who becomes the first female Chief of Detectives for the San Francisco Police Department. Helen Hunt, in an early role, played Prentiss' pre-teen daughter, Jill. Four 2-hour episodes were aired. Guest stars in the series' brief run included William Shatner, Cameron Mitchell, Don Murray, Joyce Van Patten and Jamie Farr. Featured Crew Francine Carroll Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Walter Amy Prentiss Helen Hunt Jill Prentiss Johnny Seven Detective Contreras Steve Sandor Detective Tony Russell Full Cast & Crew Last Season Season 1 1974 | 3 Episodes Season 1 of Amy Prentiss premiered on December  1, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Amy Prentiss. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Drama Keywords san francisco police detective female detective Content Score 79 Pump it up! We're close now. Top Contributors 12 Banana 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}