{"link": "https://www.themoviedb.org/tv/60818?language=en", "title": "The World is Still Beautiful", "resume": "Nike, the fourth princess of the Rain Dukedom and one who holds the power to call forth the rain, travels to the Sun Kingdom to marry Sun King Livius for her country, despite her own reluctance. She soon discovers that the King, who conquered the world in only three years after his ascendance to the throne, is still a child! Furthermore, for trivial reasons, he has demanded that Nike call forth the rain...?!", "rate": 71, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Rena Maeda", "Haruka Kudou", "Tomokazu Sugita", "Chisa Yokoyama", "Mariya Ise"], "character": ["Nike Remercier", "Livius Orvinus Ifrikia (young)", "Neil", "Tohara", "Mira Remercier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60818   Expand The World is Still Beautiful   (2014) User Score Overview Nike, the fourth princess of the Rain Dukedom and one who holds the power to call forth the rain, travels to the Sun Kingdom to marry Sun King Livius for her country, despite her own reluctance. She soon discovers that the King, who conquered the world in only three years after his ascendance to the throne, is still a child! Furthermore, for trivial reasons, he has demanded that Nike call forth the rain...?! Featured Crew Hajime Kamegaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rena Maeda Nike Remercier Haruka Kudou Livius Orvinus Ifrikia (young) Tomokazu Sugita Neil Chisa Yokoyama Tohara Mariya Ise Mira Remercier Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of The World is Still Beautiful premiered on April  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations   2012-10-04 BTOOOM! 6.3  Facts Original Name  それでも世界は美しい Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 32 benf45 26 Elizabeth Jennings 10 Jenazad TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}