{"link": "https://www.themoviedb.org/tv/252?language=en", "title": "Everybody Hates Chris", "resume": "Everybody Hates Chris is an American television narrative sitcom that depicts the troubled teenage experiences of comedian Chris Rock while growing up in Bedford-Stuyvesant, Brooklyn, New York City. The show is set between 1982 and 1987, but Rock himself was a teenager between 1978 and 1983. Rock grew up with a boy named Kenny Montero, whom he has often referred to as the inspiration for a lot of the episodes. In many of his interviews, Rock has described Kenny as the reason he got into comedy in the first place. The show's title parodies the hit CBS sitcom Everybody Loves Raymond, in which Rock stated: \"Everybody Loves Raymond, but Everybody Hates Chris!\". The show's lead actors are Tyler James Williams, Terry Crews, Tichina Arnold, Tequan Richmond, Imani Hakim, and Vincent Martella.\nIn 2008, the The CW moved Everybody Hates Chris and The Game to the Friday night death slot. The fourth season of the series premiered Friday, October 3, 2008, at 8:00PM Eastern/7:00PM Central. On May 21, 2009, The CW announced that it had cancelled Everybody Hates Chris. Prior to this, Rock announced that the end of season 4 matched up with his own past—dropping out of high school to become a comedian—and that it was time to end the show.", "rate": 70, "genre": ["Comedy"], "cast": ["Tyler James Williams", "Terry Crews", "Tequan Richmond", "Imani Hakim", "Jacqueline Mazarella"], "character": ["Chris", "Julius", "Drew", "Tonya", "Vivian Morello"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 252   Expand Everybody Hates Chris   (2005) User Score Overview Everybody Hates Chris is an American television narrative sitcom that depicts the troubled teenage experiences of comedian Chris Rock while growing up in Bedford-Stuyvesant, Brooklyn, New York City. The show is set between 1982 and 1987, but Rock himself was a teenager between 1978 and 1983. Rock grew up with a boy named Kenny Montero, whom he has often referred to as the inspiration for a lot of the episodes. In many of his interviews, Rock has described Kenny as the reason he got into comedy in the first place. The show's title parodies the hit CBS sitcom Everybody Loves Raymond, in which Rock stated: \"Everybody Loves Raymond, but Everybody Hates Chris!\". The show's lead actors are Tyler James Williams, Terry Crews, Tichina Arnold, Tequan Richmond, Imani Hakim, and Vincent Martella. In 2008, the The CW moved Everybody Hates Chris and The Game to the Friday night death slot. The fourth season of the series premiered Friday, October 3, 2008, at 8:00PM Eastern/7:00PM Central. On May 21, 2009, The CW announced that it had cancelled Everybody Hates Chris. Prior to this, Rock announced that the end of season 4 matched up with his own past—dropping out of high school to become a comedian—and that it was time to end the show. Featured Crew Chris Rock Creator Ali LeRoi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  9 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tyler James Williams Chris Terry Crews Julius Tequan Richmond Drew Imani Hakim Tonya Jacqueline Mazarella Vivian Morello Full Cast & Crew Last Season Season 4 2008 | 22 Episodes Season 4 of Everybody Hates Chris premiered on October  3, 2008. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Greg: Happy Birthday Vincent Martella! Open 0 by wonder2wonder\n      \n     w Chris: Happy Birthday Tyler James Williams! Open 0 by wonder2wonder\n      \n     w Tonya: Happy Birthday Imani Hakim! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  7 Recommendations   2001-03-28 My Wife and Kids 6.6    1996-09-13 Everybody Loves Raymond 6.3    1990-09-10 The Fresh Prince of Bel-Air 7.3    1998-08-23 That '70s Show 7.4    1996-09-17 Spin City 7.0    1993-09-12 Lois & Clark: The New Adventures of Superman 6.6    2005-09-20 My Name Is Earl 7.2    2000-01-09 Malcolm in the Middle 7.5  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  22m, 30m, 19m, 20m Homepage   http://www.everybodyhateschris.com/ Genres Comedy Keywords racism retro teenager brooklyn new york city black family sitcom 1980s family of color inspired by celebrity Content Score 93 Almost there... Top Contributors e 27 eriick_munhoz 20 Banana 7 lineker 6 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}