{"link": "https://www.themoviedb.org/tv/3785?language=en", "title": "Side Order of Life", "resume": "Side Order of Life is a dramatic television series broadcast by Lifetime on Sunday night. In its first five weeks it aired at 8:00pm ET/PT, then switched to the 9:00pm time slot.\nMarisa Coughlan plays Jenny McIntyre, a photographer who reconsiders her life and is reawakened to her options after her best friend, Vivy Porter, is diagnosed with a recurrence of cancer. Jason Priestley returns to regular series television as Ian Denison, Jenny's fiancé. Christopher Gartin rounds out the main case as Jenny's boss Rick Purdy at the fictional In Person magazine; he is in love with Vivy, who has rejected him.\nLifetime broadcast Side Order of Life with State of Mind and Army Wives in an effort to offer a night of new original programming aimed primarily at female viewers during the summer hiatus.\nSide Order of Life premiered on Lifetime on July 15, 2007. Initial reviews were positive, with Variety.com's Brian Lowry saying, \"writer-producer Margaret Nagle brings a level of wit to the proceedings superior to most chick-lit-inspired TV drama.\" The Seattle Times, after describing the premise, said, \"If this all sounds kind of corny, well, it kind of is until you realize the story line hits its mark, making you recall your own missteps and regrets for not having taken better charge.\"", "rate": 0, "genre": ["Drama"], "cast": ["Jason Priestley", "Marisa Coughlan", "Chris Gartin", "Diana Maria Riva", "Peri Gilpin"], "character": ["Ian Denison", "Jenny McIntyre", "Rick Purdy", "Vivy Porter", "Celia Hutchinson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3785   Expand Side Order of Life   (2007) User Score Overview Side Order of Life is a dramatic television series broadcast by Lifetime on Sunday night. In its first five weeks it aired at 8:00pm ET/PT, then switched to the 9:00pm time slot. Marisa Coughlan plays Jenny McIntyre, a photographer who reconsiders her life and is reawakened to her options after her best friend, Vivy Porter, is diagnosed with a recurrence of cancer. Jason Priestley returns to regular series television as Ian Denison, Jenny's fiancé. Christopher Gartin rounds out the main case as Jenny's boss Rick Purdy at the fictional In Person magazine; he is in love with Vivy, who has rejected him. Lifetime broadcast Side Order of Life with State of Mind and Army Wives in an effort to offer a night of new original programming aimed primarily at female viewers during the summer hiatus. Side Order of Life premiered on Lifetime on July 15, 2007. Initial reviews were positive, with Variety.com's Brian Lowry saying, \"writer-producer Margaret Nagle brings a level of wit to the proceedings superior to most chick-lit-inspired TV drama.\" The Seattle Times, after describing the premise, said, \"If this all sounds kind of corny, well, it kind of is until you realize the story line hits its mark, making you recall your own missteps and regrets for not having taken better charge.\" Featured Crew Margaret Nagle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Priestley Ian Denison Marisa Coughlan Jenny McIntyre Chris Gartin Rick Purdy Diana Maria Riva Vivy Porter Peri Gilpin Celia Hutchinson Full Cast & Crew Last Season Season 1 2007 | 12 Episodes Season 1 of Side Order of Life premiered on July 15, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Side Order of Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.lifetimetv.com/shows/sideorderoflife/ Genres Drama Keywords photographer cancer los angeles Content Score 93 Almost there... Top Contributors 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}