{"link": "https://www.themoviedb.org/tv/24165?language=en", "title": "Ladies of the Palace", "resume": "This drama depicts the in-fighting between women in the palace from the reign of Jungjong to Injong, particularly the power struggle featuring Queen Munjeong and Jung Nan Jung, her sister-in-law, and the way they pulled the strings behind the scenes.", "rate": 70, "genre": ["Drama", "War", "Politics"], "cast": ["Kang Soo-yeon", "Jeon In-Hwa", "Park Sang-min", "Kim Jung-eun", "Lee Deok-hwa "], "character": ["Jung Nan Jung", "Queen Munjeong", "Park Sang-min", "Neung Keum", "Yoon Won Hyung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24165   Expand Ladies of the Palace   (2001) User Score Overview This drama depicts the in-fighting between women in the palace from the reign of Jungjong to Injong, particularly the power struggle featuring Queen Munjeong and Jung Nan Jung, her sister-in-law, and the way they pulled the strings behind the scenes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kang Soo-yeon Jung Nan Jung Jeon In-Hwa Queen Munjeong Park Sang-min Park Sang-min Kim Jung-eun Neung Keum Lee Deok-hwa  Yoon Won Hyung Full Cast & Crew Last Season Season 1 2001 | 151 Episodes Season 1 of Ladies of the Palace premiered on February  5, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ladies of the Palace. You can help by rating TV shows you've seen. Facts Original Name  여인천하 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  22m Homepage  - Genres Drama War & Politics Keywords politics costume historical drama joseon dynasty Content Score 86 Almost there... Top Contributors 35 animerika d 5 daphie t 4 tmdb38202327 LS 3 Lee Seung-Su  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}