{"link": "https://www.themoviedb.org/tv/64555?language=en", "title": "Frontier", "resume": "The chaotic and violent struggle to control wealth and power in the North American fur trade in late 18th century Canada. Told from multiple perspectives, Frontier takes place in a world where business negotiations might be resolved with close-quarter hatchet fights, and where delicate relations between native tribes and Europeans can spark bloody conflicts.", "rate": 59, "genre": ["Action", "Adventure", "Drama"], "cast": ["Jason Momoa", "Landon Liboiron", "Alun Armstrong", "Jessica Matten", "Zoe Boyle"], "character": ["Declan Harp", "Michael Smyth", "Lord Benton", "Sokanon", "Grace Emberly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64555   Expand Frontier   (2016) User Score  Play Trailer Overview The chaotic and violent struggle to control wealth and power in the North American fur trade in late 18th century Canada. Told from multiple perspectives, Frontier takes place in a world where business negotiations might be resolved with close-quarter hatchet fights, and where delicate relations between native tribes and Europeans can spark bloody conflicts. Featured Crew Peter Blackie Creator Rob Blackie Creator Brad Peyton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Momoa Declan Harp Landon Liboiron Michael Smyth Alun Armstrong Lord Benton Jessica Matten Sokanon Zoe Boyle Grace Emberly Full Cast & Crew Current Season Season 2 2017 | 6 Episodes Season 2 of Frontier premiered on October 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  7 Recommendations   2011-01-11 Lights Out 8.1    2017-01-03 Heavy Rescue: 401 7.5    2016-01-07 Deep 7.0    2013-01-14 Father Brown 7.2    2017-09-25 The Brave 6.6    2017-02-02 Training Day 6.2    2016-09-21 Designated Survivor 7.3    2015-10-10 The Last Kingdom 7.7  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.discovery.ca/extra/frontier Genres Action & Adventure Drama Keywords native american historical fiction 18th century historical drama indigenous peoples fur trade Content Score 100 Yes! Looking good! Top Contributors 78 Elizabeth Jennings w 8 webmaster k 8 krassmoss a 7 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}