{"link": "https://www.themoviedb.org/tv/7815?language=en", "title": "Last Friends", "resume": "Last Friends is a Japanese television drama which aired on Fuji TV at 10:00 pm every Thursday from April 10, 2008 until June 17, 2008. The special, consisting of a recap and some new additional scenes aired on June 26, 2008.\nThe series follow the life of Michiru Aida, a beauty parlor assistant who returns to Tokyo after 4 years. Bullied by her seniors at work and abused by her boyfriend, she is reunited with her best friend during high school, Ruka Kishimoto, a skilled motocross racer. Takeru, a make-up artist, is introduced to Ruka by her housemate, Eri and thus begin a journey of friendship.\nA manga counterpart focusing on Ruka's and Michiru's high school days is currently being published in Malika. Although episode 11 was supposed to be the final episode, a sudden phone call requested the producers to add on a special. A movie has also been announced due to Last Friends' immense popularity.\nLast Friends was number 1 on Fuji's top 50 list from June 16 till June 29. However, it had since dropped to 6th place after the broadcast of the special and as of the week of July 7 to 13, Last Friends ranked 9th on the Top 50 list. Aside from the official website at Fuji TV, another website has also been created, named \"Last Friends: Another\".", "rate": 48, "genre": ["Drama"], "cast": ["Eita", "Juri Ueno", "Asami Mizukawa", "Masami Nagasawa", "Ryo Nishikido"], "character": ["Michiru Aida"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7815   Expand Last Friends   (2008) User Score Overview Last Friends is a Japanese television drama which aired on Fuji TV at 10:00 pm every Thursday from April 10, 2008 until June 17, 2008. The special, consisting of a recap and some new additional scenes aired on June 26, 2008. The series follow the life of Michiru Aida, a beauty parlor assistant who returns to Tokyo after 4 years. Bullied by her seniors at work and abused by her boyfriend, she is reunited with her best friend during high school, Ruka Kishimoto, a skilled motocross racer. Takeru, a make-up artist, is introduced to Ruka by her housemate, Eri and thus begin a journey of friendship. A manga counterpart focusing on Ruka's and Michiru's high school days is currently being published in Malika. Although episode 11 was supposed to be the final episode, a sudden phone call requested the producers to add on a special. A movie has also been announced due to Last Friends' immense popularity. Last Friends was number 1 on Fuji's top 50 list from June 16 till June 29. However, it had since dropped to 6th place after the broadcast of the special and as of the week of July 7 to 13, Last Friends ranked 9th on the Top 50 list. Aside from the official website at Fuji TV, another website has also been created, named \"Last Friends: Another\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eita Juri Ueno Asami Mizukawa Masami Nagasawa Michiru Aida Ryo Nishikido Full Cast & Crew Last Season Rasuto furenzu season 1 2008 | 11 Episodes Season 1 of Last Friends premiered on April 10, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Last Friends. You can help by rating TV shows you've seen. Facts Original Name  ラスト・フレンズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.fujitv.co.jp/lastfriends/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 8 Wendy NS 3 Norte Serra A 1 Aka75 1 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}