{"link": "https://www.themoviedb.org/tv/1340?language=en", "title": "Banacek", "resume": "Banacek is an American detective TV series starring George Peppard that aired on the NBC network from 1972 to 1974. The series was part of the rotating NBC Wednesday Mystery Movie anthology. It alternated in its time slot with several other shows but was the only one to last beyond its first season.", "rate": 85, "genre": ["Mystery", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1340   Expand Banacek   (1972) User Score Overview Banacek is an American detective TV series starring George Peppard that aired on the NBC network from 1972 to 1974. The series was part of the rotating NBC Wednesday Mystery Movie anthology. It alternated in its time slot with several other shows but was the only one to last beyond its first season. Featured Crew Anthony Wilson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 1973 | 8 Episodes Season 2 of Banacek premiered on October  3, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1965-01-24 Branded 8.3    1957-09-18 Wagon Train 6.3    1965-09-15 I Spy 6.9    1970-09-16 McCloud 7.0    1969-09-29 Love, American Style 5.7    1968-01-09 It Takes a Thief 7.4    1962-10-02 Combat! 7.1    1967-09-16 Mannix 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Mystery Drama Keywords boston theft private detective Content Score 64 We're so close, yet so far. Top Contributors 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}