{"link": "https://www.themoviedb.org/tv/59275?language=en", "title": "Border Security: Canada's Frontline", "resume": "Border Security: Canada's Front Line is a Canadian television program produced by Force Four Entertainment that airs on the National Geographic Channel. The show follows the work of officers of the Canada Border Services Agency as they enforce Canadian customs, quarantine, immigration and finance laws.", "rate": 0, "genre": ["Crime"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59275   Expand Border Security: Canada's Frontline   (2012) User Score  Play Trailer Overview Border Security: Canada's Front Line is a Canadian television program produced by Force Four Entertainment that airs on the National Geographic Channel. The show follows the work of officers of the Canada Border Services Agency as they enforce Canadian customs, quarantine, immigration and finance laws. Featured Crew Greg Laikin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2014 | 1 Episode Season 3 of Border Security: Canada's Frontline premiered on September  5, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Border Security: Canada's Frontline. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Border Security: Canada's Frontline. You can help by rating TV shows you've seen. Facts Original Name  Border Security: Canada's Front Line Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  40m Homepage   http://natgeotv.com/ca/border-security Genres Crime Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 13 gaminginsider 5 cameron92 D 3 DirtRider 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}