{"link": "https://www.themoviedb.org/tv/36962?language=en", "title": "Mistral's Daughter", "resume": "Beautiful and naïve Maggy Lunel arrives in Paris completely broke. She becomes an artist's model and the toast of Paris, attracting the attention of Picasso-like painter Julien Mistral, an arrogant and selfish man who places his work above everything. Their paths diverge as Mistral's art catches the eye of a rich American woman who becomes his patroness and eventually his wife. During the war years in France, Mistral collaborates with the Nazis in order to continue with his work, a decision that will come back to haunt him years later. In the meantime, Maggy has a daughter named Teddy who grows up and falls in love with Mistral with whom she has a child named Fauve. As Mistral ages, he comes to terms with his selfish past and wartime betrayal through his art, leaving a beautiful legacy for his daughter, Fauve. Written by Anonymous on IMDb", "rate": 70, "genre": ["Drama"], "cast": ["Stacy Keach", "Stefanie Powers", "Lee Remick", "Timothy Dalton", "Ian Richardson"], "character": ["Julien Mistral", "Maggy Lunel", "Kate Browning", "Perry Kilkullen", "Adrien Avigdor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36962   Expand Mistral's Daughter   (1984) User Score Overview Beautiful and naïve Maggy Lunel arrives in Paris completely broke. She becomes an artist's model and the toast of Paris, attracting the attention of Picasso-like painter Julien Mistral, an arrogant and selfish man who places his work above everything. Their paths diverge as Mistral's art catches the eye of a rich American woman who becomes his patroness and eventually his wife. During the war years in France, Mistral collaborates with the Nazis in order to continue with his work, a decision that will come back to haunt him years later. In the meantime, Maggy has a daughter named Teddy who grows up and falls in love with Mistral with whom she has a child named Fauve. As Mistral ages, he comes to terms with his selfish past and wartime betrayal through his art, leaving a beautiful legacy for his daughter, Fauve. Written by Anonymous on IMDb Featured Crew Kevin Connor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stacy Keach Julien Mistral Stefanie Powers Maggy Lunel Lee Remick Kate Browning Timothy Dalton Perry Kilkullen Ian Richardson Adrien Avigdor Full Cast & Crew Last Season Mini-Series 1984 | 7 Episodes Season 1 of Mistral's Daughter premiered on September 24, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Mistral's Daughter. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  360m Homepage  - Genres Drama Keywords paris based on novel or book artist painter miniseries model nazi occupation Content Score 93 Almost there... Top Contributors 35 Kirsten J Nielsen TB 24 TMDb Bot 12 Banana m 6 movienator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}