{"link": "https://www.themoviedb.org/tv/44606?language=en", "title": "Beauty and the Beast", "resume": "Detective Catherine Chandler is a smart, no-nonsense homicide detective. When she was a teenager, she witnessed the murder of her mother at the hands of two gunmen and herself was saved by someone – or something. Years have passed and while investigating a murder, Catherine discovers a clue that leads her to Vincent Keller, who was reportedly killed in 2002. Catherine learns that Vincent is actually still alive and that it was he who saved her many years before. For mysterious reasons that have forced him to live outside of traditional society, Vincent has been in hiding for the past 10 years to guard his secret – when he is enraged, he becomes a terrifying beast, unable to control his super-strength and heightened senses.", "rate": 58, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Kristin Kreuk", "Jay Ryan", "Nina Lisandrello", "Austin Basis", "Nicole Gale Anderson"], "character": ["Catherine Chandler", "Vincent Keller", "Tess Vargas", "J.T. Forbes", "Heather Chandler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44606   Expand Beauty and the Beast   (2012) User Score  Play Trailer Overview Detective Catherine Chandler is a smart, no-nonsense homicide detective. When she was a teenager, she witnessed the murder of her mother at the hands of two gunmen and herself was saved by someone – or something. Years have passed and while investigating a murder, Catherine discovers a clue that leads her to Vincent Keller, who was reportedly killed in 2002. Catherine learns that Vincent is actually still alive and that it was he who saved her many years before. For mysterious reasons that have forced him to live outside of traditional society, Vincent has been in hiding for the past 10 years to guard his secret – when he is enraged, he becomes a terrifying beast, unable to control his super-strength and heightened senses. Featured Crew Jennifer Levine Creator Ron Koslow Creator Sherri Cooper Landsman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  2 Images Backdrops  11 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kristin Kreuk Catherine Chandler Jay Ryan Vincent Keller Nina Lisandrello Tess Vargas Austin Basis J.T. Forbes Nicole Gale Anderson Heather Chandler Full Cast & Crew Last Season Season 4 2016 | 13 Episodes Season 4 of Beauty and the Beast premiered on June  2, 2016. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Vincent: Happy Birthday Jay Ryan! Open 0 by wonder2wonder\n      \n     w Heather: Happy Birthday Nicole Gale Anderson! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  14 Recommendations   2010-09-12 Lost Girl 6.7    2015-06-01 The Whispers 5.7    2010-07-09 Haven 7.0    2014-04-20 Salem 7.3    2014-09-17 The Mysteries of Laura 6.3    2011-09-20 Unforgettable 6.1    2011-06-14 The Nine Lives of Chloe King 6.5    2013-10-06 Witches of East End 6.6  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://cwtv.com/shows/beauty-and-the-beast Genres Drama Sci-Fi & Fantasy Keywords new york experiment police super soldier female detective beast ex soldier Content Score 100 Yes! Looking good! Top Contributors 74 Banana 56 Elizabeth Jennings md 27 movie dino 16 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}