{"link": "https://www.themoviedb.org/tv/63732?language=en", "title": "Dr. Ian", "resume": "The memories of pain and love shape our reality and personality, hence they can be used to find healing in counseling. This is the story of psychiatrist Mo Ian, who specializes in hypnosis treatments. He meets an eccentric, 4-D office girl, Lee So Dam, and through the process of treating and counselling her, he finds a way to heal his own wounds.", "rate": 0, "genre": ["Drama"], "cast": ["Kim Young-kwang", "Sandara Park"], "character": ["Dr. Mo Ian", "Lee So Dam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63732   Expand Dr. Ian   (2015) User Score Overview The memories of pain and love shape our reality and personality, hence they can be used to find healing in counseling. This is the story of psychiatrist Mo Ian, who specializes in hypnosis treatments. He meets an eccentric, 4-D office girl, Lee So Dam, and through the process of treating and counselling her, he finds a way to heal his own wounds. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Young-kwang Dr. Mo Ian Sandara Park Lee So Dam Full Cast & Crew Last Season Season 1 2015 | 9 Episodes Season 1 of Dr. Ian premiered on March 29, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dr. Ian. You can help by rating TV shows you've seen. Facts Original Name  Dr. 이안 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  10m Homepage   http://tvcast.naver.com/drian/ Genres Drama Keywords korea Content Score 56 We're so close, yet so far. Top Contributors M 35 Maria180493 5 Elizabeth Jennings 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}