{"link": "https://www.themoviedb.org/tv/62455?language=en", "title": "Locked Up", "resume": "Set up to take the blame for corporate fraud, young Macarena Ferreiro is locked up in a high-security women's prison surrounded by tough, ruthless criminals in this tense, provocative Spanish thriller.", "rate": 57, "genre": ["Drama"], "cast": ["Maggie Civantos", "Roberto Enríquez", "Daniel Ortiz", "Laura Baena"], "character": ["Macarena Ferreiro", "Fabio Martínez", "Román Ferreiro", "Antonia Trujillo Díez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62455   Expand Locked Up   (2015) User Score  Play Trailer Overview Set up to take the blame for corporate fraud, young Macarena Ferreiro is locked up in a high-security women's prison surrounded by tough, ruthless criminals in this tense, provocative Spanish thriller. Featured Crew Esther Martínez Lobato Creator Iván Escobar Creator Álex Pina Creator Daniel Écija Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maggie Civantos Macarena Ferreiro Roberto Enríquez Fabio Martínez Daniel Ortiz Román Ferreiro Laura Baena Antonia Trujillo Díez Full Cast & Crew Current Season Season 3 2018 | 8 Episodes Season 3 of Locked Up premiered on April 23, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Locked Up. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  5 Recommendations   2018-05-04 The Rain 6.1    2017-05-02 Money Heist 8.1    2017-10-24 The End of the F***ing World 7.9    2013-05-12 The Fall 7.6    2013-03-30 Orphan Black 7.6  Facts Original Name  Vis a vis Status  In Production Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  75m Homepage   https://www.foxtv.es/especial/vis-a-vis Genres Drama Keywords prison corruption prisoner prison guard homosexuality female prisoner Content Score 100 Yes! Looking good! Top Contributors 37 United600 d 21 dtarda 18 prm96 12 PremiumDay  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}