{"link": "https://www.themoviedb.org/tv/65722?language=en", "title": "The Fashion Fund", "resume": "Discover the future of fashion in this ultimate insider competition. Follow 10 up and coming designers as they compete to join the ranks of previous Fashion Fund winners such as Alexander Wang and Proenza Schouler. Each week the designers will be tested and judged by fashion's elite, including Vogue's Anna Wintour and designer Diane Von Furstenberg, for a chance to win $400,000 and a mentorship.", "rate": 70, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65722   Expand The Fashion Fund User Score Overview Discover the future of fashion in this ultimate insider competition. Follow 10 up and coming designers as they compete to join the ranks of previous Fashion Fund winners such as Alexander Wang and Proenza Schouler. Each week the designers will be tested and judged by fashion's elite, including Vogue's Anna Wintour and designer Diane Von Furstenberg, for a chance to win $400,000 and a mentorship. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2017 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  42m, 25m Homepage  - Genres Reality Keywords designer fashion reality competition Content Score 36 There's no 'I' in team... Top Contributors 10 Banana 9 Elizabeth Jennings 6 clapton x 2 xXx:  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}