{"link": "https://www.themoviedb.org/tv/12922?language=en", "title": "R. I. S. – Die Sprache der Toten", "resume": "R. I. S. – Die Sprache der Toten is a German television series broadcast by Sat.1 since 2007. The R. I. S. in the title is an acronym for Rechtsmedizinische Investigative Sonderkommission, referring to the fictional police investigation unit that is the focus of the series. The series, a crime drama, is a remake of an Italian television series entitled RIS Delitti Imperfetti.\nThe first season ended on 10 June 2007. The second and final season with another 13 episodes began airing 15 November 2007.", "rate": 0, "genre": ["Crime"], "cast": ["Julian Weigend", "Jana Klinge", "Tillbert Strahl", "Proschat Madani", "Hansa Czypionka"], "character": ["Philip Jacobi", "Marie Severin", "Timo Braun", "Judith Karimi", "Paul Schneider"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12922   Expand R. I. S. – Die Sprache der Toten   (2007) User Score Overview R. I. S. – Die Sprache der Toten is a German television series broadcast by Sat.1 since 2007. The R. I. S. in the title is an acronym for Rechtsmedizinische Investigative Sonderkommission, referring to the fictional police investigation unit that is the focus of the series. The series, a crime drama, is a remake of an Italian television series entitled RIS Delitti Imperfetti. The first season ended on 10 June 2007. The second and final season with another 13 episodes began airing 15 November 2007. Featured Crew Barbara Petronio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julian Weigend Philip Jacobi Jana Klinge Marie Severin Tillbert Strahl Timo Braun Proschat Madani Judith Karimi Hansa Czypionka Paul Schneider Full Cast & Crew Last Season Season 2 2007 | 13 Episodes Season 2 of R. I. S. – Die Sprache der Toten premiered on November 15, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on R. I. S. – Die Sprache der Toten. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  45m Homepage  - Genres Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 36 Samara 1 tobim91  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}