{"link": "https://www.themoviedb.org/tv/13587?language=en", "title": "Soldier Soldier", "resume": "Soldier Soldier is a British television drama series. The title comes from a traditional song of the same name - \"Soldier, soldier will you marry me, with your musket, fife and drum?\" - an instrumental version of which was used as its theme music.\nProduced by Central Television and broadcast on the ITV network, it ran for a total of seven seasons and 82 episodes from 1991 to 1997. It featured the daily lives of a group of soldiers in 'B' Company, 1st Battalion The King's Fusiliers, a fictional British Army infantry regiment loosely based on the Royal Regiment of Fusiliers. Set in the immediate aftermath of the Cold War, it is regarded as an accurate depiction of army life in the early to mid-1990s, when the British Army was undergoing significant change. This is perhaps best demonstrated during the third series, around 1994, when a significant number of real regiments were forced into amalgamations with each other due to downsizing of the army. In the world of Soldier Soldier, the King's Fusiliers are also forced to amalgamate with the Cumbrian Regiment, another fictional regiment, becoming the King's Own Fusiliers. At the time Soldier Soldier was broadcast, the fatality rate was low with most casualties due to training accidents and suicides. The military as a whole was assigned to performing more peacekeeping missions than actually doing any fighting. As a consequence, the show served well to portray the army, despite the domestic problems that could occur, in a fairly good light.", "rate": 65, "genre": ["Drama"], "cast": ["Robson Green", "Jerome Flynn", "Ben Nealon"], "character": ["Fusilier Dave Tucker", "Cpl Paddy Garvey", "Lt Jeremy Forsythe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13587   Expand Soldier Soldier   (1991) User Score Overview Soldier Soldier is a British television drama series. The title comes from a traditional song of the same name - \"Soldier, soldier will you marry me, with your musket, fife and drum?\" - an instrumental version of which was used as its theme music. Produced by Central Television and broadcast on the ITV network, it ran for a total of seven seasons and 82 episodes from 1991 to 1997. It featured the daily lives of a group of soldiers in 'B' Company, 1st Battalion The King's Fusiliers, a fictional British Army infantry regiment loosely based on the Royal Regiment of Fusiliers. Set in the immediate aftermath of the Cold War, it is regarded as an accurate depiction of army life in the early to mid-1990s, when the British Army was undergoing significant change. This is perhaps best demonstrated during the third series, around 1994, when a significant number of real regiments were forced into amalgamations with each other due to downsizing of the army. In the world of Soldier Soldier, the King's Fusiliers are also forced to amalgamate with the Cumbrian Regiment, another fictional regiment, becoming the King's Own Fusiliers. At the time Soldier Soldier was broadcast, the fatality rate was low with most casualties due to training accidents and suicides. The military as a whole was assigned to performing more peacekeeping missions than actually doing any fighting. As a consequence, the show served well to portray the army, despite the domestic problems that could occur, in a fairly good light. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robson Green Fusilier Dave Tucker Jerome Flynn Cpl Paddy Garvey Ben Nealon Lt Jeremy Forsythe Full Cast & Crew Last Season Season 1 1991 | 1 Episode Season 1 of Soldier Soldier premiered on June 10, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1990-09-27 Rab C. Nesbitt 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Drama Keywords army domestic life military Content Score 56 We're so close, yet so far. Top Contributors 11 Steve 8 lineker 6 Banana O 5 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}