{"link": "https://www.themoviedb.org/tv/1948?language=en", "title": "Degrassi", "resume": "The life of a group of adolescents going through the trials and tribulations of teendom at Degrassi Community School.", "rate": 65, "genre": ["Drama"], "cast": ["A.J. Saudin", "Demetrius Joyette", "Cristine Prosperi", "Luke Bilyk", "Niamh Wilson"], "character": ["Connor DeLaurier", "Michael 'Mike' Dallas", "Imogen Moreno", "Drew Torres", "Jack Jones"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1948   Expand Degrassi   (2001) User Score Overview The life of a group of adolescents going through the trials and tribulations of teendom at Degrassi Community School. Featured Crew Yan Moore Creator Linda Schuyler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  1 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast A.J. Saudin Connor DeLaurier Demetrius Joyette Michael 'Mike' Dallas Cristine Prosperi Imogen Moreno Luke Bilyk Drew Torres Niamh Wilson Jack Jones Full Cast & Crew Last Season Season 14 2014 | 25 Episodes Season 14 of Degrassi premiered on October 28, 2014. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply S Was it fair that Mr. Raddich was released after the shooting Open 0 by Strannger18\n      \n     w Eli: Happy Birthday Munro Chambers! Open 0 by wonder2wonder\n      \n     w Emma Nelson: Happy Birthday Miriam McDonald! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations   2016-01-04 Degrassi: Next Class 5.9    1998-09-29 Felicity 6.5    2005-09-18 Life with Derek 8.2    1996-09-27 Sabrina, the Teenage Witch 6.3    2009-07-07 10 Things I Hate About You 6.5    2011-09-22 Whitney 3.8    2003-01-17 That's So Raven 5.6    1992-07-08 Melrose Place 4.9  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://www.degrassi.tv/ Genres Drama Keywords high school canada toronto teenager teen drama teen social issues Content Score 93 Almost there... Top Contributors 694 Banana r 15 rocman TB 13 TMDb Bot 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}