{"link": "https://www.themoviedb.org/tv/17380?language=en", "title": "The Real Housewives of Atlanta", "resume": "Bravo's cameras turn to the Southern states as the network presents this inside look at the Real Housewives of Atlanta. These women handle the personal dramas that affect their affluent lifestyles with a signature Southern brand of “style” and “grace.”", "rate": 57, "genre": ["Reality"], "cast": ["Cynthia Bailey", "Kandi Burruss", "Kenya Moore", "NeNe Leakes", "Porsha Williams"], "character": ["Herself", "Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17380   Expand The Real Housewives of Atlanta   (2008) User Score Overview Bravo's cameras turn to the Southern states as the network presents this inside look at the Real Housewives of Atlanta. These women handle the personal dramas that affect their affluent lifestyles with a signature Southern brand of “style” and “grace.” Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cynthia Bailey Herself Kandi Burruss Herself Kenya Moore Herself NeNe Leakes Herself Porsha Williams Herself Full Cast & Crew Current Season Season 10 2017 | 22 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply b Team Kenya Open 1 by  Poetist Premiere Talk Open 0 by Poetist\n      \n     Kenya says the reunion is epic! Open 13 by  Poetist Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   2010-10-14 The Real Housewives of Beverly Hills 6.4    2006-03-21 The Real Housewives of Orange County 5.1    2017-02-26 The Real Housewives of Sydney 4.0    2009-05-12 The Real Housewives of New Jersey 5.1    2008-03-04 The Real Housewives of New York City 5.0    2016-01-27 Little Women: Atlanta 4.8    2016-01-17 The Real Housewives of Potomac 5.0    2005-08-07 The Girls Next Door 6.1  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  60m Homepage   http://www.bravotv.com/the-real-housewives-of-atlanta Genres Reality Keywords atlanta housewife Content Score 86 Almost there... Top Contributors 60 Elizabeth Jennings s 11 simbokesumringah r 7 robert123 D 6 DillanG96  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}