{"link": "https://www.themoviedb.org/tv/3514?language=en", "title": "On The First Beat", "resume": "On the First Beat is a TVB modern action series broadcast in June 2007.\nThe series is a direct sequel to 2005's The Academy. The main cast features Ron Ng, Sammul Chan and Chin Ka Lok from the original series and new cast including Michael Tao, Sonija Kwok, Joey Yung, Kenny Kwan and Kate Tsui. The story continues on with the two male leads in the series with their growth as young police officers with personal conflicts in their bonds as friends and romantic relationships. The drama is about the life of a group of Hong Kong police officers and cadets inside and outside of work.\nA direct sequel, E.U. was produced and airred in 2009 continued with Ron Ng and Sammul Chan, alongside Michael Miu, Kathy Chow, Elanne Kwong, and Michael Tse.", "rate": 0, "genre": ["Drama"], "cast": ["Sonija Kwok", "Sammul Chan", "Michael Tao", "Ron Ng", "Wong Cho-lam"], "character": ["Chung Lap-man", "Siu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3514   Expand On The First Beat   (2007) User Score Overview On the First Beat is a TVB modern action series broadcast in June 2007. The series is a direct sequel to 2005's The Academy. The main cast features Ron Ng, Sammul Chan and Chin Ka Lok from the original series and new cast including Michael Tao, Sonija Kwok, Joey Yung, Kenny Kwan and Kate Tsui. The story continues on with the two male leads in the series with their growth as young police officers with personal conflicts in their bonds as friends and romantic relationships. The drama is about the life of a group of Hong Kong police officers and cadets inside and outside of work. A direct sequel, E.U. was produced and airred in 2009 continued with Ron Ng and Sammul Chan, alongside Michael Miu, Kathy Chow, Elanne Kwong, and Michael Tse. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sonija Kwok Sammul Chan Michael Tao Ron Ng Chung Lap-man Wong Cho-lam Siu Full Cast & Crew Last Season Season 1 2007 | 28 Episodes Season 1 of On The First Beat premiered on June  4, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on On The First Beat. You can help by rating TV shows you've seen. Facts Original Name  學警出更 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.tvcity.tvb.com/drama/on_the_first_beat Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors v 6 vking  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}