{"link": "https://www.themoviedb.org/tv/46834?language=en", "title": "Saki", "resume": "From the 2011 drama, Utsukushi Rinjin, Nakama Yukie reprises the character Saki. This time round, as Saki Amihama, she will be targeting men. With the facade of an angel, she draws men to her, only to lead them to a destructive end. Like a moth to the flame... but where is the line drawn between the saint and the devil?", "rate": 0, "genre": ["Drama"], "cast": ["Ken Shounozaki", "Arisa Mabuchi", "Yukie Nakama", "Shohei Miura", "Yuki Uchida"], "character": ["Kazushige", "Young Yuki", "Saki Amihama", "Hayato Nitta", "Naomi Hamada"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46834   Expand Saki   (2013) User Score Overview From the 2011 drama, Utsukushi Rinjin, Nakama Yukie reprises the character Saki. This time round, as Saki Amihama, she will be targeting men. With the facade of an angel, she draws men to her, only to lead them to a destructive end. Like a moth to the flame... but where is the line drawn between the saint and the devil? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Shounozaki Kazushige Arisa Mabuchi Young Yuki Yukie Nakama Saki Amihama Shohei Miura Hayato Nitta Yuki Uchida Naomi Hamada Full Cast & Crew Last Season Season 1 2013 | 11 Episodes Season 1 of Saki premiered on January  8, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Saki. You can help by rating TV shows you've seen. Facts Original Name  サキ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  46m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors A 21 Aka75 t 7 tmdb983464 TB 4 TMDb Bot 3 thirstyhippo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}