{"link": "https://www.themoviedb.org/tv/34715?language=en", "title": "Kokoro Library", "resume": "Kokoro Library is a manga series by Nobuyuki Takagi that has been adapted into a moe anime directed by Koji Masunari, who is also known for being the director of the anime OVA series Read or Die and the 2005 anime series Kamichu.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Shin'ichirou Miki", "Miyuki Sawashiro", "Chiwa Saito", "Tomoko Kaneda", "Satomi Kōrogi"], "character": ["Jun Uezawa", "Iina", "Kokoro", "Akaha Okajima", "Akari Inoue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34715   Expand Kokoro Library   (2001) User Score Overview Kokoro Library is a manga series by Nobuyuki Takagi that has been adapted into a moe anime directed by Koji Masunari, who is also known for being the director of the anime OVA series Read or Die and the 2005 anime series Kamichu. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin'ichirou Miki Jun Uezawa Miyuki Sawashiro Iina Chiwa Saito Kokoro Tomoko Kaneda Akaha Okajima Satomi Kōrogi Akari Inoue Full Cast & Crew Last Season Season 1 2001 | 13 Episodes Season 1 of Kokoro Library premiered on October 12, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kokoro Library. You can help by rating TV shows you've seen. Facts Original Name  ココロ図書館 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 10 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}