{"link": "https://www.themoviedb.org/tv/2869?language=en", "title": "Minuit, le soir", "resume": "Minuit, le soir is an award-winning, character-driven Quebec television show. Set and shot in Montreal, the 30-minute show revolves around the lives of three bouncers, both in private and at work. The show is notable for its portrayal of the daily hardships facing each of the principal characters. Gritty cinematography and fast-paced direction are also key elements of the show's style. All the show's episodes were directed by Daniel Grou.\nAired by public broadcaster Radio-Canada, the show achieved critical acclaim in local media and among viewers, reaching on average 1.3 million people during its first season. Minuit, le soir eventually won 17 Gémeaux Awards for its three seasons, the local equivalent of the American Emmys, the Geminis in other Canadian provinces or the British Academy Television Awards.\nThe title of the show evokes the bouncers' work cycle and the fact they work at night. Although title screens and promotional logos do not include the comma between minuit and le, it does appears officially in the show's title.\nMinuit, le soir is set to finish its run at the end of the 13-episode 2007 season, which started on 11 January 2007.", "rate": 0, "genre": ["Drama"], "cast": ["Claude Legault", "Julien Poulin", "Louis Champagne", "Julie Perreault"], "character": ["Marc Forest", "Gaétan Langlois", "Louis Bergeron", "Fanny Campagnolo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2869   Expand Minuit, le soir   (2005) User Score Overview Minuit, le soir is an award-winning, character-driven Quebec television show. Set and shot in Montreal, the 30-minute show revolves around the lives of three bouncers, both in private and at work. The show is notable for its portrayal of the daily hardships facing each of the principal characters. Gritty cinematography and fast-paced direction are also key elements of the show's style. All the show's episodes were directed by Daniel Grou. Aired by public broadcaster Radio-Canada, the show achieved critical acclaim in local media and among viewers, reaching on average 1.3 million people during its first season. Minuit, le soir eventually won 17 Gémeaux Awards for its three seasons, the local equivalent of the American Emmys, the Geminis in other Canadian provinces or the British Academy Television Awards. The title of the show evokes the bouncers' work cycle and the fact they work at night. Although title screens and promotional logos do not include the comma between minuit and le, it does appears officially in the show's title. Minuit, le soir is set to finish its run at the end of the 13-episode 2007 season, which started on 11 January 2007. Featured Crew Claude Legault Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Claude Legault Marc Forest Julien Poulin Gaétan Langlois Louis Champagne Louis Bergeron Julie Perreault Fanny Campagnolo Full Cast & Crew Last Season Season 3 2007 | 10 Episodes Season 3 of Minuit, le soir premiered on January 11, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Minuit, le soir. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  22m, 30m Homepage   http://www.radio-canada.ca/television/minuit_le_soir/index.shtml Genres Drama Keywords night shift bar montreal bouncer doorman security guard Content Score 93 Almost there... Top Contributors 22 Banana T 4 TheIceMaster M 2 MarioCine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}