{"link": "https://www.themoviedb.org/tv/5262?language=en", "title": "Sunrise Earth", "resume": "Sunrise Earth is a nature documentary television series featuring hour-long episodes that aired in the United States on Discovery HD Theater, now renamed HD Theater. The series focuses on presenting the viewer with sunrises in various geographical locations throughout the world. It is also notable for its complete lack of human narration, concentrating instead on the natural sounds of each episodes' specific location. High-definition video images and Dolby 5.1 stereo surround sound are used to present each natural environment in a clear and detailed manner. The show is an example of the genre known as \"Experiential TV\", developed by series creator David Conover. The technique has been described by TV critic Tom Shales as \"crazily uneventful and thoroughly wonderful.\"\nCompass Light, Conover's small production company in Camden, Maine, started producing the series in 2004. 64 one-hour Sunrise Earth shows have been created in the first four years of production. The crew shoots with High Definition video cameras and the editors cut between multiple perspectives at a leisurely pace. The show is presented in real-time, with each shot lasting an average of 30 seconds. Each episode captures one sunrise from a certain location, such as Machu Picchu, Turkey or Scandinavia. Captions in the lower portion of the frame occasionally give information as to the location, time, and events on screen.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5262   Expand Sunrise Earth   (2004) User Score Overview Sunrise Earth is a nature documentary television series featuring hour-long episodes that aired in the United States on Discovery HD Theater, now renamed HD Theater. The series focuses on presenting the viewer with sunrises in various geographical locations throughout the world. It is also notable for its complete lack of human narration, concentrating instead on the natural sounds of each episodes' specific location. High-definition video images and Dolby 5.1 stereo surround sound are used to present each natural environment in a clear and detailed manner. The show is an example of the genre known as \"Experiential TV\", developed by series creator David Conover. The technique has been described by TV critic Tom Shales as \"crazily uneventful and thoroughly wonderful.\" Compass Light, Conover's small production company in Camden, Maine, started producing the series in 2004. 64 one-hour Sunrise Earth shows have been created in the first four years of production. The crew shoots with High Definition video cameras and the editors cut between multiple perspectives at a leisurely pace. The show is presented in real-time, with each shot lasting an average of 30 seconds. Each episode captures one sunrise from a certain location, such as Machu Picchu, Turkey or Scandinavia. Captions in the lower portion of the frame occasionally give information as to the location, time, and events on screen. Featured Crew David Conover Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2004 | 65 Episodes Season 1 of Sunrise Earth premiered on September 27, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sunrise Earth. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Velocity Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.dhd.discovery.com/convergence/sunriseearth/sunriseearth.html Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors S 4 Saltpieter v 4 vankooren A 1 Arminder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}