{"link": "https://www.themoviedb.org/tv/58950?language=en", "title": "Everest", "resume": "Based on the true story of the first Canadians to ever make it to the top of the world's tallest and most historic peak. A proud moment for Canadians and an adventure that is filled with bitterness, broken relationships and the bodies of four dead men.", "rate": 52, "genre": ["Drama"], "cast": ["Eric Johnson", "Jason Priestley", "William Shatner", "Leslie Hope"], "character": ["Laurie Skreslet", "John Lauchlan", "Norman Kelly", "Michelle Winegate"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58950   Expand Everest   (2008) User Score Overview Based on the true story of the first Canadians to ever make it to the top of the world's tallest and most historic peak. A proud moment for Canadians and an adventure that is filled with bitterness, broken relationships and the bodies of four dead men. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Johnson Laurie Skreslet Jason Priestley John Lauchlan William Shatner Norman Kelly Leslie Hope Michelle Winegate Full Cast & Crew Last Season Miniseries 2008 | 4 Episodes Season 1 of Everest premiered on August 31, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Everest. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   http://www.screendoor.org/productions/drama/everest Genres Drama Keywords winter mountain climbing miniseries mount everest 1980s Content Score 86 Almost there... Top Contributors 19 Banana TB 17 TMDb Bot R 9 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}