{"link": "https://www.themoviedb.org/tv/80298?language=en", "title": "The Trading Floor", "resume": "Anthony Yip, the Secretary of the Minister of Economic Development, collaborates with the “Three Financial Giants”: Eastman Properties president Ronald Man, Evergate Construction Materials president Fok Kin and Marco Media president Cheung Yung to manipulate the financial market for profit. In order to generate an even greater gain, Yip brings back financial genius Wai Hong from Myanmar, where he had been hiding from international authorities, in order to set the stage for a new financial crisis.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Francis Ng", "Joseph Chang Hsiao-Chuan", "Nan Yu", "Liu Kai-Chi"], "character": ["Anthony Yip", "Wai Hong", "Claudia Fang", "Law Kai-chung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80298   Expand The Trading Floor   (2018) User Score  Play Trailer Overview Anthony Yip, the Secretary of the Minister of Economic Development, collaborates with the “Three Financial Giants”: Eastman Properties president Ronald Man, Evergate Construction Materials president Fok Kin and Marco Media president Cheung Yung to manipulate the financial market for profit. In order to generate an even greater gain, Yip brings back financial genius Wai Hong from Myanmar, where he had been hiding from international authorities, in order to set the stage for a new financial crisis. Featured Crew Cora Yim Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Francis Ng Anthony Yip Joseph Chang Hsiao-Chuan Wai Hong Nan Yu Claudia Fang Liu Kai-Chi Law Kai-chung Full Cast & Crew Current Season Season 1 2018 | 5 Episodes Season 1 of The Trading Floor premiered on May 24, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Trading Floor. You can help by rating TV shows you've seen. Facts Original Name  東方華爾街 Status  Returning Series Network Certification  - Type  Miniseries Original Language  Cantonese Runtime  - Homepage  - Genres Crime Drama Keywords thriller financial Content Score 86 Almost there... Top Contributors r 37 robinchi w 4 whaledr 2 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}