{"link": "https://www.themoviedb.org/tv/43173?language=en", "title": "How Soon Is Now?", "resume": "How Soon Is Now? is a 2007 Swedish drama television serial directed by Mikael Marcimain. The narrative portrays four people who grow up Gothenburg between 1966 and 1976. The serial was produced for Sveriges Television, from a screenplay by Peter Birro.", "rate": 0, "genre": ["Drama"], "cast": ["Johan Kylén", "Amanda Ooms", "Corey Parker Robinson", "David Dencik", "Martin Wallström"], "character": ["Ingvar Berglund", "Marjut", "Samuel Jonsson", "Göran", "Roger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43173   Expand How Soon Is Now?   (2007) User Score Overview How Soon Is Now? is a 2007 Swedish drama television serial directed by Mikael Marcimain. The narrative portrays four people who grow up Gothenburg between 1966 and 1976. The serial was produced for Sveriges Television, from a screenplay by Peter Birro. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Johan Kylén Ingvar Berglund Amanda Ooms Marjut Corey Parker Robinson Samuel Jonsson David Dencik Göran Martin Wallström Roger Full Cast & Crew Last Season ? season 1 2007 | 4 Episodes Season 1 of How Soon Is Now? premiered on September  3, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for How Soon Is Now?. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on How Soon Is Now?. You can help by rating TV shows you've seen. Facts Original Name  Upp till kamp Status  Ended Network Certification  - Type  Miniseries Original Language  Swedish Runtime  352m Homepage  - Genres Drama Keywords miniseries Content Score 86 Almost there... Top Contributors 12 lineker TB 12 TMDb Bot p 6 prm_68 R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}