{"link": "https://www.themoviedb.org/tv/77361?language=en", "title": "Ultimate Expedition", "resume": "Nine strangers are brought together to summit a 20,000-foot mountain in the Peruvian Andes. With each step, these novice climbers will push themselves to their limits and beyond.", "rate": 100, "genre": ["Documentary"], "cast": ["Jukka Hildén", "Steve-O", "Chuck Liddell"], "character": ["Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77361   Expand Ultimate Expedition   (2018) User Score  Play Trailer Overview Nine strangers are brought together to summit a 20,000-foot mountain in the Peruvian Andes. With each step, these novice climbers will push themselves to their limits and beyond. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jukka Hildén Himself Steve-O Himself Chuck Liddell Himself Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Ultimate Expedition premiered on January 17, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ultimate Expedition. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  30m Homepage  - Genres Documentary Keywords mountain climbing Content Score 50 Still needs a little work. Top Contributors 16 Dr.Gonzo 4 clapton MP 1 Mr. Peanutbutter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}