{"link": "https://www.themoviedb.org/tv/13677?language=en", "title": "Follyfoot", "resume": "Follyfoot is a children's television series co-produced by the majority-partner British television company Yorkshire Television and the independent West German company TV Munich. It aired in the United Kingdom between 1971 and 1973, repeated for two years after that and again in the late 1980s. The series starred Gillian Blake in the lead role. Notable people connected with the series were actors Desmond Llewelyn and Arthur English and directors Jack Cardiff, Stephen Frears, Michael Apted and David Hemmings.\nIt was originally inspired by Monica Dickens' 1963 novel Cobbler's Dream; she later wrote four further books in conjunction with the series—Follyfoot in 1971, Dora at Follyfoot in 1972, The Horses of Follyfoot in 1975, and Stranger at Follyfoot in 1976.", "rate": 0, "genre": ["Family", "Drama"], "cast": ["Gillian Blake", "Steve Hodson", "Desmond Llewelyn", "Christian Rodska", "Arthur English"], "character": ["Dora", "Steve", "Colonel", "Ron Stryker", "Slugger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13677   Expand Follyfoot   (1971) User Score Overview Follyfoot is a children's television series co-produced by the majority-partner British television company Yorkshire Television and the independent West German company TV Munich. It aired in the United Kingdom between 1971 and 1973, repeated for two years after that and again in the late 1980s. The series starred Gillian Blake in the lead role. Notable people connected with the series were actors Desmond Llewelyn and Arthur English and directors Jack Cardiff, Stephen Frears, Michael Apted and David Hemmings. It was originally inspired by Monica Dickens' 1963 novel Cobbler's Dream; she later wrote four further books in conjunction with the series—Follyfoot in 1971, Dora at Follyfoot in 1972, The Horses of Follyfoot in 1975, and Stranger at Follyfoot in 1976. Featured Crew Monica Dickens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gillian Blake Dora Steve Hodson Steve Desmond Llewelyn Colonel Christian Rodska Ron Stryker Arthur English Slugger Full Cast & Crew Last Season Season 3 1973 | 13 Episodes Season 3 of Follyfoot premiered on June 23, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Follyfoot. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Drama Keywords horse Content Score 93 Almost there... Top Contributors L 18 Lemmy_6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}