{"link": "https://www.themoviedb.org/tv/36989?language=en", "title": "Surgeon Bong Dal Hee", "resume": "Surgeon Bong Dal-hee is a 2007 South Korean medical drama television  series starring Lee Yo-won, Lee Beom-soo, Kim Min-joon and Oh Yoon-ah.  It aired on SBS from January 17 to March 15, 2007 on Wednesdays and  Thursdays at 21:55 for 18 episodes.", "rate": 0, "genre": [], "cast": ["Lee Yo-won", "Oh Yoon-ah", "Choi Yeo-jin", "Lee Beom-soo", "Kim Min-joon"], "character": ["Bong Dal-hee", "Jo Moon-kyung", "Jo A-ra", "Ahn Joong-geun", "Lee Geon-wook"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36989   Expand Surgeon Bong Dal Hee   (2007) User Score Overview Surgeon Bong Dal-hee is a 2007 South Korean medical drama television  series starring Lee Yo-won, Lee Beom-soo, Kim Min-joon and Oh Yoon-ah.  It aired on SBS from January 17 to March 15, 2007 on Wednesdays and  Thursdays at 21:55 for 18 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Yo-won Bong Dal-hee Oh Yoon-ah Jo Moon-kyung Choi Yeo-jin Jo A-ra Lee Beom-soo Ahn Joong-geun Kim Min-joon Lee Geon-wook Full Cast & Crew Last Season Season 1 — | 18 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Surgeon Bong Dal Hee. You can help by rating TV shows you've seen. Facts Original Name  외과의사 봉달희 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors t 25 tmdb983464 3 sansalayne R 2 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}