{"link": "https://www.themoviedb.org/tv/69692?language=en", "title": "Ouro Verde", "resume": "Zé Maria Magalhães is an innocent young man who, suddenly, sees his dreams and family destroyed by a man's greed: Miguel Ferreira da Fonseca, a powerful banker. For 15 years, Zé Maria is forced to remain hidden, in a life of lies, in another country, imprisoned by the memories of the past, having to assume a new identity. Today, he is a great farmer, owner of the Ouro Verde empire, known as Jorge Monforte, and has become one of the richest men in Brazil. The course of time only fueled his desire for revenge, making him lose the sense of right and wrong and the ability to love. Fifteen years later, he returns to Portugal, ready to avenge the past and destroy Miguel Ferreira da Fonseca.", "rate": 45, "genre": ["Drama", "Soap"], "cast": ["Diogo Morgado", "Manuela Couto", "Ana Sofia Martins", "Rodrigo Paganelli", "Nuno Homem de Sá"], "character": ["Zé Maria Magalhães / Jorge Monforte", "Amanda Nascimento", "Vera Andrade", "Salvador Ferreira da Fonseca", "Otelo Monteiro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69692   Expand Ouro Verde   (2017) User Score  Play Trailer Overview Zé Maria Magalhães is an innocent young man who, suddenly, sees his dreams and family destroyed by a man's greed: Miguel Ferreira da Fonseca, a powerful banker. For 15 years, Zé Maria is forced to remain hidden, in a life of lies, in another country, imprisoned by the memories of the past, having to assume a new identity. Today, he is a great farmer, owner of the Ouro Verde empire, known as Jorge Monforte, and has become one of the richest men in Brazil. The course of time only fueled his desire for revenge, making him lose the sense of right and wrong and the ability to love. Fifteen years later, he returns to Portugal, ready to avenge the past and destroy Miguel Ferreira da Fonseca. Featured Crew Maria João Costa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diogo Morgado Zé Maria Magalhães / Jorge Monforte Manuela Couto Amanda Nascimento Ana Sofia Martins Vera Andrade Rodrigo Paganelli Salvador Ferreira da Fonseca Nuno Homem de Sá Otelo Monteiro Full Cast & Crew Last Season Season 1 2017 | 221 Episodes Season 1 of Ouro Verde premiered on January  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ouro Verde. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  50m Homepage   http://www.tvi.iol.pt/ouroverde/ Genres Drama Soap Keywords portugal revenge telenovela Content Score 86 Almost there... Top Contributors HS 101 Hugo S. 7 Elizabeth Jennings E 2 Ezequiel98 2 costapombo1997  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}