{"link": "https://www.themoviedb.org/tv/43945?language=en", "title": "Syndrome", "resume": "Syndrome is a 2012 South Korean medical drama series, starring Han Hye-jin, Song Chang-eui and Park Gun-hyung. It is set in the world of neurosurgery where a medical student finds herself in a love triangle with two fellow doctors. The television series aired on jTBC from February 13 to April 17, 2012 on Mondays and Tuesdays at 21:55 for 20 episodes.", "rate": 0, "genre": ["Drama", "Romance"], "cast": ["Han Hye-jin", "Song Chang-eui", "Jo Jae-hyeon", "Kim Sung-ryung", "Kim Yu-seok"], "character": ["Lee Hae-jo", "Cha Yeo-wook", "Cha Tae-jin", "Oh Eun-hee", "Min Sung-joon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43945   Expand Syndrome   (2012) User Score Overview Syndrome is a 2012 South Korean medical drama series, starring Han Hye-jin, Song Chang-eui and Park Gun-hyung. It is set in the world of neurosurgery where a medical student finds herself in a love triangle with two fellow doctors. The television series aired on jTBC from February 13 to April 17, 2012 on Mondays and Tuesdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Hye-jin Lee Hae-jo Song Chang-eui Cha Yeo-wook Jo Jae-hyeon Cha Tae-jin Kim Sung-ryung Oh Eun-hee Kim Yu-seok Min Sung-joon Full Cast & Crew Last Season Season 1 2012 | 20 Episodes Season 1 of Syndrome premiered on February 13, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Syndrome. You can help by rating TV shows you've seen. Facts Original Name  신드롬 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage  - Genres Drama Romance Keywords korea medical drama Content Score 93 Almost there... Top Contributors t 31 tmdb38202327 z 5 zurman1 3 lareina123 d 2 daphie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}