{"link": "https://www.themoviedb.org/tv/4752?language=en", "title": "Secret Squirrel", "resume": "Secret Squirrel is a funny animal cartoon character created by Hanna-Barbera, and also the name of his segment in the The Atom Ant/Secret Squirrel Show, which debuted in 1965. He was given his own show in 1966, but was reunited with Atom Ant for one more season in 1967. Secret first appeared in a prime-time animated special called The World of Atom Ant and Secret Squirrel, which aired on NBC on September 12, 1965.\nThe Secret Squirrel half-hours included three individual cartoon segments: \"Secret Squirrel,\" \"Squiddly Diddly,\" and \"Winsome Witch.\" Secret Squirrel's shorts were a parody of the then-popular spy genre, with most of his shorts' elements satirizing those of the James Bond films. Secret Squirrel was also known as \"Agent 000\". Beginning in 1993, thirteen new Secret Squirrel cartoons appeared in between the 2 Stupid Dogs episodes, with the updated title, Super Secret Secret Squirrel and a new cast. As of September 5, 2011, episode reruns returned on Boomerang from Cartoon Network.", "rate": 63, "genre": ["Family", "Animation", "Comedy"], "cast": ["Mel Blanc", "Paul Frees", "Daws Butler", "Dick Van Dyke", "Jess Harnell"], "character": ["Secret Squirrel (voice)", "Double Q (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4752   Expand Secret Squirrel   (1965) User Score Overview Secret Squirrel is a funny animal cartoon character created by Hanna-Barbera, and also the name of his segment in the The Atom Ant/Secret Squirrel Show, which debuted in 1965. He was given his own show in 1966, but was reunited with Atom Ant for one more season in 1967. Secret first appeared in a prime-time animated special called The World of Atom Ant and Secret Squirrel, which aired on NBC on September 12, 1965. The Secret Squirrel half-hours included three individual cartoon segments: \"Secret Squirrel,\" \"Squiddly Diddly,\" and \"Winsome Witch.\" Secret Squirrel's shorts were a parody of the then-popular spy genre, with most of his shorts' elements satirizing those of the James Bond films. Secret Squirrel was also known as \"Agent 000\". Beginning in 1993, thirteen new Secret Squirrel cartoons appeared in between the 2 Stupid Dogs episodes, with the updated title, Super Secret Secret Squirrel and a new cast. As of September 5, 2011, episode reruns returned on Boomerang from Cartoon Network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Mel Blanc Secret Squirrel (voice) Paul Frees Double Q (voice) Daws Butler Dick Van Dyke Jess Harnell Full Cast & Crew Last Season Season 2 1966 | 9 Episodes Season 2 of Secret Squirrel premiered on January  1, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Secret Squirrel. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Animation Comedy Keywords squirrel secret agent fighting crime Content Score 93 Almost there... Top Contributors 20 Banana TB 3 TMDb Bot m 3 magoozin 2 minhus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}