{"link": "https://www.themoviedb.org/tv/19514?language=en", "title": "Extremely Dangerous", "resume": "Extremely Dangerous is a 1999 four part series for ITV starring Sean Bean as an ex-National Criminal Intelligence Service undercover agent convicted of the brutal murder of his wife and child who goes on the run to try and clear his name. He sets out to follow up a strange clue sent to him in prison. The boss of a local crime syndicate, a former associate, hears of his escape and sends out the word to bring him in. On the run from the police and disowned by his NCIS colleagues, he is faced with the fact that he may be guilty.", "rate": 0, "genre": ["Drama"], "cast": ["Sean Bean", "Nitin Ganatra", "Juliet Aubrey", "Tony Booth", "Ralph Brown"], "character": ["Neil Byrne", "Ali Khan", "Annie", "Frank Palmer", "Joe Connor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19514   Expand Extremely Dangerous   (1999) User Score Overview Extremely Dangerous is a 1999 four part series for ITV starring Sean Bean as an ex-National Criminal Intelligence Service undercover agent convicted of the brutal murder of his wife and child who goes on the run to try and clear his name. He sets out to follow up a strange clue sent to him in prison. The boss of a local crime syndicate, a former associate, hears of his escape and sends out the word to bring him in. On the run from the police and disowned by his NCIS colleagues, he is faced with the fact that he may be guilty. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sean Bean Neil Byrne Nitin Ganatra Ali Khan Juliet Aubrey Annie Tony Booth Frank Palmer Ralph Brown Joe Connor Full Cast & Crew Last Season Season 1 1999 | 4 Episodes Season 1 of Extremely Dangerous premiered on November 11, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Extremely Dangerous. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords murder on the run miniseries woman director innocent Content Score 71 Just a little bit more... Top Contributors TB 18 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}