{"link": "https://www.themoviedb.org/tv/1891?language=en", "title": "Rome", "resume": "A down-to-earth account of the lives of both illustrious and ordinary Romans set in the last days of the Roman Republic.", "rate": 82, "genre": ["Action", "Adventure", "Drama"], "cast": ["Kevin McKidd", "Ray Stevenson", "Ciarán Hinds", "James Purefoy", "Polly Walker"], "character": ["Lucius Vorenus", "Titus Pullo", "Julius Caesar", "Mark Antony", "Atia of the Julii"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1891   Expand Rome   (2005) User Score  Play Trailer Overview A down-to-earth account of the lives of both illustrious and ordinary Romans set in the last days of the Roman Republic. Featured Crew Bruno Heller Creator John Milius Creator William J. MacDonald Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  13 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  3 Opening Credits  0 Top Billed Cast Kevin McKidd Lucius Vorenus Ray Stevenson Titus Pullo Ciarán Hinds Julius Caesar James Purefoy Mark Antony Polly Walker Atia of the Julii Full Cast & Crew Last Season Season 2 2007 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply I was gonna say... Open 2 by  movie_nazi The show that made Game of Thrones possible. Open 5 by  Strange Bedfellows Go to Discussions Media Most Popular Videos  4 Backdrops  13 Posters  11 Recommendations   2010-01-22 Spartacus 7.8    2010-09-19 Boardwalk Empire 7.7    2004-03-21 Deadwood 8.1    2007-04-01 The Tudors 7.5    1999-01-10 The Sopranos 8.3    2002-06-02 The Wire 8.4    1997-07-12 Oz 8.1    2001-06-03 Six Feet Under 8.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 50m Homepage   http://www.bbc.co.uk/programmes/b007r6t5 Genres Action & Adventure Drama Keywords ancient rome historical drama Content Score 100 Yes! Looking good! Top Contributors 23 Elizabeth Jennings D 19 Doule 18 Apollo 14 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}