{"link": "https://www.themoviedb.org/tv/34381?language=en", "title": "Great Migrations", "resume": "Great Migrations is a seven-episode nature documentary television miniseries that airs on the National Geographic Channel, featuring the great migrations of animals across the globe. The seven-part show is the largest programming event in the ten-year history of the channel and is part of the largest cross-platform initiative since the founding of the National Geographic Society. It was filmed in HD, and premiered on November 7, 2010 with accompanying coverage in the National Geographic magazine and an official companion book.", "rate": 82, "genre": ["Documentary"], "cast": ["Alec Baldwin", "Vincent Cassel", "Thomas Fritsch", "Peter Coyote", "James Byrnes"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34381   Expand Great Migrations   (2010) User Score Overview Great Migrations is a seven-episode nature documentary television miniseries that airs on the National Geographic Channel, featuring the great migrations of animals across the globe. The seven-part show is the largest programming event in the ten-year history of the channel and is part of the largest cross-platform initiative since the founding of the National Geographic Society. It was filmed in HD, and premiered on November 7, 2010 with accompanying coverage in the National Geographic magazine and an official companion book. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  14 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alec Baldwin Himself - Narrator Vincent Cassel Thomas Fritsch Peter Coyote James Byrnes Full Cast & Crew Last Season Season 1 2010 | 7 Episodes Season 1 of Great Migrations premiered on November  7, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Great Migrations. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  14 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on Great Migrations. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  45m Homepage   http://www.channel.nationalgeographic.com/channel/great-migrations/ Genres Documentary Keywords miniseries animal Content Score 86 Almost there... Top Contributors TB 28 TMDb Bot c 9 champi68 r 9 robko22 R 7 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}