{"link": "https://www.themoviedb.org/tv/36210?language=en", "title": "Blue Dragon", "resume": "A terrible and mysterious enemy attacks the small village of Shu and his friend Kluke. The great warrior Zola, followed by Jiro, will help them discover the ability to evoke shadows (in the form of monsters of all kinds) to fight against the evil invaders. The four, who call themselves Shadow Evocators, take a trip to find all the other boys who have a shadow to defeat the wicked Nene, who heads the Great Reagan, an army that attacked Talta. The evocative boys are actually descendants of the legendary Soldiers of Light, those who for centuries had saved the world from evil. The group will also join the lovely Marumaro, and the sweet Bouquet.", "rate": 73, "genre": ["Action", "Adventure", "Animation"], "cast": ["Jin Horikawa", "Romi Park", "Masaya Takatsuka"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36210   Expand Blue Dragon   (2007) User Score Overview A terrible and mysterious enemy attacks the small village of Shu and his friend Kluke. The great warrior Zola, followed by Jiro, will help them discover the ability to evoke shadows (in the form of monsters of all kinds) to fight against the evil invaders. The four, who call themselves Shadow Evocators, take a trip to find all the other boys who have a shadow to defeat the wicked Nene, who heads the Great Reagan, an army that attacked Talta. The evocative boys are actually descendants of the legendary Soldiers of Light, those who for centuries had saved the world from evil. The group will also join the lovely Marumaro, and the sweet Bouquet. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jin Horikawa Romi Park Masaya Takatsuka Full Cast & Crew Last Season Season 2 2008 | 51 Episodes Season 2 of Blue Dragon premiered on April  5, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Blue Dragon. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  Japanese Runtime  23m Homepage   animesx.ga Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 7 9 7bst 8 asker721 R 6 Rostack z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}