{"link": "https://www.themoviedb.org/tv/68518?language=en", "title": "My Father's Murderers", "resume": "The action series begins when the main character, a young police inspector Aleksandar Jakovljevic, despite its problematic behavior, receives an important case - killed the daughter of a prominent man unit whose company is building the largest residential - commercial complex in the region. The investigation goes in that direction, or even torn Aleksandar their problems, nothing leaves the case and digging into every aspect of life of the murdered girl, unaware of the danger which is exposed because someone cares about is to cover up the killing as quickly as possible. Aleksandar tortured and personal pain of the never solved the murder of his father Mileta also a police inspector when he discovers that the murder may be linked both to him solve the murder of a young girl becomes a mission. he don't know who to trust along the way, whether your boss and best friend of his dead father, police chief Marjanovic, Mirko whether colleagues or two women in his life, Mary - the public prosecutor with whom he related, while in his heart does not pick up a young scientist Jelena. While all the risks and desperately searching for the truth, they will not know how it can be really painful.", "rate": 100, "genre": ["Crime"], "cast": ["Vuk Kostić", "Marko Janketić", "Katarina Radivojević", "Nina Janković", "Tihomir Stanić"], "character": ["Александар Јаковљевић", "Мирко", "Марија", "Јелена", "Шеф полиције Марјановић"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68518   Expand My Father's Murderers   (2016) User Score  Play Trailer Overview The action series begins when the main character, a young police inspector Aleksandar Jakovljevic, despite its problematic behavior, receives an important case - killed the daughter of a prominent man unit whose company is building the largest residential - commercial complex in the region. The investigation goes in that direction, or even torn Aleksandar their problems, nothing leaves the case and digging into every aspect of life of the murdered girl, unaware of the danger which is exposed because someone cares about is to cover up the killing as quickly as possible. Aleksandar tortured and personal pain of the never solved the murder of his father Mileta also a police inspector when he discovers that the murder may be linked both to him solve the murder of a young girl becomes a mission. he don't know who to trust along the way, whether your boss and best friend of his dead father, police chief Marjanovic, Mirko whether colleagues or two women in his life, Mary - the public prosecutor with whom he related, while in his heart does not pick up a young scientist Jelena. While all the risks and desperately searching for the truth, they will not know how it can be really painful. Featured Crew Predrag Antonijević Creator Nataša Drakulić Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vuk Kostić Александар Јаковљевић Marko Janketić Мирко Katarina Radivojević Марија Nina Janković Јелена Tihomir Stanić Шеф полиције Марјановић Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of My Father's Murderers premiered on October 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Father's Murderers. You can help by rating TV shows you've seen. Facts Original Name  Ubice mog oca Status  Returning Series Network Certification  - Type  Scripted Original Language  Serbian Runtime  50m Homepage  - Genres Crime Keywords murder police investigation Content Score 100 Yes! Looking good! Top Contributors 49 Предраг 12 vuleman s 4 shobra TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}