{"link": "https://www.themoviedb.org/tv/60773?language=en", "title": "Wildest Islands", "resume": "Islands can be home to the most extreme examples of life and the some of the most dramatic landscapes. Natural selection fuels evolution in the most extraordinary way. Isolated for hundreds of thousands of years, pockets of individuals survive, thrive and adapt to fill all available niches fuelling a rapid development of new species. Wildest Islands, a stunning five-part series featuring the world’s most spectacular island locations. Dive into the crystal clear waters of the Caribbean; journey through the lush forests of Zanzibar; discover the unspoilt environs of the Hebrides; and uncover the enduring wonders of the Galapagos Islands as Wildest Islands investigates the rich history of these pristine paradises.", "rate": 80, "genre": ["Documentary"], "cast": ["Paul McGann"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60773   Expand Wildest Islands   (2012) User Score  Play Trailer Overview Islands can be home to the most extreme examples of life and the some of the most dramatic landscapes. Natural selection fuels evolution in the most extraordinary way. Isolated for hundreds of thousands of years, pockets of individuals survive, thrive and adapt to fill all available niches fuelling a rapid development of new species. Wildest Islands, a stunning five-part series featuring the world’s most spectacular island locations. Dive into the crystal clear waters of the Caribbean; journey through the lush forests of Zanzibar; discover the unspoilt environs of the Hebrides; and uncover the enduring wonders of the Galapagos Islands as Wildest Islands investigates the rich history of these pristine paradises. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul McGann Narrator Full Cast & Crew Last Season Season 2 — | 5 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Wildest Islands. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  45m Homepage  - Genres Documentary Keywords island Content Score 50 Still needs a little work. Top Contributors 16 Elizabeth Jennings 4 tigru89 TB 3 TMDb Bot 1 digit  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}