{"link": "https://www.themoviedb.org/tv/19051?language=en", "title": "The Comedians", "resume": "The comedians is a British television show of the 1970s produced by Johnnie Hamp of Granada Television. The show gave a stage to nightclub and working men's club comedians of the era, including Russ Abbot, Lennie Bennett, Stan Boardman, Jim Bowen, Jimmy Bright, Duggie Brown, Mike Burton, Dave Butler, Brian Carroll, Frank Carson, Mike Coyne, Jimmy Cricket, Colin Crompton, Pauline Daniels, Charlie Daze, Vince Earl, Steve Faye, Eddie Flanagan, Stu Francis, Ken Goodwin, Jackie Hamilton, Jerry Harris, George King, Bobby Knutt, Bernard Manning, Mike McCabe, Paul Melba, Mick Miller, Hal Nolan, Tom O'Connor, Tom Pepper, Bryn Phillips, Mike Reid, George Roper, Harry Scott, Sammy Thomas, Johnny Wager, Roy Walker, Charlie Williams, Lee Wilson and Lenny Windsor.\nAlso featured on the TV show, were Shep's Banjo Boys, a 7-piece band comprising Charlie Bentley, John Drury, Andy Holdorf, John Orchard, John Rollings, Graham Shepherd and Howard Shepherd. In 1973, the line up was Mike Dexter, Tony \"Tosh\" Kennedy, Ged Martin, Tony Pritchard, Graham Shepherd and Howard \"Shep\" Shepherd.", "rate": 0, "genre": ["Comedy"], "cast": ["Russ Abbot", "Roy Walker", "Lennie Bennett", "Mike Reid", "Bobby Knutt"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19051   Expand The Comedians   (1971) User Score Overview The comedians is a British television show of the 1970s produced by Johnnie Hamp of Granada Television. The show gave a stage to nightclub and working men's club comedians of the era, including Russ Abbot, Lennie Bennett, Stan Boardman, Jim Bowen, Jimmy Bright, Duggie Brown, Mike Burton, Dave Butler, Brian Carroll, Frank Carson, Mike Coyne, Jimmy Cricket, Colin Crompton, Pauline Daniels, Charlie Daze, Vince Earl, Steve Faye, Eddie Flanagan, Stu Francis, Ken Goodwin, Jackie Hamilton, Jerry Harris, George King, Bobby Knutt, Bernard Manning, Mike McCabe, Paul Melba, Mick Miller, Hal Nolan, Tom O'Connor, Tom Pepper, Bryn Phillips, Mike Reid, George Roper, Harry Scott, Sammy Thomas, Johnny Wager, Roy Walker, Charlie Williams, Lee Wilson and Lenny Windsor. Also featured on the TV show, were Shep's Banjo Boys, a 7-piece band comprising Charlie Bentley, John Drury, Andy Holdorf, John Orchard, John Rollings, Graham Shepherd and Howard Shepherd. In 1973, the line up was Mike Dexter, Tony \"Tosh\" Kennedy, Ged Martin, Tony Pritchard, Graham Shepherd and Howard \"Shep\" Shepherd. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Russ Abbot Roy Walker Lennie Bennett Mike Reid Bobby Knutt Full Cast & Crew Last Season Season 11 1992 | 5 Episodes Season 11 of The Comedians premiered on July  9, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Comedians. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 1 Markxist a 1 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}