{"link": "https://www.themoviedb.org/tv/67773?language=en", "title": "Dirk Gently's Holistic Detective Agency", "resume": "A comedic thriller that follows the bizarre adventures of eccentric “holistic” detective Dirk Gently and his reluctant assistant Todd. An adaptation of Douglas Adams’ wildly successful comic novels.", "rate": 77, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Samuel Barnett", "Elijah Wood", "Hannah Marks", "Jade Eshete", "Fiona Dourif"], "character": ["Dirk Gently", "Todd Brotzman", "Amanda Brotzman", "Farah Black", "Bart Curlish"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67773   Expand Dirk Gently's Holistic Detective Agency   (2016) User Score  Play Trailer Overview A comedic thriller that follows the bizarre adventures of eccentric “holistic” detective Dirk Gently and his reluctant assistant Todd. An adaptation of Douglas Adams’ wildly successful comic novels. Featured Crew Max Landis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  4 Posters  7 Videos Trailers  1 Teasers  2 Clips  1 Featurettes  1 Opening Credits  0 Top Billed Cast Samuel Barnett Dirk Gently Elijah Wood Todd Brotzman Hannah Marks Amanda Brotzman Jade Eshete Farah Black Fiona Dourif Bart Curlish Full Cast & Crew Current Season Season 2 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Anyone else watching this? Open 2 by  JustinJackFlash Dirk Gently - currently Cancelled Open 4 by  Cheetara t season 2? Open 8 by  TheVorlon Go to Discussions Media Most Popular Videos  5 Backdrops  4 Posters  7 Recommendations   2016-12-16 The OA 7.3    2016-05-22 Preacher 7.4    2012-03-05 Dirk Gently 8.1    2015-03-06 Unbreakable Kimmy Schmidt 7.2    2012-12-06 A Young Doctor's Notebook 6.8    2013-07-21 Axe Cop 5.5    2003-06-27 Dead Like Me 7.8    2017-01-13 A Series of Unfortunate Events 7.1  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.bbcamerica.com/shows/dirk-gentlys-holistic-detective-agency Genres Comedy Sci-Fi & Fantasy Keywords based on novel or book detective supernatural powers murder investigation Content Score 100 Yes! Looking good! Top Contributors 61 Elizabeth Jennings O 14 OblateSphereDroid 13 muku555 D 8 Denys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}