{"link": "https://www.themoviedb.org/tv/43252?language=en", "title": "Kidnap and Ransom", "resume": "Kidnap and Ransom is a British television three-part miniseries, originally shown on ITV in January 2011 with a second series following in February 2012. The series follows the work of a British hostage negotiator Dominic King, played by Trevor Eve, who is also executive producer of the series.", "rate": 76, "genre": ["Action", "Adventure", "Drama"], "cast": ["Trevor Eve", "Helen Baxendale", "Amara Karan", "Natasha Little"], "character": ["Dominic King", "Angela Beddoes", "Carrie Heath", "Sophie King"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43252   Expand Kidnap and Ransom   (2011) User Score Overview Kidnap and Ransom is a British television three-part miniseries, originally shown on ITV in January 2011 with a second series following in February 2012. The series follows the work of a British hostage negotiator Dominic King, played by Trevor Eve, who is also executive producer of the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Trevor Eve Dominic King Helen Baxendale Angela Beddoes Amara Karan Carrie Heath Natasha Little Sophie King Full Cast & Crew Last Season Season 2 2012 | 3 Episodes Season 2 of Kidnap and Ransom premiered on February 23, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2006-01-01 In Justice 6.8    2016-06-08 Power Monkeys 7.0    2011-06-06 Injustice 7.3    2012-08-30 Good Cop 6.6    2015-04-15 The Delivery Man 6.5    2011-05-02 Case Sensitive 5.4    2013-09-05 The Guilty 7.0    2010-07-12 The Silence 6.8  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 15 Banana t 12 tmdb48730457 S 7 Shady12 w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}