{"link": "https://www.themoviedb.org/tv/60781?language=en", "title": "A Bite of China", "resume": "This series explores the history, traditions and culture of Chinese food. Filmed at over 160 locations across China, this series truly is a feast for the senses. The seven-episode documentary series introduces the history and story behind foods of various kinds in more than 160 locations in mainland China, Hong Kong, and Taiwan. The documentary has also been actively encouraged as a means of introducing Chinese food culture to those unfamiliar with local cuisine.", "rate": 100, "genre": ["Documentary"], "cast": ["Li Lihong"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60781   Expand A Bite of China   (2012) User Score Overview This series explores the history, traditions and culture of Chinese food. Filmed at over 160 locations across China, this series truly is a feast for the senses. The seven-episode documentary series introduces the history and story behind foods of various kinds in more than 160 locations in mainland China, Hong Kong, and Taiwan. The documentary has also been actively encouraged as a means of introducing Chinese food culture to those unfamiliar with local cuisine. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Li Lihong Narrator Full Cast & Crew Current Season Season 3 2018 | 8 Episodes Season 3 of A Bite of China premiered on February 19, 2018. View All Seasons Social Reviews  1 Discussions  0 A review by Joseph  10.0 Written by  Joseph  on June 29, 2017 An intimate look at the peoples of the great nation of China - from the mountains, tundra to the busiest cities like Hong Kong and Shanghai. A delight to watch and learn the origins of the food that we take for granted with each mouthful. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Bite of China. You can help by rating TV shows you've seen. Facts Original Name  舌尖上的中国 Status  Returning Series Network CCTV Certification  - Type  Documentary Original Language  Chinese Runtime  49m Homepage   http://tv.cntv.cn/videoset/VSET100325265910 Genres Documentary Keywords food chinese food culinary arts Content Score 56 We're so close, yet so far. Top Contributors 33 Elizabeth Jennings j 8 jingxj 5 againlin 5 kw17th@gmail.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}