{"link": "https://www.themoviedb.org/tv/34148?language=en", "title": "この醜くも美しい世界", "resume": "This Ugly Yet Beautiful World is an anime television series created by Shouji Saeki and Hiroyuki Yamaga. It was co-produced by the Gainax and Shaft animation studios.\nThe series aired on the Tokyo Broadcasting System from April 1, 2004 to June 16, 2004, totaling 12 episodes. A manga adaptation, illustrated by Ashita Morimi, was serialized in Hakusensha's Young Animal.", "rate": 0, "genre": ["Animation", "Drama", "Comedy"], "cast": ["Fujiko Takimoto", "Ayako Kawasumi", "Takahiro Mizushima", "Ai Shimizu", "Asami Sanada"], "character": ["Ryou Ninomiya", "Hikari", "Takeru Takemoto", "Akari", "Mari Nishino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34148   Expand この醜くも美しい世界   (2004) User Score Overview This Ugly Yet Beautiful World is an anime television series created by Shouji Saeki and Hiroyuki Yamaga. It was co-produced by the Gainax and Shaft animation studios. The series aired on the Tokyo Broadcasting System from April 1, 2004 to June 16, 2004, totaling 12 episodes. A manga adaptation, illustrated by Ashita Morimi, was serialized in Hakusensha's Young Animal. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  8 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fujiko Takimoto Ryou Ninomiya Ayako Kawasumi Hikari Takahiro Mizushima Takeru Takemoto Ai Shimizu Akari Asami Sanada Mari Nishino Full Cast & Crew Last Season Season 1 2004 | 12 Episodes Season 1 of この醜くも美しい世界 premiered on April  1, 2004. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply There are no discussions for この醜くも美しい世界. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on この醜くも美しい世界. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 16 Meaning Not recommended for children under 16. Not allowed air before 10:30 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 14 Rebecca 6 seboseboss 3 Jack Duiz m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}