{"link": "https://www.themoviedb.org/tv/44300?language=en", "title": "A Bridge to the Starry Skies", "resume": "Hoshizora e Kakaru Hashi, sometimes shortened to Hoshikaka and also known by the translation A Bridge to the Starry Skies, is an erotic visual novel developed and published by Feng, released on October 15, 2010 for Windows. The story, a mostly comedic slice-of-life, centers on Kazuma Hoshino, an adolescent boy who moves into rural Japan with his brother, and the personal and romantic encounters he has with a handful of the female residents there. Though the game requires little interaction from users, Hoshikaka engages the player through a nonlinear plot that they are given opportunities to change the course of during play.\nFeng announced work on Hoshizora e Kakaru Hashi in May 2009 and marketed it through public venues and the broadcast of a radio drama throughout development. The game was postponed a total of nine times and released almost a year after its initial date but was met with relatively positive reception. On November 11, 2011 Feng announced work on a fan disc for the game, set to be released on February 24, 2012.\nFollowing the game's release, Hoshizora e Kakaru Hashi made transitions into other media. Two light novels were published, as was an art book, audio dramas and several albums of music. A twelve-episode animated television series and direct-to-video single release was also produced by Dogakobo.", "rate": 90, "genre": ["Sci-Fi", "Fantasy", "Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44300   Expand A Bridge to the Starry Skies   (2011) User Score Overview Hoshizora e Kakaru Hashi, sometimes shortened to Hoshikaka and also known by the translation A Bridge to the Starry Skies, is an erotic visual novel developed and published by Feng, released on October 15, 2010 for Windows. The story, a mostly comedic slice-of-life, centers on Kazuma Hoshino, an adolescent boy who moves into rural Japan with his brother, and the personal and romantic encounters he has with a handful of the female residents there. Though the game requires little interaction from users, Hoshikaka engages the player through a nonlinear plot that they are given opportunities to change the course of during play. Feng announced work on Hoshizora e Kakaru Hashi in May 2009 and marketed it through public venues and the broadcast of a radio drama throughout development. The game was postponed a total of nine times and released almost a year after its initial date but was met with relatively positive reception. On November 11, 2011 Feng announced work on a fan disc for the game, set to be released on February 24, 2012. Following the game's release, Hoshizora e Kakaru Hashi made transitions into other media. Two light novels were published, as was an art book, audio dramas and several albums of music. A twelve-episode animated television series and direct-to-video single release was also produced by Dogakobo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of A Bridge to the Starry Skies premiered on April 11, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Bridge to the Starry Skies. You can help by rating TV shows you've seen. Facts Original Name  星空へ架かる橋 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.marv.jp/special/hoshikaka/ Genres Sci-Fi & Fantasy Animation Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 18 Sadwick 5 July v 4 velluto93 4 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}