{"link": "https://www.themoviedb.org/tv/7374?language=en", "title": "Hulk Hogan's Celebrity Championship Wrestling", "resume": "Hulk Hogan's Celebrity Championship Wrestling was an American reality television program, which ran for eight episodes on CMT in 2008. The first episode aired on October 18, 2008. In Australia, the show premiered in July 2009 on the FOX8 channel. It was also shown in the UK on Bravo and Viva. The show was co-produced by Hulk Hogan and Bischoff-Hervey Entertainment. The show featured celebrities being trained to become professional wrestlers. The finale aired on December 6, 2008, where Dennis Rodman was declared the winner of the competition.", "rate": 0, "genre": [], "cast": ["Hulk Hogan", "Danny Bonaduce", "Trishelle Cannatella", "Bubba the Love Sponge", "Tiffany"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7374   Expand Hulk Hogan's Celebrity Championship Wrestling   (2008) User Score Overview Hulk Hogan's Celebrity Championship Wrestling was an American reality television program, which ran for eight episodes on CMT in 2008. The first episode aired on October 18, 2008. In Australia, the show premiered in July 2009 on the FOX8 channel. It was also shown in the UK on Bravo and Viva. The show was co-produced by Hulk Hogan and Bischoff-Hervey Entertainment. The show featured celebrities being trained to become professional wrestlers. The finale aired on December 6, 2008, where Dennis Rodman was declared the winner of the competition. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hulk Hogan Danny Bonaduce Trishelle Cannatella Bubba the Love Sponge Tiffany Full Cast & Crew Last Season Season 1 2008 | 8 Episodes Season 1 of Hulk Hogan's Celebrity Championship Wrestling premiered on October 18, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hulk Hogan's Celebrity Championship Wrestling. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cmt.com/shows/series/hulk-hogan-celebrity-wrestling/series.jhtml Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}