{"link": "https://www.themoviedb.org/tv/42577?language=en", "title": "Backlight", "resume": "Tegenlicht in Dutch or Backlight in English is a series of television documentaries by the VPRO, a Dutch public broadcasting organisation. Backlight \"aims to grasp the quintessence of prominent trends and developments\" in the practice of critical journalism, and tries to improve understanding of the intricate inner workings of our modern society.", "rate": 57, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42577   Expand Backlight   (2002) User Score  Play Trailer Overview Tegenlicht in Dutch or Backlight in English is a series of television documentaries by the VPRO, a Dutch public broadcasting organisation. Backlight \"aims to grasp the quintessence of prominent trends and developments\" in the practice of critical journalism, and tries to improve understanding of the intricate inner workings of our modern society. Featured Crew Marije Meerman Creator Doke Romeijn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 16 2017 | 1 Episode Season 17 of Backlight premiered on November 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Backlight. You can help by rating TV shows you've seen. Facts Original Name  Tegenlicht Status  Returning Series Networks - Certification  - Type  Documentary Original Language  Dutch; Flemish Runtime  50m Homepage   https://www.vpro.nl/programmas/tegenlicht.html Genres Documentary Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 10 amian123 C 4 Co 3 Elizabeth Jennings LJ 3 Lim J. Hanes  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}