{"link": "https://www.themoviedb.org/tv/30995?language=en", "title": "Blood Feud", "resume": "Blood Feud is a 1983 television miniseries surrounding around the conflict between Jimmy Hoffa and Robert F. Kennedy in a 11-year span from 1957 until Kennedy's assassination in 1968. The 210-minute film was directed by Mike Newell and written by Robert Boris. It stars Robert Blake as Hoffa and Cotter Smith as Kennedy with Danny Aiello and Brian Dennehy in supporting roles as union associates of Hoffa's.\nThe television film was distributed by Operation Prime Time, a syndicated block of television programming offered to mostly American independent stations.\nBlake was nominated for an Emmy and Golden Globe for Best Actor for his performance as Hoffa.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Robert Blake", "Cotter Smith", "Danny Aiello", "Edward Albert", "Brian Dennehy"], "character": ["James Riddle 'Jimmy' Hoffa", "Robert F. Kennedy", "Randy Powers", "Phil Wharton (Kennedy Committee investigator)", "Edward Grady Partin (Hoffa aide and head of Teamsters Local 5, Baton Rouge)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30995   Expand Blood Feud   (1983) User Score Overview Blood Feud is a 1983 television miniseries surrounding around the conflict between Jimmy Hoffa and Robert F. Kennedy in a 11-year span from 1957 until Kennedy's assassination in 1968. The 210-minute film was directed by Mike Newell and written by Robert Boris. It stars Robert Blake as Hoffa and Cotter Smith as Kennedy with Danny Aiello and Brian Dennehy in supporting roles as union associates of Hoffa's. The television film was distributed by Operation Prime Time, a syndicated block of television programming offered to mostly American independent stations. Blake was nominated for an Emmy and Golden Globe for Best Actor for his performance as Hoffa. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Blake James Riddle 'Jimmy' Hoffa Cotter Smith Robert F. Kennedy Danny Aiello Randy Powers Edward Albert Phil Wharton (Kennedy Committee investigator) Brian Dennehy Edward Grady Partin (Hoffa aide and head of Teamsters Local 5, Baton Rouge) Full Cast & Crew Last Season Mini Series 1983 | 2 Episodes Season 1 of Blood Feud premiered on April 25, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blood Feud. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Crime Drama Keywords fbi miniseries jimmy hoffa Content Score 71 Just a little bit more... Top Contributors 16 Steve R 5 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}