{"link": "https://www.themoviedb.org/tv/13929?language=en", "title": "The Trap: What Happened to Our Dream of Freedom", "resume": "Individual freedom is the dream of our age. It's what our leaders promise to give us, it defines how we think of ourselves and, repeatedly, we have gone to war to impose freedom around the world. But if you step back and look at what freedom actually means for us today, it's a strange and limited kind of freedom.", "rate": 84, "genre": ["Documentary"], "cast": ["Adam Curtis", "Yevgeny Kiselyov"], "character": ["Narrator (uncredited)", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13929   Expand The Trap: What Happened to Our Dream of Freedom   (2007) User Score Overview Individual freedom is the dream of our age. It's what our leaders promise to give us, it defines how we think of ourselves and, repeatedly, we have gone to war to impose freedom around the world. But if you step back and look at what freedom actually means for us today, it's a strange and limited kind of freedom. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Curtis Narrator (uncredited) Yevgeny Kiselyov Himself Full Cast & Crew Last Season Miniseries 2007 | 3 Episodes Season 1 of The Trap: What Happened to Our Dream of Freedom premiered on March 11, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2004-10-20 The Power of Nightmares 8.2    1995-03-15 The Living Dead 7.5    2011-05-23 All Watched Over by Machines of Loving Grace 8.3    2002-03-17 The Century of the Self 8.2    1992-06-11 Pandora's Box 9.0    2006-08-21 When the Levees Broke: A Requiem in Four Acts 7.0    2002-10-01 Ghost in the Shell: Stand Alone Complex 8.0    2004-09-03 Green Wing 8.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00796hp Genres Documentary Keywords miniseries Content Score 56 We're so close, yet so far. Top Contributors R 13 Rebecca TB 6 TMDb Bot m 1 mikeleighisanokdirector  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}