{"link": "https://www.themoviedb.org/tv/69535?language=en", "title": "Bu Şehir Arkandan Gelecek", "resume": "Derin and Ali are two people from different worlds. Derin is the daughter of a rich man, on the otherside Ali is a 24 years old boy who saw his mom being killed by his dad when he was young. So rauf anne took him as his son and now after many years he is back to istanbul , where he will meet derin and they start to enjoy time with each other.", "rate": 0, "genre": ["Drama"], "cast": ["Kerem Bursin", "Leyla Lidya Tuğutlu", "Gurkan Uygun", "Nilperi Şahinkaya", "Ali Yörenç"], "character": ["Ali", "Derin", "Sahin", "Asli", "Yiğit"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69535   Expand Bu Şehir Arkandan Gelecek   (2017) User Score Overview Derin and Ali are two people from different worlds. Derin is the daughter of a rich man, on the otherside Ali is a 24 years old boy who saw his mom being killed by his dad when he was young. So rauf anne took him as his son and now after many years he is back to istanbul , where he will meet derin and they start to enjoy time with each other. Featured Crew Çağrı Lostuvalı Creator Ender Mıhlar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kerem Bursin Ali Leyla Lidya Tuğutlu Derin Gurkan Uygun Sahin Nilperi Şahinkaya Asli Ali Yörenç Yiğit Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Bu Şehir Arkandan Gelecek premiered on January 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Bu Şehir Arkandan Gelecek. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  130m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 26 moviefars z 10 zerox 3 purplelammashta M 3 Merol93  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}