{"link": "https://www.themoviedb.org/tv/63618?language=en", "title": "The Virtual Bride", "resume": "In an attempt to regain her popularity, former idol star In Young goes on a TV Show where she clashes with her on-screen mother-in-law, Yang Choon Ja. However, the tension is increasingly worse off-set when In Young starts dating Choon Ja's real son!", "rate": 85, "genre": ["Family", "Comedy"], "cast": ["Kim Dasom", "Go Doo-shim", "Ryu Soo-young", "Son Eun-seo", "Jeong Da-Sol"], "character": ["Oh In-young", "Yang Choon-ja", "Cha Myeong-seok", "Cha Young-ah", "Heo Soon-jung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63618   Expand The Virtual Bride   (2015) User Score  Play Trailer Overview In an attempt to regain her popularity, former idol star In Young goes on a TV Show where she clashes with her on-screen mother-in-law, Yang Choon Ja. However, the tension is increasingly worse off-set when In Young starts dating Choon Ja's real son! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Dasom Oh In-young Go Doo-shim Yang Choon-ja Ryu Soo-young Cha Myeong-seok Son Eun-seo Cha Young-ah Jeong Da-Sol Heo Soon-jung Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of The Virtual Bride premiered on August 17, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Virtual Bride. You can help by rating TV shows you've seen. Facts Original Name  별난 며느리 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/byulnan/ Genres Family Comedy Keywords mother-in-law korea Content Score 93 Almost there... Top Contributors M 38 Maria180493 18 Elizabeth Jennings c 3 creativo d 3 daphie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}