{"link": "https://www.themoviedb.org/tv/60550?language=en", "title": "Mahabharat", "resume": "Mahabharat is a 2013 drama TV series on Star Plus based on Indian legendary epic of the same name. It has been produced by Swastik Pictures and features actors such as Saurabh Raj Jain as Lord Krishna, Shaheer Sheikh as Arjuna, Pooja Sharma as Draupadi, Aham Sharma as Karna and Arav Chowdhary as Bhishma Pitamah. The producers had creative associations with writer Salim Khan, author Devdutt Pattanaik, designer Bhanu Athaiya, music directors Ajay-Atul and Ismail Darbar, action director Ram Shetty and set designer Omang Kumar. The casting of the show is done by Sahil Ansari, Mahesh Chandra Bhatt, Arun Mitra. It started broadcasting on 16 September 2013.", "rate": 77, "genre": [], "cast": ["Saurabh Raj Jain", "Shaheer Sheikh", "Pooja Sharma", "Aham Sharma", "Arav Chowdhary"], "character": ["Shri Krishna", "Arjuna", "Draupadi", "Karna", "Bhishma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60550   Expand Mahabharat   (2013) User Score Overview Mahabharat is a 2013 drama TV series on Star Plus based on Indian legendary epic of the same name. It has been produced by Swastik Pictures and features actors such as Saurabh Raj Jain as Lord Krishna, Shaheer Sheikh as Arjuna, Pooja Sharma as Draupadi, Aham Sharma as Karna and Arav Chowdhary as Bhishma Pitamah. The producers had creative associations with writer Salim Khan, author Devdutt Pattanaik, designer Bhanu Athaiya, music directors Ajay-Atul and Ismail Darbar, action director Ram Shetty and set designer Omang Kumar. The casting of the show is done by Sahil Ansari, Mahesh Chandra Bhatt, Arun Mitra. It started broadcasting on 16 September 2013. Featured Crew Siddharth Kumar Tewary Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saurabh Raj Jain Shri Krishna Shaheer Sheikh Arjuna Pooja Sharma Draupadi Aham Sharma Karna Arav Chowdhary Bhishma Full Cast & Crew Last Season Season 1 2013 | 104 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Mahabharat. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Star Plus Certification  - Type  Scripted Original Language  Hindi Runtime  - Homepage   http://www.dudmovies.com/tvshows/mahabharat-3 Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 21 Dipeshy AM 8 Ade M Saragih s 5 suniloffline M 1 MenusRaj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}