{"link": "https://www.themoviedb.org/tv/64412?language=en", "title": "K-POP Extreme Survival", "resume": "Ji Seung Yeon fails her audition piece for an English music college by severely modernizing it, secretly returning home to South Korea in shame. Hiding out at her painfully shy friend's house, she joins him in auditioning to replace popular members of a boy band who are getting too old. Together, she and her friend make it through to a finalized group of eight competing for the few opening spots. No one but her friend and her uncle (director of the pop music company) and his assistant know she's a girl. The leader of the boy band, not in the know, starts questioning his orientation when finding himself progressively attracted to this \"boy.\"", "rate": 70, "genre": [], "cast": ["Go Eun-ah"], "character": ["Ji Seung Yeon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64412   Expand K-POP Extreme Survival   (2012) User Score Overview Ji Seung Yeon fails her audition piece for an English music college by severely modernizing it, secretly returning home to South Korea in shame. Hiding out at her painfully shy friend's house, she joins him in auditioning to replace popular members of a boy band who are getting too old. Together, she and her friend make it through to a finalized group of eight competing for the few opening spots. No one but her friend and her uncle (director of the pop music company) and his assistant know she's a girl. The leader of the boy band, not in the know, starts questioning his orientation when finding himself progressively attracted to this \"boy.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Go Eun-ah Ji Seung Yeon Full Cast & Crew Last Season Season 1 2012 | 14 Episodes Season 1 of K-POP Extreme Survival premiered on May 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on K-POP Extreme Survival. You can help by rating TV shows you've seen. Facts Original Name  K-팝 최강 서바이벌 Status  Ended Networks - Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://tv.ichannela.com/drama/kpopsurvival Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 18 m17 3 lareina123 z 3 zurman1 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}