{"link": "https://www.themoviedb.org/tv/33481?language=en", "title": "American Chopper: Senior vs. Junior", "resume": "American Chopper: Senior vs. Junior is a reality television spin-off, based on the original series American Chopper, which premiered on the TLC channel on August 12, 2010. The show chronicles the rivalry between Orange County Choppers owned by Paul Teutul, Sr. and his son Paul Teutul, Jr.'s newly opened motorcycle business Paul Jr. Designs. The second season continued with brand new episodes that aired on Monday, August 29, 2011 at 9pm EST on Discovery Channel. The third season began on February 13, 2012. The fourth season premiered, September 3, 2012. November 16, 2012, the Discovery Channel announced the cancellation of the show. The final episode aired December 17th, 2012. Paul Teutul posted a picture of himself with his father and brother Mike all posing in front of the Teutel bike that junior and senior built during season 4, indicating that the final episode will involve a reunion of sorts.\nNote: Season 4 dropped the Sr. vs. Jr. subtitle and returned to the original American Chopper title.", "rate": 64, "genre": [], "cast": ["Paul Teutul, Jr.", "Mike Rowe", "Michael Teutul", "Vincent DiMartino", "Jason Pohl"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33481   Expand American Chopper: Senior vs. Junior   (2010) User Score Overview American Chopper: Senior vs. Junior is a reality television spin-off, based on the original series American Chopper, which premiered on the TLC channel on August 12, 2010. The show chronicles the rivalry between Orange County Choppers owned by Paul Teutul, Sr. and his son Paul Teutul, Jr.'s newly opened motorcycle business Paul Jr. Designs. The second season continued with brand new episodes that aired on Monday, August 29, 2011 at 9pm EST on Discovery Channel. The third season began on February 13, 2012. The fourth season premiered, September 3, 2012. November 16, 2012, the Discovery Channel announced the cancellation of the show. The final episode aired December 17th, 2012. Paul Teutul posted a picture of himself with his father and brother Mike all posing in front of the Teutel bike that junior and senior built during season 4, indicating that the final episode will involve a reunion of sorts. Note: Season 4 dropped the Sr. vs. Jr. subtitle and returned to the original American Chopper title. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Teutul, Jr. Mike Rowe Michael Teutul Vincent DiMartino Jason Pohl Full Cast & Crew Last Season Season 4 2012 | 16 Episodes Season 4 of American Chopper: Senior vs. Junior premiered on September  3, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on American Chopper: Senior vs. Junior. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.tlc.discovery.com/tv/american-chopper/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors w 3 webmaster 1 Michael 1 gianpoker TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}