{"link": "https://www.themoviedb.org/tv/12766?language=en", "title": "Sable", "resume": "Sable is a short-lived television program that aired on ABC during the 1987-1988 season, and is based on the comic book, Jon Sable: Freelance, by Mike Grell. Only seven episodes ever aired.\nThe show was a one-hour adventure/drama about mercenary and vigilante Jon Sable, who by day was children's book author Nicholas Fleming. The program ran on Saturdays at 8:00, and aired its final episode on January 2, 1988. Rene Russo had her first television role on the series. Lara Flynn Boyle also had one of her first acting roles playing a kidnapped girl in the series pilot.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Rene Russo", "Marge Kotlisky", "Ken Page", "Lara Flynn Boyle", "Holly Fulger"], "character": ["Eden Kendell", "Melanie Waterston"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12766   Expand Sable   (1987) User Score Overview Sable is a short-lived television program that aired on ABC during the 1987-1988 season, and is based on the comic book, Jon Sable: Freelance, by Mike Grell. Only seven episodes ever aired. The show was a one-hour adventure/drama about mercenary and vigilante Jon Sable, who by day was children's book author Nicholas Fleming. The program ran on Saturdays at 8:00, and aired its final episode on January 2, 1988. Rene Russo had her first television role on the series. Lara Flynn Boyle also had one of her first acting roles playing a kidnapped girl in the series pilot. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rene Russo Eden Kendell Marge Kotlisky Ken Page Lara Flynn Boyle Melanie Waterston Holly Fulger Full Cast & Crew Last Season Season 1 1987 | 7 Episodes Season 1 of Sable premiered on November  7, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sable. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 22m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}