{"link": "https://www.themoviedb.org/tv/799?language=en", "title": "Sherlock Holmes", "resume": "The Adventures of Sherlock Holmes (1984–1985), The Return of Sherlock Holmes (1986–1988), The Case-Book of Sherlock Holmes (1991–1993) and The Memoirs of Sherlock Holmes (1994), collectively known as Sherlock Holmes, are a series of adaptations of Arthur Conan Doyle's Sherlock Holmes stories which were produced by Granada Television and originally broadcast by ITV in the United Kingdom. The series starred Jeremy Brett as Holmes and David Burke (in the Adventures series) and Edward Hardwicke (Return, Case-Book, Memoirs) as Dr. Watson. The programme adapted 42 of the original stories in 41 episodes, with 36 running for 50 minutes (in a one-hour timeslot), and five being feature-length specials.\nAdventures ran for two series totalling 13 episodes, from April to June 1984 and August to September 1985. Return ran for two series from July to August 1986 and April to August 1988, as well as the specials \"The Sign of Four\" and \"The Hound of the Baskervilles\", which aired on 29 December 1987 and 31 August 1988 respectively. Case-Book ran for one series from February to March 1991 and three specials which aired on 2 January 1992 and 27 January and 3 February 1993. Memoirs ran for one series from March to April 1994. A short episode was also produced as part of \"The Four Oaks Mystery\" which aired during the ITV Telethon in 1992. Sherlock Holmes appeared in the first part, with the casts of Van der Valk, Taggart and Inspector Wexford appearing in the second, third and fourth parts respectively.", "rate": 84, "genre": ["Mystery", "Drama", "Crime"], "cast": ["Jeremy Brett", "David Burke", "Edward Hardwicke", "Rosalie Williams", "Colin Jeavons"], "character": ["Sherlock Holmes", "Dr. Watson", "Dr. Watson", "Mrs. Hudson", "Inspector Lestrade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 799   Expand Sherlock Holmes   (1984) User Score Overview The Adventures of Sherlock Holmes (1984–1985), The Return of Sherlock Holmes (1986–1988), The Case-Book of Sherlock Holmes (1991–1993) and The Memoirs of Sherlock Holmes (1994), collectively known as Sherlock Holmes, are a series of adaptations of Arthur Conan Doyle's Sherlock Holmes stories which were produced by Granada Television and originally broadcast by ITV in the United Kingdom. The series starred Jeremy Brett as Holmes and David Burke (in the Adventures series) and Edward Hardwicke (Return, Case-Book, Memoirs) as Dr. Watson. The programme adapted 42 of the original stories in 41 episodes, with 36 running for 50 minutes (in a one-hour timeslot), and five being feature-length specials. Adventures ran for two series totalling 13 episodes, from April to June 1984 and August to September 1985. Return ran for two series from July to August 1986 and April to August 1988, as well as the specials \"The Sign of Four\" and \"The Hound of the Baskervilles\", which aired on 29 December 1987 and 31 August 1988 respectively. Case-Book ran for one series from February to March 1991 and three specials which aired on 2 January 1992 and 27 January and 3 February 1993. Memoirs ran for one series from March to April 1994. A short episode was also produced as part of \"The Four Oaks Mystery\" which aired during the ITV Telethon in 1992. Sherlock Holmes appeared in the first part, with the casts of Van der Valk, Taggart and Inspector Wexford appearing in the second, third and fourth parts respectively. Featured Crew Michael Cox Creator Arthur Conan Doyle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  3 Images Backdrops  8 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Brett Sherlock Holmes David Burke Dr. Watson Edward Hardwicke Dr. Watson Rosalie Williams Mrs. Hudson Colin Jeavons Inspector Lestrade Full Cast & Crew Last Season The Memoirs of Sherlock Holmes 1994 | 6 Episodes View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply M Best Holmes portrayal Open 0 by Moonglum9\n      \n     Last season just as excellent as the first.. Open 0 by AusFem\n      \n     Mycroft Open 0 by AusFem\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  7 Recommendations   1989-01-08 Agatha Christie's Poirot 7.9    1994-03-07 The Memoirs of Sherlock Holmes 8.6    1985-03-03 Moonlighting 7.2    1984-09-30 Murder, She Wrote 6.5    1974-03-27 The Rockford Files 7.2    1955-10-02 Alfred Hitchcock Presents 7.8    1976-10-03 Quincy, M.E. 7.0    1969-10-05 Monty Python's Flying Circus 8.2  Facts Status  Ended Network Certification T Meaning Todos (suitable for all). Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Mystery Drama Crime Keywords based on novel or book detective victorian england sherlock holmes private investigator period drama private detective Content Score 93 Almost there... Top Contributors t 86 tmdb15589237 33 spaceship broken m 22 miroslav.kakas@gmail.com GS 15 Giuseppe Stia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}