{"link": "https://www.themoviedb.org/tv/17326?language=en", "title": "Uutisvuoto", "resume": "Uutisvuoto is the Finnish version of the popular British television quiz show Have I Got News For You. Broadcast on Saturday nights on YLE TV1 since 1998, the show receives very high viewing figures.\nUutisvuoto mainly follows the same format as Have I Got News For You. The guests are usually celebrities, and frequently politicians. In the last two presidential elections, both of the second-round candidates appeared as guests: to-be-president Tarja Halonen and Esko Aho in 2000, and president Halonen and Sauli Niinistö in 2006. To date, winning the show has correlated with winning the election contest itself. In 2006 the \"presidential show\" broke all viewing records when it was watched by 1.4 million viewers.\nThe show is so popular in Finland that it was even parodied in the Aku Ankka comic book as Uutiskuono.\n\"Haluatteko lukea hyvän vitsin jonka kuulin äsken Yleisradion kahvilassa?\" is Peter Nyman's Uutisvuoto joke book. The book's name is a reference to Nyman's way of telling jokes. He opens with the book's name, then, ignoring all answers, continues: \"Ei se mitään, kerron sen silti.\"", "rate": 60, "genre": ["Comedy"], "cast": ["Baba Lybeck", "Jari Tervo", "Stan Saanila"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17326   Expand Uutisvuoto   (1998) User Score Overview Uutisvuoto is the Finnish version of the popular British television quiz show Have I Got News For You. Broadcast on Saturday nights on YLE TV1 since 1998, the show receives very high viewing figures. Uutisvuoto mainly follows the same format as Have I Got News For You. The guests are usually celebrities, and frequently politicians. In the last two presidential elections, both of the second-round candidates appeared as guests: to-be-president Tarja Halonen and Esko Aho in 2000, and president Halonen and Sauli Niinistö in 2006. To date, winning the show has correlated with winning the election contest itself. In 2006 the \"presidential show\" broke all viewing records when it was watched by 1.4 million viewers. The show is so popular in Finland that it was even parodied in the Aku Ankka comic book as Uutiskuono. \"Haluatteko lukea hyvän vitsin jonka kuulin äsken Yleisradion kahvilassa?\" is Peter Nyman's Uutisvuoto joke book. The book's name is a reference to Nyman's way of telling jokes. He opens with the book's name, then, ignoring all answers, continues: \"Ei se mitään, kerron sen silti.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Baba Lybeck Jari Tervo Stan Saanila Full Cast & Crew Last Season Season 22 2017 | 15 Episodes Season 22 of Uutisvuoto premiered on February 25, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Uutisvuoto. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Finnish Runtime  30m Homepage   http://areena.yle.fi/1-3005739 Genres Comedy Keywords game show parody quiz Content Score 56 We're so close, yet so far. Top Contributors 15 Petja Touru 10 BryGur 8 ernie77 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}