{"link": "https://www.themoviedb.org/tv/16304?language=en", "title": "Open Doors", "resume": "Otvorena vrata, is a Serbian comedy television series filmed in 1994-1995. Broadcast on state television RTS, it ran for 2 seasons featuring a regular family living in Belgrade during the 1990s.\nThe show was created by Biljana Srbljanović and Miloš Radović, starring Vesna Trivalić, Milan Gutović, Bogdan Diklić, Nikola Đuričko, Sofija Jović, Bojana Maljević, Olivera Marković and Zoran Cvijanović, with guest stars such as: Mirjana Karanović, Nikola Simić, Seka Sablić, Branka Katić, Mira Stupica.\nThe show had many reruns over the following years, and acquired a cult following.\nIn spring of 2012, after the Serbian presidential election results were announced, Bojana Maljević announced on her Twitter account that she and Biljana Srbljanović were thinking about doing another season of the show. In the following days the idea of the third season was officially confirmed and members of the original cast started announcing that they would take part in the project.", "rate": 10, "genre": ["Comedy"], "cast": ["Sofija Jović", "Bojana Maljević"], "character": ["Milica Jakovljević", "Ana Anđelić"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16304   Expand Open Doors   (1994) User Score Overview Otvorena vrata, is a Serbian comedy television series filmed in 1994-1995. Broadcast on state television RTS, it ran for 2 seasons featuring a regular family living in Belgrade during the 1990s. The show was created by Biljana Srbljanović and Miloš Radović, starring Vesna Trivalić, Milan Gutović, Bogdan Diklić, Nikola Đuričko, Sofija Jović, Bojana Maljević, Olivera Marković and Zoran Cvijanović, with guest stars such as: Mirjana Karanović, Nikola Simić, Seka Sablić, Branka Katić, Mira Stupica. The show had many reruns over the following years, and acquired a cult following. In spring of 2012, after the Serbian presidential election results were announced, Bojana Maljević announced on her Twitter account that she and Biljana Srbljanović were thinking about doing another season of the show. In the following days the idea of the third season was officially confirmed and members of the original cast started announcing that they would take part in the project. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sofija Jović Milica Jakovljević Bojana Maljević Ana Anđelić Full Cast & Crew Last Season Season 3 2013 | 16 Episodes Season 3 of Open Doors premiered on April 22, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Open Doors. You can help by rating TV shows you've seen. Facts Original Name  Otvorena vrata Status  Returning Series Network Certification  - Type  Scripted Original Language  Serbian Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors M 7 Mario_Gaborović  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}