{"link": "https://www.themoviedb.org/tv/33025?language=en", "title": "The Borgias", "resume": "Set in 15th century Italy at the height of the Renaissance, The Borgias chronicles the corrupt rise of patriarch Rodrigo Borgia to the papacy, where he proceeds to commit every sin in the book to amass and retain power, influence and enormous wealth for himself and his family.", "rate": 75, "genre": ["Action", "Adventure", "Drama"], "cast": ["Jeremy Irons", "Holliday Grainger", "François Arnaud", "Joanne Whalley", "Colm Feore"], "character": ["Rodrigo Borgia", "Lucrezia Borgia", "Cesare Borgia", "Vanozza Cattaneo", "Giuliano Della Rovere"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33025   Expand The Borgias   (2011) User Score  Play Trailer Overview Set in 15th century Italy at the height of the Renaissance, The Borgias chronicles the corrupt rise of patriarch Rodrigo Borgia to the papacy, where he proceeds to commit every sin in the book to amass and retain power, influence and enormous wealth for himself and his family. Featured Crew Neil Jordan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Irons Rodrigo Borgia Holliday Grainger Lucrezia Borgia François Arnaud Cesare Borgia Joanne Whalley Vanozza Cattaneo Colm Feore Giuliano Della Rovere Full Cast & Crew Last Season Season 3 2013 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  10 Recommendations   2007-04-01 The Tudors 7.5    2010-09-19 Boardwalk Empire 7.7    2005-08-28 Rome 8.2    2011-02-25 Camelot 5.6    2011-10-10 Borgia 7.0    2010-01-22 Spartacus 7.8    2013-04-19 Hemlock Grove 6.4    2007-02-26 The Black Donnellys 7.4  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   http://www.sho.com/borgias Genres Action & Adventure Drama Keywords sex religion historical drama 16th century italian renaissance 15th century Content Score 100 Yes! Looking good! Top Contributors 33 Elizabeth Jennings h 24 hornet n 10 nopealope M 9 MarcyX  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}