{"link": "https://www.themoviedb.org/tv/74141?language=en", "title": "After Trek", "resume": "The ultimate weekly forum for Star Trek fans with in-depth discussions and recaps of the latest Star Trek: Discovery episode.", "rate": 100, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74141   Expand After Trek   (2017) User Score  Play Trailer Overview The ultimate weekly forum for Star Trek fans with in-depth discussions and recaps of the latest Star Trek: Discovery episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 7 Episodes Season 1 of After Trek premiered on September 24, 2017. View All Seasons Social Reviews  1 Discussions  0 J A review by Jonah63 Written by  Jonah63  on October  1, 2017 What a greta start for a new Star Trek! Incredible production quality combined with unfurling plot lines with many twists at the start.\nAll this made me intrigued enough to watch the first episode of After Trek.\nHow disappointing! The presenter is the anchor of the show, and in many other examples this approach can work. For After Trek, it's like a fanboy stepped in at the last moment 'cause they couldn't get anyone? else. I am not familiar with the presenter but the show lacks intrigue and cohesion throughout. The guests are at times bewildered with inane questions, whilst the presenter c...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on After Trek. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Talk Show Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/after-trek/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 10 Damien Haynes 7 Elizabeth Jennings 3 RubeensVinicius D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}