{"link": "https://www.themoviedb.org/tv/61157?language=en", "title": "Three Days", "resume": "Three shots are fired and the president of South Korea suddenly goes missing from his vacation villa. Three Days is a condensed-time thriller that follows the struggles of elite Blue House bodyguard Han Tae Kyung to find and protect the president. With the aid of local police officer Yoon Bo Won and fellow Blue House guards, will Han Tae Kyung be able to save the president before it’s too late?", "rate": 70, "genre": ["Action", "Adventure"], "cast": ["Park Yoo-chun", "Son Hyun-joo", "Park Ha-sun", "So Yi-hyun", "Yoon Je-moon"], "character": ["Han Tae-kyung", "Lee Dong-hwi", "Yoon Bo-won", "Lee Cha-young", "Shin Kyu-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61157   Expand Three Days   (2014) User Score Overview Three shots are fired and the president of South Korea suddenly goes missing from his vacation villa. Three Days is a condensed-time thriller that follows the struggles of elite Blue House bodyguard Han Tae Kyung to find and protect the president. With the aid of local police officer Yoon Bo Won and fellow Blue House guards, will Han Tae Kyung be able to save the president before it’s too late? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Yoo-chun Han Tae-kyung Son Hyun-joo Lee Dong-hwi Park Ha-sun Yoon Bo-won So Yi-hyun Lee Cha-young Yoon Je-moon Shin Kyu-jin Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Three Days premiered on March  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2010-11-13 Secret Garden 8.2  Facts Original Name  쓰리 데이즈 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://tv.sbs.co.kr/3days/ Genres Action & Adventure Keywords korea Content Score 86 Almost there... Top Contributors M 50 Maria180493 19 Elizabeth Jennings z 10 zurman1 4 seksonh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}