{"link": "https://www.themoviedb.org/tv/67163?language=en", "title": "The Recruit", "resume": "Playing somewhere in Australia right now is a weekend warrior that AFL recruiters have either never seen, or missed. A man dreaming of an AFL career. He is ‘The Recruit’; and he will win arguably the biggest prize ever given away on a TV show – a guaranteed place at an AFL club. Hosted by former AFL player turned popular radio host Ryan “Fitzy” Fitzgerald, THE RECRUIT is a reality football entertainment series that will follow 12 ‘Recruits’ who will live and play together as a team, while at the same time competing against each other, in order to win this life-changing prize. Joining Fitzy as head coach on the series is AFL Hall of Fame legend Michael “Vossy” Voss. A three-time AFL Premiership Captain with the Brisbane Lions and winner of the 1996 Brownlow Medal, Vossy is one of the most respected players in AFL history. It is up to him to lead, motivate, teach a", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67163   Expand The Recruit   (2014) User Score Overview Playing somewhere in Australia right now is a weekend warrior that AFL recruiters have either never seen, or missed. A man dreaming of an AFL career. He is ‘The Recruit’; and he will win arguably the biggest prize ever given away on a TV show – a guaranteed place at an AFL club. Hosted by former AFL player turned popular radio host Ryan “Fitzy” Fitzgerald, THE RECRUIT is a reality football entertainment series that will follow 12 ‘Recruits’ who will live and play together as a team, while at the same time competing against each other, in order to win this life-changing prize. Joining Fitzy as head coach on the series is AFL Hall of Fame legend Michael “Vossy” Voss. A three-time AFL Premiership Captain with the Brisbane Lions and winner of the 1996 Brownlow Medal, Vossy is one of the most respected players in AFL history. It is up to him to lead, motivate, teach a Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2016 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Recruit. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 16 jimmy7 6 valak s 1 suka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}