{"link": "https://www.themoviedb.org/tv/76909?language=en", "title": "The Radical Story of Patty Hearst", "resume": "Follow the transformation of Patty Hearst from heiress to terrorist in a saga of privilege, celebrity, politics, media, revolution, and violence. Over forty years later, newly discovered evidence, archival footage, cinematic recreations and exclusive firsthand accounts shed light on one of the biggest and most bizarre stories in modern American history.", "rate": 0, "genre": ["Documentary"], "cast": ["Patricia Hearst"], "character": ["Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76909   Expand The Radical Story of Patty Hearst   (2018) User Score Overview Follow the transformation of Patty Hearst from heiress to terrorist in a saga of privilege, celebrity, politics, media, revolution, and violence. Over forty years later, newly discovered evidence, archival footage, cinematic recreations and exclusive firsthand accounts shed light on one of the biggest and most bizarre stories in modern American history. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patricia Hearst Herself Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of The Radical Story of Patty Hearst premiered on February 11, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply \"Death to the Facist Insect... Open 0 by Stand*Chickie\n      \n     Where were they getting their money other than robbing banks? Open 0 by Stand*Chickie\n      \n     Bill Harris \"We kidnapped a freak\" Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Radical Story of Patty Hearst. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Miniseries Original Language  English Runtime  42m Homepage   https://www.cnn.com/shows/radical-story-patty-hearst Genres Documentary Keywords stockholm syndrome kidnapping heiress Content Score 56 We're so close, yet so far. Top Contributors 44 Elizabeth Jennings B 1 BigDaddyWarbuxx 1 D2Allaire  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}