{"link": "https://www.themoviedb.org/tv/173?language=en", "title": "Degrassi Junior High", "resume": "Degrassi Junior High is a Canadian CBC Television teen drama series that was produced from 1987-1989 as part of the Degrassi series. The show followed the lives of a group of students attending the titular fictional school. Many episodes tackled difficult topics such as drug use, child abuse, teenage pregnancy, homosexuality, homophobia, racism, and divorce, and the series was acclaimed for its sensitive and realistic portrayal of the challenges of teenage life. The cast comprised mainly non-professional actors, which added to the show's sense of realism.\nThe series featured many of the same actors who had starred on The Kids of Degrassi Street a few years earlier, including Stacie Mistysyn, Neil Hope, Anais Granofsky, Sarah Charlesworth and others. However, their character names and family situations had been changed, so Degrassi Junior High cannot, therefore, be considered a direct spinoff.\nThe legal counsel for all the episodes was Stephen Stohn who later became the executive producer of Degrassi: The Next Generation. The series was filmed at the unused Vincent Massey Public School in Etobicoke, Ontario.", "rate": 75, "genre": ["Drama"], "cast": ["Billy Parrott", "Roger Montgomery", "Cathy Keenan", "Neil Hope", "Stefan Brogren"], "character": ["Shane McKay", "Mr. Garcia", "Liz O' Rourke", "Derek 'Wheels' Wheeler", "Archibald 'Snake' Simpson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 173   Expand Degrassi Junior High   (1987) User Score Overview Degrassi Junior High is a Canadian CBC Television teen drama series that was produced from 1987-1989 as part of the Degrassi series. The show followed the lives of a group of students attending the titular fictional school. Many episodes tackled difficult topics such as drug use, child abuse, teenage pregnancy, homosexuality, homophobia, racism, and divorce, and the series was acclaimed for its sensitive and realistic portrayal of the challenges of teenage life. The cast comprised mainly non-professional actors, which added to the show's sense of realism. The series featured many of the same actors who had starred on The Kids of Degrassi Street a few years earlier, including Stacie Mistysyn, Neil Hope, Anais Granofsky, Sarah Charlesworth and others. However, their character names and family situations had been changed, so Degrassi Junior High cannot, therefore, be considered a direct spinoff. The legal counsel for all the episodes was Stephen Stohn who later became the executive producer of Degrassi: The Next Generation. The series was filmed at the unused Vincent Massey Public School in Etobicoke, Ontario. Featured Crew Kit Hood Creator Linda Schuyler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy Parrott Shane McKay Roger Montgomery Mr. Garcia Cathy Keenan Liz O' Rourke Neil Hope Derek 'Wheels' Wheeler Stefan Brogren Archibald 'Snake' Simpson Full Cast & Crew Last Season Season 3 1988 | 16 Episodes Season 3 of Degrassi Junior High premiered on November  7, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   1981-05-16 SCTV Network 90 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords toronto teenager junior high school teen social issues Content Score 93 Almost there... Top Contributors 154 Banana c 4 chris081 2 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}