{"link": "https://www.themoviedb.org/tv/68315?language=en", "title": "The Mist", "resume": "A small town family is torn apart by a brutal crime. As they deal with the fallout an eerie mist rolls in, suddenly cutting them off from the rest of the world, and in some cases, each other.", "rate": 55, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Morgan Spector", "Alyssa Sutherland", "Gus Birney", "Danica Curcic", "Okezie Morro"], "character": ["Kevin Copeland", "Eve Copeland", "Alex Copeland", "Mia Lambert", "Bryan Hunt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68315   Expand The Mist   (2017) User Score  Play Trailer Overview A small town family is torn apart by a brutal crime. As they deal with the fallout an eerie mist rolls in, suddenly cutting them off from the rest of the world, and in some cases, each other. Featured Crew Christian Torpe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  16 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  2 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morgan Spector Kevin Copeland Alyssa Sutherland Eve Copeland Gus Birney Alex Copeland Danica Curcic Mia Lambert Okezie Morro Bryan Hunt Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of The Mist premiered on June 22, 2017. View All Seasons Social Reviews  1 Discussions  16 A review by RoidDroidVoid  3.0 Written by  RoidDroidVoid  on July 23, 2017 After watching the first 5 episodes, I just can't take any more.  This show is absolutely horrible.  From the completely ridiculous decisions made by the characters throughout to the uninteresting and poorly written drama, this show needs to be put out of it's misery (no pun intended).\nI hate the characters.  I don't care to know anyone's backstory.  The acting is uninspired.  The story is a re-hash of a re-hash and, even then, the main story takes a back seat to the contrived nonsense meant to inform us about the characters.  Even though the writers are brutal and relentless in their quest to...  read the rest. Read All Reviews Media Most Popular Videos  3 Backdrops  7 Posters  4 Recommendations   2016-03-04 Slasher 6.0    2016-10-10 Freakish 5.8    2016-11-15 Shooter 6.7    2017-05-05 Spirit: Riding Free 6.3    2014-08-23 Intruders 6.5    2016-10-31 Stan Against Evil 6.7    2017-10-02 The Gifted 7.0    2016-06-01 Cleverman 5.7  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  40m, 60m Homepage   http://www.spike.com/shows/the-mist Genres Drama Sci-Fi & Fantasy Keywords small town suicide maine mist Content Score 100 Yes! Looking good! Top Contributors 65 Elizabeth Jennings 36 Joe Carson 26 henriquesene 10 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}