{"link": "https://www.themoviedb.org/tv/53705?language=en", "title": "3 Golden Men", "resume": "Saam Num Neua Thong (3 Golden Men)is a modern take on love of 3 men with different personalities who happen to be best friends.\nFirst we have Theetat, he is a playboy who owns a construction company. He loves life, partying, and his freedom. He lives with his girlfriend and they have an open relationship. Eventually he will fall for the cheerful Lumpao, a veterinarian and the cousin to one of his best friend Kritchai. Theetat once insulted Lumpao, saying he will never eye her as a love interest, which really ticked her off and they have been arguing ever since.\nSecondly we have Watchara, the honest police officer. Watchara has been in relationship for years, but has doubts. His girlfriend wants to get married, but he has been stalling it. Watchara is starting to realize that his relationship with his girlfriend is based on reputation more than on love. He eventually finds true love with the unselfish but boyish Fai.\nLastly we have Kritchai and Arunsri, they work for the same company. Kritchai is a good guy, unlike his friend Theetat, he is not a playboy or lively. He is sincere with his feelings and secretly has a crush on Arunsri, but she has a boyfriend and is very faithful to him. Her boyfriend however is absolutely horrible, he has a gambling addiction and has always been unfaithful to her. When he dies, she begins to look at Kritchai in a different way, a man who is always on her side, ready to help her in every way possible.\nTheir relationships: Kritchai, Watchara, and Theetat are good friends. Lumpao is Kritchai’s cousin. Kritchai works with Arunsri. Fai is Arunsri’s best friend.", "rate": 75, "genre": ["Soap", "Drama"], "cast": ["Prin Suparat", "Kimberly Ann Voltemas", "Pakorn Chatborirak", "Marie Broenner", "Phupoom Phongpanu"], "character": ["Kritchai", "Arunsri/Aew", "Watchara", "Fai", "Theetat"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53705   Expand 3 Golden Men   (2011) User Score  Play Trailer Overview Saam Num Neua Thong (3 Golden Men)is a modern take on love of 3 men with different personalities who happen to be best friends. First we have Theetat, he is a playboy who owns a construction company. He loves life, partying, and his freedom. He lives with his girlfriend and they have an open relationship. Eventually he will fall for the cheerful Lumpao, a veterinarian and the cousin to one of his best friend Kritchai. Theetat once insulted Lumpao, saying he will never eye her as a love interest, which really ticked her off and they have been arguing ever since. Secondly we have Watchara, the honest police officer. Watchara has been in relationship for years, but has doubts. His girlfriend wants to get married, but he has been stalling it. Watchara is starting to realize that his relationship with his girlfriend is based on reputation more than on love. He eventually finds true love with the unselfish but boyish Fai. Lastly we have Kritchai and Arunsri, they work for the same company. Kritchai is a good guy, unlike his friend Theetat, he is not a playboy or lively. He is sincere with his feelings and secretly has a crush on Arunsri, but she has a boyfriend and is very faithful to him. Her boyfriend however is absolutely horrible, he has a gambling addiction and has always been unfaithful to her. When he dies, she begins to look at Kritchai in a different way, a man who is always on her side, ready to help her in every way possible. Their relationships: Kritchai, Watchara, and Theetat are good friends. Lumpao is Kritchai’s cousin. Kritchai works with Arunsri. Fai is Arunsri’s best friend.  Featured Crew Krit Sukramongkon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Prin Suparat Kritchai Kimberly Ann Voltemas Arunsri/Aew Pakorn Chatborirak Watchara Marie Broenner Fai Phupoom Phongpanu Theetat Full Cast & Crew Last Season Season 1 2011 | 15 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on 3 Golden Men. You can help by rating TV shows you've seen. Facts Original Name  สามหนุ่มเนื้อทอง Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  855m Homepage   http://th.wikipedia.org/wiki/%E0%B8%AA%E0%B8%B2%E0%B8%A1%E0%B8%AB%E0%B8%99%E0%B8%B8%E0%B9%88%E0%B8%A1%E0%B9%80%E0%B8%99%E0%B8%B7%E0%B9%89%E0%B8%AD%E0%B8%97%E0%B8%AD%E0%B8%87 Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 49 Crip TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}