{"link": "https://www.themoviedb.org/tv/42496?language=en", "title": "Hollywood", "resume": "Hollywood is a 1980 documentary series produced by Thames Television which explored the establishment and development of the Hollywood studios and its impact on 1920s culture.", "rate": 85, "genre": ["Documentary"], "cast": ["James Mason", "Lillian Gish", "Blanche Sweet", "Colleen Moore", "Jackie Coogan"], "character": ["Himself (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42496   Expand Hollywood   (1980) User Score Overview Hollywood is a 1980 documentary series produced by Thames Television which explored the establishment and development of the Hollywood studios and its impact on 1920s culture. Featured Crew Kevin Brownlow Creator David Gill Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Mason Himself (voice) Lillian Gish Blanche Sweet Colleen Moore Jackie Coogan Full Cast & Crew Last Season Season 1 1980 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Hollywood. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords cinema silent film hollywood history Content Score 93 Almost there... Top Contributors q 20 quinnrex 12 Murnau TB 6 TMDb Bot R 5 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}