{"link": "https://www.themoviedb.org/tv/66102?language=en", "title": "Seisen Cerberus: Ryuukoku no Fatalités", "resume": "Sword and magic rule in the continent of Kuna'ahn. In this continent are three powerful nations: the Holy Kingdom of Amoria, the Kingdom of Ishilfen, and the Kingdom of Vanrodis, which share a delicate balance of power. Should disaster befall any one of the three nations, war would spread throughout the continent. Also residing there is the feared \"Evil Dragon\" Daganzord, an unstoppable force that leaves nothing but scorched land and destruction wherever he goes. Hiiro's parents, Bairo and Kismitete, joined other sorcerers in a magic ritual ten years ago in an attempt to seal Daganzord, but failed when someone interfered. The ritual would later become known as the \"Balbagoa Tragedy.\" After being rescued by Giruu, young Hiiro set out to learn swordsmanship so that he could avenge his parents. Now, ten years later, sixteen-year-old Hiiro leaves home on a journey to slay the Evil Dragon, and Giruu feels he has no choice but to accompany him. In the search for the Evil Dragon, Hiiro encounters people of various races who join in his quest to eliminate Daganzord... but will Hiiro really succeed in overcoming the destiny he took upon himself and defeating Daganzord?!", "rate": 50, "genre": ["Animation", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66102   Expand Seisen Cerberus: Ryuukoku no Fatalités   (2016) User Score  Play Trailer Overview Sword and magic rule in the continent of Kuna'ahn. In this continent are three powerful nations: the Holy Kingdom of Amoria, the Kingdom of Ishilfen, and the Kingdom of Vanrodis, which share a delicate balance of power. Should disaster befall any one of the three nations, war would spread throughout the continent. Also residing there is the feared \"Evil Dragon\" Daganzord, an unstoppable force that leaves nothing but scorched land and destruction wherever he goes. Hiiro's parents, Bairo and Kismitete, joined other sorcerers in a magic ritual ten years ago in an attempt to seal Daganzord, but failed when someone interfered. The ritual would later become known as the \"Balbagoa Tragedy.\" After being rescued by Giruu, young Hiiro set out to learn swordsmanship so that he could avenge his parents. Now, ten years later, sixteen-year-old Hiiro leaves home on a journey to slay the Evil Dragon, and Giruu feels he has no choice but to accompany him. In the search for the Evil Dragon, Hiiro encounters people of various races who join in his quest to eliminate Daganzord... but will Hiiro really succeed in overcoming the destiny he took upon himself and defeating Daganzord?! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Seisen Cerberus: Ryuukoku no Fatalités premiered on April  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Seisen Cerberus: Ryuukoku no Fatalités. You can help by rating TV shows you've seen. Facts Original Name  聖戦ケルベロス　竜刻のファタリテ Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.cerberus-anime.jp/ Genres Animation Action & Adventure Sci-Fi & Fantasy Keywords based on video game anime Content Score 64 We're so close, yet so far. Top Contributors 26 sp1ti z 5 zurman1 4 karaa c 4 chcola  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}