{"link": "https://www.themoviedb.org/tv/15828?language=en", "title": "The California Raisin Show", "resume": "The California Raisin Show is an animated television series based on the claymation advertising characters The California Raisins. The show is based on an Emmy Award-winning claymation special, Meet the Raisins!, which originally aired on CBS in 1989. After the show's 13-episode run, a sequel to the original special, Raisins: Sold Out!: The California Raisins II, aired in 1990.\nWhile the characters are traditionally depicted in claymation, the TV show was cel animated by Murakami-Wolf-Swenson. It did, however, maintain Will Vinton as creative director and executive producer. It takes place in a world populated by anthropomorphic fruits and vegetables and focuses on the main characters, the California Raisins: A.C., Beebop, Stretch, and Red. Each episode has one or more musical numbers.", "rate": 0, "genre": ["Animation"], "cast": ["Cam Clarke", "Brian Stokes Mitchell", "Dorian Harewood", "Willard E. Pugh", "Cree Summer"], "character": ["Crystal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15828   Expand The California Raisin Show   (1989) User Score Overview The California Raisin Show is an animated television series based on the claymation advertising characters The California Raisins. The show is based on an Emmy Award-winning claymation special, Meet the Raisins!, which originally aired on CBS in 1989. After the show's 13-episode run, a sequel to the original special, Raisins: Sold Out!: The California Raisins II, aired in 1990. While the characters are traditionally depicted in claymation, the TV show was cel animated by Murakami-Wolf-Swenson. It did, however, maintain Will Vinton as creative director and executive producer. It takes place in a world populated by anthropomorphic fruits and vegetables and focuses on the main characters, the California Raisins: A.C., Beebop, Stretch, and Red. Each episode has one or more musical numbers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cam Clarke Brian Stokes Mitchell Dorian Harewood Willard E. Pugh Cree Summer Crystal Full Cast & Crew Last Season Season 1 1989 | 14 Episodes Season 1 of The California Raisin Show premiered on September 16, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The California Raisin Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}