{"link": "https://www.themoviedb.org/tv/60018?language=en", "title": "David Attenborough's Rise of Animals: Triumph of the Vertebrates", "resume": "David Attenborough embarks on a remarkable 500 million-year journey revealing the extraordinary group of animals that dominate our world, and how their evolution defines our human bodies.", "rate": 88, "genre": ["Documentary"], "cast": ["David Attenborough"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60018   Expand David Attenborough's Rise of Animals: Triumph of the Vertebrates   (2013) User Score Overview David Attenborough embarks on a remarkable 500 million-year journey revealing the extraordinary group of animals that dominate our world, and how their evolution defines our human bodies. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Attenborough Himself Full Cast & Crew Last Season Season 1 2013 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  7 Recommendations   2012-01-03 Nature's Weirdest Events 6.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b03bkpg1 Genres Documentary Keywords biology natural history animal evolution science natural selection backbone Content Score 56 We're so close, yet so far. Top Contributors TB 24 TMDb Bot 11 Greg R 4 Rebecca 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}