{"link": "https://www.themoviedb.org/tv/43747?language=en", "title": "The Reckoning", "resume": "Sally Wilson's daughter Amanda is stricken with a brain tumour and each day, her condition appears to be worsening. Sally is at her wits end as to how to help her daughter and knows a life saving operation in America that she can't afford would be the answer. When the harassed single Mum is called to the office of a swish city lawyer, she never expects a life or death proposition. She’s been bequeathed £5 million! But in order to qualify for this amazing transfer of funds, Sally must first kill a man who deserves to die.", "rate": 40, "genre": ["Drama"], "cast": ["Ashley Jensen", "Max Beesley", "Sophie Stuckey", "Jane Perry", "Aidan McArdle"], "character": ["Sally Wilson", "Mark Dobson", "Amanda Wilson", "Debra Cale", "Simon Harris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43747   Expand The Reckoning   (2011) User Score Overview Sally Wilson's daughter Amanda is stricken with a brain tumour and each day, her condition appears to be worsening. Sally is at her wits end as to how to help her daughter and knows a life saving operation in America that she can't afford would be the answer. When the harassed single Mum is called to the office of a swish city lawyer, she never expects a life or death proposition. She’s been bequeathed £5 million! But in order to qualify for this amazing transfer of funds, Sally must first kill a man who deserves to die. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashley Jensen Sally Wilson Max Beesley Mark Dobson Sophie Stuckey Amanda Wilson Jane Perry Debra Cale Aidan McArdle Simon Harris Full Cast & Crew Last Season Miniseries 2011 | 2 Episodes Season 1 of The Reckoning premiered on January  6, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1999-01-18 Parlamentet 3.0    2013-11-07 Folkets främsta företrädare 5.0    2002-10-31 Värsta språket 6.0    2016-04-25 After the Thrones 4.6    2004-08-30 John Safran vs God 7.3    1987-09-05 På spåret 5.0    The World of Science 6.0    1991-12-01 Sunes jul 6.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Drama Keywords tv show Content Score 86 Almost there... Top Contributors 21 Banana TB 10 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}