{"link": "https://www.themoviedb.org/tv/46538?language=en", "title": "Can We Get Married?", "resume": "Can We Get Married? is a 2012 South Korean television series starring Sung Joon, Jung So-min, Lee Mi-sook, Han Groo, and Kim Young-kwang. It aired on jTBC from October 29, 2012 to January 1, 2013 on Mondays and Tuesdays at 23:00 for 20 episodes. The romantic comedy explores the themes of love, marriage and family against the backdrop of a young couple preparing to get married in 100 days.", "rate": 73, "genre": ["Comedy", "Family"], "cast": ["Sung Joon", "Jung So-min", "Kim Young-kwang", "Min Han Groo", "Lee Mi-sook"], "character": ["Jung-hoon", "Hye-yoon", "Ki-joong", "Dong-bi", "Deul-ja"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46538   Expand Can We Get Married?   (2012) User Score Overview Can We Get Married? is a 2012 South Korean television series starring Sung Joon, Jung So-min, Lee Mi-sook, Han Groo, and Kim Young-kwang. It aired on jTBC from October 29, 2012 to January 1, 2013 on Mondays and Tuesdays at 23:00 for 20 episodes. The romantic comedy explores the themes of love, marriage and family against the backdrop of a young couple preparing to get married in 100 days. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sung Joon Jung-hoon Jung So-min Hye-yoon Kim Young-kwang Ki-joong Min Han Groo Dong-bi Lee Mi-sook Deul-ja Full Cast & Crew Last Season Season 1 2012 | 20 Episodes Season 1 of Can We Get Married? premiered on October 29, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Can We Get Married?. You can help by rating TV shows you've seen. Facts Original Name  우리가 결혼할 수 있을까 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://drama.jtbc.joins.com/wemarry/ Genres Comedy Family Keywords korea Content Score 86 Almost there... Top Contributors M 29 Maria180493 z 10 zurman1 CM 6 Cherche Moi t 5 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}