{"link": "https://www.themoviedb.org/tv/17546?language=en", "title": "Il était une fois... notre terre", "resume": "Il était une fois... notre Terre is a French animated TV series directed by Albert Barillé. The series was initially broadcast since 22 December 2008 on France 3. This series was the belated finale of the Once Upon a Time... educational television franchise, and its original premise was set up from \"Once Upon a Time... the Earth\", the finale episode of the first series Once Upon a Time... Man, thus finally going back to the beginning where it all started and ended. The series' premiere also coincided with the 30th anniversary milestone of the said educational animation franchise.", "rate": 90, "genre": ["Animation", "Documentary"], "cast": ["Roger Carel", "Annie Balestra", "Alain Dorval"], "character": ["Maestro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17546   Expand Il était une fois... notre terre   (2009) User Score Overview Il était une fois... notre Terre is a French animated TV series directed by Albert Barillé. The series was initially broadcast since 22 December 2008 on France 3. This series was the belated finale of the Once Upon a Time... educational television franchise, and its original premise was set up from \"Once Upon a Time... the Earth\", the finale episode of the first series Once Upon a Time... Man, thus finally going back to the beginning where it all started and ended. The series' premiere also coincided with the 30th anniversary milestone of the said educational animation franchise. Featured Crew Albert Barillé Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roger Carel Maestro Annie Balestra Alain Dorval Full Cast & Crew Last Season Season 1 2009 | 26 Episodes Season 1 of Il était une fois... notre terre premiered on January  3, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Il était une fois... notre terre. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Polish Runtime  25m Homepage  - Genres Animation Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors M 8 Manu n 6 nordicstyle W 6 Wiruss t 5 take-kino  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}