{"link": "https://www.themoviedb.org/tv/2058?language=en", "title": "Absolute Power", "resume": "Stephen Fry and John Bird star as spin doctors Charles Prentiss and Martin McCabe as they bring the popular and satirical Radio 4 comedy Absolute Power to BBC Two. Stephen as Prentiss and John as McCabe are an unscrupulous pair who run the blue chip PR agency Prentiss McCabe. Dealing with commercial as well as personal PR, their remit covers everything from political communications to celebrity media relations. Their manipulation skills are tested to the full as they frequently find that their work brings them into conflict with political parties, newspaper editors and celebrities.", "rate": 75, "genre": ["Comedy"], "cast": ["John Bird", "Stephen Fry", "Geoffrey Palmer", "Sally Bretton", "Nicholas Burns"], "character": ["Martin McCabe", "Charles Prentiss", "Cat Durnford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2058   Expand Absolute Power   (2003) User Score Overview Stephen Fry and John Bird star as spin doctors Charles Prentiss and Martin McCabe as they bring the popular and satirical Radio 4 comedy Absolute Power to BBC Two. Stephen as Prentiss and John as McCabe are an unscrupulous pair who run the blue chip PR agency Prentiss McCabe. Dealing with commercial as well as personal PR, their remit covers everything from political communications to celebrity media relations. Their manipulation skills are tested to the full as they frequently find that their work brings them into conflict with political parties, newspaper editors and celebrities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Bird Martin McCabe Stephen Fry Charles Prentiss Geoffrey Palmer Sally Bretton Cat Durnford Nicholas Burns Full Cast & Crew Last Season Season 2 2005 | 6 Episodes Season 2 of Absolute Power premiered on July 21, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Absolute Power. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/radio4/comedy/absolute.shtml Genres Comedy Keywords media politics manipulation satire workplace scandal celebrity sitcom political humour british humour workplace comedy Content Score 86 Almost there... Top Contributors O 17 Ozbourne R 3 Rebecca w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}