{"link": "https://www.themoviedb.org/tv/6753?language=en", "title": "The Good Life", "resume": "The Good Life is an American sitcom which aired on NBC in early 1994. It starred John Caponera and Drew Carey.\nOther members of the cast included Eve Gordon, Jake Patellis, Shay Astar, Justin Berfield and Monty Hoffman.\nThe show revolved around Caponera's character and featured both his home life and the lock company where he served as a middle manager. It was set in Chicago.\nThirteen episodes were produced and aired before the sitcom's cancellation in May 1994.", "rate": 0, "genre": ["Comedy"], "cast": ["Drew Carey", "Justin Berfield", "Eve Gordon", "Shay Astar", "John Caponera"], "character": ["Drew Clark", "Bob Bowman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6753   Expand The Good Life   (1994) User Score Overview The Good Life is an American sitcom which aired on NBC in early 1994. It starred John Caponera and Drew Carey. Other members of the cast included Eve Gordon, Jake Patellis, Shay Astar, Justin Berfield and Monty Hoffman. The show revolved around Caponera's character and featured both his home life and the lock company where he served as a middle manager. It was set in Chicago. Thirteen episodes were produced and aired before the sitcom's cancellation in May 1994. Featured Crew Jeff Martin Creator Suzanne Martin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Drew Carey Drew Clark Justin Berfield Bob Bowman Eve Gordon Shay Astar John Caponera Full Cast & Crew Last Season Season 1 1994 | 13 Episodes Season 1 of The Good Life premiered on January  3, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Good Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords chicago family sitcom Content Score 79 Pump it up! We're close now. Top Contributors 14 Banana 4 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}