{"link": "https://www.themoviedb.org/tv/17655?language=en", "title": "UFO Hunters", "resume": "UFO Hunters is an American television series that premiered on January 30, 2008 on The History Channel, produced by Motion Picture Production Inc., and ran for three seasons.\nJon Alon Walz was the Executive Producer of the show and was responsible for selling the series to History Channel after a bidding war for the rights to the show broke out between History Channel and Sci-Fi Channel.\nThe concept for the show was tested in a segment of History Channel's 2006 UFO special entitled \"Deep Sea UFOs\", produced by Motion Picture Production Inc, which featured two of the final four cast members. \"UFO Hunters\" was not a spin-off from a 2005 History Channel special with the same title.\nThe tagline of the show is: Hoax or History?\nThe series should not be confused with a similarly themed and titled UFO Hunters, a special that debuted the same day and time on the Sci-Fi Channel, and created by the producers of Ghost Hunters, but which only aired one episode.\nIn the US, History Channel only released the first two seasons on DVD in the correct airdate order. However, the format was only released in full screen instead of wide screen. In the UK, History Channel released the third and final season on DVD however, the episodes were released in the incorrect airdate order.", "rate": 65, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17655   Expand UFO Hunters   (2008) User Score Overview UFO Hunters is an American television series that premiered on January 30, 2008 on The History Channel, produced by Motion Picture Production Inc., and ran for three seasons. Jon Alon Walz was the Executive Producer of the show and was responsible for selling the series to History Channel after a bidding war for the rights to the show broke out between History Channel and Sci-Fi Channel. The concept for the show was tested in a segment of History Channel's 2006 UFO special entitled \"Deep Sea UFOs\", produced by Motion Picture Production Inc, which featured two of the final four cast members. \"UFO Hunters\" was not a spin-off from a 2005 History Channel special with the same title. The tagline of the show is: Hoax or History? The series should not be confused with a similarly themed and titled UFO Hunters, a special that debuted the same day and time on the Sci-Fi Channel, and created by the producers of Ghost Hunters, but which only aired one episode. In the US, History Channel only released the first two seasons on DVD in the correct airdate order. However, the format was only released in full screen instead of wide screen. In the UK, History Channel released the third and final season on DVD however, the episodes were released in the incorrect airdate order. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2009 | 13 Episodes Season 3 of UFO Hunters premiered on March 19, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2015-01-17 Monsters and Mysteries in America 5.8    2011-06-27 Doomsday Preppers 4.5    2014-02-28 Hangar 1: The UFO Files 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m, 60m Homepage   http://www.history.com/minisites/ufo Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 4 -BioHaZard- 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}