{"link": "https://www.themoviedb.org/tv/4920?language=en", "title": "Damages", "resume": "Damages is an American legal thriller television series created by the writing and production trio of Daniel Zelman and brothers Glenn and Todd A. Kessler. The plot revolves around the brilliant, ruthless lawyer Patty Hewes and her protégée, recent law school graduate Ellen Parsons. Each season features a major case that Hewes and her firm take on, while also examining a chapter of the complicated relationship between Ellen and Patty. The first two seasons center around the law firm Hewes & Associates. Later seasons center more on Patty and Ellen's relationship as Ellen begins to distance herself from Hewes & Associates and begins an independent career.", "rate": 74, "genre": ["Mystery", "Drama"], "cast": ["Glenn Close", "Rose Byrne", "Ryan Phillippe"], "character": ["Patty Hewes", "Ellen Parsons", "Channing McClaren"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4920   Expand Damages   (2007) User Score  Play Trailer Overview Damages is an American legal thriller television series created by the writing and production trio of Daniel Zelman and brothers Glenn and Todd A. Kessler. The plot revolves around the brilliant, ruthless lawyer Patty Hewes and her protégée, recent law school graduate Ellen Parsons. Each season features a major case that Hewes and her firm take on, while also examining a chapter of the complicated relationship between Ellen and Patty. The first two seasons center around the law firm Hewes & Associates. Later seasons center more on Patty and Ellen's relationship as Ellen begins to distance herself from Hewes & Associates and begins an independent career. Featured Crew Allen Coulter Creator Todd A. Kessler Creator Glenn Kessler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  26 Posters  21 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Glenn Close Patty Hewes Rose Byrne Ellen Parsons Ryan Phillippe Channing McClaren Full Cast & Crew Last Season Season 5 2013 | 10 Episodes Season 5 of Damages premiered on August 29, 2013. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Ellen Parsons: Happy Birthday Rose Byrne! Open 0 by wonder2wonder\n      \n     This is one of my favourite shows ever! Open 2 by Master_YODA\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  26 Posters  21 Recommendations   2007-02-26 The Black Donnellys 7.4    2012-10-11 Copper 6.0    2006-07-09 Brotherhood 7.4    2010-03-16 Justified 7.9    2008-06-01 In Plain Sight 7.0    2011-04-03 The Killing 7.5    2009-01-18 United States of Tara 7.3    2003-06-27 Dead Like Me 7.8  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.directv.com/damages/ Genres Mystery Drama Keywords law lawyer woman lawyer ruthless Content Score 71 Just a little bit more... Top Contributors 75 Banana 29 Travis Bell 8 rantamplan S 7 Sling2009  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}