{"link": "https://www.themoviedb.org/tv/43348?language=en", "title": "Pablo Escobar, The Drug Lord", "resume": "Pablo Escobar: El Patrón del Mal is a 2012 Colombian television series produced and broadcast on Caracol TV, about the life of Pablo Escobar. It is only available in Spanish. There is a version available with English subtitles.", "rate": 71, "genre": ["Crime", "Drama"], "cast": ["Andrés Parra", "Angie Cepeda", "Vicky Hernández", "Nicolas Montero", "Marcela Gallego"], "character": ["Pablo Emilio Escobar Gaviria", "Regina Parejo", "Doña Enelia de Escobar", "Luis Carlos Galán Sarmiento", "Gloria Pachón de Galán"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43348   Expand Pablo Escobar, The Drug Lord   (2012) User Score Overview Pablo Escobar: El Patrón del Mal is a 2012 Colombian television series produced and broadcast on Caracol TV, about the life of Pablo Escobar. It is only available in Spanish. There is a version available with English subtitles. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrés Parra Pablo Emilio Escobar Gaviria Angie Cepeda Regina Parejo Vicky Hernández Doña Enelia de Escobar Nicolas Montero Luis Carlos Galán Sarmiento Marcela Gallego Gloria Pachón de Galán Full Cast & Crew Last Season Season 1 2012 | 113 Episodes Season 1 of Pablo Escobar, The Drug Lord premiered on May 28, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply El Patron del Mal vs Narcos Open 0 by Benedict\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2015-09-22 Sea of Plastic 6.8  Facts Original Name  Pablo Escobar, el patrón del mal Status  Ended Network Certification 16 Meaning Content suitable for viewers over the age of 16. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Crime Drama Keywords colombia organized crime drug lord Content Score 86 Almost there... Top Contributors 10 Banana VF 7 Vitor Fernandes z 5 zurman1 4 Tiago Silva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}