{"link": "https://www.themoviedb.org/tv/13856?language=en", "title": "The Crow Road", "resume": "History student Prentice returns home to attend his grandmother’s funeral. As the McHoan family gathers together to mark the solemn occasion, old disagreements continue to fester and old acquaintances are renewed. Following the unexpected death of another close relative, Prentice begins to question the past: why did his Uncle Rory suddenly disappear and where did he go? Reading his Uncle Rory’s unpublished novel may provide the answers he is seeking but it also unearths some dark family secrets he didn’t bargain for.", "rate": 78, "genre": ["Drama"], "cast": ["Joe McFadden", "Bill Paterson", "Peter Capaldi", "Dougray Scott", "Claire Neilson"], "character": ["Prentice McHoan", "Kenneth McHoan", "Rory McHoan", "Lewis McHoan", "Aunt Antonia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13856   Expand The Crow Road   (1996) User Score Overview History student Prentice returns home to attend his grandmother’s funeral. As the McHoan family gathers together to mark the solemn occasion, old disagreements continue to fester and old acquaintances are renewed. Following the unexpected death of another close relative, Prentice begins to question the past: why did his Uncle Rory suddenly disappear and where did he go? Reading his Uncle Rory’s unpublished novel may provide the answers he is seeking but it also unearths some dark family secrets he didn’t bargain for. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe McFadden Prentice McHoan Bill Paterson Kenneth McHoan Peter Capaldi Rory McHoan Dougray Scott Lewis McHoan Claire Neilson Aunt Antonia Full Cast & Crew Last Season Season 1 1996 | 4 Episodes Season 1 of The Crow Road premiered on November  4, 1996. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Crow Road. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1991-06-06 G.B.H. 7.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 58m Homepage  - Genres Drama Keywords based on novel or book scotland mystery miniseries Content Score 86 Almost there... Top Contributors 13 rudely_murray 11 Elizabeth Jennings 10 Banana R 8 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}