{"link": "https://www.themoviedb.org/tv/4316?language=en", "title": "Combat!", "resume": "Combat! is an American television program that originally aired on ABC from 1962 until 1967. The show covered the grim lives of a squad of American soldiers fighting the Germans in France during World War II. The program starred Rick Jason as platoon leader Second Lieutenant Gil Hanley and Vic Morrow as Sergeant \"Chip\" Saunders.", "rate": 73, "genre": ["War", "Politics", "Drama"], "cast": ["Rick Jason", "Vic Morrow", "Jack Hogan", "Pierre Jalbert", "Conlan Carter"], "character": ["Lieutenant Gil Hanley", "Sergeant Chip Saunders", "William G. Kirby", "Paul \"Caje\" Lemay", "Doc"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4316   Expand Combat!   (1962) User Score Overview Combat! is an American television program that originally aired on ABC from 1962 until 1967. The show covered the grim lives of a squad of American soldiers fighting the Germans in France during World War II. The program starred Rick Jason as platoon leader Second Lieutenant Gil Hanley and Vic Morrow as Sergeant \"Chip\" Saunders. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rick Jason Lieutenant Gil Hanley Vic Morrow Sergeant Chip Saunders Jack Hogan William G. Kirby Pierre Jalbert Paul \"Caje\" Lemay Conlan Carter Doc Full Cast & Crew Last Season Season 5 1966 | 25 Episodes Season 5 of Combat! premiered on September 13, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   1962-10-01 The Lucy Show 7.0    1968-09-24 The Mod Squad 6.3    1965-01-24 Branded 8.3    1959-10-05 Adventures in Paradise 7.5    1965-09-15 I Spy 6.9    1961-01-05 Mister Ed 7.4    1968-01-09 It Takes a Thief 7.4    1958-09-23 Sea Hunt 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres War & Politics Drama Keywords world war ii u.s. army u.s. soldier military Content Score 86 Almost there... Top Contributors 16 Banana z 10 zurman1 2 Steve SC 2 Steven C  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}