{"link": "https://www.themoviedb.org/tv/37578?language=en", "title": "Robin Hood's Big Adventure", "resume": "Robin Hood's Big Adventure is an anime adaptation of the classic Robin Hood story consisting of 52 episodes. In this version, Robin and his allies are mostly pre-teens.", "rate": 83, "genre": ["Animation", "Kids"], "cast": ["Kazue Ikura"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37578   Expand Robin Hood's Big Adventure   (1990) User Score Overview Robin Hood's Big Adventure is an anime adaptation of the classic Robin Hood story consisting of 52 episodes. In this version, Robin and his allies are mostly pre-teens. Featured Crew Kouichi Mashimo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kazue Ikura Full Cast & Crew Last Season Season 1 1990 | 52 Episodes Season 1 of Robin Hood's Big Adventure premiered on July 29, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Robin Hood's Big Adventure. You can help by rating TV shows you've seen. Facts Original Name  ロビンフッドの大冒険 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.mxtv.co.jp/robinhood/ Genres Animation Kids Keywords robin hood anime Content Score 64 We're so close, yet so far. Top Contributors S 25 Shingkuro C 8 CroCop J 7 JohnyB0y M 5 Migi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}