{"link": "https://www.themoviedb.org/tv/13907?language=en", "title": "Bustin' Loose", "resume": "Bustin' Loose is an American situation comedy that was loosely based on the 1981 film of the same name starring Richard Pryor. The series premiered in first-run syndication in 1987 and lasted for only one season.", "rate": 0, "genre": ["Comedy"], "cast": ["Patti Deutsch", "Clive Revill", "Dody Goodman", "Ron Masak", "Jimmie Walker"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13907   Expand Bustin' Loose   (1987) User Score Overview Bustin' Loose is an American situation comedy that was loosely based on the 1981 film of the same name starring Richard Pryor. The series premiered in first-run syndication in 1987 and lasted for only one season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patti Deutsch Clive Revill Dody Goodman Ron Masak Jimmie Walker Full Cast & Crew Last Season Bustin loose season 1 1987 | 26 Episodes Season 1 of Bustin' Loose premiered on September 19, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bustin' Loose. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors s 3 stheven 2 Bryan Bortz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}