{"link": "https://www.themoviedb.org/tv/14608?language=en", "title": "The Frank Skinner Show", "resume": "The Frank Skinner Show was a television chat show hosted by comedian Frank Skinner, which lasted nine series on British television between 1995 and 2005.\nAs well as celebrity interviews, the shows included an initial stand-up routine, various sketches throughout the episode and usually concluded with a comedic song featuring Frank and the guest stars. The Frank Skinner Show became notorious over the years for the unconventional nature of the interviews, including some shocking revelations from the guests. The programme ended in 2005 after nine series.\nIt was screened on BBC One from its first episode on 10 September 1995 until 3 June 1999.\nIn 2000, the show moved to ITV. The programme was nominated for a Royal Television Society Award in 2001.", "rate": 100, "genre": ["Talk", "Comedy"], "cast": ["Frank Skinner"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14608   Expand The Frank Skinner Show   (1995) User Score Overview The Frank Skinner Show was a television chat show hosted by comedian Frank Skinner, which lasted nine series on British television between 1995 and 2005. As well as celebrity interviews, the shows included an initial stand-up routine, various sketches throughout the episode and usually concluded with a comedic song featuring Frank and the guest stars. The Frank Skinner Show became notorious over the years for the unconventional nature of the interviews, including some shocking revelations from the guests. The programme ended in 2005 after nine series. It was screened on BBC One from its first episode on 10 September 1995 until 3 June 1999. In 2000, the show moved to ITV. The programme was nominated for a Royal Television Society Award in 2001. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Skinner Host Full Cast & Crew Last Season Season 9 2005 | 12 Episodes Season 9 of The Frank Skinner Show premiered on September 30, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Frank Skinner Show. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Talk Show Original Language  English Runtime  60m Homepage  - Genres Talk Comedy Keywords talk show celebrity Content Score 56 We're so close, yet so far. Top Contributors 10 Banana TB 2 TMDb Bot 1 lineker D 1 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}