{"link": "https://www.themoviedb.org/tv/35483?language=en", "title": "Marsupilami", "resume": "Marsupilami is an animated series that first appeared on television in Raw Toonage in 1992, and was then spun off into his own eponymous show on the CBS television network for the 1993–1994 season.", "rate": 50, "genre": ["Family", "Animation", "Comedy"], "cast": ["Rene Auberjonois", "April Winchell", "Jeff Bennett", "Jason Marsden", "Charlie Adler"], "character": ["Chef Louie (voice)", "Shnookums (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35483   Expand Marsupilami   (1993) User Score Overview Marsupilami is an animated series that first appeared on television in Raw Toonage in 1992, and was then spun off into his own eponymous show on the CBS television network for the 1993–1994 season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rene Auberjonois Chef Louie (voice) April Winchell Jeff Bennett Jason Marsden Shnookums (voice) Charlie Adler Full Cast & Crew Last Season Season 1 1993 | 13 Episodes Season 1 of Marsupilami premiered on September 18, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Marsupilami. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Animation Comedy Keywords based on comic jungle south america Content Score 86 Almost there... Top Contributors 21 Banana s 3 speedycars R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}