{"link": "https://www.themoviedb.org/tv/61197?language=en", "title": "Emergency Couple", "resume": "Medical school student, Chang Min, and a dietitian, Jin Hee, fall in love and marry despite his family's strong opposition. When Chang Min marries Jin Hee, he gives up his medical internship to become a pharmaceutical salesman despite the fact that the rest of his family are successful doctors. Their married life is miserable as Chang Min's family looks down on Jin Hee and Chang Min begins to treat her poorly. They finally divorce and go their separate ways until they are suddenly reunited as interns working at the same hospital. Will this couple's tumultuous feelings for each other be rekindled?", "rate": 88, "genre": ["Comedy"], "cast": ["Song Ji-hyo", "Choi Jin-hyuk", "Lee Pil-mo", "Choi Yeo-jin", "Clara Lee"], "character": ["Oh Jin-hee", "Oh Chang-min", "Gook Cheon-soo", "Shim Ji-hye", "Han Ah-reum"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61197   Expand Emergency Couple   (2014) User Score Overview Medical school student, Chang Min, and a dietitian, Jin Hee, fall in love and marry despite his family's strong opposition. When Chang Min marries Jin Hee, he gives up his medical internship to become a pharmaceutical salesman despite the fact that the rest of his family are successful doctors. Their married life is miserable as Chang Min's family looks down on Jin Hee and Chang Min begins to treat her poorly. They finally divorce and go their separate ways until they are suddenly reunited as interns working at the same hospital. Will this couple's tumultuous feelings for each other be rekindled? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Song Ji-hyo Oh Jin-hee Choi Jin-hyuk Oh Chang-min Lee Pil-mo Gook Cheon-soo Choi Yeo-jin Shim Ji-hye Clara Lee Han Ah-reum Full Cast & Crew Last Season Season 1 2014 | 21 Episodes Season 1 of Emergency Couple premiered on January 24, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   2013-12-09 The Prime Minister and I 7.1    2013-10-09 The Heirs 7.4    2010-03-31 Personal Taste 7.4    2013-08-07 Master's Sun 7.7    2015-01-07 Kill Me, Heal Me 8.7    2009-01-05 Boys Over Flowers 7.8    2011-05-25 City Hunter 7.5    2009-10-07 You're Beautiful 7.9  Facts Original Name  응급남녀 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://program.interest.me/tvn/119couple Genres Comedy Keywords korea medical drama Content Score 86 Almost there... Top Contributors M 40 Maria180493 7 Elizabeth Jennings NS 6 Norte Serra s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}