{"link": "https://www.themoviedb.org/tv/16900?language=en", "title": "Voetbalvrouwen", "resume": "Voetbalvrouwen is a Dutch dramedy favourably compared to Footballers' Wives. Three seasons have been taped since 2006; the first was shown in 2007 on the demissionary channel Tien, the second and third on RTL.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Yolanthe Sneijder-Cabau", "Bas Muijs", "Mike Weerts", "Sophie van Oers", "Leontine Borsato"], "character": ["Kate Witte", "Italo Ferrero", "Danny Doornbos", "Renske Doornbos-Veldman", "Liz Duivendrecht"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16900   Expand Voetbalvrouwen   (2007) User Score Overview Voetbalvrouwen is a Dutch dramedy favourably compared to Footballers' Wives. Three seasons have been taped since 2006; the first was shown in 2007 on the demissionary channel Tien, the second and third on RTL. Featured Crew Ingrid van den Heuvel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yolanthe Sneijder-Cabau Kate Witte Bas Muijs Italo Ferrero Mike Weerts Danny Doornbos Sophie van Oers Renske Doornbos-Veldman Leontine Borsato Liz Duivendrecht Full Cast & Crew Last Season Season 3 2009 | 13 Episodes Season 3 of Voetbalvrouwen premiered on October 30, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Voetbalvrouwen. You can help by rating TV shows you've seen. Facts Status  Ended Networks Talpa Certification 12 Meaning Take care with children under 12. Type  Scripted Original Language  Dutch; Flemish Runtime  42m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 7 37 7Bee-NL s 3 speedycars TB 2 TMDb Bot a 1 andre.meulemans  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}