{"link": "https://www.themoviedb.org/tv/4112?language=en", "title": "Where's Waldo?: The Animated Series", "resume": "Where's Waldo?: The Animated Series is a joint venture between American/Canadian/British animated television series production, distributed by DIC Entertainment and The Waldo Film Company. The television series aired on CBS Kids for one season and later reaired on Nickelodeon.\nThe show follows the adventures of Waldo and his dog Woof, who were already established stars of the Where's Waldo picture book series. The \"Where's Waldo?\" TV Show brought the gangly man in the striped shirt and ski cap to Saturday morning TV. The cartoon \"Where's Waldo?\" went beyond the books' original concept, giving the characters depth and giving reasons for their adventures.\nWaldo and his dog Woof travel to distant lands, solving mysteries and lending a helping hand wherever they could. With the help of his magic walking stick, Waldo could travel through space and time or travel to far off magical lands. Often sent by Wizard Whitebeard to help solve a puzzle, or mysteries, \"Where's Waldo\" was a 1/2 hour puzzle of clues and riddles.\nThe evil Waldo lookalike Odlaw was the show's villain, constantly plotting to steal Waldo's magic stick. In each episode Odlaw would team up with the other villains from the far-off lands to help get the magic stick, while Waldo and Woof teamed up with other land's \"good-guys\" to help with their problems.", "rate": 70, "genre": ["Action", "Adventure", "Animation", "Comedy", "Family"], "cast": ["Pat Musick", "Townsend Coleman", "Jim Cummings", "Maurice LaMarche", "Pat Fraley"], "character": ["Waldo (voice)", "Narrator (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4112   Expand Where's Waldo?: The Animated Series   (1991) User Score Overview Where's Waldo?: The Animated Series is a joint venture between American/Canadian/British animated television series production, distributed by DIC Entertainment and The Waldo Film Company. The television series aired on CBS Kids for one season and later reaired on Nickelodeon. The show follows the adventures of Waldo and his dog Woof, who were already established stars of the Where's Waldo picture book series. The \"Where's Waldo?\" TV Show brought the gangly man in the striped shirt and ski cap to Saturday morning TV. The cartoon \"Where's Waldo?\" went beyond the books' original concept, giving the characters depth and giving reasons for their adventures. Waldo and his dog Woof travel to distant lands, solving mysteries and lending a helping hand wherever they could. With the help of his magic walking stick, Waldo could travel through space and time or travel to far off magical lands. Often sent by Wizard Whitebeard to help solve a puzzle, or mysteries, \"Where's Waldo\" was a 1/2 hour puzzle of clues and riddles. The evil Waldo lookalike Odlaw was the show's villain, constantly plotting to steal Waldo's magic stick. In each episode Odlaw would team up with the other villains from the far-off lands to help get the magic stick, while Waldo and Woof teamed up with other land's \"good-guys\" to help with their problems. Featured Crew Tom Ruegger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pat Musick Townsend Coleman Waldo (voice) Jim Cummings Narrator (voice) Maurice LaMarche Pat Fraley Full Cast & Crew Last Season Season 2 1992 | 4 Episodes Season 2 of Where's Waldo?: The Animated Series premiered on June  2, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Where's Waldo?: The Animated Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m, 25m Homepage  - Genres Action & Adventure Animation Comedy Family Keywords based on children's book waldo wally Content Score 93 Almost there... Top Contributors 15 Banana J 4 Jurginho t 3 tmdb42009110 w 2 whitetigerx8  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}