{"link": "https://www.themoviedb.org/tv/4418?language=en", "title": "Treasure Hunters", "resume": "Treasure Hunters is a reality television series on NBC and Global Television in which ten teams of three solve puzzles and complete challenges in hopes of solving the ultimate puzzle and winning the grand prize. Teams travel across the United States and Europe in search of seven \"artifacts\" which when assembled will \"lead to the key. Find the key, and find the treasure.\" The challenges and puzzles are spliced with American history, and the ultimate goal is to find a hidden treasure, leading the show to be compared on various occasions to the film National Treasure. The value of the treasure in the series was revealed on the season finale to be $3,000,000.\nThe two-hour premiere episode aired on June 18, 2006 and beginning June 26 the series moved to its regular Monday night timeslot. The season finale was broadcast live on August 21, 2006.\nThe Hunt is similar in format to The Amazing Race. Key differences include:\n⁕Teams consist of three members as opposed to The Amazing Race's usual two\n⁕The start location of each leg is not necessarily the end point of the previous leg\n⁕Teams start each leg at the same time; Amazing Race teams have staggered starts based on previous leg finish order", "rate": 80, "genre": ["Reality"], "cast": ["Laird Macintosh", "Melissa Witek", "Kristen Johnson", "Kaitlyn Christopher"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4418   Expand Treasure Hunters   (2006) User Score Overview Treasure Hunters is a reality television series on NBC and Global Television in which ten teams of three solve puzzles and complete challenges in hopes of solving the ultimate puzzle and winning the grand prize. Teams travel across the United States and Europe in search of seven \"artifacts\" which when assembled will \"lead to the key. Find the key, and find the treasure.\" The challenges and puzzles are spliced with American history, and the ultimate goal is to find a hidden treasure, leading the show to be compared on various occasions to the film National Treasure. The value of the treasure in the series was revealed on the season finale to be $3,000,000. The two-hour premiere episode aired on June 18, 2006 and beginning June 26 the series moved to its regular Monday night timeslot. The season finale was broadcast live on August 21, 2006. The Hunt is similar in format to The Amazing Race. Key differences include: ⁕Teams consist of three members as opposed to The Amazing Race's usual two ⁕The start location of each leg is not necessarily the end point of the previous leg ⁕Teams start each leg at the same time; Amazing Race teams have staggered starts based on previous leg finish order Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laird Macintosh Melissa Witek Kristen Johnson Kaitlyn Christopher Full Cast & Crew Last Season Season 1 2006 | 11 Episodes Season 1 of Treasure Hunters premiered on June 18, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Treasure Hunters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.nbc.com/Treasure_Hunters/ Genres Reality Keywords treasure competition artifact travel american history Content Score 86 Almost there... Top Contributors 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}