{"link": "https://www.themoviedb.org/tv/62110?language=en", "title": "Assassination Classroom", "resume": "The students of class 3-E have a mission: kill their teacher before graduation. He has already destroyed the moon, and has promised to destroy the Earth if he can not be killed within a year. But how can this class of misfits kill a tentacled monster, capable of reaching Mach 20 speed, who may be the best teacher any of them have ever had?", "rate": 76, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Jun Fukuyama", "Mai Fuchigami", "Lindsay Seidel", "Sonny Strait"], "character": ["Koro-sensei", "Shiota, Nagisa", "Shiota, Nagisa (English)", "Koro-sensei (English)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62110   Expand Assassination Classroom   (2015) User Score  Play Trailer Overview The students of class 3-E have a mission: kill their teacher before graduation. He has already destroyed the moon, and has promised to destroy the Earth if he can not be killed within a year. But how can this class of misfits kill a tentacled monster, capable of reaching Mach 20 speed, who may be the best teacher any of them have ever had? Featured Crew Yûsei Matsui Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Fukuyama Koro-sensei Mai Fuchigami Shiota, Nagisa Lindsay Seidel Shiota, Nagisa (English) Sonny Strait Koro-sensei (English) Full Cast & Crew Last Season Season 2 2016 | 25 Episodes Season 2 of Assassination Classroom premiered on January  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2014-10-05 The Seven Deadly Sins 7.9    2014-10-07 Yona of the Dawn 7.5    2011-04-16 Deadman Wonderland 7.1    2013-03-31 Date a Live 7.9    2012-10-04 BTOOOM! 6.3    2015-07-05 Charlotte 6.8    2015-07-06 Snow White with the Red Hair 7.5    2011-04-17 Blue Exorcist 7.7  Facts Original Name  暗殺教室 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.ansatsu-anime.com/ Genres Animation Comedy Action & Adventure Keywords underdog assassination classroom education teacher superhuman based on manga government agent shounen anime persistence death wish bad students wholesome Content Score 100 Yes! Looking good! Top Contributors l 33 lowerformoflife 19 AlphaFactory 10 sp1ti L 9 Law  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}