{"link": "https://www.themoviedb.org/tv/70082?language=en", "title": "Wishenpoof!", "resume": "Bianca is just like any other little girl, except for one teensy little thing. Bianca has Wish Magic, so she can make wishes come true. Whether she's at home in Wish World, at the Willow Tree with her fairy friends, or at school with her non-fairy friends, Bianca and her hilarious teddy bear sidekick Bob navigate day-to-day problems with a little help from Bianca's mom and of course, wish magic!", "rate": 0, "genre": ["Kids", "Family", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Addison Holley", "Hope Cassandra", "Scott McCord", "Katie Griffin"], "character": ["Bianca (voice)", "Bianca (singing voice)", "Bob the Bear (voice)", "Mom (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70082   Expand Wishenpoof!   (2015) User Score  Play Trailer Overview Bianca is just like any other little girl, except for one teensy little thing. Bianca has Wish Magic, so she can make wishes come true. Whether she's at home in Wish World, at the Willow Tree with her fairy friends, or at school with her non-fairy friends, Bianca and her hilarious teddy bear sidekick Bob navigate day-to-day problems with a little help from Bianca's mom and of course, wish magic! Featured Crew Angela Santomero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Addison Holley Bianca (voice) Hope Cassandra Bianca (singing voice) Scott McCord Bob the Bear (voice) Katie Griffin Mom (voice) Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Wishenpoof! premiered on August 14, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wishenpoof!. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  22m Homepage   https://www.amazon.com/dp/B00I3MOGF2 Genres Kids Family Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings w 4 weestewatt TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}