{"link": "https://www.themoviedb.org/tv/14432?language=en", "title": "American Gladiators", "resume": "American Gladiators is an American competition TV show that aired on NBC and Citytv in Canada. Hosted by Hulk Hogan and Laila Ali, the show matches amateur athletes against each other and the show's own \"gladiators\" in contests of strength, agility, and endurance. It is a remake of the original series of the same name which ran from 1989–1996, with elements of the UK version of the 1990s. The show is refereed by Al Kaplon, a former American League umpire, who can also be seen as the referee in Dodgeball: A True Underdog Story. Play-by-play narration is handled by Van Earl Wright.\nSeason 1 was taped at Sony Pictures Studios in Culver City, California. Beginning with Season 2, the show moved to the Los Angeles Sports Arena. It is produced by Reveille Productions and MGM Television.\nAmerican Gladiators premiered on Sunday, January 6, 2008; an average of 12 million people watched the two-hour premiere. All other Season 1 episodes aired Mondays at 8:00 ET/PT, except for the finale, which aired Sunday February 17, 2008 at 7:00 ET/PT. Season 2 premiered May 12, 2008, on NBC, with a two-hour episode. The two-hour Season 2 finale aired on August 4, 2008 at 8:00 ET/PT. While the final two-hour episode of Season 1 was devoted entirely to the finals, the Season 2 finale consisted of the third semifinal round followed by the finals.", "rate": 38, "genre": ["Reality"], "cast": ["Hulk Hogan", "Michael O'Hearn", "Matt Morgan", "Jamie Kovac", "Erin Toughill"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14432   Expand American Gladiators   (2008) User Score Overview American Gladiators is an American competition TV show that aired on NBC and Citytv in Canada. Hosted by Hulk Hogan and Laila Ali, the show matches amateur athletes against each other and the show's own \"gladiators\" in contests of strength, agility, and endurance. It is a remake of the original series of the same name which ran from 1989–1996, with elements of the UK version of the 1990s. The show is refereed by Al Kaplon, a former American League umpire, who can also be seen as the referee in Dodgeball: A True Underdog Story. Play-by-play narration is handled by Van Earl Wright. Season 1 was taped at Sony Pictures Studios in Culver City, California. Beginning with Season 2, the show moved to the Los Angeles Sports Arena. It is produced by Reveille Productions and MGM Television. American Gladiators premiered on Sunday, January 6, 2008; an average of 12 million people watched the two-hour premiere. All other Season 1 episodes aired Mondays at 8:00 ET/PT, except for the finale, which aired Sunday February 17, 2008 at 7:00 ET/PT. Season 2 premiered May 12, 2008, on NBC, with a two-hour episode. The two-hour Season 2 finale aired on August 4, 2008 at 8:00 ET/PT. While the final two-hour episode of Season 1 was devoted entirely to the finals, the Season 2 finale consisted of the third semifinal round followed by the finals. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hulk Hogan Michael O'Hearn Matt Morgan Jamie Kovac Erin Toughill Full Cast & Crew Last Season Season 2 2008 | 12 Episodes Season 2 of American Gladiators premiered on May 12, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2008-12-03 Man v. Food 6.7    2005-05-30 Hell's Kitchen 6.3    1969-09-26 The Brady Bunch 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/American_Gladiators/ Genres Reality Keywords competition endurance strength sports show Content Score 86 Almost there... Top Contributors 19 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}