{"link": "https://www.themoviedb.org/tv/65778?language=en", "title": "My Little Lover", "resume": "Shunichi Minami possesses good looks and does well academically in high school. Chiyomi Horikiri is a bright girl who likes dancing. They were childhood friends and also their first loves, but after Shunichi Minami’s father disappeared they hardly talk. On a storming night, Chiyomi Horikiri has an argument with her parents over her future course and leaves home. While trying to avoid the rain, Chiyomi Horikiri wishes that she go back to her childhood. Suddenly, Chiyomi becomes 15 cm. tall. Shunichi Minami happens to see tiny Chiyomi Horikiri. She tells him that she doesn't want anyone else to see her and Shunichi Minami takes her his home.", "rate": 63, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Taishi Nakagawa", "Maika Yamamoto", "Mirai Suzuki", "Erina Nakayama", "Moe Sasaki"], "character": ["Shunichi Minami", "Chiyomi Horikiri", "Riku Takagi", "Sayori Nomura", "Ami Mikimoto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65778   Expand My Little Lover   (2015) User Score Overview Shunichi Minami possesses good looks and does well academically in high school. Chiyomi Horikiri is a bright girl who likes dancing. They were childhood friends and also their first loves, but after Shunichi Minami’s father disappeared they hardly talk. On a storming night, Chiyomi Horikiri has an argument with her parents over her future course and leaves home. While trying to avoid the rain, Chiyomi Horikiri wishes that she go back to her childhood. Suddenly, Chiyomi becomes 15 cm. tall. Shunichi Minami happens to see tiny Chiyomi Horikiri. She tells him that she doesn't want anyone else to see her and Shunichi Minami takes her his home. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Taishi Nakagawa Shunichi Minami Maika Yamamoto Chiyomi Horikiri Mirai Suzuki Riku Takagi Erina Nakayama Sayori Nomura Moe Sasaki Ami Mikimoto Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of My Little Lover premiered on November 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2015-09-02 Atelier 7.2  Facts Original Name  南くんの恋人～my little lover Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.cinemart.co.jp/minami/ Genres Comedy Sci-Fi & Fantasy Keywords japan romance Content Score 86 Almost there... Top Contributors M 42 Maria180493 s 6 scorpion9 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}