{"link": "https://www.themoviedb.org/tv/61506?language=en", "title": "New Neighbours", "resume": "Peter (Daan Schuurmans) and Eva (Bracha van Doesburgh) a nice young couple, expecting their first child, buy a house in a suburban village. Before they get to move into their new home, they lose their baby girl. Eva has a hard time coping with her loss. Peter has mixed feelings. The baby wasn’t his to begin with.He’s infertile and hopes the chapter of having children has now come to an end. Then they meet their new neighbors Rebecca and Steve, a carefree outgoing couple, that helps them forget their pain. But are they really who they say they are?", "rate": 45, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61506   Expand New Neighbours   (2014) User Score  Play Trailer Overview Peter (Daan Schuurmans) and Eva (Bracha van Doesburgh) a nice young couple, expecting their first child, buy a house in a suburban village. Before they get to move into their new home, they lose their baby girl. Eva has a hard time coping with her loss. Peter has mixed feelings. The baby wasn’t his to begin with.He’s infertile and hopes the chapter of having children has now come to an end. Then they meet their new neighbors Rebecca and Steve, a carefree outgoing couple, that helps them forget their pain. But are they really who they say they are? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 3 2018 | 10 Episodes Season 3 of New Neighbours premiered on March  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on New Neighbours. You can help by rating TV shows you've seen. Facts Original Name  Nieuwe Buren Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  50m Homepage   http://www.rtl.nl/nieuwe-buren/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 12 Hollander_1908 d 8 digiredo 5 EveDemocracy 5 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}