{"link": "https://www.themoviedb.org/tv/62569?language=en", "title": "Go! Princess PreCure", "resume": "Go! Princess PreCure is set in a boarding junior high school, named Noble Gakuen (Noble Academy). The protagonist Haruka Haruno is a 13-year-old first year student. Her big dream is to be a princess someday, because she has admired a princess in the picture book she has kept since her childhood. One day she transforms into Cure Flora with \"Dress Up Key\" which Prince Kanata of Hope Kingdom gave her as a good luck charm when she was little. Then she also finds other PreCure girls in her school, 14-year-old Minami Kaidou as Cure Mermaid and 13-year-old Kirara Amanogawa as Cure Twinkle. As the Princess PreCure team, with two fairies Pafu and Aroma, they decide to fight against dark witch Disupia (or Despair) who hates all the dreams in the world and wants to turn them to despair.", "rate": 0, "genre": ["Kids", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62569   Expand Go! Princess PreCure   (2015) User Score Overview Go! Princess PreCure is set in a boarding junior high school, named Noble Gakuen (Noble Academy). The protagonist Haruka Haruno is a 13-year-old first year student. Her big dream is to be a princess someday, because she has admired a princess in the picture book she has kept since her childhood. One day she transforms into Cure Flora with \"Dress Up Key\" which Prince Kanata of Hope Kingdom gave her as a good luck charm when she was little. Then she also finds other PreCure girls in her school, 14-year-old Minami Kaidou as Cure Mermaid and 13-year-old Kirara Amanogawa as Cure Twinkle. As the Princess PreCure team, with two fairies Pafu and Aroma, they decide to fight against dark witch Disupia (or Despair) who hates all the dreams in the world and wants to turn them to despair. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2015 | 50 Episodes Season 1 of Go! Princess PreCure premiered on February  1, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Go! Princess PreCure. You can help by rating TV shows you've seen. Facts Original Name  Go! プリンセスプリキュア Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.toei-anim.co.jp/tv/princess_precure/ Genres Kids Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors n 20 naka 10 a4840639 TB 3 TMDb Bot m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}