{"link": "https://www.themoviedb.org/tv/55163?language=en", "title": "Nicolas Le Floch", "resume": "Paris, 1761. Brilliant young Parisian police commissioner Nicolas Le Floch works under Monsieur de Sartine, the Royal Lieutenant General of Police. Louis XV's kingdom is plagued by conspiracies and murders. With the help of his faithful subordinate Bourdeau, Nicolas solves mysterious disappearances and sorts out awkward scandals.", "rate": 75, "genre": ["Action", "Adventure", "Drama"], "cast": ["Jérôme Robart", "Mathias Mlekuz", "François Caron"], "character": ["Nicolas Le Floch", "Inspector Pierre Bourdeau", "Monsieur de Sartine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55163   Expand Nicolas Le Floch   (2008) User Score Overview Paris, 1761. Brilliant young Parisian police commissioner Nicolas Le Floch works under Monsieur de Sartine, the Royal Lieutenant General of Police. Louis XV's kingdom is plagued by conspiracies and murders. With the help of his faithful subordinate Bourdeau, Nicolas solves mysterious disappearances and sorts out awkward scandals. Featured Crew Hugues Pagan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jérôme Robart Nicolas Le Floch Mathias Mlekuz Inspector Pierre Bourdeau François Caron Monsieur de Sartine Full Cast & Crew Current Season Season 6 2017 | 2 Episodes Season 6 of Nicolas Le Floch premiered on December 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nicolas Le Floch. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  French Runtime  90m Homepage  - Genres Action & Adventure Drama Keywords mystery crime Content Score 50 Still needs a little work. Top Contributors 19 griffen 7 bratface 3 Oeuvre_Klika z 1 zeloise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}