{"link": "https://www.themoviedb.org/tv/64811?language=en", "title": "Jang Youngsil: The Greatest Scientist of Joseon", "resume": "Drama series follows the life Jang Yeong-Sil: a scientist, technician and inventor during the Joseon period. Jang Yeong-Sil was born in the lower class nobi. King Sejong notices his abilities and brings him to the palace. King Sejong grants him a chance to display his abilities. He invents tools like astronomical instruments, iron printing press and a water clock.", "rate": 58, "genre": ["Drama"], "cast": ["Song Il-gook", "Park Sun-young", "Kim Sang-kyung", "Kim Yeong-cheol"], "character": ["Jang Yeong-Sil", "Princess Sohyun", "King Sejong", "King Taejo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64811   Expand Jang Youngsil: The Greatest Scientist of Joseon   (2016) User Score Overview Drama series follows the life Jang Yeong-Sil: a scientist, technician and inventor during the Joseon period. Jang Yeong-Sil was born in the lower class nobi. King Sejong notices his abilities and brings him to the palace. King Sejong grants him a chance to display his abilities. He invents tools like astronomical instruments, iron printing press and a water clock. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Song Il-gook Jang Yeong-Sil Park Sun-young Princess Sohyun Kim Sang-kyung King Sejong Kim Yeong-cheol King Taejo Full Cast & Crew Last Season Season 1 2016 | 24 Episodes Season 1 of Jang Youngsil: The Greatest Scientist of Joseon premiered on January  2, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2010-03-22 Dong Yi 8.2  Facts Original Name  장영실 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/jys/ Genres Drama Keywords historical figure korea historical drama Content Score 86 Almost there... Top Contributors M 34 Maria180493 7 animerika z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}