{"link": "https://www.themoviedb.org/tv/71618?language=en", "title": "Aria the Scarlet Ammo AA", "resume": "In the world of Hidan no Aria AA, there are special students called Butei who are authorized to carry weapons, investigate crimes and solve various incidents. One of the best of these students is an S-rank second year at Tokyo Butei High School named Aria Kanzaki. On the opposite end of the scale is E-rank first year named Akari Mamiya.\nAkari absolutely idolizes Aria and wants to become an elite Butei just like her but sadly she just isn’t very good and constantly fails her rank exams. One day she gets the bright idea to submit a request to become Aria’s Amica (assistant), despite her friends telling her that she shouldn’t even bother due to the disparity in their skills. Surprisingly though, Aria decides to give Akari a test, which she not only accepts, but passes!\nIt won’t be easy for Akari though, as before she can officially become Aria’s Amica she’ll have to work hard until she proves her value. Will Akari’s dream ever come true or will she be forced to give up before she even has a chance to get started, and can Aria help this E-rank girl go from zero to hero?", "rate": 90, "genre": ["Action", "Adventure", "Animation"], "cast": ["Ayane Sakura", "Rie Kugimiya", "Kayano Ai", "Mao Ichimichi", "Aoi Yuki"], "character": ["Akari Mamiya (voice)", "Aria H. Kanzaki (voice)", "Shino Sasaki (voice)", "Raika Hino (voice)", "Kirin Shima (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71618   Expand Aria the Scarlet Ammo AA   (2015) User Score Overview In the world of Hidan no Aria AA, there are special students called Butei who are authorized to carry weapons, investigate crimes and solve various incidents. One of the best of these students is an S-rank second year at Tokyo Butei High School named Aria Kanzaki. On the opposite end of the scale is E-rank first year named Akari Mamiya. Akari absolutely idolizes Aria and wants to become an elite Butei just like her but sadly she just isn’t very good and constantly fails her rank exams. One day she gets the bright idea to submit a request to become Aria’s Amica (assistant), despite her friends telling her that she shouldn’t even bother due to the disparity in their skills. Surprisingly though, Aria decides to give Akari a test, which she not only accepts, but passes! It won’t be easy for Akari though, as before she can officially become Aria’s Amica she’ll have to work hard until she proves her value. Will Akari’s dream ever come true or will she be forced to give up before she even has a chance to get started, and can Aria help this E-rank girl go from zero to hero? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayane Sakura Akari Mamiya (voice) Rie Kugimiya Aria H. Kanzaki (voice) Kayano Ai Shino Sasaki (voice) Mao Ichimichi Raika Hino (voice) Aoi Yuki Kirin Shima (voice) Full Cast & Crew Last Season Season 1 2015 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Aria the Scarlet Ammo AA. You can help by rating TV shows you've seen. Facts Original Name  緋弾のアリアAA(ダブルエー) Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 33 stevieg333 7 seboseboss m 3 magoozin 1 Resune  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}