{"link": "https://www.themoviedb.org/tv/48139?language=en", "title": "Swordsman", "resume": "Swordsman is a Chinese television series adapted from Louis Cha's novel The Smiling, Proud Wanderer. The series is written and produced by Yu Zheng, and directed by Hu Yijuan, starring Wallace Huo and Yuan Shanshan in the leading roles. Shooting started on 24 March 2012 in Xiandu, Jinyun County, Lishui, Zhejiang. It was aired in China on Hunan Television from 6 February to 4 March 2013.", "rate": 40, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Joe Chen", "Wallace Huo", "Yang Rong", "Heizi", "Dicky Cheung Wai-Kin"], "character": ["Dongfang Bubai", "Linghu Chong", "Yue Lingshan", "Ren Woxing"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48139   Expand Swordsman   (2013) User Score Overview Swordsman is a Chinese television series adapted from Louis Cha's novel The Smiling, Proud Wanderer. The series is written and produced by Yu Zheng, and directed by Hu Yijuan, starring Wallace Huo and Yuan Shanshan in the leading roles. Shooting started on 24 March 2012 in Xiandu, Jinyun County, Lishui, Zhejiang. It was aired in China on Hunan Television from 6 February to 4 March 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Chen Dongfang Bubai Wallace Huo Linghu Chong Yang Rong Yue Lingshan Heizi Ren Woxing Dicky Cheung Wai-Kin Full Cast & Crew Last Season (2013) season 1 2013 | 56 Episodes Season 1 of Swordsman premiered on February  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Swordsman. You can help by rating TV shows you've seen. Facts Original Name  笑傲江湖 Status  Ended Network Hunan Broadcasting System Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Drama Sci-Fi & Fantasy Keywords wuxia Content Score 86 Almost there... Top Contributors 12 thirstyhippo N 3 Nosirus 3 lemonlyman A 2 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}