{"link": "https://www.themoviedb.org/tv/4652?language=en", "title": "Dr. Phil", "resume": "Using the power of television, Dr. Phil McGraw presents compelling stories about real people with a variety of emotional and behavioral problems, stripping away the shame and embarrassment that too often keep people from seeking help. Its a show that is suppose to help people with their problems and to find a solution on live TV .", "rate": 32, "genre": ["Talk"], "cast": ["Phil McGraw"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4652   Expand Dr. Phil   (2002) User Score  Play Trailer Overview Using the power of television, Dr. Phil McGraw presents compelling stories about real people with a variety of emotional and behavioral problems, stripping away the shame and embarrassment that too often keep people from seeking help. Its a show that is suppose to help people with their problems and to find a solution on live TV . Featured Crew Oprah Winfrey Creator Phil McGraw Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil McGraw Himself Full Cast & Crew Last Season Season 16 2017 | 123 Episodes Season 16 of Dr. Phil premiered on September 12, 2017. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply b Adopted girl Open 0 by bgirlmagic\n      \n     b Guests Open 0 by bgirlmagic\n      \n     w Dr. Phil: Happy Birthday Phil McGraw! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1991-09-30 The Jerry Springer Show 3.1    The Oprah Winfrey Show 4.1    2003-12-03 Extreme Makeover: Home Edition 4.6    2014-12-02 Late Night with Seth Meyers 5.6    1996-09-28 Psi Factor: Chronicles of the Paranormal 6.3    2002-01-08 Last Call with Carson Daly 2.2    2005-08-07 The Girls Next Door 6.1    2004-01-08 The Celebrity Apprentice 4.2  Facts Status  Returning Series Network Broadcast Syndication Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Talk Show Original Language  English Runtime  60m Homepage   http://www.drphil.com/ Genres Talk Keywords talk show mental health mental disorders behavioral disorders Content Score 71 Just a little bit more... Top Contributors b 62 basher 17 szab 15 Banana D 12 Damienlee69  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}