{"link": "https://www.themoviedb.org/tv/65942?language=en", "title": "Re:ZERO -Starting Life in Another World-", "resume": "Natsuki Subaru, an ordinary high school  student, is on his way home from the convenience store when he finds  himself transported to another world. As he's lost and confused in a new  world where he doesn't even know left from right, the only person to  reach out to him was a beautiful girl with silver hair. Determined to  repay her somehow for saving him from his own despair, Subaru agrees to  help the girl find something she's looking for.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Yuusuke Kobayashi", "Rie Takahashi", "Yumi Uchiyama", "Chinatsu Akasaki", "Yuichi Nakamura"], "character": ["Subaru Natsuki (voice)", "Emilia (voice)", "Pack (voice)", "Felt (voice)", "Reinhard Van Astrea (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65942   Expand Re:ZERO -Starting Life in Another World-   (2016) User Score  Play Trailer Overview Natsuki Subaru, an ordinary high school  student, is on his way home from the convenience store when he finds  himself transported to another world. As he's lost and confused in a new  world where he doesn't even know left from right, the only person to  reach out to him was a beautiful girl with silver hair. Determined to  repay her somehow for saving him from his own despair, Subaru agrees to  help the girl find something she's looking for. Featured Crew Tappei Nagatsuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuusuke Kobayashi Subaru Natsuki (voice) Rie Takahashi Emilia (voice) Yumi Uchiyama Pack (voice) Chinatsu Akasaki Felt (voice) Yuichi Nakamura Reinhard Van Astrea (voice) Full Cast & Crew Last Season Season 1 2016 | 25 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Re:ZERO -Starting Life in Another World-. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2015-07-12 God Eater 6.4    2015-07-04 GATE 7.2    2016-04-09 Kiznaiver 6.9    2014-01-05 Noragami 7.4    2016-04-08 Kabaneri of the Iron Fortress 6.4    2015-07-05 Rokka: Braves of the Six Flowers 5.9    2015-10-07 Beautiful Bones: Sakurako’s Investigation 6.3    2016-01-08 ERASED 7.8  Facts Original Name  Re：ゼロから始める異世界生活 Status  Ended Network Certification 18 Meaning Content suitable for viewers over the age of 18. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://re-zero-anime.jp/ Genres Action & Adventure Animation Comedy Drama Sci-Fi & Fantasy Keywords fantasy magic supernatural time travel tragedy time loop parallel world death medieval based on light novel anime butterfly effect Content Score 100 Yes! Looking good! Top Contributors 66 RubeensVinicius 34 Marr 🇳🇱 26 sp1ti 22 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}