{"link": "https://www.themoviedb.org/tv/71366?language=en", "title": "JFK Declassified: Tracking Oswald", "resume": "Follows former CIA agent, Bob Baer and former LAPD police lieutenant, Adam Bercovici, on their independent global investigation into Lee Harvey Oswald, and the murder of JFK, asking the questions: did he have accomplices, and if so, who helped him assassinate the President?", "rate": 90, "genre": ["Documentary", "Drama"], "cast": ["Rory Ross"], "character": ["Lee Harvey Oswald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71366   Expand JFK Declassified: Tracking Oswald   (2017) User Score  Play Trailer Overview Follows former CIA agent, Bob Baer and former LAPD police lieutenant, Adam Bercovici, on their independent global investigation into Lee Harvey Oswald, and the murder of JFK, asking the questions: did he have accomplices, and if so, who helped him assassinate the President? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rory Ross Lee Harvey Oswald Full Cast & Crew Current Season Season 1 2017 | 7 Episodes Season 1 of JFK Declassified: Tracking Oswald premiered on November  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on JFK Declassified: Tracking Oswald. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  43m Homepage   http://www.history.com/shows/jfk-declassified-tracking-oswald Genres Documentary Drama Keywords docudrama kennedy assassination Content Score 64 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings 5 Banana TB 5 TMDb Bot m 4 mfabio84  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}