{"link": "https://www.themoviedb.org/tv/61923?language=en", "title": "Star vs. the Forces of Evil", "resume": "Intergalactic warrior Star Butterfly arrives on Earth to live with the Diaz family. She continues to battle villains throughout the universe and high school, mainly to protect her extremely powerful wand, an object that still confuses her.", "rate": 84, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Adam McArthur", "Eden Sher", "Grey DeLisle", "Artt Butler"], "character": ["Marco Diaz", "Star Butterfly", "Queen Butterfly", "Mr. Diaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61923   Expand Star vs. the Forces of Evil   (2015) User Score Overview Intergalactic warrior Star Butterfly arrives on Earth to live with the Diaz family. She continues to battle villains throughout the universe and high school, mainly to protect her extremely powerful wand, an object that still confuses her. Featured Crew Daron Nefcy Creator Jordana Arkin Creator Dave Wasson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Adam McArthur Marco Diaz Eden Sher Star Butterfly Grey DeLisle Queen Butterfly Artt Butler Mr. Diaz Full Cast & Crew Last Season Season 3 2017 | 34 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Season 3 is very Anime Open 0 by Dali Parton\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  3 Recommendations   2015-08-24 We Bare Bears 7.2    2013-09-13 Wander Over Yonder 8.1    2012-06-15 Gravity Falls 8.2    2015-10-19 Miraculous: Tales of Ladybug & Cat Noir 8.1    2013-11-04 Steven Universe 7.1    2016-10-03 Milo Murphy’s Law 7.5    2013-07-21 Axe Cop 5.5    2011-05-03 The Amazing World of Gumball 7.7  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   http://watchdisneyxd.go.com/star-vs-the-forces-of-evil Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords princess magic multiple dimensions Content Score 100 Yes! Looking good! Top Contributors 26 Banana 17 Elizabeth Jennings 10 Dsnake1 10 bgiesing  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}