{"link": "https://www.themoviedb.org/tv/1908?language=en", "title": "Miami Vice", "resume": "The story of the Miami Police Department's vice squad and its efforts to end drug trafficking and prostitution, centered on the unlikely partnership of Sonny Crockett and Ricardo Tubbs - who first meet when Tubbs is undercover in a drug cartel.", "rate": 72, "genre": ["Crime", "Drama"], "cast": ["Don Johnson", "Philip Michael Thomas", "Saundra Santiago", "Olivia Brown", "Michael Talbott"], "character": ["Detective James Crockett", "Detective Ricardo Tubbs", "Detective Gina Calabrese", "Detective Trudy Joplin", "Detective Stan Switek"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1908   Expand Miami Vice   (1984) User Score  Play Trailer Overview The story of the Miami Police Department's vice squad and its efforts to end drug trafficking and prostitution, centered on the unlikely partnership of Sonny Crockett and Ricardo Tubbs - who first meet when Tubbs is undercover in a drug cartel. Featured Crew Anthony Yerkovich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  12 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Johnson Detective James Crockett Philip Michael Thomas Detective Ricardo Tubbs Saundra Santiago Detective Gina Calabrese Olivia Brown Detective Trudy Joplin Michael Talbott Detective Stan Switek Full Cast & Crew Last Season Season 5 1988 | 22 Episodes Season 5 of Miami Vice premiered on November  4, 1988. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply of its time Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  3 Recommendations   1980-12-11 Magnum, P.I. 7.1    1976-03-21 Charlie's Angels 5.9    1982-09-26 Knight Rider 6.5    1985-09-29 MacGyver 7.3    1985-03-03 Moonlighting 7.2    1983-01-23 The A-Team 6.9    1978-04-02 Dallas 6.1    1989-04-23 Baywatch 5.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   https://www.nbc.com/miami-vice Genres Crime Drama Keywords miami undercover agent police detective Content Score 100 Yes! Looking good! Top Contributors 82 Steve 15 Banana 10 Elizabeth Jennings J 5 JochenHD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}