{"link": "https://www.themoviedb.org/tv/23652?language=en", "title": "The Banana Splits Adventure Hour", "resume": "The Banana Splits Adventure Hour was an hour-long, packaged television variety program featuring The Banana Splits, a fictional rock band composed of four funny animal characters. The series was produced by Hanna-Barbera, and ran for 31 episodes on NBC Saturday mornings, from September 7, 1968, to September 5, 1970.", "rate": 86, "genre": ["Family", "Animation"], "cast": ["Paul Winchell", "Don Messick", "Daws Butler", "Robert Towers", "Allan Melvin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23652   Expand The Banana Splits Adventure Hour   (1968) User Score Overview The Banana Splits Adventure Hour was an hour-long, packaged television variety program featuring The Banana Splits, a fictional rock band composed of four funny animal characters. The series was produced by Hanna-Barbera, and ran for 31 episodes on NBC Saturday mornings, from September 7, 1968, to September 5, 1970.  Featured Crew Marty Krofft Creator Sid Krofft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Winchell Don Messick Daws Butler Robert Towers Allan Melvin Full Cast & Crew Last Season Season 2 1969 | 18 Episodes Season 2 of The Banana Splits Adventure Hour premiered on September  6, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1967-01-03 Trumpton 8.8    1966-01-03 Camberwick Green 8.3    1974-09-07 Hong Kong Phooey 6.1    1975-01-02 The Sweeney 6.4    2003-05-21 Birds of Prey 6.0    1981-11-24 Simon & Simon 6.6    1968-09-14 Wacky Races 7.1    1976-01-14 The Bionic Woman 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Family Animation Keywords rock band package show Content Score 93 Almost there... Top Contributors 14 Banana TB 2 TMDb Bot 1 MaxdMerc  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}