{"link": "https://www.themoviedb.org/tv/69217?language=en", "title": "The Comic Artist and His Assistants", "resume": "With beautiful assistant Sahoto Ashisu aside, mangaka (and cherry boy) Yūki Aito can hardly concentrate on his works, forcing his managing editior Mihari Otosuna to push him (physically) meeting the deadline. With new busty but ditsy Rinna Fuwa and skilled but money-loving Sena Kuroi joining the assistant pool, Yūki's life is more like a harem than a manga studio.", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Arisa Noto", "Yoshitsugu Matsuoka", "Saori Hayami", "Yuka Iguchi", "Rie Kugimiya"], "character": ["Mihari Otosuna (voice)", "Yuoki Aito (voice)", "Sahoto Ashisu (voice)", "Rinna Fuwa (voice)", "Sena Kuroi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69217   Expand The Comic Artist and His Assistants   (2014) User Score Overview With beautiful assistant Sahoto Ashisu aside, mangaka (and cherry boy) Yūki Aito can hardly concentrate on his works, forcing his managing editior Mihari Otosuna to push him (physically) meeting the deadline. With new busty but ditsy Rinna Fuwa and skilled but money-loving Sena Kuroi joining the assistant pool, Yūki's life is more like a harem than a manga studio. Featured Crew Takeshi Furuta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arisa Noto Mihari Otosuna (voice) Yoshitsugu Matsuoka Yuoki Aito (voice) Saori Hayami Sahoto Ashisu (voice) Yuka Iguchi Rinna Fuwa (voice) Rie Kugimiya Sena Kuroi (voice) Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of The Comic Artist and His Assistants premiered on April  8, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Comic Artist and His Assistants. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Comic Artist and His Assistants. You can help by rating TV shows you've seen. Facts Original Name  マンガ家さんとアシスタントさんと Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  13m Homepage   http://mangakasan.tv/ Genres Animation Comedy Keywords harem slice of life based on manga seinen ecchi anime Content Score 93 Almost there... Top Contributors 26 CrewMdk t 18 tmdb62726470 11 Elizabeth Jennings 5 meticeo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}