{"link": "https://www.themoviedb.org/tv/76805?language=en", "title": "Super Junior's Super TV", "resume": "Super TV is a show that twists all of variety show formats in the world and presents them in Super Junior’s own way. This format is called Super Junior Crazy Idol Variety (슈퍼주니어 i돌아이어티). The show's format will include quiz show, talk show, game show, eating show, reality, documentary, sports, film and comedy", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76805   Expand Super Junior's Super TV   (2018) User Score Overview Super TV is a show that twists all of variety show formats in the world and presents them in Super Junior’s own way. This format is called Super Junior Crazy Idol Variety (슈퍼주니어 i돌아이어티). The show's format will include quiz show, talk show, game show, eating show, reality, documentary, sports, film and comedy Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 11 Episodes Season 1 of Super Junior's Super TV premiered on February 26, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Super Junior's Super TV. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors a 3 afofrancis 2 adamsp09 H 1 Herdas n 1 nubie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}