{"link": "https://www.themoviedb.org/tv/5877?language=en", "title": "Pandora's Box", "resume": "Pandora's Box, subtitled \"A fable from the age of science\", is a six-part 1992 BBC documentary television series written and produced by Adam Curtis, which examines the consequences of political and technocratic rationalism.\nThe episodes deal, in order, with communism in The Soviet Union, systems analysis and game theory during the Cold War, economy in the United Kingdom during the 1970s, the insecticide DDT, Kwame Nkrumah's leadership in Ghana during the 1950s and 1960s and the history of nuclear power.", "rate": 90, "genre": ["Documentary"], "cast": ["Adam Curtis"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5877   Expand Pandora's Box   (1992) User Score Overview Pandora's Box, subtitled \"A fable from the age of science\", is a six-part 1992 BBC documentary television series written and produced by Adam Curtis, which examines the consequences of political and technocratic rationalism. The episodes deal, in order, with communism in The Soviet Union, systems analysis and game theory during the Cold War, economy in the United Kingdom during the 1970s, the insecticide DDT, Kwame Nkrumah's leadership in Ghana during the 1950s and 1960s and the history of nuclear power. Featured Crew Adam Curtis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Curtis Narrator Full Cast & Crew Last Season Season 1 1992 | 6 Episodes Season 1 of Pandora's Box premiered on June 11, 1992. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Pandora's Box. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations   1995-03-15 The Living Dead 7.5    2007-03-11 The Trap: What Happened to Our Dream of Freedom 0.0    2004-10-20 The Power of Nightmares 8.2    2002-03-17 The Century of the Self 8.2    1987-09-28 Star Trek: The Next Generation 8.2    2003-12-08 Battlestar Galactica 8.3    1999-03-28 Futurama 8.2    2002-06-02 The Wire 8.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  45m Homepage  - Genres Documentary Keywords politics society cold war scientific study power independent film miniseries economics science technocracy rationalism Content Score 50 Still needs a little work. Top Contributors 30 Bryan Bortz R 8 Rebecca TB 7 TMDb Bot k 6 kanzen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}