{"link": "https://www.themoviedb.org/tv/63246?language=en", "title": "I Order You", "resume": "Yeo Gook Dae is a talented chef who is sassy and considerate but heartbroken in the past since his divorce. His heart later on gets healed when he falls in love again. 28-year-old Park Song Ah is idling at home after quitting her job. She goes to a homemade dosirak (lunchbox) shop as her brother’s request and meets three attractive men there. The pretty and delicious food that they make touch her, and she gets her heart stolen by one of them. A cute funny story about a couple who bicker constantly but their relationship gradually blossoms into pure innocent love.", "rate": 55, "genre": ["Comedy"], "cast": ["U-Know Yunho", "Kim Ga-eun", "Jang Seung-jo", "Jo Yoon-woo"], "character": ["Yeo Gook-dae", "Park Song-ah", "Kevin", "Nam Soo-ri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63246   Expand I Order You   (2015) User Score Overview Yeo Gook Dae is a talented chef who is sassy and considerate but heartbroken in the past since his divorce. His heart later on gets healed when he falls in love again. 28-year-old Park Song Ah is idling at home after quitting her job. She goes to a homemade dosirak (lunchbox) shop as her brother’s request and meets three attractive men there. The pretty and delicious food that they make touch her, and she gets her heart stolen by one of them. A cute funny story about a couple who bicker constantly but their relationship gradually blossoms into pure innocent love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast U-Know Yunho Yeo Gook-dae Kim Ga-eun Park Song-ah Jang Seung-jo Kevin Jo Yoon-woo Nam Soo-ri Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of I Order You premiered on July  6, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I Order You. You can help by rating TV shows you've seen. Facts Original Name  당신을주문합니다 Status  Ended Networks SBS Plus Certification  - Type  Scripted Original Language  Korean Runtime  25m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000008111 Genres Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 33 Maria180493 5 Elizabeth Jennings z 5 zurman1 s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}