{"link": "https://www.themoviedb.org/tv/54244?language=en", "title": "Heartless City", "resume": "Nam Gyu Ri sizzles and sways in this noir thriller about getting in too deep. When her best friend suffers a brutal fate while undercover in the crime underworld, Han Soo Min is driven to pick up where her friend left off. But in the shadows, there are no rules and no reason: Soo Min falls for the organization’s king pin, who also happens to be the prime suspect of her friend’s murder. With a betrayal at every corner, can Soo Min afford to trust the unjust? As with all things noir, expect seduction, femme fatales and mystery!", "rate": 82, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Jung Kyung-ho", "Nam Gyu-ri", "Lee Jae-yoon", "Son Chang-min", "Yoon Hyun-min"], "character": ["Jung Shi-hyun", "Yoon Soo-min", "Ji Hyung-min", "Min Hong-ki", "Kim Hyun-soo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54244   Expand Heartless City   (2013) User Score Overview Nam Gyu Ri sizzles and sways in this noir thriller about getting in too deep. When her best friend suffers a brutal fate while undercover in the crime underworld, Han Soo Min is driven to pick up where her friend left off. But in the shadows, there are no rules and no reason: Soo Min falls for the organization’s king pin, who also happens to be the prime suspect of her friend’s murder. With a betrayal at every corner, can Soo Min afford to trust the unjust? As with all things noir, expect seduction, femme fatales and mystery!  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Kyung-ho Jung Shi-hyun Nam Gyu-ri Yoon Soo-min Lee Jae-yoon Ji Hyung-min Son Chang-min Min Hong-ki Yoon Hyun-min Kim Hyun-soo Full Cast & Crew Last Season Season 1 2013 | 20 Episodes Season 1 of Heartless City premiered on May 27, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2013-08-05 Good Doctor 8.6    2014-12-08 Healer 8.7    2015-01-07 Kill Me, Heal Me 8.7  Facts Original Name  무정도시 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://drama.jtbc.joins.com/moojeong/ Genres Action & Adventure Crime Drama Keywords korea Content Score 86 Almost there... Top Contributors M 32 Maria180493 CM 12 Cherche Moi 3 A2756 2 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}