{"link": "https://www.themoviedb.org/tv/11118?language=en", "title": "The Paul Hogan Show", "resume": "The Paul Hogan Show is a popular Australian comedy show which aired on Australian television from 1973 until 1984. It made a star of Paul Hogan, who later appeared in \"Crocodile\" Dundee. Hogan's friend John Cornell also appeared in the show, playing Hogan's dim flatmate Strop. The show also aired on the New York Tri-State area television WWOR channel 9, in the early 1980s.\nEpisodes of the series generally opened with Hogan, playing a version of himself he called 'Hoges', presenting a stand-up comedy routine dressed in his bridge rigger's costume of boots, shorts, and shirt with sleeves cut off. The show then presented a series of comedy sketches, usually with Hogan in the lead role and playing various recurring characters, these include:\n⁕Leo Wanker: an inept daredevil stuntman;\n⁕George Fungus: a take-off of real-life television journalist George Negus of the Australian 60 Minutes;\n⁕Super Dag: an ocker superhero complete with terry-towelling hat and zinc-creamed nose. His powers include his ability to use his esky in innovative ways;\n⁕Perce the Wino: an old drunken derro who starred in a series of silent, Benny Hill-style, sketches;\n⁕Donger: variants of this beer-gutted character include Sgt Donger, the tough cop with a bionic beer-gut, and Arthur Dunger, a caricature of the suburban tinny-chugging Australian male.", "rate": 85, "genre": ["Comedy"], "cast": ["Paul Hogan", "John Cornell"], "character": ["Various", "Strop"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11118   Expand The Paul Hogan Show   (1973) User Score Overview The Paul Hogan Show is a popular Australian comedy show which aired on Australian television from 1973 until 1984. It made a star of Paul Hogan, who later appeared in \"Crocodile\" Dundee. Hogan's friend John Cornell also appeared in the show, playing Hogan's dim flatmate Strop. The show also aired on the New York Tri-State area television WWOR channel 9, in the early 1980s. Episodes of the series generally opened with Hogan, playing a version of himself he called 'Hoges', presenting a stand-up comedy routine dressed in his bridge rigger's costume of boots, shorts, and shirt with sleeves cut off. The show then presented a series of comedy sketches, usually with Hogan in the lead role and playing various recurring characters, these include: ⁕Leo Wanker: an inept daredevil stuntman; ⁕George Fungus: a take-off of real-life television journalist George Negus of the Australian 60 Minutes; ⁕Super Dag: an ocker superhero complete with terry-towelling hat and zinc-creamed nose. His powers include his ability to use his esky in innovative ways; ⁕Perce the Wino: an old drunken derro who starred in a series of silent, Benny Hill-style, sketches; ⁕Donger: variants of this beer-gutted character include Sgt Donger, the tough cop with a bionic beer-gut, and Arthur Dunger, a caricature of the suburban tinny-chugging Australian male. Featured Crew Paul Hogan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Hogan Various John Cornell Strop Full Cast & Crew Last Season Season 1 1973 | 1 Episode Season 1 of The Paul Hogan Show premiered on November  4, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1968-02-05 Skippy the Bush Kangaroo 4.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 9 OzDrDj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}