{"link": "https://www.themoviedb.org/tv/31857?language=en", "title": "Tracy Beaker Returns", "resume": "Tracy Beaker Returns is a BAFTA-winning British children's television series, which premiered on 8 January 2010 on CBBC and BBC HD. Based upon the novels by Jacqueline Wilson, it is the spin-off series to The Story of Tracy Beaker. The series stars Dani Harmer as protagonist Tracy Beaker. The final third series ended on 23 March 2012. The series will continue as The Dumping Ground which started airing on 4 January 2013.", "rate": 83, "genre": [], "cast": ["Dani Harmer", "Lisa Coleman", "Connor Byrne", "Richard Wisker", "Noah Marullo"], "character": ["Tracy Beaker", "Cam Lawson", "Mike Milligan", "Liam O'Donovan", "Gus Carmichael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31857   Expand Tracy Beaker Returns   (2010) User Score Overview Tracy Beaker Returns is a BAFTA-winning British children's television series, which premiered on 8 January 2010 on CBBC and BBC HD. Based upon the novels by Jacqueline Wilson, it is the spin-off series to The Story of Tracy Beaker. The series stars Dani Harmer as protagonist Tracy Beaker. The final third series ended on 23 March 2012. The series will continue as The Dumping Ground which started airing on 4 January 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dani Harmer Tracy Beaker Lisa Coleman Cam Lawson Connor Byrne Mike Milligan Richard Wisker Liam O'Donovan Noah Marullo Gus Carmichael Full Cast & Crew Last Season Season 3 2012 | 13 Episodes Season 3 of Tracy Beaker Returns premiered on January  6, 2012. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply w Sapphire: Happy Birthday Saffron Coomber! Open 0 by wonder2wonder\n      \n     w Toby: Happy Birthday John Bell! Open 0 by wonder2wonder\n      \n     w Carmen: Happy Birthday Amy-Leigh Hickman! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2013-01-04 The Dumping Ground 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 28m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors w 14 wonder2wonder TB 1 TMDb Bot 1 Banana m 1 mdkFL  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}