{"link": "https://www.themoviedb.org/tv/31021?language=en", "title": "Big Brother", "resume": "Croatian version of the reality show in which a number of contestants live in an isolated house trying to avoid being evicted by the public with the aim of winning a large cash prize at the end of the run.", "rate": 100, "genre": ["Reality"], "cast": ["Antonija Blaće"], "character": ["Herself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31021   Expand Big Brother   (2004) User Score  Play Trailer Overview Croatian version of the reality show in which a number of contestants live in an isolated house trying to avoid being evicted by the public with the aim of winning a large cash prize at the end of the run. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  6 Featurettes  0 Opening Credits  0 Top Billed Cast Antonija Blaće Herself - Presenter Full Cast & Crew Current Season Season 9 2018 | 1 Episode Season 9 of Big Brother premiered on January 27, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  7 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Big Brother. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Reality Original Language  Croatian Runtime  130m Homepage   http://bigbrother.rtl.hr Genres Reality Keywords big brother Content Score 64 We're so close, yet so far. Top Contributors 105 imjakedeason 21 Elizabeth Jennings TB 5 TMDb Bot D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}