{"link": "https://www.themoviedb.org/tv/112?language=en", "title": "The Armando Iannucci Shows", "resume": "The Armando Iannucci Shows is a series of eight programmes directed by Armando Iannucci and written by Iannucci with Andy Riley and Kevin Cecil. It was shown on UK's Channel 4 from September to October 2001. Each episode focused on specific themes relating to human nature and existentialism, around which Iannucci would weave a series of surreal sketches and monologues.\nRecurring themes in the episodes are the superficiality of modern culture, our problems communicating with each other, the mundane nature of working life and feelings of personal inadequacy and social awkwardness. Several characters also make repeat appearances in the shows, including the East End thug, who solves every problem with threats of violence; Hugh, an old man who delivers surreal monologues about what things were like in the old days; and Iannucci's barber, who is full of nonsensical anecdotes.\nIannucci has been quoted as saying it is the comedy series he is most proud of making. He told The Metro in April 2007 \"The Armando Iannucci Show [sic] on Channel 4 came out around 9/11, so it was overlooked for good reasons. People had other things on their minds. But that was the closest to me expressing my comic outlook on life.\"", "rate": 78, "genre": ["Comedy"], "cast": ["Armando Iannucci", "Stephen Mangan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 112   Expand The Armando Iannucci Shows   (2001) User Score Overview The Armando Iannucci Shows is a series of eight programmes directed by Armando Iannucci and written by Iannucci with Andy Riley and Kevin Cecil. It was shown on UK's Channel 4 from September to October 2001. Each episode focused on specific themes relating to human nature and existentialism, around which Iannucci would weave a series of surreal sketches and monologues. Recurring themes in the episodes are the superficiality of modern culture, our problems communicating with each other, the mundane nature of working life and feelings of personal inadequacy and social awkwardness. Several characters also make repeat appearances in the shows, including the East End thug, who solves every problem with threats of violence; Hugh, an old man who delivers surreal monologues about what things were like in the old days; and Iannucci's barber, who is full of nonsensical anecdotes. Iannucci has been quoted as saying it is the comedy series he is most proud of making. He told The Metro in April 2007 \"The Armando Iannucci Show [sic] on Channel 4 came out around 9/11, so it was overlooked for good reasons. People had other things on their minds. But that was the closest to me expressing my comic outlook on life.\" Featured Crew Armando Iannucci Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Armando Iannucci Stephen Mangan Full Cast & Crew Last Season Season 1 2001 | 8 Episodes Season 1 of The Armando Iannucci Shows premiered on August 30, 2001. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Village Sniper 👅 Open 0 by The Midi-chlorian Count\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2005-02-11 Nathan Barley 7.9    2005-05-19 The Thick of It 8.0    2004-09-03 Green Wing 8.0    1999-09-24 Spaced 8.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords surreal sketch comedy british humour Content Score 64 We're so close, yet so far. Top Contributors O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}