{"link": "https://www.themoviedb.org/tv/58811?language=en", "title": "Helix", "resume": "Helix is an intense thriller about a team of scientists from the Centers for Disease Control who travel to a high-tech research facility in the Arctic to investigate a possible disease outbreak, only to find themselves pulled into a terrifying life-and-death struggle that holds the key to mankind's salvation...or total annihilation.", "rate": 65, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Billy Campbell", "Jordan Hayes", "Neil Napier", "Kyra Zagorsky", "Steven Weber"], "character": ["Dr. Alan Farragut", "Dr. Sarah Jordan", "Dr. Peter Farragut", "Dr. Julia Walker", "Brother Michael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58811   Expand Helix   (2014) User Score  Play Trailer Overview Helix is an intense thriller about a team of scientists from the Centers for Disease Control who travel to a high-tech research facility in the Arctic to investigate a possible disease outbreak, only to find themselves pulled into a terrifying life-and-death struggle that holds the key to mankind's salvation...or total annihilation. Featured Crew Ronald D. Moore Creator Cameron Porsandeh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  18 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy Campbell Dr. Alan Farragut Jordan Hayes Dr. Sarah Jordan Neil Napier Dr. Peter Farragut Kyra Zagorsky Dr. Julia Walker Steven Weber Brother Michael Full Cast & Crew Last Season Season 2 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Season 1 vs Season 2. Spoilers Open 0 by write2topcat\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  18 Posters  14 Recommendations   2014-06-19 Dominion 5.9    2013-11-17 Almost Human 7.0    2014-07-09 Extant 6.1    2013-04-15 Defiance 6.2    2013-10-09 The Tomorrow People 6.6    2012-09-17 Revolution 6.0    2012-05-27 Continuum 7.1    2014-07-13 The Strain 6.6  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.syfy.com/helix Genres Drama Sci-Fi & Fantasy Keywords immortality outbreak survival disease scientist virus research facility Content Score 100 Yes! Looking good! Top Contributors 51 Travis Bell 43 Elizabeth Jennings r 19 risto.ott x 9 xgharibyan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}