{"link": "https://www.themoviedb.org/tv/68467?language=en", "title": "3%", "resume": "In a future where the elite inhabit an island paradise far from the crowded slums, you get one chance to join the 3% saved from squalor.", "rate": 73, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["João Miguel", "Bianca Comparato", "Michel Gomes", "Vaneza Oliveira", "Rodolfo Valente"], "character": ["Ezequiel", "Michele", "Fernando", "Joana", "Rafael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68467   Expand 3%   (2016) User Score  Play Trailer Overview In a future where the elite inhabit an island paradise far from the crowded slums, you get one chance to join the 3% saved from squalor. Featured Crew Pedro Aguilera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast João Miguel Ezequiel Bianca Comparato Michele Michel Gomes Fernando Vaneza Oliveira Joana Rodolfo Valente Rafael Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of 3% premiered on April 27, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply a Does anyone know if there will be a season two? Open 1 by  Simon Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  6 Recommendations   2006-10-10 Intelligence 8.3    2017-01-03 Heavy Rescue: 401 7.5    2015-06-01 American Genius 7.0    2016-08-12 Ask the Storybots 7.5    2016-07-08 Jim Henson's Word Party 6.7    2015-08-07 Project Mc² 4.7    2015-12-13 LEGO Nexo Knights 6.0    2015-11-10 My Little Lover 6.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Portuguese Runtime  45m Homepage   https://www.netflix.com/title/80074220 Genres Drama Sci-Fi & Fantasy Keywords island thriller rich people poor people Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings 17 Gabriel W. Almeida 13 Éric u 12 urielalmeida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}