{"link": "https://www.themoviedb.org/tv/38317?language=en", "title": "Superman", "resume": "Superman made his animated debut in this series of seventeen classic  Technicolor short films produced by Fleischer Studios and its successor  Famous Studios in the 1940s.", "rate": 80, "genre": ["Animation", "Action", "Adventure", "Kids"], "cast": ["Bud Collyer", "Joan Alexander", "Jackson Beck", "Julian Noa"], "character": ["Superman/Clark Kent (voice)", "Lois Lane (voice)", "the Narrator (voice)", "Perry White (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38317   Expand Superman   (1941) User Score Overview Superman made his animated debut in this series of seventeen classic  Technicolor short films produced by Fleischer Studios and its successor  Famous Studios in the 1940s. Featured Crew Max Fleischer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bud Collyer Superman/Clark Kent (voice) Joan Alexander Lois Lane (voice) Jackson Beck the Narrator (voice) Julian Noa Perry White (voice) Full Cast & Crew Last Season Season 1 1941 | 17 Episodes Season 1 of Superman premiered on September 26, 1941. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Superman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  10m Homepage  - Genres Animation Action & Adventure Kids Keywords dc comics based on comic super power Content Score 93 Almost there... Top Contributors R 22 Rebecca d 12 dragao-do-porto 3 minhus 3 Mikedeth5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}