{"link": "https://www.themoviedb.org/tv/38559?language=en", "title": "Level E", "resume": "Level E is a comic science fiction manga series by Yoshihiro Togashi. The plot follows an alien prince who crash lands on Earth and begins living with a high school student. Along with its short length and more realistic art style, the story of Level E focuses much more heavily on humor than Togashi's more famous shōnen series YuYu Hakusho and Hunter × Hunter.\nLevel E was originally serialized in the Japanese Shueisha magazine Weekly Shōnen Jump from 1995 to 1997 for a total of 16 chapters. These chapters have since been collected into three volumes, as well as two magazine-style books. An anime adaptation of Level E was produced by Studio Pierrot and David Production and aired on TV Tokyo in early 2011.", "rate": 10, "genre": ["Animation", "Comedy"], "cast": ["Namikawa Daisuke", "Yoshimasa Hosoya", "Satomi Akesaka", "Takehito Koyasu", "Masaya Takatsuka"], "character": ["Prince", "Yukitaka Tsutsui", "Miho Edogawa", "Captain Kraft", "Sado"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38559   Expand Level E   (2011) User Score Overview Level E is a comic science fiction manga series by Yoshihiro Togashi. The plot follows an alien prince who crash lands on Earth and begins living with a high school student. Along with its short length and more realistic art style, the story of Level E focuses much more heavily on humor than Togashi's more famous shōnen series YuYu Hakusho and Hunter × Hunter. Level E was originally serialized in the Japanese Shueisha magazine Weekly Shōnen Jump from 1995 to 1997 for a total of 16 chapters. These chapters have since been collected into three volumes, as well as two magazine-style books. An anime adaptation of Level E was produced by Studio Pierrot and David Production and aired on TV Tokyo in early 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Namikawa Daisuke Prince Yoshimasa Hosoya Yukitaka Tsutsui Satomi Akesaka Miho Edogawa Takehito Koyasu Captain Kraft Masaya Takatsuka Sado Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Level E premiered on January 11, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Level E. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tv-tokyo.co.jp/anime/level-e/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 Mikedeth5 m 3 magoozin a 2 asura766  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}