{"link": "https://www.themoviedb.org/tv/65117?language=en", "title": "Gentlemen & Gangsters", "resume": "Tv-series based on the novels \"Gentlemen\" and \"Gangsters\" by Klas Östergren.\nBruised, the author Klas barricades himself in the eccentric Henry Morgan's huge apartment in Stockholm. It all started a year ago when Klas met Henry at the boxing Club Europe and was pulled into his improbable world. Henry, who fearlessly shares a mistress with bashful businessman Wilhelm Sterner, is now missing without a trace. Klas fears for his life. Desperately he compiles the chronicle of Henry Morgan's fascinating life and adventure.", "rate": 56, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65117   Expand Gentlemen & Gangsters   (2016) User Score Overview Tv-series based on the novels \"Gentlemen\" and \"Gangsters\" by Klas Östergren. Bruised, the author Klas barricades himself in the eccentric Henry Morgan's huge apartment in Stockholm. It all started a year ago when Klas met Henry at the boxing Club Europe and was pulled into his improbable world. Henry, who fearlessly shares a mistress with bashful businessman Wilhelm Sterner, is now missing without a trace. Klas fears for his life. Desperately he compiles the chronicle of Henry Morgan's fascinating life and adventure. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of Gentlemen & Gangsters premiered on January  1, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Gentlemen & Gangsters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Swedish Runtime  90m Homepage  - Genres Drama Keywords romance thriller Content Score 43 There's no 'I' in team... Top Contributors k 14 korfun 6 linust 2 karaa 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}