{"link": "https://www.themoviedb.org/tv/67575?language=en", "title": "Moomin", "resume": "In the remote and mysterious Moomin Valley live the Moomin trolls, gentle and peaceful creatures. Young Moomin and his family experience many strange adventures, both magical and mundane. Based on the children's stories by Tove Jansson.", "rate": 84, "genre": ["Animation", "Comedy", "Kids", "Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67575   Expand Moomin   (1990) User Score Overview In the remote and mysterious Moomin Valley live the Moomin trolls, gentle and peaceful creatures. Young Moomin and his family experience many strange adventures, both magical and mundane. Based on the children's stories by Tove Jansson. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  1 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Series 2 - Delightful Moomin Family: Adventure Diary 1991 | 26 Episodes Season 2 of Moomin premiered on October  9, 1991. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Moomin. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  1 Posters  4 Recommendations   1998-08-31 Noddy 5.9    1996-09-02 Quack Pack 6.9    1986-05-28 Pingu 6.5    1987-06-17 Once Upon a Time... Life 8.0    1981-09-16 Postman Pat 6.0    1984-10-09 Thomas & Friends 5.3    1997-09-13 Recess 6.8    1992-09-05 Goof Troop 6.5  Facts Original Name  楽しいムーミン一家 Status  Ended Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  Japanese Runtime  23m Homepage   https://www.moomin.com/ Genres Animation Comedy Kids Family Keywords magic troll moominland moomin Content Score 64 We're so close, yet so far. Top Contributors m 205 mikisoft 124 Elizabeth Jennings 15 d00ziie 14 BryGur  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}