{"link": "https://www.themoviedb.org/tv/69693?language=en", "title": "Patagonia: Earth's Secret Paradise", "resume": "Documentary series delving into a rarely seen South American wilderness, home to surprising creatures who survive from the mighty Andes Mountains to Cape Horn.", "rate": 80, "genre": [], "cast": ["Santiago Cabrera"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69693   Expand Patagonia: Earth's Secret Paradise   (2015) User Score Overview Documentary series delving into a rarely seen South American wilderness, home to surprising creatures who survive from the mighty Andes Mountains to Cape Horn. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Santiago Cabrera Himself - Narrator Full Cast & Crew Last Season Season 1 2015 | 3 Episodes Season 1 of Patagonia: Earth's Secret Paradise premiered on September 25, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on Patagonia: Earth's Secret Paradise. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b06dpmbx Genres No genres have been added. Keywords animal nature Content Score 50 Still needs a little work. Top Contributors TB 32 TMDb Bot f 16 fatjay39 G 10 Gonçalo 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}