{"link": "https://www.themoviedb.org/tv/10749?language=en", "title": "O'Grady", "resume": "O'Grady is an animated television show created by Tom Snyder and Carl Adams and developed for TV by co-star Holly Schlesinger. It used to air on The N in the US, on MTV in Latin America, Nickelodeon in the United Kingdom, Family Channel in Canada and on 2x2 in Russia. It stars Melissa Bardin Galsky and H. Jon Benjamin, among other Soup2nuts Productions alumni, as high school students Abby and Kevin, and chronicles their lives along with those of other residents of O'Grady, a fictional town which is periodically plagued by \"The Weirdness.\" The Weirdness affects its residents in strange ways such as projecting their private thoughts in bubbles over their heads, or producing clones of themselves every time they get angry. The random changes in the show's logo explains the plot.\nAlthough The N no longer airs reruns of the series, episodes can still be viewed on the network's website. Episodes are also available for purchase through iTunes, as well as Amazon Instant Video. On July 14, 2013, TeenNick began airing reruns of the show.", "rate": 100, "genre": ["Animation"], "cast": ["H. Jon Benjamin", "Melissa Bardin Galsky"], "character": ["Iris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10749   Expand O'Grady   (2004) User Score Overview O'Grady is an animated television show created by Tom Snyder and Carl Adams and developed for TV by co-star Holly Schlesinger. It used to air on The N in the US, on MTV in Latin America, Nickelodeon in the United Kingdom, Family Channel in Canada and on 2x2 in Russia. It stars Melissa Bardin Galsky and H. Jon Benjamin, among other Soup2nuts Productions alumni, as high school students Abby and Kevin, and chronicles their lives along with those of other residents of O'Grady, a fictional town which is periodically plagued by \"The Weirdness.\" The Weirdness affects its residents in strange ways such as projecting their private thoughts in bubbles over their heads, or producing clones of themselves every time they get angry. The random changes in the show's logo explains the plot. Although The N no longer airs reruns of the series, episodes can still be viewed on the network's website. Episodes are also available for purchase through iTunes, as well as Amazon Instant Video. On July 14, 2013, TeenNick began airing reruns of the show. Featured Crew Tom Snyder Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast H. Jon Benjamin Iris Melissa Bardin Galsky Full Cast & Crew Last Season Season 2 2006 | 6 Episodes Season 2 of O'Grady premiered on March  3, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on O'Grady. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}