{"link": "https://www.themoviedb.org/tv/70961?language=en", "title": "Rainy Cocoa", "resume": "Aoi’s soaked by a sudden rainstorm and takes shelter at Rainy Color, a cozy café where the warmth of the staff compliments the sweet hot cocoa he’s served. When he falls into a job at the café he feels like things are finally looking up— until Keiichi Iwase, the man he couldn’t help but stare at on the train, shows up.", "rate": 25, "genre": ["Comedy", "Animation"], "cast": ["Hiro Shimono", "Hikaru Midorikawa", "Daisuke Hirakawa", "Mamoru Miyano", "Ryou Horikawa"], "character": ["Aoi Tokura (voice)", "Keiichi Iwase (voice)", "Shion Koga (voice)", "Ryouta Sakuragi (voice)", "Kouji Amami (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70961   Expand Rainy Cocoa   (2015) User Score Overview Aoi’s soaked by a sudden rainstorm and takes shelter at Rainy Color, a cozy café where the warmth of the staff compliments the sweet hot cocoa he’s served. When he falls into a job at the café he feels like things are finally looking up— until Keiichi Iwase, the man he couldn’t help but stare at on the train, shows up. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiro Shimono Aoi Tokura (voice) Hikaru Midorikawa Keiichi Iwase (voice) Daisuke Hirakawa Shion Koga (voice) Mamoru Miyano Ryouta Sakuragi (voice) Ryou Horikawa Kouji Amami (voice) Full Cast & Crew Current Season Ame-con!! 2017 | 1 Episode Season 4 of Rainy Cocoa premiered on October  4, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Rainy Cocoa. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rainy Cocoa. You can help by rating TV shows you've seen. Facts Original Name  雨色ココア Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  2m Homepage   http://www.rainycocoa.jp/anime Genres Comedy Animation Keywords slice of life based on manga anime short episodes Content Score 86 Almost there... Top Contributors 59 Marr 🇳🇱 19 sp1ti 9 Despair-Paradise 6 iberq  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}