{"link": "https://www.themoviedb.org/tv/64464?language=en", "title": "11.22.63", "resume": "An English teacher travels back in time to prevent the Kennedy assassination, but discovers he is attached to the life he has made in a bygone era.", "rate": 78, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["James Franco", "Sarah Gadon", "Chris Cooper", "Daniel Webber", "Lucy Fry"], "character": ["Jake Epping", "Sadie Dunhill", "Al Templeton", "Lee Harvey Oswald", "Marina Oswald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64464   Expand 11.22.63   (2016) User Score  Play Trailer Overview An English teacher travels back in time to prevent the Kennedy assassination, but discovers he is attached to the life he has made in a bygone era. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  3 Images Backdrops  11 Posters  19 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Franco Jake Epping Sarah Gadon Sadie Dunhill Chris Cooper Al Templeton Daniel Webber Lee Harvey Oswald Lucy Fry Marina Oswald Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of 11.22.63 premiered on February 15, 2016. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Yellow card man Open 0 by Melanie\n      \n     Fave new show Open 5 by  Strannger18 Should I read the novel first? Open 0 by stugood\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  11 Posters  19 Recommendations   2015-05-14 Wayward Pines 6.5    2014-04-15 Fargo 8.2    2015-01-15 The Man in the High Castle 7.5    2014-01-12 True Detective 8.1    2016-05-22 Preacher 7.4    2015-06-05 Sense8 7.7    2016-07-10 The Night Of 7.7    2013-01-21 The Following 6.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  81m, 54m Homepage   http://www.hulu.com/112263 Genres Drama Sci-Fi & Fantasy Keywords assassination based on novel or book time travel horror history murder miniseries alternate history love sickness kennedy assassination time traveler Content Score 93 Almost there... Top Contributors 57 Elizabeth Jennings TB 35 TMDb Bot 32 Apollo 23 charlieaus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}