{"link": "https://www.themoviedb.org/tv/17498?language=en", "title": "Roommates", "resume": "Roommates is an American television sitcom developed by ABC Family and Acme Productions that premiered on March 23, 2009. On April 29, 2009, it was announced that Roommates would not return for a second season.", "rate": 0, "genre": ["Comedy"], "cast": ["Felicia Day", "David Weidoff", "Tamera Mowry", "Tommy Dewey", "Dorian Brown Pham"], "character": ["Alyssa", "Thom", "Hope", "James", "Katie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17498   Expand Roommates   (2009) User Score Overview Roommates is an American television sitcom developed by ABC Family and Acme Productions that premiered on March 23, 2009. On April 29, 2009, it was announced that Roommates would not return for a second season. Featured Crew Kieron Quirke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Felicia Day Alyssa David Weidoff Thom Tamera Mowry Hope Tommy Dewey James Dorian Brown Pham Katie Full Cast & Crew Last Season Season 1 2009 | 13 Episodes Season 1 of Roommates premiered on March 23, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Roommates. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://abcfamily.go.com/abcfamily/path/section_Shows+Roommates/page_Detail/ Genres Comedy Keywords roommate young adult Content Score 93 Almost there... Top Contributors 2 Banana b 2 brewtown 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}