{"link": "https://www.themoviedb.org/tv/5634?language=en", "title": "The Ghost Squad", "resume": "The Ghost Squad was a 2005 British crime drama series produced by Company Pictures, for Channel 4. The show was created by Tom Grieves. Inspired by the real life \"Ghost Squad\" that existed between 1994 and 1998, secretly investigating police corruption, the premise of the series is that the squad continued to operate in secret after officially being shut down. It starred Elaine Cassidy as a police constable recruited into the squad and Jonas Armstrong as her handler. The show was cancelled after a single seven episode series.", "rate": 80, "genre": ["Crime", "Drama"], "cast": ["Jonas Armstrong", "Elaine Cassidy", "Emma Fielding"], "character": ["Pete Maitland", "Detective Amy Harris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5634   Expand The Ghost Squad   (2005) User Score Overview The Ghost Squad was a 2005 British crime drama series produced by Company Pictures, for Channel 4. The show was created by Tom Grieves. Inspired by the real life \"Ghost Squad\" that existed between 1994 and 1998, secretly investigating police corruption, the premise of the series is that the squad continued to operate in secret after officially being shut down. It starred Elaine Cassidy as a police constable recruited into the squad and Jonas Armstrong as her handler. The show was cancelled after a single seven episode series. Featured Crew Tom Grieves Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonas Armstrong Pete Maitland Elaine Cassidy Detective Amy Harris Emma Fielding Full Cast & Crew Last Season Season 1 2005 | 8 Episodes Season 1 of The Ghost Squad premiered on November 15, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Ghost Squad. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage   http://www.channel4.com/entertainment/tv/microsites/G/ghost_squad/show.html Genres Crime Drama Keywords undercover agent police dirty cop police corruption Content Score 64 We're so close, yet so far. Top Contributors 11 Banana w 4 webmaster s 3 speedycars 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}