{"link": "https://www.themoviedb.org/tv/44264?language=en", "title": "Endeavour", "resume": "The early days of a young Endeavour Morse, whose experiences as a detective constable with the Oxford City Police will ultimately shape his future.", "rate": 81, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Shaun Evans", "Roger Allam", "Anton Lesser", "James Bradshaw", "Sean Rigby"], "character": ["DC Endeavour Morse", "DI Fred Thursday", "Chief Supt Reginald Bright", "Dr. Max DeBryn", "DS Jim Strange"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44264   Expand Endeavour   (2012) User Score  Play Trailer Overview The early days of a young Endeavour Morse, whose experiences as a detective constable with the Oxford City Police will ultimately shape his future. Featured Crew Russell Lewis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  16 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shaun Evans DC Endeavour Morse Roger Allam DI Fred Thursday Anton Lesser Chief Supt Reginald Bright James Bradshaw Dr. Max DeBryn Sean Rigby DS Jim Strange Full Cast & Crew Current Season Season 5 2018 | 6 Episodes Season 5 of Endeavour premiered on February  4, 2018. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply w Just a peek Open 0 by wonder2wonder\n      \n     C Thursday's Daughter (possible SPOILER) Open 1 by  lantzn 4 Seasons on Amazon Prime Open 0 by lantzn\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  16 Posters  6 Recommendations   2014-10-06 Grantchester 7.3    2007-02-18 Inspector Lewis 7.6    2011-09-16 DCI Banks 7.9    2013-03-10 Shetland 7.5    2015-10-08 Unforgotten 7.7    2011-05-01 Vera 6.8    2007-04-08 Inspector George Gently 8.3    2011-01-13 Kidnap and Ransom 7.6  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  120m Homepage   http://www.itv.com/hub/endeavour Genres Crime Drama Mystery Keywords police detective british oxford prequel period drama 1960s Content Score 100 Yes! Looking good! Top Contributors d 93 daphie 59 Nike 58 Elizabeth Jennings m 11 miro22  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}