{"link": "https://www.themoviedb.org/tv/44729?language=en", "title": "The Chaser", "resume": "The Chaser is a 2012 South Korean television drama series about a grieving father out for revenge against corrupt officials.\nDespite no hype or big stars, the thriller gave a strong performance in the ratings, ending its run at 22.1%. Its rise in popularity was based on the tightly written and well-structured storyline, solid direction, and cast members' acting skills.", "rate": 80, "genre": ["Action", "Crime", "Drama", "Thriller"], "cast": ["Son Hyun-joo", "Kim Sang-joong", "Go Joon-hee", "Kim Sung-ryung", "Ryu Seung-su"], "character": ["Baek Hong-suk", "Kang Dong-yoon", "Seo Ji-won", "Seo Ji-soo", "Choi Jung-woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44729   Expand The Chaser   (2012) User Score Overview The Chaser is a 2012 South Korean television drama series about a grieving father out for revenge against corrupt officials. Despite no hype or big stars, the thriller gave a strong performance in the ratings, ending its run at 22.1%. Its rise in popularity was based on the tightly written and well-structured storyline, solid direction, and cast members' acting skills. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Son Hyun-joo Baek Hong-suk Kim Sang-joong Kang Dong-yoon Go Joon-hee Seo Ji-won Kim Sung-ryung Seo Ji-soo Ryu Seung-su Choi Jung-woo Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of The Chaser premiered on May 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Chaser. You can help by rating TV shows you've seen. Facts Original Name  추적자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://wizard2.sbs.co.kr/thechaser/ Genres Action Crime Drama Thriller Keywords korea Content Score 86 Almost there... Top Contributors M 47 Maria180493 3 part-mozi r 2 rogercyk t 1 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}