{"link": "https://www.themoviedb.org/tv/2021?language=en", "title": "Up Pompeii!", "resume": "Up Pompeii! is a British television comedy series broadcast between 1969 and 1970, starring Frankie Howerd. The first series was written by Talbot Rothwell, a scriptwriter for the Carry On films, and the second series by Rothwell and Sid Colin. Two later specials were transmitted in 1975 and 1991.", "rate": 93, "genre": ["Comedy"], "cast": ["Wendy Richard", "Valerie Leon", "Frankie Howerd", "Elizabeth Larner", "Jeanne Mockford"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2021   Expand Up Pompeii!   (1970) User Score Overview Up Pompeii! is a British television comedy series broadcast between 1969 and 1970, starring Frankie Howerd. The first series was written by Talbot Rothwell, a scriptwriter for the Carry On films, and the second series by Rothwell and Sid Colin. Two later specials were transmitted in 1975 and 1991. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wendy Richard Valerie Leon Frankie Howerd Elizabeth Larner Jeanne Mockford Full Cast & Crew Last Season Season 2 1970 | 6 Episodes Season 2 of Up Pompeii! premiered on September 14, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1969-02-28 On the Buses 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords ancient rome breaking the fourth wall slave double entendre british humour period sitcom Content Score 86 Almost there... Top Contributors O 8 Ozbourne 2 ReggieRocket  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}