{"link": "https://www.themoviedb.org/tv/11930?language=en", "title": "Time Gentlemen Please", "resume": "The Pub Landlord’s rules are a pint for\nthe fella and a glass of white wine or\nfruit based drink for the lady. It might be\nthe 21st century but the landlord’s gaff is\nthe last bastion of all things normal. He\nain’t interested in change. It’s just the way\nthings are, and don’t you or anybody else\ngo questioning it.", "rate": 80, "genre": ["Comedy"], "cast": ["Julia Sawalha", "Phil Daniels", "Al Murray", "David Walliams", "Alexander Armstrong"], "character": ["Janet Wilson", "Terry Brook", "The Pub Landlord", "Marcel", "Dean"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11930   Expand Time Gentlemen Please   (2000) User Score Overview The Pub Landlord’s rules are a pint for\nthe fella and a glass of white wine or\nfruit based drink for the lady. It might be\nthe 21st century but the landlord’s gaff is\nthe last bastion of all things normal. He\nain’t interested in change. It’s just the way\nthings are, and don’t you or anybody else\ngo questioning it. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julia Sawalha Janet Wilson Phil Daniels Terry Brook Al Murray The Pub Landlord David Walliams Marcel Alexander Armstrong Dean Full Cast & Crew Last Season Season 2 2002 | 14 Episodes Season 2 of Time Gentlemen Please premiered on January 30, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Time Gentlemen Please. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords professor pub patriotism australian surreal satire british sexual humor slapstick landlord student alcoholic customer sitcom british humour workplace comedy anarchic comedy rival Content Score 86 Almost there... Top Contributors O 21 Ozbourne 13 Banana E 1 Elky  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}