{"link": "https://www.themoviedb.org/tv/1410?language=en", "title": "Revolution", "resume": "Revolution focuses on the struggle to survive 15 years after a global blackout.", "rate": 62, "genre": ["Action", "Science", "Fiction", "Drama", "Adventure"], "cast": ["Billy Burke", "Tracy Spiridakos", "Giancarlo Esposito", "Zak Orth", "David Lyons"], "character": ["Miles Matheson", "Charlotte \"Charlie\" Matheson", "Major Tom Neville", "Aaron Pittman", "Sebastian \"Bass\" Monroe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1410   Expand Revolution   (2012) User Score  Play Trailer Overview Revolution focuses on the struggle to survive 15 years after a global blackout. Featured Crew Eric Kripke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  17 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Billy Burke Miles Matheson Tracy Spiridakos Charlotte \"Charlie\" Matheson Giancarlo Esposito Major Tom Neville Zak Orth Aaron Pittman David Lyons Sebastian \"Bass\" Monroe Full Cast & Crew Last Season Season 2 2013 | 22 Episodes Season 2 of Revolution premiered on September 25, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Revolution. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  17 Posters  13 Recommendations   2011-06-19 Falling Skies 6.4    2012-05-27 Continuum 7.1    2011-09-26 Terra Nova 6.3    2013-04-15 Defiance 6.2    2009-07-07 Warehouse 13 7.2    2013-06-24 Under the Dome 6.2    2013-10-09 The Tomorrow People 6.6    2013-11-17 Almost Human 7.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.nbc.com/revolution Genres Action Science Fiction Drama Adventure Keywords future nanotechnology blackout post-apocalyptic no electricity Content Score 100 Yes! Looking good! Top Contributors 342 seawolf 138 Marr 🇳🇱 f 20 furkan-guven0115 p 11 pallec  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}