{"link": "https://www.themoviedb.org/tv/313?language=en", "title": "WWE Heat", "resume": "WWE Heat was a professional wrestling television program produced by World Wrestling Entertainment. Originally produced under the World Wrestling Federation banner, it aired on USA Network, MTV and Spike TV in the United States, Channel 4, Sky1 & Sky Sports in the United Kingdom and CTV Sportsnet in Canada.\nHeat was most recently streamed on WWE.com on Friday afternoons for North American viewers. However, the show was still televised internationally and showed in the United Kingdom on Channel 4 and then later on Sky Sports 3, Australia on Fox8, India on TEN Sports, Germany on Premiere Sport Portal, France on Action, Spain on Sportmania and C+ Deportes -both channels from Digital+, the Middle East on ShowSports4, the Philippines on Jack TV, and Japan oyn J Sports. The final episode was uploaded to WWE.com. The show was replaced internationally with WWE Vintage Collection, a program featuring classic matches.", "rate": 100, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 313   Expand WWE Heat User Score Overview WWE Heat was a professional wrestling television program produced by World Wrestling Entertainment. Originally produced under the World Wrestling Federation banner, it aired on USA Network, MTV and Spike TV in the United States, Channel 4, Sky1 & Sky Sports in the United Kingdom and CTV Sportsnet in Canada. Heat was most recently streamed on WWE.com on Friday afternoons for North American viewers. However, the show was still televised internationally and showed in the United Kingdom on Channel 4 and then later on Sky Sports 3, Australia on Fox8, India on TEN Sports, Germany on Premiere Sport Portal, France on Action, Spain on Sportmania and C+ Deportes -both channels from Digital+, the Middle East on ShowSports4, the Philippines on Jack TV, and Japan oyn J Sports. The final episode was uploaded to WWE.com. The show was replaced internationally with WWE Vintage Collection, a program featuring classic matches. Featured Crew Vince McMahon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords wrestling sports show Content Score 36 There's no 'I' in team... Top Contributors 9 Banana O 1 Only567  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}