{"link": "https://www.themoviedb.org/tv/71601?language=en", "title": "War on Waste", "resume": "Our waste is growing at double the rate of our population with 52 mega tonnes generated a year. Australia is ranked 5th highest for generating the most municipal waste in the world. In this three-part series, Craig Reucassel is on a mission to see if we, as a nation, can all do a little bit better.", "rate": 25, "genre": ["Documentary"], "cast": ["Craig Reucassel"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71601   Expand War on Waste   (2017) User Score  Play Trailer Overview Our waste is growing at double the rate of our population with 52 mega tonnes generated a year. Australia is ranked 5th highest for generating the most municipal waste in the world. In this three-part series, Craig Reucassel is on a mission to see if we, as a nation, can all do a little bit better. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig Reucassel Himself - Presenter Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of War on Waste premiered on May 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on War on Waste. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Documentary Original Language  English Runtime  57m Homepage   http://www.abc.net.au/tv/programs/war-on-waste/ Genres Documentary Keywords australia recycling landfill plastic environmental conservation environmental issue waste Content Score 64 We're so close, yet so far. Top Contributors 35 United600 4 Banana TB 3 TMDb Bot 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}