{"link": "https://www.themoviedb.org/tv/62413?language=en", "title": "Killjoys", "resume": "An action-packed adventure series following a fun-loving, hard living trio of interplanetary bounty hunters (a.k.a. Killjoys) sworn to remain impartial as they chase deadly warrants around the Quad, a system of planets on the brink of revolution.", "rate": 67, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Hannah John-Kamen", "Aaron Ashmore", "Luke MacFarlane", "Thom Allison", "Sean Baek"], "character": ["Dutch", "John Jaqobis", "D'Avin Jaqobis", "Prima Dezz", "Fancy Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62413   Expand Killjoys   (2015) User Score  Play Trailer Overview An action-packed adventure series following a fun-loving, hard living trio of interplanetary bounty hunters (a.k.a. Killjoys) sworn to remain impartial as they chase deadly warrants around the Quad, a system of planets on the brink of revolution. Featured Crew M. A. Lovretta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  15 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hannah John-Kamen Dutch Aaron Ashmore John Jaqobis Luke MacFarlane D'Avin Jaqobis Thom Allison Prima Dezz Sean Baek Fancy Lee Full Cast & Crew Last Season Season 3 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Renewed for final 2 seasons Open 2 by  Chrisjozo N The Jaqobi Brothers Feud is Ridiculous Open 0 by Nephlim14\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  8 Recommendations   2015-06-12 Dark Matter 6.3    2013-04-15 Defiance 6.2    2012-05-27 Continuum 7.1    2015-06-02 Stitchers 6.3    2015-12-14 The Expanse 7.5    2013-09-16 Sleepy Hollow 6.4    2014-06-19 Dominion 5.9    2016-01-05 The Shannara Chronicles 6.4  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m, 60m Homepage   http://www.syfy.com/killjoys Genres Action & Adventure Sci-Fi & Fantasy Keywords bounty hunter space travel family secret corporate greed Content Score 100 Yes! Looking good! Top Contributors 77 Elizabeth Jennings VA 30 Viktor Andersson 16 Imzadi r 15 robko22  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}