{"link": "https://www.themoviedb.org/tv/60705?language=en", "title": "Faking It", "resume": "A romantic comedy about two best friends who love each other -- in slightly different ways. After numerous failed attempts to become popular, the girls are mistakenly outed as lesbians, which launches them to instant celebrity status. Seduced by their newfound fame, Karma and Amy decide to keep up their romantic ruse.", "rate": 58, "genre": ["Comedy"], "cast": ["Rita Volk", "Katie Stevens", "Gregg Sulkin", "Bailey De Young", "Michael J. Willett"], "character": ["Amy Raudenfeld", "Karma Ashcroft", "Liam Booker", "Lauren Cooper", "Shane Harvey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60705   Expand Faking It   (2014) User Score  Play Trailer Overview A romantic comedy about two best friends who love each other -- in slightly different ways. After numerous failed attempts to become popular, the girls are mistakenly outed as lesbians, which launches them to instant celebrity status. Seduced by their newfound fame, Karma and Amy decide to keep up their romantic ruse. Featured Crew Dana Goodman Creator Julia Lea Wolov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rita Volk Amy Raudenfeld Katie Stevens Karma Ashcroft Gregg Sulkin Liam Booker Bailey De Young Lauren Cooper Michael J. Willett Shane Harvey Full Cast & Crew Last Season Season 3 2016 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Shane: Happy Birthday Michael J. Willett! Open 0 by wonder2wonder\n      \n     w Amy: Happy Birthday Rita Volk! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations   2011-07-19 Awkward. 6.2    2015-03-31 Weird Loners 5.8    2005-11-04 South of Nowhere 6.5    2014-10-02 A to Z 5.7    2014-06-29 Reckless 5.5    2014-09-30 Happyland 3.3    2014-07-08 Finding Carter 5.6    2013-11-14 Ground Floor 6.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.mtv.com/shows/faking_it/ Genres Comedy Keywords high school lesbian relationship lesbian popularity teen comedy lgbt best friends in love pretend relationship Content Score 100 Yes! Looking good! Top Contributors 124 Ryan McCloskey 62 Banana 22 Elizabeth Jennings D 8 Dirk1313  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}