{"link": "https://www.themoviedb.org/tv/3170?language=en", "title": "The Biggest Loser Australia", "resume": "The Biggest Loser is an Australian reality television show, based on the original American version of the same name. It is produced by Crackerjack Productions and screened on Network Ten. It was hosted by Ajay Rochester from 2006–2009 and introduced former Olympian Hayley Lewis as its host in 2010. The show first debuted on 13 February 2006, followed by a second season on 4 February 2007 which introduced Michelle Bridges, Shannan Ponton and Steve Willis. The third season began airing on 3 February 2008. A fourth season, which features couples competing as teams, started airing on 1 February 2009. A fifth season, which aired on 31 January 2010, featuring former Olympic swimmer Hayley Lewis as the new host, and in 2011 the show introduced the new trainer Tiffiny Hall.", "rate": 80, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3170   Expand The Biggest Loser Australia User Score Overview The Biggest Loser is an Australian reality television show, based on the original American version of the same name. It is produced by Crackerjack Productions and screened on Network Ten. It was hosted by Ajay Rochester from 2006–2009 and introduced former Olympian Hayley Lewis as its host in 2010. The show first debuted on 13 February 2006, followed by a second season on 4 February 2007 which introduced Michelle Bridges, Shannan Ponton and Steve Willis. The third season began airing on 3 February 2008. A fourth season, which features couples competing as teams, started airing on 1 February 2009. A fifth season, which aired on 31 January 2010, featuring former Olympic swimmer Hayley Lewis as the new host, and in 2011 the show introduced the new trainer Tiffiny Hall. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.thebiggestloser.com.au/ Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 2 desertcrystal  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}