{"link": "https://www.themoviedb.org/tv/11825?language=en", "title": "Def Poetry", "resume": "Def Poetry, also known as Russell Simmons Presents Def Poetry or Def Poetry Jam, which was co-founded by Bruce George, Danny Simmons and Deborah Pointer, is an HBO television series produced by hip-hop music entrepreneur Russell Simmons. The series presents performances by established spoken word poets, as well as up-and-coming ones. Well-known actors and musicians will often surprise the audience by showing up to recite their own original poems. The show is hosted by Mos Def. Def Poetry is a spin-off of Def Comedy Jam. As he did on Def Comedy, Simmons appears at the end of every episode to thank the audience.\nThe series included historical legendary poets such as, The Last Poets, Nikki Giovanni, Amiri Baraka and Sonya Sanchez. It also featured poets, Saul Williams, Grammy Award Winning J. Ivy, Jessica Care-Moore and Lemon. Though technically not a poetry slam, Def Poetry has become heavily associated with the poetry slam movement, and utilizes many of poetry slam's best known poets, including National Poetry Slam champions such as Beau Sia, Taylor Mali, Big Poppa E, Mayda del Valle, Mike Mcgee, Alix Olson and Rives, among others. Even poets who are critical of the poetry slam, such as John S. Hall, have acknowledged slam's influence on the show. In a 2005 interview, Hall was quoted as saying,", "rate": 100, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11825   Expand Def Poetry   (2002) User Score Overview Def Poetry, also known as Russell Simmons Presents Def Poetry or Def Poetry Jam, which was co-founded by Bruce George, Danny Simmons and Deborah Pointer, is an HBO television series produced by hip-hop music entrepreneur Russell Simmons. The series presents performances by established spoken word poets, as well as up-and-coming ones. Well-known actors and musicians will often surprise the audience by showing up to recite their own original poems. The show is hosted by Mos Def. Def Poetry is a spin-off of Def Comedy Jam. As he did on Def Comedy, Simmons appears at the end of every episode to thank the audience. The series included historical legendary poets such as, The Last Poets, Nikki Giovanni, Amiri Baraka and Sonya Sanchez. It also featured poets, Saul Williams, Grammy Award Winning J. Ivy, Jessica Care-Moore and Lemon. Though technically not a poetry slam, Def Poetry has become heavily associated with the poetry slam movement, and utilizes many of poetry slam's best known poets, including National Poetry Slam champions such as Beau Sia, Taylor Mali, Big Poppa E, Mayda del Valle, Mike Mcgee, Alix Olson and Rives, among others. Even poets who are critical of the poetry slam, such as John S. Hall, have acknowledged slam's influence on the show. In a 2005 interview, Hall was quoted as saying, Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 2007 | 6 Episodes Season 6 of Def Poetry premiered on February 16, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Def Poetry. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}