{"link": "https://www.themoviedb.org/tv/71061?language=en", "title": "Rush to the Dead Summer", "resume": "When Li Xia and her best friend enroll into the arts specialized Qian Chuan secondary school, they meet the legendary Fu Xiao Si and Lu Zhi Ang. Together, the group of youths officially begin their beautiful high school life. After graduation, the friends part with everyone going their separate ways, but everyone continues to fight for their dreams. However, they're all gradually changing and thus become doubtful about the origin of their friendship. A span of ten years makes them realize that other than memories, nothing can be eternal, but they learnt to love and grow.", "rate": 43, "genre": ["Drama"], "cast": ["Zheng Shuang", "Cheney Chen", "Bai Jing Ting", "Zheng He Hui Zi", "Chai Bi Yun"], "character": ["Li Xia", "Fu Xiao Si", "Lu Zhi Ang", "Yan Mo", "Cheng Qi Qi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71061   Expand Rush to the Dead Summer   (2017) User Score Overview When Li Xia and her best friend enroll into the arts specialized Qian Chuan secondary school, they meet the legendary Fu Xiao Si and Lu Zhi Ang. Together, the group of youths officially begin their beautiful high school life. After graduation, the friends part with everyone going their separate ways, but everyone continues to fight for their dreams. However, they're all gradually changing and thus become doubtful about the origin of their friendship. A span of ten years makes them realize that other than memories, nothing can be eternal, but they learnt to love and grow. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zheng Shuang Li Xia Cheney Chen Fu Xiao Si Bai Jing Ting Lu Zhi Ang Zheng He Hui Zi Yan Mo Chai Bi Yun Cheng Qi Qi Full Cast & Crew Last Season Season 1 2017 | 46 Episodes Season 1 of Rush to the Dead Summer premiered on June 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Rush to the Dead Summer. You can help by rating TV shows you've seen. Facts Original Name  夏至未至 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/tvseriesxiazhiweizhi?is_hot=1 Genres Drama Keywords romance coming of age teenager Content Score 86 Almost there... Top Contributors M 61 Maria180493 11 BoL 8 Elizabeth Jennings 5 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}