{"link": "https://www.themoviedb.org/tv/6504?language=en", "title": "Ninja Olympiad", "resume": "The Sorcerers Clan, led by the centuries-old Org Ninja Dokusai, has made its move to retrieve the treasured map of Pako that has been in possession by the Yamaji family for generations. Tetsuzan Yamaji, the 34th grandmaster of the Togakure Ryu Ninpo, entrust his son and daughter, Toha and Mei, to protect the Pako from the forces of the Sorcerers Clan. By donning the Jiraiya Suit inherited from his father, Toha becomes Jiraya, Master of the Togakure School, who must face against the evil Sorcerers Clan, as well as numerous ninjas from different parts of the world.", "rate": 80, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Takumi Tsutsui", "Tomoko Taya", "Masaaki Hatsumi", "Issei Hirota", "Hiromi Nohara"], "character": ["Toha Yamaji / Jiraiya", "Rei Yagyu/Kinin Reiha", "Tetsuzan Yamashi", "Ryō Asuka", "Benikiba"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6504   Expand Ninja Olympiad   (1988) User Score Overview The Sorcerers Clan, led by the centuries-old Org Ninja Dokusai, has made its move to retrieve the treasured map of Pako that has been in possession by the Yamaji family for generations. Tetsuzan Yamaji, the 34th grandmaster of the Togakure Ryu Ninpo, entrust his son and daughter, Toha and Mei, to protect the Pako from the forces of the Sorcerers Clan. By donning the Jiraiya Suit inherited from his father, Toha becomes Jiraya, Master of the Togakure School, who must face against the evil Sorcerers Clan, as well as numerous ninjas from different parts of the world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takumi Tsutsui Toha Yamaji / Jiraiya Tomoko Taya Rei Yagyu/Kinin Reiha Masaaki Hatsumi Tetsuzan Yamashi Issei Hirota Ryō Asuka Hiromi Nohara Benikiba Full Cast & Crew Last Season Season 1 1988 | 50 Episodes Season 1 of Ninja Olympiad premiered on August 24, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ninja Olympiad. You can help by rating TV shows you've seen. Facts Original Name  世界忍者戦ジライヤ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords tokusatsu global ninja jiraiya Content Score 86 Almost there... Top Contributors a 14 agabrielads NS 13 Norte Serra 10 Elizabeth Jennings 9 Renato  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}