{"link": "https://www.themoviedb.org/tv/35529?language=en", "title": "魔法の天使クリィミーマミ", "resume": "Creamy Mami, the Magic Angel is a magical girl anime series by Studio Pierrot which aired from 1983 to 1984 on Nippon Television. It went on to have five OVA adaptions and featured in other Studio Pierrot special presentations. A three volume manga was released during the original TV run, with the story written by Kazunori Itō and art by Yuuko Kitagawa. This was the first of five magical girl anime to be produced by Studio Pierrot, and the first of these to feature the designs of Akemi Takada. In 2005, the web-poll for TV Asahi's top-100 anime of all time saw Creamy Mami, the Magic Angel poll 82nd. The series is currently streaming in North America via Yomiuri Group's planned Anime Sols video service, as of spring 2013. Thus far, a limited DVD release of the first thirteen episodes has been successfully crowd-funded at Anime Sols, with the second set of episodes currently in crowd-fund mode.", "rate": 0, "genre": ["Animation"], "cast": ["Kazuhiko Inoue", "Saeko Shimazu", "Kaneta Kimotsuki", "Mika Doi", "Sukekiyo Kameyama"], "character": ["Shingo Tachibana", "Megumi Ayase", "Nega", "Natsume Morisawa", "Hayato Kidokoro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35529   Expand 魔法の天使クリィミーマミ   (1983) User Score Overview Creamy Mami, the Magic Angel is a magical girl anime series by Studio Pierrot which aired from 1983 to 1984 on Nippon Television. It went on to have five OVA adaptions and featured in other Studio Pierrot special presentations. A three volume manga was released during the original TV run, with the story written by Kazunori Itō and art by Yuuko Kitagawa. This was the first of five magical girl anime to be produced by Studio Pierrot, and the first of these to feature the designs of Akemi Takada. In 2005, the web-poll for TV Asahi's top-100 anime of all time saw Creamy Mami, the Magic Angel poll 82nd. The series is currently streaming in North America via Yomiuri Group's planned Anime Sols video service, as of spring 2013. Thus far, a limited DVD release of the first thirteen episodes has been successfully crowd-funded at Anime Sols, with the second set of episodes currently in crowd-fund mode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kazuhiko Inoue Shingo Tachibana Saeko Shimazu Megumi Ayase Kaneta Kimotsuki Nega Mika Doi Natsume Morisawa Sukekiyo Kameyama Hayato Kidokoro Full Cast & Crew Last Season Mahou no tenshi creamy mami season 1 1983 | 52 Episodes Season 1 of 魔法の天使クリィミーマミ premiered on July  1, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on 魔法の天使クリィミーマミ. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors b 6 baux C 2 ClaudeH  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}