{"link": "https://www.themoviedb.org/tv/73605?language=en", "title": "The Lost Honour of Christopher Jefferies", "resume": "Christopher Jefferies's life is turned inside out when one of his tenants disappears without a trace just before Christmas.", "rate": 73, "genre": ["Drama"], "cast": ["Nathalie Armin", "Joe Sims", "Anna Maxwell Martin", "Jennifer Higham", "Peter Polycarpou"], "character": ["Melissa Chapman", "Vincent Tabak", "Janine", "Tanja", "Louis Charalambous"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73605   Expand The Lost Honour of Christopher Jefferies   (2014) User Score  Play Trailer Overview Christopher Jefferies's life is turned inside out when one of his tenants disappears without a trace just before Christmas. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nathalie Armin Melissa Chapman Joe Sims Vincent Tabak Anna Maxwell Martin Janine Jennifer Higham Tanja Peter Polycarpou Louis Charalambous Full Cast & Crew Last Season Season 1 2014 | 2 Episodes Season 1 of The Lost Honour of Christopher Jefferies premiered on December 10, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Sad thing is, nothing's changed Open 1 by  DanDare Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2012-05-28 Pablo Escobar, The Drug Lord 7.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Drama Keywords police flat lawyer landlord schoolteacher media coverage stigma murder suspect accused of murder Content Score 93 Almost there... Top Contributors TB 30 TMDb Bot 21 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}