{"link": "https://www.themoviedb.org/tv/61988?language=en", "title": "The Empress of China", "resume": "Based on events in 7th and 8th-century Tang dynasty and starring producer Fan Bingbing as the titular character Wu Zetian, The Empress of China is the story of the only woman in Chinese history to rule as an emperor.", "rate": 69, "genre": ["Drama"], "cast": ["Fan Bingbing", "Zhang Fengyi", "Aarif Lee", "Janine Chang", "Li Chen"], "character": ["Wu Mei Niang", "Li Shi Min", "Li Zhi", "Xu Hui", "Li Mu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61988   Expand The Empress of China   (2014) User Score Overview Based on events in 7th and 8th-century Tang dynasty and starring producer Fan Bingbing as the titular character Wu Zetian, The Empress of China is the story of the only woman in Chinese history to rule as an emperor. Featured Crew Fan Bingbing Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fan Bingbing Wu Mei Niang Zhang Fengyi Li Shi Min Aarif Lee Li Zhi Janine Chang Xu Hui Li Chen Li Mu Full Cast & Crew Last Season Season 1 2014 | 96 Episodes Season 1 of The Empress of China premiered on December 21, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  10 Recommendations   2017-01-02 Pretty Li Hui Zhen 3.5    2017-08-14 The King's Woman 4.3    2013-04-04 Hannibal 7.7  Facts Original Name  武媚娘传奇 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.hunantv.com/v/2/103460/ Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 31 Elizabeth Jennings l 26 liuruizhi614 M 18 Maria180493 14 lys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}