{"link": "https://www.themoviedb.org/tv/34701?language=en", "title": "Gokudo", "resume": "Gokudo is a light novel series created by Usagi Nakamura. The light novel was first serialized by Kadokawa Shoten in their light novel magazine Kadokawa Sneaker Bunko. It was later adapted into a manga in 1995 and is released in Dengeki Daioh magazine. An anime adaptation is then produced by Trans Arts and was aired TV Tokyo from April 2, 1999 to September 24, 1999, with a total of 26 episodes.\nEnoki Films holds the United States anime license under the name Jester the Adventurer. AnimeWorks translated and released the anime on DVD as Gokudo.", "rate": 0, "genre": ["Animation"], "cast": ["Akira Ishida", "Sayuri Yoshida", "Shin'ichirou Miki", "Yuu Shimaka", "Akira Ishida"], "character": ["Gokudou", "Ruubet", "Prince", "Jin", "Justice"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34701   Expand Gokudo   (1999) User Score Overview Gokudo is a light novel series created by Usagi Nakamura. The light novel was first serialized by Kadokawa Shoten in their light novel magazine Kadokawa Sneaker Bunko. It was later adapted into a manga in 1995 and is released in Dengeki Daioh magazine. An anime adaptation is then produced by Trans Arts and was aired TV Tokyo from April 2, 1999 to September 24, 1999, with a total of 26 episodes. Enoki Films holds the United States anime license under the name Jester the Adventurer. AnimeWorks translated and released the anime on DVD as Gokudo. Featured Crew KIRISHIMAMA Takeru Creator NAKAMURA Usagi Creator AKIMOTO Naoya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akira Ishida Gokudou Sayuri Yoshida Ruubet Shin'ichirou Miki Prince Yuu Shimaka Jin Akira Ishida Justice Full Cast & Crew Last Season Season 1 1999 | 26 Episodes Season 1 of Gokudo premiered on April  2, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gokudo. You can help by rating TV shows you've seen. Facts Original Name  ゴクドーくん漫遊記 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 8 BrerFox 7 alexboom31 f 2 finalecco  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}