{"link": "https://www.themoviedb.org/tv/26340?language=en", "title": "Now and Then, Here and There", "resume": "Shu is a typical Japanese boy, but has an unbeatable, optimistic and determined attitude. However, when he sees a mysterious girl with strange eyes named Lala-Ru up on a smokestack, he is soon pulled into a strange desert world. Shu soon discovers the true terrors of war, which includes genocide, brutal torture, hunger, thirst, and child explotation. Now Shu is trying to save Lala-Ru, as well as his hard earned, and often relunctant, new friends from the insane dictator, Hamdo. Whether Shu can possibly accomplish saving those he cares about while still holding up to his values remains to be seen.", "rate": 73, "genre": ["Animation", "Sci-Fi", "Fantasy", "War", "Politics"], "cast": ["Akemi Okamura", "Kaori Nazuka", "Azusa Nakao", "Yuka Imai"], "character": ["Shuuzou Matsutani (voice)", "Lala-Ru (voice)", "Sara Ringwalt (voice)", "Nabuca (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26340   Expand Now and Then, Here and There   (1999) User Score  Play Trailer Overview Shu is a typical Japanese boy, but has an unbeatable, optimistic and determined attitude. However, when he sees a mysterious girl with strange eyes named Lala-Ru up on a smokestack, he is soon pulled into a strange desert world. Shu soon discovers the true terrors of war, which includes genocide, brutal torture, hunger, thirst, and child explotation. Now Shu is trying to save Lala-Ru, as well as his hard earned, and often relunctant, new friends from the insane dictator, Hamdo. Whether Shu can possibly accomplish saving those he cares about while still holding up to his values remains to be seen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akemi Okamura Shuuzou Matsutani (voice) Kaori Nazuka Lala-Ru (voice) Azusa Nakao Sara Ringwalt (voice) Yuka Imai Nabuca (voice) Full Cast & Crew Last Season Season 1 1999 | 13 Episodes Season 1 of Now and Then, Here and There premiered on October 14, 1999. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Now and Then, Here and There. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  0 Posters  5 Recommendations   2012-10-06 JoJo's Bizarre Adventure 7.1    2007-10-05 Battlestar Galactica: Razor Flashbacks 7.0    2011-10-02 Fate/Zero 7.9    2004-04-06 Monster 7.7    2007-04-01 Gurren Lagann 7.9    2008-07-13 Generation Kill 8.1  Facts Original Name  今、そこにいる僕 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy War & Politics Keywords dystopia alternate dimension water shortage child soldier Content Score 79 Pump it up! We're close now. Top Contributors L 53 Law 19 Banana c 5 cloudd901 3 SkullCollector  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}