{"link": "https://www.themoviedb.org/tv/3237?language=en", "title": "The Ellen Show", "resume": "The Ellen Show is a television sitcom starring Ellen DeGeneres that was broadcast during the 2001–2002 season on CBS. It was DeGeneres's second attempt at a sitcom, following Ellen on ABC, but it was unable to attract strong ratings and was quickly cancelled.\nAfter coming out as a lesbian on her first sitcom, DeGeneres's character on The Ellen Show, Ellen Richmond, was also a lesbian, although the show did not focus as heavily on the character's sexuality as did the final season of her first sitcom.\nThe Ellen Show also starred Cloris Leachman, Martin Mull, Kerri Kenney, Jim Gaffigan and Emily Rutherfurd.", "rate": 95, "genre": ["Comedy"], "cast": ["Ellen DeGeneres", "Jim Gaffigan", "Martin Mull", "Emily Rutherfurd", "Cloris Leachman"], "character": ["Ellen Richmond", "Rusty Carnouk", "Ed Munn", "Catherine Richmond", "Dot Richmond"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3237   Expand The Ellen Show   (2001) User Score Overview The Ellen Show is a television sitcom starring Ellen DeGeneres that was broadcast during the 2001–2002 season on CBS. It was DeGeneres's second attempt at a sitcom, following Ellen on ABC, but it was unable to attract strong ratings and was quickly cancelled. After coming out as a lesbian on her first sitcom, DeGeneres's character on The Ellen Show, Ellen Richmond, was also a lesbian, although the show did not focus as heavily on the character's sexuality as did the final season of her first sitcom. The Ellen Show also starred Cloris Leachman, Martin Mull, Kerri Kenney, Jim Gaffigan and Emily Rutherfurd. Featured Crew Ellen DeGeneres Creator Mitchell Hurwitz Creator Carol Leifer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ellen DeGeneres Ellen Richmond Jim Gaffigan Rusty Carnouk Martin Mull Ed Munn Emily Rutherfurd Catherine Richmond Cloris Leachman Dot Richmond Full Cast & Crew Last Season Season 1 2001 | 17 Episodes Season 1 of The Ellen Show premiered on September 24, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Ellen Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors D 2 Daniel 1 Banana 1 a.cahyadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}