{"link": "https://www.themoviedb.org/tv/69610?language=en", "title": "Naked Fireman", "resume": "Kang Chul Soo (Lee Joon Hyuk) is an enthusiastic fireman. He poses as a nude model to make money for his sick friend. He is then targeted as the criminal of an arson-murder case that took place 10 years. Kang Chul Soo and mysterious heiress Han Jin Ah (Jung In Sun) try to find the real culprit.", "rate": 70, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Lee Joon-hyuk", "Jung In-Sun", "Jo Hee-bong", "Seo Jeong-yeon", "Lee Won-Jong"], "character": ["Kang Chul Soo", "Han Jin Ah", "Kwon Jeong Nam", "Han Song Ja", "Jang Kwang Ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69610   Expand Naked Fireman   (2017) User Score Overview Kang Chul Soo (Lee Joon Hyuk) is an enthusiastic fireman. He poses as a nude model to make money for his sick friend. He is then targeted as the criminal of an arson-murder case that took place 10 years. Kang Chul Soo and mysterious heiress Han Jin Ah (Jung In Sun) try to find the real culprit. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Joon-hyuk Kang Chul Soo Jung In-Sun Han Jin Ah Jo Hee-bong Kwon Jeong Nam Seo Jeong-yeon Han Song Ja Lee Won-Jong Jang Kwang Ho Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of Naked Fireman premiered on January 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Naked Fireman. You can help by rating TV shows you've seen. Facts Original Name  맨몸의 소방관 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/fireman/index.html Genres Crime Drama Mystery Keywords korea Content Score 93 Almost there... Top Contributors 14 mp4soju M 13 Maria180493 11 andermairena z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}