{"link": "https://www.themoviedb.org/tv/46415?language=en", "title": "A Moody Christmas", "resume": "Focused on the lovable, yet seasonally dysfunctional Moody family, A Moody Christmas is set against the backdrop of the one occasion that can bring out the best (and the worst) in people … Christmas Day.", "rate": 80, "genre": ["Comedy"], "cast": ["Ian Meadows", "Patrick Brammall", "Jane Harber", "Danny Adcock", "Robina Beard"], "character": ["Dan Moody", "Sean Moody", "Cora Benson", "Kevin Moody", "Gwen Dawes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46415   Expand A Moody Christmas   (2012) User Score  Play Trailer Overview Focused on the lovable, yet seasonally dysfunctional Moody family, A Moody Christmas is set against the backdrop of the one occasion that can bring out the best (and the worst) in people … Christmas Day. Featured Crew Trent O'Donnell Creator Phil Lloyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Meadows Dan Moody Patrick Brammall Sean Moody Jane Harber Cora Benson Danny Adcock Kevin Moody Robina Beard Gwen Dawes Full Cast & Crew Last Season Series 1 2012 | 6 Episodes Season 1 of A Moody Christmas premiered on October 31, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2012-10-31 The Moodys 7.6  Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/amoodychristmas/ Genres Comedy Keywords dysfunctional family christmas Content Score 100 Yes! Looking good! Top Contributors 26 United600 8 Banana TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}