{"link": "https://www.themoviedb.org/tv/32415?language=en", "title": "Conan", "resume": "Conan is a late-night talk show airing each Monday through Thursday on TBS in the United States. The hourlong show premiered on November 8, 2010, and is hosted by writer, comedian and performer Conan O'Brien. The program's host previously starred on NBC's Late Night with Conan O'Brien for 16 years, then presented The Tonight Show for seven months until Jay Leno's return to his version of The Tonight Show due to the 2010 Tonight Show conflict.\nDescribing itself as a traditional late-night talk show, Conan draws its comedy from recent news stories, political figures and prominent celebrities, as well as aspects of the show itself. The show typically opens with a monologue from Conan O'Brien relating to recent headlines and frequently features exchanges with his sidekick, Andy Richter, and members of the audience. The next segment is devoted to a celebrity interview, with guests ranging from actors and musicians to media personalities and political figures. The show then closes with either a musical or comedy performance.\nIn January 2010, after The Tonight Show with Conan O'Brien had been on the air for seven months, it was announced that NBC intended to move Jay Leno from primetime back to his original timeslot, with O'Brien's show starting shortly after midnight. Following a brief conflict, NBC announced that they had paid $45 million to buy out O'Brien's contract, ending his relationship with the network. Months after his official leave, O'Brien went on a comedy tour called The Legally Prohibited from Being Funny on Television Tour, which was largely inspired by the outpouring of support for O'Brien on the Internet during the conflict. It was announced on the first day of the tour that O'Brien would be joining TBS in November.", "rate": 75, "genre": ["Talk", "Comedy"], "cast": ["Conan O'Brien"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32415   Expand Conan   (2010) User Score Overview Conan is a late-night talk show airing each Monday through Thursday on TBS in the United States. The hourlong show premiered on November 8, 2010, and is hosted by writer, comedian and performer Conan O'Brien. The program's host previously starred on NBC's Late Night with Conan O'Brien for 16 years, then presented The Tonight Show for seven months until Jay Leno's return to his version of The Tonight Show due to the 2010 Tonight Show conflict. Describing itself as a traditional late-night talk show, Conan draws its comedy from recent news stories, political figures and prominent celebrities, as well as aspects of the show itself. The show typically opens with a monologue from Conan O'Brien relating to recent headlines and frequently features exchanges with his sidekick, Andy Richter, and members of the audience. The next segment is devoted to a celebrity interview, with guests ranging from actors and musicians to media personalities and political figures. The show then closes with either a musical or comedy performance. In January 2010, after The Tonight Show with Conan O'Brien had been on the air for seven months, it was announced that NBC intended to move Jay Leno from primetime back to his original timeslot, with O'Brien's show starting shortly after midnight. Following a brief conflict, NBC announced that they had paid $45 million to buy out O'Brien's contract, ending his relationship with the network. Months after his official leave, O'Brien went on a comedy tour called The Legally Prohibited from Being Funny on Television Tour, which was largely inspired by the outpouring of support for O'Brien on the Internet during the conflict. It was announced on the first day of the tour that O'Brien would be joining TBS in November. Featured Crew Conan O'Brien Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  14 Posters  7 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Conan O'Brien Himself - Host Full Cast & Crew Current Season Season 8 2017 | 9 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Has not been funny for ages Open 0 by  regiment500 Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  7 Recommendations   2009-06-01 The Tonight Show with Conan O'Brien 7.8    1993-09-13 Late Night with Conan O'Brien 7.3    2009-03-02 Late Night with Jimmy Fallon 6.0    2005-01-03 The Late Late Show with Craig Ferguson 7.5    1993-08-30 Late Show with David Letterman 6.9    1992-05-25 The Tonight Show with Jay Leno 5.0    2003-01-26 Jimmy Kimmel Live! 6.0    2015-09-08 The Late Show with Stephen Colbert 6.4  Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  60m, 42m Homepage   http://www.teamcoco.com Genres Talk Comedy Keywords talk show celebrity musical number Content Score 71 Just a little bit more... Top Contributors 16 Elizabeth Jennings 15 Travis Bell TB 10 TMDb Bot 7 Nero Kosonen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}