{"link": "https://www.themoviedb.org/tv/73320?language=en", "title": "American Monster", "resume": "If you looked into the eyes of a killer, would you know? In American Monster, you find out. For the first time, viewers get closer than ever to some of America's most shocking and surprising crimes. Filled with never-before-seen footage of these devils in disguise, from home movie shots of them playing with their kids to musical performances at high school, from the church cook-out to the wedding video, American Monsterinterweaves twisting-turning stories of astonishing crimes, with 'behind-the-scenes' footage of killers at their seemingly most innocent.", "rate": 0, "genre": ["Reality", "Crime", "Documentary"], "cast": ["Tom Streithorst"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73320   Expand American Monster   (2016) User Score  Play Trailer Overview If you looked into the eyes of a killer, would you know? In American Monster, you find out. For the first time, viewers get closer than ever to some of America's most shocking and surprising crimes. Filled with never-before-seen footage of these devils in disguise, from home movie shots of them playing with their kids to musical performances at high school, from the church cook-out to the wedding video, American Monsterinterweaves twisting-turning stories of astonishing crimes, with 'behind-the-scenes' footage of killers at their seemingly most innocent. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Streithorst Narrator Full Cast & Crew Last Season Season 1 2016 | 1 Episode Season 1 of American Monster premiered on June  1, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply The Last Broadcast Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on American Monster. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   https://www.investigationdiscovery.com/tv-shows/american-monster/ Genres Reality Crime Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors - 18 -Alexander- N 1 Neobond007  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}