{"link": "https://www.themoviedb.org/tv/73506?language=en", "title": "Full Moon", "resume": "Ferit Aslan is a very successful businessman, and is extremely organized. He wants the same manner of organization in both his private and professional life. Nazli who is studying gastronomy needs to find a job immediately as she is responsible for covering the expenses of the home she shares with her friend and sister. She is a stubborn and adamant personality, so she has a tough time keeping a job. Both completely opposites, meet each other in this series.", "rate": 82, "genre": ["Comedy", "Drama"], "cast": ["Özlem Türay", "Alara Bozbey", "Yeşim Kalkan", "Murat Cen", "Ozge Gurel"], "character": ["İkbal", "Demet", "Buse", "Uğur", "Nazli"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73506   Expand Full Moon   (2017) User Score Overview Ferit Aslan is a very successful businessman, and is extremely organized. He wants the same manner of organization in both his private and professional life. Nazli who is studying gastronomy needs to find a job immediately as she is responsible for covering the expenses of the home she shares with her friend and sister. She is a stubborn and adamant personality, so she has a tough time keeping a job. Both completely opposites, meet each other in this series. Featured Crew Çağrı Bayrak Creator Tarık Erkan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Özlem Türay İkbal Alara Bozbey Demet Yeşim Kalkan Buse Murat Cen Uğur Ozge Gurel Nazli Full Cast & Crew Last Season Season 1 2017 | 26 Episodes Season 1 of Full Moon premiered on July  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Full Moon. You can help by rating TV shows you've seen. Facts Original Name  Dolunay Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 33 zerox 20 Elizabeth Jennings 19 moviefars s 4 signature  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}