{"link": "https://www.themoviedb.org/tv/33050?language=en", "title": "Pioneer One", "resume": "Pioneer One is a 2010 American web series produced by Josh Bernhard and Bracey Smith. It has been funded purely through donations, and is the first series created for and released on BitTorrent networks.", "rate": 63, "genre": ["Action", "Adventure", "Mystery", "Sci-Fi", "Fantasy", "War", "Politics"], "cast": ["Alexandra Blatt", "Laura Graham", "Jack Haley", "James Rich", "Einar Gunn"], "character": ["Sofie Larson", "Jane", "Zachary Walzer", "Tom Taylor", "Secretary McClellan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33050   Expand Pioneer One   (2010) User Score  Play Trailer Overview Pioneer One is a 2010 American web series produced by Josh Bernhard and Bracey Smith. It has been funded purely through donations, and is the first series created for and released on BitTorrent networks. Featured Crew Josh Bernhard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexandra Blatt Sofie Larson Laura Graham Jane Jack Haley Zachary Walzer James Rich Tom Taylor Einar Gunn Secretary McClellan Full Cast & Crew Last Season Season 1 2010 | 6 Episodes Season 1 of Pioneer One premiered on June 16, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  1 Recommendations   1987-09-05 På spåret 5.0    2004-08-30 John Safran vs God 7.3    2011-01-06 The Reckoning 3.7    2013-11-07 Folkets främsta företrädare 5.0    2016-04-25 After the Thrones 4.6    1999-01-18 Parlamentet 3.0    2002-10-31 Värsta språket 6.0    1991-12-01 Sunes jul 6.6  Facts Status  Ended Networks - Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  60m Homepage   http://www.pioneerone.tv Genres Action & Adventure Mystery Sci-Fi & Fantasy War & Politics Keywords war politics Content Score 100 Yes! Looking good! Top Contributors 21 joel6 14 Mitsarinho w 3 webmaster f 3 fanotriel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}