{"link": "https://www.themoviedb.org/tv/11092?language=en", "title": "Bionic Six", "resume": "Bionic Six is an American/Japanese animated television series from 1987, produced by TMS Entertainment and distributed by MCA TV. Renowned Japanese animation director Osamu Dezaki was involved as chief supervising director, whose distinctive style is evident throughout.\nThe cartoon originally aired in North American syndication, in later years reappearing on the Sci-Fi Channel.\nThe title characters of the series are a family of machine-enhanced human beings possessing unique powers after being augmented with bionic technology, much like The Six Million Dollar Man and The Bionic Woman. Each family member is given specific bionic powers, and thus they form a superhero team named Bionic Six.", "rate": 72, "genre": ["Animation"], "cast": ["Jennifer Darling", "Frank Welker", "Alan Oppenheimer", "Neil Ross", "Brian Tochi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11092   Expand Bionic Six   (1992) User Score Overview Bionic Six is an American/Japanese animated television series from 1987, produced by TMS Entertainment and distributed by MCA TV. Renowned Japanese animation director Osamu Dezaki was involved as chief supervising director, whose distinctive style is evident throughout. The cartoon originally aired in North American syndication, in later years reappearing on the Sci-Fi Channel. The title characters of the series are a family of machine-enhanced human beings possessing unique powers after being augmented with bionic technology, much like The Six Million Dollar Man and The Bionic Woman. Each family member is given specific bionic powers, and thus they form a superhero team named Bionic Six. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Darling Frank Welker Alan Oppenheimer Neil Ross Brian Tochi Full Cast & Crew Last Season Season 2 1992 | 43 Episodes Season 2 of Bionic Six premiered on December 19, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bionic Six. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 Marr 🇳🇱 m 3 marv85 NS 3 Norte Serra 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}