{"link": "https://www.themoviedb.org/tv/61212?language=en", "title": "Wild Heart", "resume": "Park was mistreated by his stepfather and he mistaken that his mother doesn't love him so he ran away from home at a young age. He was helped by this rich man who took him in as a son. Amawasee is the niece of Park's stepfather. She was sad when Park left because he was nice to her and she has feeling for him.\nYears later Amawasee meets Park again as the man who brought the house his stepfather put on sale because the family was having financial difficulty due to Park's younger brother. Amawasee knew that he's her P'Park despite his cold demeanor but Park refused to accept that he's P'Park, calling himself Raj Rutchapbumi now.\nThen Amawasee was forced to marry his younger brother by her uncle. She agreed as a way to repay her uncle for raising her. After Park knew about the wedding between Amawasee and his brother he kidnapped her to his farm. He told her kidnapping her is part of his revenge against his family but really he didn't want Amawasee to marry his brother because he loves her. He blamed Amawasee as well for turning him into a cold and heartless person who has no family. To keep her by his side he must pretend to hate her but he knows she's the only person who has always been kind to him. She's the person who will mend his broken heart and patch things up between him and his family.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Akkaphan Namart", "Usamanee Vaithayanon", "Pichayadon Peungphan", "Kanyakorn Pinij", "Nichanun Funkaew"], "character": ["Park/Raj Rutchapbumi", "Amawasee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61212   Expand Wild Heart   (2014) User Score Overview Park was mistreated by his stepfather and he mistaken that his mother doesn't love him so he ran away from home at a young age. He was helped by this rich man who took him in as a son. Amawasee is the niece of Park's stepfather. She was sad when Park left because he was nice to her and she has feeling for him. Years later Amawasee meets Park again as the man who brought the house his stepfather put on sale because the family was having financial difficulty due to Park's younger brother. Amawasee knew that he's her P'Park despite his cold demeanor but Park refused to accept that he's P'Park, calling himself Raj Rutchapbumi now. Then Amawasee was forced to marry his younger brother by her uncle. She agreed as a way to repay her uncle for raising her. After Park knew about the wedding between Amawasee and his brother he kidnapped her to his farm. He told her kidnapping her is part of his revenge against his family but really he didn't want Amawasee to marry his brother because he loves her. He blamed Amawasee as well for turning him into a cold and heartless person who has no family. To keep her by his side he must pretend to hate her but he knows she's the only person who has always been kind to him. She's the person who will mend his broken heart and patch things up between him and his family. Featured Crew Saranyu Wongkrajarng Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akkaphan Namart Park/Raj Rutchapbumi Usamanee Vaithayanon Amawasee Pichayadon Peungphan Kanyakorn Pinij Nichanun Funkaew Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Wild Heart premiered on June 25, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Wild Heart. You can help by rating TV shows you've seen. Facts Original Name  Hua Jai Teuan Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  75m Homepage   http://drama.ch7.com/detail/74108/%E0%B8%AB%E0%B8%B1%E0%B8%A7%E0%B9%83%E0%B8%88%E0%B9%80%E0%B8%96%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%99.html Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 54 Crip z 10 zurman1 7 Elizabeth Jennings 4 mariilakorn21  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}