{"link": "https://www.themoviedb.org/tv/13250?language=en", "title": "Rain Shadow", "resume": "Rain Shadow is an Australian television drama series which premiered on 7 October 2007 on ABC TV. It aired on Sundays at 8.30 pm. The six-part series was produced by Southern Star. Music from The Audreys features in the soundtrack for the show, including the main theme.\nRain Shadow was shot in the Adelaide Hills in South Australia and is set in the fictional district of Paringa, a dry land farming area in a rain shadow. It tells the story of two characters who become the means of each other's future. It stars Rachel Ward as district vet Kate McDonald and Victoria Thaine as new veterinary assistant Jill Blake.", "rate": 0, "genre": ["Drama"], "cast": ["Gary Sweet", "Rachel Ward", "Grant Piro", "Victoria Thaine", "Edwin Hodgeman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13250   Expand Rain Shadow   (2007) User Score Overview Rain Shadow is an Australian television drama series which premiered on 7 October 2007 on ABC TV. It aired on Sundays at 8.30 pm. The six-part series was produced by Southern Star. Music from The Audreys features in the soundtrack for the show, including the main theme. Rain Shadow was shot in the Adelaide Hills in South Australia and is set in the fictional district of Paringa, a dry land farming area in a rain shadow. It tells the story of two characters who become the means of each other's future. It stars Rachel Ward as district vet Kate McDonald and Victoria Thaine as new veterinary assistant Jill Blake. Featured Crew Tony Morphett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Sweet Rachel Ward Grant Piro Victoria Thaine Edwin Hodgeman Full Cast & Crew Last Season Season 1 2007 | 6 Episodes Season 1 of Rain Shadow premiered on October  7, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rain Shadow. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.southernstargroup.com/production/production.aspx?programId=23 Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 6 bigyellowbird TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}