{"link": "https://www.themoviedb.org/tv/2418?language=en", "title": "The Venture Bros.", "resume": "Hank and Dean Venture, with their father Doctor Venture and faithful bodyguard Brock Samson, go on wild adventures facing megalomaniacs, zombies, and suspicious ninjas, all for the glory of adventure. Or something like that.", "rate": 82, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Doc Hammer", "Christopher McCulloch", "Patrick Warburton", "James Urbaniak", "Michael Sinterniklaas"], "character": ["Dr. Girlfriend / Henchman 21 (voice)", "Hank Venture / The Monarch (voice)", "Brock Samson (voice)", "Dr. Venture (voice)", "Dean Venture (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2418   Expand The Venture Bros.   (2004) User Score  Play Trailer Overview Hank and Dean Venture, with their father Doctor Venture and faithful bodyguard Brock Samson, go on wild adventures facing megalomaniacs, zombies, and suspicious ninjas, all for the glory of adventure. Or something like that. Featured Crew Christopher McCulloch Creator Doc Hammer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  15 Posters  7 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Doc Hammer Dr. Girlfriend / Henchman 21 (voice) Christopher McCulloch Hank Venture / The Monarch (voice) Patrick Warburton Brock Samson (voice) James Urbaniak Dr. Venture (voice) Michael Sinterniklaas Dean Venture (voice) Full Cast & Crew Last Season Season 6 2016 | 8 Episodes Season 6 of The Venture Bros. premiered on February  1, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for The Venture Bros.. Login to be first! Go to Discussions Media Most Popular Videos  4 Backdrops  15 Posters  7 Recommendations   2000-12-30 Aqua Teen Hunger Force 7.2    2000-12-30 Harvey Birdman, Attorney at Law 7.7    1994-04-15 Space Ghost Coast to Coast 8.3    2006-10-16 Frisky Dingo 8.1    1994-09-10 The Tick 7.7    2006-08-06 Metalocalypse 6.9    2005-02-20 Robot Chicken 7.1    2005-11-06 The Boondocks 7.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.adultswim.com/videos/the-venture-bros/ Genres Animation Action & Adventure Comedy Keywords sibling relationship bodyguard superhero black humor secret agent parody sexual humor spoof nemesis robot scientist science adult animation dark humor super villain jonny quest archenemy Content Score 100 Yes! Looking good! Top Contributors 28 Razze 22 Elizabeth Jennings 20 Stephen z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}