{"link": "https://www.themoviedb.org/tv/30908?language=en", "title": "Dennis the Menace and Gnasher", "resume": "Based on the iconic D.C. Thomson comic strip Dennis the Menace, this 2D-animated series follows the mischievous adventures of Dennis and his best friend Gnasher the dog.", "rate": 65, "genre": ["Animation"], "cast": ["Sophie Aldred", "Rob Rackstraw", "Jimmy Hibbert", "Keith Scott", "Sarah Aubrey"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30908   Expand Dennis the Menace and Gnasher   (2009) User Score  Play Trailer Overview Based on the iconic D.C. Thomson comic strip Dennis the Menace, this 2D-animated series follows the mischievous adventures of Dennis and his best friend Gnasher the dog. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sophie Aldred Rob Rackstraw Jimmy Hibbert Keith Scott Sarah Aubrey Full Cast & Crew Last Season Series 2 2013 | 35 Episodes Season 2 of Dennis the Menace and Gnasher premiered on July  8, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dennis the Menace and Gnasher. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  10m Homepage   http://www.bbc.co.uk/programmes/b00mr0kc Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 17 United600 TB 1 TMDb Bot - 1 -Alexander- m 1 mdkFL  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}