{"link": "https://www.themoviedb.org/tv/55549?language=en", "title": "George Clarke's Amazing Spaces", "resume": "For many the dream of having a bolt hole or a place to escape from their hectic lives can seem unobtainable. Architect George Clarke shows how such big dreams can be achieved in small and affordable places. George delves into the extraordinary world of small builds to meet the highly creative people who are taking tiny, unpromising spaces and creating the most incredible places to live and work and play. There are homes made out of shipping containers, horseboxes, and old buses. Others are building tiny huts or incredible treehouses in the middle of the woods.", "rate": 90, "genre": ["Documentary"], "cast": ["George Clarke"], "character": ["er selbst"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55549   Expand George Clarke's Amazing Spaces   (2012) User Score Overview For many the dream of having a bolt hole or a place to escape from their hectic lives can seem unobtainable. Architect George Clarke shows how such big dreams can be achieved in small and affordable places. George delves into the extraordinary world of small builds to meet the highly creative people who are taking tiny, unpromising spaces and creating the most incredible places to live and work and play. There are homes made out of shipping containers, horseboxes, and old buses. Others are building tiny huts or incredible treehouses in the middle of the woods. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Clarke er selbst Full Cast & Crew Last Season Season 6 2017 | 9 Episodes Season 6 of George Clarke's Amazing Spaces premiered on June 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on George Clarke's Amazing Spaces. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification 0 Meaning Can be aired at any time. Type  Documentary Original Language  English Runtime  45m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors f 25 fita24 r 4 rectifyer M 2 Maik 1 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}