{"link": "https://www.themoviedb.org/tv/1171?language=en", "title": "Tenacious D", "resume": "Tenacious D: The Greatest Band on Earth is a TV series that ran on HBO in 1997, 1999 and 2000. It featured the fictional accounts of the real band Tenacious D, which is composed of members Jack Black and Kyle Gass. All of the episodes of the show are available on Tenacious D's The Complete Masterworks DVD.\nThe show included many songs that would later be recorded for their studio albums Tenacious D and The Pick of Destiny.", "rate": 68, "genre": ["Comedy"], "cast": ["Laura Kightlinger", "Jack Black", "Kyle Gass", "Paul F. Tompkins", "David Cross"], "character": ["Paul", "Comic Dressed as Nun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1171   Expand Tenacious D   (1997) User Score Overview Tenacious D: The Greatest Band on Earth is a TV series that ran on HBO in 1997, 1999 and 2000. It featured the fictional accounts of the real band Tenacious D, which is composed of members Jack Black and Kyle Gass. All of the episodes of the show are available on Tenacious D's The Complete Masterworks DVD. The show included many songs that would later be recorded for their studio albums Tenacious D and The Pick of Destiny. Featured Crew Kyle Gass Creator Jack Black Creator David Cross Creator Bob Odenkirk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laura Kightlinger Jack Black Kyle Gass Paul F. Tompkins Paul David Cross Comic Dressed as Nun Full Cast & Crew Last Season Season 1 1997 | 6 Episodes Season 1 of Tenacious D premiered on November 28, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2011-01-06 The Reckoning 3.7    1987-09-05 På spåret 5.0    2016-04-25 After the Thrones 4.6    2013-11-07 Folkets främsta företrädare 5.0    2002-10-31 Värsta språket 6.0    2004-08-30 John Safran vs God 7.3    1999-01-18 Parlamentet 3.0    2001-01-17 Uppdrag granskning 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  15m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 9 kiko1c  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}