{"link": "https://www.themoviedb.org/tv/64046?language=en", "title": "Long Live the Royals", "resume": "Long Live the Royals follows a fictional British Royal Family—King Rufus and Queen Eleanor and their children Peter, Rosalind, Eddy, and Alex—as they honor the annual Yule Hare Festival. The family must battle having to rule their kingdom while maintaining a normal family at the same time. Meanwhile, the festival continues with the parties and feasts that comprise it.", "rate": 75, "genre": ["Animation", "Comedy"], "cast": ["Jane Horrocks", "Kieran Culkin", "Nikki Rapp", "Horatio Sanz", "Peter Serafinowicz"], "character": ["Queen Eleanor (UK)", "Peter", "Alex", "Allistair,Knight #1, Gorgeous, Mud Dad", "Frederick, Announcer,Demonic Hare"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64046   Expand Long Live the Royals   (2015) User Score  Play Trailer Overview Long Live the Royals follows a fictional British Royal Family—King Rufus and Queen Eleanor and their children Peter, Rosalind, Eddy, and Alex—as they honor the annual Yule Hare Festival. The family must battle having to rule their kingdom while maintaining a normal family at the same time. Meanwhile, the festival continues with the parties and feasts that comprise it. Featured Crew Sean Szeles Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jane Horrocks Queen Eleanor (UK) Kieran Culkin Peter Nikki Rapp Alex Horatio Sanz Allistair,Knight #1, Gorgeous, Mud Dad Peter Serafinowicz Frederick, Announcer,Demonic Hare Full Cast & Crew Last Season Season 1 2015 | 4 Episodes Season 1 of Long Live the Royals premiered on November 30, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Long Live the Royals. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  11m Homepage  - Genres Animation Comedy Keywords miniseries Content Score 100 Yes! Looking good! Top Contributors TB 24 TMDb Bot R 11 Rebecca n 8 nexuwolf7 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}