{"link": "https://www.themoviedb.org/tv/31931?language=en", "title": "Will It Snow For Christmas?", "resume": "Cha Kang Jin grows up in a poor family who is constantly on the move. After relocating to his mother's hometown when Kang Jin is a teenager, his mother falls back into her old ways, opening a bar that draws a group of undesirable men. Kang Jin is forced to watch helplessly from the sidelines, getting into fights with other high school students to protect her honor. When he meets Han Ji Wan at school, sparks fly immediately, but tragedy soon strikes when Ji Wan suddenly must leave town. Eight years later, Kang Jin finally finds her again—at her engagement party. Never able to forget the girl he loved and hurt so badly, Kang Jin has trouble accepting the loss of his love, and after discovering that Ji Wan's fiancée is his co-worker, the three soon become hopelessly entangled in each other's lives.", "rate": 80, "genre": ["Drama"], "cast": ["Go Soo", "Han Ye-seul", "Song Jong-ho", "Song Joong-ki", "Kim Soo-Hyun"], "character": ["Cha Kang Jin", "Han Ji Wan", "Park Tae Joon", "Han Ji Yong", "Kang Jin (teen)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31931   Expand Will It Snow For Christmas?   (2009) User Score Overview Cha Kang Jin grows up in a poor family who is constantly on the move. After relocating to his mother's hometown when Kang Jin is a teenager, his mother falls back into her old ways, opening a bar that draws a group of undesirable men. Kang Jin is forced to watch helplessly from the sidelines, getting into fights with other high school students to protect her honor. When he meets Han Ji Wan at school, sparks fly immediately, but tragedy soon strikes when Ji Wan suddenly must leave town. Eight years later, Kang Jin finally finds her again—at her engagement party. Never able to forget the girl he loved and hurt so badly, Kang Jin has trouble accepting the loss of his love, and after discovering that Ji Wan's fiancée is his co-worker, the three soon become hopelessly entangled in each other's lives. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Go Soo Cha Kang Jin Han Ye-seul Han Ji Wan Song Jong-ho Park Tae Joon Song Joong-ki Han Ji Yong Kim Soo-Hyun Kang Jin (teen) Full Cast & Crew Last Season Season 1 2009 | 16 Episodes Season 1 of Will It Snow For Christmas? premiered on December  2, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Will It Snow For Christmas?. You can help by rating TV shows you've seen. Facts Original Name  크리스마스에 눈이 올까요? Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/christmas/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 18 Elizabeth Jennings N 12 Nightowl.Kr t 9 tmdb983464 3 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}