{"link": "https://www.themoviedb.org/tv/61053?language=en", "title": "Up on High Ground", "resume": "A likable college psychology student is tested daily with his roomies, one in friendship, and the other on patience as a third wheel freeloader. A contemporary life effort in the psychological, even pathological, and pretty typical day of students who make this school of no fools and broken rules.", "rate": 100, "genre": ["Drama"], "cast": ["Brayden Patterson", "Cody Jarvis", "Rylee Cravens", "Billy Patricks", "Sydney Thomas"], "character": ["Dillon Magnum", "Landon Lofton", "Savannah Swanson", "Bartholowmew Bogroe", "Sydney Ashdown"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61053   Expand Up on High Ground   (2014) User Score  Play Trailer Overview A likable college psychology student is tested daily with his roomies, one in friendship, and the other on patience as a third wheel freeloader. A contemporary life effort in the psychological, even pathological, and pretty typical day of students who make this school of no fools and broken rules. Featured Crew Bryan Kreutz Creator Brayden Patterson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Brayden Patterson Dillon Magnum Cody Jarvis Landon Lofton Rylee Cravens Savannah Swanson Billy Patricks Bartholowmew Bogroe Sydney Thomas Sydney Ashdown Full Cast & Crew Last Season Season 1 2014 | 9 Episodes Season 1 of Up on High Ground premiered on October 25, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Up on High Ground. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  28m Homepage   http://uponhighgroundtv.com/ Genres Drama Keywords high school christianity roommate christian neighbor school student teenager freeloader Content Score 100 Yes! Looking good! Top Contributors b 86 bpatterson b 26 bryankreutz 3 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}