{"link": "https://www.themoviedb.org/tv/43097?language=en", "title": "Saving Hope", "resume": "When Charlie Harris ends up in a coma, he leaves the Hope-Zion Hospital in chaos - and his fiancée and fellow surgeon, Alex Reid, in a state of shock. As the staff of Hope-Zion races to save lives, comatose Dr. Harris wanders the halls of Hope-Zee in \"spirit\" form, not sure if he's a ghost or a figment of his own imagination.", "rate": 59, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Erica Durance", "Julia Chan", "Michael Shanks", "Wendy Crewson", "Benjamin Ayres"], "character": ["Dr. Alex Reid", "Dr. Maggie Lin", "Dr. Charlie Harris", "Dr. Dana Kinney", "Dr. Zachary Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43097   Expand Saving Hope   (2012) User Score  Play Trailer Overview When Charlie Harris ends up in a coma, he leaves the Hope-Zion Hospital in chaos - and his fiancée and fellow surgeon, Alex Reid, in a state of shock. As the staff of Hope-Zion races to save lives, comatose Dr. Harris wanders the halls of Hope-Zee in \"spirit\" form, not sure if he's a ghost or a figment of his own imagination. Featured Crew Morwyn Brebner Creator Malcolm MacRury Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  13 Images Backdrops  18 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erica Durance Dr. Alex Reid Julia Chan Dr. Maggie Lin Michael Shanks Dr. Charlie Harris Wendy Crewson Dr. Dana Kinney Benjamin Ayres Dr. Zachary Miller Full Cast & Crew Last Season Season 5 2017 | 18 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply s You had me until the finale.... Open 1 by  Oduntola Go to Discussions Media Most Popular Videos  1 Backdrops  18 Posters  9 Recommendations   2017-01-25 Mary Kills People 7.5    2011-01-17 Harry's Law 6.7    2015-02-15 Indian Summers 7.2    2016-01-22 Stan Lee's Lucky Man 7.3    2015-09-30 Code Black 7.0    2016-09-06 StartUp 7.4    2013-02-03 Motive 5.9    2007-02-18 Inspector Lewis 7.6  Facts Status  Ended Network Certification PG Meaning Parental guidance. Moderate violence and moderate profanity is allowed, as is brief nudity and sexual references if important to the context of the story. Type  Scripted Original Language  English Runtime  44m Homepage   http://ctv.ca/SavingHope Genres Sci-Fi & Fantasy Drama Keywords canada toronto psychic power hospital doctor medical drama Content Score 100 Yes! Looking good! Top Contributors 111 Banana 23 Elizabeth Jennings 17 rantamplan 11 CouchTater  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}