{"link": "https://www.themoviedb.org/tv/34163?language=en", "title": "Urusei Yatsura", "resume": "An alien race known as the Oni arrive on Earth to invade the planet. Instead of taking over the planet by force, the Oni give humans a chance to fight for the rights to the planet by taking part in a competition. The computer-selected human player is Ataru Moroboshi, a lecherous, unlucky and stupid high school student from the Japanese city of Tomobiki, and the Oni player is Princess Lum, daughter of the leader of the Invasion force.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Fumi Hirano", "Akira Kamiya", "Toshio Furukawa", "Noriko Ohara", "Saeko Shimazu"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34163   Expand Urusei Yatsura   (1981) User Score Overview An alien race known as the Oni arrive on Earth to invade the planet. Instead of taking over the planet by force, the Oni give humans a chance to fight for the rights to the planet by taking part in a competition. The computer-selected human player is Ataru Moroboshi, a lecherous, unlucky and stupid high school student from the Japanese city of Tomobiki, and the Oni player is Princess Lum, daughter of the leader of the Invasion force. Featured Crew Rumiko Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  8 Images Backdrops  9 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fumi Hirano Akira Kamiya Toshio Furukawa Noriko Ohara  Saeko Shimazu Full Cast & Crew Last Season Season 8 1985 | 25 Episodes Season 8 of Urusei Yatsura premiered on August 28, 1985. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply There are no discussions for Urusei Yatsura. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Urusei Yatsura. You can help by rating TV shows you've seen. Facts Original Name  うる星やつら Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 7 MrTimscampi 3 Sergiojamon 3 Nuno Filipe de Vilhena Santos 3 shizuku  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}