{"link": "https://www.themoviedb.org/tv/40289?language=en", "title": "Fake or Fortune?", "resume": "Journalist Fiona Bruce teams up with art expert Philip Mould to investigate the provenance or attribution of notable artworks.", "rate": 75, "genre": ["Documentary"], "cast": ["Fiona Bruce", "Philip Mould"], "character": ["Herself - Presenter", "Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40289   Expand Fake or Fortune?   (2011) User Score Overview Journalist Fiona Bruce teams up with art expert Philip Mould to investigate the provenance or attribution of notable artworks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fiona Bruce Herself - Presenter Philip Mould Himself - Presenter Full Cast & Crew Last Season Series 4 2015 | 4 Episodes Season 4 of Fake or Fortune? premiered on July  5, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Excellent, true-life art-provenance sleuths Open 0 by PT 100\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Fake or Fortune?. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b01mxxz6 Genres Documentary Keywords art antique Content Score 56 We're so close, yet so far. Top Contributors 30 Elizabeth Jennings TB 2 TMDb Bot R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}