{"link": "https://www.themoviedb.org/tv/79283?language=en", "title": "You Drive Me Crazy", "resume": "Love at first sight is such a wonderful idea. However, how many of us have experienced it in real life? The answer is \"rarely\". If anything, we have mostly seen those occurrences in dramas. Why bother making another drama where a man and a woman cross paths coincidentally and suddenly fall in love? Therefore, this drama plans to show the viewers something more relatable - love that blooms in our everyday lives. This drama shows how a familiar relationship turns into a fluttering relationship, how a friendship suddenly turns into love, and how a once dull life suddenly becomes blinding due to love. This drama is about a man and a woman who have nothing more to share thanks to their completely different personalities. However, they have no idea whom they are in love with. Gradually, they rediscover themselves and reach out for love one step at a time.", "rate": 0, "genre": ["Comedy"], "cast": ["Lee Yoo-young", "Kim Sun-Ho", "Sung Joo", "Kwon Doh-Woon", "Ryoo Hye-Rin"], "character": ["Han Eun-Sung", "Kim Rae-Wan", "Yoon Hee-Nam", "Moon Seo-Jung", "Kang Ji-In"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79283   Expand You Drive Me Crazy   (2018) User Score Overview Love at first sight is such a wonderful idea. However, how many of us have experienced it in real life? The answer is \"rarely\". If anything, we have mostly seen those occurrences in dramas. Why bother making another drama where a man and a woman cross paths coincidentally and suddenly fall in love? Therefore, this drama plans to show the viewers something more relatable - love that blooms in our everyday lives. This drama shows how a familiar relationship turns into a fluttering relationship, how a friendship suddenly turns into love, and how a once dull life suddenly becomes blinding due to love. This drama is about a man and a woman who have nothing more to share thanks to their completely different personalities. However, they have no idea whom they are in love with. Gradually, they rediscover themselves and reach out for love one step at a time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Yoo-young Han Eun-Sung Kim Sun-Ho Kim Rae-Wan Sung Joo Yoon Hee-Nam Kwon Doh-Woon Moon Seo-Jung Ryoo Hye-Rin Kang Ji-In Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of You Drive Me Crazy premiered on May  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on You Drive Me Crazy. You can help by rating TV shows you've seen. Facts Original Name  미치겠다, 너땜에! Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/crazy/ Genres Comedy Keywords romance Content Score 86 Almost there... Top Contributors M 28 Maria180493 k 2 kunamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}