{"link": "https://www.themoviedb.org/tv/61534?language=en", "title": "Love Stage!!", "resume": "Izumi was born in a family of celebrities. His father is a singer, his mother an artist, his older brother the lead vocalist for the popular band Crashers. Izumi himself, however, is just a nerdy college student. He loves the manga \"Magical Girl Lala Lulu\" and dreams of becoming a manga writer himself. One day he is roped into filming a commercial where he wears a dress. Another actor on the set, Ryoma Ichijo, mistakes him for a woman and falls in love at first sight. As it turns out, though, they met ten years in the past. And Ryoma feelings don't change when he finds out Izumi is a boy.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Takuya Eguchi", "Tsubasa Yonaga", "Daisuke Hirakawa", "Daigo"], "character": ["Ryouma Ichijou (voice)", "Izumi Sena (voice)", "Rei Sagara (voice)", "Shougo Sena (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61534   Expand Love Stage!!   (2014) User Score Overview Izumi was born in a family of celebrities. His father is a singer, his mother an artist, his older brother the lead vocalist for the popular band Crashers. Izumi himself, however, is just a nerdy college student. He loves the manga \"Magical Girl Lala Lulu\" and dreams of becoming a manga writer himself. One day he is roped into filming a commercial where he wears a dress. Another actor on the set, Ryoma Ichijo, mistakes him for a woman and falls in love at first sight. As it turns out, though, they met ten years in the past. And Ryoma feelings don't change when he finds out Izumi is a boy. Featured Crew Kenichi Kasai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Eguchi Ryouma Ichijou (voice) Tsubasa Yonaga Izumi Sena (voice) Daisuke Hirakawa Rei Sagara (voice) Daigo Shougo Sena (voice) Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Love Stage!! premiered on July 10, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love Stage!!. You can help by rating TV shows you've seen. Facts Original Name  LOVE STAGE!! Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://lovestage-tv.jp/ Genres Animation Comedy Keywords romance based on manga anime shounen ai Content Score 100 Yes! Looking good! Top Contributors 41 Marr 🇳🇱 S 17 SuperTouch 15 Elizabeth Jennings CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}