{"link": "https://www.themoviedb.org/tv/9642?language=en", "title": "MAZE☆爆熱時空", "resume": "Maze the Megaburst Space is a fantasy anime series featuring both sex-based humor and mecha themes that is based on an original light novel. The anime version was first released as an OVA then a full length TV series and finally as a sequel movie. The OVA and anime TV series versions were licensed in the U.S. by Central Park Media and released on DVD under their Software Sculptors label. The TV Series has aired on Comcast's \"Anime Selects\" On Demand Channel multiple times. The manga has not been released in the U.S.", "rate": 0, "genre": ["Action", "Adventure", "Comedy", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Kotono Mitsuishi", "Unsho Ishizuka", "Sakura Tange", "Ai Orikasa", "Yuuko Kobayashi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9642   Expand MAZE☆爆熱時空   (1997) User Score Overview Maze the Megaburst Space is a fantasy anime series featuring both sex-based humor and mecha themes that is based on an original light novel. The anime version was first released as an OVA then a full length TV series and finally as a sequel movie. The OVA and anime TV series versions were licensed in the U.S. by Central Park Media and released on DVD under their Software Sculptors label. The TV Series has aired on Comcast's \"Anime Selects\" On Demand Channel multiple times. The manga has not been released in the U.S. Featured Crew Satoru Akahori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kotono Mitsuishi Unsho Ishizuka Sakura Tange Ai Orikasa Yuuko Kobayashi Full Cast & Crew Last Season Season 1 1997 | 25 Episodes Season 1 of MAZE☆爆熱時空 premiered on April  2, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on MAZE☆爆熱時空. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Comedy Animation Sci-Fi & Fantasy Keywords mechas Content Score 93 Almost there... Top Contributors 16 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}