{"link": "https://www.themoviedb.org/tv/12376?language=en", "title": "The Eyes of Nye", "resume": "The Eyes of Nye was a science program airing on public television in the United States in 2005 and featuring Bill Nye. The show was more sophisticated than its predecessor Bill Nye the Science Guy, as it was aimed more toward adults and teenagers than children. All episodes were rated TV-G, except for \"Addiction\" and \"The Evolution of Sex\", both rated TV-PG. The creation of the show was motivated by the success of the television program Bill Nye the Science Guy, as well as a widespread contempt among scientists for scientific journalism in the media. The program was based in Seattle, Washington, produced by Buena Vista Television and broadcast during primetime by KCTS, the local PBS affiliate.", "rate": 48, "genre": ["Documentary"], "cast": ["Bill Nye"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12376   Expand The Eyes of Nye   (2005) User Score Overview The Eyes of Nye was a science program airing on public television in the United States in 2005 and featuring Bill Nye. The show was more sophisticated than its predecessor Bill Nye the Science Guy, as it was aimed more toward adults and teenagers than children. All episodes were rated TV-G, except for \"Addiction\" and \"The Evolution of Sex\", both rated TV-PG. The creation of the show was motivated by the success of the television program Bill Nye the Science Guy, as well as a widespread contempt among scientists for scientific journalism in the media. The program was based in Seattle, Washington, produced by Buena Vista Television and broadcast during primetime by KCTS, the local PBS affiliate. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Nye Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of The Eyes of Nye premiered on April  3, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1993-09-10 Bill Nye The Science Guy 7.3    2009-10-29 The League 7.1    2014-04-27 Last Week Tonight with John Oliver 7.9    2009-04-09 Parks and Recreation 7.9    2009-09-17 Community 7.9    2009-09-16 Archer 7.9    2008-09-03 Sons of Anarchy 7.8    2001-10-02 Scrubs 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 Amanda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}