{"link": "https://www.themoviedb.org/tv/73665?language=en", "title": "Girls' Generation 1979", "resume": "Story is set in Daegu, South Korea during the 1970's. Lee Jung-Hee is in the 2nd grade of high school. She has a bright personality and is the second daughter of a family who runs a toy factory. She and her friends go through adolescence.", "rate": 75, "genre": ["Drama"], "cast": ["Bona", "Chae Seo-jin", "Min Do-hee", "Seo Young-Joo", "Lee Jong-hyun"], "character": ["Lee Jung-Hee", "Jung Hye-Joo", "Sim Ae-Sook", "Bae Dong-Moon", "Joo Young-Choon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73665   Expand Girls' Generation 1979   (2017) User Score Overview Story is set in Daegu, South Korea during the 1970's. Lee Jung-Hee is in the 2nd grade of high school. She has a bright personality and is the second daughter of a family who runs a toy factory. She and her friends go through adolescence. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bona Lee Jung-Hee Chae Seo-jin Jung Hye-Joo Min Do-hee Sim Ae-Sook Seo Young-Joo Bae Dong-Moon Lee Jong-hyun Joo Young-Choon Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Girls' Generation 1979 premiered on September 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Girls' Generation 1979. You can help by rating TV shows you've seen. Facts Original Name  란제리 소녀시대 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/lingeriegirls/ Genres Drama Keywords romance korea Content Score 86 Almost there... Top Contributors M 33 Maria180493 g 6 gashtoby 3 galactica_j 2 rus4me  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}