{"link": "https://www.themoviedb.org/tv/31422?language=en", "title": "Tokyo Dogs", "resume": "Kanade Takakura is an elite detective from the New York Police department. He has a very keen sense of judgement but is cold and inflexible. Kanade lost his father in a murder as a young boy, which drove him to become a detective. \nMaruo Kudo  is a former motorcycle gang member now special detective with the Japanese police department. These two opposite characters team up on a case in which secrets are held by a young lady named Yuki Matsunada.", "rate": 73, "genre": ["Drama", "Comedy"], "cast": ["Shun Oguri", "Hiro Mizushima", "Yuriko Yoshitaka", "Tomokazu Miura", "Nene Otsuka"], "character": ["So Takakura", "Maruo Kudo", "Yuki Matsunaga", "Kozo Otomo", "Misa Maijima"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31422   Expand Tokyo Dogs   (2009) User Score Overview Kanade Takakura is an elite detective from the New York Police department. He has a very keen sense of judgement but is cold and inflexible. Kanade lost his father in a murder as a young boy, which drove him to become a detective.  Maruo Kudo  is a former motorcycle gang member now special detective with the Japanese police department. These two opposite characters team up on a case in which secrets are held by a young lady named Yuki Matsunada. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shun Oguri So Takakura Hiro Mizushima Maruo Kudo Yuriko Yoshitaka Yuki Matsunaga Tomokazu Miura Kozo Otomo Nene Otsuka Misa Maijima Full Cast & Crew Last Season Season 1 2009 | 10 Episodes Season 1 of Tokyo Dogs premiered on October 19, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1998-07-07 GTO: Great Teacher Onizuka 8.8    2012-07-09 Rich Man, Poor Woman 7.8  Facts Original Name  東京DOGS～最悪で最高のパートナー～ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://wwwz.fujitv.co.jp/tokyo-dogs/index.html Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 23 Aka75 R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}