{"link": "https://www.themoviedb.org/tv/38589?language=en", "title": "Princess Ja Myung", "resume": "Ja Myung Go is a 2009 South Korean historical drama starring Jung Ryeo-won, Park Min-young and Jung Kyung-ho. It aired on SBS from March 9 to July 21, 2009 on Mondays and Tuesdays at 21:55 for 39 episodes.\nIt is based on the Korean folk tale Prince Hodong and the Princess of Nakrang, which touches the story of the failed Nakrang Kingdom. According to the tale, there was a famous drum called the jamyeonggo, literally \"the drum that beats by itself,\" that possessed the mysterious power to automatically sound an alarm whenever enemies would invade its kingdom. The self-sounding drum caused neighboring nations, including the warrior state of Goguryeo, to hesitate about attacking Nakrang. A prince of Goguryeo named Hodong infiltrated Nakrang with the mission of destroying the drum. But the prince unexpectedly fell in love with the princess of Nakrang. For her love, the princess eventually chose to tear off the drum to betray her country. As a result, her nation fell into ruin and she was killed. Prince Hodong mourned over her death, holding her body.\nThe drama series, however, gives a new twist in that the drum is in fact a person, embodied by Ja-myung, the hidden sister of the Nakrang Kingdom's princess. Growing up as the princess of Nakrang, Ra-hee is adored by her people, while Ja-myung survives a murder attempt and lives as a commoner. Prince Hodong, from Nakrang's enemy, the Goguryeo Kingdom, is torn between two nations and two women, and must make a choice between love and responsibility.", "rate": 75, "genre": ["Drama"], "cast": ["Jung Ryeo-won", "Jung Kyung-ho", "Park Min-young", "Yeo Jin-goo", "Jin Ji-hee"], "character": ["Princess Ja-myung", "Prince Hodong", "Princess Ra-hee", "Hodong (young)", "Ra-hee (young)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38589   Expand Princess Ja Myung   (2009) User Score Overview Ja Myung Go is a 2009 South Korean historical drama starring Jung Ryeo-won, Park Min-young and Jung Kyung-ho. It aired on SBS from March 9 to July 21, 2009 on Mondays and Tuesdays at 21:55 for 39 episodes. It is based on the Korean folk tale Prince Hodong and the Princess of Nakrang, which touches the story of the failed Nakrang Kingdom. According to the tale, there was a famous drum called the jamyeonggo, literally \"the drum that beats by itself,\" that possessed the mysterious power to automatically sound an alarm whenever enemies would invade its kingdom. The self-sounding drum caused neighboring nations, including the warrior state of Goguryeo, to hesitate about attacking Nakrang. A prince of Goguryeo named Hodong infiltrated Nakrang with the mission of destroying the drum. But the prince unexpectedly fell in love with the princess of Nakrang. For her love, the princess eventually chose to tear off the drum to betray her country. As a result, her nation fell into ruin and she was killed. Prince Hodong mourned over her death, holding her body. The drama series, however, gives a new twist in that the drum is in fact a person, embodied by Ja-myung, the hidden sister of the Nakrang Kingdom's princess. Growing up as the princess of Nakrang, Ra-hee is adored by her people, while Ja-myung survives a murder attempt and lives as a commoner. Prince Hodong, from Nakrang's enemy, the Goguryeo Kingdom, is torn between two nations and two women, and must make a choice between love and responsibility. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Ryeo-won Princess Ja-myung Jung Kyung-ho Prince Hodong Park Min-young Princess Ra-hee Yeo Jin-goo Hodong (young) Jin Ji-hee Ra-hee (young) Full Cast & Crew Last Season Season 1 2009 | 39 Episodes Season 1 of Princess Ja Myung premiered on March 10, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Princess Ja Myung. You can help by rating TV shows you've seen. Facts Original Name  자명고 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://tv.sbs.co.kr/go/ Genres Drama Keywords korea historical fiction Content Score 86 Almost there... Top Contributors M 46 Maria180493 t 7 tmdb38202327 CM 7 Cherche Moi LS 5 Lee Seung-Su  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}