{"link": "https://www.themoviedb.org/tv/64563?language=en", "title": "Tripped", "resume": "Danny is an average 24-year-old who has been friends with stoner Milo since they were kids. But then Danny decides it’s time to grow up, settle down and marry long-term girlfriend Kate, whereas Milo continues to focus on getting high. One night Milo takes a particularly strong batch of hallucinogens, and Danny appears in his living room - except the real Danny’s at his engagement party, and the real Danny doesn’t normally carry a sword! This Danny claims to come from another dimension, and he brings a warning - the only problem is that Milo’s too wrecked to remember what it is...", "rate": 72, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Blake Harrison", "George Webster", "Georgina Campbell", "Richard Gadd", "Phillip Rhys"], "character": ["Danny", "Milo", "Kate", "Callum", "Pete"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64563   Expand Tripped   (2015) User Score Overview Danny is an average 24-year-old who has been friends with stoner Milo since they were kids. But then Danny decides it’s time to grow up, settle down and marry long-term girlfriend Kate, whereas Milo continues to focus on getting high. One night Milo takes a particularly strong batch of hallucinogens, and Danny appears in his living room - except the real Danny’s at his engagement party, and the real Danny doesn’t normally carry a sword! This Danny claims to come from another dimension, and he brings a warning - the only problem is that Milo’s too wrecked to remember what it is... Featured Crew Jack Williams Creator Harry Williams Creator Jamie Mathieson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Blake Harrison Danny George Webster Milo Georgina Campbell Kate Richard Gadd Callum Phillip Rhys Pete Full Cast & Crew Last Season Season 1 2015 | 4 Episodes Season 1 of Tripped premiered on December  8, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Tripped. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2010-09-19 Call Me Fitz 6.8    2016-10-16 Graves 5.4    2015-09-29 The Grinder 6.6    2016-10-17 People of Earth 7.6  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/tripped Genres Comedy Sci-Fi & Fantasy Keywords hallucinogenic drug parallel world multiverse Content Score 93 Almost there... Top Contributors 47 Elizabeth Jennings CM 4 Cherche Moi 4 Banana z 3 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}