{"link": "https://www.themoviedb.org/tv/38124?language=en", "title": "Swiss Toni", "resume": "Swiss Toni is a fictional used-car dealer played by Charlie Higson, and also the title of a sitcom in which he is the main character. Swiss Toni is a 50-something car dealer going through a midlife crisis. To Toni almost any situation in life is best understood as being \"like making love to a beautiful woman\", in some rather implausible ways. Swiss Toni is usually depicted wearing a grey suit and with his hair styled in a platinum-blond bouffant quiff.\nThe character was created by Charlie Higson and Bob Mortimer and originally introduced in the BBC comedy series The Smell of Reeves and Mortimer, but is best known as a recurring character in another BBC comedy series The Fast Show. Swiss Toni was later spun off into a sitcom, which developed both the character and his situation beyond the confines of the Fast Show sketches. The two series ran on BBC Three, the first three episodes of the first series also being repeated on BBC One. As well as playing the title character, Higson was the show's main writer and one of its producers.", "rate": 0, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38124   Expand Swiss Toni   (2003) User Score Overview Swiss Toni is a fictional used-car dealer played by Charlie Higson, and also the title of a sitcom in which he is the main character. Swiss Toni is a 50-something car dealer going through a midlife crisis. To Toni almost any situation in life is best understood as being \"like making love to a beautiful woman\", in some rather implausible ways. Swiss Toni is usually depicted wearing a grey suit and with his hair styled in a platinum-blond bouffant quiff. The character was created by Charlie Higson and Bob Mortimer and originally introduced in the BBC comedy series The Smell of Reeves and Mortimer, but is best known as a recurring character in another BBC comedy series The Fast Show. Swiss Toni was later spun off into a sitcom, which developed both the character and his situation beyond the confines of the Fast Show sketches. The two series ran on BBC Three, the first three episodes of the first series also being repeated on BBC One. As well as playing the title character, Higson was the show's main writer and one of its producers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2004 | 8 Episodes Season 2 of Swiss Toni premiered on October  5, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Swiss Toni. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}