{"link": "https://www.themoviedb.org/tv/62552?language=en", "title": "Lo imperdonable", "resume": "Martín (Iván Sánchez) hurries to Mina Escondida after getting an urgent letter from his brother begging to be rescued from the hell in which he's living. On arrival, Martin despairs upon finding out that Demetrio (Pablo Montero), his brother, has committed suicide. His sorrow is transformed into hatred and a thirst for vengeance against the woman who caused his brother suffering and brought him to death.", "rate": 93, "genre": ["Drama"], "cast": ["Ana Brenda Contreras", "Iván Sánchez", "Grettell Valdéz", "Sergio Sendel", "Sebastián Zurita"], "character": ["Verónica Prado Castelo", "Martín San Telmo", "Virginia Prado Castelo", "Emiliano Prado Castelo", "Pablo Hidalgo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62552   Expand Lo imperdonable   (2015) User Score Overview Martín (Iván Sánchez) hurries to Mina Escondida after getting an urgent letter from his brother begging to be rescued from the hell in which he's living. On arrival, Martin despairs upon finding out that Demetrio (Pablo Montero), his brother, has committed suicide. His sorrow is transformed into hatred and a thirst for vengeance against the woman who caused his brother suffering and brought him to death. Featured Crew Caridad Bravo Adams Creator Ximena Suárez Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ana Brenda Contreras Verónica Prado Castelo Iván Sánchez Martín San Telmo Grettell Valdéz Virginia Prado Castelo Sergio Sendel Emiliano Prado Castelo Sebastián Zurita Pablo Hidalgo Full Cast & Crew Last Season Season 1 2015 | 24 Episodes Season 1 of Lo imperdonable premiered on April 20, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lo imperdonable. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Drama Keywords telenovela Content Score 93 Almost there... Top Contributors V 16 Vaine s 15 shiff7 z 5 zurman1 CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}