{"link": "https://www.themoviedb.org/tv/47084?language=en", "title": "You're the Best, Lee Soon Shin", "resume": "You're the Best, Lee Soon-shin is a 2013 South Korean television series starring IU, Jo Jung-suk, Go Doo-shim, Lee Mi-sook, Yoo In-na, Son Tae-young, Go Joo-won, and Jung Woo. It aired on KBS2 from March 9 to August 25, 2013 on Saturdays and Sundays at 7:55 p.m. for 50 episodes. The drama is about a family devastated after the sudden death of the father, but who learn to find the true meaning of love and happiness, self-discovery and reconciliation.", "rate": 80, "genre": ["Comedy", "Family"], "cast": ["IU", "Jo Jung-suk", "Go Doo-shim", "Lee Mi-sook", "Yoo In-na"], "character": ["Lee Soon-shin", "Shin Joon-ho", "Kim Jung-ae", "Song Mi-ryung / Kyung-sook", "Lee Yoo-shin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47084   Expand You're the Best, Lee Soon Shin   (2013) User Score Overview You're the Best, Lee Soon-shin is a 2013 South Korean television series starring IU, Jo Jung-suk, Go Doo-shim, Lee Mi-sook, Yoo In-na, Son Tae-young, Go Joo-won, and Jung Woo. It aired on KBS2 from March 9 to August 25, 2013 on Saturdays and Sundays at 7:55 p.m. for 50 episodes. The drama is about a family devastated after the sudden death of the father, but who learn to find the true meaning of love and happiness, self-discovery and reconciliation. Featured Crew A Story Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast IU Lee Soon-shin Jo Jung-suk Shin Joon-ho Go Doo-shim Kim Jung-ae Lee Mi-sook Song Mi-ryung / Kyung-sook Yoo In-na Lee Yoo-shin Full Cast & Crew Last Season Season 1 2013 | 50 Episodes Season 1 of You're the Best, Lee Soon Shin premiered on March  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on You're the Best, Lee Soon Shin. You can help by rating TV shows you've seen. Facts Original Name  최고다 이순신 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/soonsin/ Genres Comedy Family Keywords korea Content Score 93 Almost there... Top Contributors M 31 Maria180493 N 14 Nightowl.Kr CM 6 Cherche Moi t 3 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}