{"link": "https://www.themoviedb.org/tv/61427?language=en", "title": "Kingdom", "resume": "A raw family drama set against the world of Mixed Martial Arts (MMA) in Venice, California. Alvey Kulina owns Navy St. MMA with the help of his girlfriend Lisa Prince. He is willing to go through extraordinary means to make sure his fighters are taken care of, but all of this responsibility comes at a steep price. He has complicated relationships with both of his sons, Jay and Nate, who are both struggling with their own identities and places within Alvey’s life and gym.", "rate": 63, "genre": ["Drama"], "cast": ["Frank Grillo", "Jonathan Tucker", "Nick Jonas", "Matt Lauria", "Kiele Sanchez"], "character": ["Alvey Kulina", "Jay Kulina", "Nate Kulina", "Ryan Wheeler", "Lisa Prince"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61427   Expand Kingdom   (2014) User Score  Play Trailer Overview A raw family drama set against the world of Mixed Martial Arts (MMA) in Venice, California. Alvey Kulina owns Navy St. MMA with the help of his girlfriend Lisa Prince. He is willing to go through extraordinary means to make sure his fighters are taken care of, but all of this responsibility comes at a steep price. He has complicated relationships with both of his sons, Jay and Nate, who are both struggling with their own identities and places within Alvey’s life and gym. Featured Crew Byron Balasco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Grillo Alvey Kulina Jonathan Tucker Jay Kulina Nick Jonas Nate Kulina Matt Lauria Ryan Wheeler Kiele Sanchez Lisa Prince Full Cast & Crew Last Season Season 3 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply L IMDB rating: 84%. TMDB rating: 55%. Open 4 by  ubuzen Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  4 Recommendations   2009-06-14 Alan Carr: Chatty Man 5.0    2013-04-03 Rogue 7.1    2014-05-22 Gang Related 6.6    2016-02-08 Full Frontal with Samantha Bee 6.7    2011-02-09 Mr. Sunshine 6.4    1997-05-18 Wyrd Sisters 6.2    2007-02-26 The Black Donnellys 7.4    2016-06-05 Feed the Beast 6.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m, 46m Homepage   http://kingdom.directv.com Genres Drama Keywords drug abuse sibling relationship sport parent child relationship competition training mixed martial arts in the closet gym ex-con lower class Content Score 100 Yes! Looking good! Top Contributors 67 Banana 39 CouchTater L 33 Law 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}