{"link": "https://www.themoviedb.org/tv/77012?language=en", "title": "Underbelly Files: Chopper", "resume": "Mark \"Chopper\" Read established a reputation of infamy by becoming one of the toughest criminals in Australian history. But in order to secure the affections of the woman he loves, Chopper fights to go straight. Yet the sins of his past, his ego and an ongoing feud with Syd Collins will make his hopes of a straight life a dangerous and near-impossible enterprise. Underbelly Files: Chopper explores the collision of Chopper's two competing identities — the myth and the man.", "rate": 0, "genre": ["Crime"], "cast": ["Aaron Jeffery", "Ella Scott Lynch", "Todd Lasance", "Reef Ireland", "Michael Caton"], "character": ["Mark 'Chopper' Read", "Margaret Cassar", "Syd Collins", "Trent Anthony", "Keith Read"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77012   Expand Underbelly Files: Chopper   (2018) User Score  Play Trailer Overview Mark \"Chopper\" Read established a reputation of infamy by becoming one of the toughest criminals in Australian history. But in order to secure the affections of the woman he loves, Chopper fights to go straight. Yet the sins of his past, his ego and an ongoing feud with Syd Collins will make his hopes of a straight life a dangerous and near-impossible enterprise. Underbelly Files: Chopper explores the collision of Chopper's two competing identities — the myth and the man. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aaron Jeffery Mark 'Chopper' Read Ella Scott Lynch Margaret Cassar Todd Lasance Syd Collins Reef Ireland Trent Anthony Michael Caton Keith Read Full Cast & Crew Current Season Miniseries 2018 | 2 Episodes Season 1 of Underbelly Files: Chopper premiered on February 10, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Underbelly Files: Chopper. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  English Runtime  65m Homepage   https://www.9now.com.au/underbelly-files-chopper Genres Crime Keywords australia gangland chopper infamous Content Score 93 Almost there... Top Contributors c 79 cyanthesoul TB 2 TMDb Bot 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}