{"link": "https://www.themoviedb.org/tv/77278?language=en", "title": "Louis Theroux: Miami Mega-Jail", "resume": "Louis takes an in-depth look at Miami's jail system, a vast holding pen for the unconvicted where most inmates are awaiting trial.", "rate": 82, "genre": ["Documentary"], "cast": ["Louis Theroux"], "character": ["Louis Theroux"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77278   Expand Louis Theroux: Miami Mega-Jail   (2011) User Score Overview Louis takes an in-depth look at Miami's jail system, a vast holding pen for the unconvicted where most inmates are awaiting trial. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Louis Theroux Louis Theroux Full Cast & Crew Last Season Miniseries 2011 | 2 Episodes Season 1 of Louis Theroux: Miami Mega-Jail premiered on May 22, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Louis Theroux: Miami Mega-Jail. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2014-03-23 Louis Theroux's LA Stories 8.2    2013-04-11 The Killer Speaks 7.5    Roman Polanski: Wanted and Desired 6.4    2015-03-22 Louis Theroux: By Reason of Insanity 7.5    1998-01-15 Louis Theroux's Weird Weekends 8.5    Jonestown: The Life and Death of Peoples Temple 8.2    Paradise Lost 2: Revelations 7.9    2005-04-04 The Staircase 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b011k0xx Genres Documentary Keywords prison Content Score 56 We're so close, yet so far. Top Contributors 15 Banana TB 8 TMDb Bot 1 Moviebase  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}