{"link": "https://www.themoviedb.org/tv/52910?language=en", "title": "Law of the Jungle", "resume": "Law of the Jungle is a South Korean reality-documentary show on SBS. It was first aired on October 21, 2011. This show is a hybrid of reality-variety television, natural documentaries, and human drama; a new concept of programming. The cast of celebrities travel to primitive, natural places to survive on their own and experience life with local tribes and people. Originally airing as Kim Byung-man's Law of the Jungle after the creator and \"clan leader\" Kim Byung-man, \"Kim Byung-man's\" was eventually dropped from the title.\nSpecial editions of the program air as well featuring a different cast not in the regular time slot. Law of the Jungle W features an all-female cast and generally airs during the Seollal and Chuseok holidays. Law of the Jungle K features celebrities with their children, and has aired as a Seollal special in 2013.", "rate": 0, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52910   Expand Law of the Jungle   (2011) User Score Overview Law of the Jungle is a South Korean reality-documentary show on SBS. It was first aired on October 21, 2011. This show is a hybrid of reality-variety television, natural documentaries, and human drama; a new concept of programming. The cast of celebrities travel to primitive, natural places to survive on their own and experience life with local tribes and people. Originally airing as Kim Byung-man's Law of the Jungle after the creator and \"clan leader\" Kim Byung-man, \"Kim Byung-man's\" was eventually dropped from the title. Special editions of the program air as well featuring a different cast not in the regular time slot. Law of the Jungle W features an all-female cast and generally airs during the Seollal and Chuseok holidays. Law of the Jungle K features celebrities with their children, and has aired as a Seollal special in 2013. Featured Crew Kim Byung-man Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season Antartica — | 4 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Law of the Jungle. You can help by rating TV shows you've seen. Facts Original Name  정글의 법칙 Status  Returning Series Network Certification  - Type  Reality Original Language  Korean Runtime  - Homepage   http://tv.sbs.co.kr/jungle/ Genres Reality Keywords survival Content Score 64 We're so close, yet so far. Top Contributors t 25 tmdb983464 6 adamsp09 EL 4 Erica L Thompson 3 Charles  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}