{"link": "https://www.themoviedb.org/tv/63450?language=en", "title": "Fartsa", "resume": "An epic saga which takes place over a long time span from 1961 to 1991. From the midpoint of the story we view the friendship of four boys. In season main heroes are in their 20's, they are childhood friends, and for the sake of their friendship they are ready to sacrifice anything. Everyone has their own dreams, but their circumstances will take them on a difficult path and they will be forced into all kinds of underground economic dealings in the early 60s. And, worst of all - they are successful in this business. And the more successful they are, the further they get from their real dreams.", "rate": 63, "genre": [], "cast": ["Fillip Gorenshtein", "Maksim Emelyanov", "Zoya Berber", "Aleksey Vesyolkin", "Evgeniy Stychkin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63450   Expand  Fartsa   (2015) User Score Overview An epic saga which takes place over a long time span from 1961 to 1991. From the midpoint of the story we view the friendship of four boys. In season main heroes are in their 20's, they are childhood friends, and for the sake of their friendship they are ready to sacrifice anything. Everyone has their own dreams, but their circumstances will take them on a difficult path and they will be forced into all kinds of underground economic dealings in the early 60s. And, worst of all - they are successful in this business. And the more successful they are, the further they get from their real dreams. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fillip Gorenshtein Maksim Emelyanov Zoya Berber Aleksey Vesyolkin Evgeniy Stychkin Full Cast & Crew Last Season Season 1 2015 | 1 Episode Season 1 of  Fartsa premiered on March 30, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on  Fartsa. You can help by rating TV shows you've seen. Facts Original Name  Фарца Status  Returning Series Network Certification  - Type  Scripted Original Language  Russian Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors m 15 mbbvlad 14 Elizabeth Jennings 8 highroller 2 Mark Gubarenko  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}