{"link": "https://www.themoviedb.org/tv/6100?language=en", "title": "Long Vacation", "resume": "A music school graduate, Sena worked part-time teaching piano after failing to move on to graduate school. One day, an older woman named Minami comes to visit Sena’s apartment, dressed in a bridal gown. Minami explained that she had been engaged to Sena’s roommate, but that he did not show up for the wedding. Minami then decides to stay in the apartment to wait for her fiancé. And so this is how Minami and Sena begin their strange life together. Sena tries to cheer up Minami by telling her that “when life isn’t going your way, just think of that time as a long vacation, given by God.” However, Sena also has his share of problems and is finding it hard to believe in himself. He is also dealing with frustrations in his relationship with a girl at school, which seemed to be going nowhere. With their own sets of problems, Sena and Minami slowly grow to be indispensible to each other. The story follows the heart of a man so pure that he has difficulty expressing himself, and his relationship with a woman who is inspired by his innocent soul to retrieve the emotions she had forgotten.", "rate": 86, "genre": ["Drama"], "cast": ["Takuya Kimura", "Tomoko Yamaguchi", "Yutaka Takenouchi", "Takako Matsu", "Ryō"], "character": ["Hidetoshi Sena", "Minami Hayama", "Shinji Hayama", "Ryoko Okusawa", "Himuro Rumiko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6100   Expand Long Vacation   (1996) User Score Overview A music school graduate, Sena worked part-time teaching piano after failing to move on to graduate school. One day, an older woman named Minami comes to visit Sena’s apartment, dressed in a bridal gown. Minami explained that she had been engaged to Sena’s roommate, but that he did not show up for the wedding. Minami then decides to stay in the apartment to wait for her fiancé. And so this is how Minami and Sena begin their strange life together. Sena tries to cheer up Minami by telling her that “when life isn’t going your way, just think of that time as a long vacation, given by God.” However, Sena also has his share of problems and is finding it hard to believe in himself. He is also dealing with frustrations in his relationship with a girl at school, which seemed to be going nowhere. With their own sets of problems, Sena and Minami slowly grow to be indispensible to each other. The story follows the heart of a man so pure that he has difficulty expressing himself, and his relationship with a woman who is inspired by his innocent soul to retrieve the emotions she had forgotten. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Kimura Hidetoshi Sena Tomoko Yamaguchi Minami Hayama Yutaka Takenouchi Shinji Hayama Takako Matsu Ryoko Okusawa Ryō Himuro Rumiko Full Cast & Crew Last Season Season 1 1996 | 11 Episodes Season 1 of Long Vacation premiered on April 15, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Long Vacation. You can help by rating TV shows you've seen. Facts Original Name  ロングバケーション Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 13 Aka75 t 4 taxigps 2 thirstyhippo S 1 SnM  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}