{"link": "https://www.themoviedb.org/tv/5640?language=en", "title": "Heart of Greed", "resume": "Heart of Greed was a 2007 grand production drama by Hong Kong's TVB. The reception was excellent for the series, and subsequently led it to win many of the TVB Anniversary Awards in 2007, including the 'Best Series' Award. It became 2007 highest rated series when it hit 48 points, within the final minutes of its finale. The series is currently re-running on TVB's Pay Vision Classic Channel, upgrading the series status as a classic.\nDue to the success of the series, TVB produced a spin off Moonlight Resonance and it was broadcast in 2008 featuring the majority of the original cast and a different storyline.", "rate": 0, "genre": ["Drama"], "cast": ["Yoyo Mung", "Linda Chung", "Moses Chan", "Raymond Lam", "Lai Lok-yi"], "character": ["Sui Ming-ha", "Seung Tsoi-sum", "Ching Leung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5640   Expand Heart of Greed   (2007) User Score Overview Heart of Greed was a 2007 grand production drama by Hong Kong's TVB. The reception was excellent for the series, and subsequently led it to win many of the TVB Anniversary Awards in 2007, including the 'Best Series' Award. It became 2007 highest rated series when it hit 48 points, within the final minutes of its finale. The series is currently re-running on TVB's Pay Vision Classic Channel, upgrading the series status as a classic. Due to the success of the series, TVB produced a spin off Moonlight Resonance and it was broadcast in 2008 featuring the majority of the original cast and a different storyline. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoyo Mung Sui Ming-ha Linda Chung Seung Tsoi-sum Moses Chan Raymond Lam Ching Leung Lai Lok-yi Full Cast & Crew Last Season Season 1 2007 | 40 Episodes Season 1 of Heart of Greed premiered on April  9, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Heart of Greed. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.tvcity.tvb.com/drama/heart_of_greed Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}