{"link": "https://www.themoviedb.org/tv/36730?language=en", "title": "Dive", "resume": "Dive is a two-part British television drama starring Jack O'Connell, Aisling Loftus and Gina McKee. Broadcast on BBC Two in July 2010, the show dealt with the problems of teenage relationships and pregnancy against the backdrop of a young diver's preparations for the 2012 Summer Olympics.", "rate": 35, "genre": ["Drama"], "cast": ["Jack O'Connell", "Ewen Bremner", "Kate Dickie", "Eddie Marsan", "Gina McKee"], "character": ["Robert", "Stewart", "Alison", "Will", "Jacqueline"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36730   Expand Dive   (2010) User Score Overview Dive is a two-part British television drama starring Jack O'Connell, Aisling Loftus and Gina McKee. Broadcast on BBC Two in July 2010, the show dealt with the problems of teenage relationships and pregnancy against the backdrop of a young diver's preparations for the 2012 Summer Olympics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack O'Connell Robert Ewen Bremner Stewart Kate Dickie Alison Eddie Marsan Will Gina McKee Jacqueline Full Cast & Crew Last Season Season 1 2010 | 2 Episodes Season 1 of Dive premiered on July  8, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dive. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords diving england sport miniseries teenager diver teenage sexuality teenage pregnancy teenage romance Content Score 71 Just a little bit more... Top Contributors TB 16 TMDb Bot 12 Banana R 6 Rebecca s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}