{"link": "https://www.themoviedb.org/tv/65255?language=en", "title": "The Legend of Miyue", "resume": "The drama details the legendary life of Mi Ba Zi, a young girl who lived in Chu during the Warring States period and goes on to became the first Empress Dowager in China's history.", "rate": 0, "genre": [], "cast": ["Sun Li", "Liu Tao", "Sun Yi", "Jiang Xin"], "character": ["Mi Ba Zi / Mi Yue", "Mi Shu", "Mi Yao", "Concubine Ju"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65255   Expand The Legend of Miyue   (2015) User Score Overview The drama details the legendary life of Mi Ba Zi, a young girl who lived in Chu during the Warring States period and goes on to became the first Empress Dowager in China's history. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sun Li Mi Ba Zi / Mi Yue Liu Tao Mi Shu Sun Yi Mi Yao Jiang Xin Concubine Ju Full Cast & Crew Last Season Season 1 2015 | 81 Episodes Season 1 of The Legend of Miyue premiered on November 30, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Miyue. You can help by rating TV shows you've seen. Facts Original Name  芈月传 Status  Ended Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 17 palfans 11 Elizabeth Jennings M 5 Maria180493 i 4 idlikewlm  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}