{"link": "https://www.themoviedb.org/tv/74543?language=en", "title": "Gucci Mane & Keyshia Ka'oir: The Mane Event", "resume": "Follows the twists and turns of the hip-hop power couple as they work to blend their families and defy the odds as they set to prepare for the most extravagant celebrity wedding of the year.", "rate": 100, "genre": ["Reality"], "cast": ["Gucci Mane", "Keyshia Ka’oir"], "character": ["Himself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74543   Expand Gucci Mane & Keyshia Ka'oir: The Mane Event   (2017) User Score  Play Trailer Overview Follows the twists and turns of the hip-hop power couple as they work to blend their families and defy the odds as they set to prepare for the most extravagant celebrity wedding of the year. Featured Crew Oji Singletary Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gucci Mane Himself Keyshia Ka’oir Herself Full Cast & Crew Current Season Season 1 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gucci Mane & Keyshia Ka'oir: The Mane Event. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  45m Homepage  - Genres Reality Keywords wedding Content Score 71 Just a little bit more... Top Contributors 18 Marr 🇳🇱 E 5 Elbert 3 tigru89 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}