{"link": "https://www.themoviedb.org/tv/61779?language=en", "title": "Framework", "resume": "Hosted by hip-hop superstar Common, ‘Framework’ is a new arc competition series exploring the compelling world of furniture design/construction. It’s not enough to design an eye-catching, unique AND functional piece of furniture, these 13 elite furniture craftsman have to build it too. The clock is ticking and the stakes are sky-high as the last competitor standing will receive an incredible prize package including the ability to launch their own line with a major furniture brand.", "rate": 28, "genre": ["Reality"], "cast": ["Common", "Brandon Gore"], "character": ["Himself - Host", "Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61779   Expand Framework   (2015) User Score Overview Hosted by hip-hop superstar Common, ‘Framework’ is a new arc competition series exploring the compelling world of furniture design/construction. It’s not enough to design an eye-catching, unique AND functional piece of furniture, these 13 elite furniture craftsman have to build it too. The clock is ticking and the stakes are sky-high as the last competitor standing will receive an incredible prize package including the ability to launch their own line with a major furniture brand. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Common Himself - Host Brandon Gore Himself - Host Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Framework premiered on January  6, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Framework. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage   http://www.spike.com/shows/framework Genres Reality Keywords competition furniture reality competition woodworking Content Score 56 We're so close, yet so far. Top Contributors 21 Elizabeth Jennings n 7 neil1269 6 Banana TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}