{"link": "https://www.themoviedb.org/tv/43087?language=en", "title": "Sullivan & Son", "resume": "Sullivan & Son is an American comedy television series created by Rob Long and Steve Byrne that is broadcast on TBS. It stars Byrne as Steve Sullivan, who surprises his parents when he leaves his job as a corporate lawyer to take over a bar owned by his father in Pittsburgh. The series is executive-produced by Vince Vaughn, Peter Billingsley and Long, who also serves as showrunner. It premiered on July 19, 2012.", "rate": 52, "genre": ["Comedy"], "cast": ["Steve Byrne", "Christine Ebersole", "Dan Lauria", "Brian Doyle-Murray", "Valerie Azlynn"], "character": ["Steve Sullivan", "Carol Walsh", "Jack Sullivan", "Hank Murphy", "Melanie Sutton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43087   Expand Sullivan & Son   (2012) User Score Overview Sullivan & Son is an American comedy television series created by Rob Long and Steve Byrne that is broadcast on TBS. It stars Byrne as Steve Sullivan, who surprises his parents when he leaves his job as a corporate lawyer to take over a bar owned by his father in Pittsburgh. The series is executive-produced by Vince Vaughn, Peter Billingsley and Long, who also serves as showrunner. It premiered on July 19, 2012. Featured Crew Steve Byrne Creator Rob Long Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Byrne Steve Sullivan Christine Ebersole Carol Walsh Dan Lauria Jack Sullivan Brian Doyle-Murray Hank Murphy Valerie Azlynn Melanie Sutton Full Cast & Crew Last Season Season 3 2014 | 13 Episodes Season 3 of Sullivan & Son premiered on June 24, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2009-09-23 Cougar Town 5.8    2010-09-12 Lost Girl 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 16 Christian PS 3 P. Snoopy s 3 speedycars 1 Marco Almeida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}