{"link": "https://www.themoviedb.org/tv/73063?language=en", "title": "The Gay and Wondrous Life of Caleb Gallo", "resume": "A wondrous story of the complexities of relationships, friendly and romantic. Blurring the lines of expected troupes through random comedy and a realistic, interconnected interaction.", "rate": 93, "genre": ["Comedy"], "cast": ["Brian Jordan Alvarez", "Jason Greene", "Jonathan Ebeling", "Antonio Marziale", "Ken Kirby"], "character": ["Caleb", "Freckle", "Billy", "Benicio", "Lenjamin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73063   Expand The Gay and Wondrous Life of Caleb Gallo   (2016) User Score Overview A wondrous story of the complexities of relationships, friendly and romantic. Blurring the lines of expected troupes through random comedy and a realistic, interconnected interaction. Featured Crew Brian Jordan Alvarez Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Jordan Alvarez Caleb Jason Greene Freckle Jonathan Ebeling Billy Antonio Marziale Benicio Ken Kirby Lenjamin Full Cast & Crew Last Season Season 1 2016 | 5 Episodes Season 1 of The Gay and Wondrous Life of Caleb Gallo premiered on January  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Gay and Wondrous Life of Caleb Gallo. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Comedy Keywords friendship dating lgbt twenty something long distance relationship Content Score 100 Yes! Looking good! Top Contributors 21 vardamir L 8 Law 2 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}