{"link": "https://www.themoviedb.org/tv/13814?language=en", "title": "The First Churchills", "resume": "The First Churchills was a BBC serial from 1969 about the life of John Churchill, 1st Duke of Marlborough and his wife, Sarah Churchill, Duchess of Marlborough. It starred John Neville as the duke and Susan Hampshire as the duchess, was written and produced by Donald Wilson, and was directed by David Giles.\nThe serial presents the lives of John and Sarah Churchill from their meeting in 1673 until a time shortly before the first duke's death in 1722, and illustrates, along the way, much of the context of contemporary English politics. Like many BBC serials of the era, it was made on a low budget, with sound studio sets, and generally avoided battle and crowd scenes due to inability to stage them in a convincing manner. The series is based on the Marlboroughs' famous descendant Winston Churchill's life of his ancestor the Duke, and as such presents a very favourable portrait of the Marlboroughs.\nThe closing credits theme is the second piece, a Rondeau, of Henry Purcell's incidental music, composed about 1695, to Aphra Behn's 1676 play Abdelazer, or The Moor's Revenge.\nIt is also notable as being the first program shown on PBS's long-running Masterpiece series in the United States.", "rate": 90, "genre": ["Drama"], "cast": ["Susan Hampshire", "John Neville", "John Standing", "Margaret Tyzack", "Alan Rowe"], "character": ["Sarah Churchill", "John Churchill", "Sidney Godolphin", "Princess Anne", "William, Prince of Orange"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13814   Expand The First Churchills   (1969) User Score Overview The First Churchills was a BBC serial from 1969 about the life of John Churchill, 1st Duke of Marlborough and his wife, Sarah Churchill, Duchess of Marlborough. It starred John Neville as the duke and Susan Hampshire as the duchess, was written and produced by Donald Wilson, and was directed by David Giles. The serial presents the lives of John and Sarah Churchill from their meeting in 1673 until a time shortly before the first duke's death in 1722, and illustrates, along the way, much of the context of contemporary English politics. Like many BBC serials of the era, it was made on a low budget, with sound studio sets, and generally avoided battle and crowd scenes due to inability to stage them in a convincing manner. The series is based on the Marlboroughs' famous descendant Winston Churchill's life of his ancestor the Duke, and as such presents a very favourable portrait of the Marlboroughs. The closing credits theme is the second piece, a Rondeau, of Henry Purcell's incidental music, composed about 1695, to Aphra Behn's 1676 play Abdelazer, or The Moor's Revenge. It is also notable as being the first program shown on PBS's long-running Masterpiece series in the United States. Featured Crew Donald Wilson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Susan Hampshire Sarah Churchill John Neville John Churchill John Standing Sidney Godolphin Margaret Tyzack Princess Anne Alan Rowe William, Prince of Orange Full Cast & Crew Last Season Season 1 1969 | 12 Episodes Season 1 of The First Churchills premiered on September 26, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The First Churchills. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  540m Homepage  - Genres Drama Keywords family british politics historic figure Content Score 93 Almost there... Top Contributors TB 14 TMDb Bot 3 Banana 3 joel6 z 1 zoroman2017  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}