{"link": "https://www.themoviedb.org/tv/60748?language=en", "title": "Gap-Dong", "resume": "20 years ago Moo-Yeom’s father was a suspect in the \"Gap Dong” serial murder case. Because of the detectives’ oppressive investigation, Moo-Yeom’s father killed himself. Now, Moo-Yeom is a detective and works to capture the killer Gap Dong. The statue of limitations has expired for the serial murder case and Moo-Yeom resigns to the belief that Gap Dong is dead. New clues though for Gap Dong appears in front of Moo-Yeom and he sets out to catch him once and for all.", "rate": 73, "genre": [], "cast": ["Jeong In-gi", "Jo Ji-hwan", "Yoon Sang-hyun", "Kim Min-jung", "Sung Dong-il"], "character": ["Cha Do-hyeok", "Lee Hyung-nyeon", "Ha Moo-yeom", "Maria Oh", "Yang Cheol-gon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60748   Expand Gap-Dong   (2014) User Score Overview 20 years ago Moo-Yeom’s father was a suspect in the \"Gap Dong” serial murder case. Because of the detectives’ oppressive investigation, Moo-Yeom’s father killed himself. Now, Moo-Yeom is a detective and works to capture the killer Gap Dong. The statue of limitations has expired for the serial murder case and Moo-Yeom resigns to the belief that Gap Dong is dead. New clues though for Gap Dong appears in front of Moo-Yeom and he sets out to catch him once and for all. Featured Crew Yoon Sang-hyun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeong In-gi Cha Do-hyeok Jo Ji-hwan Lee Hyung-nyeon Yoon Sang-hyun Ha Moo-yeom Kim Min-jung Maria Oh Sung Dong-il Yang Cheol-gon Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Gap-Dong premiered on April 11, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations   2016-10-26 The Day After We Broke Up 6.8  Facts Original Name  갑동이 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/gabdong2/ Genres No genres have been added. Keywords korea Content Score 86 Almost there... Top Contributors 21 Elizabeth Jennings M 21 Maria180493 t 11 tmdb38202327 z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}