{"link": "https://www.themoviedb.org/tv/61680?language=en", "title": "Wizard Barristers", "resume": "Wizard Barristers takes place in the near future of 2018, where wizards and humans live side-by-side in Tokyo. While police continue to protect the rest of society, wizards are tried according to magical laws in special courts defended by wizard barristers. Cecile Sudo has just become the youngest wizard barrister at age 17, and begins work at the Butterfly Law Offices. However, unbeknownst to her, she has tremendous magical potential…", "rate": 73, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61680   Expand Wizard Barristers   (2014) User Score Overview Wizard Barristers takes place in the near future of 2018, where wizards and humans live side-by-side in Tokyo. While police continue to protect the rest of society, wizards are tried according to magical laws in special courts defended by wizard barristers. Cecile Sudo has just become the youngest wizard barrister at age 17, and begins work at the Butterfly Law Offices. However, unbeknownst to her, she has tremendous magical potential… Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Wizard Barristers premiered on January 12, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Wizard Barristers. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2012-04-06 Accel World 7.3  Facts Original Name  ウィザード・バリスターズ～弁魔士セシル Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 11 Elizabeth Jennings Y 6 Youngin 6 seboseboss m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}