{"link": "https://www.themoviedb.org/tv/13963?language=en", "title": "Royal Institution Christmas Lectures", "resume": "The Royal Institution Christmas Lectures are a series of lectures on a single topic, which have been held at the Royal Institution in London each year since 1825. The lectures present scientific subjects to a general audience, including young people, in an informative and entertaining manner. Michael Faraday initiated the first Christmas Lecture series in 1825. This came at a time when organised education for young people was scarce. Faraday presented a total of nineteen series in all.", "rate": 18, "genre": ["Documentary"], "cast": ["Kevin Fong"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13963   Expand Royal Institution Christmas Lectures   (1966) User Score Overview The Royal Institution Christmas Lectures are a series of lectures on a single topic, which have been held at the Royal Institution in London each year since 1825. The lectures present scientific subjects to a general audience, including young people, in an informative and entertaining manner. Michael Faraday initiated the first Christmas Lecture series in 1825. This came at a time when organised education for young people was scarce. Faraday presented a total of nineteen series in all. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Fong Himself - Presenter Full Cast & Crew Last Season 2015: How to Survive in Space 2015 | 3 Episodes Season 2015 of Royal Institution Christmas Lectures premiered on December 28, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Royal Institution Christmas Lectures. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  - Homepage   http://www.bbc.co.uk/programmes/b00pmbqq Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 12 Elizabeth Jennings 2 kodiwjaelani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}