{"link": "https://www.themoviedb.org/tv/17052?language=en", "title": "I Love the '80s Strikes Back", "resume": "I Love the '80s Strikes Back is a miniseries on VH1 in which various music and TV personalities reminisce about 1980s popular culture in a mostly humorous manner. The series premiered on October 20, 2003 and is a sequel to I Love the '80s.\nThe sequel designation is in reference to The Empire Strikes Back.", "rate": 80, "genre": ["Documentary"], "cast": ["Dave Navarro", "Mo Rocca", "Rich Eisen", "Lita Ford", "Bronson Pinchot"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17052   Expand I Love the '80s Strikes Back   (2003) User Score Overview I Love the '80s Strikes Back is a miniseries on VH1 in which various music and TV personalities reminisce about 1980s popular culture in a mostly humorous manner. The series premiered on October 20, 2003 and is a sequel to I Love the '80s. The sequel designation is in reference to The Empire Strikes Back. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Navarro Mo Rocca Rich Eisen Lita Ford Bronson Pinchot Full Cast & Crew Last Season Season 1 2003 | 10 Episodes Season 1 of I Love the '80s Strikes Back premiered on October 20, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I Love the '80s Strikes Back. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords nostalgia 1980s Content Score 86 Almost there... Top Contributors 5 Banana 3 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}