{"link": "https://www.themoviedb.org/tv/2283?language=en", "title": "Supernova", "resume": "Supernova is a British comedy series produced by Hartswood Films and jointly commissioned by the BBC in the UK and UKTV in Australia. It follows Dr Paul Hamilton, a Welsh astronomer, who leaves a dull academic post and unloved girlfriend for a new job at the Royal Australian Observatory, deep in the Australian outback. The comedy centres around his difficulties adjusting to life in the outback and his eccentric fellow astronomers. The first series was released in the United Kingdom and Australia in October 2005 and consisted of six 30-minute episodes. The second series began airing on 3 August 2006 in the UK.\nThe exterior scenes were shot at Broken Hill in New South Wales, Australia. The observatory itself is a CGI creation, according to the DVD commentary, and only a partial doorway was constructed on site for filming purposes.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Rob Brydon", "Kat Stewart", "Kris McQuade", "Peter Kowitz"], "character": ["Dr. Paul Hamilton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2283   Expand Supernova   (2005) User Score Overview Supernova is a British comedy series produced by Hartswood Films and jointly commissioned by the BBC in the UK and UKTV in Australia. It follows Dr Paul Hamilton, a Welsh astronomer, who leaves a dull academic post and unloved girlfriend for a new job at the Royal Australian Observatory, deep in the Australian outback. The comedy centres around his difficulties adjusting to life in the outback and his eccentric fellow astronomers. The first series was released in the United Kingdom and Australia in October 2005 and consisted of six 30-minute episodes. The second series began airing on 3 August 2006 in the UK. The exterior scenes were shot at Broken Hill in New South Wales, Australia. The observatory itself is a CGI creation, according to the DVD commentary, and only a partial doorway was constructed on site for filming purposes. Featured Crew Harry Cripps Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Brydon Dr. Paul Hamilton Kat Stewart Kris McQuade Peter Kowitz Full Cast & Crew Last Season Season 2 2006 | 6 Episodes Season 2 of Supernova premiered on August  3, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Supernova. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  40m, 30m Homepage  - Genres Drama Comedy Keywords australia eccentric astronomer outback sitcom british humour Content Score 93 Almost there... Top Contributors O 7 Ozbourne s 1 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}