{"link": "https://www.themoviedb.org/tv/3697?language=en", "title": "Live from Abbey Road", "resume": "Live from Abbey Road is a 12-part, one-hour performance series/documentary that began filming its first season during 2006 at Abbey Road Studios in London. Season 2 was filmed between 2007 and 2008, season 3 was filmed in 2009 and Season 4 was filmed in 2011. The series features a total of 128 musical artists to date -- usually two or three per show, performing up to five songs per session. The sessions are recorded without a live audience. Filmed in High-Definition with the occasional use of 35 mm lenses, the producers have sought to record performances which \"look like a movie and sound like a record\".", "rate": 0, "genre": ["Documentary", "Music"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3697   Expand Live from Abbey Road   (2007) User Score Overview Live from Abbey Road is a 12-part, one-hour performance series/documentary that began filming its first season during 2006 at Abbey Road Studios in London. Season 2 was filmed between 2007 and 2008, season 3 was filmed in 2009 and Season 4 was filmed in 2011. The series features a total of 128 musical artists to date -- usually two or three per show, performing up to five songs per session. The sessions are recorded without a live audience. Filmed in High-Definition with the occasional use of 35 mm lenses, the producers have sought to record performances which \"look like a movie and sound like a record\". Featured Crew Peter Van Hooke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2011 | 8 Episodes Season 4 of Live from Abbey Road premiered on June 16, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Live from Abbey Road. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.livefromabbeyroad.com/ Genres Documentary Music Keywords music tv program Content Score 64 We're so close, yet so far. Top Contributors 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}