{"link": "https://www.themoviedb.org/tv/46619?language=en", "title": "Rectify", "resume": "After 19 years on Death Row for the rape and murder of his teenage girlfriend, Daniel Holden is going home. His conviction has been vacated due to new DNA evidence. Now he has to return to a world he no longer knows and his reentry into the outside world may be as unforgiving as prison. Daniel is haunted by the past, dogged by the present, and uncertain of the future. As he struggles to adapt to his new life, his homecoming reignites the fears of a small town and threatens to shatter his family’s fragile peace. Daniel’s alleged crime divided a community. Will his freedom tear it in half?", "rate": 77, "genre": ["Drama"], "cast": ["Aden Young", "Abigail Spencer", "Adelaide Clemens", "Clayne Crawford", "J. Smith-Cameron"], "character": ["Daniel Holden", "Amantha Holden", "Tawney Talbot", "Ted Talbot Jr.", "Janet Talbot"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46619   Expand Rectify   (2013) User Score  Play Trailer Overview After 19 years on Death Row for the rape and murder of his teenage girlfriend, Daniel Holden is going home. His conviction has been vacated due to new DNA evidence. Now he has to return to a world he no longer knows and his reentry into the outside world may be as unforgiving as prison. Daniel is haunted by the past, dogged by the present, and uncertain of the future. As he struggles to adapt to his new life, his homecoming reignites the fears of a small town and threatens to shatter his family’s fragile peace. Daniel’s alleged crime divided a community. Will his freedom tear it in half? Featured Crew Ray McKinnon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  15 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Aden Young Daniel Holden Abigail Spencer Amantha Holden Adelaide Clemens Tawney Talbot Clayne Crawford Ted Talbot Jr. J. Smith-Cameron Janet Talbot Full Cast & Crew Last Season Season 4 2016 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  15 Posters  7 Recommendations   2010-03-16 Justified 7.9    2014-02-06 Bosch 7.9    2010-05-04 Luther 7.9    2013-03-04 Broadchurch 8.1    2014-06-01 Halt and Catch Fire 7.7    2013-05-12 The Fall 7.6    2004-03-21 Deadwood 8.1    2015-03-20 Bloodline 7.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.sundance.tv/series/rectify Genres Drama Keywords prison freedom innocence death row georgia ex-con wrongful conviction effects from the past Content Score 100 Yes! Looking good! Top Contributors 97 Elizabeth Jennings 28 lineker 15 david8s95 12 Ryan McCloskey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}