{"link": "https://www.themoviedb.org/tv/28599?language=en", "title": "The Capture of the Green River Killer", "resume": "The Capture of the Green River Killer is a 2008 2-part television film that first aired on Lifetime Television and tells the story of the Green River killer serial murders between 1982 and 1998.\nThe film was named one of the top 10 television productions of 2008 by Variety and was twice nominated for a 2008 Gemini Award for best direction and for best costuming. Lifetime's premiere of The Capture of the Green River Killer miniseries delivered two million viewers, making it 10-year-old Lifetime Movie Network's most-watched telecast ever.", "rate": 67, "genre": ["Documentary", "Drama"], "cast": ["Tom Cavanagh", "Currie Graham", "Amy Davidson", "Jessica Harmon", "Michelle Harrison"], "character": ["Dave Reichert", "Captain Norwell", "Helen 'Hel' Remus", "Natalie 'Nat' Webley", "Julie Reichert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28599   Expand The Capture of the Green River Killer   (2008) User Score Overview The Capture of the Green River Killer is a 2008 2-part television film that first aired on Lifetime Television and tells the story of the Green River killer serial murders between 1982 and 1998. The film was named one of the top 10 television productions of 2008 by Variety and was twice nominated for a 2008 Gemini Award for best direction and for best costuming. Lifetime's premiere of The Capture of the Green River Killer miniseries delivered two million viewers, making it 10-year-old Lifetime Movie Network's most-watched telecast ever. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Cavanagh Dave Reichert Currie Graham Captain Norwell Amy Davidson Helen 'Hel' Remus Jessica Harmon Natalie 'Nat' Webley Michelle Harrison Julie Reichert Full Cast & Crew Last Season Miniseries 2008 | 2 Episodes Season 1 of The Capture of the Green River Killer premiered on March 30, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2013-04-15 Eve of Destruction 4.5    1994-12-19 The Head 7.3    1995-04-08 The Maxx 9.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m, 240m Homepage   http://www.mylifetime.com/movies/the-capture-of-the-green-river-killer-i-ii Genres Documentary Drama Keywords serial killer miniseries police detective woman director 1980s 1990s Content Score 86 Almost there... Top Contributors R 21 Rebecca TB 11 TMDb Bot 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}