{"link": "https://www.themoviedb.org/tv/16730?language=en", "title": "American Music Awards", "resume": "The American Music Awards, is an annual American music awards show, created by Dick Clark in 1973 for ABC when the network's contract to present the Grammy Awards expired. Unlike the Grammys, which are awarded on the basis of votes by members of the Recording Academy, the AMAs are determined by a poll of the public and music buyers.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16730   Expand American Music Awards   (1974) User Score Overview The American Music Awards, is an annual American music awards show, created by Dick Clark in 1973 for ABC when the network's contract to present the Grammy Awards expired. Unlike the Grammys, which are awarded on the basis of votes by members of the Recording Academy, the AMAs are determined by a poll of the public and music buyers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season The 1st Annual American Music Awards 1974 | 3 Episodes Season 1 of American Music Awards premiered on February 19, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on American Music Awards. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  180m Homepage   http://www.americanmusicawards.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 9 Elizabeth Jennings 3 SeventhWard b 2 billybangor49@gmail.com m 2 mostafaskip  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}