{"link": "https://www.themoviedb.org/tv/11101?language=en", "title": "FreakyLinks", "resume": "FreakyLinks is an American television show that combined elements of horror, mystery, and comedy. It aired on the Fox Network from October 2000 until June 2001, for a total run of 13 episodes. The feel of the show closely modeled that of The X-Files and other supernatural-themed shows that were popular at the time.\nIn 2008, the series began airing on Universal's horror network Chiller.\nIt can also be seen on the Canadian ONE channel.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": ["Lisa Sheridan", "Karim Prince", "Ethan Embry", "Lizette Carrión", "Dennis Christopher"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11101   Expand FreakyLinks   (2000) User Score Overview FreakyLinks is an American television show that combined elements of horror, mystery, and comedy. It aired on the Fox Network from October 2000 until June 2001, for a total run of 13 episodes. The feel of the show closely modeled that of The X-Files and other supernatural-themed shows that were popular at the time. In 2008, the series began airing on Universal's horror network Chiller. It can also be seen on the Canadian ONE channel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Sheridan Karim Prince Ethan Embry Lizette Carrión Dennis Christopher Full Cast & Crew Last Season Season 1 2000 | 13 Episodes Season 1 of FreakyLinks premiered on October  6, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on FreakyLinks. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Drama Comedy Keywords paranormal phenomena paranormal investigation mysterious death Content Score 86 Almost there... Top Contributors 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}