{"link": "https://www.themoviedb.org/tv/63101?language=en", "title": "A New Leaf", "resume": "Kim Seok Joo (Kim Myung Min) is a cold, calculating lawyer who is vying to become successful at all costs. After a fateful accident causes him to lose his memory, Kim Seok Joo must rediscover who he is as a person and choose whether he will fight for justice or fall back into his old ways. Before the accident, he was engaged to the only grandchild of a wealthy family, Yoo Jung Sun (Chae Jung Ahn), but with no memory of her, he begins to fall for Lee Ji Yoon (Park Min Young), an idealistic intern at his law firm. As he regains his memories, will his heart choose new love or old greed?", "rate": 77, "genre": ["Drama", "Romance"], "cast": ["Kim Myung-min", "Park Min-young", "Kim Sang-joong", "Chae Jung-an", "Kim Ji-Han"], "character": ["Kim Seok-joo", "Lee Ji-yoon", "Cha Young-woo", "Yoo Jung-seon", "Jeon Ji-won"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63101   Expand A New Leaf   (2014) User Score Overview Kim Seok Joo (Kim Myung Min) is a cold, calculating lawyer who is vying to become successful at all costs. After a fateful accident causes him to lose his memory, Kim Seok Joo must rediscover who he is as a person and choose whether he will fight for justice or fall back into his old ways. Before the accident, he was engaged to the only grandchild of a wealthy family, Yoo Jung Sun (Chae Jung Ahn), but with no memory of her, he begins to fall for Lee Ji Yoon (Park Min Young), an idealistic intern at his law firm. As he regains his memories, will his heart choose new love or old greed? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Myung-min Kim Seok-joo Park Min-young Lee Ji-yoon Kim Sang-joong Cha Young-woo Chae Jung-an Yoo Jung-seon Kim Ji-Han Jeon Ji-won Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of A New Leaf premiered on April 30, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2012-08-13 Faith 7.6    2014-12-08 Healer 8.7    2011-06-29 Heartstrings 7.0  Facts Original Name  개과천선 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/ggcs/ Genres Drama Romance Keywords korea Content Score 86 Almost there... Top Contributors M 41 Maria180493 s 3 sheva_vitali 2 Imzadi 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}