{"link": "https://www.themoviedb.org/tv/73634?language=en", "title": "Padre Pio: Between Heaven and Earth", "resume": "The story of Padre Pio (1887-1968) from the onset of the stigmata during World War I, when he prayed that soldiers' suffering be his, until his death. The story is told by Emilia, Pio's friend, to a Vatican official reviewing Padre Pio's potential canonization. We watch local people venerate the humble Capuchin monk, we see petty jealousies within the Church almost bring him down, and we experience his decision to build a Home for the Relief of Suffering, a labor of love begun just after World War II. Emilia and her husband Dr. Sanguineti work tirelessly beside the humble but sensible Pio.", "rate": 60, "genre": ["Drama"], "cast": ["Francesca Figus", "Pope John Paul II", "Saverio D'Ercole", "Antonio Casagrande", "Giuseppe Antignati"], "character": ["Rosaria", "Se stesso", "Segretario del Cardinale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73634   Expand Padre Pio: Between Heaven and Earth   (2000) User Score Overview The story of Padre Pio (1887-1968) from the onset of the stigmata during World War I, when he prayed that soldiers' suffering be his, until his death. The story is told by Emilia, Pio's friend, to a Vatican official reviewing Padre Pio's potential canonization. We watch local people venerate the humble Capuchin monk, we see petty jealousies within the Church almost bring him down, and we experience his decision to build a Home for the Relief of Suffering, a labor of love begun just after World War II. Emilia and her husband Dr. Sanguineti work tirelessly beside the humble but sensible Pio. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Francesca Figus Rosaria Pope John Paul II Se stesso Saverio D'Ercole Segretario del Cardinale Antonio Casagrande Giuseppe Antignati Full Cast & Crew Last Season Season 1 2000 | 2 Episodes Season 1 of Padre Pio: Between Heaven and Earth premiered on November 12, 2000. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Padre Pio: Between Heaven and Earth. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Padre Pio: Between Heaven and Earth. You can help by rating TV shows you've seen. Facts Original Name  Padre Pio - Tra cielo e terra Status  Ended Network Certification  - Type  Miniseries Original Language  Italian Runtime  91m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 80 TMDb Bot VA 41 Viktor Andersson 8 Banana 4 fireknob  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}