{"link": "https://www.themoviedb.org/tv/15804?language=en", "title": "Batman: The Brave and the Bold", "resume": "Batman: The Brave and the Bold is an American animated television series based in part on the DC Comics series The Brave and the Bold which features two or more super heroes coming together to solve a crime or foil a super villain. As the title suggests, the cartoon focuses on Batman's regular \"team-ups\" with various heroes similar to the most well-known version of the original comic book series. The series premiered on November 14, 2008 on Cartoon Network in the United States, and ended on November 18, 2011.", "rate": 70, "genre": ["Animation", "Action", "Adventure"], "cast": ["Diedrich Bader"], "character": ["Batman (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15804   Expand Batman: The Brave and the Bold   (2008) User Score Overview Batman: The Brave and the Bold is an American animated television series based in part on the DC Comics series The Brave and the Bold which features two or more super heroes coming together to solve a crime or foil a super villain. As the title suggests, the cartoon focuses on Batman's regular \"team-ups\" with various heroes similar to the most well-known version of the original comic book series. The series premiered on November 14, 2008 on Cartoon Network in the United States, and ended on November 18, 2011. Featured Crew Bob Kane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diedrich Bader Batman (voice) Full Cast & Crew Last Season Season 3 2011 | 13 Episodes Season 3 of Batman: The Brave and the Bold premiered on April  8, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  13 Recommendations   2004-09-11 The Batman 6.8    1997-09-20 The New Batman Adventures 7.7    1968-09-14 The Adventures of Batman 7.4    2012-04-01 Marvel's Ultimate Spider-Man 6.6    2008-03-08 The Spectacular Spider-Man 7.4    1981-09-12 Spider-Man 6.8    2001-11-17 Justice League 8.2    2003-07-11 Spider-Man: The New Animated Series 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 25m, 30m Homepage   http://batmanthebraveandthebold.com/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors d 11 denis LC 8 Legit Corporation 7 Damien Haynes 6 CrewMdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}