{"link": "https://www.themoviedb.org/tv/39404?language=en", "title": "Haunted Collector", "resume": "Haunted Collector is an American television reality series which airs on the Syfy cable television channel. The first season premiered on June 1, 2011, and ended on July 6, 2011. The series features a team of paranormal investigators led by demonologist John Zaffis, who investigates alleged haunted locations with the hopes of identifying and removing any on-site artifacts or trigger objects that may be the source of the supposed paranormal or poltergeist activity.\nThe production of the second season started in December 2011, and premiered on June 6, 2012.\nOn September 17, 2012, Syfy announced that the series has been renewed for 12-episode third season, which premiered on March 6, 2013.", "rate": 40, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39404   Expand Haunted Collector   (2011) User Score Overview Haunted Collector is an American television reality series which airs on the Syfy cable television channel. The first season premiered on June 1, 2011, and ended on July 6, 2011. The series features a team of paranormal investigators led by demonologist John Zaffis, who investigates alleged haunted locations with the hopes of identifying and removing any on-site artifacts or trigger objects that may be the source of the supposed paranormal or poltergeist activity. The production of the second season started in December 2011, and premiered on June 6, 2012. On September 17, 2012, Syfy announced that the series has been renewed for 12-episode third season, which premiered on March 6, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2013 | 12 Episodes Season 3 of Haunted Collector premiered on March  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Haunted Collector. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.syfy.com/hauntedcollector/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}