{"link": "https://www.themoviedb.org/tv/21556?language=en", "title": "Web Therapy", "resume": "Web Therapy is an improvised online series starring Lisa Kudrow as Fiona Wallice, a therapist who has conceived of a new form of therapy: the titular \"web therapy\".", "rate": 73, "genre": ["Comedy"], "cast": ["Lisa Kudrow"], "character": ["Fiona Wallice"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21556   Expand Web Therapy   (2008) User Score Overview Web Therapy is an improvised online series starring Lisa Kudrow as Fiona Wallice, a therapist who has conceived of a new form of therapy: the titular \"web therapy\". Featured Crew Lisa Kudrow Creator Dan Bucatinsky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Kudrow Fiona Wallice Full Cast & Crew Last Season Season 4 2011 | 17 Episodes Season 4 of Web Therapy premiered on November 16, 2011. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Web Therapy. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Web Therapy. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 68 lineker 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}