{"link": "https://www.themoviedb.org/tv/61146?language=en", "title": "Secret Love Affair", "resume": "Despite being married and having a fulfilling career as a sophisticated arts foundation director, something is missing in Oh Hye Won's life. When she meets twenty-something Lee Seon Jae, Hye Won's appetite for passion is awakened, and she soon falls for the impoverished piano prodigy. Though they risk everything, Hye Won and Seon Jae can't help but embark on an affair that threatens to destroy both their lives. Based on the 2005 Japanese film Tokyo Tower, this romance aches with the desperate struggle between love and reality.", "rate": 78, "genre": ["Drama"], "cast": ["Yoo Ah-in", "Kim Hee-ae", "Kim Kwon", "Park Hyuk-kwon", "Jang So-yeon"], "character": ["Lee Sun-Jae", "Oh Hye-Won", "Woo-sung", "Kang Joon-hyung", "Se-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61146   Expand Secret Love Affair   (2014) User Score Overview Despite being married and having a fulfilling career as a sophisticated arts foundation director, something is missing in Oh Hye Won's life. When she meets twenty-something Lee Seon Jae, Hye Won's appetite for passion is awakened, and she soon falls for the impoverished piano prodigy. Though they risk everything, Hye Won and Seon Jae can't help but embark on an affair that threatens to destroy both their lives. Based on the 2005 Japanese film Tokyo Tower, this romance aches with the desperate struggle between love and reality. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoo Ah-in Lee Sun-Jae Kim Hee-ae Oh Hye-Won Kim Kwon Woo-sung Park Hyuk-kwon Kang Joon-hyung Jang So-yeon Se-jin Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Secret Love Affair premiered on March 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations   2012-08-18 Panda and Hedgehog 6.0    2013-11-28 Let's Eat 7.8  Facts Original Name  밀회 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://drama.jtbc.joins.com/secret/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 25 Maria180493 N 14 Nightowl.Kr 11 Elizabeth Jennings d 1 daphie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}