{"link": "https://www.themoviedb.org/tv/17918?language=en", "title": "Supersize vs Superskinny", "resume": "Supersize vs Superskinny is a British television programme on Channel 4 that features information about dieting and extreme eating lifestyles. One of the main show features is a weekly comparison between an overweight person, and an underweight person. The two are brought to a feeding clinic, and live together for five days, swapping diets all supervised by Dr Christian Jessen.\nThe show also featured Anna Richardson in the 1st, 2nd and 3rd series, who examined new methods to lose weight by trying diets she finds on the Internet, some of which have shocking side effects. For example, Anna attempted Laser lipolysis, which went drastically wrong and resulted in severe bruising. Also, she discovered Diabulimia and spoke to Isabelle Caro, a French actress, renowned for her underweight figure and anorexia campaign.\nDuring the first series in 2008, one feature involved Gillian McKeith, who tried to find a way to \"ban big bums\" in the UK. She tested out different exercises to tone the buttocks of different groups of ladies, and made a leader board for the most effective.", "rate": 70, "genre": ["Reality"], "cast": ["Liza Tarbuck", "Anna Ryder Richardson", "Gillian McKeith", "Anna Richardson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17918   Expand Supersize vs Superskinny   (2008) User Score Overview Supersize vs Superskinny is a British television programme on Channel 4 that features information about dieting and extreme eating lifestyles. One of the main show features is a weekly comparison between an overweight person, and an underweight person. The two are brought to a feeding clinic, and live together for five days, swapping diets all supervised by Dr Christian Jessen. The show also featured Anna Richardson in the 1st, 2nd and 3rd series, who examined new methods to lose weight by trying diets she finds on the Internet, some of which have shocking side effects. For example, Anna attempted Laser lipolysis, which went drastically wrong and resulted in severe bruising. Also, she discovered Diabulimia and spoke to Isabelle Caro, a French actress, renowned for her underweight figure and anorexia campaign. During the first series in 2008, one feature involved Gillian McKeith, who tried to find a way to \"ban big bums\" in the UK. She tested out different exercises to tone the buttocks of different groups of ladies, and made a leader board for the most effective. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liza Tarbuck Anna Ryder Richardson Gillian McKeith Anna Richardson Full Cast & Crew Last Season Season 6 2013 | 11 Episodes Season 6 of Supersize vs Superskinny premiered on January  8, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Supersize vs Superskinny. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/supersize-vs-superskinny Genres Reality Keywords eating disorder Content Score 86 Almost there... Top Contributors s 3 speedycars 2 Banana 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}