{"link": "https://www.themoviedb.org/tv/50827?language=en", "title": "House of Love", "resume": "The year is 1905 during King Chulalongkorn’s reign, Thai slavery has come to an end. As men are fighting for a place society, women are fighting for a place at home. Reuan Sanaeha tells the story of Khun Luang Prap Thamrongnakhra and his two wives, one is very beautiful but very cold-hearted played by Bee Namthip. His second wife is a selfish woman from Chiangmai played by Pim Pimmada. The two women do not get along and are in constant competition for Khun Luang’s affection and the number spot in the household. Not only do they have competition with each other, they also have to compete with Khun Luang’s servant wives, especially Mali (Jeab), one of Khun Luang’s faithful servant wives. The story centers around the two women’s desire for the number spot in the household and the things they will do to get there.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Saksit Tangtong", "Namthip Jongrachatawiboon", "Pimmada Boriraksupakorn", "Sopitnapa Chumpanee", "Anatpol Sirichoomsang"], "character": ["Khun Luang Prap Thamrongnakhra", "Chom", "Euang", "Mali", "Ming"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50827   Expand House of Love   (2013) User Score  Play Trailer Overview The year is 1905 during King Chulalongkorn’s reign, Thai slavery has come to an end. As men are fighting for a place society, women are fighting for a place at home. Reuan Sanaeha tells the story of Khun Luang Prap Thamrongnakhra and his two wives, one is very beautiful but very cold-hearted played by Bee Namthip. His second wife is a selfish woman from Chiangmai played by Pim Pimmada. The two women do not get along and are in constant competition for Khun Luang’s affection and the number spot in the household. Not only do they have competition with each other, they also have to compete with Khun Luang’s servant wives, especially Mali (Jeab), one of Khun Luang’s faithful servant wives. The story centers around the two women’s desire for the number spot in the household and the things they will do to get there. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saksit Tangtong Khun Luang Prap Thamrongnakhra Namthip Jongrachatawiboon Chom Pimmada Boriraksupakorn Euang Sopitnapa Chumpanee Mali Anatpol Sirichoomsang Ming Full Cast & Crew Last Season Season 1 2013 | 24 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on House of Love. You can help by rating TV shows you've seen. Facts Original Name  เรือนเสน่หา Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  65m Homepage   http://www.exact.co.th/Ruensanaeha/ Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 38 Crip TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}