{"link": "https://www.themoviedb.org/tv/42368?language=en", "title": "Lilyhammer", "resume": "Frank Tagliano (Steven Van Zandt), is a former member of the New York mob. After testifying in a trial in the United States, Tagliano is relocated to Lillehammer in Norway through the FBI's witness protection program. Frank Tagliano was intrigued by Lillehammer when he saw television images of the Winter Olympics in 1994, and therefore chooses to start his new life there. The transition from being a feared and respected gangster in New York, to become an unemployed immigrant in Norway, is not simple. Frank discovers that to get up and in the Norwegian rural society, he must resort to the old, ruthless methods.\nThe spelling of the series title alludes to Tagliano's dog Lily, and the way that Frank and some other anglophones pronounce the town's name.", "rate": 74, "genre": ["Drama", "Comedy", "Crime"], "cast": ["Steven Van Zandt", "Trond Fausa Aurvåg", "Marian Saastad Ottesen", "Steinar Sagen", "Sven Nordin"], "character": ["Frank Tagliano / Giovanni 'Johnny' Henriksen", "Torgeir Lien", "Sigrid Haugli", "Roar Lien", "Julius Backe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42368   Expand Lilyhammer   (2012) User Score  Play Trailer Overview Frank Tagliano (Steven Van Zandt), is a former member of the New York mob. After testifying in a trial in the United States, Tagliano is relocated to Lillehammer in Norway through the FBI's witness protection program. Frank Tagliano was intrigued by Lillehammer when he saw television images of the Winter Olympics in 1994, and therefore chooses to start his new life there. The transition from being a feared and respected gangster in New York, to become an unemployed immigrant in Norway, is not simple. Frank discovers that to get up and in the Norwegian rural society, he must resort to the old, ruthless methods. The spelling of the series title alludes to Tagliano's dog Lily, and the way that Frank and some other anglophones pronounce the town's name. Featured Crew Anne Bjørnstad Creator Eilif Skodvin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  13 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steven Van Zandt Frank Tagliano / Giovanni 'Johnny' Henriksen Trond Fausa Aurvåg Torgeir Lien Marian Saastad Ottesen Sigrid Haugli Steinar Sagen Roar Lien Sven Nordin Julius Backe Full Cast & Crew Last Season Season 3 2014 | 8 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply any other good TV shows based in Europe? Open 0 by Markoff\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  13 Posters  8 Recommendations   2006-10-10 Intelligence 8.3    2015-12-24 Dawn of the Croods 6.6    2014-08-07 Our World War 7.2    2015-01-10 My Sunshine 7.4    2011-02-08 Traffic Light 7.2    2011-09-05 Zig and Sharko 5.3    2015-09-12 Goldie & Bear 5.4    2009-02-25 Burnistoun 7.8  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  58m, 45m, 43m Homepage  - Genres Drama Comedy Crime Keywords witness protection norway mafia Content Score 100 Yes! Looking good! Top Contributors 16 Elizabeth Jennings T 15 Tigrecito 14 Banana 12 Bendik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}