{"link": "https://www.themoviedb.org/tv/70000?language=en", "title": "Hua Mulan", "resume": "A young girl, Hua Mulan decides to pretend to be a man in order to stop her sickly old father from being called up for the army. She fools everyone but ends up with more than she bargained for when she falls for one of the young generals Li Leung", "rate": 0, "genre": ["Drama"], "cast": ["Anita Yuen", "Vincent Zhao", "Sun Xing", "En-chun Chiao", "Li Li-Chun"], "character": ["Hua Mulan", "Li Liang", "Sun Jili", "Yu Cheng'en", "Hua Hu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70000   Expand Hua Mulan   (1999) User Score Overview A young girl, Hua Mulan decides to pretend to be a man in order to stop her sickly old father from being called up for the army. She fools everyone but ends up with more than she bargained for when she falls for one of the young generals Li Leung Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anita Yuen Hua Mulan Vincent Zhao Li Liang Sun Xing Sun Jili En-chun Chiao Yu Cheng'en Li Li-Chun Hua Hu Full Cast & Crew Last Season Season 1 1999 | 40 Episodes Season 1 of Hua Mulan premiered on June 28, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hua Mulan. You can help by rating TV shows you've seen. Facts Original Name  花木蘭 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  90m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors c 38 ctchim 6 janar TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}