{"link": "https://www.themoviedb.org/tv/61176?language=en", "title": "Heroes of Cosplay", "resume": "Heroes of Cosplay is a tantalizing docu-series that lifts the veil on the imaginative world of cosplay competition, because fans at the comic book conventions don’t merely dress up as their favorite character; they also compete to see who’s the best! The series follows cosplayers of all levels, from legend Yaya Han, to rising stars and newbies, as they make a splash at comic book conventions around the country. The series will dive deep into their lives, following their process as they create extravagant and visually arresting costumes each week. These nine constantly defy odds and race against the clock to transform themselves into amazing fictional characters that push the boundaries between fantasy and reality, all in hopes of impressing the convention judges to win a cash prizes and take their cosplay stardom to new heights.", "rate": 50, "genre": ["Reality"], "cast": ["Jesse Lagers", "Riki LeCotey", "Yaya Han", "Jessica Merizan", "Chloe Dykstra"], "character": ["Himself", "Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61176   Expand Heroes of Cosplay   (2013) User Score Overview Heroes of Cosplay is a tantalizing docu-series that lifts the veil on the imaginative world of cosplay competition, because fans at the comic book conventions don’t merely dress up as their favorite character; they also compete to see who’s the best! The series follows cosplayers of all levels, from legend Yaya Han, to rising stars and newbies, as they make a splash at comic book conventions around the country. The series will dive deep into their lives, following their process as they create extravagant and visually arresting costumes each week. These nine constantly defy odds and race against the clock to transform themselves into amazing fictional characters that push the boundaries between fantasy and reality, all in hopes of impressing the convention judges to win a cash prizes and take their cosplay stardom to new heights. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jesse Lagers Himself Riki LeCotey Herself Yaya Han Herself Jessica Merizan Herself Chloe Dykstra Herself Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Heroes of Cosplay premiered on August 13, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2014-03-25 Jim Henson's Creature Shop Challenge 8.1  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://www.syfy.com/heroesofcosplay Genres Reality Keywords fan geek cosplay fan convention Content Score 71 Just a little bit more... Top Contributors 19 Banana 5 McButton 2 Jaime Neto 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}