{"link": "https://www.themoviedb.org/tv/70936?language=en", "title": "Hot Girl", "resume": "How are legends made?\nGuan Xiao Di is a rebellious young woman. The traditional life of studying and finding a stale career never interested her. When she accidentally stumbles into a bodyguard training center, her life will never be the same again.\nThere, she meets the arrogant Liang Da Wei, who is training Cui Tian Qi and other “hot girls” to become the best bodyguards. As Xiao Di undergoes the grueling training regimen, she begins to learn the value of discipline and hard work on the road to becoming a legendary bodyguard.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Dilraba Dilmurat", "Ma Ke"], "character": ["Guan Xiao Di", "Liang Da Wei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70936   Expand Hot Girl   (2016) User Score Overview How are legends made? Guan Xiao Di is a rebellious young woman. The traditional life of studying and finding a stale career never interested her. When she accidentally stumbles into a bodyguard training center, her life will never be the same again. There, she meets the arrogant Liang Da Wei, who is training Cui Tian Qi and other “hot girls” to become the best bodyguards. As Xiao Di undergoes the grueling training regimen, she begins to learn the value of discipline and hard work on the road to becoming a legendary bodyguard. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dilraba Dilmurat Guan Xiao Di Ma Ke Liang Da Wei Full Cast & Crew Last Season Season 1 2016 | 37 Episodes Season 1 of Hot Girl premiered on August 10, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hot Girl. You can help by rating TV shows you've seen. Facts Original Name  麻辣变形计 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Action & Adventure Keywords china romance military Content Score 56 We're so close, yet so far. Top Contributors M 24 Maria180493 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}