{"link": "https://www.themoviedb.org/tv/4624?language=en", "title": "Roswell", "resume": "Bizarre things start happening in the little New Mexico town where UFOs were spotted in 1947. Cut to 1999, when a cute high-school student saves the life of a teenage waitress. Surrounded by cliques of clever, angst-filled classmates, the two form a bond that threatens the survival of a secret universe involving superhuman powers, a yen for hot sauce and an alien gene pool.", "rate": 71, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Jason Behr", "Shiri Appleby", "Katherine Heigl", "Majandra Delfino", "Brendan Fehr"], "character": ["Max Evans", "Liz Parker", "Isabel Evans", "Maria DeLuca", "Michael Guerin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4624   Expand Roswell   (1999) User Score  Play Trailer Overview Bizarre things start happening in the little New Mexico town where UFOs were spotted in 1947. Cut to 1999, when a cute high-school student saves the life of a teenage waitress. Surrounded by cliques of clever, angst-filled classmates, the two form a bond that threatens the survival of a secret universe involving superhuman powers, a yen for hot sauce and an alien gene pool. Featured Crew Jason Katims Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  21 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Jason Behr Max Evans Shiri Appleby Liz Parker Katherine Heigl Isabel Evans Majandra Delfino Maria DeLuca Brendan Fehr Michael Guerin Full Cast & Crew Last Season Season 3 2001 | 18 Episodes Season 3 of Roswell premiered on October  9, 2001. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply g If this show came out in the CW days it wouldve been huge Open 1 by  DonaldTrump w Isabel: Happy Birthday Katherine Heigl! Open 0 by wonder2wonder\n      \n     g tessa or liz Open 0 by gspgreases\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  21 Posters  3 Recommendations   2003-10-30 Tru Calling 6.9    2004-07-11 The 4400 6.9    1999-10-05 Angel 7.6    2000-10-03 Dark Angel 7.2    2005-09-23 Ghost Whisperer 5.6    1995-03-22 Sliders 7.0    1998-09-09 First Wave 6.6    2006-10-22 Torchwood 7.4  Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m, 42m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords high school new mexico alien alien teenager interspecies romance based on young adult novel Content Score 100 Yes! Looking good! Top Contributors 32 Banana j 9 jnylen RA 7 Rodrigo Amaral Buenos Ayres m 5 misak0007  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}