{"link": "https://www.themoviedb.org/tv/60770?language=en", "title": "Devil's Due", "resume": "During WW2, a young student of medicine comes to the big city to discover the secret of death, and stays at a motel that turns out to be a brothel. He is asked from Ustasha officer to perform experiments of resurrecting the dead, while the Fascist authorities look for a female communist hiding in the city.", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Ivo Gregurević", "Sven Lasta", "Vera Zima", "Miodrag Krivokapić", "Branka Cvitković"], "character": ["Pavle", "Bengali / Nepoznati / Ustaški ratnik", "Eta", "Jakov"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60770   Expand Devil's Due   (1979) User Score Overview During WW2, a young student of medicine comes to the big city to discover the secret of death, and stays at a motel that turns out to be a brothel. He is asked from Ustasha officer to perform experiments of resurrecting the dead, while the Fascist authorities look for a female communist hiding in the city. Featured Crew Vanča Kljaković Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ivo Gregurević Pavle Sven Lasta Bengali / Nepoznati / Ustaški ratnik Vera Zima Eta Miodrag Krivokapić Jakov Branka Cvitković Full Cast & Crew Last Season Season 1 1979 | 1 Episode Season 1 of Devil's Due premiered on January  1, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Devil's Due. You can help by rating TV shows you've seen. Facts Original Name  Đavolje sjeme Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Sci-Fi & Fantasy Keywords train station communist brothel fascism world war ii syphillis croatia student of medicine Content Score 79 Pump it up! We're close now. Top Contributors 34 Mario Gaborović 5 Banana 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}