{"link": "https://www.themoviedb.org/tv/76255?language=en", "title": "연남동 539", "resume": "This drama about a group of people from diverse backgrounds who live together in a share house in Yeonnam-dong.", "rate": 60, "genre": ["Comedy", "Drama"], "cast": ["Lee Jong-hyuk", "Oh Yoon-ah", "Lee Mun-sik", "Brian Joo", "Go Na-eun"], "character": ["Sang Bong-tae", "Yoon Yi-na", "Jodan", "Ryan", "Seok Do-hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76255   Expand 연남동 539   (2018) User Score  Play Trailer Overview This drama about a group of people from diverse backgrounds who live together in a share house in Yeonnam-dong. Featured Crew Koreana Hun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Jong-hyuk Sang Bong-tae Oh Yoon-ah Yoon Yi-na Lee Mun-sik Jodan Brian Joo Ryan Go Na-eun Seok Do-hee Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of 연남동 539 premiered on January 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 연남동 539. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Maeil Broadcasting Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 19 Lumina_B d 8 daphie l 6 lala07 n 6 neokafa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}