{"link": "https://www.themoviedb.org/tv/67176?language=en", "title": "Le chalet", "resume": "Sarah, Lily, Francis and Antoine are all hard-core skiers and snowboarders, and they’re sharing a winter cottage to be as close as possible to the mountain. When Sarah invites her friend Catherine to move in with them for the winter, everyone except Lily is happy to welcome a new addition to the gang. But this new arrival quickly upsets the group dynamics and destabilizes each individual member. Our six friends will soon realize how much the upcoming ski season will be just like their many downhill runs: emotional, eventful and sometimes unbelievable.", "rate": 60, "genre": ["Drama"], "cast": ["Sarah-Jeanne Labrosse", "Julianne Côté", "Antoine Pilon", "Félix-Antoine Tremblay", "Catherine Brunet"], "character": ["Sarah", "Lili Larose", "Antoine", "Francis", "Catherine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67176   Expand Le chalet   (2015) User Score Overview Sarah, Lily, Francis and Antoine are all hard-core skiers and snowboarders, and they’re sharing a winter cottage to be as close as possible to the mountain. When Sarah invites her friend Catherine to move in with them for the winter, everyone except Lily is happy to welcome a new addition to the gang. But this new arrival quickly upsets the group dynamics and destabilizes each individual member. Our six friends will soon realize how much the upcoming ski season will be just like their many downhill runs: emotional, eventful and sometimes unbelievable. Featured Crew Kadidja Haidara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah-Jeanne Labrosse Sarah Julianne Côté Lili Larose Antoine Pilon Antoine Félix-Antoine Tremblay Francis Catherine Brunet Catherine Full Cast & Crew Current Season Season 4 2018 | 15 Episodes Season 4 of Le chalet premiered on January  1, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Le chalet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Scripted Original Language  French Runtime  23m Homepage   http://lechalet.vrak.tv Genres Drama Keywords winter roommate quebec group of friends young adult téléroman Content Score 100 Yes! Looking good! Top Contributors 100 Banana 4 Guipat N 2 Ney  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}