{"link": "https://www.themoviedb.org/tv/15133?language=en", "title": "jPod", "resume": "jPod is a comedic television series based on Douglas Coupland’s novel of the same name. It premiered on CBC Television on January 8, 2008. Starting with the fifth episode, the show began airing Fridays at 9:00.\nOn April 4, 2008, it was announced that the CBC had cancelled the show because of low ratings. However, all but one of the remaining episodes aired. The cancellation of jPod sparked a fan-led protest.\nThe show's opening title theme is Flutter by Bonobo. Produced by I’m Feeling Lucky Productions for the CBC, jPod was created by Douglas Coupland and Michael MacLennan. Coupland also co-wrote many of season one’s episodes.", "rate": 70, "genre": ["Comedy"], "cast": ["Alan Thicke", "Sherry Miller", "Colin Cunningham", "Steph Song", "Emilie Ullerup"], "character": ["Jim Jarlewski", "Kaitlin Joyce"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15133   Expand jPod   (2008) User Score Overview jPod is a comedic television series based on Douglas Coupland’s novel of the same name. It premiered on CBC Television on January 8, 2008. Starting with the fifth episode, the show began airing Fridays at 9:00. On April 4, 2008, it was announced that the CBC had cancelled the show because of low ratings. However, all but one of the remaining episodes aired. The cancellation of jPod sparked a fan-led protest. The show's opening title theme is Flutter by Bonobo. Produced by I’m Feeling Lucky Productions for the CBC, jPod was created by Douglas Coupland and Michael MacLennan. Coupland also co-wrote many of season one’s episodes. Featured Crew Douglas Coupland Creator Michael MacLennan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Thicke Jim Jarlewski Sherry Miller Colin Cunningham Steph Song Emilie Ullerup Kaitlin Joyce Full Cast & Crew Last Season Season 1 2008 | 13 Episodes Season 1 of jPod premiered on January  8, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on jPod. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cbc.ca/jpod/ Genres Comedy Keywords based on novel or book video game geek workplace comedy Content Score 93 Almost there... Top Contributors 11 Banana 3 SeRuJi0 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}