{"link": "https://www.themoviedb.org/tv/46097?language=en", "title": "The History of Our Family", "resume": "Wagaya no Rekishi is a Japanese three-part television mini-series, shown on Fuji TV from April 9, 2010 to April 11, 2010 to celebrate its 50th Anniversary. The show was known for its star-studded cast.", "rate": 75, "genre": ["Comedy", "Family"], "cast": ["Akiyoshi Nakao", "Koji Yamamoto", "Kou Shibasaki", "Koichi Sato", "Seishirou Katou"], "character": ["Hideo Murata", "Mitsunari Ano", "Masako Yame", "Taizo Onizuka", "Minoru Yame"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46097   Expand The History of Our Family   (2010) User Score Overview Wagaya no Rekishi is a Japanese three-part television mini-series, shown on Fuji TV from April 9, 2010 to April 11, 2010 to celebrate its 50th Anniversary. The show was known for its star-studded cast. Featured Crew Koki Mitani Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akiyoshi Nakao Hideo Murata Koji Yamamoto Mitsunari Ano Kou Shibasaki Masako Yame Koichi Sato Taizo Onizuka Seishirou Katou Minoru Yame Full Cast & Crew Last Season Season 01 2010 | 3 Episodes Season 1 of The History of Our Family premiered on April  9, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The History of Our Family. You can help by rating TV shows you've seen. Facts Original Name  わが家の歴史 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Comedy Family Keywords romance family Content Score 93 Almost there... Top Contributors A 65 Aka75 CM 6 Cherche Moi g 4 gashtoby 3 Nikki  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}