{"link": "https://www.themoviedb.org/tv/34072?language=en", "title": "Babe, My Love", "resume": "Aishiteruze Baby is a shōjo romance manga by Yoko Maki. It was serialized by Shueisha in Ribon from April 2002 and January 2005 and collected in seven bound volumes. It was adapted as a 26-episode anime television series produced by TMS Entertainment and Animax, broadcast in Japan on Animax from April to October 2004. The series is about a teenage boy, Kippei, who becomes the caretaker of his 5-year-old cousin, Yuzuyu, after her mother abandons her. Both the manga and anime have been praised for successfully mixing serious issues with a light-hearted tone.", "rate": 65, "genre": ["Animation", "Drama", "Comedy"], "cast": ["Miyuu Tsuzuhara", "Maki Saito", "Masami Suzuki", "Fuyuka Ono", "Fumina Hara"], "character": ["Yuzuyu Sakashita", "Aki Kagami", "Satsuki Katakura", "Mai Motoki", "Kokoro Tokunaga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34072   Expand Babe, My Love   (2004) User Score Overview Aishiteruze Baby is a shōjo romance manga by Yoko Maki. It was serialized by Shueisha in Ribon from April 2002 and January 2005 and collected in seven bound volumes. It was adapted as a 26-episode anime television series produced by TMS Entertainment and Animax, broadcast in Japan on Animax from April to October 2004. The series is about a teenage boy, Kippei, who becomes the caretaker of his 5-year-old cousin, Yuzuyu, after her mother abandons her. Both the manga and anime have been praised for successfully mixing serious issues with a light-hearted tone. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyuu Tsuzuhara Yuzuyu Sakashita Maki Saito Aki Kagami Masami Suzuki Satsuki Katakura Fuyuka Ono Mai Motoki Fumina Hara Kokoro Tokunaga Full Cast & Crew Last Season Season 1 2004 | 26 Episodes Season 1 of Babe, My Love premiered on April  3, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Babe, My Love. You can help by rating TV shows you've seen. Facts Original Name  愛してるぜ ベイベ★★ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tms-e.com/on_air/beibe/ Genres Animation Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 sp1ti 5 Oriknox C 4 Carlosmls m 4 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}