{"link": "https://www.themoviedb.org/tv/61934?language=en", "title": "Big Man", "resume": "Kim Ji Hyuk (Kang Ji Hwan) lives a hard knocked life, but when the orphan meets the modest restaurateur Hong Dal Sook (Song Ok Suk), he gains a mother figure and works hard to open his own restaurant one day. Then suddenly, the family behind Korea's most powerful corporation claims that he is their long lost son. When Ji Hyeok discovers the Hyunsung family's ulterior motives, he swears to bring down the company that destroyed the life he worked so hard to build.", "rate": 65, "genre": ["Drama"], "cast": ["Kang Ji-hwan", "Choi Daniel", "Lee Da-hee", "Jung So-min", "Yoon So-hee"], "character": ["Kim Ji-hyuk", "Kang Dong-seok", "So Mi-ra", "Kang Jin-ah", "So Hye-ra"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61934   Expand Big Man   (2014) User Score  Play Trailer Overview Kim Ji Hyuk (Kang Ji Hwan) lives a hard knocked life, but when the orphan meets the modest restaurateur Hong Dal Sook (Song Ok Suk), he gains a mother figure and works hard to open his own restaurant one day. Then suddenly, the family behind Korea's most powerful corporation claims that he is their long lost son. When Ji Hyeok discovers the Hyunsung family's ulterior motives, he swears to bring down the company that destroyed the life he worked so hard to build. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  2 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kang Ji-hwan Kim Ji-hyuk Choi Daniel Kang Dong-seok Lee Da-hee So Mi-ra Jung So-min Kang Jin-ah Yoon So-hee So Hye-ra Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Big Man premiered on April 28, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Big Man. You can help by rating TV shows you've seen. Facts Original Name  빅맨 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/bigman/main.html Genres Drama Keywords suspense korea Content Score 93 Almost there... Top Contributors M 42 Maria180493 t 6 tmdb38202327 z 5 zurman1 4 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}