{"link": "https://www.themoviedb.org/tv/70932?language=en", "title": "Against Our Destiny", "resume": "Gertrudis and Armida are two young sisters with completely different personalities who learn to support each other after becoming orphans and being taken under the care of their aunt Luzmila, who denies them any kind of love. Between their innocence and their audacity, the two young women plan to escape, but everything goes wrong, they end up separated and thinking that the other one has died. It will take two decades for these two sisters to reunite.", "rate": 5, "genre": [], "cast": ["Caterin Escobar", "Diego Trujillo", "Sandra Reyes", "Christian Tappán"], "character": ["Armida López", "Ismael Herrera", "Gertrudis López", "Felicito Yaneque"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70932   Expand Against Our Destiny   (2016) User Score  Play Trailer Overview Gertrudis and Armida are two young sisters with completely different personalities who learn to support each other after becoming orphans and being taken under the care of their aunt Luzmila, who denies them any kind of love. Between their innocence and their audacity, the two young women plan to escape, but everything goes wrong, they end up separated and thinking that the other one has died. It will take two decades for these two sisters to reunite. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Caterin Escobar Armida López Diego Trujillo Ismael Herrera Sandra Reyes Gertrudis López Christian Tappán Felicito Yaneque Full Cast & Crew Last Season Season 1 2016 | 73 Episodes Season 1 of Against Our Destiny premiered on September 19, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Against Our Destiny. You can help by rating TV shows you've seen. Facts Original Name  Cuando Vivas Conmigo Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  44m Homepage   http://www.caracoltv.com/cuando-vivas-conmigo/ Genres No genres have been added. Keywords based on novel or book Content Score 86 Almost there... Top Contributors 37 Marr 🇳🇱 J 4 J_PMARKNO TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}