{"link": "https://www.themoviedb.org/tv/2102?language=en", "title": "Simon & Simon", "resume": "Simon & Simon is an American detective television series that originally ran from November 24, 1981 to January 21, 1989. The series was broadcast on CBS and starred Gerald McRaney and Jameson Parker as two brothers who run a private detective agency together.", "rate": 69, "genre": ["Drama"], "cast": ["Gerald McRaney", "Jameson Parker", "Mary Carver", "Tim Reid"], "character": ["Rick Simon", "A.J. Simon", "Cecilia Simon", "Lt. Marcel 'Downtown' Brown"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2102   Expand Simon & Simon   (1981) User Score Overview Simon & Simon is an American detective television series that originally ran from November 24, 1981 to January 21, 1989. The series was broadcast on CBS and starred Gerald McRaney and Jameson Parker as two brothers who run a private detective agency together. Featured Crew Philip DeGuere Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gerald McRaney Rick Simon Jameson Parker A.J. Simon Mary Carver Cecilia Simon Tim Reid Lt. Marcel 'Downtown' Brown Full Cast & Crew Last Season Season 8 1988 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1982-10-01 Remington Steele 6.9    1983-10-03 Scarecrow and Mrs. King 5.5    1983-09-18 Hardcastle and McCormick 6.1    1976-10-03 Quincy, M.E. 7.0    1986-03-03 Matlock 6.9    1982-03-13 T. J. Hooker 6.1    1970-09-16 McCloud 7.0    1968-09-20 Hawaii Five-O 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords sibling relationship private investigator detective agency Content Score 93 Almost there... Top Contributors m 8 mode2 8 Banana d 7 denis S 5 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}