{"link": "https://www.themoviedb.org/tv/60?language=en", "title": "Hardball with Chris Matthews", "resume": "Hardball with Chris Matthews is an American television talk show on MSNBC, broadcast weekdays at 7 PM ET hosted by Chris Matthews. It originally aired on now-defunct America's Talking and later CNBC. The current title was derived from a book Matthews wrote in 1988, Hardball: How Politics Is Played Told by One Who Knows the Game. Hardball is a talking-head style cable news show where the moderator advances opinions on a wide range of topics, focusing primarily on current political issues. These issues are discussed with a panel of guests that usually consists of political analysts and sometimes include politicians.\nIt also runs in a \"Best of\" format Saturday mornings at 5 AM.", "rate": 51, "genre": ["News"], "cast": ["Chris Matthews"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60   Expand Hardball with Chris Matthews User Score Overview Hardball with Chris Matthews is an American television talk show on MSNBC, broadcast weekdays at 7 PM ET hosted by Chris Matthews. It originally aired on now-defunct America's Talking and later CNBC. The current title was derived from a book Matthews wrote in 1988, Hardball: How Politics Is Played Told by One Who Knows the Game. Hardball is a talking-head style cable news show where the moderator advances opinions on a wide range of topics, focusing primarily on current political issues. These issues are discussed with a panel of guests that usually consists of political analysts and sometimes include politicians. It also runs in a \"Best of\" format Saturday mornings at 5 AM. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Matthews Full Cast & Crew Last Season Season 17 — | 35 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Hardball with Chris Matthews. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.msnbc.msn.com/id/3036697 Genres News Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}