{"link": "https://www.themoviedb.org/tv/10466?language=en", "title": "At Home with the Braithwaites", "resume": "At Home with the Braithwaites is a British comedy-drama television series, created and written by Sally Wainwright. The storyline follows a suburban family from Leeds, whose life is turned upside down when the mother of the family wins 38 million pounds on the lottery. It was broadcast on ITV, for 26 episodes, from 20 January 2000 to 9 April 2003.\nAt the beginning of the first series, each member of the Braithwaite family has an issue. Alison has to decide what to do with the winnings, and when to tell her family. David is having an affair with Elaine, his secretary at work. Virginia is on the verge of flunking out of university. Sarah has a crush on her drama teacher. Charlotte suspects that her mother may be the mystery lottery winner.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Peter Davison", "Amanda Redman", "Sarah Churm", "Damian Zuk", "Scott Cooper"], "character": ["David Braithwaite", "Alison Braithwaite", "Sarah Braithwaite", "Phil Skidmore", "Jordan Fishwick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10466   Expand At Home with the Braithwaites   (2000) User Score Overview At Home with the Braithwaites is a British comedy-drama television series, created and written by Sally Wainwright. The storyline follows a suburban family from Leeds, whose life is turned upside down when the mother of the family wins 38 million pounds on the lottery. It was broadcast on ITV, for 26 episodes, from 20 January 2000 to 9 April 2003. At the beginning of the first series, each member of the Braithwaite family has an issue. Alison has to decide what to do with the winnings, and when to tell her family. David is having an affair with Elaine, his secretary at work. Virginia is on the verge of flunking out of university. Sarah has a crush on her drama teacher. Charlotte suspects that her mother may be the mystery lottery winner. Featured Crew Sally Wainwright Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Davison David Braithwaite Amanda Redman Alison Braithwaite Sarah Churm Sarah Braithwaite Damian Zuk Phil Skidmore Scott Cooper Jordan Fishwick Full Cast & Crew Last Season Season 1 2000 | 1 Episode Season 1 of At Home with the Braithwaites premiered on January 20, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on At Home with the Braithwaites. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  48m, 60m Homepage  - Genres Comedy Drama Keywords northern england lottery yorkshire wealth family british humour Content Score 93 Almost there... Top Contributors 23 rudely_murray O 14 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}