{"link": "https://www.themoviedb.org/tv/42499?language=en", "title": "Waiting in the Summer", "resume": "Waiting in the Summer is a Japanese anime television series animated by J.C. Staff, produced by Genco and Geneon, and directed by Tatsuyuki Nagai. The screenplay was written by Yōsuke Kuroda, with original character design by Taraku Uon, who both contributed in the creation of the Please! franchise. A 12-episode anime TV series aired in Japan between January and March 2012 on TV Aichi and KBS. Sentai Filmworks has licensed the anime for release in North America. A manga adaptation illustrated by Pepako Dokuta was serialized in ASCII Media Works' Dengeki Daioh magazine.", "rate": 73, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Haruka Tomatsu"], "character": ["Ichika Takatsuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42499   Expand Waiting in the Summer   (2012) User Score Overview Waiting in the Summer is a Japanese anime television series animated by J.C. Staff, produced by Genco and Geneon, and directed by Tatsuyuki Nagai. The screenplay was written by Yōsuke Kuroda, with original character design by Taraku Uon, who both contributed in the creation of the Please! franchise. A 12-episode anime TV series aired in Japan between January and March 2012 on TV Aichi and KBS. Sentai Filmworks has licensed the anime for release in North America. A manga adaptation illustrated by Pepako Dokuta was serialized in ASCII Media Works' Dengeki Daioh magazine. Featured Crew Tatsuyuki Nagai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruka Tomatsu Ichika Takatsuki Full Cast & Crew Last Season Season 1 2012 | 12 Episodes Season 1 of Waiting in the Summer premiered on January 10, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Waiting in the Summer. You can help by rating TV shows you've seen. Facts Original Name  あの夏で待ってる Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.ichika-ichika.com/ Genres Animation Comedy Drama Keywords fantasy romance anime Content Score 71 Just a little bit more... Top Contributors 12 Levi Seguel 9 Sadwick 9 Jenazad p 8 psy4trik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}