{"link": "https://www.themoviedb.org/tv/50675?language=en", "title": "Us & Them", "resume": "Us & Them is an American television series, based on the British series \"Gavin & Stacey\" created by James Corden and Ruth, that was supposed to premiere on Fox in the 2013-2014 season. In summer 2014, Vulture revealed that Fox would not air the show. The series was broadcast in South Africa.", "rate": 45, "genre": ["Comedy"], "cast": ["Jason Ritter", "Alexis Bledel", "Kerri Kenney-Silver", "Ashlie Atkinson", "Dustin Ybarra"], "character": ["Gavin", "Stacey", "Gwen", "Nessa", "Smithy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50675   Expand Us & Them   (2014) User Score Overview Us & Them is an American television series, based on the British series \"Gavin & Stacey\" created by James Corden and Ruth, that was supposed to premiere on Fox in the 2013-2014 season. In summer 2014, Vulture revealed that Fox would not air the show. The series was broadcast in South Africa. Featured Crew James Corden Creator Ruth Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Ritter Gavin Alexis Bledel Stacey Kerri Kenney-Silver Gwen Ashlie Atkinson Nessa Dustin Ybarra Smithy Full Cast & Crew Last Season Season 1 2014 | 7 Episodes Season 1 of Us & Them premiered on January  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Us & Them. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords dating family in-laws online dating Content Score 93 Almost there... Top Contributors 8 Banana 5 United600 4 Elizabeth Jennings w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}