{"link": "https://www.themoviedb.org/tv/34733?language=en", "title": "Doki Doki School Hours", "resume": "Doki Doki School Hours is a four panel manga series and anime series by Tamami Momose.\nSensei no Ojikan was serialised in Bamboo Comics from 1997, published by Takeshobō. A 13 episode anime TV series adaptation was created by J.C.Staff. It was aired on TV Tokyo from April 4, 2004 to June 27, 2004, A 7 episode OVA, Sensei no Ojikan Gold, was also produced by J.C.Staff. These episodes were released onto the DVDs of the TV series, one episode for each DVD. Both the TV series and OVA were dubbed into English by The Ocean Group using their Blue Water Studios and have been licensed for release in North America by Geneon Entertainment. However, the OVA was folded onto the TV series and released together as simply Doki Doki School Hours. Thus, for the release in that region, the 14th episode is actually the first episode of the OVA and so on.\nThe series is centered on 27-year-old homeroom teacher Mika Suzuki and the eccentric and colorful students of her class. The anime, coming two years after J.C.Staff had success with Azumanga Daioh, inherits a lot stylistically from that series, however the original manga predates Azumanga Daioh by two years. Additionally, before the recent anime incarnation, the manga spawned a series of drama CDs.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Kana Ueda", "Kappei Yamaguchi", "Omi Minami", "Kishou Taniyama", "Kousuke Okano"], "character": ["Minako Tominaga", "Kenta Suetake", "Mika Suzuki", "Jouji Seki", "Takumi Watabe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34733   Expand Doki Doki School Hours   (2004) User Score Overview Doki Doki School Hours is a four panel manga series and anime series by Tamami Momose. Sensei no Ojikan was serialised in Bamboo Comics from 1997, published by Takeshobō. A 13 episode anime TV series adaptation was created by J.C.Staff. It was aired on TV Tokyo from April 4, 2004 to June 27, 2004, A 7 episode OVA, Sensei no Ojikan Gold, was also produced by J.C.Staff. These episodes were released onto the DVDs of the TV series, one episode for each DVD. Both the TV series and OVA were dubbed into English by The Ocean Group using their Blue Water Studios and have been licensed for release in North America by Geneon Entertainment. However, the OVA was folded onto the TV series and released together as simply Doki Doki School Hours. Thus, for the release in that region, the 14th episode is actually the first episode of the OVA and so on. The series is centered on 27-year-old homeroom teacher Mika Suzuki and the eccentric and colorful students of her class. The anime, coming two years after J.C.Staff had success with Azumanga Daioh, inherits a lot stylistically from that series, however the original manga predates Azumanga Daioh by two years. Additionally, before the recent anime incarnation, the manga spawned a series of drama CDs. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Ueda Minako Tominaga Kappei Yamaguchi Kenta Suetake Omi Minami Mika Suzuki Kishou Taniyama Jouji Seki Kousuke Okano Takumi Watabe Full Cast & Crew Last Season Season 1 2004 | 20 Episodes Season 1 of Doki Doki School Hours premiered on April  4, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Doki Doki School Hours. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 4 Rebecca e 2 elibiva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}