{"link": "https://www.themoviedb.org/tv/34090?language=en", "title": "Red Baron", "resume": "In the year 2050 the world population is crazy about the \"Metal Fight\", a competition where people compete in battles featuring giant robots. An organization called Iron Mask is planning on transforming Metal Fight competitors and their robots into weapons, and tries to kidnap Shoko Saeba, a robot programmer who created the Red Baron, which uses a feedback system. Ken Kurenai is able to protect Sally and the Red Baron, and becomes Metal Fight World Champion in the process. Iron Mask then decides to send out their forces to take Ken and the Red Baron out forever.", "rate": 0, "genre": ["Animation"], "cast": ["Yoshiko Kamei", "Kappei Yamaguchi", "Rie Iwatsubo", "Naoki Tatsuta", "Ikuya Sawaki"], "character": ["Robby", "Ken Kurenai", "Shôko Saeba", "Isao Kumano", "Kaizer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34090   Expand Red Baron   (1994) User Score Overview In the year 2050 the world population is crazy about the \"Metal Fight\", a competition where people compete in battles featuring giant robots. An organization called Iron Mask is planning on transforming Metal Fight competitors and their robots into weapons, and tries to kidnap Shoko Saeba, a robot programmer who created the Red Baron, which uses a feedback system. Ken Kurenai is able to protect Sally and the Red Baron, and becomes Metal Fight World Champion in the process. Iron Mask then decides to send out their forces to take Ken and the Red Baron out forever. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshiko Kamei Robby Kappei Yamaguchi Ken Kurenai Rie Iwatsubo Shôko Saeba Naoki Tatsuta Isao Kumano Ikuya Sawaki Kaizer Full Cast & Crew Last Season Season 1 1994 | 47 Episodes Season 1 of Red Baron premiered on April  5, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Red Baron. You can help by rating TV shows you've seen. Facts Original Name  レッドバロン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 9 Elizabeth Jennings 3 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}