{"link": "https://www.themoviedb.org/tv/41053?language=en", "title": "Familie Heinz Becker", "resume": "Familie Heinz Becker is a German television series that aired from 1992 through 2004. The show revolves around the lives of Heinz Becker and his family, as well as those of neighbors and onlookers, although the focus of the series changed over the course of the series. In the first season, much of the humor was derived from Heinz's petty behavior; the character of his wife, Hilde, was not played for laughs. During seasons 2-4, Hilde's character became more naive but was devoted; much of the humor came from family dialogues. After Season 4, the focus shifted more to public life. Seasons 6 and 7 are not as well esteemed by critics as they repeat a number of older jokes and much of the comedy came from awkward situations, misspeaking, and other more mainstream comedic elements.", "rate": 100, "genre": ["Comedy"], "cast": ["Gerd Dudenhöffer", "Andreas Gergen", "Sabine Urig"], "character": ["Heinz Becker", "Stefan Becker", "Hilde Becker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41053   Expand Familie Heinz Becker   (1992) User Score Overview Familie Heinz Becker is a German television series that aired from 1992 through 2004. The show revolves around the lives of Heinz Becker and his family, as well as those of neighbors and onlookers, although the focus of the series changed over the course of the series. In the first season, much of the humor was derived from Heinz's petty behavior; the character of his wife, Hilde, was not played for laughs. During seasons 2-4, Hilde's character became more naive but was devoted; much of the humor came from family dialogues. After Season 4, the focus shifted more to public life. Seasons 6 and 7 are not as well esteemed by critics as they repeat a number of older jokes and much of the comedy came from awkward situations, misspeaking, and other more mainstream comedic elements. Featured Crew Gerd Dudenhöffer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gerd Dudenhöffer Heinz Becker Andreas Gergen Stefan Becker Sabine Urig Hilde Becker Full Cast & Crew Last Season Season 7 2004 | 6 Episodes Season 7 of Familie Heinz Becker premiered on February  6, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Familie Heinz Becker. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors S 35 Samara s 30 schlambambomil s 3 stesme TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}