{"link": "https://www.themoviedb.org/tv/69889?language=en", "title": "Imposters", "resume": "Maddie, a persona shifting con-artist who is as beautiful as she is dangerous, leaves her unwitting victims tormented when they realize they have been used and robbed of everything – including their hearts. But things get complicated when her former targets, Ezra, Richard, and Jules team up to track her down. While pursuing her newest mark, Maddie meets a potential love interest, Patrick, which threatens to derail her assignment, much to the chagrin of her mysterious boss, The Doctor.", "rate": 76, "genre": ["Drama", "Comedy", "Mystery"], "cast": ["Inbar Lavi", "Rob Heaps", "Parker Young", "Marianne Rendón", "Stephen Bishop"], "character": ["Maddie Johnson", "Ezra Bloom", "Richard Evans", "Jules Langmore", "Patrick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69889   Expand Imposters   (2017) User Score  Play Trailer Overview Maddie, a persona shifting con-artist who is as beautiful as she is dangerous, leaves her unwitting victims tormented when they realize they have been used and robbed of everything – including their hearts. But things get complicated when her former targets, Ezra, Richard, and Jules team up to track her down. While pursuing her newest mark, Maddie meets a potential love interest, Patrick, which threatens to derail her assignment, much to the chagrin of her mysterious boss, The Doctor. Featured Crew Adam Brooks Creator Paul Adelstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Inbar Lavi Maddie Johnson Rob Heaps Ezra Bloom Parker Young Richard Evans Marianne Rendón Jules Langmore Stephen Bishop Patrick Full Cast & Crew Current Season Season 2 2018 | 10 Episodes View All Seasons Social Reviews  1 Discussions  7 A review by TrentTX  10.0 Written by  TrentTX  on April 12, 2017 This show is a hidden gem.  Many people overlooked it because they had a negative opinion about Bravo, but they really missed out.  Maybe it will have the popularity it deserves when it reaches one of the streaming services.  Imposters is surprising, funny, moving, insightful, and most of all entertaining.  The writing and acting are top-notch.  I will be watching for future projects from this creative team because they know how to make great television.  Finding the con artist that screwed you seemed like a simple premise, but it became so much more as the victims evolved and the con artist fa...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2016-10-19 HIM 6.2    2018-03-18 Instinct 5.9    2014-09-30 Happyland 3.3    2012-06-11 Bunheads 6.4    2016-11-15 Sweet/Vicious 7.0    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1    2016-11-15 Good Behavior 6.9    2017-01-25 Mary Kills People 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  41m, 60m Homepage   http://www.bravotv.com/imposters Genres Drama Comedy Mystery Keywords dark comedy con artist Content Score 100 Yes! Looking good! Top Contributors 42 Elizabeth Jennings m 17 misfit_noel s 7 speedycars z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}