{"link": "https://www.themoviedb.org/tv/61103?language=en", "title": "Ngao Asoke", "resume": "Piachat [her name wasn't Piachat at first. i can't remember at the top of my head what it is right now] was returning home from school one day and she had some exciting news to tell her mother. she had high honors in her class. as she made her way home a storm also arrived. so she raced home and she was in time to see a tree fall onto her house and it was set on fire so her mother was gone in the fire. now she had gone to live with her grandmother.\nVichada was on her way to Monthai's house because their parents are old friends. Monthai's mother is a very protective, stubborn, and wants everything done her way. she loves her husband a lot so she allows him to have mistress but she knows about them. though she does not want Monthai to end up a ladies man like his father so she decided to ask for Vichada's hand in marriage. Vichada who was eaves dropping on the whole conversation was happy and satisfied.\nMonthai had this friendly and loving nature in him. a distance relative of his also fell in love with him. her name was Lakana. he was friendly to her but she avoided him. and he wondered why. the truth was that his mother had called her lots of names connected to him. calling her a leech just wanting to mooch off of her family's fortune, ect. Piachat also lived nearby. her grandmother wasn't wealthy. they sold vegetables and other things to survive. she was very found of a tree called Asoke. she spotted one in Monthai's yard and went over to pick some. at the moment that she arrived Vichada and Monthai were sharing a sweet moment as both were informed about their engagement. Monthai really didn't express much feeling towards her. but Piachat made a noise and they looked to see who it was and she tried to run but Monthai caught up to her. Vichada was furious and wanted to slap her but was stopped. Monthai found out what she wanted and allowed her to pick the leaves of the Asoke tree. she came more than once and she took a liking in Monthai's generosity.\nPiachat's grandmother had a heart attack when she was almost hit by the Hiranyawat's van. Piachat was left as an orphan. the Hiranyawat's decided to adopt her but not as a daughter but as a worker in their house. but she was given an education. to the people that looked into the family they would think that the Hiranyawat's were people with generosity, but the truth was that the father was a player. he was getting sick of his wife and she couldn't do anything about it. so she came up with the idea to raise Piachat and then when she was grown he can take her as his wife. she wanted this so that her husband can fulfill his hormones at home instead of elsewhere. and so Piachat was raised in the Hiranyawat's home and was given the a new name which is Piachat.\none night Monthai was out walking and Lakana also walked by. he went over to her and she looked away and he wanted her to look at him. she refused and they started to struggle as he asked her questions about her being afraid of him and she couldn't hold it in any longer and she hugged Monthai, just as his mother came and she started to beat on Lakana and say cruel things to her. Monthai stopped his mother as Lakana raced to her room. hours later after being so ashamed of Monthai's mother words Lakana killed herself. she slit her throat. Monthai was mad and ashamed that this was caused by his mother and he too blamed her. and so he decided that he would go to Australia to finish his studies.\nVichada was upset that he was going but he said he would only be gone four years. she wanted something for him to remember her by so she gave him a picture of her. earlier her sister [Paa] said that her writing was like chicken scratch compared to Piachat. so she had Piachat write the message [for Monthai only, love Vichada] on the back of the picture. Monthai was having a party for his leaving and he also invited Piachat and bought her a dress cause she had nothing to wear.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Egkarat Sarasook", "Isariya Saisanan", "Jamie Bouher", "Yardthip Rajpal", "Patravadi Mejudhon"], "character": ["Monthai/Mone", "Ae", "Vichuda", "Young Bpeeachat", "Monthai's mother"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61103   Expand Ngao Asoke   (1999) User Score  Play Trailer Overview Piachat [her name wasn't Piachat at first. i can't remember at the top of my head what it is right now] was returning home from school one day and she had some exciting news to tell her mother. she had high honors in her class. as she made her way home a storm also arrived. so she raced home and she was in time to see a tree fall onto her house and it was set on fire so her mother was gone in the fire. now she had gone to live with her grandmother. Vichada was on her way to Monthai's house because their parents are old friends. Monthai's mother is a very protective, stubborn, and wants everything done her way. she loves her husband a lot so she allows him to have mistress but she knows about them. though she does not want Monthai to end up a ladies man like his father so she decided to ask for Vichada's hand in marriage. Vichada who was eaves dropping on the whole conversation was happy and satisfied. Monthai had this friendly and loving nature in him. a distance relative of his also fell in love with him. her name was Lakana. he was friendly to her but she avoided him. and he wondered why. the truth was that his mother had called her lots of names connected to him. calling her a leech just wanting to mooch off of her family's fortune, ect. Piachat also lived nearby. her grandmother wasn't wealthy. they sold vegetables and other things to survive. she was very found of a tree called Asoke. she spotted one in Monthai's yard and went over to pick some. at the moment that she arrived Vichada and Monthai were sharing a sweet moment as both were informed about their engagement. Monthai really didn't express much feeling towards her. but Piachat made a noise and they looked to see who it was and she tried to run but Monthai caught up to her. Vichada was furious and wanted to slap her but was stopped. Monthai found out what she wanted and allowed her to pick the leaves of the Asoke tree. she came more than once and she took a liking in Monthai's generosity. Piachat's grandmother had a heart attack when she was almost hit by the Hiranyawat's van. Piachat was left as an orphan. the Hiranyawat's decided to adopt her but not as a daughter but as a worker in their house. but she was given an education. to the people that looked into the family they would think that the Hiranyawat's were people with generosity, but the truth was that the father was a player. he was getting sick of his wife and she couldn't do anything about it. so she came up with the idea to raise Piachat and then when she was grown he can take her as his wife. she wanted this so that her husband can fulfill his hormones at home instead of elsewhere. and so Piachat was raised in the Hiranyawat's home and was given the a new name which is Piachat. one night Monthai was out walking and Lakana also walked by. he went over to her and she looked away and he wanted her to look at him. she refused and they started to struggle as he asked her questions about her being afraid of him and she couldn't hold it in any longer and she hugged Monthai, just as his mother came and she started to beat on Lakana and say cruel things to her. Monthai stopped his mother as Lakana raced to her room. hours later after being so ashamed of Monthai's mother words Lakana killed herself. she slit her throat. Monthai was mad and ashamed that this was caused by his mother and he too blamed her. and so he decided that he would go to Australia to finish his studies. Vichada was upset that he was going but he said he would only be gone four years. she wanted something for him to remember her by so she gave him a picture of her. earlier her sister [Paa] said that her writing was like chicken scratch compared to Piachat. so she had Piachat write the message [for Monthai only, love Vichada] on the back of the picture. Monthai was having a party for his leaving and he also invited Piachat and bought her a dress cause she had nothing to wear. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Egkarat Sarasook Monthai/Mone Isariya Saisanan Ae Jamie Bouher Vichuda Yardthip Rajpal Young Bpeeachat Patravadi Mejudhon Monthai's mother Full Cast & Crew Last Season Season 1 1999 | 13 Episodes Season 1 of Ngao Asoke premiered on January  5, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ngao Asoke. You can help by rating TV shows you've seen. Facts Original Name  เงาอโศก Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 27 Crip TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}