{"link": "https://www.themoviedb.org/tv/11490?language=en", "title": "The Invisible Man", "resume": "The Invisible Man, the second television series with this title, debuted in the USA in 1975 on NBC and starred David McCallum as the scientist Daniel Westin and Melinda Fee as his wife, Dr. Kate Westin. The series was created by the producer Harve Bennett. A pilot TV movie initially aired in May 1975 and was followed by a 12-episode series that fall.", "rate": 60, "genre": ["Drama", "Action", "Adventure"], "cast": ["David McCallum", "Melinda O. Fee", "Gerald James", "David Gwillim", "Merelina Kendall"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11490   Expand The Invisible Man   (1975) User Score Overview The Invisible Man, the second television series with this title, debuted in the USA in 1975 on NBC and starred David McCallum as the scientist Daniel Westin and Melinda Fee as his wife, Dr. Kate Westin. The series was created by the producer Harve Bennett. A pilot TV movie initially aired in May 1975 and was followed by a 12-episode series that fall. Featured Crew Harve Bennett Creator Steven Bochco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David McCallum Melinda O. Fee Gerald James David Gwillim Merelina Kendall Full Cast & Crew Last Season Season 1 1975 | 14 Episodes Season 1 of The Invisible Man premiered on May  6, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1960-11-14 Popeye the Sailor 5.8    1968-09-14 Wacky Races 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Action & Adventure Keywords scientist invisibility Content Score 93 Almost there... Top Contributors 12 Banana a 6 aalvaroo t 3 tinu88 d 2 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}