{"link": "https://www.themoviedb.org/tv/78704?language=en", "title": "Bobby Kennedy for President", "resume": "Historic footage and leading voices of the era examine the \"Bobby Phenomenon\" of the 1960s and the legacy of the man who helped redefine the country.", "rate": 65, "genre": ["Documentary"], "cast": ["Robert F. Kennedy"], "character": ["Himself (archive footage)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78704   Expand Bobby Kennedy for President   (2018) User Score Overview Historic footage and leading voices of the era examine the \"Bobby Phenomenon\" of the 1960s and the legacy of the man who helped redefine the country. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert F. Kennedy Himself (archive footage) Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of Bobby Kennedy for President premiered on April 27, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply What would have happend if he wasn't killed? Open 0 by Renovatio\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bobby Kennedy for President. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  - Homepage   https://www.netflix.com/title/80174282 Genres Documentary Keywords kennedy family 1960s Content Score 56 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings 2 Kecla R 2 Rebecca t 2 tfj1977  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}