{"link": "https://www.themoviedb.org/tv/7728?language=en", "title": "Heroes and Villains", "resume": "Heroes and Villains was a 2007-2008 BBC Television docudrama series looking at key moments in the lives and reputations of some of the greatest warriors of history. Each hour long episode featured a different historical figure, including Napoleon I of France, Attila the Hun, Spartacus, Hernán Cortés, Richard I of England, and Tokugawa Ieyasu. The statements at the beginning of each episode read: \"This film depicts real events and real characters. It is based on the accounts of writers of the time. It has been written with the advice of modern historians.\" In the United States the show is aired on The Military Channel and was called \"Warriors\".", "rate": 70, "genre": ["Documentary", "Drama"], "cast": ["Anthony Flanagan", "James Saito", "Brian McCardie", "Steven Waddington", "Rory McCann"], "character": ["Attila the Hun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7728   Expand Heroes and Villains   (2007) User Score Overview Heroes and Villains was a 2007-2008 BBC Television docudrama series looking at key moments in the lives and reputations of some of the greatest warriors of history. Each hour long episode featured a different historical figure, including Napoleon I of France, Attila the Hun, Spartacus, Hernán Cortés, Richard I of England, and Tokugawa Ieyasu. The statements at the beginning of each episode read: \"This film depicts real events and real characters. It is based on the accounts of writers of the time. It has been written with the advice of modern historians.\" In the United States the show is aired on The Military Channel and was called \"Warriors\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anthony Flanagan James Saito Brian McCardie Steven Waddington Rory McCann Attila the Hun Full Cast & Crew Last Season Heroes & villains season 1 2008 | 7 Episodes Season 1 of Heroes and Villains premiered on February 29, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Heroes and Villains. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Documentary Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 Farkas Tibor w 1 webmaster 1 Michael 1 Mitsarinho2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}