{"link": "https://www.themoviedb.org/tv/39102?language=en", "title": "Penn & Teller Tell a Lie", "resume": "Penn & Teller Tell a Lie is a six-part series starring Penn Jillette and Teller. Each episode contains six or seven stories, including a demonstration performed by the hosts during the recording of the show as the last story. One of the stories is falsified, and the rest are true. During each broadcast, viewers can guess which story is the lie, voting on Discovery's website, with the answer and voting results revealed at the end of the episode.", "rate": 53, "genre": [], "cast": ["Teller", "Penn Jillette"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39102   Expand Penn & Teller Tell a Lie   (2011) User Score Overview Penn & Teller Tell a Lie is a six-part series starring Penn Jillette and Teller. Each episode contains six or seven stories, including a demonstration performed by the hosts during the recording of the show as the last story. One of the stories is falsified, and the rest are true. During each broadcast, viewers can guess which story is the lie, voting on Discovery's website, with the answer and voting results revealed at the end of the episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Teller Penn Jillette Full Cast & Crew Last Season Season 1 2011 | 6 Episodes Season 1 of Penn & Teller Tell a Lie premiered on October  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   2003-01-24 Penn & Teller: Bullshit! 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 6 Patrik Selin s 5 svaraej 5 Goffred0 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}