{"link": "https://www.themoviedb.org/tv/22817?language=en", "title": "The Shiralee", "resume": "Macauley is a swagman on the road in the 1940s looking for work. He's a laid back, laconic sort of bloke but when he gets landed with his daughter after his drunken play-girl wife in Adelaide makes him face up to what she believes are his responsibilities, neither he nor his daughter are ready for each other. But in the beginning he's all she's got, and at the end, she's all he's got.", "rate": 72, "genre": ["Drama"], "cast": ["Bryan Brown", "Rebecca Smart", "Noni Hazlehurst", "Ray Meagher"], "character": ["Macauley", "Buster", "Lily", "Polkadot"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 22817   Expand The Shiralee   (1988) User Score Overview Macauley is a swagman on the road in the 1940s looking for work. He's a laid back, laconic sort of bloke but when he gets landed with his daughter after his drunken play-girl wife in Adelaide makes him face up to what she believes are his responsibilities, neither he nor his daughter are ready for each other. But in the beginning he's all she's got, and at the end, she's all he's got. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bryan Brown Macauley Rebecca Smart Buster Noni Hazlehurst Lily Ray Meagher Polkadot Full Cast & Crew Last Season Miniseries 1988 | 2 Episodes Season 1 of The Shiralee premiered on June 26, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Shiralee. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Drama Keywords australia based on novel or book australian miniseries shiralee 1940s father daughter relationship Content Score 86 Almost there... Top Contributors 15 Banana TB 9 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}