{"link": "https://www.themoviedb.org/tv/1481?language=en", "title": "The 4400", "resume": "4400 centers on the return of 4400 people who, previously presumed dead or reported missing, reappear on Earth. Though they have not aged physically, some of them seem to have deeper alterations ranging from superhuman strength to an unexplained healing touch. A government agency is formed to track the 4400 people after one of them commits a murder.", "rate": 70, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Joel Gretsch", "Jacqueline McKenzie", "Patrick John Flueger", "Chad Faust", "Samantha Ferris"], "character": ["Tom Baldwin", "Diana Skouris", "Shawn Farrell", "Kyle Baldwin", "Nina Jarvis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1481   Expand The 4400   (2004) User Score  Play Trailer Overview 4400 centers on the return of 4400 people who, previously presumed dead or reported missing, reappear on Earth. Though they have not aged physically, some of them seem to have deeper alterations ranging from superhuman strength to an unexplained healing touch. A government agency is formed to track the 4400 people after one of them commits a murder. Featured Crew René Echevarria Creator Scott Peters Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  9 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joel Gretsch Tom Baldwin Jacqueline McKenzie Diana Skouris Patrick John Flueger Shawn Farrell Chad Faust Kyle Baldwin Samantha Ferris Nina Jarvis Full Cast & Crew Last Season Season 4 2007 | 13 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Criminally Underrated Series Open 0 by Irina\n      \n     This is good! Open 5 by  Irina Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  5 Recommendations   2009-11-03 V 6.2    1999-10-06 Roswell 7.0    2011-07-11 Alphas 6.5    2009-07-07 Warehouse 13 7.2    2006-09-25 Heroes 6.9    2006-09-20 Jericho 7.5    2013-10-09 The Tomorrow People 6.6    2012-05-27 Continuum 7.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.usanetwork.com/series/the4400/ Genres Drama Sci-Fi & Fantasy Keywords superhuman missing person strange event Content Score 100 Yes! Looking good! Top Contributors 187 Marr 🇳🇱 9 Banana S 8 Shady12 w 7 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}