{"link": "https://www.themoviedb.org/tv/48162?language=en", "title": "İşler Güçler", "resume": "İşler Güçler, is a Turkish comedy series which first aired on 28 June 2012 on Star TV and tells the story of 3 actors, with the motto, Modern Muzip Yalanlar. Ahmet Kural, Murat Cemcir and Sadi Celil Cengiz shares the leading roles. Although rumour had it that it was going to be over at the end of the summer, the board of Star TV made an explanation that they would go on issuing it in the 2012−13 publication season, due to the interest their fans had shown", "rate": 72, "genre": ["Comedy"], "cast": ["Ahmet Kural", "Murat Cemcir", "Sadi Celil Cengiz", "Melike Emiroğlu", "Burak Satıbol"], "character": ["Himself", "Himself", "Himself", "Aşkın", "Salih"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48162   Expand İşler Güçler User Score Overview İşler Güçler, is a Turkish comedy series which first aired on 28 June 2012 on Star TV and tells the story of 3 actors, with the motto, Modern Muzip Yalanlar. Ahmet Kural, Murat Cemcir and Sadi Celil Cengiz shares the leading roles. Although rumour had it that it was going to be over at the end of the summer, the board of Star TV made an explanation that they would go on issuing it in the 2012−13 publication season, due to the interest their fans had shown Featured Crew Selçuk Aydemir Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ahmet Kural Himself Murat Cemcir Himself Sadi Celil Cengiz Himself Melike Emiroğlu Aşkın Burak Satıbol Salih Full Cast & Crew Last Season Season 1 — | 41 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  86m Homepage   http://www.tvyo.com/dizi/isler-gucler Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 14 mfteam 10 3sogi 4 Hüseyin ÖZKILIÇ TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}