{"link": "https://www.themoviedb.org/tv/39674?language=en", "title": "Sirens", "resume": "Sirens is a British comedy-drama about an ambulance service team broadcast on Channel 4. It was first screened on 27 June 2011.\nThe series is based on the book Blood, Sweat & Tea by Brian Kellett. The series is filmed predominantly in Leeds with some filmed in the surrounding areas. Locations featured including Headingley, Kirkstall, Adel, Hyde Park, Cookridge, Chapel Allerton and the main city centre including shopping areas of Briggate and Headrow.\nOn 17 October 2011, Rhys Thomas and Channel 4 confirmed that there would not be a second series.", "rate": 88, "genre": ["Drama", "Comedy"], "cast": ["Rhys Thomas", "Richard Madden", "Kayvan Novak", "Amy Beth Hayes"], "character": ["Stuart Bayldon", "Ashley Greenwick", "Rachid Mansaur", "Maxine Fox"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39674   Expand Sirens   (2011) User Score Overview Sirens is a British comedy-drama about an ambulance service team broadcast on Channel 4. It was first screened on 27 June 2011. The series is based on the book Blood, Sweat & Tea by Brian Kellett. The series is filmed predominantly in Leeds with some filmed in the surrounding areas. Locations featured including Headingley, Kirkstall, Adel, Hyde Park, Cookridge, Chapel Allerton and the main city centre including shopping areas of Briggate and Headrow. On 17 October 2011, Rhys Thomas and Channel 4 confirmed that there would not be a second series. Featured Crew Brian Fillis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rhys Thomas Stuart Bayldon Richard Madden Ashley Greenwick Kayvan Novak Rachid Mansaur Amy Beth Hayes Maxine Fox Full Cast & Crew Last Season Series 1 2011 | 6 Episodes Season 1 of Sirens premiered on June 27, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Sirens. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  48m Homepage   http://www.channel4.com/programmes/sirens Genres Drama Comedy Keywords northern england ambulance yorkshire paramedic british humour workplace comedy Content Score 93 Almost there... Top Contributors 14 Banana 7 United600 e 3 error666 O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}