{"link": "https://www.themoviedb.org/tv/1581?language=en", "title": "ECW on TNN", "resume": "ECW on TNN was an American professional wrestling television program that aired on The Nashville Network. Created by Paul Heyman, the owner of Extreme Championship Wrestling, it presented original ECW matches on Friday nights and was the only national television program in ECW's history. It debuted on August 27, 1999- five years to the date that Shane Douglas threw down the NWA World Heavyweight Championship and rechristened ECW as Extreme Championship Wrestling. The final episode aired on October 6, 2000.", "rate": 100, "genre": [], "cast": ["John Watson", "Lance Evers", "Justin Credible", "Vito LoGrasso", "Vic Grimes"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1581   Expand ECW on TNN   (1999) User Score Overview ECW on TNN was an American professional wrestling television program that aired on The Nashville Network. Created by Paul Heyman, the owner of Extreme Championship Wrestling, it presented original ECW matches on Friday nights and was the only national television program in ECW's history. It debuted on August 27, 1999- five years to the date that Shane Douglas threw down the NWA World Heavyweight Championship and rechristened ECW as Extreme Championship Wrestling. The final episode aired on October 6, 2000. Featured Crew Paul Heyman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Watson Lance Evers Justin Credible Vito LoGrasso Vic Grimes Full Cast & Crew Last Season Season 2 2000 | 7 Episodes Season 2 of ECW on TNN premiered on August 25, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on ECW on TNN. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 t0by B 3 BCEMovieDB R 3 Rebecca S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}