{"link": "https://www.themoviedb.org/tv/60858?language=en", "title": "Heroes Reborn", "resume": "The supernatural phenomenon begins again with a fresh crop of inspiring heroes who take on the ultimate struggle between those with extraordinary abilities and those with nefarious motives to hunt and harness their powers. Epic adventures await these newly empowered allies as they cross paths with some of the original characters, unlocking the mysterious fate of the universe and their place within it.", "rate": 58, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Jack Coleman", "Zachary Levi", "Kiki Sukezane", "Judi Shekoni", "Robbie Kay"], "character": ["Noah Bennet", "Luke Collins", "Miko Otomo", "Joanne Collins", "Tommy Clarke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60858   Expand Heroes Reborn   (2015) User Score  Play Trailer Overview The supernatural phenomenon begins again with a fresh crop of inspiring heroes who take on the ultimate struggle between those with extraordinary abilities and those with nefarious motives to hunt and harness their powers. Epic adventures await these newly empowered allies as they cross paths with some of the original characters, unlocking the mysterious fate of the universe and their place within it. Featured Crew Tim Kring Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  17 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Coleman Noah Bennet Zachary Levi Luke Collins Kiki Sukezane Miko Otomo Judi Shekoni Joanne Collins Robbie Kay Tommy Clarke Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Heroes Reborn premiered on September 24, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Heroes Reborn. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  17 Posters  6 Recommendations   2006-09-25 Heroes 6.9    2015-09-22 Limitless 6.8    2014-01-07 Intelligence 6.3    2013-10-09 The Tomorrow People 6.6    2011-07-11 Alphas 6.5    2016-07-13 Minority Report 5.3    2015-06-01 The Whispers 5.7    2008-09-09 Fringe 8.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.nbc.com/heroes Genres Sci-Fi & Fantasy Keywords hero superhuman super power Content Score 100 Yes! Looking good! Top Contributors 59 Elizabeth Jennings 38 Banana 10 benf45 8 Martin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}