{"link": "https://www.themoviedb.org/tv/62952?language=en", "title": "Hidden Identity", "resume": "The heat is on in Investigation 5, an undercover police unit specializing in thwarting violent crimes. Led by Superintendent Jang Moon Won, this team of young and elite officers, including Cha Gun Woo, Jang Min Joo, and Lee Won Jong, assume new identities and infiltrate dangerous crime syndicates. With only their wits and poker faces at their disposal, can the team complete their missions without blowing their covers in hostile territory?", "rate": 75, "genre": ["Action", "Crime", "Thriller"], "cast": ["Kim Bum", "Park Sung-woong", "Yoon Soy", "Lee Won-Jong", "Kim Tae-hoon"], "character": ["Cha Gun-woo", "Jang Mu-won", "Yoo Min-joo", "Choi Tae-pyeong", "Min Tae-in"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62952   Expand Hidden Identity   (2015) User Score Overview The heat is on in Investigation 5, an undercover police unit specializing in thwarting violent crimes. Led by Superintendent Jang Moon Won, this team of young and elite officers, including Cha Gun Woo, Jang Min Joo, and Lee Won Jong, assume new identities and infiltrate dangerous crime syndicates. With only their wits and poker faces at their disposal, can the team complete their missions without blowing their covers in hostile territory? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Bum Cha Gun-woo Park Sung-woong Jang Mu-won Yoon Soy Yoo Min-joo Lee Won-Jong Choi Tae-pyeong Kim Tae-hoon Min Tae-in Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Hidden Identity premiered on June 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Hidden Identity. You can help by rating TV shows you've seen. Facts Original Name  신분을 숨겨라 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://program.interest.me/tvn/hidden Genres Action Crime Thriller Keywords korea Content Score 93 Almost there... Top Contributors M 33 Maria180493 NS 9 Norte Serra 7 Elizabeth Jennings z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}