{"link": "https://www.themoviedb.org/tv/21782?language=en", "title": "Scruples", "resume": "Scruples is a 1980 television mini-series, based on the 1978 novel by Judith Krantz. It was produced by Warner Bros. Television and starred Lindsay Wagner.\nScruples included the final screen appearance of Gene Tierney.", "rate": 60, "genre": ["Drama"], "cast": ["Lindsay Wagner", "Barry Bostwick", "George Gaynes", "Marie-France Pisier", "Kim Cattrall"], "character": ["Billy Ikehorn", "Spider Elliott", "John Prince", "Valentine O'Neill", "Melanie Adams"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21782   Expand Scruples   (1980) User Score Overview Scruples is a 1980 television mini-series, based on the 1978 novel by Judith Krantz. It was produced by Warner Bros. Television and starred Lindsay Wagner. Scruples included the final screen appearance of Gene Tierney. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lindsay Wagner Billy Ikehorn Barry Bostwick Spider Elliott George Gaynes John Prince Marie-France Pisier Valentine O'Neill Kim Cattrall Melanie Adams Full Cast & Crew Last Season Season 1 1980 | 3 Episodes Season 1 of Scruples premiered on February 25, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Scruples. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama Keywords miniseries fashion heartache Content Score 71 Just a little bit more... Top Contributors 14 Steve TB 13 TMDb Bot R 5 Rebecca CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}