{"link": "https://www.themoviedb.org/tv/61079?language=en", "title": "Love to the Extreme", "resume": "The story centers around a spoiled rich kid (Jame) who falls in love with his tutor (Punch).\nIttirit has always felt like a failure in his father's eyes and never as good as his adopted brother, Tun. To pass school, Ittirit cheats during his exams and gets caught by Chanamon, a strict TA who is in charge of the exam. Ittirit is put into summer school to graduate from law school in time, while his father is frustrated to find a tutor for Ittirit and talks to the professor for the best student. Chanamon is offered money by Ittipol (Ittirit's father) to help her finish school and help her family from starving.\nThrough conflicting situations, Chanamon at first able to persuade Ittirit into focusing on his studies by having Maya as his study partner. But as that plan fails she is able to bribe Ittirit to focus on his studies by offering to take him to his mother, after Ittirit is scolded by his movie star best friend and crush, Maya. Chanamon starts to fall in love with Ittirit as he tries to come in between Tun and Maya, who are working on set together and secretly have a crush on each other. Can Ittirit finally be able to let go of his first crush? Will Chanamon be able to go back to her normal life? Will Tun and Maya be able to finally really start dating? and will Ittirit be able to see his mother?", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Jirayu Tangsrisuk", "Worakarn Rojjanawat", "Nichari Chokprajakchat", "Kawee Tanjararuk", "Wiwit Bawornkeeratikajorn"], "character": ["Itirit", "Chanamon", "Maya", "Than"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61079   Expand Love to the Extreme   (2013) User Score  Play Trailer Overview The story centers around a spoiled rich kid (Jame) who falls in love with his tutor (Punch). Ittirit has always felt like a failure in his father's eyes and never as good as his adopted brother, Tun. To pass school, Ittirit cheats during his exams and gets caught by Chanamon, a strict TA who is in charge of the exam. Ittirit is put into summer school to graduate from law school in time, while his father is frustrated to find a tutor for Ittirit and talks to the professor for the best student. Chanamon is offered money by Ittipol (Ittirit's father) to help her finish school and help her family from starving. Through conflicting situations, Chanamon at first able to persuade Ittirit into focusing on his studies by having Maya as his study partner. But as that plan fails she is able to bribe Ittirit to focus on his studies by offering to take him to his mother, after Ittirit is scolded by his movie star best friend and crush, Maya. Chanamon starts to fall in love with Ittirit as he tries to come in between Tun and Maya, who are working on set together and secretly have a crush on each other. Can Ittirit finally be able to let go of his first crush? Will Chanamon be able to go back to her normal life? Will Tun and Maya be able to finally really start dating? and will Ittirit be able to see his mother? Featured Crew Piyawadee Maleenont Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jirayu Tangsrisuk Itirit Worakarn Rojjanawat Chanamon Nichari Chokprajakchat Maya Kawee Tanjararuk Than Wiwit Bawornkeeratikajorn Full Cast & Crew Last Season Season 1 2013 | 16 Episodes Season 1 of Love to the Extreme premiered on November 30, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Love to the Extreme. You can help by rating TV shows you've seen. Facts Original Name  รักสุดฤทธิ์ Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  107m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 46 Crip 2 Elizabeth Jennings 2 Alex2017 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}