{"link": "https://www.themoviedb.org/tv/5105?language=en", "title": "A Fine Romance", "resume": "A Fine Romance is a British situation comedy starring husband-and-wife team Judi Dench and Michael Williams. Dench's sister was played by Susan Penhaligon. It was produced by London Weekend Television and written by Bob Larbey. It was first broadcast on 8 November 1981. It lasted for 26 episodes over four series; the final episode being broadcast on 17 February 1984. The series takes its name from a song in the 1936 film Swing Time, starring Fred Astaire and Ginger Rogers, which Dench recorded as the theme music.\nThe series was nominated for nine BAFTA British Academy Television Awards and a winner of two, both for Dench's performance in 1982 and 1985.", "rate": 80, "genre": ["Comedy"], "cast": ["Michael Williams", "Judi Dench", "Susan Penhaligon"], "character": ["Laura Dalton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5105   Expand A Fine Romance   (1981) User Score Overview A Fine Romance is a British situation comedy starring husband-and-wife team Judi Dench and Michael Williams. Dench's sister was played by Susan Penhaligon. It was produced by London Weekend Television and written by Bob Larbey. It was first broadcast on 8 November 1981. It lasted for 26 episodes over four series; the final episode being broadcast on 17 February 1984. The series takes its name from a song in the 1936 film Swing Time, starring Fred Astaire and Ginger Rogers, which Dench recorded as the theme music. The series was nominated for nine BAFTA British Academy Television Awards and a winner of two, both for Dench's performance in 1982 and 1985. Featured Crew Esmonde and Larbey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Williams Judi Dench Laura Dalton Susan Penhaligon Full Cast & Crew Last Season (1981) season 4 1984 | 7 Episodes Season 4 of A Fine Romance premiered on January  6, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Fine Romance. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sitcom british humour Content Score 64 We're so close, yet so far. Top Contributors O 2 Ozbourne B 1 BWYoda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}