{"link": "https://www.themoviedb.org/tv/13943?language=en", "title": "Beavis and Butt-head", "resume": "Beavis and Butt-head are high school students whose lifestyles revolve around TV, junk food (usually nachos), shopping malls, heavy metal music, and trying to \"score with chicks\". Each show contains short cartoons centering on the duo who live in the fictitious town of Highland, Texas. The episodes are broken up by short breaks in which Beavis and Butt-head watch and make fun of music videos.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Trez Bayer", "Bonnie Brantley", "Mike Judge"], "character": ["Coach Buzzcut"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13943   Expand Beavis and Butt-head   (1992) User Score  Play Trailer Overview Beavis and Butt-head are high school students whose lifestyles revolve around TV, junk food (usually nachos), shopping malls, heavy metal music, and trying to \"score with chicks\". Each show contains short cartoons centering on the duo who live in the fictitious town of Highland, Texas. The episodes are broken up by short breaks in which Beavis and Butt-head watch and make fun of music videos. Featured Crew Mike Judge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  11 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Trez Bayer Bonnie Brantley Mike Judge Coach Buzzcut Full Cast & Crew Last Season Season 2 1993 | 25 Episodes Season 2 of Beavis and Butt-head premiered on May 16, 1993. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply M Yeah, hmm hmm!  Cro-Magnon! Open 0 by Moonglum9\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  6 Recommendations   1991-08-11 The Ren & Stimpy Show 7.2    1997-01-12 King of the Hill 7.1    1998-05-14 Celebrity Deathmatch 6.7    1983-09-10 Inspector Gadget 6.6    1990-09-10 The Fresh Prince of Bel-Air 7.3    2000-04-12 Jackass 6.0    1960-09-30 The Flintstones 7.0    1976-09-18 The Muppet Show 7.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  11m, 20m, 30m Homepage   http://www.mtv.com/shows/beavis_and_butthead/series.jhtml Genres Animation Comedy Keywords politically incorrect teenager Content Score 71 Just a little bit more... Top Contributors 18 Banana 12 Travis Bell z 10 zurman1 A 4 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}