{"link": "https://www.themoviedb.org/tv/5292?language=en", "title": "Behind the White Tower", "resume": "Behind the White Tower is a 2007 South Korean television series that aired on MBC from January 6 to March 11, 2007 on Saturdays and Sundays at 21:40 for 20 episodes.\nBased on renowned Japanese novelist Yamazaki Toyoko's representative work Shiroi Kyotō, the drama brings viewers deep into the political inner workings of the medical field by taking a satirical look at malpractice and power plays at a university hospital, and contrasting the paths and personalities of two doctors played by Kim Myung-min and Lee Sun-kyun. The medical drama was a critical and ratings hit in South Korea, gaining praise for its acting, writing, direction, and its intelligent and uncompromising story without concessions to melodrama or romance.", "rate": 0, "genre": ["Drama"], "cast": ["Kim Myung-min", "Cha In-pyo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5292   Expand Behind the White Tower   (2007) User Score Overview Behind the White Tower is a 2007 South Korean television series that aired on MBC from January 6 to March 11, 2007 on Saturdays and Sundays at 21:40 for 20 episodes. Based on renowned Japanese novelist Yamazaki Toyoko's representative work Shiroi Kyotō, the drama brings viewers deep into the political inner workings of the medical field by taking a satirical look at malpractice and power plays at a university hospital, and contrasting the paths and personalities of two doctors played by Kim Myung-min and Lee Sun-kyun. The medical drama was a critical and ratings hit in South Korea, gaining praise for its acting, writing, direction, and its intelligent and uncompromising story without concessions to melodrama or romance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Myung-min Cha In-pyo Full Cast & Crew Last Season White tower season 1 — | 20 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Behind the White Tower. You can help by rating TV shows you've seen. Facts Original Name  하얀거탑 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/whitepower/ Genres Drama Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors N 6 Nightowl.Kr LS 5 Lee Seung-Su t 4 tmdb983464 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}