{"link": "https://www.themoviedb.org/tv/32258?language=en", "title": "This is Jinsy", "resume": "This is Jinsy is a British comedy series. The pilot first aired on 1 March 2010 on BBC Three. The programme is about the bizarre residents of the fictional island of Jinsy and based on the island of Guernsey, where the two writers are from. The show was written by Chris Bran and Justin Chubb who also play the leading roles. Although the pilot episode was made for the BBC, the full series of eight episodes was picked up by Sky Atlantic. The first series began airing with a double bill on 19 September 2011 and ended on 31 October 2011. A second series was screened in January 2014.", "rate": 73, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Christopher Fairbank", "Janine Duvitski", "Geoffrey McGivern", "Alice Lowe", "Jennifer Saunders"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32258   Expand This is Jinsy   (2010) User Score Overview This is Jinsy is a British comedy series. The pilot first aired on 1 March 2010 on BBC Three. The programme is about the bizarre residents of the fictional island of Jinsy and based on the island of Guernsey, where the two writers are from. The show was written by Chris Bran and Justin Chubb who also play the leading roles. Although the pilot episode was made for the BBC, the full series of eight episodes was picked up by Sky Atlantic. The first series began airing with a double bill on 19 September 2011 and ended on 31 October 2011. A second series was screened in January 2014. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Fairbank Janine Duvitski Geoffrey McGivern Alice Lowe Jennifer Saunders Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of This is Jinsy premiered on September 19, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  3 Recommendations   1998-11-09 Big Train 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.thisisjinsy.com Genres Sci-Fi & Fantasy Comedy Keywords surreal british humour Content Score 86 Almost there... Top Contributors 4 Damien Haynes O 3 Ozbourne 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}