{"link": "https://www.themoviedb.org/tv/73401?language=en", "title": "Princ a chuďas", "resume": "A prince meets a young man to whom he bears a striking resemblance.  The two exchange places and learn to be better people in the process.", "rate": 0, "genre": [], "cast": ["Roman Skamene", "Petr Kostka", "Josef Bláha", "Ota Sklenčka", "Vladimír Šmeral"], "character": ["princ Edward VI. / chuďas Tom County", "Miles Hendon", "County, Tomův otec", "Jindřich VIII.", "lord Hertford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73401   Expand Princ a chuďas   (1971) User Score Overview A prince meets a young man to whom he bears a striking resemblance.  The two exchange places and learn to be better people in the process. Featured Crew Mark Twain Creator Ludvík Ráža Creator Ladislav Simon Creator Ondřej Vogeltanz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roman Skamene princ Edward VI. / chuďas Tom County Petr Kostka Miles Hendon Josef Bláha County, Tomův otec Ota Sklenčka Jindřich VIII. Vladimír Šmeral lord Hertford Full Cast & Crew Last Season Season 1 1971 | 2 Episodes Season 1 of Princ a chuďas premiered on January  1, 1971. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Princ a chuďas. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Princ a chuďas. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  Czech Runtime  140m Homepage   http://www.ceskatelevize.cz/porady/1002757798-princ-a-chudas Genres No genres have been added. Keywords adventure history adaptation Content Score 86 Almost there... Top Contributors FS 59 František Sedláček TB 11 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}