{"link": "https://www.themoviedb.org/tv/40161?language=en", "title": "Titanic: Blood and Steel", "resume": "Belfast, 1909. The Harland and Wolff shipyard has been handed the greatest project in its history. It will build a great, unsinkable ship. And it will be called the RMS Titanic.", "rate": 90, "genre": ["Drama"], "cast": ["Kevin Zegers", "Derek Jacobi", "Alessandra Mastronardi", "Neve Campbell", "Chris Noth"], "character": ["Mark Muir", "Lord Pirrie", "Sofia Silvestri", "Joanna Yaegar", "J.P. Morgan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40161   Expand Titanic: Blood and Steel   (2012) User Score Overview Belfast, 1909. The Harland and Wolff shipyard has been handed the greatest project in its history. It will build a great, unsinkable ship. And it will be called the RMS Titanic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Zegers Mark Muir Derek Jacobi Lord Pirrie Alessandra Mastronardi Sofia Silvestri Neve Campbell Joanna Yaegar Chris Noth J.P. Morgan Full Cast & Crew Last Season Season 1 2012 | 12 Episodes Season 1 of Titanic: Blood and Steel premiered on July 11, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Titanic: Blood and Steel. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords titanic miniseries costume drama 1910s 20th century Content Score 93 Almost there... Top Contributors 55 Banana A 4 AxelB s 3 speedycars c 3 cyborg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}