{"link": "https://www.themoviedb.org/tv/34355?language=en", "title": "The Water Margin", "resume": "The Water Margin is a Japanese television series based on Water Margin, one of the Four Great Classical Novels of Chinese literature. Made in two seasons of 13 episodes by Nippon Television it was shown in Japan in 1973 and 1974 as 水滸伝.\nThe novel details the trials and tribulations of 108 outlaws during the Song Dynasty. This adaptation follows Lin Chung and his clashes with the local government official Kao Chiu.\nIt was adapted for BBC by David Weir without translations, using only brief plot synopses. The dubbed version, narrated by Burt Kwouk, was shown on BBC television from 1976 to 1978. An English novelisation, written by Weir, was released in 1978 as Water Margin.\nThe Water Margin is famous for its, sometimes obscure, but memorable philosophical quotes, such as \"Do not despise the snake for having no horns,for who is to say it will not become a dragon?\"\"", "rate": 82, "genre": [], "cast": ["Burt Kwouk"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34355   Expand The Water Margin   (1976) User Score Overview The Water Margin is a Japanese television series based on Water Margin, one of the Four Great Classical Novels of Chinese literature. Made in two seasons of 13 episodes by Nippon Television it was shown in Japan in 1973 and 1974 as 水滸伝. The novel details the trials and tribulations of 108 outlaws during the Song Dynasty. This adaptation follows Lin Chung and his clashes with the local government official Kao Chiu. It was adapted for BBC by David Weir without translations, using only brief plot synopses. The dubbed version, narrated by Burt Kwouk, was shown on BBC television from 1976 to 1978. An English novelisation, written by Weir, was released in 1978 as Water Margin. The Water Margin is famous for its, sometimes obscure, but memorable philosophical quotes, such as \"Do not despise the snake for having no horns,for who is to say it will not become a dragon?\"\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Burt Kwouk Narrator Full Cast & Crew Last Season Season 2 1977 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Water Margin. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors z 3 zorg2000k 1 forkbeard m 1 movienator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}