{"link": "https://www.themoviedb.org/tv/4515?language=en", "title": "Lois & Clark: The New Adventures of Superman", "resume": "Lois & Clark: The New Adventures of Superman is a live-action American television series based on the characters in Superman and Action. Lois & Clark starred Dean Cain as Superman/Clark Kent and Teri Hatcher as Lois Lane, and aired on ABC from September 12, 1993 to June 14, 1997.\nDeveloped for television by Deborah Joy LeVine, the series loosely follows the philosophy of then-Superman writer John Byrne: Clark Kent is the true personality and Superman a disguise. As the show's title suggests, it focuses as much on the relationship between Clark Kent and Lois Lane as the adventures of Clark's alter-ego.\nThe series spawned several short tie-in books aimed at young adults and a full-length novel for adults, Lois & Clark: A Superman Novel, written by C. J. Cherryh. The show was shot entirely in California.", "rate": 67, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Dean Cain", "Teri Hatcher", "Lane Smith", "Justin Whalin", "K Callan"], "character": ["Clark Kent", "Lois Lane", "Perry White", "Jimmy Olsen", "Martha Kent"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4515   Expand Lois & Clark: The New Adventures of Superman   (1993) User Score Overview Lois & Clark: The New Adventures of Superman is a live-action American television series based on the characters in Superman and Action. Lois & Clark starred Dean Cain as Superman/Clark Kent and Teri Hatcher as Lois Lane, and aired on ABC from September 12, 1993 to June 14, 1997. Developed for television by Deborah Joy LeVine, the series loosely follows the philosophy of then-Superman writer John Byrne: Clark Kent is the true personality and Superman a disguise. As the show's title suggests, it focuses as much on the relationship between Clark Kent and Lois Lane as the adventures of Clark's alter-ego. The series spawned several short tie-in books aimed at young adults and a full-length novel for adults, Lois & Clark: A Superman Novel, written by C. J. Cherryh. The show was shot entirely in California. Featured Crew Deborah Joy LeVine Creator Joe Shuster Creator Jerry Siegel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  0 Images Backdrops  32 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dean Cain Clark Kent Teri Hatcher Lois Lane Lane Smith Perry White Justin Whalin Jimmy Olsen K Callan Martha Kent Full Cast & Crew Last Season Season 4 1996 | 22 Episodes View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Instagram Open 0 by SpaceRanger06\n      \n     M L&C was at it's best at season one Open 3 by  Stratego! M Teri Hatcher look better with long hair? Open 1 by  SpaceRanger06 Go to Discussions Media Most Popular Videos  0 Backdrops  32 Posters  12 Recommendations   1993-09-13 Animaniacs 7.6    1985-09-29 MacGyver 7.3    1960-10-11 The Bugs Bunny Show 7.8    1995-09-04 Xena: Warrior Princess 6.7    1983-09-10 Inspector Gadget 6.6    1995-01-29 Hercules: The Legendary Journeys 6.3    1976-09-18 The Muppet Show 7.8    1987-09-10 Teenage Mutant Ninja Turtles 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Comedy Keywords superhero super power Content Score 93 Almost there... Top Contributors 13 Banana a 8 asusar 8 Imzadi D 7 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}