{"link": "https://www.themoviedb.org/tv/37666?language=en", "title": "Black & White", "resume": "Black & White is a 2009 Taiwanese Drama starring Vic Chou, Mark Chao, Ivy Chen, Janine Chang. It was produced by Prajna Works and directed by Cai Yuexun with location fliming in Kaohsiung, Taiwan.\nThe series was first broadcast in Taiwan on free-to-air Public Television Service from 11 April 2009 to 27 June 2009, every Saturday at 21:00 to 22:55 and satellite TV channel TVBS Joy Channel from 18 April 2009 to 3 July 2009, every Friday at 22:00 - 00:00.\nThe drama was nominated in 2009 for 11 awards at the 44th Golden Bell Awards, Taiwan. It won 5 awards: Best Television Series, Best Leading Actor in a Television Series for Mark Chao, Best Directing for a Television Series for Cai Yuexun, Best Art and Design for a Television Series and Best Marketing Programme.\nOn February 2013, Malaysia's government-owned television station TV2 began to broadcast the series every Monday to Thursday at 18:00 - 19:00.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Vic Chou", "Mark Chao", "Janine Chang", "Sonia Sui", "Ivy Chen"], "character": ["Chen Zai Tian (Pi Zi)", "Wu Ying Xiong", "Lan Xi Ying", "Lei Mu Sha", "Chen Lin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37666   Expand Black & White   (2009) User Score Overview Black & White is a 2009 Taiwanese Drama starring Vic Chou, Mark Chao, Ivy Chen, Janine Chang. It was produced by Prajna Works and directed by Cai Yuexun with location fliming in Kaohsiung, Taiwan. The series was first broadcast in Taiwan on free-to-air Public Television Service from 11 April 2009 to 27 June 2009, every Saturday at 21:00 to 22:55 and satellite TV channel TVBS Joy Channel from 18 April 2009 to 3 July 2009, every Friday at 22:00 - 00:00. The drama was nominated in 2009 for 11 awards at the 44th Golden Bell Awards, Taiwan. It won 5 awards: Best Television Series, Best Leading Actor in a Television Series for Mark Chao, Best Directing for a Television Series for Cai Yuexun, Best Art and Design for a Television Series and Best Marketing Programme. On February 2013, Malaysia's government-owned television station TV2 began to broadcast the series every Monday to Thursday at 18:00 - 19:00. Featured Crew Tsai Yueh-Hsun Creator Yu Hsiao-hui Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vic Chou Chen Zai Tian (Pi Zi) Mark Chao Wu Ying Xiong Janine Chang Lan Xi Ying Sonia Sui Lei Mu Sha Ivy Chen Chen Lin Full Cast & Crew Last Season Season 1 2009 | 24 Episodes Season 1 of Black & White premiered on April 11, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Black & White. You can help by rating TV shows you've seen. Facts Original Name  痞子英雄 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage   http://www.pts.org.tw/ruffian_hero/index1.htm Genres Action & Adventure Keywords police headquarter police officer Content Score 93 Almost there... Top Contributors 25 Wendy c 15 ctchim 9 shadowfurious 1 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}