{"link": "https://www.themoviedb.org/tv/75021?language=en", "title": "God of War Zhao Yun", "resume": "Zhao Zi Long was a great military general who lived in the late Eastern Han Dynasty and early Three Kingdoms period. With unparalleled fighting skills, courage and charisma, he initially served the great warlord Zan Gong Sun but switched alliances to serve Liu Bei for most of his illustrious career as a member of the famed Five Tiger Generals. But when Zhao Yun becomes embroiled in a love triangle with the beautiful Xiaohou Qing Yi and another great warrior, Gao Ze, will he discover that battles of the heart are the most dangerous of all?", "rate": 70, "genre": ["Drama"], "cast": ["Lin Gengxin", "Im Yoona", "Kim Jeong-hoon", "Collin Chou", "Godfrey Gao"], "character": ["Zhao Zi Long", "Xiahou Qing Yi / Ma Yu Rou", "Gao Ze", "Li Quan / Li Rending", "Lü Bu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75021   Expand God of War Zhao Yun   (2016) User Score Overview Zhao Zi Long was a great military general who lived in the late Eastern Han Dynasty and early Three Kingdoms period. With unparalleled fighting skills, courage and charisma, he initially served the great warlord Zan Gong Sun but switched alliances to serve Liu Bei for most of his illustrious career as a member of the famed Five Tiger Generals. But when Zhao Yun becomes embroiled in a love triangle with the beautiful Xiaohou Qing Yi and another great warrior, Gao Ze, will he discover that battles of the heart are the most dangerous of all? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lin Gengxin Zhao Zi Long Im Yoona Xiahou Qing Yi / Ma Yu Rou Kim Jeong-hoon Gao Ze Collin Chou Li Quan / Li Rending Godfrey Gao Lü Bu Full Cast & Crew Last Season Season 1 2016 | 60 Episodes Season 1 of God of War Zhao Yun premiered on April  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on God of War Zhao Yun. You can help by rating TV shows you've seen. Facts Original Name  武神赵子龙 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  50m Homepage  - Genres Drama Keywords romance historical Content Score 86 Almost there... Top Contributors 30 valueasset21 TB 2 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}