{"link": "https://www.themoviedb.org/tv/535?language=en", "title": "Dinner for Five", "resume": "Dinner for Five is a television program in which actor/filmmaker Jon Favreau and a revolving guest list of celebrities eat, drink and talk about life on and off the set and swap stories about projects past and present. The program seats screen legends next to a variety of personalities from film, television, music and comedy, resulting in an unpredictable free-for-all. The program aired on the Independent Film Channel with Favreau the co-Executive Producer with Peter Billingsley.\nThe show format is a spontaneous, open forum for people in the entertainment community. The idea, originally conceived by Favreau, originated from a time when he went out to dinner with colleagues on a film location and exchanged filming anecdotes. Favreau said, \"I thought it would be interesting to show people that side of the business\". He did not want to present them in a \"sensationalized way [that] they're presented in the press, but as normal people\". The format featured Favreau and four guests from the entertainment industry in a restaurant with no other diners. They ordered actual food from real menus and were served by authentic waiters. There were no cue cards or previous research on the participants that would have allowed him to orchestrate the conversation and the guests were allowed to talk about whatever they wanted. The show used five cameras with the operators using long lenses so that they could be at least ten feet away from the table and not intrude on the conversation or make the guests self-conscious. The conversations lasted until the film ran out. A 25-minutes episode would be edited from the two-hour dinner.", "rate": 82, "genre": ["Comedy", "Talk"], "cast": ["Jon Favreau", "Vince Vaughn"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 535   Expand Dinner for Five   (2001) User Score Overview Dinner for Five is a television program in which actor/filmmaker Jon Favreau and a revolving guest list of celebrities eat, drink and talk about life on and off the set and swap stories about projects past and present. The program seats screen legends next to a variety of personalities from film, television, music and comedy, resulting in an unpredictable free-for-all. The program aired on the Independent Film Channel with Favreau the co-Executive Producer with Peter Billingsley. The show format is a spontaneous, open forum for people in the entertainment community. The idea, originally conceived by Favreau, originated from a time when he went out to dinner with colleagues on a film location and exchanged filming anecdotes. Favreau said, \"I thought it would be interesting to show people that side of the business\". He did not want to present them in a \"sensationalized way [that] they're presented in the press, but as normal people\". The format featured Favreau and four guests from the entertainment industry in a restaurant with no other diners. They ordered actual food from real menus and were served by authentic waiters. There were no cue cards or previous research on the participants that would have allowed him to orchestrate the conversation and the guests were allowed to talk about whatever they wanted. The show used five cameras with the operators using long lenses so that they could be at least ten feet away from the table and not intrude on the conversation or make the guests self-conscious. The conversations lasted until the film ran out. A 25-minutes episode would be edited from the two-hour dinner. Featured Crew Jon Favreau Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Favreau Vince Vaughn Full Cast & Crew Last Season Season 5 2008 | 1 Episode Season 5 of Dinner for Five premiered on February  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2015-06-12 Conspiracy 5.7    2012-10-16 The Strange Calls 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Talk Keywords celebrity Content Score 64 We're so close, yet so far. Top Contributors 4 Banana D 2 Daniel 1 quartier  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}