{"link": "https://www.themoviedb.org/tv/61014?language=en", "title": "The Knick", "resume": "Set in downtown New York in 1900, 'The Knick' is centered on the Knickerbocker Hospital and the groundbreaking surgeons, nurses and staff who work there, pushing the bounds of medicine in a time of astonishingly high mortality rates and zero antibiotics.\nJohn Thackery is a brilliant surgeon pioneering new methods in the field, despite his secret addiction to cocaine. He leads a team of doctors including his protégé Dr. Everett Gallinger; the young Dr. Bertie Chickering Jr. and Dr. Algernon Edwards, a promising surgeon who's been recently thrust upon him. The lively cast of characters at the hospital also includes Cornelia Robertson, the daughter of its benefactor, Captain August Robertson; surly ambulance driver Tom Cleary; Lucy Elkins; a fresh-faced nurse from the country; the crooked hospital administrator Herman Barrow; and Sister Harriet, a nun who isn't afraid to speak her mind.", "rate": 78, "genre": ["Drama"], "cast": ["Clive Owen", "André Holland", "Jeremy Bobb", "Juliet Rylance", "Eve Hewson"], "character": ["Dr. John Thackery", "Dr. Algernon Edwards", "Herman Barrow", "Cornelia Robertson", "Lucy Elkins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61014   Expand The Knick   (2014) User Score  Play Trailer Overview Set in downtown New York in 1900, 'The Knick' is centered on the Knickerbocker Hospital and the groundbreaking surgeons, nurses and staff who work there, pushing the bounds of medicine in a time of astonishingly high mortality rates and zero antibiotics. John Thackery is a brilliant surgeon pioneering new methods in the field, despite his secret addiction to cocaine. He leads a team of doctors including his protégé Dr. Everett Gallinger; the young Dr. Bertie Chickering Jr. and Dr. Algernon Edwards, a promising surgeon who's been recently thrust upon him. The lively cast of characters at the hospital also includes Cornelia Robertson, the daughter of its benefactor, Captain August Robertson; surly ambulance driver Tom Cleary; Lucy Elkins; a fresh-faced nurse from the country; the crooked hospital administrator Herman Barrow; and Sister Harriet, a nun who isn't afraid to speak her mind. Featured Crew Jack Amiel Creator Michael Begler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  9 Posters  16 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clive Owen Dr. John Thackery André Holland Dr. Algernon Edwards Jeremy Bobb Herman Barrow Juliet Rylance Cornelia Robertson Eve Hewson Lucy Elkins Full Cast & Crew Last Season Season 2 2015 | 10 Episodes Season 2 of The Knick premiered on October 16, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply The Knick is not being renewed after 2 seasons Open 0 by couchplotato\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  16 Recommendations   2014-06-01 Halt and Catch Fire 7.7    2010-09-19 Boardwalk Empire 7.7    2007-07-19 Mad Men 8.0    2012-06-24 The Newsroom 7.8    2013-09-29 Masters of Sex 6.6    2012-10-11 Copper 6.0    2013-04-22 Rectify 7.6    2015-09-29 The Grinder 6.6  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cinemax.com/the-knick/ Genres Drama Keywords new york drug addiction surgeon medicine hospital historical fiction doctor drugs period drama 20th century Content Score 100 Yes! Looking good! Top Contributors 82 Elizabeth Jennings 37 lineker 30 Travis Bell G 23 GrEg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}