{"link": "https://www.themoviedb.org/tv/66596?language=en", "title": "The Fat and the Angry", "resume": "An explosion happens and body parts are scattered. As a result \"Sebbe\" is taken in for questioning by the city police, but time is short since Interpol and FBI wants him to be handed over to them.", "rate": 60, "genre": ["Crime", "Drama"], "cast": ["Elliott Hasselberg", "Elliott Hasselberg", "Liv Mjönes", "Gustaf Skarsgård", "Jonathan Andersson"], "character": ["Farid", "Farid", "Petra", "Karl", "Sebbe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66596   Expand The Fat and the Angry   (2014) User Score Overview An explosion happens and body parts are scattered. As a result \"Sebbe\" is taken in for questioning by the city police, but time is short since Interpol and FBI wants him to be handed over to them. Featured Crew Andreas Öhman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elliott Hasselberg Farid Elliott Hasselberg Farid Liv Mjönes Petra Gustaf Skarsgård Karl Jonathan Andersson Sebbe Full Cast & Crew Last Season Season 1 2014 | 2 Episodes Season 1 of The Fat and the Angry premiered on February  9, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Fat and the Angry. You can help by rating TV shows you've seen. Facts Original Name  Ettor och Nollor Status  Ended Network Certification  - Type  Miniseries Original Language  Swedish Runtime  - Homepage   http://www.svt.se/ettor-och-nollor/ Genres Crime Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 22 brunnogama 4 Elizabeth Jennings VA 3 Viktor Andersson TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}