{"link": "https://www.themoviedb.org/tv/78?language=en", "title": "Dateline NBC", "resume": "Dateline NBC, or simply Dateline, is a weekly American television reality legal show/newsmagazine series that is broadcast on NBC. It was previously the network's flagship newsmagazine, but now focuses mainly on true crime stories with only occasional editions that focus on other topics. The program airs Fridays at 10 p.m. Eastern Time and, after NFL football season, on Sundays at 7 p.m. ET. Two-hour feature-length editions sometimes air on any given scheduled evening, often to fill holes in the primetime schedule on the program's respective nights due to program cancellations.", "rate": 47, "genre": ["News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78   Expand Dateline NBC   (1992) User Score Overview Dateline NBC, or simply Dateline, is a weekly American television reality legal show/newsmagazine series that is broadcast on NBC. It was previously the network's flagship newsmagazine, but now focuses mainly on true crime stories with only occasional editions that focus on other topics. The program airs Fridays at 10 p.m. Eastern Time and, after NFL football season, on Sundays at 7 p.m. ET. Two-hour feature-length editions sometimes air on any given scheduled evening, often to fill holes in the primetime schedule on the program's respective nights due to program cancellations. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 2018 2018 | 5 Episodes Season 2018 of Dateline NBC premiered on January 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1978-06-02 20/20 7.0    2010-09-26 Sister Wives 4.8    The O'Reilly Factor 2.4    1988-01-19 48 Hours 7.3    2002-09-16 Dr. Phil 2.7    2009-03-02 Late Night with Jimmy Fallon 6.0    2012-03-21 Duck Dynasty 4.1    1999-01-31 Family Guy 6.5  Facts Status  Returning Series Network Certification  - Type  News Original Language  English Runtime  60m Homepage   http://dateline.msnbc.com/ Genres News Keywords news broadcast true crime magazine show Content Score 56 We're so close, yet so far. Top Contributors 9 Banana 5 Elizabeth Jennings r 2 rbcs99@aol.com 2 Chiall™  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}