{"link": "https://www.themoviedb.org/tv/70023?language=en", "title": "We, Ours and Yours", "resume": "Two lovers middle-aged, five children and mother in law under one roof. Meet newly Ivanovi family. Lilly is the first love of Christo and Christo - her first love. Between the first kiss and their wedding has passed 20 years in which every one of them have one marriage behind and five children - two daughters for Lily and three sons for Christo.", "rate": 0, "genre": ["Drama", "Comedy", "Family"], "cast": ["Kiril Efremov", "Elena Petrova", "Martin Zhelankov", "Radina Borshosh", "Martin Tsolov"], "character": ["Christo", "Lilly", "Martin", "Despina (Dessy)", "Ivo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70023   Expand We, Ours and Yours   (2017) User Score Overview Two lovers middle-aged, five children and mother in law under one roof. Meet newly Ivanovi family. Lilly is the first love of Christo and Christo - her first love. Between the first kiss and their wedding has passed 20 years in which every one of them have one marriage behind and five children - two daughters for Lily and three sons for Christo. Featured Crew Dimitar Gochev Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kiril Efremov Christo Elena Petrova Lilly Martin Zhelankov Martin Radina Borshosh Despina (Dessy) Martin Tsolov Ivo Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of We, Ours and Yours premiered on March  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on We, Ours and Yours. You can help by rating TV shows you've seen. Facts Original Name  Ние, нашите и вашите Status  Returning Series Network Certification  - Type  Scripted Original Language  Bulgarian Runtime  45m Homepage   https://nova.bg/series_movies/series/1576/ Genres Drama Comedy Family Keywords big family divorce divorced family second chance first love blended family Content Score 93 Almost there... Top Contributors i 59 ivanhoe.bg 9 Banana 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}