{"link": "https://www.themoviedb.org/tv/10762?language=en", "title": "Skippy the Bush Kangaroo", "resume": "Skippy the Bush Kangaroo is an Australian television series created by John McCallum, produced from 1966–1968, telling the adventures of a young boy and his intelligent pet kangaroo, and the various visitors to the fictional Waratah National Park in Duffys Forest, near Sydney, New South Wales.\nNinety-one 30-minute episodes were made over the three seasons of production. At the time of first screening, Australian television was still in black and white, however, the show was filmed in colour on 16 mm film to increase its international marketability, especially in the United States and Canada, where it aired in syndication between 1969 and 1972. The Nine Network readily repeated the series several times after Australian television switched to colour transmission in 1975.\nThe series was dubbed into Spanish in Mexico, where it is known as Skippy el canguro, and has been distributed to most Spanish-speaking countries, including Cuba and Spain, where it became very popular. The series crossed the Iron Curtain and was aired in Czechoslovakia and Soviet Union in the 1970s and 1980s, and is still being broadcast in Iran.", "rate": 50, "genre": [], "cast": ["Ken James", "Liza Goddard", "Tony Bonner", "Garry Pankhurst", "Ed Devereaux"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10762   Expand Skippy the Bush Kangaroo   (1968) User Score Overview Skippy the Bush Kangaroo is an Australian television series created by John McCallum, produced from 1966–1968, telling the adventures of a young boy and his intelligent pet kangaroo, and the various visitors to the fictional Waratah National Park in Duffys Forest, near Sydney, New South Wales. Ninety-one 30-minute episodes were made over the three seasons of production. At the time of first screening, Australian television was still in black and white, however, the show was filmed in colour on 16 mm film to increase its international marketability, especially in the United States and Canada, where it aired in syndication between 1969 and 1972. The Nine Network readily repeated the series several times after Australian television switched to colour transmission in 1975. The series was dubbed into Spanish in Mexico, where it is known as Skippy el canguro, and has been distributed to most Spanish-speaking countries, including Cuba and Spain, where it became very popular. The series crossed the Iron Curtain and was aired in Czechoslovakia and Soviet Union in the 1970s and 1980s, and is still being broadcast in Iran. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken James Liza Goddard Tony Bonner Garry Pankhurst Ed Devereaux Full Cast & Crew Last Season Season 3 1969 | 13 Episodes Season 3 of Skippy the Bush Kangaroo premiered on October  6, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1973-11-04 The Paul Hogan Show 5.7    1954-09-12 Lassie 5.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 3 OzDrDj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}