{"link": "https://www.themoviedb.org/tv/39077?language=en", "title": "Blackstone", "resume": "Blackstone is a Canadian television series, which airs on APTN and Showcase. Written, created, directed and produced by Canadian producer Ron E. Scott, the series began filming its eight episodes, plus a pilot, in 2010 in and around Edmonton, Alberta. The second season has concluded and a third season of the series is in development.\nBlackstone follows the lives of Indians on the Blackstone Indian reserve. The story is told from an Aboriginal point of view and according to Scott, “Blackstone is relevant and relational in an Aboriginal story world, with universal themes and conflicts that are not only relatable to some First Nations out there today, but also to the world of politics and power in general.\nNathaniel Arcand, Justin Rain and Carmen Moore are three cast members from Blackstone who also starred in the 2010 film Two Indians Talking. Other cast members include Eric Schweig, Andrea Menard, Michelle Thrush, Roseanne Supernault, Steven Cree Molison, Ashely Callingbull, Michael Holden and Gordon Tootoosis.", "rate": 70, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39077   Expand Blackstone   (2011) User Score  Play Trailer Overview Blackstone is a Canadian television series, which airs on APTN and Showcase. Written, created, directed and produced by Canadian producer Ron E. Scott, the series began filming its eight episodes, plus a pilot, in 2010 in and around Edmonton, Alberta. The second season has concluded and a third season of the series is in development. Blackstone follows the lives of Indians on the Blackstone Indian reserve. The story is told from an Aboriginal point of view and according to Scott, “Blackstone is relevant and relational in an Aboriginal story world, with universal themes and conflicts that are not only relatable to some First Nations out there today, but also to the world of politics and power in general. Nathaniel Arcand, Justin Rain and Carmen Moore are three cast members from Blackstone who also starred in the 2010 film Two Indians Talking. Other cast members include Eric Schweig, Andrea Menard, Michelle Thrush, Roseanne Supernault, Steven Cree Molison, Ashely Callingbull, Michael Holden and Gordon Tootoosis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2014 | 8 Episodes Season 4 of Blackstone premiered on November 11, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blackstone. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage  - Genres Drama Keywords canada native american native american reservation racial issues Content Score 64 We're so close, yet so far. Top Contributors 5 Banana 4 bigyellowbird m 1 mdkFL  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}