{"link": "https://www.themoviedb.org/tv/14801?language=en", "title": "The Legend", "resume": "The Legend is a 2007 South Korean historical fantasy television series, starring Bae Yong-joon, Lee Ji-ah, Moon So-ri and Choi Min-soo. Directed by Kim Jong-hak and written by Song Ji-na, it aired on MBC from November 11 to December 5, 2007 on Wednesdays and Thursdays at 21:55 for 24 episodes.\nLoosely based on the legend of Dangun and Gwanggaeto the Great of Goguryeo, the story also adds mythical elements of the Four Symbols depicted in fantasy form as the four guardians who serve the king of Jyushin. Bae was paid ₩250 million per episode, the highest salary to date for a Korean drama actor.", "rate": 90, "genre": ["Drama", "Fantasy", "History", "Romance"], "cast": ["Bae Yong-jun", "Lee Ji-ah", "Shim Eun-kyung", "Yoo Seung-Ho", "Yoon Tae-young"], "character": ["Damdeok", "Sujini", "Sujini (young)", "Damdeok (young)", "Yeon Hogae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14801   Expand The Legend   (2007) User Score Overview The Legend is a 2007 South Korean historical fantasy television series, starring Bae Yong-joon, Lee Ji-ah, Moon So-ri and Choi Min-soo. Directed by Kim Jong-hak and written by Song Ji-na, it aired on MBC from November 11 to December 5, 2007 on Wednesdays and Thursdays at 21:55 for 24 episodes. Loosely based on the legend of Dangun and Gwanggaeto the Great of Goguryeo, the story also adds mythical elements of the Four Symbols depicted in fantasy form as the four guardians who serve the king of Jyushin. Bae was paid ₩250 million per episode, the highest salary to date for a Korean drama actor. Featured Crew Yoon Sang-ho Creator Park Kyung-Soo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bae Yong-jun Damdeok Lee Ji-ah Sujini Shim Eun-kyung Sujini (young) Yoo Seung-Ho Damdeok (young) Yoon Tae-young Yeon Hogae Full Cast & Crew Last Season Season 1 2007 | 24 Episodes Season 1 of The Legend premiered on September 11, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Legend. You can help by rating TV shows you've seen. Facts Original Name  태왕사신기 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/legend/ Genres Drama Fantasy History Romance Keywords korea Content Score 93 Almost there... Top Contributors t 38 tmdb38202327 17 part-mozi a 6 asura766 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}