{"link": "https://www.themoviedb.org/tv/33169?language=en", "title": "Una Maid en Manhattan", "resume": "Una Maid en Manhattan is a Spanish-language telenovela produced by United States-based television network Telemundo Studios, Miami. It is based on Columbia Pictures' 2002 movie \"Maid In Manhattan\", starring Jennifer Lopez and Ralph Fiennes.", "rate": 0, "genre": ["Drama", "Soap"], "cast": ["Vanessa Villela", "Juan Pablo Llano", "Litzy Domínguez", "Eugenio Siller", "Shalim Ortiz"], "character": ["Sara Montero", "Bruno Riveraj", "Marisa Luján", "Cristóbal Parker Salas", "Frank Varela"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33169   Expand Una Maid en Manhattan   (2011) User Score Overview Una Maid en Manhattan is a Spanish-language telenovela produced by United States-based television network Telemundo Studios, Miami. It is based on Columbia Pictures' 2002 movie \"Maid In Manhattan\", starring Jennifer Lopez and Ralph Fiennes. Featured Crew Luis Zelkowicz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vanessa Villela Sara Montero Juan Pablo Llano Bruno Riveraj Litzy Domínguez Marisa Luján Eugenio Siller Cristóbal Parker Salas Shalim Ortiz Frank Varela Full Cast & Crew Last Season Season 1 2011 | 16 Episodes Season 1 of Una Maid en Manhattan premiered on November 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Una Maid en Manhattan. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  42m Homepage   http://www.telemundo.com/novelas/una-maid-en-manhattan Genres Drama Soap Keywords romance telenovela Content Score 93 Almost there... Top Contributors 29 Marr 🇳🇱 b 5 bluwy s 3 speedycars w 1 wonder2wonder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}