{"link": "https://www.themoviedb.org/tv/72167?language=en", "title": "Never Let Me Go", "resume": "30-year-old Kyoko has a \"job\". The story starts with her looking back 20 years to her boarding school of Yoko Gakuen in the mountains. Tomohiko, Miwa, and Kyoko are all in the same grade. Inspired by the educational philosophy of the principal - Emiko, teacher Tatsuko joins the boarding school staff, but soon finds the school rather strange...", "rate": 0, "genre": [], "cast": ["Haruka Ayase", "Haruma Miura", "Asami Mizukawa"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72167   Expand Never Let Me Go   (2016) User Score Overview 30-year-old Kyoko has a \"job\". The story starts with her looking back 20 years to her boarding school of Yoko Gakuen in the mountains. Tomohiko, Miwa, and Kyoko are all in the same grade. Inspired by the educational philosophy of the principal - Emiko, teacher Tatsuko joins the boarding school staff, but soon finds the school rather strange... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruka Ayase Haruma Miura Asami Mizukawa Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Never Let Me Go premiered on January 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Never Let Me Go. You can help by rating TV shows you've seen. Facts Original Name  わたしを離さないで Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.tbs.co.jp/never-let-me-go/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors R 16 RJ_F13 6 againlin g 3 gashtoby A 2 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}