{"link": "https://www.themoviedb.org/tv/64589?language=en", "title": "Profiling Paris", "resume": "Chloé Saint-Laurent is a profiler and works with a police team to solve murders in Paris. She's very sweet, she wears very colored clothes and a huge yellow bag. She looks like a little girl who need a doll, but she's very smart and a very good profiler. Step by step, she fit in the team and her colleagues, very reserved at first, became her best friends.", "rate": 70, "genre": ["Crime"], "cast": ["Raphaël Ferret", "Jean-Michel Martial", "Juliette Roudet", "Diane Dassigny", "Sophie de Fürst"], "character": ["Hippolyte de Courtène", "Commissaire Grégoire Lamarck", "Adèle Delettre", "Jessica Kancel", "Emma Tomasi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64589   Expand Profiling Paris   (2009) User Score  Play Trailer Overview Chloé Saint-Laurent is a profiler and works with a police team to solve murders in Paris. She's very sweet, she wears very colored clothes and a huge yellow bag. She looks like a little girl who need a doll, but she's very smart and a very good profiler. Step by step, she fit in the team and her colleagues, very reserved at first, became her best friends. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Raphaël Ferret Hippolyte de Courtène Jean-Michel Martial Commissaire Grégoire Lamarck Juliette Roudet Adèle Delettre Diane Dassigny Jessica Kancel Sophie de Fürst Emma Tomasi Full Cast & Crew Last Season Season 8 2017 | 10 Episodes Season 8 of Profiling Paris premiered on September  7, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Profiling Paris. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Profiling Paris. You can help by rating TV shows you've seen. Facts Original Name  Profilage Status  Returning Series Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  French Runtime  52m Homepage   http://www.tf1.fr/tf1/profilage Genres Crime Keywords psychologist crime investigation Content Score 93 Almost there... Top Contributors 60 d.a. m 26 magoqu 19 Banana 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}