{"link": "https://www.themoviedb.org/tv/45004?language=en", "title": "Crush Gear Turbo", "resume": "Crush Gear Turbo, also known just as Crush Gear, is an anime and manga series. The anime series, produced by Sunrise, spanned 68 episodes, aired across Japan on the anime television network Animax, from October 7, 2001 to January 26, 2003. It was followed on by a sequel, Crush Gear Nitro, which has also been aired across Japan by Animax. Crush Gear Turbo was about people who threw mechanical vehicles into a large ring to fight and \"crush\" each other. Magna Pacific released Crush Gear Turbo in English in Australia. Cartoon Network Philippines, ABS-CBN, Studio 23 and Hero TV also released Crush Gear Turbo in the Philippines.", "rate": 0, "genre": ["Animation"], "cast": ["Megumi Matsumoto", "Akemi Kanda", "Akira Sasanuma", "Chika Sakamoto", "Michael Shitanda"], "character": ["Kouya Marino", "Kaoru Hanano", "Takeshi Manganji", "Kyousuke Jin", "Jirou Oriza"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45004   Expand Crush Gear Turbo   (2001) User Score Overview Crush Gear Turbo, also known just as Crush Gear, is an anime and manga series. The anime series, produced by Sunrise, spanned 68 episodes, aired across Japan on the anime television network Animax, from October 7, 2001 to January 26, 2003. It was followed on by a sequel, Crush Gear Nitro, which has also been aired across Japan by Animax. Crush Gear Turbo was about people who threw mechanical vehicles into a large ring to fight and \"crush\" each other. Magna Pacific released Crush Gear Turbo in English in Australia. Cartoon Network Philippines, ABS-CBN, Studio 23 and Hero TV also released Crush Gear Turbo in the Philippines. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megumi Matsumoto Kouya Marino Akemi Kanda Kaoru Hanano Akira Sasanuma Takeshi Manganji Chika Sakamoto Kyousuke Jin Michael Shitanda Jirou Oriza Full Cast & Crew Last Season Gekitou!  season 1 — | 28 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crush Gear Turbo. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}