{"link": "https://www.themoviedb.org/tv/75500?language=en", "title": "Dian Fossey: Secrets in the Mist", "resume": "Dian Fossey's life story from childhood and her early days researching in Congo, through to her arrival in Rwanda, where she spent 18 years studying and protecting the mountain gorilla population. Through extensive and rarely seen archival footage, dozens of Fossey’s letters, interviews with friends and colleagues, and narration by Sigourney Weaver, the event series explores Fossey’s murder and the investigation and trial of her research student Wayne McGuire, who was found guilty in absentia of her murder by the Rwandan courts.", "rate": 0, "genre": ["Documentary"], "cast": ["Sigourney Weaver", "Dian Fossey"], "character": ["Dian Fossey (voice)", "Herself (archive footage)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75500   Expand Dian Fossey: Secrets in the Mist   (2017) User Score  Play Trailer Overview Dian Fossey's life story from childhood and her early days researching in Congo, through to her arrival in Rwanda, where she spent 18 years studying and protecting the mountain gorilla population. Through extensive and rarely seen archival footage, dozens of Fossey’s letters, interviews with friends and colleagues, and narration by Sigourney Weaver, the event series explores Fossey’s murder and the investigation and trial of her research student Wayne McGuire, who was found guilty in absentia of her murder by the Rwandan courts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  1 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  1 Opening Credits  0 Top Billed Cast Sigourney Weaver Dian Fossey (voice) Dian Fossey Herself (archive footage) Full Cast & Crew Current Season Season 1 2017 | 3 Episodes Season 1 of Dian Fossey: Secrets in the Mist premiered on December  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  9 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dian Fossey: Secrets in the Mist. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  43m Homepage   http://channel.nationalgeographic.com/dian-fossey-secrets-in-the-mist/ Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 33 Elizabeth Jennings TB 3 TMDb Bot 1 tigru89 t 1 thermo6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}