{"link": "https://www.themoviedb.org/tv/60804?language=en", "title": "The Night Shift", "resume": "The stories of the men and women who work the overnight shift at San Antonio Memorial Hospital. They are an irreverent and special breed, particularly adrenaline junkie T.C. Callahan.", "rate": 61, "genre": ["Drama"], "cast": ["Eoin Macken", "Jill Flint", "JR Lemon", "Brendan Fehr", "Robert Bailey Jr."], "character": ["Dr. TC Callahan", "Dr. Jordan Alexander", "Kenny Fournette", "Dr. Drew Alister", "Dr. Paul Cummings"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60804   Expand The Night Shift   (2014) User Score  Play Trailer Overview The stories of the men and women who work the overnight shift at San Antonio Memorial Hospital. They are an irreverent and special breed, particularly adrenaline junkie T.C. Callahan. Featured Crew Jeff Judah Creator Gabe Sachs Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  13 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Eoin Macken Dr. TC Callahan Jill Flint Dr. Jordan Alexander JR Lemon Kenny Fournette Brendan Fehr Dr. Drew Alister Robert Bailey Jr. Dr. Paul Cummings Full Cast & Crew Last Season Season 4 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Are they ever going to address the suicide???? Open 0 by tristavv\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  13 Posters  6 Recommendations   2014-06-29 Reckless 5.5    2008-10-12 Stephen Fry in America 8.0    2009-10-04 Autumn's Concerto 7.8    2017-01-06 One Day at a Time 6.6    2014-10-06 Strange Empire 6.2    2015-01-07 Underworld, Inc. 7.3    2016-11-27 Pacific Heat 5.1    2015-01-12 Eye Candy 5.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.nbc.com/the-night-shift Genres Drama Keywords night shift hospital doctor emergency room ex military medical drama san antonio Content Score 100 Yes! Looking good! Top Contributors 67 Banana 59 Elizabeth Jennings 29 benf45 14 Nero Kosonen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}