{"link": "https://www.themoviedb.org/tv/58111?language=en", "title": "Extant", "resume": "An astronaut returns home from a year long solo mission in space. She tries to reconnect with her husband and son in their everyday life. Her experiences in space and home lead to events that ultimately will change the course of human history.", "rate": 63, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Halle Berry", "Pierce Gagnon", "Grace Gummer", "Tyler Hilton", "Jeffrey Dean Morgan"], "character": ["Molly Woods", "Ethan Woods", "Julie Gelineau", "Charlie Arthurs", "JD Richter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58111   Expand Extant   (2014) User Score  Play Trailer Overview An astronaut returns home from a year long solo mission in space. She tries to reconnect with her husband and son in their everyday life. Her experiences in space and home lead to events that ultimately will change the course of human history. Featured Crew Mickey Fisher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  9 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Halle Berry Molly Woods Pierce Gagnon Ethan Woods Grace Gummer Julie Gelineau Tyler Hilton Charlie Arthurs Jeffrey Dean Morgan JD Richter Full Cast & Crew Last Season Season 2 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for Extant. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  7 Recommendations   2014-06-19 Dominion 5.9    2015-06-01 The Whispers 5.7    2014-01-10 Helix 6.4    2013-04-15 Defiance 6.2    2011-06-19 Falling Skies 6.4    2013-06-24 Under the Dome 6.2    2013-11-17 Almost Human 7.0    2012-09-17 Revolution 6.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/extant/ Genres Sci-Fi & Fantasy Drama Keywords android artificial intelligence alien life-form alien cover-up astronaut space station artificial insemination religious fundamentalism Content Score 100 Yes! Looking good! Top Contributors 37 Elizabeth Jennings 29 seawolf 17 Travis Bell AK 16 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}