{"link": "https://www.themoviedb.org/tv/71822?language=en", "title": "The Trial: A Murder in the Family", "resume": "In a pioneering series that reveals the inner workings of the legal system, a fictional murder case is tried in a real court, by eminent legal professionals and a jury of 12 members of the public.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71822   Expand The Trial: A Murder in the Family   (2017) User Score  Play Trailer Overview In a pioneering series that reveals the inner workings of the legal system, a fictional murder case is tried in a real court, by eminent legal professionals and a jury of 12 members of the public. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 5 Episodes Season 1 of The Trial: A Murder in the Family premiered on May 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Trial: A Murder in the Family. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  45m Homepage   http://www.channel4.com/programmes/the-trial-a-murder-in-the-family Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 16 Elizabeth Jennings e 5 eristamelberg 2 Ash TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}