{"link": "https://www.themoviedb.org/tv/8793?language=en", "title": "A Mind to Kill", "resume": "A Mind to Kill is a police detective series set in Wales, UK. It was developed from a 1991 pilot which starred Philip Madoc as DCI Bain, and Hywel Bennett. The series ran from 1994 to 2004 and first aired as Yr Heliwr on S4C, the Welsh language TV channel, before being broadcast on the UK Network channel, Channel 5. The series was filmed in English and in Welsh, with each scene being shot first in one language and then in the other. It has since been dubbed into more than a dozen languages and shown all over the world. The 21 episodes have been divided into 3 series which are now available on DVD. The pilot episode is also available on DVD.", "rate": 0, "genre": ["Drama"], "cast": ["Philip Madoc", "Gillian Elisa", "Ffion Wilkins", "Sharon Morgan"], "character": ["DCI Noel Bain", "DS Alison Griffiths", "Hannah Bain", "Professor Margaret Edwards"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8793   Expand A Mind to Kill   (1994) User Score Overview A Mind to Kill is a police detective series set in Wales, UK. It was developed from a 1991 pilot which starred Philip Madoc as DCI Bain, and Hywel Bennett. The series ran from 1994 to 2004 and first aired as Yr Heliwr on S4C, the Welsh language TV channel, before being broadcast on the UK Network channel, Channel 5. The series was filmed in English and in Welsh, with each scene being shot first in one language and then in the other. It has since been dubbed into more than a dozen languages and shown all over the world. The 21 episodes have been divided into 3 series which are now available on DVD. The pilot episode is also available on DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philip Madoc DCI Noel Bain Gillian Elisa DS Alison Griffiths Ffion Wilkins Hannah Bain Sharon Morgan Professor Margaret Edwards Full Cast & Crew Last Season Season 5 2002 | 4 Episodes Season 5 of A Mind to Kill premiered on August 16, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on A Mind to Kill. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Drama Keywords police detective murder investigation Content Score 86 Almost there... Top Contributors 16 Banana 3 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}