{"link": "https://www.themoviedb.org/tv/64669?language=en", "title": "37 Days", "resume": "This three-part political thriller follows the catastrophic chain of events leading up to World War I from the assassination of Archduke Franz Ferdinand on 28 June 1914 to Britain's declaration of war on Germany 37 days later. This tense and gripping miniseries set among the corridors of power in Whitehall and Berlin tracks the unfolding crisis through the eyes of leading politicians and civil servants struggling to prevent the world's first global war. 37 Days unlocks the mystery of the war s origins, overturning assumptions about its inevitability, demonstrating that World War One was neither a chance happening nor was it a foregone conclusion.", "rate": 80, "genre": ["Drama"], "cast": ["Bernhard Schütz", "Mark Lewis Jones", "Nicholas Asbury", "Urs Remond", "Oliver Ford Davies"], "character": ["Helmuth Moltke", "David Lloyd George", "Winston Churchill", "Prince Lichnowsky", "Cunliffe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64669   Expand 37 Days   (2014) User Score Overview This three-part political thriller follows the catastrophic chain of events leading up to World War I from the assassination of Archduke Franz Ferdinand on 28 June 1914 to Britain's declaration of war on Germany 37 days later. This tense and gripping miniseries set among the corridors of power in Whitehall and Berlin tracks the unfolding crisis through the eyes of leading politicians and civil servants struggling to prevent the world's first global war. 37 Days unlocks the mystery of the war s origins, overturning assumptions about its inevitability, demonstrating that World War One was neither a chance happening nor was it a foregone conclusion. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bernhard Schütz Helmuth Moltke Mark Lewis Jones David Lloyd George Nicholas Asbury Winston Churchill Urs Remond Prince Lichnowsky Oliver Ford Davies Cunliffe Full Cast & Crew Last Season Miniseries 2014 | 3 Episodes Season 1 of 37 Days premiered on March  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 37 Days. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p01pf7dx Genres Drama Keywords world war i miniseries period drama docudrama political thriller Content Score 86 Almost there... Top Contributors 44 Elizabeth Jennings TB 22 TMDb Bot p 14 pepecine 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}