{"link": "https://www.themoviedb.org/tv/30938?language=en", "title": "Spliced", "resume": "Spliced is a Canadian animated television series produced by Teletoon and Nelvana. The series made its world premiere on Jetix in Latin America on April 20, 2009. The series currently airs in Canada on Teletoon, in the United States on qubo, in Australia on ABC3, in the United Kingdom on Nicktoons, in Latin America on Disney XD, and in Sweden on Nickelodeon. The series began airing in the United States on qubo on September 19, 2009 until the network dropped it from its lineup on October 24, 2009 but returned on September 28, 2010 as part of its \"Night Owl\" block.", "rate": 0, "genre": ["Comedy"], "cast": ["Rob Stefaniuk", "Patrick McKenna", "Joe Pingue", "Grey DeLisle", "Candi Milo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30938   Expand Spliced   (2010) User Score Overview Spliced is a Canadian animated television series produced by Teletoon and Nelvana. The series made its world premiere on Jetix in Latin America on April 20, 2009. The series currently airs in Canada on Teletoon, in the United States on qubo, in Australia on ABC3, in the United Kingdom on Nicktoons, in Latin America on Disney XD, and in Sweden on Nickelodeon. The series began airing in the United States on qubo on September 19, 2009 until the network dropped it from its lineup on October 24, 2009 but returned on September 28, 2010 as part of its \"Night Owl\" block. Featured Crew Joe Murray Creator Stephen Hillenburg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Stefaniuk Patrick McKenna Joe Pingue Grey DeLisle Candi Milo Full Cast & Crew Last Season ! season 1 2009 | 26 Episodes Season 1 of Spliced premiered on September 19, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Spliced. You can help by rating TV shows you've seen. Facts Status  Ended Network Télétoon Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.nelvana.com/shows/shows_template.asp?sid=213 Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}