{"link": "https://www.themoviedb.org/tv/54302?language=en", "title": "The Half Hidden", "resume": "The story of \"The Half Hidden\" is like a tapestry, in which the threads run obliquely between four different families in two different decades. Weaving recurrent patterns, the story unfolds upon the loom of our vulnerability in lives that are as brittle as the morning ice. This is the story of those who survived, and this is the story of those who did not survive.", "rate": 73, "genre": ["Drama"], "cast": ["Bruno Årfors", "Henrik Ljung", "Christoffer Hedén", "Axel Lindqvist", "Otto Flytström"], "character": ["Narrator", "Lennart", "Ragnar", "Liam", "Joije"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54302   Expand The Half Hidden   (2009) User Score Overview The story of \"The Half Hidden\" is like a tapestry, in which the threads run obliquely between four different families in two different decades. Weaving recurrent patterns, the story unfolds upon the loom of our vulnerability in lives that are as brittle as the morning ice. This is the story of those who survived, and this is the story of those who did not survive. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruno Årfors Narrator Henrik Ljung Lennart Christoffer Hedén Ragnar Axel Lindqvist Liam Otto Flytström Joije Full Cast & Crew Last Season Season 1 2009 | 4 Episodes Season 1 of The Half Hidden premiered on January  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Half Hidden. You can help by rating TV shows you've seen. Facts Original Name  De halvt dolda Status  Ended Network Certification  - Type  Miniseries Original Language  Swedish Runtime  60m Homepage  - Genres Drama Keywords miniseries Content Score 86 Almost there... Top Contributors VA 32 Viktor Andersson TB 6 TMDb Bot 5 lineker R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}