{"link": "https://www.themoviedb.org/tv/42339?language=en", "title": "Queen Insoo", "resume": "Queen Insoo focuses on the fierce power struggle among three women in the royal court of the Joseon Dynasty.", "rate": 60, "genre": ["War", "Politics", "Drama"], "cast": ["Chae Shi-ra", "Kim Mi-Sook", "Kim Young-Ho", "Ham Eun-jeong ", "Kim Yong-hee"], "character": ["Queen Insoo", "Queen Jeong-hui", "Grand Prince Soo-yang", "Young Queen Insoo", "Kwon Ram"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42339   Expand Queen Insoo   (2011) User Score Overview Queen Insoo focuses on the fierce power struggle among three women in the royal court of the Joseon Dynasty. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chae Shi-ra Queen Insoo Kim Mi-Sook Queen Jeong-hui Kim Young-Ho Grand Prince Soo-yang Ham Eun-jeong  Young Queen Insoo Kim Yong-hee Kwon Ram Full Cast & Crew Last Season Season 1 2011 | 1 Episode Season 1 of Queen Insoo premiered on December  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Queen Insoo. You can help by rating TV shows you've seen. Facts Original Name  인수대비 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  45m Homepage   http://tv.jtbc.joins.com/queeninsu/ Genres War & Politics Drama Keywords historical figure period drama historical Content Score 93 Almost there... Top Contributors 24 animerika t 13 tmdb983464 TB 1 TMDb Bot M 1 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}