{"link": "https://www.themoviedb.org/tv/12965?language=en", "title": "María la del Barrio", "resume": "María la del barrio, the third telenovela in the Las Tres Marías trilogy, is a Mexican telenovela starring Thalía, Fernando Colunga, Itatí Cantoral, Ricardo Blume, Irán Eory and the young actors Ludwika Paleta & Osvaldo Benavides. It was produced and broadcast on Televisa in 1995–1996.\nThe series is a remake of Los Ricos También Lloran, which featured Verónica Castro, Rogelio Guerra and Rocío Banquells. María la del barrio is considered one of the most popular and successful telenovelas ever, having been broadcast in over 180 countries and watched by more than two billion people.", "rate": 58, "genre": ["Drama"], "cast": ["Thalía", "Itatí Cantoral", "Fernando Colunga", "Irán Eory", "Ricardo Blume"], "character": ["María Hernández Rojas de De la Vega", "Soraya Montenegro vda. de Montalbán", "Luis Fernando de la Vega Montenegro", "Victoria Montenegro de la Vega", "Don Fernando de la Vega"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12965   Expand María la del Barrio   (1995) User Score Overview María la del barrio, the third telenovela in the Las Tres Marías trilogy, is a Mexican telenovela starring Thalía, Fernando Colunga, Itatí Cantoral, Ricardo Blume, Irán Eory and the young actors Ludwika Paleta & Osvaldo Benavides. It was produced and broadcast on Televisa in 1995–1996. The series is a remake of Los Ricos También Lloran, which featured Verónica Castro, Rogelio Guerra and Rocío Banquells. María la del barrio is considered one of the most popular and successful telenovelas ever, having been broadcast in over 180 countries and watched by more than two billion people. Featured Crew Televisa Creator Inés Rodena Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thalía María Hernández Rojas de De la Vega Itatí Cantoral Soraya Montenegro vda. de Montalbán Fernando Colunga Luis Fernando de la Vega Montenegro Irán Eory Victoria Montenegro de la Vega Ricardo Blume Don Fernando de la Vega Full Cast & Crew Last Season Season 1 1995 | 19 Episodes Season 1 of María la del Barrio premiered on August 14, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1994-01-31 Marimar 5.3    1998-02-09 Deceptions 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m, 30m Homepage   http://www.esmas.com Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors L 34 Leah a 3 asusar W 1 Wakaku c 1 christra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}