{"link": "https://www.themoviedb.org/tv/68558?language=en", "title": "Apocalypse: The Rise of Hitler", "resume": "Chronicles Hitler's life as a failed painter and far-right activist up to his election as Chancellor of Germany, leading to his relentless rise to power, culminating in the beginning of World War II.  Part 1: The Menace - The trenches gave him his self-appointed mission to save Germany, but it was Hitler's natural ability to address the crowds that allowed him to take advantage of a devastated population.  Part 2: The Furher - Prior to his new-found prominence, Hitler was considered a mad man on the fringe of German political life. So how did he push his way into power and plunge the world into war?", "rate": 76, "genre": ["Documentary", "War", "Politics"], "cast": ["Doug Rand", "Adolf Hitler", "Joseph Goebbels", "Paul von Hindenburg", "Erich Ludendorff"], "character": ["Narrator, English version", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68558   Expand Apocalypse: The Rise of Hitler   (2011) User Score Overview Chronicles Hitler's life as a failed painter and far-right activist up to his election as Chancellor of Germany, leading to his relentless rise to power, culminating in the beginning of World War II.  Part 1: The Menace - The trenches gave him his self-appointed mission to save Germany, but it was Hitler's natural ability to address the crowds that allowed him to take advantage of a devastated population.  Part 2: The Furher - Prior to his new-found prominence, Hitler was considered a mad man on the fringe of German political life. So how did he push his way into power and plunge the world into war? Featured Crew Daniel Costelle Creator Isabelle Clarke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  13 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Doug Rand Narrator, English version Adolf Hitler Himself Joseph Goebbels Himself Paul von Hindenburg Himself Erich Ludendorff Himself Full Cast & Crew Last Season Season 1 2011 | 2 Episodes Season 1 of Apocalypse: The Rise of Hitler premiered on October 25, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Apocalypse: The Rise of Hitler. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  13 Posters  9 Recommendations   2009-09-08 Apocalypse: The Second World War 8.2  Facts Original Name  Apocalypse, Hitler Status  Ended Network Certification  - Type  Miniseries Original Language  French Runtime  60m Homepage   http://natgeotv.com/ca/apocalypse-the-rise-of-hitler Genres Documentary War & Politics Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors TB 62 TMDb Bot p 27 psygizmo 3 tigru89 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}