{"link": "https://www.themoviedb.org/tv/80386?language=en", "title": "Bigg Boss", "resume": "The Kannada version of the reality show where a number of contestants (known as \"housemates\") live in a purpose-built house and are isolated from the rest of the world. Each week, housemates nominate two of their fellow housemates for eviction, and the housemates who receive the most nominations faces a public vote out.", "rate": 0, "genre": ["Reality"], "cast": ["Sudeep", "Chandan Shetty", "Divakar", "Niveditha Gowda", "Shruti Prakash"], "character": ["Himself - Host", "Himself - Contestant", "Himself - Contestant", "Herself - Contestant", "Herself - Contestant"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80386   Expand Bigg Boss   (2013) User Score Overview The Kannada version of the reality show where a number of contestants (known as \"housemates\") live in a purpose-built house and are isolated from the rest of the world. Each week, housemates nominate two of their fellow housemates for eviction, and the housemates who receive the most nominations faces a public vote out. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sudeep Himself - Host Chandan Shetty Himself - Contestant Divakar Himself - Contestant Niveditha Gowda Herself - Contestant Shruti Prakash Herself - Contestant Full Cast & Crew Current Season Original Air Date Original Air Date ETV Kannada (TV) Season 5 2017 | 1 Episode Season 5 of Bigg Boss premiered on October 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bigg Boss. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Star India Certification  - Type  Reality Original Language  Kannada Runtime  60m Homepage  - Genres Reality Keywords reality tv Content Score 86 Almost there... Top Contributors 227 davamuga 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}