{"link": "https://www.themoviedb.org/tv/69689?language=en", "title": "Tina & Bobby", "resume": "When England won the World Cup in July 1966 Bobby Moore became a national hero.  Swept up by the media frenzy and the nation’s adoration, he and wife Tina were the original ‘golden’ couple.", "rate": 30, "genre": ["Drama"], "cast": ["Michelle Keegan", "Lorne MacFadyen", "Sophie Austin", "Neal Barry", "David Bamber"], "character": ["Tina Dean", "Bobby Moore", "Judith Hurst", "Big Bob Moore", "Alf Ramsey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69689   Expand Tina & Bobby   (2017) User Score Overview When England won the World Cup in July 1966 Bobby Moore became a national hero.  Swept up by the media frenzy and the nation’s adoration, he and wife Tina were the original ‘golden’ couple. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michelle Keegan Tina Dean Lorne MacFadyen Bobby Moore Sophie Austin Judith Hurst Neal Barry Big Bob Moore David Bamber Alf Ramsey Full Cast & Crew Last Season Season 1 2017 | 3 Episodes Season 1 of Tina & Bobby premiered on January 14, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Tina & Bobby. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Tina & Bobby. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  46m Homepage   http://itv.com/hub/tina-bobby/2a3958 Genres Drama Keywords sport professional soccer player marriage biography based on a true story miniseries soccer relationship 1960s Content Score 86 Almost there... Top Contributors 36 Banana 10 Elizabeth Jennings TB 9 TMDb Bot k 6 kzhu123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}