{"link": "https://www.themoviedb.org/tv/61691?language=en", "title": "The Czech Century", "resume": "Czech Century brings the key moments of the history of the Czech nation from 1918 to 1989.", "rate": 88, "genre": ["Drama", "War", "Politics"], "cast": ["Daniel Landa", "Jiří Vyorálek", "Luboš Veselý", "Jan Budař", "David Novotný"], "character": ["Major Emanuel Moravec", "Klement Gottwald", "General Vojtech Luza", "Václav Kopecký", "Rudolf Slánský"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61691   Expand The Czech Century   (2013) User Score Overview Czech Century brings the key moments of the history of the Czech nation from 1918 to 1989. Featured Crew Robert Sedláček Creator Pavel Kosatík Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel Landa Major Emanuel Moravec Jiří Vyorálek Klement Gottwald Luboš Veselý General Vojtech Luza Jan Budař Václav Kopecký David Novotný Rudolf Slánský Full Cast & Crew Last Season Season 1 2013 | 9 Episodes Season 1 of The Czech Century premiered on October 27, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Czech Century. You can help by rating TV shows you've seen. Facts Original Name  České století Status  Ended Network Certification  - Type  Documentary Original Language  Czech Runtime  95m Homepage   http://www.ceskatelevize.cz/porady/10362640311-ceske-stoleti/ Genres Drama War & Politics Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 237 Jiří Doubravský  100 Elizabeth Jennings CM 10 Cherche Moi 5 6 5lucina5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}