{"link": "https://www.themoviedb.org/tv/1877?language=en", "title": "Phineas and Ferb", "resume": "Each day, two kindhearted suburban stepbrothers on summer vacation embark on some grand new project, which annoys their controlling sister, Candace, who tries to bust them. Meanwhile, their pet platypus plots against evil Dr. Doofenshmirtz.", "rate": 75, "genre": ["Animation", "Comedy", "Family", "Sci-Fi", "Fantasy"], "cast": ["Vincent Martella", "Thomas Brodie-Sangster", "Ashley Tisdale", "Dan Povenmire", "Caroline Rhea"], "character": ["Phineas Flynn (voice)", "Ferb Fletcher (voice)", "Candace Flynn (voice)", "Dr. Heinz Doofenshmirtz (voice)", "Linda Flynn (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1877   Expand Phineas and Ferb   (2007) User Score Overview Each day, two kindhearted suburban stepbrothers on summer vacation embark on some grand new project, which annoys their controlling sister, Candace, who tries to bust them. Meanwhile, their pet platypus plots against evil Dr. Doofenshmirtz. Featured Crew Dan Povenmire Creator Jeff 'Swampy' Marsh Creator Joe Orrantia Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  5 Posters  8 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  1 Top Billed Cast Vincent Martella Phineas Flynn (voice) Thomas Brodie-Sangster Ferb Fletcher (voice) Ashley Tisdale Candace Flynn (voice) Dan Povenmire Dr. Heinz Doofenshmirtz (voice) Caroline Rhea Linda Flynn (voice) Full Cast & Crew Last Season Season 4 2012 | 49 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Will phineas and ferb ever return Open 0 by pee-wee herman\n      \n     w Phineas: Happy Birthday Vincent Martella! Open 0 by wonder2wonder\n      \n     w Ferb: Happy Birthday Thomas Brodie-Sangster! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  8 Recommendations   2002-06-07 Kim Possible 6.7    1996-04-28 Dexter's Laboratory 7.3    2001-03-30 The Fairly OddParents 6.7    2000-09-09 Jackie Chan Adventures 7.1    2002-12-06 Codename: Kids Next Door 6.5    2008-04-18 Ben 10: Alien Force 6.1    1999-05-01 SpongeBob SquarePants 6.8    1998-11-18 The Powerpuff Girls 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  11m Homepage   http://disneychannel.disney.com/phineas-and-ferb Genres Animation Comedy Family Sci-Fi & Fantasy Keywords secret agent kids blended family Content Score 100 Yes! Looking good! Top Contributors 45 Banana CM 11 Cherche Moi 10 Atanas g 10 glossspam  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}