{"link": "https://www.themoviedb.org/tv/61617?language=en", "title": "Over the Garden Wall", "resume": "Two brothers, Wirt and Greg, find themselves lost in the Unknown; a strange forest adrift in time. With the help of a wise old Woodsman and a foul-tempered bluebird named Beatrice, Wirt and Greg must travel across this strange land, in hope of finding their way home. Join them as they encounter surprises and obstacles on their journey through the wood.", "rate": 83, "genre": ["Mystery", "Sci-Fi", "Fantasy", "Animation", "Family", "Comedy"], "cast": ["Elijah Wood", "Collin Dean", "Christopher Lloyd", "Melanie Lynskey", "Samuel Ramey"], "character": ["Wirt (voice)", "Greg (voice)", "Woodsman (voice)", "Beatrice (voice)", "The Beast (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61617   Expand Over the Garden Wall   (2014) User Score  Play Trailer Overview Two brothers, Wirt and Greg, find themselves lost in the Unknown; a strange forest adrift in time. With the help of a wise old Woodsman and a foul-tempered bluebird named Beatrice, Wirt and Greg must travel across this strange land, in hope of finding their way home. Join them as they encounter surprises and obstacles on their journey through the wood. Featured Crew Patrick McHale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  5 Posters  7 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elijah Wood Wirt (voice) Collin Dean Greg (voice) Christopher Lloyd Woodsman (voice) Melanie Lynskey Beatrice (voice) Samuel Ramey The Beast (voice) Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Over the Garden Wall premiered on November  3, 2014. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply This or gravity falls which one you prefer? Open 0 by Q4428\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  7 Recommendations   2012-06-15 Gravity Falls 8.2    2016-05-26 Neil Gaiman's Likely Stories 5.8    2010-09-06 Regular Show 7.3    1995-04-08 The Maxx 9.0    2014-09-29 Nightwing: The Series 7.8    2005-02-21 Avatar: The Last Airbender 8.2    1997-09-13 Recess 6.8    2015-11-06 Master of None 8.0  Facts Status  Ended Network Certification 6 Meaning Take care with children under 6. Type  Miniseries Original Language  English Runtime  11m Homepage   http://www.cartoonnetwork.com/tv_shows/over-the-garden-wall/video/index.html Genres Mystery Sci-Fi & Fantasy Animation Family Comedy Keywords dream woods beast dark fantasy return home folk horror Content Score 100 Yes! Looking good! Top Contributors 61 Elizabeth Jennings 26 Steven TB 19 TMDb Bot E 18 EightNine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}