{"link": "https://www.themoviedb.org/tv/44894?language=en", "title": "Man from the Equator", "resume": "A tense, emotionally charged tale of brotherhood and betrayal, Man from the Equator follows two best friends with a tragic, twisted history that follows them from youth to adulthood.", "rate": 0, "genre": ["Drama"], "cast": ["Uhm Tae-woong", "Lee Joon-hyuk", "Lee Bo-young", "Im Jung-eun", "Kim Yeong-cheol"], "character": ["Kim Sun-woo", "Lee Jang-il", "Han Ji-won", "Choi Soo-mi", "Jin No-shik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44894   Expand Man from the Equator   (2012) User Score Overview A tense, emotionally charged tale of brotherhood and betrayal, Man from the Equator follows two best friends with a tragic, twisted history that follows them from youth to adulthood. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Uhm Tae-woong Kim Sun-woo Lee Joon-hyuk Lee Jang-il Lee Bo-young Han Ji-won Im Jung-eun Choi Soo-mi Kim Yeong-cheol Jin No-shik Full Cast & Crew Last Season Season 1 2012 | 20 Episodes Season 1 of Man from the Equator premiered on March 21, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Man from the Equator. You can help by rating TV shows you've seen. Facts Original Name  적도의 남자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres Drama Keywords revenge korea Content Score 86 Almost there... Top Contributors t 37 tmdb38202327 M 12 Maria180493 11 kingofbeer 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}