{"link": "https://www.themoviedb.org/tv/2590?language=en", "title": "Stroker and Hoop", "resume": "Stroker and Hoop is an American Flash animated television series on Cartoon Network's late night programming block, Adult Swim. The series is a parody of buddy cop films and television series such as Starsky & Hutch, and features the voices of Jon Glaser as Stroker and Timothy \"Speed\" Levitch as Hoop. This might also be a parody of the two Burt Reynolds characters: \"Stroker Ace\" and \"Hooper\".\nStroker and Hoop premiered on August 1, 2004, and ended on December 25, 2005, with 13 episodes. Adult Swim continues to air reruns of Stroker and Hoop on an infrequent basis.", "rate": 70, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Timothy \"Speed\" Levitch", "Curtis Armstrong", "Jon Glaser"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2590   Expand Stroker and Hoop   (2004) User Score Overview Stroker and Hoop is an American Flash animated television series on Cartoon Network's late night programming block, Adult Swim. The series is a parody of buddy cop films and television series such as Starsky & Hutch, and features the voices of Jon Glaser as Stroker and Timothy \"Speed\" Levitch as Hoop. This might also be a parody of the two Burt Reynolds characters: \"Stroker Ace\" and \"Hooper\". Stroker and Hoop premiered on August 1, 2004, and ended on December 25, 2005, with 13 episodes. Adult Swim continues to air reruns of Stroker and Hoop on an infrequent basis. Featured Crew Casper Kelly Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Timothy \"Speed\" Levitch Curtis Armstrong Jon Glaser Full Cast & Crew Last Season Season 1 2004 | 14 Episodes Season 1 of Stroker and Hoop premiered on August  1, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2005-06-19 12 oz. Mouse 6.4    1999-09-24 Mission Hill 7.3    2005-10-30 Lucy, the Daughter of the Devil 7.0    2001-04-01 The Oblongs 6.7    2004-11-14 Tom Goes to the Mayor 7.2    2005-12-13 Moral Orel 7.5    2006-08-06 Metalocalypse 6.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.adultswim.com/shows/strokerandhoop/index.html Genres Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors j 2 jco666 A 2 AnthonyAtkins232 m 1 movie28  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}