{"link": "https://www.themoviedb.org/tv/8416?language=en", "title": "The Little Nyonya", "resume": "The Little Nyonya is a 2008 drama serial on Singapore's free-to-air channel, MediaCorp TV Channel 8. The storyline, which circles around the biographical flashback of an extended Peranakan family in Malacca, is set in the 1930s and spans to over 70 years and several generations of three families. The series was partly sponsored by the Media Development Authority of Singapore. It debuted on November 25, 2008 and concluded its run on January 5, 2009.\nProduced by MediaCorp in commemoration of the channel's 45-year anniversary, the series has been critically acclaimed by both viewers and critics, and raked the highest viewership in the country in 14 years. The success of The Little Nyonya has also led to the show being broadcast internationally. The series also became the first ever Singaporean Chinese drama to be dubbed in Malay and aired on Malay-language channel Suria.", "rate": 0, "genre": [], "cast": ["Yao Wenlong", "Xiang Yun", "Pierre Png", "Jeanette Aw", "Qi Yuwu"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8416   Expand The Little Nyonya   (2008) User Score Overview The Little Nyonya is a 2008 drama serial on Singapore's free-to-air channel, MediaCorp TV Channel 8. The storyline, which circles around the biographical flashback of an extended Peranakan family in Malacca, is set in the 1930s and spans to over 70 years and several generations of three families. The series was partly sponsored by the Media Development Authority of Singapore. It debuted on November 25, 2008 and concluded its run on January 5, 2009. Produced by MediaCorp in commemoration of the channel's 45-year anniversary, the series has been critically acclaimed by both viewers and critics, and raked the highest viewership in the country in 14 years. The success of The Little Nyonya has also led to the show being broadcast internationally. The series also became the first ever Singaporean Chinese drama to be dubbed in Malay and aired on Malay-language channel Suria. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yao Wenlong Xiang Yun Pierre Png Jeanette Aw Qi Yuwu Full Cast & Crew Last Season Season 1 2008 | 34 Episodes Season 1 of The Little Nyonya premiered on November 25, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Little Nyonya. You can help by rating TV shows you've seen. Facts Status  Ended Network MediaCorp Channel 8 Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://littlenyonya.mediacorptv.sg/ Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}