{"link": "https://www.themoviedb.org/tv/46594?language=en", "title": "Queen of Ambition", "resume": "King of Ambition is a 2013 South Korean television series, starring Kwon Sang-woo, Soo Ae, U-Know Yunho, Kim Sung-ryung, and Go Joon-hee. It aired on SBS from January 14 to April 2, 2013 on Mondays and Tuesdays at 21:55 for 24 episodes. Based on Park In-kwon's manhwa of the same title, the same source material as Daemul, the drama tells the tale of an ambitious woman born into poverty who will let nothing stand in her way as she tries to become the First Lady, and a hopeless romantic who will sacrifice anything for her. But when she betrays him, he takes his revenge.", "rate": 70, "genre": ["Drama"], "cast": ["Kwon Sang-Woo", "Park Min-ha", "Soo-Ae", "Chae Sang-woo", "U-Know Yunho"], "character": ["Ha Ryu / Cha Jae-woong", "young Da-hae / Ha Eun-byul", "Joo Da-hae", "young Ha Ryu", "Baek Do-hoon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46594   Expand Queen of Ambition   (2013) User Score Overview King of Ambition is a 2013 South Korean television series, starring Kwon Sang-woo, Soo Ae, U-Know Yunho, Kim Sung-ryung, and Go Joon-hee. It aired on SBS from January 14 to April 2, 2013 on Mondays and Tuesdays at 21:55 for 24 episodes. Based on Park In-kwon's manhwa of the same title, the same source material as Daemul, the drama tells the tale of an ambitious woman born into poverty who will let nothing stand in her way as she tries to become the First Lady, and a hopeless romantic who will sacrifice anything for her. But when she betrays him, he takes his revenge. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kwon Sang-Woo Ha Ryu / Cha Jae-woong Park Min-ha young Da-hae / Ha Eun-byul Soo-Ae Joo Da-hae Chae Sang-woo young Ha Ryu U-Know Yunho Baek Do-hoon Full Cast & Crew Last Season Season 1 2013 | 24 Episodes Season 1 of Queen of Ambition premiered on January 14, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Queen of Ambition. You can help by rating TV shows you've seen. Facts Original Name  야왕 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   yawang.sbs.co.kr Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 37 Maria180493 N 11 Nightowl.Kr 5 Elizabeth Jennings CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}