{"link": "https://www.themoviedb.org/tv/41497?language=en", "title": "Rocket City Rednecks", "resume": "Rocket City Rednecks is an American television show that focuses on engineering.\nThe show is set in Huntsville, Alabama, and features Travis Taylor, three of his relatives, and his best friend. All five cast members are highly educated but, when not working on technical matters, play the part of stereotypical \"rednecks\" and use their advanced knowledge to solve \"real world\" problems.\nThe show was first broadcast on Wednesday September 28, 2011, with Tim Evans as the supervising producer. It is broadcast on the National Geographic Channel, and will be shown in all regions of the United States.", "rate": 80, "genre": ["Action", "Adventure", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41497   Expand Rocket City Rednecks   (2011) User Score Overview Rocket City Rednecks is an American television show that focuses on engineering. The show is set in Huntsville, Alabama, and features Travis Taylor, three of his relatives, and his best friend. All five cast members are highly educated but, when not working on technical matters, play the part of stereotypical \"rednecks\" and use their advanced knowledge to solve \"real world\" problems. The show was first broadcast on Wednesday September 28, 2011, with Tim Evans as the supervising producer. It is broadcast on the National Geographic Channel, and will be shown in all regions of the United States. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2012 | 16 Episodes Season 2 of Rocket City Rednecks premiered on November 29, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Rocket City Rednecks. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Action & Adventure Reality Keywords problem solving time limit crash and burn dangerous projects Content Score 56 We're so close, yet so far. Top Contributors PE 6 Patrick E. Abe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}