{"link": "https://www.themoviedb.org/tv/67434?language=en", "title": "It Takes a Killer", "resume": "Some of the world’s most notorious murders are the subject of “It Takes a Killer,” which investigates the crimes from the perspective of the killers, trying to get inside their minds and determine their motives. Leading homicide investigators and experts from such agencies as the FBI and Scotland Yard take a look at the evidence pulled from crime scenes and profile the killer’s behavior to try to piece together the details of each murder, explaining when, why and how each criminal committed the crime. For the wannabe detectives watching the show, the experts also reveal how the crime was solved — which often requires authorities to think like a killer.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67434   Expand It Takes a Killer   (2016) User Score Overview Some of the world’s most notorious murders are the subject of “It Takes a Killer,” which investigates the crimes from the perspective of the killers, trying to get inside their minds and determine their motives. Leading homicide investigators and experts from such agencies as the FBI and Scotland Yard take a look at the evidence pulled from crime scenes and profile the killer’s behavior to try to piece together the details of each murder, explaining when, why and how each criminal committed the crime. For the wannabe detectives watching the show, the experts also reveal how the crime was solved — which often requires authorities to think like a killer. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of It Takes a Killer premiered on August  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on It Takes a Killer. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.oxygen.com/it-takes-a-killer Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors mj 9 melina jhonson 8 Elizabeth Jennings d 1 dapat F 1 FLIX555  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}