{"link": "https://www.themoviedb.org/tv/61090?language=en", "title": "Ghost Blunders", "resume": "Ghost Blunders is a half hour comedy series that spoofs all of the popular reality \"ghost hunting\" and paranormal shows. Even though John Orrichio directs the TV series \"Ghost Chicks\" he sees the humor in this type of show. The list of paranormal shows goes on and on. Paranormal Cops, Psychic Kids, Psychokinetic Grandparents, Psychic Pets etc. Ghost Blunders takes bits and pieces from all of the popular shows and has fun with them. Using the same equipment as the real ghost hunting groups, they investigate various haunted locations each week. Follow our ghost hunters Byron, Mason and Ricki along with Father Timmy, Little Joe and psychic medium, Chic Java. You'll enjoy the fun and laughs!", "rate": 85, "genre": ["Comedy"], "cast": ["Roberto Lombardi", "Matt Locker", "Edward X. Young", "Gregory R. Campbell", "DiJone'e Mobley"], "character": ["Byron Godforbid", "Mason Hass", "Father Timmy", "Dave Hip Hop", "Chick Java"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61090   Expand Ghost Blunders   (2010) User Score Overview Ghost Blunders is a half hour comedy series that spoofs all of the popular reality \"ghost hunting\" and paranormal shows. Even though John Orrichio directs the TV series \"Ghost Chicks\" he sees the humor in this type of show. The list of paranormal shows goes on and on. Paranormal Cops, Psychic Kids, Psychokinetic Grandparents, Psychic Pets etc. Ghost Blunders takes bits and pieces from all of the popular shows and has fun with them. Using the same equipment as the real ghost hunting groups, they investigate various haunted locations each week. Follow our ghost hunters Byron, Mason and Ricki along with Father Timmy, Little Joe and psychic medium, Chic Java. You'll enjoy the fun and laughs! Featured Crew John Orrichio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roberto Lombardi Byron Godforbid Matt Locker Mason Hass Edward X. Young Father Timmy Gregory R. Campbell Dave Hip Hop DiJone'e Mobley Chick Java Full Cast & Crew Last Season Season 1 2010 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ghost Blunders. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.facebook.com/pages/GHOST-BLUNDERS-TV-Series/115924615097191 Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors DD 37 Debbie D'Amico  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}