{"link": "https://www.themoviedb.org/tv/79102?language=en", "title": "Naked", "resume": "In 2026, a radical change requires everyone to live naked in a pacified and peaceful France. But the murder of a young woman found dressed revives tensions. The investigation is entrusted to a young inspector who collaborates with her ex-partner, just out of the coma in which he had fallen at the time ... where everyone was still wearing clothes.", "rate": 0, "genre": ["Drama"], "cast": ["Malya Roman", "Éléonore Arnaud", "Sébatien Barrio", "Satya Dusaugey", "Brigitte Faure"], "character": ["Lucie", "Malika", "Pujol", "Frank", "Nathalie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79102   Expand Naked   (2018) User Score Overview In 2026, a radical change requires everyone to live naked in a pacified and peaceful France. But the murder of a young woman found dressed revives tensions. The investigation is entrusted to a young inspector who collaborates with her ex-partner, just out of the coma in which he had fallen at the time ... where everyone was still wearing clothes. Featured Crew Olivier Fox Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Malya Roman Lucie Éléonore Arnaud Malika Sébatien Barrio Pujol Satya Dusaugey Frank Brigitte Faure Nathalie Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Naked premiered on June 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Naked. You can help by rating TV shows you've seen. Facts Original Name  Nu Status  Planned Network Certification 16 Meaning Not recommended for children under 16. Not allowed air before 10:30 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  French Runtime  26m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 50 Simon a 1 annibalk g 1 gasp70 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}