{"link": "https://www.themoviedb.org/tv/71722?language=en", "title": "Deception", "resume": "Cameron Black is the world's greatest illusionist. At least, that's what people used to call him - before his greatest secret was exposed and his career destroyed. Even worse, Cameron has good reason to believe this was no accident", "rate": 71, "genre": ["Drama", "Crime"], "cast": ["Jack Cutmore-Scott", "Ilfenesh Hadera", "Lenora Crichlow", "Amaury Nolasco", "Justin Chon"], "character": ["Cameron Black", "Kay Daniels", "Dina Clark", "Mike Alvarez", "Jordan Kwon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71722   Expand Deception   (2018) User Score  Play Trailer Overview Cameron Black is the world's greatest illusionist. At least, that's what people used to call him - before his greatest secret was exposed and his career destroyed. Even worse, Cameron has good reason to believe this was no accident Featured Crew Chris Fedak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Cutmore-Scott Cameron Black Ilfenesh Hadera Kay Daniels Lenora Crichlow Dina Clark Amaury Nolasco Mike Alvarez Justin Chon Jordan Kwon Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of Deception premiered on March 10, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Alright so far Open 0 by GregorClegane\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2018-03-18 Instinct 5.9    2018-01-17 Corporate 6.2    2018-06-04 Dietland 8.0    2018-03-21 Krypton 6.5    2018-03-13 For The People 6.5    2018-01-21 The Resident 7.0    2018-03-29 Siren 7.3    2018-03-13 Rise 6.8  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://abc.go.com/shows/deception Genres Drama Crime Keywords magic fbi illusionist criminal consultant Content Score 100 Yes! Looking good! Top Contributors 27 Warpath 13 Banana m 9 misfit_noel 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}