{"link": "https://www.themoviedb.org/tv/61339?language=en", "title": "Sailor Moon Crystal", "resume": "Usagi Tsukino is chosen to be a guardian of justice and is sent on a quest to locate a Silver Crystal before the Dark Kingdom invades the Earth.", "rate": 88, "genre": ["Animation", "Fantasy"], "cast": ["Ryou Hirohashi", "Shizuka Itou", "Kenji Nojima", "Rina Satou", "Ami Koshimizu"], "character": ["Luna", "Minako Aino", "Mamoru Chiba", "Rei Hino", "Makoto Kino"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61339   Expand Sailor Moon Crystal   (2014) User Score  Play Trailer Overview Usagi Tsukino is chosen to be a guardian of justice and is sent on a quest to locate a Silver Crystal before the Dark Kingdom invades the Earth. Featured Crew Munehisa Sakai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  7 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryou Hirohashi Luna Shizuka Itou Minako Aino Kenji Nojima Mamoru Chiba Rina Satou Rei Hino Ami Koshimizu Makoto Kino Full Cast & Crew Last Season Original Air Date Original Air Date All episodes (Absolute) Sailor Moon Crystal Season III 2016 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Sailor Moon Crystal. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  3 Posters  7 Recommendations   2014-04-05 Dragonar Academy 7.0    2010-07-06 Digimon Fusion 3.8    2010-07-10 Cat Planet Cuties 6.0    2004-07-10 DearS 5.0    2011-10-08 Ben-To 7.2    2012-07-06 Aesthetica of a Rogue Hero 7.1    1992-03-07 Sailor Moon 6.7    2014-10-07 Yona of the Dawn 7.5  Facts Original Name  美少女戦士セーラームーンクリスタル Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://sailormoon-official.com/ Genres Animation Fantasy Keywords magic romance based on manga demon anime Content Score 100 Yes! Looking good! Top Contributors 30 Marr 🇳🇱 25 Elizabeth Jennings 20 sp1ti 12 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}