{"link": "https://www.themoviedb.org/tv/62838?language=en", "title": "My Love Eun Dong", "resume": "Top actor Ji Eun-ho hires ghostwriter Seo Jung-eun to write his autobiography. Eun-ho is tense, irritable and difficult to work with, but Jung-eun finds her assignment fascinating because Eun-ho claims he began acting not because he wanted to become a star but because he thought being in the limelight would help him find his first love, Ji Eun-dong. Eun-ho and Eun-dong's complicated romantic history has spanned two decades, and he's convinced that he can never love anyone else. As Jung-eun helps him remember Eun-dong and why he lost her, Eun-ho (whose birth name is Hyun Soo) looks back on his memories of her, from when he met when he was seventeen.", "rate": 74, "genre": ["Drama", "Romance"], "cast": ["Joo Jin-Mo", "Kim Sa-rang", "Kim Tae-hoon", "Kim Yoo-ri", "Baek Sung-hyun"], "character": ["Ji Eun-Ho / Park Hyun-Soo", "Seo Jung-Eun / Ji Eun-dong", "Choi Jae-Ho", "Seo-Ryeong", "Park Hyun-soo (27)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62838   Expand My Love Eun Dong   (2015) User Score  Play Trailer Overview Top actor Ji Eun-ho hires ghostwriter Seo Jung-eun to write his autobiography. Eun-ho is tense, irritable and difficult to work with, but Jung-eun finds her assignment fascinating because Eun-ho claims he began acting not because he wanted to become a star but because he thought being in the limelight would help him find his first love, Ji Eun-dong. Eun-ho and Eun-dong's complicated romantic history has spanned two decades, and he's convinced that he can never love anyone else. As Jung-eun helps him remember Eun-dong and why he lost her, Eun-ho (whose birth name is Hyun Soo) looks back on his memories of her, from when he met when he was seventeen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joo Jin-Mo Ji Eun-Ho / Park Hyun-Soo Kim Sa-rang Seo Jung-Eun / Ji Eun-dong Kim Tae-hoon Choi Jae-Ho Kim Yoo-ri Seo-Ryeong Baek Sung-hyun Park Hyun-soo (27) Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of My Love Eun Dong premiered on May 29, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2014-10-13 Tomorrow's Cantabile 7.3  Facts Original Name  사랑하는 은동아 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://drama.jtbc.joins.com/eundonga/ Genres Drama Romance Keywords korea Content Score 93 Almost there... Top Contributors M 27 Maria180493 16 Elizabeth Jennings 10 Charles z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}