{"link": "https://www.themoviedb.org/tv/73028?language=en", "title": "The First Half of My Life", "resume": "A group of city dwellers who have to make choices about love and career. Based on Hong Kong novelist Yi Shu's novel of the same name.", "rate": 0, "genre": ["Soap", "Family", "Drama"], "cast": ["Jin Dong", "Yuan Quan", "Ma Yili"], "character": ["He Han", "Tang Jing", "Luo Zijun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73028   Expand The First Half of My Life   (2017) User Score Overview A group of city dwellers who have to make choices about love and career. Based on Hong Kong novelist Yi Shu's novel of the same name. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jin Dong He Han Yuan Quan Tang Jing Ma Yili Luo Zijun Full Cast & Crew Last Season Season 1 2017 | 42 Episodes Season 1 of The First Half of My Life premiered on July  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The First Half of My Life. You can help by rating TV shows you've seen. Facts Original Name  我的前半生 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Soap Family Drama Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors l 40 lovejohncn 9 Elizabeth Jennings h 6 hujianhang2996 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}