{"link": "https://www.themoviedb.org/tv/602?language=en", "title": "Love on a Rooftop", "resume": "Love on a Rooftop was an American sitcom about a newlywed couple, Dave and Julie Willis, and their humorous struggles to survive in San Francisco on Dave's apprentice architect's salary of $85.37 a week. Matters were complicated by the fact that Julie's rich father did not approve of their less than luxurious lifestyle and often took it upon himself to try to improve it, much to Dave's chagrin.\nThe series was produced by Screen Gems, the production company behind shows such as Gidget, Bewitched, and I Dream of Jeannie. It premiered on September 6, 1966 on ABC and stars Pete Duel, credited at the time as Peter Deuel, and Judy Carne in the leads. Also in the regular cast were Rich Little and Barbara Bostock as the Willis’ neighbors, and Herb Voland and Edith Atwater as Julie's parents. All thirty episodes of the series were filmed in color.", "rate": 0, "genre": ["Comedy"], "cast": ["Pete Duel", "Judy Carne"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 602   Expand Love on a Rooftop   (1966) User Score Overview Love on a Rooftop was an American sitcom about a newlywed couple, Dave and Julie Willis, and their humorous struggles to survive in San Francisco on Dave's apprentice architect's salary of $85.37 a week. Matters were complicated by the fact that Julie's rich father did not approve of their less than luxurious lifestyle and often took it upon himself to try to improve it, much to Dave's chagrin. The series was produced by Screen Gems, the production company behind shows such as Gidget, Bewitched, and I Dream of Jeannie. It premiered on September 6, 1966 on ABC and stars Pete Duel, credited at the time as Peter Deuel, and Judy Carne in the leads. Also in the regular cast were Rich Little and Barbara Bostock as the Willis’ neighbors, and Herb Voland and Edith Atwater as Julie's parents. All thirty episodes of the series were filmed in color. Featured Crew Bernard Slade Creator Harry Ackerman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pete Duel Judy Carne Full Cast & Crew Last Season Season 1 1966 | 32 Episodes Season 1 of Love on a Rooftop premiered on September  6, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love on a Rooftop. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}