{"link": "https://www.themoviedb.org/tv/45875?language=en", "title": "Projectorparishilton", "resume": "Projectorparishilton - was a Russian satirical show aired on the Channel One. The first episode was aired on 17 May 2008.\nFour hosts discuss some current news and comment on different issues in politics and economics, similar to 7 Tage, 7 Köpfe. The show's name is a reference to the 80s TV program \"Прожектор Перестройки\" - a program that was discussing current events on Soviet television during the times of Perestroika - and American socialite Paris Hilton, who, according to Svetlakov, symbolizes lack of taste. Thus, the name of the show implies that this is a current events program that shouldn't be taken seriously.\nThe four hosts usually discuss interesting news from newspapers, journals and the internet. From time to time they also answer questions from the audience. The show usually ends with the hosts performing a well-known song. In most cases the song is connected to an event. The show is half improvised.\nThe show aired until June 2012, when most hosts have switched to hosts on shows airing on competiting channels.", "rate": 30, "genre": ["News", "Comedy"], "cast": ["Sergey Svetlakov", "Ivan Urgant", "Garik Martirosyan", "Aleksandr Tsekalo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45875   Expand Projectorparishilton   (2008) User Score Overview Projectorparishilton - was a Russian satirical show aired on the Channel One. The first episode was aired on 17 May 2008. Four hosts discuss some current news and comment on different issues in politics and economics, similar to 7 Tage, 7 Köpfe. The show's name is a reference to the 80s TV program \"Прожектор Перестройки\" - a program that was discussing current events on Soviet television during the times of Perestroika - and American socialite Paris Hilton, who, according to Svetlakov, symbolizes lack of taste. Thus, the name of the show implies that this is a current events program that shouldn't be taken seriously. The four hosts usually discuss interesting news from newspapers, journals and the internet. From time to time they also answer questions from the audience. The show usually ends with the hosts performing a well-known song. In most cases the song is connected to an event. The show is half improvised. The show aired until June 2012, when most hosts have switched to hosts on shows airing on competiting channels. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sergey Svetlakov Ivan Urgant Garik Martirosyan Aleksandr Tsekalo Full Cast & Crew  Create Episode Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Projectorparishilton. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Projectorparishilton. You can help by rating TV shows you've seen. Facts Original Name  Прожекторперисхилтон Status  Returning Series Network Certification  - Type  Scripted Original Language  Russian Runtime  35m Homepage   http://www.1tv.ru/shows/prozhektorperishilton Genres News Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 17 West@ 4 veinard 1 Mark Gubarenko 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}