{"link": "https://www.themoviedb.org/tv/69051?language=en", "title": "Best Lover", "resume": "Best Couple's background is set in modern day Korean entertainment industry. The story is about two top stars entering into a fake marriage with their own secret agendas, and through their efforts to defend their fake marriage in public, they learn about about each other's pains and weaknesses and eventually end up together. The male lead comes from a poor background and through hard work becomes a top star. He finds himself emotionally involved with his first love, fake wife and admirer. The female lead comes from a chaebol family and is an arrogant top star. She is neglected by her parents and due to a family feud/conspiracy, she must act strong in order to survive even though she is weak at times. Through a fake marriage, these two people find true love and their true selves.", "rate": 100, "genre": ["Drama"], "cast": ["Kim Seo Ra", "jia zheng yu", "Zhou Mi", "Park Kwang-hyun", "Lee Da-hae"], "character": ["Hee Sung's Mother", "Paparazzi hired to follow Hee Sung", "Hee Sung / Yan Xie Cheng", "Jin Yong Jian", "Choi Hwan Yeong / Ye Huan Ying"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69051   Expand Best Lover   (2016) User Score  Play Trailer Overview Best Couple's background is set in modern day Korean entertainment industry. The story is about two top stars entering into a fake marriage with their own secret agendas, and through their efforts to defend their fake marriage in public, they learn about about each other's pains and weaknesses and eventually end up together. The male lead comes from a poor background and through hard work becomes a top star. He finds himself emotionally involved with his first love, fake wife and admirer. The female lead comes from a chaebol family and is an arrogant top star. She is neglected by her parents and due to a family feud/conspiracy, she must act strong in order to survive even though she is weak at times. Through a fake marriage, these two people find true love and their true selves. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Seo Ra Hee Sung's Mother jia zheng yu Paparazzi hired to follow Hee Sung Zhou Mi Hee Sung / Yan Xie Cheng Park Kwang-hyun Jin Yong Jian Lee Da-hae Choi Hwan Yeong / Ye Huan Ying Full Cast & Crew Last Season Season 1 2016 | 1 Episode Season 1 of Best Lover premiered on November 14, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Best Lover. You can help by rating TV shows you've seen. Facts Original Name  最佳情侣 Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  35m Homepage   http://mdl.farsidrama.in/15792-best-lover Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors l 14 lakposht 12 mp4soju M 4 Maria180493 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}