{"link": "https://www.themoviedb.org/tv/899?language=en", "title": "The Wallflower", "resume": "The Wallflower is a manga series written by Tomoko Hayakawa. The individual chapters have been serialized in Bessatsu Friend since its premiere in 2000, and in 31 tankōbon volumes in Japan by Kodansha. The series was licensed for an English language release in North America by Del Rey Manga and in Singapore by Chuang Yi, under the name My Fair Lady.\nNippon Animation adapted part of the manga series into a twenty-five episode anime series which aired on TV Tokyo and TV Aichi from October 3, 2006 through March 27, 2007. The anime adaptation has been licensed for Region 1 release by A.D. Vision, who paid $500,000. In 2008, The WallFlower became one of over 30 ADV titles whose North American rights were transferred to Funimation Entertainment.", "rate": 60, "genre": ["Animation", "Drama", "Comedy", "Drama"], "cast": ["Showtaro Morikubo", "Hirofumi Nojima", "Yukiko Takaguchi", "Yuuya Yamauchi", "Tomokazu Sugita"], "character": ["Kyohei Takano", "Ranmaru Morii", "Sunako Nakahara", "Yukinojoh Tohyama", "Takenaga Oda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 899   Expand The Wallflower   (2006) User Score Overview The Wallflower is a manga series written by Tomoko Hayakawa. The individual chapters have been serialized in Bessatsu Friend since its premiere in 2000, and in 31 tankōbon volumes in Japan by Kodansha. The series was licensed for an English language release in North America by Del Rey Manga and in Singapore by Chuang Yi, under the name My Fair Lady. Nippon Animation adapted part of the manga series into a twenty-five episode anime series which aired on TV Tokyo and TV Aichi from October 3, 2006 through March 27, 2007. The anime adaptation has been licensed for Region 1 release by A.D. Vision, who paid $500,000. In 2008, The WallFlower became one of over 30 ADV titles whose North American rights were transferred to Funimation Entertainment. Featured Crew Shinichi Watanabe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Showtaro Morikubo Kyohei Takano Hirofumi Nojima Ranmaru Morii Yukiko Takaguchi Sunako Nakahara Yuuya Yamauchi Yukinojoh Tohyama Tomokazu Sugita Takenaga Oda Full Cast & Crew Last Season Season 1 2006 | 25 Episodes Season 1 of The Wallflower premiered on October  3, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Wallflower. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.tv-tokyo.co.jp/anime/yamanade/ Genres Animation Drama Comedy Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 2 sol_vector  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}