{"link": "https://www.themoviedb.org/tv/62067?language=en", "title": "Run, Jang Mi", "resume": "Jang Mi is a woman with a warm personality which makes her kind to everyone. She is 26-years-old and a graduate student majoring in culinary arts. She was brought up in a wealthy family, but loses everything one day when her father passes away. Jang Mi's life changes completely after her father's death. While Jang-Mi struggles to make a living, she meets a man who is the grandson of a food company president and they become involved romantically.", "rate": 100, "genre": ["Family"], "cast": ["Go Joo Won", "Lee Young-ah", "Ryu Jin", "Jung Joon", "Yoon Joo-hee"], "character": ["Hwang Tae Ja", "Baek Jang Mi", "Jang Joon Hyuk", "Kang Min Chul", "Kang Min Joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62067   Expand Run, Jang Mi   (2014) User Score  Play Trailer Overview Jang Mi is a woman with a warm personality which makes her kind to everyone. She is 26-years-old and a graduate student majoring in culinary arts. She was brought up in a wealthy family, but loses everything one day when her father passes away. Jang Mi's life changes completely after her father's death. While Jang-Mi struggles to make a living, she meets a man who is the grandson of a food company president and they become involved romantically. Featured Crew Hong Chang-wook Creator Kim Yeong-in Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Go Joo Won Hwang Tae Ja Lee Young-ah Baek Jang Mi Ryu Jin Jang Joon Hyuk Jung Joon Kang Min Chul Yoon Joo-hee Kang Min Joo Full Cast & Crew Last Season Season 1 2014 | 123 Episodes Season 1 of Run, Jang Mi premiered on December 15, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Run, Jang Mi. You can help by rating TV shows you've seen. Facts Original Name  달려라 장미 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000005967 Genres Family Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors s 86 sheva_vitali 6 Elizabeth Jennings 3 Zlogorek 2 Jernanne Gavancha  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}