{"link": "https://www.themoviedb.org/tv/66440?language=en", "title": "Working Mom Parenting Daddy", "resume": "Kim Jae Min is a sweet husband who will do anything for his wife Lee Mi So. Mi So has a bright personality, but she learns that she is pregnant with their second child. Even with just one child, she has a hard time raising their child and working. Kim Jae Min decides to submit for a maternity leave at his work and begin to raise their child and do house chores.", "rate": 53, "genre": ["Family", "Drama", "Comedy"], "cast": ["Park Gun-hyung", "Hong Eun Hee", "Shin Eun-jung", "Gong Jeong-hwan", "Go Na-Hee"], "character": ["Kim Jae-Min", "Lee Mi-So", "Yoon Jung-Hyun", "Park Hyuk-Ki", "Park Eun-Sol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66440   Expand Working Mom Parenting Daddy   (2016) User Score Overview Kim Jae Min is a sweet husband who will do anything for his wife Lee Mi So. Mi So has a bright personality, but she learns that she is pregnant with their second child. Even with just one child, she has a hard time raising their child and working. Kim Jae Min decides to submit for a maternity leave at his work and begin to raise their child and do house chores. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Gun-hyung Kim Jae-Min Hong Eun Hee Lee Mi-So Shin Eun-jung Yoon Jung-Hyun Gong Jeong-hwan Park Hyuk-Ki Go Na-Hee Park Eun-Sol Full Cast & Crew Last Season Season 1 2016 | 50 Episodes Season 1 of Working Mom Parenting Daddy premiered on May  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Working Mom Parenting Daddy. You can help by rating TV shows you've seen. Facts Original Name  워킹 맘 육아 대디 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  40m Homepage   http://www.imbc.com/broad/tv/drama/momdad/index.html Genres Family Drama Comedy Keywords korea Content Score 71 Just a little bit more... Top Contributors t 36 tmdb38202327 M 2 Maria180493 R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}