{"link": "https://www.themoviedb.org/tv/60995?language=en", "title": "Spinsters vs Casanovas", "resume": "Three girls have intimate former classmates that continue onto University. Trying to separate the learning processes and goals in life, they find a difficult task. Honey likes a guy more than a friend! Because maple and Polynesian caught girlfriend secretly love to have a mistress (Gig). Trying to open their eyes, open their minds, honey, finds out the truth. But honey instead of angry friends Three girls fight Goliath Minority dig the former blew feel attacked as well. The trio decided to wear Converse, despite the different ways it's sad, but intolerant build walls in the grave.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Tridsadee Sahawong", "Sunsia Jett", "Lek Teeradetch", "Rinlanee Sripen", "Witaya Wasukraipaisarn"], "character": ["Peesadut Soamphan (Pete)", "Pinattha Pattimawanwipha (Nampeung)", "Kritsada (Krit)", "Methawalai Wongyanyon (Maple)", "Wayuboot (Wayu)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60995   Expand Spinsters vs Casanovas   (2014) User Score  Play Trailer Overview Three girls have intimate former classmates that continue onto University. Trying to separate the learning processes and goals in life, they find a difficult task. Honey likes a guy more than a friend! Because maple and Polynesian caught girlfriend secretly love to have a mistress (Gig). Trying to open their eyes, open their minds, honey, finds out the truth. But honey instead of angry friends Three girls fight Goliath Minority dig the former blew feel attacked as well. The trio decided to wear Converse, despite the different ways it's sad, but intolerant build walls in the grave. Featured Crew Adun Bunpbut Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tridsadee Sahawong Peesadut Soamphan (Pete) Sunsia Jett Pinattha Pattimawanwipha (Nampeung) Lek Teeradetch Kritsada (Krit) Rinlanee Sripen Methawalai Wongyanyon (Maple) Witaya Wasukraipaisarn Wayuboot (Wayu) Full Cast & Crew Last Season Season 1 2014 | 14 Episodes Season 1 of Spinsters vs Casanovas premiered on April 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Spinsters vs Casanovas. You can help by rating TV shows you've seen. Facts Original Name  ก๊วนคานทองกับแก๊งพ่อปลาไหล Status  Returning Series Networks - Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 51 Crip 13 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}