{"link": "https://www.themoviedb.org/tv/70532?language=en", "title": "Traces of the Hand", "resume": "Is there an app to help you get the woman you love?\nKim Hong Sik is a shy young man who returns to college after serving his mandatory military service. He discovers an app called T-Scope that helps him to see other people’s secret messages. Can he use it to help him capture the heart of the “Queen of the Engineering College”, whom he has secretly loved for years?", "rate": 0, "genre": ["Comedy"], "cast": ["Ryu Hwa-Young", "Shin Jae-Ha"], "character": ["Jang Min-Young", "Kim Hong-Sik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70532   Expand Traces of the Hand   (2017) User Score Overview Is there an app to help you get the woman you love? Kim Hong Sik is a shy young man who returns to college after serving his mandatory military service. He discovers an app called T-Scope that helps him to see other people’s secret messages. Can he use it to help him capture the heart of the “Queen of the Engineering College”, whom he has secretly loved for years? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryu Hwa-Young Jang Min-Young Shin Jae-Ha Kim Hong-Sik Full Cast & Crew Last Season Season 1 2017 | 17 Episodes Season 1 of Traces of the Hand premiered on February 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Traces of the Hand. You can help by rating TV shows you've seen. Facts Original Name  손의 흔적 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  7m Homepage  - Genres Comedy Keywords based on comic romance korea web series Content Score 56 We're so close, yet so far. Top Contributors M 29 Maria180493 TB 2 TMDb Bot R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}