{"link": "https://www.themoviedb.org/tv/76343?language=en", "title": "Homo Digitalis", "resume": "Will there come a point when our brain stops thinking without a computer? When we consider digital sex better than the real thing? And turn our body into a machine? We are living in the midst of an upheaval that could be more radical than anything our parents or grandparents ever experienced. But what does it all mean for us as human beings? In seven episodes the protagonist Helen Fares goes on a journey through futuristic technologies. She meets virtual friends, learns to steer a drone with her brain and to hack her own DNA. Encounters with experts in the US, Japan and Britan provide context to the posed question: Are we evolving into a new species - the Homo Digitalis? Simultaneously Homo Digitalis is a scientific experiment. In a playful test either as chatbot or as website the user can find out his or her personal future.", "rate": 0, "genre": ["Documentary"], "cast": ["Helen Fares"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76343   Expand Homo Digitalis   (2017) User Score Overview Will there come a point when our brain stops thinking without a computer? When we consider digital sex better than the real thing? And turn our body into a machine? We are living in the midst of an upheaval that could be more radical than anything our parents or grandparents ever experienced. But what does it all mean for us as human beings? In seven episodes the protagonist Helen Fares goes on a journey through futuristic technologies. She meets virtual friends, learns to steer a drone with her brain and to hack her own DNA. Encounters with experts in the US, Japan and Britan provide context to the posed question: Are we evolving into a new species - the Homo Digitalis? Simultaneously Homo Digitalis is a scientific experiment. In a playful test either as chatbot or as website the user can find out his or her personal future. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Helen Fares Full Cast & Crew Current Season Season 1 2017 | 7 Episodes Season 1 of Homo Digitalis premiered on October 17, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Homo Digitalis. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Homo Digitalis. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Documentary Original Language  German Runtime  9m Homepage   https://www.arte.tv/homodigitalis Genres Documentary Keywords future Content Score 56 We're so close, yet so far. Top Contributors G 58 Gedoc 5 Greisberger Christophe TB 2 TMDb Bot 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}