{"link": "https://www.themoviedb.org/tv/72993?language=en", "title": "Hidden Singer", "resume": "Hidden Singer is a South Korean entertainment TV program broadcast on JTBC. The mechanics are a famous singer and several impersonators of the singer. Each person sings one measure of a song behind the blinds for four rounds. In the first three rounds, an audience of 100 people vote on the person who they think is not the real singer. In the final round, the audience votes on who they think is the real singer. The program is hosted by Jun Hyun-moo.", "rate": 0, "genre": [], "cast": ["Jeon Hyun-moo"], "character": ["MC"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72993   Expand Hidden Singer   (2012) User Score Overview Hidden Singer is a South Korean entertainment TV program broadcast on JTBC. The mechanics are a famous singer and several impersonators of the singer. Each person sings one measure of a song behind the blinds for four rounds. In the first three rounds, an audience of 100 people vote on the person who they think is not the real singer. In the final round, the audience votes on who they think is the real singer. The program is hosted by Jun Hyun-moo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeon Hyun-moo MC Full Cast & Crew Current Season Season 5 2018 | 3 Episodes Season 5 of Hidden Singer premiered on June 17, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hidden Singer. You can help by rating TV shows you've seen. Facts Original Name  히든 싱어 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  120m Homepage   http://enter.jtbc.co.kr/hiddensinger Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 13 koreacpv 10 AppleTorrent k 4 khyungil s 3 stom7714  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}