{"link": "https://www.themoviedb.org/tv/77729?language=en", "title": "Cutie Honey Universe", "resume": "Honey Kisaragi is an amazingly humanlike and fashion conscious android with the unique ability to transform her body into a wide range of outrageous yet stylish disguises, each of which comes with its own dazzling super ability. After a run-in with a sinister secret criminal cabal organization, Panther Claw, the luscious and law-abiding Honey makes it her mission to bring them down.", "rate": 0, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77729   Expand Cutie Honey Universe   (2018) User Score  Play Trailer Overview Honey Kisaragi is an amazingly humanlike and fashion conscious android with the unique ability to transform her body into a wide range of outrageous yet stylish disguises, each of which comes with its own dazzling super ability. After a run-in with a sinister secret criminal cabal organization, Panther Claw, the luscious and law-abiding Honey makes it her mission to bring them down. Featured Crew Natsuko Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Cutie Honey Universe premiered on April  8, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Cutie Honey Universe. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cutie Honey Universe. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://cutiehoney-u.com/ Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 10 Sergiojamon 7 sp1ti 6 YabukiJoe1 5 Despair-Paradise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}