{"link": "https://www.themoviedb.org/tv/60896?language=en", "title": "Out With Dad", "resume": "Here we have a look into the life of a teenage girl along with her single father. The two share a close relationship. Rose is coming of age, coming out of the closet, and hoping to avoid having a spotlight put on her life. Her dad, Nathan, is struggling to help. Maybe he’s even pushing her out?\nExploring themes of love and orientation, Out With Dad is a tender look at growing up regardless of your age, experience, or sexuality.", "rate": 80, "genre": ["Drama"], "cast": ["Kate Conway", "Will Conlon", "Corey Lof", "Caitlynne Medrek", "Lindsey Middleton"], "character": ["Rose", "Nathan", "Kenny", "Claire", "Vanessa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60896   Expand Out With Dad   (2010) User Score Overview Here we have a look into the life of a teenage girl along with her single father. The two share a close relationship. Rose is coming of age, coming out of the closet, and hoping to avoid having a spotlight put on her life. Her dad, Nathan, is struggling to help. Maybe he’s even pushing her out? Exploring themes of love and orientation, Out With Dad is a tender look at growing up regardless of your age, experience, or sexuality. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Conway Rose Will Conlon Nathan Corey Lof Kenny Caitlynne Medrek Claire Lindsey Middleton Vanessa Full Cast & Crew Last Season Season 3 2013 | 22 Episodes Season 3 of Out With Dad premiered on December  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Out With Dad. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://www.outwithdad.com/ Genres Drama Keywords coming out high school lesbian homosexuality single father Content Score 86 Almost there... Top Contributors 45 Elizabeth Jennings 4 thelword  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}