{"link": "https://www.themoviedb.org/tv/14213?language=en", "title": "Popular Mechanics for Kids", "resume": "Popular Mechanics for Kids is an educational Canadian television series based on Popular Mechanics magazine. It was notable for starting the careers of both Elisha Cuthbert and Jay Baruchel. The show's purpose was to teach viewers how things work. It was awarded the Parents Choice Award in 2003, and was nominated for the Gemini Awards.\nThe series aired from 1997 to 2001, and re-runs of the show continued to air on many channels until 2008. It aired on BBC Kids and Discovery Kids until December 31, 2009. After the closure of Discovery Kids Canada, BBC Kids stopped airing re-runs in all countries except Canada. The reruns on BBC Kids in Canada ended on May 14, 2011. As of 2013 re-runs of the show continue to air on Knowledge Network. Along with Cuthbert and Baruchel, the cast included Charles Powell nicknamed \"Charlie\" for the series, Tyler Kyte, and eventually Vanessa Lengies.\nThe show was filmed primarily in Montreal, Quebec, and is currently distributed on VHS / DVD by Koch Vision.", "rate": 100, "genre": ["Documentary", "Family", "Kids"], "cast": ["Elisha Cuthbert", "Tyler Kyte", "Charles Powell", "Jay Baruchel", "Vanessa Lengies"], "character": ["Elisha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14213   Expand Popular Mechanics for Kids   (1997) User Score Overview Popular Mechanics for Kids is an educational Canadian television series based on Popular Mechanics magazine. It was notable for starting the careers of both Elisha Cuthbert and Jay Baruchel. The show's purpose was to teach viewers how things work. It was awarded the Parents Choice Award in 2003, and was nominated for the Gemini Awards. The series aired from 1997 to 2001, and re-runs of the show continued to air on many channels until 2008. It aired on BBC Kids and Discovery Kids until December 31, 2009. After the closure of Discovery Kids Canada, BBC Kids stopped airing re-runs in all countries except Canada. The reruns on BBC Kids in Canada ended on May 14, 2011. As of 2013 re-runs of the show continue to air on Knowledge Network. Along with Cuthbert and Baruchel, the cast included Charles Powell nicknamed \"Charlie\" for the series, Tyler Kyte, and eventually Vanessa Lengies. The show was filmed primarily in Montreal, Quebec, and is currently distributed on VHS / DVD by Koch Vision. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elisha Cuthbert Elisha Tyler Kyte Charles Powell Jay Baruchel Vanessa Lengies Full Cast & Crew Last Season Season 4 2001 | 6 Episodes Season 4 of Popular Mechanics for Kids premiered on January  7, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Popular Mechanics for Kids. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Documentary Family Kids Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 10 brown.rjb75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}