{"link": "https://www.themoviedb.org/tv/34415?language=en", "title": "The Killing", "resume": "The Killing is an American crime drama television series based upon the Danish television series Forbrydelsen. Set in Seattle, Washington, the series follows the various murder investigations by homicide detectives Sarah Linden and Stephen Holder.", "rate": 76, "genre": ["Drama", "Crime"], "cast": ["Mireille Enos", "Joel Kinnaman", "Gregg Henry", "Joan Allen", "Tyler Ross"], "character": ["Sarah Linden", "Stephen Holder", "Carl Reddick", "Margaret O'Neal", "Kyle Stansbury"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34415   Expand The Killing   (2011) User Score Overview The Killing is an American crime drama television series based upon the Danish television series Forbrydelsen. Set in Seattle, Washington, the series follows the various murder investigations by homicide detectives Sarah Linden and Stephen Holder. Featured Crew Veena Sud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  21 Posters  18 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mireille Enos Sarah Linden Joel Kinnaman Stephen Holder Gregg Henry Carl Reddick Joan Allen Margaret O'Neal Tyler Ross Kyle Stansbury Full Cast & Crew Last Season Season 4 2014 | 6 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply First 2 Seasons were TV at its finest Open 0 by Iceflamez\n      \n     Finale Open 1 by  Phat Bobby Go to Discussions Media Most Popular Videos  0 Backdrops  21 Posters  18 Recommendations   2013-03-04 Broadchurch 8.1    2013-05-12 The Fall 7.6    2010-05-04 Luther 7.9    2007-07-19 Mad Men 8.0    2014-04-29 Happy Valley 7.7    2013-07-10 The Bridge 6.3    2014-01-12 True Detective 8.1    2012-03-01 Awake 7.3  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  59m, 45m, 42m, 55m Homepage   http://www.amctv.com/shows/the-killing Genres Drama Crime Keywords seattle female protagonist police detective female detective murder investigation child murder murder mystery Content Score 100 Yes! Looking good! Top Contributors 28 Travis Bell 20 Elizabeth Jennings 14 Canadagraphs 10 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}