{"link": "https://www.themoviedb.org/tv/67325?language=en", "title": "Ai no Kusabi", "resume": "On planet Amoi, a great society has developed, creating a computerized city called Tanagura, ruled by supercomputer Jupiter. The populace is almost entirely male and is based on hair color; silver and/or blonds are the elitist, ending with dark/black haired as the bottom of society, often known as \"mongrels\". Blondies keep \"pets\", young boys kept for a few years, especially made for performing sexual actions for the Blondie's voyeurism entertainment. Blondies aren't suppose to keep pets for long or interact sexually with pets, but one blondie named Iason Mink has kept a pet named Rikki, for years and is rumored to sleep with him. Iason refuses to let go of Rikki, even with Jupiter's disapproval. Rikki fights with his emotions and society problems, unable to decide what to do about his old friend/lover Gai (Guy) and their gang. Iason is obsessed with keeping Rikki, and Rikki doesn't know what to do; fight against him or surrender to him.", "rate": 62, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kaneto Shiozawa", "Toshihiko Seki", "Hideyuki Hori", "Hideyuki Tanaka", "Kōji Tsujitani"], "character": ["Isaon Mink (voice)", "Riki (voice)", "Sid (voice)", "Katze (voice)", "Gai (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67325   Expand Ai no Kusabi   (1992) User Score Overview On planet Amoi, a great society has developed, creating a computerized city called Tanagura, ruled by supercomputer Jupiter. The populace is almost entirely male and is based on hair color; silver and/or blonds are the elitist, ending with dark/black haired as the bottom of society, often known as \"mongrels\". Blondies keep \"pets\", young boys kept for a few years, especially made for performing sexual actions for the Blondie's voyeurism entertainment. Blondies aren't suppose to keep pets for long or interact sexually with pets, but one blondie named Iason Mink has kept a pet named Rikki, for years and is rumored to sleep with him. Iason refuses to let go of Rikki, even with Jupiter's disapproval. Rikki fights with his emotions and society problems, unable to decide what to do about his old friend/lover Gai (Guy) and their gang. Iason is obsessed with keeping Rikki, and Rikki doesn't know what to do; fight against him or surrender to him. Featured Crew Rieko Yoshihara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaneto Shiozawa Isaon Mink (voice) Toshihiko Seki Riki (voice) Hideyuki Hori Sid (voice) Hideyuki Tanaka Katze (voice) Kōji Tsujitani Gai (voice) Full Cast & Crew Last Season Season 1 1992 | 2 Episodes Season 1 of Ai no Kusabi premiered on August 31, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2011-04-09 Sekaiichi Hatsukoi 5.3    2012-01-18 Ai no Kusabi 6.7    2005-05-30 The Life and Times of Juniper Lee 4.2  Facts Original Name  間の楔 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Animation Drama Sci-Fi & Fantasy Keywords exploitation men bdsm caste system yaoi Content Score 79 Pump it up! We're close now. Top Contributors t 29 tmdb983464 L 7 Law TB 2 TMDb Bot 1 Sekhmet_03  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}