{"link": "https://www.themoviedb.org/tv/35520?language=en", "title": "Hobitit", "resume": "Hobitit is a Finnish live action fantasy television miniseries originally broadcast in 1993 on Yle TV1. Produced by Olof Qvickström, it is based on the events of the books The Hobbit and The Lord of the Rings by J. R. R. Tolkien.\nThe series was written and directed by Timo Torikka. Toni Edelmann composed the soundtrack. Hobitit featured nine episodes of 30 minutes runtime that were aired from 29 March to 24 May 1993. Filming locations included the Ryhmäteatteri theatre in Helsinki and Yle's production facilities.", "rate": 50, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Taneli Mäkelä", "Pertti Sveholm", "Jarmo Hyttinen", "Jari Pehkonen", "Vesa Vierikko"], "character": ["Frodo", "Sam", "Merry", "Pippin", "Gandalf"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35520   Expand Hobitit   (1993) User Score Overview Hobitit is a Finnish live action fantasy television miniseries originally broadcast in 1993 on Yle TV1. Produced by Olof Qvickström, it is based on the events of the books The Hobbit and The Lord of the Rings by J. R. R. Tolkien. The series was written and directed by Timo Torikka. Toni Edelmann composed the soundtrack. Hobitit featured nine episodes of 30 minutes runtime that were aired from 29 March to 24 May 1993. Filming locations included the Ryhmäteatteri theatre in Helsinki and Yle's production facilities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Taneli Mäkelä Frodo Pertti Sveholm Sam Jarmo Hyttinen Merry Jari Pehkonen Pippin Vesa Vierikko Gandalf Full Cast & Crew Last Season Hobitit 1993 | 9 Episodes Season 1 of Hobitit premiered on March 29, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hobitit. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Finnish Runtime  30m Homepage   https://yle.fi/aihe/artikkeli/2015/06/23/taru-sormusten-herrasta-suomenlinnassa Genres Drama Sci-Fi & Fantasy Keywords middle-earth (tolkien) hobbit Content Score 86 Almost there... Top Contributors 24 BryGur 15 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}