{"link": "https://www.themoviedb.org/tv/910?language=en", "title": "As the World Turns", "resume": "As the World Turns is an American television soap opera that aired on CBS from April 2, 1956 to September 17, 2010. Irna Phillips created As the World Turns as a sister show to her other soap opera The Guiding Light. Running for 54 years, As the World Turns holds the second-longest continuous run of any daytime network soap opera in American history, surpassed only by Guiding Light. As the World Turns was produced in New York City for all of its time.\nSet in the fictional town of Oakdale, Illinois, the show debuted on April 2, 1956, at 1:30 pm EST. Prior to that date, all serials had been fifteen minutes in length. As the World Turns and The Edge of Night, which premiered on the same day at 4:30 pm EST, were the first two to be thirty minutes in length from their premiere. At first, viewers did not respond to the new half-hour serial, but ratings picked up in its second year, eventually reaching the top spot in the daytime Nielsen ratings by fall 1958. In 1959, the show started a streak of weekly ratings wins that would not be interrupted for over twelve years. The show switched to color on August 21, 1967, and expanded from a half-hour in length to one hour starting on December 1, 1975 when The Edge of Night moved to ABC. In the year-to-date ratings, As the World Turns was the most-watched daytime drama from 1958 until 1978, with ten million viewers tuning in each day. At its height, core actors such as Helen Wagner, Don MacLaughlin, Don Hastings, and Eileen Fulton became nationally known. Three of these actors – Wagner, Hastings, and Fulton – are also the three longest serving actors in the history of American soap operas.", "rate": 75, "genre": ["Soap"], "cast": ["Betty Garde"], "character": ["Miss Tyler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 910   Expand As the World Turns   (1956) User Score Overview As the World Turns is an American television soap opera that aired on CBS from April 2, 1956 to September 17, 2010. Irna Phillips created As the World Turns as a sister show to her other soap opera The Guiding Light. Running for 54 years, As the World Turns holds the second-longest continuous run of any daytime network soap opera in American history, surpassed only by Guiding Light. As the World Turns was produced in New York City for all of its time. Set in the fictional town of Oakdale, Illinois, the show debuted on April 2, 1956, at 1:30 pm EST. Prior to that date, all serials had been fifteen minutes in length. As the World Turns and The Edge of Night, which premiered on the same day at 4:30 pm EST, were the first two to be thirty minutes in length from their premiere. At first, viewers did not respond to the new half-hour serial, but ratings picked up in its second year, eventually reaching the top spot in the daytime Nielsen ratings by fall 1958. In 1959, the show started a streak of weekly ratings wins that would not be interrupted for over twelve years. The show switched to color on August 21, 1967, and expanded from a half-hour in length to one hour starting on December 1, 1975 when The Edge of Night moved to ABC. In the year-to-date ratings, As the World Turns was the most-watched daytime drama from 1958 until 1978, with ten million viewers tuning in each day. At its height, core actors such as Helen Wagner, Don MacLaughlin, Don Hastings, and Eileen Fulton became nationally known. Three of these actors – Wagner, Hastings, and Fulton – are also the three longest serving actors in the history of American soap operas. Featured Crew Irna Phillips Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Betty Garde Miss Tyler Full Cast & Crew Last Season Season 3 1958 | 1 Episode Season 3 of As the World Turns premiered on January  1, 1958. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on As the World Turns. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cbs.com/daytime/atwt/ Genres Soap Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 8 Steve 5 Zlogorek s 2 speedycars S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}