{"link": "https://www.themoviedb.org/tv/60814?language=en", "title": "Blade and Soul", "resume": "Blade and Soul adalah anime yang diadaptasi dari MMORPG Korea, Blade anda Soul. Aruka adalah seorang pembunuh dari Klan Tsurugi. Dia sedang mencari seorang wanita benama Jin Valel, yang membunuh gurunya Hon.  Jin adalah seorang wanita iblis yang menguasai energi kekacauan  dan membunuh tanpa ampun, tak seperti Aruka yang mempelajari teknik membunuh hanya untuk melakukan pekerjaannya sebagai seorang pembunuh.", "rate": 85, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Takao Yuki", "Ayahi Takagaki", "Sayaka Ohara", "Aoi Yuki"], "character": ["Aruka", "Dan Roana", "El Karen", "Jin Varel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60814   Expand Blade and Soul   (2014) User Score Overview Blade and Soul adalah anime yang diadaptasi dari MMORPG Korea, Blade anda Soul. Aruka adalah seorang pembunuh dari Klan Tsurugi. Dia sedang mencari seorang wanita benama Jin Valel, yang membunuh gurunya Hon.  Jin adalah seorang wanita iblis yang menguasai energi kekacauan  dan membunuh tanpa ampun, tak seperti Aruka yang mempelajari teknik membunuh hanya untuk melakukan pekerjaannya sebagai seorang pembunuh. Featured Crew Hiroshi Takeuchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takao Yuki Aruka Ayahi Takagaki Dan Roana Sayaka Ohara El Karen Aoi Yuki Jin Varel Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Blade and Soul premiered on April  3, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blade and Soul. You can help by rating TV shows you've seen. Facts Original Name  ブレイドアンドソウル Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords fantasy ecchi anime Content Score 93 Almost there... Top Contributors 28 benf45 21 Dreydor 13 Elizabeth Jennings CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}