{"link": "https://www.themoviedb.org/tv/70026?language=en", "title": "Love, Just Come", "resume": "From when she was young, Qing Ling grew up in an orphanage. She is a kind, cheerful and helpful girl with a perfect sense of smell. Due to her sensitivity to smells, she started to develop perfume. Qing Ling's dream is to create a perfume to pay back the orphanage and help society. In order to realize this dream, Qing Ling persevered through all sorts of adversity. While chasing her dream, she received Xu Qinglun, Duan Tian Lang, Duan Yi Hua and others help. With Duan Tian Lang, they went from friends to lovers. During this period, she also found her family and reconnected with them. After experiencing lots of frustration, she finally, with her own effort and everyone's help, produced her own perfume brand, realized her dream and obtained love.", "rate": 0, "genre": [], "cast": ["aiqi liang", "Jiang Kaitong", "Lee Wei", "Han Dong", "Wang Wei"], "character": ["Su Nan", "Mu Qing Ling", "Ding Hai", "Duan Tian Lang", "Ju Shan Shan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70026   Expand Love, Just Come   (2017) User Score Overview From when she was young, Qing Ling grew up in an orphanage. She is a kind, cheerful and helpful girl with a perfect sense of smell. Due to her sensitivity to smells, she started to develop perfume. Qing Ling's dream is to create a perfume to pay back the orphanage and help society. In order to realize this dream, Qing Ling persevered through all sorts of adversity. While chasing her dream, she received Xu Qinglun, Duan Tian Lang, Duan Yi Hua and others help. With Duan Tian Lang, they went from friends to lovers. During this period, she also found her family and reconnected with them. After experiencing lots of frustration, she finally, with her own effort and everyone's help, produced her own perfume brand, realized her dream and obtained love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast aiqi liang Su Nan Jiang Kaitong Mu Qing Ling Lee Wei Ding Hai Han Dong Duan Tian Lang Wang Wei Ju Shan Shan Full Cast & Crew Last Season Season 1 2017 | 29 Episodes Season 1 of Love, Just Come premiered on January 30, 2017. View All Seasons Social Reviews  1 Discussions  0 l A review by lakposht Written by  lakposht  on May 20, 2017 After finishing this show I had to take a deep breath and watch something else before I could write this review. I was so upset that I had spent the last few hours watching such a bad show. If you're familiar with C-Drama's then you understand that they commonly recycle the same cliches. This show used every cliche EVER! I don't want to spoil anything, but just understand that I'm not exaggerating Read All Reviews Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love, Just Come. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors l 12 lakposht 9 empireyura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}