{"link": "https://www.themoviedb.org/tv/34807?language=en", "title": "Hyper Police", "resume": "Hyper Police is the name of a manga and anime series created by Minoru Tachikawa under the pseudonym MEE. It is a comic science fiction, set in a period in the far future, in which humanity is almost extinct and most of the population are monsters. It is mostly set in the offices of a private police company and focuses on the life of Natsuki Sasahara, a young catgirl, and her co-workers: Foxgirl Sakura Bokuseiinmonzeninari, werewolf Batanen Fujioka and his cousin Tomy Fujioka.\nFor many years, the only western language to have official translations of the Hyper Police manga was Spanish. English translations have been completed by US company Tokyopop.", "rate": 0, "genre": ["Animation"], "cast": ["Ryuzou Ishino", "Chiyako Shibahara", "Yuko Miyamura", "Akio Otsuka", "Kōichi Tōchika"], "character": ["Tommy Fujioka", "Sakura Bokuseiinmonzeninari", "Natsuki Sasahara", "Batanen Fujioka", "Bob"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34807   Expand Hyper Police   (1997) User Score Overview Hyper Police is the name of a manga and anime series created by Minoru Tachikawa under the pseudonym MEE. It is a comic science fiction, set in a period in the far future, in which humanity is almost extinct and most of the population are monsters. It is mostly set in the offices of a private police company and focuses on the life of Natsuki Sasahara, a young catgirl, and her co-workers: Foxgirl Sakura Bokuseiinmonzeninari, werewolf Batanen Fujioka and his cousin Tomy Fujioka. For many years, the only western language to have official translations of the Hyper Police manga was Spanish. English translations have been completed by US company Tokyopop. Featured Crew Mee (minoru Tachikawa) Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryuzou Ishino Tommy Fujioka Chiyako Shibahara Sakura Bokuseiinmonzeninari Yuko Miyamura Natsuki Sasahara Akio Otsuka Batanen Fujioka Kōichi Tōchika Bob Full Cast & Crew Last Season Season 1 1997 | 25 Episodes Season 1 of Hyper Police premiered on April  3, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hyper Police. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 5 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}