{"link": "https://www.themoviedb.org/tv/62655?language=en", "title": "Raskens", "resume": "The year is 1872. After being to drunk the stooge Gustaf Karlsson hits his master. To avoid sentence he enlists to the army and get the name Rask. He meet his future wife and we then get to follow his life together with his wife and their children in the 19th century Småland (Sweden). Their subsistence features happiness, but also by horrible tragedies.", "rate": 75, "genre": ["Drama"], "cast": ["Sven Wollter", "Gurie Nordwall", "Viveka Seldahl", "Martin Berggren", "Evert Lindkvist"], "character": ["Gustaf Karlsson (Rask)", "Ida", "Nergårds-Anna", "Johan Klang", "Oskar Olsson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62655   Expand Raskens   (1976) User Score Overview The year is 1872. After being to drunk the stooge Gustaf Karlsson hits his master. To avoid sentence he enlists to the army and get the name Rask. He meet his future wife and we then get to follow his life together with his wife and their children in the 19th century Småland (Sweden). Their subsistence features happiness, but also by horrible tragedies. Featured Crew Vilhelm Moberg Creator Per Sjöstrand Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sven Wollter Gustaf Karlsson (Rask) Gurie Nordwall Ida Viveka Seldahl Nergårds-Anna Martin Berggren Johan Klang Evert Lindkvist Oskar Olsson Full Cast & Crew Last Season Season 1 1976 | 8 Episodes Season 1 of Raskens premiered on January 21, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Raskens. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Swedish Runtime  60m Homepage  - Genres Drama Keywords 19th century Content Score 79 Pump it up! We're close now. Top Contributors t 53 themechanic a 3 anders.jonsson 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}