{"link": "https://www.themoviedb.org/tv/52972?language=en", "title": "Temptation of the Roses", "resume": "Noon Woranuch and ‘Aum’ Patcharapa Chaichue’s comedy slash revenge lakorn “Kulap Neua Mek (Roses Above the Clouds or Temptations of the roses)” is premiering this coming Monday, December 21, 2009 and I’m hyped. In the lakorn, Noon and Aum play two former bosom buddies who turn into foes. Noon plays Oranut, a wealthy young woman who betrayed her friend Airin by kicking her out of the magazine company (”Working Women”) they started together and Alin’s fiance for her younger sister. Airin was so devastated after the betrayal, she vowed to bring down Oranut’s magazine company and to steal Oranut’s man if she was dating someone. Airin starts up the “Chic Women” magazine to compete with Oranut’s “Working Women” magazine and pursues Anawin, the guy that Oranut knew since college.", "rate": 100, "genre": ["Drama", "Soap"], "cast": ["Pachrapa Chaichua", "Tasit Sinkanawiwat", "Woranuch Bhirompakdee", "Namwaan Kannaporn", "Natalie Chiaravanond"], "character": ["Irin", "Anawin/Khun Cafe", "Oranuch", "Ornnich", "Lerlux"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52972   Expand Temptation of the Roses   (2010) User Score  Play Trailer Overview Noon Woranuch and ‘Aum’ Patcharapa Chaichue’s comedy slash revenge lakorn “Kulap Neua Mek (Roses Above the Clouds or Temptations of the roses)” is premiering this coming Monday, December 21, 2009 and I’m hyped. In the lakorn, Noon and Aum play two former bosom buddies who turn into foes. Noon plays Oranut, a wealthy young woman who betrayed her friend Airin by kicking her out of the magazine company (”Working Women”) they started together and Alin’s fiance for her younger sister. Airin was so devastated after the betrayal, she vowed to bring down Oranut’s magazine company and to steal Oranut’s man if she was dating someone. Airin starts up the “Chic Women” magazine to compete with Oranut’s “Working Women” magazine and pursues Anawin, the guy that Oranut knew since college.  Featured Crew DaraVDO Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pachrapa Chaichua Irin Tasit Sinkanawiwat Anawin/Khun Cafe Woranuch Bhirompakdee Oranuch Namwaan Kannaporn Ornnich Natalie Chiaravanond Lerlux Full Cast & Crew Last Season Season 1 2010 | 16 Episodes Season 1 of Temptation of the Roses premiered on February  9, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Temptation of the Roses. You can help by rating TV shows you've seen. Facts Original Name  กุหลาบเหนือเมฆ Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  78m Homepage   http://www.ch7.com/ Genres Drama Soap Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 36 Crip 4 Elizabeth Jennings 3 mariilakorn97 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}