{"link": "https://www.themoviedb.org/tv/11145?language=en", "title": "Intervention", "resume": "People whose uncontrollable addiction to drugs, alcohol or compulsive behavior has brought them to the brink of destruction and has devastated their family and friends are presented with a life-changing opportunity of intervention and rehab. Each addict must confront their darkest demons in order to begin their journey to recovery in the hopes that they can turn their lives around before it’s too late.", "rate": 68, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11145   Expand Intervention   (2005) User Score  Play Trailer Overview People whose uncontrollable addiction to drugs, alcohol or compulsive behavior has brought them to the brink of destruction and has devastated their family and friends are presented with a life-changing opportunity of intervention and rehab. Each addict must confront their darkest demons in order to begin their journey to recovery in the hopes that they can turn their lives around before it’s too late. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 19 2018 | 9 Episodes Season 19 of Intervention premiered on January  2, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply New season Open 5 by  genplant29 Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2000-05-15 Secrets of the Dead 7.3    1988-01-19 48 Hours 7.3    2014-03-11 Chrisley Knows Best 6.6    2009-08-24 Hoarders 6.2    2004-06-03 The First 48 7.6    2015-07-09 Glitch 6.6  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  43m Homepage   http://www.aetv.com/intervention Genres Documentary Keywords addiction intervention Content Score 64 We're so close, yet so far. Top Contributors b 12 basher 11 Banana 3 Elizabeth Jennings EL 3 Erica L Thompson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}