{"link": "https://www.themoviedb.org/tv/34841?language=en", "title": "ジバクくん", "resume": "Jibaku-kun: Twelve World Story is a 1999 manga and anime series by Ami Shibata. The anime series ran for a single season of 26 episodes, due to it receiving poor ratings in Japan, but was nevertheless broadcast in the United States and a few countries of Latin America. In some markets the series is known as Bucky: The Incredible Kid, Bucky: Searching for world 0 or simply Bucky. In the early 2000's, the series was broadcast in Brazil where it became a huge and unexplainable success if compared to the reception it received in other countries.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Hiroshi Kamiya", "Akira Ishida", "Yuu Asakawa", "Masaharu Sato", "Tomoko Kawakami"], "character": ["Kai", "Baku", "Alibaba", "Jibaku Ou", "Pink"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34841   Expand ジバクくん   (1999) User Score Overview Jibaku-kun: Twelve World Story is a 1999 manga and anime series by Ami Shibata. The anime series ran for a single season of 26 episodes, due to it receiving poor ratings in Japan, but was nevertheless broadcast in the United States and a few countries of Latin America. In some markets the series is known as Bucky: The Incredible Kid, Bucky: Searching for world 0 or simply Bucky. In the early 2000's, the series was broadcast in Brazil where it became a huge and unexplainable success if compared to the reception it received in other countries. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroshi Kamiya Kai Akira Ishida Baku Yuu Asakawa Alibaba Masaharu Sato Jibaku Ou Tomoko Kawakami Pink Full Cast & Crew Last Season Bucky the incredible kid season 1 1999 | 26 Episodes Season 1 of ジバクくん premiered on October  5, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on ジバクくん. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors NS 12 Norte Serra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}