{"link": "https://www.themoviedb.org/tv/37290?language=en", "title": "Il Commissario Montalbano", "resume": "Inspector Montalbano is an Italian television series produced and broadcast by RAI since 1999, based on the detective novels of Andrea Camilleri. The protagonist is Commissario Salvo Montalbano, and the stories are set in the imaginary town of Vigata, Sicily. In 2012 the series generated a prequel, Il giovane Montalbano.", "rate": 79, "genre": ["Action", "Adventure", "Crime"], "cast": ["Luca Zingaretti", "Giacinto Ferro", "Cesare Bocci", "Peppino Mazzotta", "Carmela Gentile"], "character": ["Salvo Montalbano", "Bonetti-Alderighi", "Domenico \"Mimì\" Augello", "Giuseppe Fazio", "Beatrice \"Beba\" Di Leo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37290   Expand Il Commissario Montalbano   (1999) User Score Overview Inspector Montalbano is an Italian television series produced and broadcast by RAI since 1999, based on the detective novels of Andrea Camilleri. The protagonist is Commissario Salvo Montalbano, and the stories are set in the imaginary town of Vigata, Sicily. In 2012 the series generated a prequel, Il giovane Montalbano. Featured Crew Andrea Camilleri Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luca Zingaretti Salvo Montalbano Giacinto Ferro Bonetti-Alderighi Cesare Bocci Domenico \"Mimì\" Augello Peppino Mazzotta Giuseppe Fazio Carmela Gentile Beatrice \"Beba\" Di Leo Full Cast & Crew Current Season Season 12 2018 | 2 Episodes Season 12 of Il Commissario Montalbano premiered on February 12, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Salvo's house Open 0 by bratface\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  8 Recommendations   2012-02-23 The Young Montalbano 8.0    2000-07-01 Don Matteo 4.6    2007-04-16 Boris 8.8    2004-02-24 Hustle 7.9  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  Italian Runtime  100m, 110m, 90m Homepage  - Genres Action & Adventure Crime Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 22 squinza 14 VeryStrangeFish a 14 angelked L 12 Lomo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}