{"link": "https://www.themoviedb.org/tv/2026?language=en", "title": "Judging Amy", "resume": "Judging Amy is an American television drama that was telecast from September 19, 1999, through May 3, 2005, on CBS-TV. This TV series starred Amy Brenneman and Tyne Daly. Its main character is a judge who serves in a family court, and in addition to the family-related cases that she adjudicates, many episodes of the show focus on her own experiences as a divorced mother, and on the experiences of her mother, a social worker who works in the field of child welfare. This series was based on the life experiences of Brenneman's mother.", "rate": 71, "genre": ["Drama"], "cast": ["Amy Brenneman", "Dan Futterman", "Richard T. Jones", "Marcus Giamatti", "Tyne Daly"], "character": ["Amy Gray", "Vincent Gray", "Maxine Gray"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2026   Expand Judging Amy   (1999) User Score Overview Judging Amy is an American television drama that was telecast from September 19, 1999, through May 3, 2005, on CBS-TV. This TV series starred Amy Brenneman and Tyne Daly. Its main character is a judge who serves in a family court, and in addition to the family-related cases that she adjudicates, many episodes of the show focus on her own experiences as a divorced mother, and on the experiences of her mother, a social worker who works in the field of child welfare. This series was based on the life experiences of Brenneman's mother. Featured Crew Amy Brenneman Creator Bill D'Elia Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amy Brenneman Amy Gray Dan Futterman Vincent Gray Richard T. Jones Marcus Giamatti Tyne Daly Maxine Gray Full Cast & Crew Last Season Season 6 2004 | 22 Episodes Season 6 of Judging Amy premiered on September 28, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1988-11-14 Murphy Brown 6.5    1991-05-11 Sisters 6.7    1992-07-08 Melrose Place 4.9    1996-02-11 Ballykissangel 6.2    2009-09-08 Melrose Place 3.7    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1994-09-21 Touched by an Angel 5.3    1994-09-12 Party of Five 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords judge single mother female judge simpler life Content Score 93 Almost there... Top Contributors 11 Banana z 10 zurman1 m 7 mode2 PS 4 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}