{"link": "https://www.themoviedb.org/tv/73129?language=en", "title": "Eroge! H mo Game mo Kaihatsu Zanmai", "resume": "The erotic game company Flower is in danger of being closed because their first two games have not sold very well. For their third game Tomoya Mochizuki, an erotic game connoisseur, has been hired to teach the all female staff of Flower a thing or two about eroticism.", "rate": 100, "genre": [], "cast": ["Mei Misonoo", "Nozomi Yoneshima", "Yukina Fujimori", "Yukari Hirayama", "Maki Kobayashi"], "character": ["Momoka Fujiwara", "Kisara Himeno", "Nene Sonono", "Remon Aizawa", "Iori Kosaka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73129   Expand Eroge! H mo Game mo Kaihatsu Zanmai   (2011) User Score Overview The erotic game company Flower is in danger of being closed because their first two games have not sold very well. For their third game Tomoya Mochizuki, an erotic game connoisseur, has been hired to teach the all female staff of Flower a thing or two about eroticism. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mei Misonoo Momoka Fujiwara Nozomi Yoneshima Kisara Himeno Yukina Fujimori Nene Sonono Yukari Hirayama Remon Aizawa Maki Kobayashi Iori Kosaka Full Cast & Crew Last Season Season 1 2011 | 6 Episodes Season 1 of Eroge! H mo Game mo Kaihatsu Zanmai premiered on August 26, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Eroge! H mo Game mo Kaihatsu Zanmai. You can help by rating TV shows you've seen. Facts Original Name  えろげー! ~Hもゲームも開発三昧~ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres No genres have been added. Keywords hentai Content Score 64 We're so close, yet so far. Top Contributors d 20 dtago1234 9 Deku2k 4 Elizabeth Jennings 3 perruno  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}