{"link": "https://www.themoviedb.org/tv/12333?language=en", "title": "Gravion", "resume": "Gravion is an anime television series produced by Gonzo. It aired in Japan from October 7, 2002 to December 16, 2002 and ran for 13 episodes. In 2004, Gravion Zwei was released and aired from January 8 to March 25 in Japan, running for twelve additional episodes, answering the questions generated from the first series.\nBoth Gravion and Gravion Zwei are created and directed by Masami Ōbari with mecha designs from Kunio Okawara. Both series were released in the United States by ADV Films.", "rate": 0, "genre": ["Animation", "Comedy", "Action", "Adventure"], "cast": ["Kenichi Suzumura", "Hikaru Midorikawa", "Haruna Ikezawa", "Houko Kuwashima", "Sho Hayami"], "character": ["Eiji Shigure", "Raven", "Luna Gusuku", "Leele", "Klein Sandman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12333   Expand Gravion   (2002) User Score Overview Gravion is an anime television series produced by Gonzo. It aired in Japan from October 7, 2002 to December 16, 2002 and ran for 13 episodes. In 2004, Gravion Zwei was released and aired from January 8 to March 25 in Japan, running for twelve additional episodes, answering the questions generated from the first series. Both Gravion and Gravion Zwei are created and directed by Masami Ōbari with mecha designs from Kunio Okawara. Both series were released in the United States by ADV Films. Featured Crew Masami Ôbari Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenichi Suzumura Eiji Shigure Hikaru Midorikawa Raven Haruna Ikezawa Luna Gusuku Houko Kuwashima Leele Sho Hayami Klein Sandman Full Cast & Crew Last Season Season 2 2004 | 12 Episodes Season 2 of Gravion premiered on January  8, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Gravion. You can help by rating TV shows you've seen. Facts Original Name  超重神グラヴィオン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 12 BrerFox m 3 magoozin 2 SWFT 1 Irresponsibletyler  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}