{"link": "https://www.themoviedb.org/tv/68411?language=en", "title": "Cutie Honey", "resume": "One day, Honey Kisaragi's a trendy, class-cutting Catholic schoolgirl. The next, her father's been murdered by demonic divas from a dastardly organization called Panther Claw. When his dying message reveals that she's an android, Honey uses the transformative power of the Atmospheric Element Solidifier - the very thing Panther Claw wanted to steal - to seek revenge against the shadowy clan.", "rate": 70, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure"], "cast": ["Eiko Masuyama", "Kousei Tomita", "Katsuji Mori"], "character": ["Honey Kisaragi (voice)", "Dambei Hayami (voice)", "Seiji Hayami (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68411   Expand Cutie Honey   (1973) User Score Overview One day, Honey Kisaragi's a trendy, class-cutting Catholic schoolgirl. The next, her father's been murdered by demonic divas from a dastardly organization called Panther Claw. When his dying message reveals that she's an android, Honey uses the transformative power of the Atmospheric Element Solidifier - the very thing Panther Claw wanted to steal - to seek revenge against the shadowy clan. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eiko Masuyama Honey Kisaragi (voice) Kousei Tomita Dambei Hayami (voice) Katsuji Mori Seiji Hayami (voice) Full Cast & Crew Last Season Season 1 1973 | 25 Episodes Season 1 of Cutie Honey premiered on October 13, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Cutie Honey. You can help by rating TV shows you've seen. Facts Original Name  キューティーハニー Status  Ended Network NET Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.toei-anim.co.jp/lineup/tv/honey/ Genres Sci-Fi & Fantasy Animation Action & Adventure Keywords based on manga school life ecchi magical girl shounen anime female lead Content Score 43 There's no 'I' in team... Top Contributors 59 Marr 🇳🇱 33 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}