{"link": "https://www.themoviedb.org/tv/38811?language=en", "title": "Dragon Crisis!", "resume": "Dragon Crisis! is a Japanese light novel series by Kaya Kizaki, with illustrations by Itsuki Akata. As of April 2011, thirteen volumes have been published by Shueisha under their Super Dash Bunko imprint. An anime adaptation by Studio Deen aired in 2011.", "rate": 50, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Rie Kugimiya"], "character": ["Rose"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38811   Expand Dragon Crisis!   (2011) User Score Overview Dragon Crisis! is a Japanese light novel series by Kaya Kizaki, with illustrations by Itsuki Akata. As of April 2011, thirteen volumes have been published by Shueisha under their Super Dash Bunko imprint. An anime adaptation by Studio Deen aired in 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rie Kugimiya Rose Full Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of Dragon Crisis! premiered on January 11, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dragon Crisis!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 5 yoshizuka s 3 sheva_vitali m 3 magoozin 2 Oriknox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}