{"link": "https://www.themoviedb.org/tv/41926?language=en", "title": "A Thousand Days' Promise", "resume": "A Thousand Days' Promise is a 2011 South Korean traditional melodrama about a woman who is losing her memory and the loving man who stands by her side. Written by famed drama writer Kim Soo-hyun, it aired on SBS from October 17 to December 20, 2011 on Mondays and Tuesdays at 21:55 for 20 episodes.", "rate": 75, "genre": ["Drama"], "cast": ["Kim Rae-Won", "Soo-Ae", "Moon Jeong-hee", "Lee Sang-woo", "Jung Yu-mi"], "character": ["Park Ji-Hyung", "Lee Seo-yeon", "Jang Myung-hee", "Jang Jae-Min", "No Hyang-Ki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41926   Expand A Thousand Days' Promise   (2011) User Score Overview A Thousand Days' Promise is a 2011 South Korean traditional melodrama about a woman who is losing her memory and the loving man who stands by her side. Written by famed drama writer Kim Soo-hyun, it aired on SBS from October 17 to December 20, 2011 on Mondays and Tuesdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Rae-Won Park Ji-Hyung Soo-Ae Lee Seo-yeon Moon Jeong-hee Jang Myung-hee Lee Sang-woo Jang Jae-Min Jung Yu-mi No Hyang-Ki Full Cast & Crew Last Season Season 1 2011 | 20 Episodes Season 1 of A Thousand Days' Promise premiered on October 17, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on A Thousand Days' Promise. You can help by rating TV shows you've seen. Facts Original Name  천일의 약속 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://tv.sbs.co.kr/1000day/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 8 Nightowl.Kr V 6 Violsa 3 lareina123 A 2 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}