{"link": "https://www.themoviedb.org/tv/10299?language=en", "title": "Beverly Hills Teens", "resume": "Beverly Hills Teens is an animated children's television program which debuted in 1987, animated by DIC Entertainment. The namesake teenagers have exaggerated wealth, and face stereotypical teenage concerns. They represent a variety of European backgrounds. There are sixty-five episodes all in one season, each thirty minutes long. The original title song was performed in both the English and French versions by Valérie Barouille. The show originally aired in first-run syndication in the United States.\nIn 1989, Beverly Hills Teens was nominated for the Young Artist award for Best Animated Series. In the same year, the show was syndicated by Claster Television as part of a package featuring Maxie's World and the non-DIC series It's Punky Brewster.\nThe French dub is known as BéCéBéGé, or sometimes Le Club BCBG, a title derived from the acronym BCBG, which stands for \"bon chic, bon genre\". It aired on Antenne 2 in 1988.", "rate": 0, "genre": ["Animation"], "cast": ["Hadley Kay", "Jonathan Potts", "Sean Roberge", "Terri Hawkes", "Corrine Koslo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10299   Expand Beverly Hills Teens   (1987) User Score Overview Beverly Hills Teens is an animated children's television program which debuted in 1987, animated by DIC Entertainment. The namesake teenagers have exaggerated wealth, and face stereotypical teenage concerns. They represent a variety of European backgrounds. There are sixty-five episodes all in one season, each thirty minutes long. The original title song was performed in both the English and French versions by Valérie Barouille. The show originally aired in first-run syndication in the United States. In 1989, Beverly Hills Teens was nominated for the Young Artist award for Best Animated Series. In the same year, the show was syndicated by Claster Television as part of a package featuring Maxie's World and the non-DIC series It's Punky Brewster. The French dub is known as BéCéBéGé, or sometimes Le Club BCBG, a title derived from the acronym BCBG, which stands for \"bon chic, bon genre\". It aired on Antenne 2 in 1988. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hadley Kay Jonathan Potts Sean Roberge Terri Hawkes Corrine Koslo Full Cast & Crew Last Season Season 1 1987 | 65 Episodes Season 1 of Beverly Hills Teens premiered on September 19, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Beverly Hills Teens. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}