{"link": "https://www.themoviedb.org/tv/14775?language=en", "title": "450, Chemin du Golf", "resume": "450 Chemin du Golf is a Quebec French language sitcom currently airing on TQS. The show revolves around how a suburban neighbourhood is turned upside-down when someone new moves into the area. The series stars François Massicotte, a well-known Québécois comedian. The title of the show refers to the 450 area code that is used for most of the suburbs off the island of Montreal. It has been met with negative reviews.\nIn 2003, the show was denied funding from the Canadian Television Fund.", "rate": 0, "genre": ["Comedy"], "cast": ["François Massicotte", "Claude Legault", "Sylvain Marcel ", "Sandra Dumaresq"], "character": ["François", "Alex", "Sylvain", "Dorianne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14775   Expand 450, Chemin du Golf   (2003) User Score Overview 450 Chemin du Golf is a Quebec French language sitcom currently airing on TQS. The show revolves around how a suburban neighbourhood is turned upside-down when someone new moves into the area. The series stars François Massicotte, a well-known Québécois comedian. The title of the show refers to the 450 area code that is used for most of the suburbs off the island of Montreal. It has been met with negative reviews. In 2003, the show was denied funding from the Canadian Television Fund. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast François Massicotte François Claude Legault Alex Sylvain Marcel  Sylvain Sandra Dumaresq Dorianne Full Cast & Crew Last Season Season 1 — | 25 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 450, Chemin du Golf. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  French Runtime  30m Homepage  - Genres Comedy Keywords quebec Content Score 86 Almost there... Top Contributors 30 Banana b 1 bouddhadplatre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}