{"link": "https://www.themoviedb.org/tv/61492?language=en", "title": "Kun Pee Tee Rak", "resume": "The story of Pii a young soul suffering from amnesia. Pii has a need need to seek the help of \"Holy Water Students\", people who sees ghosts; unfortunaltely his fear of the Holy Water group is not helping his cause. The formation of a bond between P and the group mean he must deal with Kamin, evil spirits trying to pump his soul to increase its own power. Fortunately, there is are Angels abe to to assist.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Saran Sirilak", "Pimchanok Leuwisetpaiboon", "วีรคณิศร์ วัฒนกานต์กุล", "ภัทรานิษฐ์ วิริยะบำรุงกิจ", "นัทธินันท์ กุมชพร"], "character": ["Pii/พีระ/พีท", "น้ำมนต์", "อัฐชัย", "พิมพ์ดาว", "ลูกโป่ง"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61492   Expand Kun Pee Tee Rak   (2014) User Score  Play Trailer Overview The story of Pii a young soul suffering from amnesia. Pii has a need need to seek the help of \"Holy Water Students\", people who sees ghosts; unfortunaltely his fear of the Holy Water group is not helping his cause. The formation of a bond between P and the group mean he must deal with Kamin, evil spirits trying to pump his soul to increase its own power. Fortunately, there is are Angels abe to to assist. Featured Crew Tageak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saran Sirilak Pii/พีระ/พีท Pimchanok Leuwisetpaiboon น้ำมนต์ วีรคณิศร์ วัฒนกานต์กุล อัฐชัย ภัทรานิษฐ์ วิริยะบำรุงกิจ พิมพ์ดาว นัทธินันท์ กุมชพร ลูกโป่ง Full Cast & Crew Last Season Season 1 2014 | 15 Episodes Season 1 of Kun Pee Tee Rak premiered on August 20, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kun Pee Tee Rak. You can help by rating TV shows you've seen. Facts Original Name  คุณผีที่รัก Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  95m Homepage   http://drama.ch7.com/detail/82602/%E0%B8%84%E0%B8%B8%E0%B8%93%E0%B8%9C%E0%B8%B5%E0%B8%97%E0%B8%B5%E0%B9%88%E0%B8%A3%E0%B8%B1%E0%B8%81.html Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 35 Crip TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}