{"link": "https://www.themoviedb.org/tv/5165?language=en", "title": "Blue Murder", "resume": "Blue Murder is a two-part Australian television miniseries produced by the Australian Broadcasting Corporation in 1995 and is based on true events.\nGiven its confronting content, the DVD release was classified MA 15+. An injunction brought during Arthur \"Neddy\" Smith's appeal against his life sentence saw its broadcast delayed in New South Wales and the Australian Capital Territory for six years, until 2001. In New Zealand the DVD release was classified R 18+ for graphic violence and offensive language.\nSet in the 1970s and 1980s in Sydney, the miniseries concerns the relationship between controversial former Detective Roger \"the Dodger\" Rogerson and notorious criminal Arthur \"Neddy\" Smith. Rogerson and his colleagues were accused of giving Smith a \"green light\" to commit crimes without Police interference, with the relationship fraying when Rogerson orders hitman Christopher \"Mr. Rent-a-Kill\" Flannery to murder Police Officer Michael Drury. The murder of prostitute Sallie-Anne Huckstepp also features.\nBlue Murder is narrated by the characters of Rogerson, Smith and Drury and focuses on the corruption allegations that plagued the NSW Police Force at the time. Rogerson and Smith achieved a kind of celebrity status during the Wood Royal Commission into Police corruption.", "rate": 80, "genre": ["Drama"], "cast": ["Steve Bastoni", "Bill Hunter", "Richard Roxburgh", "Tony Martin", "Peter Phelps"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5165   Expand Blue Murder   (1995) User Score Overview Blue Murder is a two-part Australian television miniseries produced by the Australian Broadcasting Corporation in 1995 and is based on true events. Given its confronting content, the DVD release was classified MA 15+. An injunction brought during Arthur \"Neddy\" Smith's appeal against his life sentence saw its broadcast delayed in New South Wales and the Australian Capital Territory for six years, until 2001. In New Zealand the DVD release was classified R 18+ for graphic violence and offensive language. Set in the 1970s and 1980s in Sydney, the miniseries concerns the relationship between controversial former Detective Roger \"the Dodger\" Rogerson and notorious criminal Arthur \"Neddy\" Smith. Rogerson and his colleagues were accused of giving Smith a \"green light\" to commit crimes without Police interference, with the relationship fraying when Rogerson orders hitman Christopher \"Mr. Rent-a-Kill\" Flannery to murder Police Officer Michael Drury. The murder of prostitute Sallie-Anne Huckstepp also features. Blue Murder is narrated by the characters of Rogerson, Smith and Drury and focuses on the corruption allegations that plagued the NSW Police Force at the time. Rogerson and Smith achieved a kind of celebrity status during the Wood Royal Commission into Police corruption. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Bastoni Bill Hunter Richard Roxburgh Tony Martin Peter Phelps Full Cast & Crew Last Season Season 1 — | 2 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Blue Murder. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords sydney organized crime police corruption miniseries 1980s Content Score 86 Almost there... Top Contributors 8 Banana 3 OzDrDj  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}