{"link": "https://www.themoviedb.org/tv/62291?language=en", "title": "Ultimate Airport Dubai", "resume": "Less than 55 years ago, Dubai International Airport was a vast desert of sand.\nToday, it is a modern mecca of international air travel.\nWith a staggering 344,000 flights, 57 million passengers and 2 million tons of cargo flying in and out each year, it is the worlds third busiest airport for international passengers.\nIn Ultimate Airport Dubai, step behind-the-scenes of Dubai Internationals three massive terminals, including Terminal 3 the largest building on earth by floor space, measuring 359 football pitches in size!\nWith unprecedented access to all facets of this mega facility, the series follows some of the 60,000 staff working hard to keep it safe, secure, and on schedule.", "rate": 70, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62291   Expand Ultimate Airport Dubai   (2013) User Score Overview Less than 55 years ago, Dubai International Airport was a vast desert of sand. Today, it is a modern mecca of international air travel. With a staggering 344,000 flights, 57 million passengers and 2 million tons of cargo flying in and out each year, it is the worlds third busiest airport for international passengers. In Ultimate Airport Dubai, step behind-the-scenes of Dubai Internationals three massive terminals, including Terminal 3 the largest building on earth by floor space, measuring 359 football pitches in size! With unprecedented access to all facets of this mega facility, the series follows some of the 60,000 staff working hard to keep it safe, secure, and on schedule. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Series 2 2014 | 10 Episodes Season 2 of Ultimate Airport Dubai premiered on October 29, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ultimate Airport Dubai. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  45m Homepage  - Genres Documentary Keywords ultimate airport Content Score 56 We're so close, yet so far. Top Contributors 24 dualchart 5 Elizabeth Jennings m 3 michl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}