{"link": "https://www.themoviedb.org/tv/2490?language=en", "title": "The IT Crowd", "resume": "UK Comedy series about two I.T. nerds and their clueless female manager, who work in the basement of a very successful company. When they are called on for help, they are never treated with any respect at all.", "rate": 82, "genre": ["Comedy"], "cast": ["Chris O'Dowd", "Richard Ayoade", "Katherine Parkinson", "Matt Berry"], "character": ["Roy Trenneman", "Maurice Moss", "Jen Barber", "Douglas Reynholm"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2490   Expand The IT Crowd   (2006) User Score  Play Trailer Overview UK Comedy series about two I.T. nerds and their clueless female manager, who work in the basement of a very successful company. When they are called on for help, they are never treated with any respect at all. Featured Crew Graham Linehan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  19 Posters  20 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris O'Dowd Roy Trenneman Richard Ayoade Maurice Moss Katherine Parkinson Jen Barber Matt Berry Douglas Reynholm Full Cast & Crew Last Season Season 4 2010 | 6 Episodes Season 4 of The IT Crowd premiered on June 25, 2010. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Did you see that ludicrous display last night? Open 0 by lmao7\n      \n     t What was that number, again? Open 1 by  lmao7 Go to Discussions Media Most Popular Videos  1 Backdrops  19 Posters  20 Recommendations   2000-09-29 Black Books 8.1    2009-09-17 Community 7.9    2003-11-02 Arrested Development 8.2    1999-09-24 Spaced 8.1    2001-07-09 The Office 8.1    2001-10-02 Scrubs 7.7    1999-03-28 Futurama 8.2    2006-10-11 30 Rock 7.1  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  22m, 30m, 25m Homepage   http://www.channel4.com/entertainment/tv/microsites/I/itcrowd/ Genres Comedy Keywords computer office nerd geek computer nerd sitcom it british humour workplace comedy Content Score 100 Yes! Looking good! Top Contributors W 35 WadeWilson 31 Banana 17 Elizabeth Jennings E 16 Elky  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}