{"link": "https://www.themoviedb.org/tv/6?language=en", "title": "Strange Days at Blake Holsey High", "resume": "Black Hole High is a Canadian science fiction television program which first aired in North America in October 2002 on NBC and Discovery Kids. It is set at the fictional boarding school of the title, where a Science Club investigates mysterious phenomena, most of which is centered around a wormhole located on the school grounds. Spanning four seasons, the series developed into a success, and has been sold to networks around the globe.\nCreated by Jim Rapsas, the series intertwines elements of mystery, drama, romance, and comedy. The writing of the show is structured around various scientific principles, with emotional and academic struggles combined with unfolding mysteries of a preternatural nature. In addition to its consistent popularity among children, it has been recognised by adults as strong family entertainment. Forty-two episodes of the series, each roughly twenty-five minutes in length, have been produced, the last three of which premiered in January 2006. Those three final episodes that aired were combined into a film, Strange Days: Conclusions. The show was filmed at the Auchmar Estate on the Hamilton Escarpment in Hamilton, Ontario.", "rate": 96, "genre": ["Mystery", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Shadia Simmons", "Robert Clark", "Michael Seater", "Noah Reid", "Lawrence Bayne"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6   Expand Strange Days at Blake Holsey High   (2002) User Score Overview Black Hole High is a Canadian science fiction television program which first aired in North America in October 2002 on NBC and Discovery Kids. It is set at the fictional boarding school of the title, where a Science Club investigates mysterious phenomena, most of which is centered around a wormhole located on the school grounds. Spanning four seasons, the series developed into a success, and has been sold to networks around the globe. Created by Jim Rapsas, the series intertwines elements of mystery, drama, romance, and comedy. The writing of the show is structured around various scientific principles, with emotional and academic struggles combined with unfolding mysteries of a preternatural nature. In addition to its consistent popularity among children, it has been recognised by adults as strong family entertainment. Forty-two episodes of the series, each roughly twenty-five minutes in length, have been produced, the last three of which premiered in January 2006. Those three final episodes that aired were combined into a film, Strange Days: Conclusions. The show was filmed at the Auchmar Estate on the Hamilton Escarpment in Hamilton, Ontario. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shadia Simmons Robert Clark Michael Seater Noah Reid Lawrence Bayne Full Cast & Crew Last Season Season 4 2006 | 3 Episodes Season 4 of Strange Days at Blake Holsey High premiered on January 28, 2006. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Great show! Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2005-01-09 Zoey 101 5.3    1996-09-27 Sabrina, the Teenage Witch 6.3    2009-05-19 Glee 5.9    2013-04-19 Hemlock Grove 6.4  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Mystery Sci-Fi & Fantasy Comedy Keywords high school boarding school teenager supernatural phenomena Content Score 86 Almost there... Top Contributors 14 Banana TB 2 TMDb Bot 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}