{"link": "https://www.themoviedb.org/tv/3878?language=en", "title": "The Naked Brothers Band", "resume": "The Naked Brothers Band is an American musical comedy series created by Polly Draper. The show depicts the daily lives of Draper's sons, who lead a fictional world-renowned rock band from New York City. As a mockumentary, the storyline is a hyperbole of their real lives, and the fictional presence of a camera is often acknowledged. Lead vocals and instrumentation are provided by the siblings; they wrote the lyrics themselves. The show stars Nat Wolff and Alex Wolff, who encounter conflicts with each other that are later omitted. Nat's fictional female admirer and real life preschool friends—including the guitarist who had no prior acquaintance with the family—feature as the band members, with the siblings' genuine father and Draper's husband as their accordion-playing dad and Draper's niece as the group's babysitter.\nThe series is a spin-off of Draper's 2005 film of the same name that was picked up by Nickelodeon, premiering in January 2007. Draper, star of Thirtysomething and her writings The Tic Code and Getting Into Heaven, is the executive producer of the series, and often writer and director. Albie Hecht, affiliated with Nickelodeon and founder of Spike TV, is the executive producer, under his Worldwide Biggies tag. Draper's husband Michael Wolff, of The Arsenio Hall Show fame, serves as the music supervisor and co-executive producer with Draper's brother Tim as the consulting producer.", "rate": 93, "genre": ["Documentary"], "cast": ["Nat Wolff", "Alex Wolff", "Allie DiMeco", "Thomas Batuello", "David Levi"], "character": ["Nat", "Alex", "Rosalina", "Thomas", "David"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3878   Expand The Naked Brothers Band   (2007) User Score  Play Trailer Overview The Naked Brothers Band is an American musical comedy series created by Polly Draper. The show depicts the daily lives of Draper's sons, who lead a fictional world-renowned rock band from New York City. As a mockumentary, the storyline is a hyperbole of their real lives, and the fictional presence of a camera is often acknowledged. Lead vocals and instrumentation are provided by the siblings; they wrote the lyrics themselves. The show stars Nat Wolff and Alex Wolff, who encounter conflicts with each other that are later omitted. Nat's fictional female admirer and real life preschool friends—including the guitarist who had no prior acquaintance with the family—feature as the band members, with the siblings' genuine father and Draper's husband as their accordion-playing dad and Draper's niece as the group's babysitter. The series is a spin-off of Draper's 2005 film of the same name that was picked up by Nickelodeon, premiering in January 2007. Draper, star of Thirtysomething and her writings The Tic Code and Getting Into Heaven, is the executive producer of the series, and often writer and director. Albie Hecht, affiliated with Nickelodeon and founder of Spike TV, is the executive producer, under his Worldwide Biggies tag. Draper's husband Michael Wolff, of The Arsenio Hall Show fame, serves as the music supervisor and co-executive producer with Draper's brother Tim as the consulting producer. Featured Crew Polly Draper Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nat Wolff Nat Alex Wolff Alex Allie DiMeco Rosalina Thomas Batuello Thomas David Levi David Full Cast & Crew Last Season Season 3 2008 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Naked Brothers Band. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://www.nick.com/nbb Genres Documentary Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors A 31 Aerykbacon s 3 speedycars w 2 wweamb c 2 cmpunkgts96  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}