{"link": "https://www.themoviedb.org/tv/4278?language=en", "title": "Friday Night Lights", "resume": "This award-winning drama series centers on life in Dillon, Texas, where high school football brings the community together -- and the drama of small town life threatens to tear it apart.", "rate": 79, "genre": ["Drama"], "cast": ["Kyle Chandler", "Connie Britton", "Aimee Teegarden", "Michael B. Jordan", "Jurnee Smollett"], "character": ["Eric Taylor", "Tami Taylor", "Julie Taylor", "Vince Howard", "Jess Merriweather"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4278   Expand Friday Night Lights   (2006) User Score  Play Trailer Overview This award-winning drama series centers on life in Dillon, Texas, where high school football brings the community together -- and the drama of small town life threatens to tear it apart. Featured Crew Brian Grazer Creator Peter Berg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  60 Posters  17 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kyle Chandler Eric Taylor Connie Britton Tami Taylor Aimee Teegarden Julie Taylor Michael B. Jordan Vince Howard Jurnee Smollett Jess Merriweather Full Cast & Crew Last Season Season 5 2010 | 13 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Another great series Open 1 by  JennyDarling w Jason Street: Happy Birthday Scott Porter! Open 1 by  AusFem Go to Discussions Media Most Popular Videos  1 Backdrops  60 Posters  17 Recommendations   2004-07-18 Entourage 7.1    2009-04-09 Southland 7.8    2004-09-22 Veronica Mars 7.8    2004-03-21 Deadwood 8.1    2001-06-03 Six Feet Under 8.2    1999-09-22 The West Wing 7.9    2007-07-24 Damages 7.2    2012-03-04 GCB 5.3  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/Friday_Night_Lights/ Genres Drama Keywords high school sport southern usa american football texas based on movie teen drama Content Score 100 Yes! Looking good! Top Contributors 81 Banana 13 United600 11 Elizabeth Jennings E 5 EightNine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}