{"link": "https://www.themoviedb.org/tv/14689?language=en", "title": "Clean House", "resume": "Clean House is a home makeover and interior design television show, originally broadcast in 2003 which has aired 9 seasons of programs on the Style Network. Currently hosted by Tempestt Bledsoe and formerly hosted by Niecy Nash, the show brings a four-person cleanup-and-renovation crew to the homes of families to clean up clutter.\nIn 2010, Nash announced that she would be leaving the series, though it will continue on without her. Her final episode aired on December 1, 2010. Later that month, the Style Network confirmed that former Cosby Show cast member Tempestt Bledsoe will take over as host. Her first episode aired on January 26, 2011. As of 2013, the show has believed to have been canceled due to low ratings after Nash's departure.", "rate": 70, "genre": [], "cast": ["Michael Moloney", "Kellie Shanygne Williams", "Lisa Arch", "Trish Suhr", "Tempestt Bledsoe"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14689   Expand Clean House   (2003) User Score Overview Clean House is a home makeover and interior design television show, originally broadcast in 2003 which has aired 9 seasons of programs on the Style Network. Currently hosted by Tempestt Bledsoe and formerly hosted by Niecy Nash, the show brings a four-person cleanup-and-renovation crew to the homes of families to clean up clutter. In 2010, Nash announced that she would be leaving the series, though it will continue on without her. Her final episode aired on December 1, 2010. Later that month, the Style Network confirmed that former Cosby Show cast member Tempestt Bledsoe will take over as host. Her first episode aired on January 26, 2011. As of 2013, the show has believed to have been canceled due to low ratings after Nash's departure. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Moloney Kellie Shanygne Williams Lisa Arch Trish Suhr Tempestt Bledsoe Host Full Cast & Crew Last Season Season 10 2011 | 17 Episodes Season 10 of Clean House premiered on January 26, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Clean House. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.stylenetwork.com/Shows/CleanHouse/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}