{"link": "https://www.themoviedb.org/tv/72157?language=en", "title": "Kazoku Game", "resume": "Yoshimoto Koya becomes a tutor to a student, Numata Shigeyuki, an underachiever on the verge of dropping out of middle school. Expecting immediate results, Shigeyuki’s father makes a deal with Koya that if he could make Shigeyuki return to school within a week, he would receive a 100,000 yen bonus. Koya accepts the offer, replying that he would only need 5 days to complete the mission but demands that no one should interfere with his methodology in doing so.", "rate": 0, "genre": ["Drama", "Family"], "cast": ["Sho Sakurai", "Ryunosuke Kamiki", "Seishuu Uragami", "Itsuji Itao", "Honami Suzuki"], "character": ["Yoshimoto Koya", "Numata Shinichi", "Numata Shigeyuki", "Numata Kazushige", "Numata Kayoko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72157   Expand Kazoku Game   (2013) User Score Overview Yoshimoto Koya becomes a tutor to a student, Numata Shigeyuki, an underachiever on the verge of dropping out of middle school. Expecting immediate results, Shigeyuki’s father makes a deal with Koya that if he could make Shigeyuki return to school within a week, he would receive a 100,000 yen bonus. Koya accepts the offer, replying that he would only need 5 days to complete the mission but demands that no one should interfere with his methodology in doing so. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sho Sakurai Yoshimoto Koya Ryunosuke Kamiki Numata Shinichi Seishuu Uragami Numata Shigeyuki Itsuji Itao Numata Kazushige Honami Suzuki Numata Kayoko Full Cast & Crew Last Season Season 1 2013 | 10 Episodes Season 1 of Kazoku Game premiered on April 17, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kazoku Game. You can help by rating TV shows you've seen. Facts Original Name  家族ゲーム Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Drama Family Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 20 RJ_F13 9 Sergiojamon TB 4 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}