{"link": "https://www.themoviedb.org/tv/3579?language=en", "title": "The Angry Beavers", "resume": "The Angry Beavers is an American animated television series created by Mitch Schauer for the Nickelodeon channel. The series revolves around Daggett and Norbert Beaver, two young beaver brothers who have left their home to become bachelors in the forest near the fictional Wayouttatown, Oregon. The show premiered in the United States on April 19, 1997. The show started airing on the Nickelodeon Canada channel when it launched on November 2, 2009. The series aired on The '90s Are All That block on TeenNick in the US on October 7, 2011 as part of the block's U Pick with Stick line-up. The series was also up for a U Pick with Stick showdown on The '90s Are All That for the weekend of February 3, 2012, but lost to Rocko's Modern Life and did not air. The series was added to the Sunday line-up on The '90s Are All That on TeenNick, and aired from February 10, 2013, to March 3, 2013. The series returned to The '90s Are All That on TeenNick on March 25, 2013, but has since left the line-up again. The series is also currently being released on DVD.", "rate": 69, "genre": ["Animation", "Comedy", "Family"], "cast": ["Richard Steven Horvitz", "Nick Bakay", "Victor Wilson", "Stacy Schauer", "Chelsea Schauer"], "character": ["Daggett Beaver (voice)", "Norbert Beaver (voice)", "Bing (voice)", "Stacy Beaver (voice)", "Chelsea Beaver (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3579   Expand The Angry Beavers   (1997) User Score Overview The Angry Beavers is an American animated television series created by Mitch Schauer for the Nickelodeon channel. The series revolves around Daggett and Norbert Beaver, two young beaver brothers who have left their home to become bachelors in the forest near the fictional Wayouttatown, Oregon. The show premiered in the United States on April 19, 1997. The show started airing on the Nickelodeon Canada channel when it launched on November 2, 2009. The series aired on The '90s Are All That block on TeenNick in the US on October 7, 2011 as part of the block's U Pick with Stick line-up. The series was also up for a U Pick with Stick showdown on The '90s Are All That for the weekend of February 3, 2012, but lost to Rocko's Modern Life and did not air. The series was added to the Sunday line-up on The '90s Are All That on TeenNick, and aired from February 10, 2013, to March 3, 2013. The series returned to The '90s Are All That on TeenNick on March 25, 2013, but has since left the line-up again. The series is also currently being released on DVD. Featured Crew Mitch Schauer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  17 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Steven Horvitz Daggett Beaver (voice) Nick Bakay Norbert Beaver (voice) Victor Wilson Bing (voice) Stacy Schauer Stacy Beaver (voice) Chelsea Schauer Chelsea Beaver (voice) Full Cast & Crew Last Season Season 4 2000 | 26 Episodes Season 4 of The Angry Beavers premiered on September  2, 2000. View All Seasons Social Reviews  0 Discussions  17 Subject Status Replies Last Reply S The fourth season was the weakest Open 0 by Strannger18\n      \n     S Dr. Suess Open 0 by Strannger18\n      \n     S Robert Stake narration Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1998-03-01 CatDog 6.4    1991-08-11 Rugrats 7.1    1996-10-07 Hey Arnold! 6.8    1998-09-01 The Wild Thornberrys 6.0    1993-09-18 Rocko's Modern Life 7.7    1994-10-30 Aaahh!!! Real Monsters 6.4    1991-08-11 Doug 7.0    1999-08-16 Rocket Power 6.4  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  - Homepage   http://www.nick.com.au/shows/angrybeavers/agjezy Genres Animation Comedy Family Keywords beaver forest Content Score 93 Almost there... Top Contributors 29 Banana S 10 Sgt.Egg 7 niqo19 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}