{"link": "https://www.themoviedb.org/tv/69895?language=en", "title": "My Year 12 Life", "resume": "Meet 14 Australian students as they self-document their final year of high school through daily video diaries. The stresses of this launch-pad year starts on day one as they delve into the pressures of the ATAR.", "rate": 10, "genre": ["Reality", "Documentary", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69895   Expand My Year 12 Life   (2017) User Score  Play Trailer Overview Meet 14 Australian students as they self-document their final year of high school through daily video diaries. The stresses of this launch-pad year starts on day one as they delve into the pressures of the ATAR. Featured Crew Laura Waters Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Series 1 2017 | 24 Episodes Season 1 of My Year 12 Life premiered on February 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Year 12 Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Documentary Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/programs/my-year-12-life/ Genres Reality Documentary Kids Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 40 United600 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}