{"link": "https://www.themoviedb.org/tv/2039?language=en", "title": "Heist", "resume": "Heist is an American television series that premiered March 22, 2006, on NBC, but was almost immediately canceled due to low ratings. The series was from acclaimed director Doug Liman and revolved around professional thief Mickey O' Neil, who created a team of experts to try to pull off the biggest heist in history — to simultaneously rob three jewelry stores on Rodeo Drive during Academy Awards week. Meanwhile, Amy Sykes, lead detective for LAPD’s Robbery Division, led the task force investigating a series of thefts committed by this new crew. Under high pressure from her superiors, she had to figure out not only who was behind the crimes, but also what larger job they were leading up to.", "rate": 65, "genre": ["Drama"], "cast": ["Steve Harris", "Marika Dominczyk", "Billy Gardell", "Seymour Cassel", "Dougray Scott"], "character": ["Mickey O'Neil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2039   Expand Heist   (2006) User Score Overview Heist is an American television series that premiered March 22, 2006, on NBC, but was almost immediately canceled due to low ratings. The series was from acclaimed director Doug Liman and revolved around professional thief Mickey O' Neil, who created a team of experts to try to pull off the biggest heist in history — to simultaneously rob three jewelry stores on Rodeo Drive during Academy Awards week. Meanwhile, Amy Sykes, lead detective for LAPD’s Robbery Division, led the task force investigating a series of thefts committed by this new crew. Under high pressure from her superiors, she had to figure out not only who was behind the crimes, but also what larger job they were leading up to. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Harris Marika Dominczyk Billy Gardell Seymour Cassel Dougray Scott Mickey O'Neil Full Cast & Crew Last Season Season 1 2006 | 6 Episodes Season 1 of Heist premiered on March 22, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Heist. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage  - Genres Drama Keywords outlaw thief Content Score 86 Almost there... Top Contributors 5 Banana b 1 brewtown  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}