{"link": "https://www.themoviedb.org/tv/66134?language=en", "title": "The Durrells", "resume": "In 1935, financially strapped widow Louisa Durrell, whose life has fallen apart, decides to move from England, with her four children (three sons, one daughter), to the island of Corfu, Greece. Once there, the family moves into a dilapidated old house that has no electricity and that is crumbling apart. But life on Corfu is cheap, it's an earthly paradise, and the Durrells proceed to forge their new existence, with all its challenges, adventures, and forming relationships.", "rate": 71, "genre": ["Comedy", "Drama"], "cast": ["Keeley Hawes", "Milo Parker", "Josh O'Connor", "Daisy Waterstone", "Callum Woodhouse"], "character": ["Louisa Durrell", "Gerald Durrell", "Lawrence Durrell", "Margo Durrell", "Leslie Durrell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66134   Expand The Durrells   (2016) User Score  Play Trailer Overview In 1935, financially strapped widow Louisa Durrell, whose life has fallen apart, decides to move from England, with her four children (three sons, one daughter), to the island of Corfu, Greece. Once there, the family moves into a dilapidated old house that has no electricity and that is crumbling apart. But life on Corfu is cheap, it's an earthly paradise, and the Durrells proceed to forge their new existence, with all its challenges, adventures, and forming relationships. Featured Crew Simon Nye Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keeley Hawes Louisa Durrell Milo Parker Gerald Durrell Josh O'Connor Lawrence Durrell Daisy Waterstone Margo Durrell Callum Woodhouse Leslie Durrell Full Cast & Crew Current Season Series 3 2018 | 8 Episodes Season 3 of The Durrells premiered on March 18, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Wonderful, heartwarming Season 2 finale Open 0 by genplant29\n      \n     The Durrells (in Corfu): Anyone else here following this series? Open 2 by  cursethedarkness Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2011-05-01 Vera 6.8    2017-05-30 World of Dance 7.5    2016-07-04 Brief Encounters 7.3    2008-01-13 Lark Rise to Candleford 7.3    2016-08-28 Victoria 6.5    2016-09-21 Speechless 7.5    2014-02-22 About a Boy 6.3    2016-10-24 Man with a Plan 5.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  46m Homepage   https://www.durrell.org/wildlife/the-durrells/ Genres Comedy Drama Keywords friendship island greece family relationships based on memoir or autobiography period drama family expatriate naturalist 1930s corfu widowed mother Content Score 100 Yes! Looking good! Top Contributors 39 genplant29 31 Elizabeth Jennings t 22 tmdb18595655 s 14 stevenjhon847  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}