{"link": "https://www.themoviedb.org/tv/79084?language=en", "title": "POSE", "resume": "A dance musical that explores the juxtaposition of several segments of 1980s life and society in New York: the ball culture world, the rise of the luxury Trump-era universe and the downtown social and literary scene.", "rate": 85, "genre": ["Drama"], "cast": ["Mj Rodriguez", "Dominique Jackson", "Kate Mara", "Evan Peters", "Indya Moore"], "character": ["Blanca", "Elektra Abundance", "Patty", "Stan", "Angel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79084   Expand POSE   (2018) User Score  Play Trailer Overview A dance musical that explores the juxtaposition of several segments of 1980s life and society in New York: the ball culture world, the rise of the luxury Trump-era universe and the downtown social and literary scene. Featured Crew Ryan Murphy Creator Brad Falchuk Creator Steven Canals Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mj Rodriguez Blanca Dominique Jackson Elektra Abundance Kate Mara Patty Evan Peters Stan Indya Moore Angel Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of POSE premiered on June  3, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply I'm loving this show! Open 0 by Poetist\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on POSE. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.fxnetworks.com/shows/pose Genres Drama Keywords transgender lgbt 1980s ball culture Content Score 100 Yes! Looking good! Top Contributors 62 Elizabeth Jennings S 3 ShareRapid y 3 yewenlong1984 3 Effie Colton  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}