{"link": "https://www.themoviedb.org/tv/71786?language=en", "title": "Content Cop", "resume": "In an effort to bring justice to the YouTube community, former police officer Ian Carter takes on the title of \"Content Cop\". Using his old police uniform and raw wit, Ian sets out to stop the creators that bring nothing but discord to his online city.", "rate": 50, "genre": ["Documentary", "Comedy", "Crime"], "cast": ["Ian Carter"], "character": ["Content Cop"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71786   Expand Content Cop   (2015) User Score Overview In an effort to bring justice to the YouTube community, former police officer Ian Carter takes on the title of \"Content Cop\". Using his old police uniform and raw wit, Ian sets out to stop the creators that bring nothing but discord to his online city. Featured Crew Ian Carter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Carter Content Cop Full Cast & Crew Last Season Season 3 2017 | 2 Episodes Season 3 of Content Cop premiered on February  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2014-06-01 Halt and Catch Fire 7.7    2009-02-15 Eastbound & Down 7.4    2005-10-17 The Colbert Report 7.0    2016-09-06 Atlanta 7.5    2002-10-20 Top Gear 7.5    2016-06-03 Outcast 7.0    2013-11-17 Almost Human 7.0    2009-04-09 Parks and Recreation 7.9  Facts Status  Returning Series Networks - Certification  - Type  Documentary Original Language  English Runtime  20m Homepage   http://www.idubbbz.com/ Genres Documentary Comedy Crime Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 35 Maureen 7 HomegrownHero l 1 lishremix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}