{"link": "https://www.themoviedb.org/tv/34190?language=en", "title": "Aura Battler Dunbine", "resume": "Aura Battler Dunbine is an anime television series created by Yoshiyuki Tomino and produced by Sunrise Studios.\nDunbine is set in Byston Well, a parallel world that resembles the countryside of medieval Europe with kingdoms ruled by monarchs in castles, armies of unicorn-riding cavalry armed with swords and crossbows, and little winged creatures called Ferario, flying about offering help or hindrance depending on their mood. The main draw to the series were the insect-like Aura Battlers, used by the population of Byston Well to fight their wars. These fighting suits are powered by a powerful energy called \"aura\" or \"life energy.\" Certain people are strong enough with the aura-energy to act as power-supply to these mecha, making them Aura Warriors.\nThe series aired on Nagoya TV from February 5, 1983 to January 21, 1984, totaling for 49 episodes. There was a three episode anime OVA sequel, 'New Story of Aura Battler Dunbine released in 1988.\nThe series was later dubbed by ADV Films and was released to DVD in North America, along with the original Japanese version in 2003.", "rate": 0, "genre": ["Animation"], "cast": ["Michie Tomizawa", "Masako Ikeda", "Norio Wakamoto", "Mika Doi", "Miki Takahashi"], "character": ["Ell Fino", "Silky Mau", "Allen Brady", "Marvel Frozen", "Ciela Lapana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34190   Expand Aura Battler Dunbine   (1983) User Score Overview Aura Battler Dunbine is an anime television series created by Yoshiyuki Tomino and produced by Sunrise Studios. Dunbine is set in Byston Well, a parallel world that resembles the countryside of medieval Europe with kingdoms ruled by monarchs in castles, armies of unicorn-riding cavalry armed with swords and crossbows, and little winged creatures called Ferario, flying about offering help or hindrance depending on their mood. The main draw to the series were the insect-like Aura Battlers, used by the population of Byston Well to fight their wars. These fighting suits are powered by a powerful energy called \"aura\" or \"life energy.\" Certain people are strong enough with the aura-energy to act as power-supply to these mecha, making them Aura Warriors. The series aired on Nagoya TV from February 5, 1983 to January 21, 1984, totaling for 49 episodes. There was a three episode anime OVA sequel, 'New Story of Aura Battler Dunbine released in 1988. The series was later dubbed by ADV Films and was released to DVD in North America, along with the original Japanese version in 2003. Featured Crew Yoshiyuki Tomino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michie Tomizawa Ell Fino Masako Ikeda Silky Mau Norio Wakamoto Allen Brady Mika Doi Marvel Frozen Miki Takahashi Ciela Lapana Full Cast & Crew Last Season TV Series 1983 | 49 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Aura Battler Dunbine. You can help by rating TV shows you've seen. Facts Original Name  聖戦士ダンバイン Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 6 BrerFox 2 TheDerpMan h 2 heeroyuy176  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}