{"link": "https://www.themoviedb.org/tv/46536?language=en", "title": "Cheongdam-dong Alice", "resume": "Cheongdam-dong Alice is a 2012 South Korean television series, starring Moon Geun-young, Park Si-hoo, So Yi-hyun and Kim Ji-seok. It is about a young woman's \"journey\" to Cheongdam-dong ― one of the wealthiest areas in southern Seoul ― by seducing a second-generation chaebol into marriage.\nIt aired on SBS from December 1, 2012 to January 27, 2013 on Saturdays and Sundays at 21:55 for 16 episodes.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["Moon Geun-Young", "Park Shi Hoo", "So Yi-hyun", "Namgoong Min", "Han Jin-hee"], "character": ["Han Se-kyung", "Cha Seung-jo", "Seo Yoon-joo", "So In-chan", "Cha Il-nam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46536   Expand Cheongdam-dong Alice   (2012) User Score Overview Cheongdam-dong Alice is a 2012 South Korean television series, starring Moon Geun-young, Park Si-hoo, So Yi-hyun and Kim Ji-seok. It is about a young woman's \"journey\" to Cheongdam-dong ― one of the wealthiest areas in southern Seoul ― by seducing a second-generation chaebol into marriage. It aired on SBS from December 1, 2012 to January 27, 2013 on Saturdays and Sundays at 21:55 for 16 episodes. Featured Crew Kim Young-hyun Creator Park Sang-yeon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Moon Geun-Young Han Se-kyung Park Shi Hoo Cha Seung-jo So Yi-hyun Seo Yoon-joo Namgoong Min So In-chan Han Jin-hee Cha Il-nam Full Cast & Crew Last Season Specials 2012 | 16 Episodes Season 0 of Cheongdam-dong Alice premiered on December  1, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Cheongdam-dong Alice. You can help by rating TV shows you've seen. Facts Original Name  청담동 앨리스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://alice.sbs.co.kr/ Genres Comedy Drama Keywords korea Content Score 93 Almost there... Top Contributors M 28 Maria180493 N 10 Nightowl.Kr CM 6 Cherche Moi 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}