{"link": "https://www.themoviedb.org/tv/10278?language=en", "title": "Live from Lincoln Center", "resume": "Live From Lincoln Center is an ongoing series of musical performances produced by Lincoln Center for the Performing Arts in conjunction with Thirteen/WNET in New York City.\nA series of concerts, ballets, operas, and recitals telecast, as the title says, live from Lincoln Center, it was created and developed by Executive Producer John Goberman and premiered on January 30, 1976 with a concert featuring André Previn and Van Cliburn. It is aired by PBS stations nationwide periodically rather than on a regular schedule. It has presented historic performances by such artists as Plácido Domingo, Luciano Pavarotti, Itzhak Perlman, Isaac Stern, Sir James Galway, Zubin Mehta, Kurt Masur, Beverly Sills, Joan Sutherland, Mikhail Baryshnikov, Audra McDonald, the New York City Ballet, the Mark Morris Dance Group, the American Ballet Theatre, the New York Philharmonic, and the New York City Opera to millions of home viewers. It has won thirteen Emmy Awards and fifty-three Emmy Award nominations, as well as two George Foster Peabody Awards. Two recordings made from concerts presented on the show have won Grammy awards.\nAnnouncer Martin Bookspan was with the program from its premiere in 1976 until his 2006 retirement, when Fred Child, announcer for NPR's Performance Today, took over. Several personalities, among them Dick Cavett, Hugh Downs, Sam Waterston, Garrick Utley, Canadian broadcaster Patrick Watson, and Beverly Sills, have served as host for the series, with Downs staying the longest. Ms. Sills was the host from 2000 until two months before her death in 2007. In recent years the host position has been filled by artists such as Alan Alda, Alec Baldwin, Lesley Stahl. The program was principally directed by Kirk Browning from its inception in 1976 until 2008. Since 2008 Alan Skog has been primary director.", "rate": 100, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10278   Expand Live from Lincoln Center   (1976) User Score Overview Live From Lincoln Center is an ongoing series of musical performances produced by Lincoln Center for the Performing Arts in conjunction with Thirteen/WNET in New York City. A series of concerts, ballets, operas, and recitals telecast, as the title says, live from Lincoln Center, it was created and developed by Executive Producer John Goberman and premiered on January 30, 1976 with a concert featuring André Previn and Van Cliburn. It is aired by PBS stations nationwide periodically rather than on a regular schedule. It has presented historic performances by such artists as Plácido Domingo, Luciano Pavarotti, Itzhak Perlman, Isaac Stern, Sir James Galway, Zubin Mehta, Kurt Masur, Beverly Sills, Joan Sutherland, Mikhail Baryshnikov, Audra McDonald, the New York City Ballet, the Mark Morris Dance Group, the American Ballet Theatre, the New York Philharmonic, and the New York City Opera to millions of home viewers. It has won thirteen Emmy Awards and fifty-three Emmy Award nominations, as well as two George Foster Peabody Awards. Two recordings made from concerts presented on the show have won Grammy awards. Announcer Martin Bookspan was with the program from its premiere in 1976 until his 2006 retirement, when Fred Child, announcer for NPR's Performance Today, took over. Several personalities, among them Dick Cavett, Hugh Downs, Sam Waterston, Garrick Utley, Canadian broadcaster Patrick Watson, and Beverly Sills, have served as host for the series, with Downs staying the longest. Ms. Sills was the host from 2000 until two months before her death in 2007. In recent years the host position has been filled by artists such as Alan Alda, Alec Baldwin, Lesley Stahl. The program was principally directed by Kirk Browning from its inception in 1976 until 2008. Since 2008 Alan Skog has been primary director. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 42 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Live from Lincoln Center. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 5 Pierreism m 2 mahlenadelga r 1 ryanummh21 S 1 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}