{"link": "https://www.themoviedb.org/tv/71663?language=en", "title": "Black Lightning", "resume": "Jefferson Pierce is a man wrestling with a secret. As the father of two daughters and principal of a charter high school that also serves as a safe haven for young people in a New Orleans neighborhood overrun by gang violence, he is a hero to his community.", "rate": 61, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Drama"], "cast": ["Cress Williams", "China Anne McClain", "Christine Adams", "Nafessa Williams", "Marvin 'Krondon' Jones III"], "character": ["Jefferson Pierce / Black Lightning", "Jennifer Pierce", "Lynn Pierce", "Anissa Pierce / Thunder", "Tobias Whale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71663   Expand Black Lightning   (2018) User Score  Play Trailer Overview Jefferson Pierce is a man wrestling with a secret. As the father of two daughters and principal of a charter high school that also serves as a safe haven for young people in a New Orleans neighborhood overrun by gang violence, he is a hero to his community. Featured Crew Salim Akil Creator Mara Brock Akil Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  1 Images Backdrops  3 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cress Williams Jefferson Pierce / Black Lightning China Anne McClain Jennifer Pierce Christine Adams Lynn Pierce Nafessa Williams Anissa Pierce / Thunder Marvin 'Krondon' Jones III Tobias Whale Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of Black Lightning premiered on January 16, 2018. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply please dont suck please dont suck..... Open 14 by  chilone r Can Black Lightning Fly? Open 3 by  lantzn m Who the hell is thunder? Open 3 by  lantzn Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  12 Recommendations   2017-11-21 Marvel's Runaways 7.3    2018-03-21 Krypton 6.5    2017-10-02 The Gifted 7.0    2017-09-29 Marvel's Inhumans 5.6    2017-11-17 Marvel's The Punisher 8.0    2018-02-26 Good Girls 5.8    2014-07-17 Satisfaction 5.0    2017-10-05 Ghost Wars 6.0  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://cwtv.com/shows/black-lightning Genres Action & Adventure Sci-Fi & Fantasy Drama Keywords dc comics superhero based on graphic novel black superhero Content Score 100 Yes! Looking good! Top Contributors 37 Warpath 20 Elizabeth Jennings 15 Ander33x m 12 misfit_noel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}