{"link": "https://www.themoviedb.org/tv/72486?language=en", "title": "VeggieTales In The House", "resume": "Get ready to love your veggies! The beloved faith-based brand has a fresh new look as Bob the Tomato, Larry the Cucumber and all their Veggie friends venture off the countertop for the first time ever in an all-new television series, available exclusively on Netflix. Every episode also features a brand-new, upbeat silly song as the Veggie crew embarks on new adventures throughout their house. This loveable comedy stays true to the roots of the VeggieTales brand by seamlessly weaving in strong moral messages that will capture the hearts of Veggie lovers of all ages.", "rate": 57, "genre": ["Animation", "Family"], "cast": ["Mike Nawrocki", "Phil Vischer"], "character": ["Larry", "Bob"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72486   Expand VeggieTales In The House   (2014) User Score Overview Get ready to love your veggies! The beloved faith-based brand has a fresh new look as Bob the Tomato, Larry the Cucumber and all their Veggie friends venture off the countertop for the first time ever in an all-new television series, available exclusively on Netflix. Every episode also features a brand-new, upbeat silly song as the Veggie crew embarks on new adventures throughout their house. This loveable comedy stays true to the roots of the VeggieTales brand by seamlessly weaving in strong moral messages that will capture the hearts of Veggie lovers of all ages. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike Nawrocki Larry Phil Vischer Bob Full Cast & Crew Last Season Season 4 2016 | 26 Episodes Season 4 of VeggieTales In The House premiered on September 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2017-02-24 VeggieTales in The City 7.0    2012-06-02 Care Bears: Welcome to Care-a-Lot 5.0    2003-03-11 Strawberry Shortcake 5.0  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  12m Homepage   http://veggietales.com/veggietales-in-the-house/ Genres Animation Family Keywords vegetable religion vegetables vegetal Content Score 64 We're so close, yet so far. Top Contributors 54 felectronika 7 franklinlizano 2 Zywiec  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}