{"link": "https://www.themoviedb.org/tv/59789?language=en", "title": "Partner", "resume": "\"Partner\" centers around two law firms as they struggle to defend the accused and those around them. Kang Eun-ho, a widowed single mother & attorney, tangles with the charismatic and ruthless attorney Lee Tae-jo.\nIn the first two episodes the attorneys work on cases involving a step-brother chraged with murdering of his step-sister and a lawsuit between a wealthy mother-in-law and her divorced daughter-in-law.\nEach successive episode will cover provocative cases like these, while also bringing to light the charms of the attorneys and their daily lives.", "rate": 0, "genre": ["Drama"], "cast": ["Kim Hyun-joo", "Lee Dong-wook", "Lee Ha-nui", "Choi Cheol-ho", "Lee Won-Jong"], "character": ["Kang Eun-Ho", "Lee Tae-Jo", "Han Jung-Won", "Lee Yeong-Woo", "Kim Yong-Su"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59789   Expand Partner   (2009) User Score Overview \"Partner\" centers around two law firms as they struggle to defend the accused and those around them. Kang Eun-ho, a widowed single mother & attorney, tangles with the charismatic and ruthless attorney Lee Tae-jo. In the first two episodes the attorneys work on cases involving a step-brother chraged with murdering of his step-sister and a lawsuit between a wealthy mother-in-law and her divorced daughter-in-law. Each successive episode will cover provocative cases like these, while also bringing to light the charms of the attorneys and their daily lives. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hyun-joo Kang Eun-Ho Lee Dong-wook Lee Tae-Jo Lee Ha-nui Han Jung-Won Choi Cheol-ho Lee Yeong-Woo Lee Won-Jong Kim Yong-Su Full Cast & Crew Last Season Season 1 2009 | 16 Episodes Season 1 of Partner premiered on June 24, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Partner. You can help by rating TV shows you've seen. Facts Original Name  파트너 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.kbs.co.kr/drama/partner/ Genres Drama Keywords law romance korea Content Score 86 Almost there... Top Contributors M 36 Maria180493 t 5 tmdb38202327 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}