{"link": "https://www.themoviedb.org/tv/5200?language=en", "title": "Fireman Sam", "resume": "Follow the adventures of fireman Sam and his colleagues as they protect the citizens of the Welsh town of Pontypandy. Whenever the alarm sounds, brave Sam and his co-workers can be counted on to jump into a fire engine, hop onto a helicopter, or even launch an inflatable lifeboat to battle blazes, mount rescue missions, or provide medical attention to those in need.", "rate": 59, "genre": ["Kids", "Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5200   Expand Fireman Sam   (1987) User Score Overview Follow the adventures of fireman Sam and his colleagues as they protect the citizens of the Welsh town of Pontypandy. Whenever the alarm sounds, brave Sam and his co-workers can be counted on to jump into a fire engine, hop onto a helicopter, or even launch an inflatable lifeboat to battle blazes, mount rescue missions, or provide medical attention to those in need. Featured Crew Dave Jones Creator Dave Gingell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 11 2017 | 13 Episodes Season 11 of Fireman Sam premiered on November 18, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Fireman Sam. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   1991-09-26 Brum 5.2    1999-04-12 Bob the Builder 5.5    1981-09-16 Postman Pat 6.0    1992-07-20 Bananas in Pyjamas 3.3    1984-10-09 Thomas & Friends 5.3    1986-05-28 Pingu 6.5    1997-03-31 Teletubbies 2.8  Facts Original Name  Sam Tân Status  Returning Series Networks Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  10m Homepage   http://www.firemansamonline.com/fr-fr/ Genres Kids Animation Comedy Keywords stop motion cgi Content Score 64 We're so close, yet so far. Top Contributors 215 Marr 🇳🇱 d 21 djedje2d 15 Elizabeth Jennings i 4 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}