{"link": "https://www.themoviedb.org/tv/65721?language=en", "title": "Slow Train Through Africa with Griff Rhys Jones", "resume": "Griff Rhys Jones explores Africa the unhurried way, as he takes to the continent’s railways to immerse himself in the joy and sometimes the frustration of travelling through a beautiful and beguiling continent, using the most romantic method of transportation. Travelling a total of 7000 miles over five journeys, he explores fascinating landscapes, encounters unforgettable wildlife and meets extraordinary people. Stunning aerial photography combines with observational travelogue to produce a fresh portrait of Africa through Griff’s experiences on and off the train. On each epic trip across five episodes, he discovers how the railway reveals a great deal about the places he travels through. Griff uses the train to get to unexpected places in deserts and forests, villages and cities, learning stories of their past and finding out how they are used today. Griff travels th", "rate": 60, "genre": ["Family", "Documentary"], "cast": ["Griff Rhys Jones"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65721   Expand Slow Train Through Africa with Griff Rhys Jones   (2015) User Score  Play Trailer Overview Griff Rhys Jones explores Africa the unhurried way, as he takes to the continent’s railways to immerse himself in the joy and sometimes the frustration of travelling through a beautiful and beguiling continent, using the most romantic method of transportation. Travelling a total of 7000 miles over five journeys, he explores fascinating landscapes, encounters unforgettable wildlife and meets extraordinary people. Stunning aerial photography combines with observational travelogue to produce a fresh portrait of Africa through Griff’s experiences on and off the train. On each epic trip across five episodes, he discovers how the railway reveals a great deal about the places he travels through. Griff uses the train to get to unexpected places in deserts and forests, villages and cities, learning stories of their past and finding out how they are used today. Griff travels th Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Griff Rhys Jones Himself Full Cast & Crew Last Season Season 1 2015 | 5 Episodes Season 1 of Slow Train Through Africa with Griff Rhys Jones premiered on April 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Slow Train Through Africa with Griff Rhys Jones. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage  - Genres Family Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors o 11 obishiro 6 Elizabeth Jennings 3 ernie77 1 RonKing  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}