{"link": "https://www.themoviedb.org/tv/4906?language=en", "title": "Sıla", "resume": "Sıla is a Turkish television series directed by Gül Oğuz that airs on ATV and ATV Avrupa. In Greece the projection of Sila started the 10 June 2012 at Mega Channel. A young woman's forced marriage to the agha of a tribe in Southeastern Turkey leads to tragedy and social change.", "rate": 0, "genre": ["Drama", "Mystery"], "cast": ["Fatoş Tez", "Kartal Balaban", "Hümeyra Akbay", "Zeynep Anıl Tatdıran", "Leyla Başak"], "character": ["Kevser", "Emre", "Neşe", "Dilan", "Yezda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4906   Expand Sıla   (2018) User Score Overview Sıla is a Turkish television series directed by Gül Oğuz that airs on ATV and ATV Avrupa. In Greece the projection of Sila started the 10 June 2012 at Mega Channel. A young woman's forced marriage to the agha of a tribe in Southeastern Turkey leads to tragedy and social change. Featured Crew Yasin Uslu Creator Gül Oğuz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fatoş Tez Kevser Kartal Balaban Emre Hümeyra Akbay Neşe Zeynep Anıl Tatdıran Dilan Leyla Başak Yezda Full Cast & Crew Current Season Season 1 2018 | 5 Episodes Season 1 of Sıla premiered on April 24, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sıla. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  90m Homepage   http://www.siladizisi.info/ Genres Drama Mystery Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 32 moviefars s 3 speedycars b 1 bluwy z 1 zerox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}