{"link": "https://www.themoviedb.org/tv/61446?language=en", "title": "Devil's Playground", "resume": "The year is 1988. It is 35 years after the events of Fred Schepisi’s classic film, The Devil’s Playground. Tom Allen, now in his 40s and recently widowed, is a respected Sydney psychiatrist and father of two children. A practicing Catholic, Tom accepts an offer by the Bishop of Sydney to become a counselor of priests. During these sessions, he will uncover a scandal and become embroiled in the Church’s attempts to cover it up. Tom’s quest for justice will push him to his limits, and reveal a side of Church power and official corruption he could never have imagined.", "rate": 83, "genre": ["Drama"], "cast": ["Jack Thompson", "Simon Burke", "John Noble", "Don Hany", "Toni Collette"], "character": ["Cardinal Neville", "Tom Allen", "Bishop John McNally", "Bishop Quaid", "Margaret Wallace"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61446   Expand Devil's Playground   (2014) User Score Overview The year is 1988. It is 35 years after the events of Fred Schepisi’s classic film, The Devil’s Playground. Tom Allen, now in his 40s and recently widowed, is a respected Sydney psychiatrist and father of two children. A practicing Catholic, Tom accepts an offer by the Bishop of Sydney to become a counselor of priests. During these sessions, he will uncover a scandal and become embroiled in the Church’s attempts to cover it up. Tom’s quest for justice will push him to his limits, and reveal a side of Church power and official corruption he could never have imagined. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Thompson Cardinal Neville Simon Burke Tom Allen John Noble Bishop John McNally Don Hany Bishop Quaid Toni Collette Margaret Wallace Full Cast & Crew Last Season Season 1 2014 | 6 Episodes Season 1 of Devil's Playground premiered on September  9, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Devil's Playground. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords religion church based on movie clergy 1980s Content Score 86 Almost there... Top Contributors 29 Banana 19 Elizabeth Jennings z 6 zurman1 g 2 grantleicester  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}