{"link": "https://www.themoviedb.org/tv/46502?language=en", "title": "More Tales of the City", "resume": "In this sequel to the controversial PBS mini-series, Mona Ramsey is on a cross-country trip that takes her to a brothel which may hold a secret about her past. Michael \"Mouse\" Tolliver and Mary Ann Singleton go on a cruise where they meet up with lovers old and new. Back in San Francisco, Brian Hawkins becomes involved with a mysterious woman he spots from his window, while DeDe Halcyon Day becomes acquainted with a new friend who helps her discover her true inner feelings.", "rate": 83, "genre": ["Drama"], "cast": ["Laura Linney", "Olympia Dukakis", "Colin Ferguson", "Billy Campbell"], "character": ["Mary Ann Singleton", "Anna Madrigal", "Burke Andrew", "Jon Fielding"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46502   Expand More Tales of the City   (1998) User Score  Play Trailer Overview In this sequel to the controversial PBS mini-series, Mona Ramsey is on a cross-country trip that takes her to a brothel which may hold a secret about her past. Michael \"Mouse\" Tolliver and Mary Ann Singleton go on a cruise where they meet up with lovers old and new. Back in San Francisco, Brian Hawkins becomes involved with a mysterious woman he spots from his window, while DeDe Halcyon Day becomes acquainted with a new friend who helps her discover her true inner feelings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laura Linney Mary Ann Singleton Olympia Dukakis Anna Madrigal Colin Ferguson Burke Andrew Billy Campbell Jon Fielding Full Cast & Crew Last Season Miniseries 1998 | 6 Episodes Season 1 of More Tales of the City premiered on June  6, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations   1993-05-08 Tales of the City 8.8    2010-09-26 Downton Abbey 8.0    2001-06-03 Six Feet Under 8.2    2007-07-19 Mad Men 8.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Drama Keywords based on novel or book miniseries Content Score 79 Pump it up! We're close now. Top Contributors 22 Banana 9 Steve TB 3 TMDb Bot 1 theseisisinging  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}