{"link": "https://www.themoviedb.org/tv/61544?language=en", "title": "Bride of the Century", "resume": "The Taeyang Corporation is the largest conglomerate in South Korea. The family that runs Taeyang has been under a curse for 100 years. The curse began when the first bride of the family's first son died. Under this situation, a love like fairy tale occurs while conspiracies run rampant.", "rate": 83, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Lee Hong-gi", "Yang Jin-sung", "Choi Il-hwa", "Jung Hae-in", "Jang Ah-young"], "character": ["Choi Kang-joo", "Na Doo-rim / Jang Yi-kyung", "Choi Il-do", "Choi Kang-in", "Lee Roo-mi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61544   Expand Bride of the Century   (2014) User Score Overview The Taeyang Corporation is the largest conglomerate in South Korea. The family that runs Taeyang has been under a curse for 100 years. The curse began when the first bride of the family's first son died. Under this situation, a love like fairy tale occurs while conspiracies run rampant. Featured Crew Yoon Sang-ho Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Hong-gi Choi Kang-joo Yang Jin-sung Na Doo-rim / Jang Yi-kyung Choi Il-hwa Choi Il-do Jung Hae-in Choi Kang-in Jang Ah-young Lee Roo-mi Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Bride of the Century premiered on February 22, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bride of the Century. You can help by rating TV shows you've seen. Facts Original Name  백년의 신부 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.tvchosun.com/drama/bridecentury/main/main.html Genres Drama Sci-Fi & Fantasy Keywords korea Content Score 100 Yes! Looking good! Top Contributors M 34 Maria180493 CM 8 Cherche Moi 7 part-mozi 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}