{"link": "https://www.themoviedb.org/tv/72750?language=en", "title": "Killing Eve", "resume": "A security consultant hunts for a ruthless assassin. Based on the Villanelle novellas by Luke Jennings.", "rate": 87, "genre": ["Crime", "Drama"], "cast": ["Sandra Oh", "Jodie Comer", "Fiona Shaw", "Kim Bodnia", "Owen McDonnell"], "character": ["Eve Polastri", "Villanelle", "Carolyn Martens", "Konstantin", "Niko Polastri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72750   Expand Killing Eve   (2018) User Score  Play Trailer Overview A security consultant hunts for a ruthless assassin. Based on the Villanelle novellas by Luke Jennings. Featured Crew Phoebe Waller-Bridge Creator Rob Williams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sandra Oh Eve Polastri Jodie Comer Villanelle Fiona Shaw Carolyn Martens Kim Bodnia Konstantin Owen McDonnell Niko Polastri Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Killing Eve premiered on April  8, 2018. View All Seasons Social Reviews  2 Discussions  0 A review by Baz  6.0 Written by  Baz  on May  9, 2018 Killing Eve is mediocre at best. Some very far-fetched plot holes.\nThe acting is very weak and hammy at times . After watching 4 episodes I started asking myself ‘Why am I watching this? And couldn’t answer it!’ There’s better ways to waste time! Read All Reviews Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2018-05-06 Vida 6.4    2018-06-04 Dietland 8.0    2005-06-05 The Comeback 7.6    2015-04-20 Safe House 6.3    2018-04-02 The Crossing 7.8    2018-04-05 Deep State 6.4    2015-11-24 Capital 7.5    2018-03-25 Barry 7.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.bbcamerica.com/shows/killing-eve Genres Crime Drama Keywords based on novel or book psychopath crime psycho killer Content Score 100 Yes! Looking good! Top Contributors t 26 tmdb42368388 Y 12 YJ 9 Elizabeth Jennings C 9 CyberScream  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}