{"link": "https://www.themoviedb.org/tv/46863?language=en", "title": "Jonestown: The Life and Death of Peoples Temple", "resume": "Jonestown: The Life and Death of Peoples Temple, is a 2006 documentary film made by Firelight Media, produced and directed by Stanley Nelson. The documentary reveals new footage of the incidents surrounding the Peoples Temple and its leader Jim Jones who led over 900 members of his cult to a settlement in Guyana called Jonestown, where he orchestrated a mass suicide with poisoned Flavor Aid, in 1978. It is in the form of a narrative with interviews with former Temple members, Jonestown survivors, and persons who knew Jones at various stages.", "rate": 82, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46863   Expand Jonestown: The Life and Death of Peoples Temple User Score Overview Jonestown: The Life and Death of Peoples Temple, is a 2006 documentary film made by Firelight Media, produced and directed by Stanley Nelson. The documentary reveals new footage of the incidents surrounding the Peoples Temple and its leader Jim Jones who led over 900 members of his cult to a settlement in Guyana called Jonestown, where he orchestrated a mass suicide with poisoned Flavor Aid, in 1978. It is in the form of a narrative with interviews with former Temple members, Jonestown survivors, and persons who knew Jones at various stages. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.firelightmedia.org/flash/mainflash2.html Genres No genres have been added. Keywords No keywords have been added. Content Score 28 Rome wasn't built in a day... Top Contributors 2 sirspamsalot 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}