{"link": "https://www.themoviedb.org/tv/6306?language=en", "title": "Rab C. Nesbitt", "resume": "BBC comedy series about Rab C. Nesbitt, a drunken, string vested layabout who lives with his long suffering wife Mary and his two sons in the working class area of Govan in Glasgow. When he's not getting drunk with his pals that include the devious, womanizing Jamesie Cotter. He's offering his philosophical outlook on life to whoever will listen.", "rate": 71, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6306   Expand Rab C. Nesbitt   (1990) User Score Overview BBC comedy series about Rab C. Nesbitt, a drunken, string vested layabout who lives with his long suffering wife Mary and his two sons in the working class area of Govan in Glasgow. When he's not getting drunk with his pals that include the devious, womanizing Jamesie Cotter. He's offering his philosophical outlook on life to whoever will listen. Featured Crew Ian Pattison Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Series 10 2011 | 7 Episodes Season 10 of Rab C. Nesbitt premiered on October  5, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Rab C. Nesbitt. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1971-04-10 The Two Ronnies 9.0    1961-10-12 The Morecambe & Wise Show 5.1    2009-01-03 Total Wipeout 5.3    2002-11-14 Harry Hill's TV Burp 7.2    2000-01-12 That Peter Kay Thing 6.4    1964-12-16 The Likely Lads 7.8    1962-01-04 Steptoe and Son 8.2    1978-02-08 Grange Hill 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00hgygh Genres Comedy Keywords scotland self-destruction white trash dark comedy satire sitcom Content Score 64 We're so close, yet so far. Top Contributors R 26 Rebecca 7 Banana O 4 Ozbourne 2 MadMacs06  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}