{"link": "https://www.themoviedb.org/tv/65594?language=en", "title": "The Last Cop", "resume": "In 1985, when detective Kyogoku Kosuke (Karasawa Toshiaki) was hunting down some criminals, he suddenly found himself in the center of an explosion and ended up falling into a coma. In 2015, after 30 years Kosuke wakes up and has a lot to catch up, new values, technology, family, work, everything he has missed. Back to the Criminal Division, Kosuke and his new partner Ryota (Kubota Masataka) are entrusted with classified security data that aims to a terrorist group Schiesser.", "rate": 0, "genre": ["Comedy", "Drama", "Mystery"], "cast": ["Toshiaki Karasawa", "Masataka Kubota", "Nozomi Sasaki"], "character": ["Kosuke Kyogoku", "Ryota Mochizuki", "Yui Suzuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65594   Expand The Last Cop   (2015) User Score Overview In 1985, when detective Kyogoku Kosuke (Karasawa Toshiaki) was hunting down some criminals, he suddenly found himself in the center of an explosion and ended up falling into a coma. In 2015, after 30 years Kosuke wakes up and has a lot to catch up, new values, technology, family, work, everything he has missed. Back to the Criminal Division, Kosuke and his new partner Ryota (Kubota Masataka) are entrusted with classified security data that aims to a terrorist group Schiesser. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshiaki Karasawa Kosuke Kyogoku Masataka Kubota Ryota Mochizuki Nozomi Sasaki Yui Suzuki Full Cast & Crew Last Season Season 2 2016 | 10 Episodes Season 2 of The Last Cop premiered on October  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Last Cop. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.ntv.co.jp/lastcop/ Genres Comedy Drama Mystery Keywords coma cop Content Score 56 We're so close, yet so far. Top Contributors 48 Zlogorek 9 thirstyhippo 8 Banana n 2 naka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}