{"link": "https://www.themoviedb.org/tv/72464?language=en", "title": "Tribes and Empires: Storm of Prophecy", "resume": "Muyun Sheng, born from a spirit mother, is the unfavoured sixth son of the reigning Emperor Ming of Duan. Discovering an ancient painting by chance, he is captivated by the spirit locked inside (Panxi), and together, they promise to search for the most beautiful places on Earth. Muru Hanjiang, friend of Muyun Sheng, is the son of General Muru Shuo, famous for conquering the Eight Tribes of Han Province.\nMany years later, the descendant of the Eight Tribes Shuofeng Heye sows discord between the Muyun and Muru families. Only when the friendship and loyalty between these two families is rebuilt will the Duan Dynasty be safe from invasion by the Eight Tribes. This drama tells of the loyalty, friendship, enmity and romance between the young descendants during the twilight years of the Duan Dynasty.", "rate": 43, "genre": ["Action", "Adventure"], "cast": ["Huang Xuan", "Shawn Dou", "Zhou Yiwei", "Janice Man", "Lulu Xu"], "character": ["Muyun Sheng", "Muru Hanjiang", "Shuofeng Heye", "Panxi", "Su Yuning"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72464   Expand Tribes and Empires: Storm of Prophecy   (2017) User Score Overview Muyun Sheng, born from a spirit mother, is the unfavoured sixth son of the reigning Emperor Ming of Duan. Discovering an ancient painting by chance, he is captivated by the spirit locked inside (Panxi), and together, they promise to search for the most beautiful places on Earth. Muru Hanjiang, friend of Muyun Sheng, is the son of General Muru Shuo, famous for conquering the Eight Tribes of Han Province. Many years later, the descendant of the Eight Tribes Shuofeng Heye sows discord between the Muyun and Muru families. Only when the friendship and loyalty between these two families is rebuilt will the Duan Dynasty be safe from invasion by the Eight Tribes. This drama tells of the loyalty, friendship, enmity and romance between the young descendants during the twilight years of the Duan Dynasty. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Huang Xuan Muyun Sheng Shawn Dou Muru Hanjiang Zhou Yiwei Shuofeng Heye Janice Man Panxi Lulu Xu Su Yuning Full Cast & Crew Current Season Season 1 2017 | 75 Episodes Season 1 of Tribes and Empires: Storm of Prophecy premiered on November 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Tribes and Empires: Storm of Prophecy. You can help by rating TV shows you've seen. Facts Original Name  九州·海上牧云记 Status  Returning Series Networks QQLive Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Action & Adventure Keywords fantasy china xianxia Content Score 86 Almost there... Top Contributors M 72 Maria180493 3 Elizabeth Jennings s 2 speedycars s 1 sinistervn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}