{"link": "https://www.themoviedb.org/tv/8631?language=en", "title": "Northwest Passage", "resume": "Northwest Passage is a 26-episode half-hour adventure television series produced by Metro Goldwyn Mayer about Major Robert Rogers during the time of the French and Indian War. The show derived its title and the main characters Rogers, Towne, and Marriner from the 1937 novel of the same name by Kenneth Roberts, and from the 1940 MGM feature film based on the novel. The scope of the novel was much broader than that of the series, and the second half of the book included an historically based attempt by Rogers to find a water route through North America as a \"passage\" to the Pacific Ocean. This attempt, lending its name to the novel and used by Roberts as a metaphor for the questing human spirit, is referenced in the first episode.\nOne of the earlier series telecast in color, Northwest Passage aired new episodes on NBC from September 14, 1958, to March 13, 1959. Keith Larsen played the lead role; Buddy Ebsen, later the star of CBS's The Beverly Hillbillies and Barnaby Jones, appeared as Sergeant Hunk Marriner, and Don Burnett co-starred as Ensign Langdon Towne.", "rate": 70, "genre": ["Drama", "Action", "Adventure"], "cast": ["Buddy Ebsen", "Keith Larsen", "Yvette Vickers", "Philip Tonge", "Don Burnett"], "character": ["Sergeant Hunk Marriner", "Major Robert Rogers", "Molly Pruitt", "General Amherst", "Ensign Langdon Towne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8631   Expand Northwest Passage   (1958) User Score Overview Northwest Passage is a 26-episode half-hour adventure television series produced by Metro Goldwyn Mayer about Major Robert Rogers during the time of the French and Indian War. The show derived its title and the main characters Rogers, Towne, and Marriner from the 1937 novel of the same name by Kenneth Roberts, and from the 1940 MGM feature film based on the novel. The scope of the novel was much broader than that of the series, and the second half of the book included an historically based attempt by Rogers to find a water route through North America as a \"passage\" to the Pacific Ocean. This attempt, lending its name to the novel and used by Roberts as a metaphor for the questing human spirit, is referenced in the first episode. One of the earlier series telecast in color, Northwest Passage aired new episodes on NBC from September 14, 1958, to March 13, 1959. Keith Larsen played the lead role; Buddy Ebsen, later the star of CBS's The Beverly Hillbillies and Barnaby Jones, appeared as Sergeant Hunk Marriner, and Don Burnett co-starred as Ensign Langdon Towne. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Buddy Ebsen Sergeant Hunk Marriner Keith Larsen Major Robert Rogers Yvette Vickers Molly Pruitt Philip Tonge General Amherst Don Burnett Ensign Langdon Towne Full Cast & Crew Last Season Season 1 1958 | 26 Episodes Season 1 of Northwest Passage premiered on September 14, 1958. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Northwest Passage. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 30m Homepage  - Genres Drama Action & Adventure Keywords 18th century french and indian war Content Score 86 Almost there... Top Contributors 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}