{"link": "https://www.themoviedb.org/tv/60863?language=en", "title": "Haikyu!!", "resume": "Shōyō Hinata began playing volleyball after seeing the \"small giants\" who played the sport when he was in elementary school. He suffers a crushing defeat in his first and last tournament in middle school at the hands of his rival Tobio Kageyama. So, Hinata joins Kurasuno High School's volleyball team, vowing revenge against Kageyama. However, Kageyama is also on Kurasuno's team. The former rivals form a legendary combo with Hinata's mobility and Kageyama's precision ball-handling. Together, they take on the local tournaments and vow to meet Kurasuno's fated rival school in the nationals.", "rate": 82, "genre": ["Animation", "Comedy"], "cast": ["Ayumu Murase", "Kaito Ishikawa", "Namikawa Daisuke", "Nobuhiko Okamoto", "Kouki Uchiyama"], "character": ["Shouyou Hinata", "Tobio Kageyama", "Tooru Oikawa", "Yuu Nishinoya", "Kei Tsukishima"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60863   Expand Haikyu!!   (2014) User Score  Play Trailer Overview Shōyō Hinata began playing volleyball after seeing the \"small giants\" who played the sport when he was in elementary school. He suffers a crushing defeat in his first and last tournament in middle school at the hands of his rival Tobio Kageyama. So, Hinata joins Kurasuno High School's volleyball team, vowing revenge against Kageyama. However, Kageyama is also on Kurasuno's team. The former rivals form a legendary combo with Hinata's mobility and Kageyama's precision ball-handling. Together, they take on the local tournaments and vow to meet Kurasuno's fated rival school in the nationals. Featured Crew Susumu Mitsunaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayumu Murase Shouyou Hinata Kaito Ishikawa Tobio Kageyama Namikawa Daisuke Tooru Oikawa Nobuhiko Okamoto Yuu Nishinoya Kouki Uchiyama Kei Tsukishima Full Cast & Crew Last Season Haikyu!! Karasuno Kōkō VS Shiratorizawa Gakuen Kōkō 2016 | 10 Episodes Season 3 of Haikyu!! premiered on October  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2016-04-09 Kiznaiver 6.9    2016-10-09 Poco's Udon World 8.3    1999-10-16 Hunter X Hunter 7.7    2015-04-03 Food Wars!: Shokugeki no Soma 7.9    2011-01-11 Is This a Zombie? 7.7    2013-07-04 Free! 6.4    2016-01-09 Showa and Genroku Era Lover's Suicide Through Rakugo 8.2    2014-01-05 Noragami 7.4  Facts Original Name  ハイキュー!! Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.j-haikyu.com/anime/ Genres Animation Comedy Keywords sport volleyball based on manga shounen anime Content Score 100 Yes! Looking good! Top Contributors 39 sp1ti 22 Elizabeth Jennings J 17 JessicaBeatriz c 8 coffinbearer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}