{"link": "https://www.themoviedb.org/tv/2719?language=en", "title": "Coupling", "resume": "Coupling is a British television sitcom written by Steven Moffat that aired on BBC2 from May 2000 to June 2004. Produced by Hartswood Films for the BBC, the show centres on the dating and sexual adventures and mishaps of six friends in their thirties, often depicting the three women and the three men each talking among themselves about the same events, but in entirely different terms.\nThe series was inspired by Moffat's relationship with producer Sue Vertue, to the extent that they gave their names to two of the characters. Coupling is an example of the \"group-genre\", an ensemble show that had proven popular at the time. Critics compared the show to the American sitcoms Friends and Seinfeld.\nThe critical reaction was largely positive, and the show was named \"Best TV Comedy\" at the 2003 British Comedy Awards. The show debuted to unimpressive ratings, but its popularity soon increased and by the end of the third series the show had achieved decent ratings in the UK. The series began airing on PBS stations and on BBC America in the United States in late 2002 and quickly gained a devoted fanbase there as well. The show is syndicated around the world. Short-lived American and Greek adaptations were briefly produced in 2003 and 2007 respectively.", "rate": 78, "genre": ["Comedy"], "cast": ["Jack Davenport", "Gina Bellman", "Sarah Alexander", "Kate Isitt", "Ben Miles"], "character": ["Steve Taylor", "Jane Christie", "Susan Walker", "Sally Harper", "Patrik Bateman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2719   Expand Coupling   (2000) User Score  Play Trailer Overview Coupling is a British television sitcom written by Steven Moffat that aired on BBC2 from May 2000 to June 2004. Produced by Hartswood Films for the BBC, the show centres on the dating and sexual adventures and mishaps of six friends in their thirties, often depicting the three women and the three men each talking among themselves about the same events, but in entirely different terms. The series was inspired by Moffat's relationship with producer Sue Vertue, to the extent that they gave their names to two of the characters. Coupling is an example of the \"group-genre\", an ensemble show that had proven popular at the time. Critics compared the show to the American sitcoms Friends and Seinfeld. The critical reaction was largely positive, and the show was named \"Best TV Comedy\" at the 2003 British Comedy Awards. The show debuted to unimpressive ratings, but its popularity soon increased and by the end of the third series the show had achieved decent ratings in the UK. The series began airing on PBS stations and on BBC America in the United States in late 2002 and quickly gained a devoted fanbase there as well. The show is syndicated around the world. Short-lived American and Greek adaptations were briefly produced in 2003 and 2007 respectively. Featured Crew Steven Moffat Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  18 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Davenport Steve Taylor Gina Bellman Jane Christie Sarah Alexander Susan Walker Kate Isitt Sally Harper Ben Miles Patrik Bateman Full Cast & Crew Last Season Season 4 2004 | 6 Episodes Season 4 of Coupling premiered on May 10, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  18 Posters  7 Recommendations   2000-09-29 Black Books 8.1    2006-02-03 The IT Crowd 8.2    1989-01-13 A Bit of Fry and Laurie 8.0    1995-04-21 Father Ted 7.9    2004-09-03 Green Wing 8.0    1996-01-09 3rd Rock from the Sun 7.3    1999-01-11 The League of Gentlemen 7.4    2003-09-19 Peep Show 8.2  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/coupling/ Genres Comedy Keywords sex sexual humor group of friends sitcom innuendo british humour dirty joke Content Score 100 Yes! Looking good! Top Contributors p 25 pertolero 10 Banana r 8 rick555 6 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}