{"link": "https://www.themoviedb.org/tv/30285?language=en", "title": "Safe Harbor", "resume": "Safe Harbor is an American television drama series that aired on The WB Television Network from September 20, 1999 to November 28, 1999. The series was created and executive produced by Brenda Hampton, who at the time was best known for work on the fellow WB series 7th Heaven, the series was paired with 7th Heaven on the network's Monday night lineup. Despite 7th Heaven being the No. 1 show on The WB during the 1999-2000 season, Safe Harbor was unable to hold a solid audience after 7th Heaven and was canceled after ten episodes with the show moving to Sunday nights where the last two episodes aired.", "rate": 0, "genre": ["Drama"], "cast": ["Chyler Leigh", "Orlando Brown", "Christopher Khayman Lee", "Rue McClanahan", "Gregory Harrison"], "character": ["Jamie Martin", "Chris", "Hayden Loring", "Grandma Loring", "John Loring"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30285   Expand Safe Harbor   (1999) User Score Overview Safe Harbor is an American television drama series that aired on The WB Television Network from September 20, 1999 to November 28, 1999. The series was created and executive produced by Brenda Hampton, who at the time was best known for work on the fellow WB series 7th Heaven, the series was paired with 7th Heaven on the network's Monday night lineup. Despite 7th Heaven being the No. 1 show on The WB during the 1999-2000 season, Safe Harbor was unable to hold a solid audience after 7th Heaven and was canceled after ten episodes with the show moving to Sunday nights where the last two episodes aired. Featured Crew Brenda Hampton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chyler Leigh Jamie Martin Orlando Brown Chris Christopher Khayman Lee Hayden Loring Rue McClanahan Grandma Loring Gregory Harrison John Loring Full Cast & Crew Last Season Season 1 — | 11 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Safe Harbor. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Drama Keywords florida sheriff motel single father Content Score 79 Pump it up! We're close now. Top Contributors 17 Banana 3 Zlogorek TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}