{"link": "https://www.themoviedb.org/tv/61862?language=en", "title": "Heart to Heart", "resume": "Cha Hong Do suffers from social phobia and has a problem with severe blushing. She does have a strong sense of curiosity and learns from books and the internet. One day, Cha Hong Do's grandmother dies. Her grandmother was her only contact to the outside world. Cha Hong Do then begins doing housework as a maid, but disguises herself as an elderly woman. Through an incident, she meets a psychiatrist, Ko Yi Suk.", "rate": 0, "genre": ["Comedy", "Romance"], "cast": ["Choi Kang-hee", "Chun Jung-myung", "Lee Jae-yoon", "Ahn So-hee", "Uhm Hyo-sup"], "character": ["Cha Hong-do", "Go Yi-seok", "Jang Doo-soo", "Go Se-ro", "Go Jae-woong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61862   Expand Heart to Heart   (2015) User Score Overview Cha Hong Do suffers from social phobia and has a problem with severe blushing. She does have a strong sense of curiosity and learns from books and the internet. One day, Cha Hong Do's grandmother dies. Her grandmother was her only contact to the outside world. Cha Hong Do then begins doing housework as a maid, but disguises herself as an elderly woman. Through an incident, she meets a psychiatrist, Ko Yi Suk. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Kang-hee Cha Hong-do Chun Jung-myung Go Yi-seok Lee Jae-yoon Jang Doo-soo Ahn So-hee Go Se-ro Uhm Hyo-sup Go Jae-woong Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of Heart to Heart premiered on January  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Heart to Heart. You can help by rating TV shows you've seen. Facts Original Name  하트 투 하트 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/tvnheart Genres Comedy Romance Keywords korea Content Score 86 Almost there... Top Contributors M 42 Maria180493 z 5 zurman1 3 lareina123 t 2 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}