{"link": "https://www.themoviedb.org/tv/143?language=en", "title": "Popetown", "resume": "Popetown is a controversial animated sitcom, billed by its producers as \"Father Ted meets South Park\", following the doodles and scribblings of a student at school during a lesson. His drawings depict the life of Father Nicholas, who lives in a Vatican City parody referred to as \"Popetown\". He is charged with being the handler for the Pope who is a complete nincompoop with the emotional and mental maturity of a four-year-old. Father Nicholas must keep the Pope out of trouble, and make sure the general public does not find out that the Holy Father is a drooling idiot. Other characters include a priest who is a sexual deviant, and a trio of corrupt cardinals who secretly run Popetown and attempt to get rich behind the Pope's back. These and other elements caused the show to be extremely controversial.\nThe original English-language version of the show features the voices of actor and Popetown writer Mackenzie Crook, Little Britain co-creator Matt Lucas, providing the voice for one of the cardinals, and actress Jerry Hall. Ruby Wax is the voice actor for The Pope.\nThe series was originally commissioned by BBC Three in the United Kingdom, but was dropped from scheduling without a screening in the wake of protests from Roman Catholics. The premiere screened on New Zealand's C4 television network on 8 June 2005. Despite never being shown on British television, it was eventually released on DVD in the UK by Revolver Entertainment on 5 September 2005, in Australia by Roadshow Entertainment and in Germany, where it was aired on television, by Polyband. It is also currently aired on several MTV channels, including MTV Latin America, MTV Latvia, MTV Estonia and others. The show was also banned in some countries.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Matt Lucas", "Morwenna Banks", "Bob Mortimer", "Jerry Hall", "Ben Miller"], "character": ["Cardinal One (voice)", "Sister Marie (voice)", "Father Nicholas (voice)", "Sister Penelope (voice)", "The Priest (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 143   Expand Popetown   (2005) User Score Overview Popetown is a controversial animated sitcom, billed by its producers as \"Father Ted meets South Park\", following the doodles and scribblings of a student at school during a lesson. His drawings depict the life of Father Nicholas, who lives in a Vatican City parody referred to as \"Popetown\". He is charged with being the handler for the Pope who is a complete nincompoop with the emotional and mental maturity of a four-year-old. Father Nicholas must keep the Pope out of trouble, and make sure the general public does not find out that the Holy Father is a drooling idiot. Other characters include a priest who is a sexual deviant, and a trio of corrupt cardinals who secretly run Popetown and attempt to get rich behind the Pope's back. These and other elements caused the show to be extremely controversial. The original English-language version of the show features the voices of actor and Popetown writer Mackenzie Crook, Little Britain co-creator Matt Lucas, providing the voice for one of the cardinals, and actress Jerry Hall. Ruby Wax is the voice actor for The Pope. The series was originally commissioned by BBC Three in the United Kingdom, but was dropped from scheduling without a screening in the wake of protests from Roman Catholics. The premiere screened on New Zealand's C4 television network on 8 June 2005. Despite never being shown on British television, it was eventually released on DVD in the UK by Revolver Entertainment on 5 September 2005, in Australia by Roadshow Entertainment and in Germany, where it was aired on television, by Polyband. It is also currently aired on several MTV channels, including MTV Latin America, MTV Latvia, MTV Estonia and others. The show was also banned in some countries. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt Lucas Cardinal One (voice) Morwenna Banks Sister Marie (voice) Bob Mortimer Father Nicholas (voice) Jerry Hall Sister Penelope (voice) Ben Miller The Priest (voice) Full Cast & Crew Last Season Season 1 2005 | 10 Episodes Season 1 of Popetown premiered on June  8, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Popetown. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.popetown.com/ Genres Animation Comedy Keywords pope religion adult animation Content Score 86 Almost there... Top Contributors 21 Banana m 3 morrison R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}