{"link": "https://www.themoviedb.org/tv/3834?language=en", "title": "Eyes Down", "resume": "Eyes Down is a comedy starring Paul O'Grady as Ray Temple, the manager of a bingo hall in Liverpool, England called The Rio, although the series was filmed in Rayners Lane in London. Although it had moderate ratings, the programme only lasted for two series until it was cancelled by the BBC in 2004. The show was written by Angela Clarke and directed by Christine Gernon.", "rate": 50, "genre": ["Comedy"], "cast": ["Paul O'Grady", "Rosie Cavaliero", "Edna Doré", "Hazel Douglas", "Neil Fitzmaurice"], "character": ["Ray Temple", "Christine", "Mary", "Kathline", "Bobby"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3834   Expand Eyes Down   (2003) User Score Overview Eyes Down is a comedy starring Paul O'Grady as Ray Temple, the manager of a bingo hall in Liverpool, England called The Rio, although the series was filmed in Rayners Lane in London. Although it had moderate ratings, the programme only lasted for two series until it was cancelled by the BBC in 2004. The show was written by Angela Clarke and directed by Christine Gernon. Featured Crew Angela Clarke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul O'Grady Ray Temple Rosie Cavaliero Christine Edna Doré Mary Hazel Douglas Kathline Neil Fitzmaurice Bobby Full Cast & Crew Last Season Season 2 2004 | 7 Episodes Season 2 of Eyes Down premiered on September  3, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Eyes Down. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 13 Markxist H 1 HelloCharlie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}