{"link": "https://www.themoviedb.org/tv/14665?language=en", "title": "Fortunes of War", "resume": "Fortunes of War is a 1987 BBC television adaptation of Olivia Manning's cycle of novels Fortunes of War. It stars Kenneth Branagh as Guy Pringle, lecturer in English Literature in Bucharest during the early part of the Second World War, and Emma Thompson as his wife Harriet. Other cast members included Ronald Pickup, Robert Stephens, Alan Bennett, Philip Madoc and Rupert Graves. The series stays relatively faithful to the original novels, with no notable departures from their plot.", "rate": 70, "genre": ["Drama"], "cast": ["Emma Thompson", "Rupert Graves", "Kenneth Branagh", "Robert Stephens", "Ronald Pickup"], "character": ["Harriet Pringle", "Guy Pringle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14665   Expand Fortunes of War   (1987) User Score Overview Fortunes of War is a 1987 BBC television adaptation of Olivia Manning's cycle of novels Fortunes of War. It stars Kenneth Branagh as Guy Pringle, lecturer in English Literature in Bucharest during the early part of the Second World War, and Emma Thompson as his wife Harriet. Other cast members included Ronald Pickup, Robert Stephens, Alan Bennett, Philip Madoc and Rupert Graves. The series stays relatively faithful to the original novels, with no notable departures from their plot. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emma Thompson Harriet Pringle Rupert Graves Kenneth Branagh Guy Pringle Robert Stephens Ronald Pickup Full Cast & Crew Last Season Season 1 1987 | 7 Episodes Season 1 of Fortunes of War premiered on October 11, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Fortunes of War. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 2 Rebecca I 1 Iain_S 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}