{"link": "https://www.themoviedb.org/tv/4694?language=en", "title": "Phoenix", "resume": "Love is timing. Love needs just the \"right time\". It's not because you  loved him or her less that you parted. Heaven brings you your soul mate  when the time is just \"right\". \"Phoenix\" shows you this heaven's work.\nThere is a young couple who desperately fell in love but who couldn't be  together because the time wasn't just right for them. Years pass by and  these two meet again. And the trick of fortune switches their situation  and environments. A daughter of a millionaire has now become an helper  suffering from the grim realities of life. On the other hand, an orphan  self-supporting student is now an accomplished wealthy businessman. Now  these two people are looking at the world with different eyes. The  childlike girl has finally learned the harshness of the world and the  guy with once twisted mind has learned to enjoy the latitude of mind. In  the end, these two start to understand each other, thus arriving at the  \"right time\".", "rate": 0, "genre": ["Drama"], "cast": ["Lee Seo-jin", "Lee Eun-ju", "Jung Hye-young", "Eric Mun", "Park Geun-hyung"], "character": ["Jang Sae-hoon", "Lee Ji-eun", "Yoon Mi-ran", "Seo Jung-min", "Seo Moon-soo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4694   Expand Phoenix   (2004) User Score Overview Love is timing. Love needs just the \"right time\". It's not because you  loved him or her less that you parted. Heaven brings you your soul mate  when the time is just \"right\". \"Phoenix\" shows you this heaven's work.\nThere is a young couple who desperately fell in love but who couldn't be  together because the time wasn't just right for them. Years pass by and  these two meet again. And the trick of fortune switches their situation  and environments. A daughter of a millionaire has now become an helper  suffering from the grim realities of life. On the other hand, an orphan  self-supporting student is now an accomplished wealthy businessman. Now  these two people are looking at the world with different eyes. The  childlike girl has finally learned the harshness of the world and the  guy with once twisted mind has learned to enjoy the latitude of mind. In  the end, these two start to understand each other, thus arriving at the  \"right time\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Seo-jin Jang Sae-hoon Lee Eun-ju Lee Ji-eun Jung Hye-young Yoon Mi-ran Eric Mun Seo Jung-min Park Geun-hyung Seo Moon-soo Full Cast & Crew Last Season Season 1 2004 | 26 Episodes Season 1 of Phoenix premiered on April  5, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Phoenix. You can help by rating TV shows you've seen. Facts Original Name  불새 Status  Ended Networks Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/firebird/ Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors t 21 tmdb983464 N 21 Nightowl.Kr z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}