{"link": "https://www.themoviedb.org/tv/21444?language=en", "title": "The Elegant Universe", "resume": "One of the most ambitious and exciting theories ever proposed—one that may be the long-sought \"theory of everything,\" which eluded even Einstein—gets a masterful, lavishly computer-animated explanation from bestselling author-physicist Brian Greene, when NOVA presents the nuts, bolts, and sometimes outright nuttiness of string theory.", "rate": 79, "genre": ["Documentary"], "cast": ["Brian Greene", "Steven Weinberg", "Nima Arkani-Hamed"], "character": ["Host", "Weinberg", "Nima"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21444   Expand The Elegant Universe   (2003) User Score  Play Trailer Overview One of the most ambitious and exciting theories ever proposed—one that may be the long-sought \"theory of everything,\" which eluded even Einstein—gets a masterful, lavishly computer-animated explanation from bestselling author-physicist Brian Greene, when NOVA presents the nuts, bolts, and sometimes outright nuttiness of string theory. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Greene Host Steven Weinberg Weinberg Nima Arkani-Hamed Nima Full Cast & Crew Last Season Season 1 2003 | 3 Episodes Season 1 of The Elegant Universe premiered on October 28, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2007-03-05 Shaun the Sheep 7.6    2003-12-08 Battlestar Galactica 8.3    1995-05-14 The Langoliers 5.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  180m Homepage   http://www.pbs.org/wgbh/nova/elegant/about.html Genres Documentary Keywords physics string theory Content Score 64 We're so close, yet so far. Top Contributors TB 25 TMDb Bot 5 Banana 3 Elizabeth Jennings f 2 fegarcia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}