{"link": "https://www.themoviedb.org/tv/65525?language=en", "title": "Dr. DMAT", "resume": "DMAT, the acronym for the “Disaster Medical Assistance Team”, was first established in 2004. For the past 10 years, the team has been providing on-site emergency assistance at disaster-hit areas. Yakumo Hibiki was an surgeon at the Arisukawa General Hospital’s Emergency Unit, but due to a mistake involving his sister Haruko, he has since been transferred to the internal medicine unit. One day, the hospital Director, Dr. Isesaki Katsuichi, requests for Hibiki to move to DMAT. His childhood friend, Nurse Yoshioka Rin, encourages him to take up the role, but upon joining the team, Hibiki finds his new colleagues aloof and a little eccentric. His first assignment is to a pile-up accident in a road tunnel, and he finds himself working against time to provide medical treatment to those who require immediate attention.", "rate": 0, "genre": ["Action"], "cast": ["Tadayoshi Okura", "Ai Kato", "Miori Takimoto", "Yumi Asou", "Jiro Sato"], "character": ["Dr. DMAT", "Rin Yoshioka", "Haruko Yakumo", "Kumiko Hasegawa", "Tatsuya Kozone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65525   Expand Dr. DMAT   (2014) User Score  Play Trailer Overview DMAT, the acronym for the “Disaster Medical Assistance Team”, was first established in 2004. For the past 10 years, the team has been providing on-site emergency assistance at disaster-hit areas. Yakumo Hibiki was an surgeon at the Arisukawa General Hospital’s Emergency Unit, but due to a mistake involving his sister Haruko, he has since been transferred to the internal medicine unit. One day, the hospital Director, Dr. Isesaki Katsuichi, requests for Hibiki to move to DMAT. His childhood friend, Nurse Yoshioka Rin, encourages him to take up the role, but upon joining the team, Hibiki finds his new colleagues aloof and a little eccentric. His first assignment is to a pile-up accident in a road tunnel, and he finds himself working against time to provide medical treatment to those who require immediate attention. Featured Crew Hiroshi Takano Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tadayoshi Okura Dr. DMAT Ai Kato Rin Yoshioka Miori Takimoto Haruko Yakumo Yumi Asou Kumiko Hasegawa Jiro Sato Tatsuya Kozone Full Cast & Crew Last Season Season 1 2014 | 11 Episodes Season 1 of Dr. DMAT premiered on January  9, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dr. DMAT. You can help by rating TV shows you've seen. Facts Original Name  ドクター　ディーマット Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  51m Homepage  - Genres Action Keywords medical drama Content Score 100 Yes! Looking good! Top Contributors A 50 Aka75 TB 3 TMDb Bot 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}