{"link": "https://www.themoviedb.org/tv/1149?language=en", "title": "KO One", "resume": "KO One is a 2005 Taiwanese drama starring Jiro Wang, Calvin Chen, Aaron Yan and Danson Tang. It was produced by Comic International Productions and was first broadcast in Taiwan on cable TV Gala Television Variety Show/CH 28 on 26 November 2005 to 27 May 2006.\nBefore this drama was aired there was not much interests in it, due to the storyline and unfamiliar cast. Despite the new encounters, the ratings of KO One exceeded expectations. Although the ratings were not high, it brought fame to three of the four leads, who are part of the then newly formed Taiwanese boy band called Fahrenheit. This drama also brought fame to the Taiwanese artist, Tank who wrote and sang the opening and ending theme songs. The KO One original soundtrack was the best selling soundtrack of 2006, selling more than 60,000 copies in Taiwan within the first month of release.\nThe sequel The X-Family was broadcast from 8 August 2007 to 23 October 2007 and threequel, K.O.3an Guo was broadcast from 28 February 2009 to 27 February 2010, on cable TV Gala Television Variety Show/CH 28.", "rate": 50, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Jiro Wang", "Calvin Chen", "Aaron Yan", "Danson Tang"], "character": ["Wang Dadong", "Wang Yase", "Ding Xiaoyu", "Lei Kesi / Wu Shiduo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1149   Expand KO One   (2005) User Score Overview KO One is a 2005 Taiwanese drama starring Jiro Wang, Calvin Chen, Aaron Yan and Danson Tang. It was produced by Comic International Productions and was first broadcast in Taiwan on cable TV Gala Television Variety Show/CH 28 on 26 November 2005 to 27 May 2006. Before this drama was aired there was not much interests in it, due to the storyline and unfamiliar cast. Despite the new encounters, the ratings of KO One exceeded expectations. Although the ratings were not high, it brought fame to three of the four leads, who are part of the then newly formed Taiwanese boy band called Fahrenheit. This drama also brought fame to the Taiwanese artist, Tank who wrote and sang the opening and ending theme songs. The KO One original soundtrack was the best selling soundtrack of 2006, selling more than 60,000 copies in Taiwan within the first month of release. The sequel The X-Family was broadcast from 8 August 2007 to 23 October 2007 and threequel, K.O.3an Guo was broadcast from 28 February 2009 to 27 February 2010, on cable TV Gala Television Variety Show/CH 28. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jiro Wang Wang Dadong Calvin Chen Wang Yase Aaron Yan Ding Xiaoyu Danson Tang Lei Kesi / Wu Shiduo Full Cast & Crew Last Season Season 1 2005 | 21 Episodes Season 1 of KO One premiered on November 26, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on KO One. You can help by rating TV shows you've seen. Facts Original Name  終極一班 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  60m, 90m Homepage   http://www.gtv.com.tw/Program/S051420051126P/ Genres Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 16 Wendy c 4 ctchim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}