{"link": "https://www.themoviedb.org/tv/2038?language=en", "title": "Drake & Josh", "resume": "Drake & Josh is an American television sitcom created by Dan Schneider for Nickelodeon. The series follows the lives of two teenage boys with opposing personalities, Drake Parker and Josh Nichols, who become stepbrothers. Both actors had played previous roles in The Amanda Show along with Nancy Sullivan, who plays Audrey, Drake and Megan's mother of the series. Miranda Cosgrove plays Audrey's daughter, Megan, Drake's mischievous younger sister and Jonathan Goldstein plays Walter, Josh's father. The series' opening theme song I Found a Way is written by Drake Bell and Backhouse Mike and performed by Bell. The series ran for four seasons and 60 episodes from January 11, 2004 to December 5, 2008 and has received critical acclaim. There were also three TV films: Drake & Josh Go Hollywood premiered on Friday, January 6, 2006; Really Big Shrimp premiered on Friday, August 3, 2007; and Merry Christmas, Drake & Josh premiered on Friday, December 5, 2008. Reruns of the series currently air on Nickelodeon and TeenNick.", "rate": 72, "genre": ["Comedy"], "cast": ["Drake Bell", "Josh Peck", "Nancy Sullivan", "Miranda Cosgrove", "Jonathan Goldstein"], "character": ["Drake Parker", "Josh Nichols", "Audrey Parker-Nichols", "Megan Parker", "Walter Nichols"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2038   Expand Drake & Josh   (2004) User Score Overview Drake & Josh is an American television sitcom created by Dan Schneider for Nickelodeon. The series follows the lives of two teenage boys with opposing personalities, Drake Parker and Josh Nichols, who become stepbrothers. Both actors had played previous roles in The Amanda Show along with Nancy Sullivan, who plays Audrey, Drake and Megan's mother of the series. Miranda Cosgrove plays Audrey's daughter, Megan, Drake's mischievous younger sister and Jonathan Goldstein plays Walter, Josh's father. The series' opening theme song I Found a Way is written by Drake Bell and Backhouse Mike and performed by Bell. The series ran for four seasons and 60 episodes from January 11, 2004 to December 5, 2008 and has received critical acclaim. There were also three TV films: Drake & Josh Go Hollywood premiered on Friday, January 6, 2006; Really Big Shrimp premiered on Friday, August 3, 2007; and Merry Christmas, Drake & Josh premiered on Friday, December 5, 2008. Reruns of the series currently air on Nickelodeon and TeenNick. Featured Crew Dan Schneider Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Drake Bell Drake Parker Josh Peck Josh Nichols Nancy Sullivan Audrey Parker-Nichols Miranda Cosgrove Megan Parker Jonathan Goldstein Walter Nichols Full Cast & Crew Last Season Season 4 2006 | 20 Episodes Season 4 of Drake & Josh premiered on September 24, 2006. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w S4E03: \"The Wedding\" Open 0 by wonder2wonder\n      \n     w Josh: Happy Birthday Josh Peck! Open 0 by wonder2wonder\n      \n     w Audrey: Happy Birthday Nancy Sullivan! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2007-09-08 iCarly 6.3    2006-12-02 The Suite Life of Zack & Cody 5.3    2007-10-12 Wizards of Waverly Place 6.6    2004-09-07 Ned's Declassified School Survival Guide 5.7    2008-09-26 The Suite Life on Deck 6.1    2006-03-24 Hannah Montana 5.0    2003-01-17 That's So Raven 5.6    2001-03-30 The Fairly OddParents 6.7  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m, 27m Homepage   http://www.nick.com/shows/drake_and_josh/index.jhtml Genres Comedy Keywords sibling relationship teenager family blended family Content Score 93 Almost there... Top Contributors 32 Banana 6 André Gama z 5 zurman1 c 5 courtneysmith86  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}