{"link": "https://www.themoviedb.org/tv/24403?language=en", "title": "renegadepress.com", "resume": "Aboriginal hip-hop artist Jack Sinclair and his best friend Zoey Jones established an underground ezine called renegadepress.com. What started as a pet project soon took on a life of its own pushing Jack, Zoey and their crew of renegade reporters to deliver the goods on what's really going on in the lives of today's teens.", "rate": 30, "genre": ["Drama"], "cast": ["Bronson Pelletier", "Ksenia Solo", "Ishan Davé", "Nolan Gerard Funk", "Rachel Colwell"], "character": ["Jack Sinclair", "Zoey Jones", "Sandi Bhutella", "Ben LaLonde", "Crystal Sinclair"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24403   Expand renegadepress.com   (2004) User Score Overview Aboriginal hip-hop artist Jack Sinclair and his best friend Zoey Jones established an underground ezine called renegadepress.com. What started as a pet project soon took on a life of its own pushing Jack, Zoey and their crew of renegade reporters to deliver the goods on what's really going on in the lives of today's teens. Featured Crew Virginia Thompson Creator Robert de Lint Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bronson Pelletier Jack Sinclair Ksenia Solo Zoey Jones Ishan Davé Sandi Bhutella Nolan Gerard Funk Ben LaLonde Rachel Colwell Crystal Sinclair Full Cast & Crew Last Season Season 5 2008 | 8 Episodes Season 5 of renegadepress.com premiered on March  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on renegadepress.com. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://renegadepress.com/ Genres Drama Keywords high school native american teenager aspiring writer school newspaper racial issues teen social issues Content Score 93 Almost there... Top Contributors 45 United600 13 lineker 10 Banana 1 seawolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}