{"link": "https://www.themoviedb.org/tv/43992?language=en", "title": "Add a Friend", "resume": "Add a Friend is a German comedy-drama created and written by Sebastian Wehlings and Christian Lyra for TNT Serie. The series follows a group of people and their lives in the social network.\nThis is the first German production produced exclusively for premium television. A first season consisting of ten episodes were ordered. Add a Friend is set to premiere on September 19, 2012, on Wednesday nights at 8:15 pm.", "rate": 0, "genre": ["Comedy"], "cast": ["Ken Duken", "Friedrich Mücke", "Gisela Schneeberger", "Dietrich Hollinderbäumer", "Emilia Schüle"], "character": ["Felix Wagner", "Tom Schrader", "Gisela Wagner", "Gerd Wagner", "Vanessa Jo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43992   Expand Add a Friend   (2012) User Score Overview Add a Friend is a German comedy-drama created and written by Sebastian Wehlings and Christian Lyra for TNT Serie. The series follows a group of people and their lives in the social network. This is the first German production produced exclusively for premium television. A first season consisting of ten episodes were ordered. Add a Friend is set to premiere on September 19, 2012, on Wednesday nights at 8:15 pm. Featured Crew Sebastian Wehlings Creator Christian Lyra Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Duken Felix Wagner Friedrich Mücke Tom Schrader Gisela Schneeberger Gisela Wagner Dietrich Hollinderbäumer Gerd Wagner Emilia Schüle Vanessa Jo Full Cast & Crew Last Season Season 3 2014 | 10 Episodes Season 3 of Add a Friend premiered on January  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Add a Friend. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  - Homepage   http://www.addafriend.de/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 23 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}