{"link": "https://www.themoviedb.org/tv/56074?language=en", "title": "The Castle of Olive Trees", "resume": "The Castle of Olive Trees is the ancestral home of the \"Laborie de Sauveterre\". Located at \"Châteauneuf-du-Pape\", it holds many mysteries and legends. Like every summer \"Estelle Laborie\" goes there to take some time off. But this summer she take an important decision: run from Paris and stay here at the castle definitively. \nLittle does she knows that her arrival will awake a lot of drama and secrets, beginning with this enigmatic \"Pierre Séverin\" who wants to demolish the castle to the ground, to make an  amusement parc \"Cigaleland\". She will learn unfortunately that this \"Pierre Séverin\" is also knowned as \"Marceau\" the little boy of the steward of the castle when her father was the master of the domain. That steward also died in terrible circumstance.\nHowever Estelle decides to face this vengeance and save the castle with the aid of archaeologist \"Raphaël Fauconnier\"...", "rate": 60, "genre": ["Drama"], "cast": ["Brigitte Fossey", "Georges Corraface", "Jacques Perrin"], "character": ["Estelle Laborie", "Raphaël Fauconnier", "Pierre Séverin (Marceau Dupastre)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56074   Expand The Castle of Olive Trees   (1993) User Score Overview The Castle of Olive Trees is the ancestral home of the \"Laborie de Sauveterre\". Located at \"Châteauneuf-du-Pape\", it holds many mysteries and legends. Like every summer \"Estelle Laborie\" goes there to take some time off. But this summer she take an important decision: run from Paris and stay here at the castle definitively.  Little does she knows that her arrival will awake a lot of drama and secrets, beginning with this enigmatic \"Pierre Séverin\" who wants to demolish the castle to the ground, to make an  amusement parc \"Cigaleland\". She will learn unfortunately that this \"Pierre Séverin\" is also knowned as \"Marceau\" the little boy of the steward of the castle when her father was the master of the domain. That steward also died in terrible circumstance. However Estelle decides to face this vengeance and save the castle with the aid of archaeologist \"Raphaël Fauconnier\"... Featured Crew Louis Velle Creator Frédérique Hébrard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brigitte Fossey Estelle Laborie Georges Corraface Raphaël Fauconnier Jacques Perrin Pierre Séverin (Marceau Dupastre) Full Cast & Crew Last Season Season 1 1993 | 8 Episodes Season 1 of The Castle of Olive Trees premiered on June 20, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Castle of Olive Trees. You can help by rating TV shows you've seen. Facts Original Name  Le Château des oliviers Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors m 15 moviemaniac809  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}