{"link": "https://www.themoviedb.org/tv/8771?language=en", "title": "Oppenheimer", "resume": "Oppenheimer is a television serial about J. Robert Oppenheimer, produced by the BBC. It began broadcast in the United Kingdom on 29 October 1980 and in the United States on 11 May 1982. The series starred Sam Waterston as Oppenheimer.\nThe series was nominated for seven BAFTA Television Awards and won three. It was nominated for two Emmy Awards, for Outstanding Limited Series and for Outstanding Writing in a Limited Series or a Special. It was nominated for a Golden Globe Award for Best Performance by an Actor in a Mini-Series or Motion Picture Made for TV.", "rate": 80, "genre": ["Drama"], "cast": ["Sam Waterston", "Shane Rimmer", "Alexander Knox", "Phil Brown", "Edward Hardwicke"], "character": ["Robert Oppenheimer", "Enrico Fermi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8771   Expand Oppenheimer   (1980) User Score Overview Oppenheimer is a television serial about J. Robert Oppenheimer, produced by the BBC. It began broadcast in the United Kingdom on 29 October 1980 and in the United States on 11 May 1982. The series starred Sam Waterston as Oppenheimer. The series was nominated for seven BAFTA Television Awards and won three. It was nominated for two Emmy Awards, for Outstanding Limited Series and for Outstanding Writing in a Limited Series or a Special. It was nominated for a Golden Globe Award for Best Performance by an Actor in a Mini-Series or Motion Picture Made for TV. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Waterston Robert Oppenheimer Shane Rimmer Alexander Knox Phil Brown Edward Hardwicke Enrico Fermi Full Cast & Crew Last Season Season 1 1980 | 7 Episodes Season 1 of Oppenheimer premiered on October 28, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Oppenheimer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 15 TMDb Bot 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}