{"link": "https://www.themoviedb.org/tv/1906?language=en", "title": "Shameless", "resume": "The story of a young group of siblings pretty much abandoned by their parents, surviving by their wits - and humor - on a rough Manchester council estate. Whilst they won't admit it, they need help and find it in Steve, a young middle class lad who falls for Fiona, the oldest sibling, and increasingly finds himself drawn to this unconventional and unique family. Anarchic family life seen through the eyes of an exceptionally bright fifteen year old, who struggles to come of age in the context of his belligerent father, closeted brother, psychotic sister and internet porn star neighbors.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["David Threlfall", "Rebecca Atkinson", "Alice Barry", "Nicky Evans", "Tina Malone"], "character": ["Frank Gallagher", "Karen Jackson", "Lillian Tyler", "Shane Maguire", "Mimi Maguire"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1906   Expand Shameless   (2004) User Score Overview The story of a young group of siblings pretty much abandoned by their parents, surviving by their wits - and humor - on a rough Manchester council estate. Whilst they won't admit it, they need help and find it in Steve, a young middle class lad who falls for Fiona, the oldest sibling, and increasingly finds himself drawn to this unconventional and unique family. Anarchic family life seen through the eyes of an exceptionally bright fifteen year old, who struggles to come of age in the context of his belligerent father, closeted brother, psychotic sister and internet porn star neighbors. Featured Crew Paul Abbott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Threlfall Frank Gallagher Rebecca Atkinson Karen Jackson Alice Barry Lillian Tyler Nicky Evans Shane Maguire Tina Malone Mimi Maguire Full Cast & Crew Last Season Season 11 2013 | 14 Episodes Season 11 of Shameless premiered on February 26, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Shameless. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   2004-09-03 Green Wing 8.0    2007-03-12 The Riches 7.6    1998-11-12 Dinnerladies 6.4    1991-06-10 Soldier Soldier 6.5    2012-02-20 The Bleak Old Shop of Stuff 6.7    2001-02-26 Two Pints of Lager and a Packet of Crisps 7.0    2007-05-13 Gavin & Stacey 7.6    2007-04-22 Kingdom 7.0  Facts Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  60m, 45m, 48m Homepage   http://www.channel4.com/programmes/shameless Genres Comedy Drama Keywords sex northern england sibling relationship self-destruction white trash dark comedy big family dysfunctional family sexual humor scam working class crime drugs family single father gritty alcoholic father council estate unemployed manchester british humour family problems Content Score 93 Almost there... Top Contributors 34 rudely_murray 24 Banana O 22 Ozbourne 14 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}