{"link": "https://www.themoviedb.org/tv/61392?language=en", "title": "Jao Sao Rim Tang", "resume": "Nang’ek played by “Poo” Praiya Suandokmai is an out of luck, poor, orphan girl raised by her money-hungry foster mom (Apiradee Pawaputanon), who has a spoiled brat daughter played by “Mint” Nawinda Bertotti. Her foster mom also has a no-good, rapist wannabe boyfriend played by Tharathip Seehadetrungchai (yea, I don’t know who that is), who on occasion will try to assault our nang’ek Rasa.\nOur nang’ek is the ultimate “nangfah (angel)”, she is a diligent worker–values education, values hard-work, kind to others, innocent, virginal, not too shabby on the eyes. Though they treat her as an ATM machine, she refuses to abandon her makeshift, foster family because she feels indebted to them. Soon after her mother passed away so did her father, her foster mother took her in when she had no one to turn to. She feels a moral obligation to her evil foster mom who on many occasions will abuse and take advantage of her. Essentially our nang’ek will be a weak, kindhearted, idiot with spunk.\nAs for our pra’ek Akrin, played by ‘Stefan’ Tasit Sinkanawiwat, he is described as a good-looking, rich playboy with charm. He is a heir to a well-known fitness complex called M Fitness. Akrin sees women has a plaything and love as a game. His grandfather Amnat (Khun Suchao Pongwilai) is fed up with his immature, careless, insincere lifestyle and wants him to get married. If he doesn’t get marry by a certain time, he won’t inherit M Fitness. It will be given to his competitive sister Ornuma (Prae Amery) who also has to get marry if she wants to inherit the family business.\nAs the the marriage deadline slowly approaches and he doesn’t like any of his potential brides, Akrin decides to hire someone as his bride. He hires Rasa, the girl he likes and the only girl in Thailand who has the audacity to reject him every time he makes a move on her. Their marriage will be a sham, it will be for on year and he will pay her 2 million baht ($66,766 USD) total. He will give her 1 million baht at the beginning of their marriage and 1 million baht at the end of their marriage. Rasa accept his offer because she needs the money. Around that time, her foster mother finds herself in the hospital and needs immediate surgery. Thus this is how their life together begins through a fake marriage.", "rate": 65, "genre": ["Soap", "Drama"], "cast": ["Praiya Soandokmai", "Tasit Sinkanawiwat", "Matika Atthakornsiripo", "Rapeepat Eakpankul", "Prae Emery"], "character": ["Rasa", "Akrin", "Ornuma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61392   Expand Jao Sao Rim Tang   (2010) User Score Overview Nang’ek played by “Poo” Praiya Suandokmai is an out of luck, poor, orphan girl raised by her money-hungry foster mom (Apiradee Pawaputanon), who has a spoiled brat daughter played by “Mint” Nawinda Bertotti. Her foster mom also has a no-good, rapist wannabe boyfriend played by Tharathip Seehadetrungchai (yea, I don’t know who that is), who on occasion will try to assault our nang’ek Rasa. Our nang’ek is the ultimate “nangfah (angel)”, she is a diligent worker–values education, values hard-work, kind to others, innocent, virginal, not too shabby on the eyes. Though they treat her as an ATM machine, she refuses to abandon her makeshift, foster family because she feels indebted to them. Soon after her mother passed away so did her father, her foster mother took her in when she had no one to turn to. She feels a moral obligation to her evil foster mom who on many occasions will abuse and take advantage of her. Essentially our nang’ek will be a weak, kindhearted, idiot with spunk. As for our pra’ek Akrin, played by ‘Stefan’ Tasit Sinkanawiwat, he is described as a good-looking, rich playboy with charm. He is a heir to a well-known fitness complex called M Fitness. Akrin sees women has a plaything and love as a game. His grandfather Amnat (Khun Suchao Pongwilai) is fed up with his immature, careless, insincere lifestyle and wants him to get married. If he doesn’t get marry by a certain time, he won’t inherit M Fitness. It will be given to his competitive sister Ornuma (Prae Amery) who also has to get marry if she wants to inherit the family business. As the the marriage deadline slowly approaches and he doesn’t like any of his potential brides, Akrin decides to hire someone as his bride. He hires Rasa, the girl he likes and the only girl in Thailand who has the audacity to reject him every time he makes a move on her. Their marriage will be a sham, it will be for on year and he will pay her 2 million baht ($66,766 USD) total. He will give her 1 million baht at the beginning of their marriage and 1 million baht at the end of their marriage. Rasa accept his offer because she needs the money. Around that time, her foster mother finds herself in the hospital and needs immediate surgery. Thus this is how their life together begins through a fake marriage. Featured Crew Kantana Group Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Praiya Soandokmai Rasa Tasit Sinkanawiwat Akrin Matika Atthakornsiripo Rapeepat Eakpankul Prae Emery Ornuma Full Cast & Crew Last Season Season 1 2010 | 10 Episodes Season 1 of Jao Sao Rim Tang premiered on November  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Jao Sao Rim Tang. You can help by rating TV shows you've seen. Facts Original Name  Jao Sao Rim Taeng Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  85m Homepage   http://th.wikipedia.org/wiki/%E0%B8%A3%E0%B8%9E%E0%B8%B5%E0%B8%A0%E0%B8%B1%E0%B8%97%E0%B8%A3_%E0%B9%80%E0%B8%AD%E0%B8%81%E0%B8%9E%E0%B8%B1%E0%B8%99%E0%B8%98%E0%B9%8C%E0%B8%81%E0%B8%B8%E0%B8%A5 Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 43 Crip 5 mariilakorn21 z 5 zurman1 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}