{"link": "https://www.themoviedb.org/tv/35074?language=en", "title": "Four Corners", "resume": "In a growing southwestern community where  old-fashioned values are at odds with changing times, Amanda Wyatt is  forced to run her sprawling ranch while fighting off encroaching  developers after the death of her husband. Living in a town in  transition, where migrant workers toil just down the road from upscale  ski resorts, Amanda finds solace in her friendship with the widowed  Carlota Alvarez, as both try to keep their children on track.", "rate": 0, "genre": ["Soap", "Drama"], "cast": ["Ann-Margret", "Sônia Braga", "Megan Ward", "Raymond J. Barry", "Kamar de los Reyes"], "character": ["Amanda 'Maggie' Wyatt", "Carlota Alvarez", "Kate Wyatt", "Sam Haskell", "Tomas Alvarez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35074   Expand Four Corners   (1998) User Score Overview In a growing southwestern community where  old-fashioned values are at odds with changing times, Amanda Wyatt is  forced to run her sprawling ranch while fighting off encroaching  developers after the death of her husband. Living in a town in  transition, where migrant workers toil just down the road from upscale  ski resorts, Amanda finds solace in her friendship with the widowed  Carlota Alvarez, as both try to keep their children on track. Featured Crew David Jacobs Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ann-Margret Amanda 'Maggie' Wyatt Sônia Braga Carlota Alvarez Megan Ward Kate Wyatt Raymond J. Barry Sam Haskell Kamar de los Reyes Tomas Alvarez Full Cast & Crew Last Season Season 1 1998 | 6 Episodes Season 1 of Four Corners premiered on February 24, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Four Corners. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Soap Drama Keywords southern usa ranch Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana 6 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}