{"link": "https://www.themoviedb.org/tv/39888?language=en", "title": "Leonardo", "resume": "Leonardo is a British children's television series broadcast on CBBC. The show is an adventure programme featuring a teenage Leonardo da Vinci starring Jonathan Bailey. The series is set in 15th-century Florence. A second series premiered on CBBC on 20 September 2012, starting with episodes one and two being shown back to back. For Series 2, actor James Clyde replaced Alistair McGowan in the role of Piero de' Medici. It was announced on 21 January 2013 that Leonardo would not be recommissioned for a third series.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Jonathan Bailey", "Alistair McGowan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39888   Expand Leonardo   (2011) User Score Overview Leonardo is a British children's television series broadcast on CBBC. The show is an adventure programme featuring a teenage Leonardo da Vinci starring Jonathan Bailey. The series is set in 15th-century Florence. A second series premiered on CBBC on 20 September 2012, starting with episodes one and two being shown back to back. For Series 2, actor James Clyde replaced Alistair McGowan in the role of Piero de' Medici. It was announced on 21 January 2013 that Leonardo would not be recommissioned for a third series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Bailey Alistair McGowan Full Cast & Crew Last Season Season 2 2012 | 13 Episodes Season 2 of Leonardo premiered on September 20, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Leonardo. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.bbc.co.uk/cbbc/shows/leonardo Genres Action & Adventure Drama Keywords inventor italy leonardo da vinci teenager 15th century Content Score 56 We're so close, yet so far. Top Contributors 11 Banana s 3 speedycars TB 2 TMDb Bot PS 2 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}