{"link": "https://www.themoviedb.org/tv/2403?language=en", "title": "Downtown", "resume": "Downtown is an animated series on MTV on urban life, based on interviews with real people. The show follows a diverse and multiracial cast who live in New York City, and presents their everyday lives through quirky, humorous, and imaginative perspectives from the characters. It was created by Chris Prynoski, a former animator on Beavis and Butt-Head and produced by David McGrath. In 2000, Downtown was nominated for an Emmy in the category of outstanding animated program.\nDowntown faced a similar fate to many of MTV's other cartoons - it only lasted one season. The use of an original score rather than licensed music makes a sanctioned DVD release unlikely.\nSome of the show's staff have gone on to work on the action animated series Megas XLR, which uses the same quirky humor found in Downtown as well as the character Goat, reprised by Scott Rienecker.", "rate": 80, "genre": ["Animation"], "cast": ["Gregory Gilmore"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2403   Expand Downtown   (1999) User Score Overview Downtown is an animated series on MTV on urban life, based on interviews with real people. The show follows a diverse and multiracial cast who live in New York City, and presents their everyday lives through quirky, humorous, and imaginative perspectives from the characters. It was created by Chris Prynoski, a former animator on Beavis and Butt-Head and produced by David McGrath. In 2000, Downtown was nominated for an Emmy in the category of outstanding animated program. Downtown faced a similar fate to many of MTV's other cartoons - it only lasted one season. The use of an original score rather than licensed music makes a sanctioned DVD release unlikely. Some of the show's staff have gone on to work on the action animated series Megas XLR, which uses the same quirky humor found in Downtown as well as the character Goat, reprised by Scott Rienecker. Featured Crew Chris Prynoski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gregory Gilmore Full Cast & Crew Last Season Season 1 1999 | 13 Episodes Season 1 of Downtown premiered on August  3, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Downtown. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  21m Homepage  - Genres Animation Keywords new york Content Score 64 We're so close, yet so far. Top Contributors 6 Banana A 2 AnthonyAtkins232 1 kuzronk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}