{"link": "https://www.themoviedb.org/tv/75060?language=en", "title": "Infinite Emergence Sex Scandal: The Hottest Office Girl Violence", "resume": "As a husband who can not give birth to a child and lives only in work, Jung Ah and Hoon who keep the couple's life together. Hoon is the vice president of a promising young company, and the president is promoted soon. Another person who burns ambition under him is Sang-doo. He is an ambition to do anything for ambition. One day, Sooke and his wife Jesse, who were invited to the house of Hoon for dinner. Mr. Sang tells his wife something and goes to Hoon 's house together. Hoon went to his wife, Jesse, who came to his invitation that day, and became addicted by unknown power and eventually got physical relationship. Hoon's wife, Jung-a, who notices this, establishes a physical relationship with Shang-doo in vengeance.", "rate": 0, "genre": ["Drama"], "cast": ["Jeong Ah"], "character": ["Unknown"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75060   Expand Infinite Emergence Sex Scandal: The Hottest Office Girl Violence   (2016) User Score Overview As a husband who can not give birth to a child and lives only in work, Jung Ah and Hoon who keep the couple's life together. Hoon is the vice president of a promising young company, and the president is promoted soon. Another person who burns ambition under him is Sang-doo. He is an ambition to do anything for ambition. One day, Sooke and his wife Jesse, who were invited to the house of Hoon for dinner. Mr. Sang tells his wife something and goes to Hoon 's house together. Hoon went to his wife, Jesse, who came to his invitation that day, and became addicted by unknown power and eventually got physical relationship. Hoon's wife, Jung-a, who notices this, establishes a physical relationship with Shang-doo in vengeance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeong Ah Unknown Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Infinite Emergence Sex Scandal: The Hottest Office Girl Violence premiered on July 14, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Infinite Emergence Sex Scandal: The Hottest Office Girl Violence. You can help by rating TV shows you've seen. Facts Original Name  무한방출 섹스 스캔들: 쌔끈한 오피스걸 유린기 Status  Ended Networks - Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Miniseries Original Language  Korean Runtime  - Homepage  - Genres Drama Keywords eroticism Content Score 43 There's no 'I' in team... Top Contributors n 16 ntn01  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}