{"link": "https://www.themoviedb.org/tv/60911?language=en", "title": "Fixer Upper", "resume": "Renovation, design and real estate pros Chip and Joanna Gaines are paired with Waco/Dallas, Texas-area buyers to renovate the wrong house that's in the right location.", "rate": 87, "genre": ["Reality"], "cast": ["Joanna Gaines", "Chip Gaines"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60911   Expand Fixer Upper   (2013) User Score  Play Trailer Overview Renovation, design and real estate pros Chip and Joanna Gaines are paired with Waco/Dallas, Texas-area buyers to renovate the wrong house that's in the right location. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joanna Gaines Chip Gaines Full Cast & Crew Current Season Season 5 2017 | 18 Episodes Season 5 of Fixer Upper premiered on November 21, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Y'all Open 1 by  Invidia Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2017-11-02 S.W.A.T. 6.6    2014-01-08 Chicago P.D. 6.9    2016-09-20 This Is Us 8.1    2015-08-23 Fear the Walking Dead 6.4    2016-01-21 DC's Legends of Tomorrow 6.1  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  45m Homepage   http://www.hgtv.com/fixer-upper/show/index.html Genres Reality Keywords home renovation Content Score 64 We're so close, yet so far. Top Contributors 26 Elizabeth Jennings o 10 obishiro 6 Amauril b 5 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}