{"link": "https://www.themoviedb.org/tv/5104?language=en", "title": "Trust", "resume": "In a busy corporate law firm, Cooper-Fozard in the City of London, Stephen Bradley and his team work fast and furiously to put together mergers, takeovers and buyouts for a range of clients. But it's never as clear and clinical as that. When colleagues work hard they often play hard too; and working closely sometimes brings people together after hours. Soon you develop a taste for a good deal, and you can sense a suspicious one at forty paces. And above all, though you don't have to like the people you work with, you learn that you do need to trust them.", "rate": 50, "genre": ["Drama"], "cast": ["Sarah Parish", "Ian McShane", "Robson Green", "Neil Stuke", "Chiwetel Ejiofor"], "character": ["Alan Cooper-Fozzard", "Stephen Bradley", "Ashley Carter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5104   Expand Trust   (2003) User Score Overview In a busy corporate law firm, Cooper-Fozard in the City of London, Stephen Bradley and his team work fast and furiously to put together mergers, takeovers and buyouts for a range of clients. But it's never as clear and clinical as that. When colleagues work hard they often play hard too; and working closely sometimes brings people together after hours. Soon you develop a taste for a good deal, and you can sense a suspicious one at forty paces. And above all, though you don't have to like the people you work with, you learn that you do need to trust them. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Parish Ian McShane Alan Cooper-Fozzard Robson Green Stephen Bradley Neil Stuke Chiwetel Ejiofor Ashley Carter Full Cast & Crew Last Season Season 1 2003 | 6 Episodes Season 1 of Trust premiered on January  9, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Trust. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/drama/trust/ Genres Drama Keywords lawyer law firm corporate law legal drama Content Score 86 Almost there... Top Contributors 8 Banana R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}