{"link": "https://www.themoviedb.org/tv/46204?language=en", "title": "Switch Girl!!", "resume": "Based on a manga with the same name created by Aida Natsumi, 'Switch Girl!!' revolves around a high school student named Nika who appears to be a stylish and fashionable girl at school, but that's really a fake persona that she uses when she's in public. At home, she “switches off” the facade and her returns to her true slovenly nature. Kiriyama Renn plays the good-looking transfer student Arata, who is Nika's love interest in the story.", "rate": 100, "genre": ["Comedy"], "cast": ["Mariya Nishiuchi", "Renn Kiriyama", "Rikako Sakata", "Anri Okamoto", "Sho Jinnai"], "character": ["Nika Tamiya", "Arata", "Ninohara", "Reika/ Monkey Queen", "Masamune Hirota"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46204   Expand Switch Girl!!   (2011) User Score Overview Based on a manga with the same name created by Aida Natsumi, 'Switch Girl!!' revolves around a high school student named Nika who appears to be a stylish and fashionable girl at school, but that's really a fake persona that she uses when she's in public. At home, she “switches off” the facade and her returns to her true slovenly nature. Kiriyama Renn plays the good-looking transfer student Arata, who is Nika's love interest in the story. Featured Crew Natsumi Aida Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mariya Nishiuchi Nika Tamiya Renn Kiriyama Arata Rikako Sakata Ninohara Anri Okamoto Reika/ Monkey Queen Sho Jinnai Masamune Hirota Full Cast & Crew Last Season Season 2 2012 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Switch Girl!!. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.fujitv.co.jp/otn/b_hp/911200287.html Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 44 sora_sey 9 Sergiojamon CM 4 Cherche Moi TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}