{"link": "https://www.themoviedb.org/tv/32423?language=en", "title": "A Comedy Roast", "resume": "A Comedy Roast is a British comedy television show broadcast by Channel 4. After a series of failed attempts by various broadcasters over the years, it is the first adaptation of the American comedy institution of roasting to be produced as a television show in Britain. The first series premiered on 7 April 2010. Hosted by Jimmy Carr it saw Bruce Forsyth, Sharon Osbourne and Chris Tarrant get roasted by various colleagues, comedians and celebrities. The show returned on 15 October 2010 targeting Davina McCall.", "rate": 60, "genre": ["Comedy"], "cast": ["Jimmy Carr"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32423   Expand A Comedy Roast   (2010) User Score Overview A Comedy Roast is a British comedy television show broadcast by Channel 4. After a series of failed attempts by various broadcasters over the years, it is the first adaptation of the American comedy institution of roasting to be produced as a television show in Britain. The first series premiered on 7 April 2010. Hosted by Jimmy Carr it saw Bruce Forsyth, Sharon Osbourne and Chris Tarrant get roasted by various colleagues, comedians and celebrities. The show returned on 15 October 2010 targeting Davina McCall. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jimmy Carr Full Cast & Crew Last Season Season 2 2011 | 1 Episode Season 2 of A Comedy Roast premiered on January  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Comedy Roast. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/a-comedy-roast Genres Comedy Keywords celebrity roast Content Score 56 We're so close, yet so far. Top Contributors 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}