{"link": "https://www.themoviedb.org/tv/16627?language=en", "title": "Who Wants to Marry My Dad?", "resume": "Who Wants To Marry My Dad was a NBC-produced reality show that aired in the summer of 2003 and 2004. The point of the show was to have the children pick out a new bride for their father to propose to and marry. The show was a modest hit in ratings and returned for season two in 2004. The show was cancelled soon after ratings decreased compared to season one.\nHeidi Mueller, one of the daughters in season one, joined Passions after Who Wants to Marry My Dad?'s first season ended.", "rate": 0, "genre": ["Reality"], "cast": ["Heidi Mueller", "Mario López"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16627   Expand Who Wants to Marry My Dad?   (2003) User Score Overview Who Wants To Marry My Dad was a NBC-produced reality show that aired in the summer of 2003 and 2004. The point of the show was to have the children pick out a new bride for their father to propose to and marry. The show was a modest hit in ratings and returned for season two in 2004. The show was cancelled soon after ratings decreased compared to season one. Heidi Mueller, one of the daughters in season one, joined Passions after Who Wants to Marry My Dad?'s first season ended. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Heidi Mueller Mario López Full Cast & Crew Last Season Season 2 2003 | 6 Episodes Season 2 of Who Wants to Marry My Dad? premiered on June 21, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Who Wants to Marry My Dad?. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage  - Genres Reality Keywords father parents dating show Content Score 43 There's no 'I' in team... Top Contributors 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}