{"link": "https://www.themoviedb.org/tv/67045?language=en", "title": "Tsubasa: Tokyo Revelations", "resume": "As Sakura, Shaoran, Fai, and Kurogane continues their travel across many worlds, the other \"Shaoran\" wakes up. The Tsubasa Tokyo Revelations reveals Fei Wong Reed's intention, and the mystery to Shaoran's left eye.", "rate": 80, "genre": ["Animation"], "cast": ["Miyu Irino", "Yui Makino", "Namikawa Daisuke", "Tetsu Inada", "Mika Kikuchi"], "character": ["Syaoran (voice)", "Sakura (voice)", "Fai D. Flowright (voice)", "Kurogane (voice)", "Mokona (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67045   Expand Tsubasa: Tokyo Revelations   (2007) User Score Overview As Sakura, Shaoran, Fai, and Kurogane continues their travel across many worlds, the other \"Shaoran\" wakes up. The Tsubasa Tokyo Revelations reveals Fei Wong Reed's intention, and the mystery to Shaoran's left eye. Featured Crew Nanase Ohkawa Creator Mokona Apapa Creator Satsuki Igarashi Creator Tsubaki Nekoi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyu Irino Syaoran (voice) Yui Makino Sakura (voice) Namikawa Daisuke Fai D. Flowright (voice) Tetsu Inada Kurogane (voice) Mika Kikuchi Mokona (voice) Full Cast & Crew Last Season Tsubasa: Tokyo Revelations 2007 | 3 Episodes Season 1 of Tsubasa: Tokyo Revelations premiered on November 16, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tsubasa: Tokyo Revelations. You can help by rating TV shows you've seen. Facts Original Name  ツバサ TOKYO REVELATIONS Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 43 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}