{"link": "https://www.themoviedb.org/tv/31561?language=en", "title": "Impostor", "resume": "Impostor is the 11th installment of the Precious Hearts Romances series. The series stars Sam Milby and Maja Salvador. This is about people who got into an accident and end up changing faces.", "rate": 0, "genre": ["Drama"], "cast": ["Sam Milby", "Maja Salvador", "Precious Lara Quigaman", "Jason Francisco", "Jon Avila"], "character": ["Anthony Florencio", "Mariz Florencio", "Monique Benitez", "Popoy Calantiao", "Julio Cabrera"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31561   Expand Impostor   (2010) User Score Overview Impostor is the 11th installment of the Precious Hearts Romances series. The series stars Sam Milby and Maja Salvador. This is about people who got into an accident and end up changing faces. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Milby Anthony Florencio Maja Salvador Mariz Florencio Precious Lara Quigaman Monique Benitez Jason Francisco Popoy Calantiao Jon Avila Julio Cabrera Full Cast & Crew Last Season Season 1 2010 | 90 Episodes Season 1 of Impostor premiered on May 17, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Impostor. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.phrtv.multiply.com/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}