{"link": "https://www.themoviedb.org/tv/61278?language=en", "title": "Love Plan, Evil Plan", "resume": "One day there was a fire in the hospital so the hospital staff was rushing to take the babies out of the nursery. During the fire Korya accidentally fell into the river next to the hospital and floated all the way to Chiang Mai. She was adopted by the church there. Korya grew up in Chiang Mai until she was about 20 years old.\nKorya's grandfather couldn't take her mother's crying and sickness everyday so he hired someone to look for her. He knew that Korya had a necklace and ring that her mother gave to her when she was born. He made a new fake necklace and hired someone to be Korya because he knew that he would never find the real daughter.\nIn Chiang Mai, the person who he hired found the real Korya by accident. He told her everything about her wealthy family. Korya didn't want to leave the nuns at the orphanage that she grew up in. Id's father wanted to buy the orphanage in order to build a resort there. Korea decided to ask her mother to help her keep the orphanage alive. Payia is Korya's best friend and enemy as they grew up together and lived with each other for a long time.\nShe spied on Korya and asked if she could she live with Korya and her new family. Korya said no because she's coming back but Payia packed her stuff and followed Korya to Bangkok. A storm hit and caused Korya and Payia's cars to crash leaving only both of them alive. Payia is fine but Korya is hurt. Payia was worried about Korya. She help Korya but Payia saw the necklace and decided to hit Korya with a branch. Korya then lost her memories. Id found Korya and took her to the hospital. He doesn't know that she had lost her memories. As soon as she woke up she didn't know nor remembered him. He talk to the doctor, who was his best friend, the doctor said Korya lost her memories and the injury she had wasn't from the car crash. Someone must have hit her head with something hard. Id tricked Korya into thinking that she was his girlfriend so she could be safe.\nPayia took the necklace and tricked Korya's mother that she was her long lost daughter. Now Payia became rich and got anything she wanted. Korya couldn't remember anything and Payia doesn't knew that Korya is still alive. She thought she killed her but they meet again at a party the mom throws. Payia doesn't know that Korya lost her memories and decided to choke her at the private party when no one else was around. Payia stopped when she heard Korya say that she lost her memories. She doesn't remember what Id had done to her. Everyone eventually wants to help Korya find her lost memories but Id is unhappy about it because that would mean that Korya realizes she's not Id's girlfriend in real life. Plus Korya's male friend from the orphanage, Chinsanu, secretly likes Korya as well. Korya getting her memories back might mean that she goes back to being with Chinsanu.\nAt the party Chinsanu notices Korya because he remembers her voice but he couldn't tell its was Korya because he was blind. After getting eye surgery he wanted to see Korya but he doesn't know that she has lost her memories. He had a strange feeling that Korya looked familiar but he couldn't tell it was Korya because he was blind. So Chinsanu teams up with another female friend to figure out if the Korya now is the same as the Korya from his orphanage or not So he followed Korya and Id to the temple and brought his friend to see if that was Korya. They went to the temple and Id left Korya's ring that is shaped like a star. Id took the ring off of Korya's hand in the hospital beforehand and showed Chinsanu Korya's finger. Id didn't give the ring back because he thought that ring was from Chinsanu and he said Korya had promised Chinsanu when he got eyes surgery she would engage him.\nPayia becomes more and more paranoid that someone will find out about her masquerading as the Korya so she plots the death of those who suspect her. On top of that list includes the Grand Aunt, the head servant, her grandfather, and even her own mother. The mystery then becomes who is going to figure out Payia's evil plot to take Korya's wealth and family as well as when Korya will remember her old memories.", "rate": 65, "genre": ["Soap", "Drama"], "cast": ["Yuttana Puangklang", "Charebelle Lanlalin", "Monchanok Saengchaipiangpen", "Kornrawich Sungkibool", "Cee Hataipat"], "character": ["Id", "Korya", "Peyia", "Supan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61278   Expand Love Plan, Evil Plan   (2013) User Score  Play Trailer Overview One day there was a fire in the hospital so the hospital staff was rushing to take the babies out of the nursery. During the fire Korya accidentally fell into the river next to the hospital and floated all the way to Chiang Mai. She was adopted by the church there. Korya grew up in Chiang Mai until she was about 20 years old. Korya's grandfather couldn't take her mother's crying and sickness everyday so he hired someone to look for her. He knew that Korya had a necklace and ring that her mother gave to her when she was born. He made a new fake necklace and hired someone to be Korya because he knew that he would never find the real daughter. In Chiang Mai, the person who he hired found the real Korya by accident. He told her everything about her wealthy family. Korya didn't want to leave the nuns at the orphanage that she grew up in. Id's father wanted to buy the orphanage in order to build a resort there. Korea decided to ask her mother to help her keep the orphanage alive. Payia is Korya's best friend and enemy as they grew up together and lived with each other for a long time. She spied on Korya and asked if she could she live with Korya and her new family. Korya said no because she's coming back but Payia packed her stuff and followed Korya to Bangkok. A storm hit and caused Korya and Payia's cars to crash leaving only both of them alive. Payia is fine but Korya is hurt. Payia was worried about Korya. She help Korya but Payia saw the necklace and decided to hit Korya with a branch. Korya then lost her memories. Id found Korya and took her to the hospital. He doesn't know that she had lost her memories. As soon as she woke up she didn't know nor remembered him. He talk to the doctor, who was his best friend, the doctor said Korya lost her memories and the injury she had wasn't from the car crash. Someone must have hit her head with something hard. Id tricked Korya into thinking that she was his girlfriend so she could be safe. Payia took the necklace and tricked Korya's mother that she was her long lost daughter. Now Payia became rich and got anything she wanted. Korya couldn't remember anything and Payia doesn't knew that Korya is still alive. She thought she killed her but they meet again at a party the mom throws. Payia doesn't know that Korya lost her memories and decided to choke her at the private party when no one else was around. Payia stopped when she heard Korya say that she lost her memories. She doesn't remember what Id had done to her. Everyone eventually wants to help Korya find her lost memories but Id is unhappy about it because that would mean that Korya realizes she's not Id's girlfriend in real life. Plus Korya's male friend from the orphanage, Chinsanu, secretly likes Korya as well. Korya getting her memories back might mean that she goes back to being with Chinsanu. At the party Chinsanu notices Korya because he remembers her voice but he couldn't tell its was Korya because he was blind. After getting eye surgery he wanted to see Korya but he doesn't know that she has lost her memories. He had a strange feeling that Korya looked familiar but he couldn't tell it was Korya because he was blind. So Chinsanu teams up with another female friend to figure out if the Korya now is the same as the Korya from his orphanage or not So he followed Korya and Id to the temple and brought his friend to see if that was Korya. They went to the temple and Id left Korya's ring that is shaped like a star. Id took the ring off of Korya's hand in the hospital beforehand and showed Chinsanu Korya's finger. Id didn't give the ring back because he thought that ring was from Chinsanu and he said Korya had promised Chinsanu when he got eyes surgery she would engage him. Payia becomes more and more paranoid that someone will find out about her masquerading as the Korya so she plots the death of those who suspect her. On top of that list includes the Grand Aunt, the head servant, her grandfather, and even her own mother. The mystery then becomes who is going to figure out Payia's evil plot to take Korya's wealth and family as well as when Korya will remember her old memories. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuttana Puangklang Id Charebelle Lanlalin Korya Monchanok Saengchaipiangpen Peyia Kornrawich Sungkibool Supan Cee Hataipat Full Cast & Crew Last Season Season 1 2013 | 15 Episodes Season 1 of Love Plan, Evil Plan premiered on February 13, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Love Plan, Evil Plan. You can help by rating TV shows you've seen. Facts Original Name  แผนรัก แผนร้าย Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  95m Homepage   http://www.exact.co.th/nam.html Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 37 Crip 5 Elizabeth Jennings 3 mariilakorn21 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}