{"link": "https://www.themoviedb.org/tv/73435?language=en", "title": "You Are Tender When It Rains", "resume": "Nobuo is a book editor with a sincere personality. He is married to Aya. She used to work as a reader model, but, after their marriage, she now works as a nursing assistant at a nursing home. Nobuo is aware that his wife has a sex addiction and she will sleep with other men on a sunny day. Nobuo agonizes over his wife and Aya carries heavy guilt over her actions.", "rate": 100, "genre": ["Drama"], "cast": ["Tetsuji Tamayama", "Nozomi Sasaki", "Megumi Okina", "Yûko Fueki", "Ikkô Furuya"], "character": ["Nobuo Tachiki", "Aya Tachiki", "Reiko Shinjo", "Nami Shizukuishi", "Shiro Onoda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73435   Expand You Are Tender When It Rains   (2017) User Score Overview Nobuo is a book editor with a sincere personality. He is married to Aya. She used to work as a reader model, but, after their marriage, she now works as a nursing assistant at a nursing home. Nobuo is aware that his wife has a sex addiction and she will sleep with other men on a sunny day. Nobuo agonizes over his wife and Aya carries heavy guilt over her actions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tetsuji Tamayama Nobuo Tachiki Nozomi Sasaki Aya Tachiki Megumi Okina Reiko Shinjo Yûko Fueki Nami Shizukuishi Ikkô Furuya Shiro Onoda Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of You Are Tender When It Rains premiered on September 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on You Are Tender When It Rains. You can help by rating TV shows you've seen. Facts Original Name  雨が降ると君は優しい Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage   http://amefuru.com/ Genres Drama Keywords japan romance Content Score 86 Almost there... Top Contributors M 34 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}