{"link": "https://www.themoviedb.org/tv/65227?language=en", "title": "The Path", "resume": "The Path explores the unknown and mysterious world of the cult-like Meyerist Movement in upstate New York. At the center of the movement lies Eddie, a conflicted husband; Sarah, his devoted wife; and Cal, an ambitious leader. We follow each as they contend with deep issues involving relationships, faith, and power.", "rate": 66, "genre": ["Drama", "Mystery"], "cast": ["Aaron Paul", "Michelle Monaghan", "Sarah Jones", "Hugh Dancy", "Rockmond Dunbar"], "character": ["Eddie Lane", "Sarah Lane", "Alison Kemp", "Calvin \"Cal\" Roberts", "Detective Abe Gaines"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65227   Expand The Path   (2016) User Score  Play Trailer Overview The Path explores the unknown and mysterious world of the cult-like Meyerist Movement in upstate New York. At the center of the movement lies Eddie, a conflicted husband; Sarah, his devoted wife; and Cal, an ambitious leader. We follow each as they contend with deep issues involving relationships, faith, and power. Featured Crew Jessica Goldberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  7 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aaron Paul Eddie Lane Michelle Monaghan Sarah Lane Sarah Jones Alison Kemp Hugh Dancy Calvin \"Cal\" Roberts Rockmond Dunbar Detective Abe Gaines Full Cast & Crew Current Season Season 3 2018 | 13 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply So...now we wait for season 3? (end of season spoilers) Open 0 by  tinyrobotstakeovertheworld w end game ? Open 7 by  tinyrobotstakeovertheworld Hawk is a major cuck Open 0 by MongoLloyd\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  7 Recommendations   2013-04-03 Rogue 7.1    2017-01-25 Mary Kills People 7.5    2018-02-11 Here and Now 7.7    2016-04-11 Hunters 4.9    2016-01-22 Stan Lee's Lucky Man 7.3    2016-01-26 Outsiders 6.7    2016-06-05 Feed the Beast 6.2    2017-01-09 Pure 6.6  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.hulu.com/the-path Genres Drama Mystery Keywords faith cult religion upstate new york Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings m 26 misfit_noel a 11 adambakir92 DJ 11 Dr. John W. Thackery  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}