{"link": "https://www.themoviedb.org/tv/4354?language=en", "title": "The Protectors", "resume": "The Protectors is a British television series, an action thriller created by Gerry Anderson. It was Anderson's second TV series using live actors as opposed to electronic marionettes, and also his second to be firmly set in contemporary times. It was also the only Gerry Anderson produced television series that was not of the fantasy or science fiction genres. It was produced by Lew Grade's ITC Entertainment production company. Despite not featuring marionettes or any real science fiction elements, The Protectors became one of Anderson's most popular productions, easily winning a renewal for a second season. A third season was in the planning stages when the show's major sponsor pulled out, forcing its cancellation.\nThe Protectors first aired in 1972 and 1973, and ran to 52 episodes over two series, each 25 minutes long - making it one of the last series of this type to be produced in a half-hour format. It starred Robert Vaughn as Harry Rule, Nyree Dawn Porter as the Contessa Caroline di Contini, and Tony Anholt as Paul Buchet. Episodes often featured prominent guest actors.", "rate": 80, "genre": ["Action", "Adventure"], "cast": ["Robert Vaughn", "Tony Anholt", "Nyree Dawn Porter", "Anthony Chinn", "Joanna Lumley"], "character": ["Liz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4354   Expand The Protectors   (1972) User Score Overview The Protectors is a British television series, an action thriller created by Gerry Anderson. It was Anderson's second TV series using live actors as opposed to electronic marionettes, and also his second to be firmly set in contemporary times. It was also the only Gerry Anderson produced television series that was not of the fantasy or science fiction genres. It was produced by Lew Grade's ITC Entertainment production company. Despite not featuring marionettes or any real science fiction elements, The Protectors became one of Anderson's most popular productions, easily winning a renewal for a second season. A third season was in the planning stages when the show's major sponsor pulled out, forcing its cancellation. The Protectors first aired in 1972 and 1973, and ran to 52 episodes over two series, each 25 minutes long - making it one of the last series of this type to be produced in a half-hour format. It starred Robert Vaughn as Harry Rule, Nyree Dawn Porter as the Contessa Caroline di Contini, and Tony Anholt as Paul Buchet. Episodes often featured prominent guest actors. Featured Crew Gerry Anderson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Vaughn Tony Anholt Nyree Dawn Porter Anthony Chinn Joanna Lumley Liz Full Cast & Crew Last Season Season 2 1973 | 26 Episodes Season 2 of The Protectors premiered on September 21, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Protectors. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors S 1 Shady12 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}