{"link": "https://www.themoviedb.org/tv/2525?language=en", "title": "TFI Friday", "resume": "TFI Friday was an entertainment show broadcast on Channel 4 in the United Kingdom from 1996 to 2000. The show was produced by Ginger Productions, written by Danny Baker and hosted by Chris Evans, for the first 5 series. The final series was hosted by a number of guest presenters. It was broadcast on Fridays at 6pm from 9 February 1996 to 22 December 2000, with a repeat later that night. The title officially stood for \"Thank Four It's Friday\", but was widely understood to mean \"Thank Fuck It's Friday\" and was a reference to the popular phrase \"Thank God it's Friday\". The show's theme tune was Ron Grainer's theme from Man in a Suitcase, in keeping with Evans's frequent use of 1960s television themes in his work.", "rate": 50, "genre": ["Comedy"], "cast": ["Chris Evans"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2525   Expand TFI Friday   (1996) User Score Overview TFI Friday was an entertainment show broadcast on Channel 4 in the United Kingdom from 1996 to 2000. The show was produced by Ginger Productions, written by Danny Baker and hosted by Chris Evans, for the first 5 series. The final series was hosted by a number of guest presenters. It was broadcast on Fridays at 6pm from 9 February 1996 to 22 December 2000, with a repeat later that night. The title officially stood for \"Thank Four It's Friday\", but was widely understood to mean \"Thank Fuck It's Friday\" and was a reference to the popular phrase \"Thank God it's Friday\". The show's theme tune was Ron Grainer's theme from Man in a Suitcase, in keeping with Evans's frequent use of 1960s television themes in his work. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Evans Presenter Full Cast & Crew Last Season Season 1 1996 | 180 Episodes Season 1 of TFI Friday premiered on February  9, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on TFI Friday. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.channel4.com/programmes/tfi-friday Genres Comedy Keywords variety show Content Score 43 There's no 'I' in team... Top Contributors R 5 Rebecca 3 Banana N 1 Notamymerrick 1 menakite  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}