{"link": "https://www.themoviedb.org/tv/75646?language=en", "title": "If You Give a Mouse a Cookie", "resume": "In the If You Give a Mouse a Cookie series, based on the beloved books by Laura Numeroff and Felicia Bond, we get to know Mouse, Pig, Moose, Dog and Cat and their favorite humans. When Mouse and friends get together, one thing always leads to another in the most unexpected ways. You just never know where things will end up, but you can be sure that IF Mouse and Friends go on an adventure together, THEN they will just have to have fun the whole time.", "rate": 0, "genre": ["Animation", "Comedy", "Family"], "cast": ["Mason Mahay", "Roger Craig Smith", "Jessica DiCicco"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75646   Expand If You Give a Mouse a Cookie   (2015) User Score  Play Trailer Overview In the If You Give a Mouse a Cookie series, based on the beloved books by Laura Numeroff and Felicia Bond, we get to know Mouse, Pig, Moose, Dog and Cat and their favorite humans. When Mouse and friends get together, one thing always leads to another in the most unexpected ways. You just never know where things will end up, but you can be sure that IF Mouse and Friends go on an adventure together, THEN they will just have to have fun the whole time. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mason Mahay Roger Craig Smith Jessica DiCicco Full Cast & Crew Last Season Season 1 2015 | 19 Episodes Season 1 of If You Give a Mouse a Cookie premiered on November  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on If You Give a Mouse a Cookie. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Comedy Family Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors w 18 wildmale TB 8 TMDb Bot MP 1 Mr. Peanutbutter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}