{"link": "https://www.themoviedb.org/tv/39276?language=en", "title": "Unforgettable", "resume": "Former Syracuse, New York, police detective Carrie Wells has hyperthymesia, a rare medical condition that gives her the ability to visually remember everything. She reluctantly joins the New York City Police Department's Queens homicide unit after her former boyfriend and partner asks for help with solving a case. The move allows her to try to find out the one thing she has been unable to remember, which is what happened the day her sister was murdered.", "rate": 61, "genre": ["Crime", "Drama", "Mystery", "Action", "Adventure"], "cast": ["Poppy Montgomery", "Dylan Walsh", "Kathy Najimy", "E.J. Bonilla", "La La Anthony"], "character": ["Carrie Wells", "Al Burns", "Captain Sandra Russo", "Denny Padilla", "Delina Michaels"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39276   Expand Unforgettable   (2011) User Score  Play Trailer Overview Former Syracuse, New York, police detective Carrie Wells has hyperthymesia, a rare medical condition that gives her the ability to visually remember everything. She reluctantly joins the New York City Police Department's Queens homicide unit after her former boyfriend and partner asks for help with solving a case. The move allows her to try to find out the one thing she has been unable to remember, which is what happened the day her sister was murdered. Featured Crew Ed Redlich Creator John Bellucci Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  9 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Poppy Montgomery Carrie Wells Dylan Walsh Al Burns Kathy Najimy Captain Sandra Russo E.J. Bonilla Denny Padilla La La Anthony Delina Michaels Full Cast & Crew Last Season Season 4 2015 | 13 Episodes Season 4 of Unforgettable premiered on November 27, 2015. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Carrie: Happy Birthday Poppy Montgomery! Open 0 by wonder2wonder\n      \n     w Canceled Open 0 by wonder2wonder\n      \n     w Season 4. Episode 2. \"Gut Check\" Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  12 Recommendations   2014-01-07 Intelligence 6.3    2010-07-12 Rizzoli & Isles 7.0    2012-07-09 Perception 6.7    2015-01-27 Stalker 5.8    2010-06-24 Rookie Blue 7.0    2010-09-09 Nikita 7.0    2014-09-17 The Mysteries of Laura 6.3    2006-03-05 Numb3rs 6.5  Facts Status  Cancelled Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.aetv.com/shows/unforgettable Genres Crime Drama Mystery Action & Adventure Keywords new york police detective nypd female detective photographic memory homicide detective major crime unit Content Score 100 Yes! Looking good! Top Contributors 42 Elizabeth Jennings 22 Banana C 14 Chamelon 12 Nero Kosonen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}