{"link": "https://www.themoviedb.org/tv/11921?language=en", "title": "Mighty Machines", "resume": "Mighty Machines is a Canadian children's television show about machines and how they work. It airs on TVO, Treehouse TV and other channels in Canada, including Access in Alberta, the Saskatchewan Communications Network, and Knowledge in British Columbia. It also aired on Discovery Kids in 2005, on Qubo in the U.S., and a French-language version airs on TFO in Ontario and on channels in Quebec. It was nominated for a Gemini Award in 1996 in the category of Best Children's Program or Series. The full series is also available for instant viewing in the U.S. through Netflix and their streaming service.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11921   Expand Mighty Machines   (1998) User Score Overview Mighty Machines is a Canadian children's television show about machines and how they work. It airs on TVO, Treehouse TV and other channels in Canada, including Access in Alberta, the Saskatchewan Communications Network, and Knowledge in British Columbia. It also aired on Discovery Kids in 2005, on Qubo in the U.S., and a French-language version airs on TFO in Ontario and on channels in Quebec. It was nominated for a Gemini Award in 1996 in the category of Best Children's Program or Series. The full series is also available for instant viewing in the U.S. through Netflix and their streaming service. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2009 | 28 Episodes Season 3 of Mighty Machines premiered on January  3, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mighty Machines. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}