{"link": "https://www.themoviedb.org/tv/41331?language=en", "title": "Miss Ripley", "resume": "Based loosely on the story of a discredited Dongguk University professor who falsified her educational background, Miss Ripley is the story of orphan Jang Mi Ri who, like the Talented Mr. Ripley, lives her life from one lie to the next. At a job interview, she starts down her dark path in earnest, when she tells a simple lie about her education. From there, the tale of Miss Ripley weaves into the lives of two very important rivals: Jang Myung Hoon and Yutaka, both of whom are in the hotel industry and fall in love with the deceitful protagonist. To complicate things, Mi Ri's childhood acquaintance, Hee Joo, can see through all the lies.", "rate": 75, "genre": ["Drama"], "cast": ["Lee Da-hae", "Park Yoo-chun", "Kim Seung-woo", "Kang Hye-jung", "Lee Sang-Yeob"], "character": ["Jang Mi-ri", "Yutaka / Song Yoo-hyun", "Jang Myung-hoon", "Moon Hee-joo", "Ha Chul-jin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41331   Expand Miss Ripley   (2011) User Score Overview Based loosely on the story of a discredited Dongguk University professor who falsified her educational background, Miss Ripley is the story of orphan Jang Mi Ri who, like the Talented Mr. Ripley, lives her life from one lie to the next. At a job interview, she starts down her dark path in earnest, when she tells a simple lie about her education. From there, the tale of Miss Ripley weaves into the lives of two very important rivals: Jang Myung Hoon and Yutaka, both of whom are in the hotel industry and fall in love with the deceitful protagonist. To complicate things, Mi Ri's childhood acquaintance, Hee Joo, can see through all the lies. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Da-hae Jang Mi-ri Park Yoo-chun Yutaka / Song Yoo-hyun Kim Seung-woo Jang Myung-hoon Kang Hye-jung Moon Hee-joo Lee Sang-Yeob Ha Chul-jin Full Cast & Crew Last Season Season 1 2011 | 16 Episodes Season 1 of Miss Ripley premiered on May 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Miss Ripley. You can help by rating TV shows you've seen. Facts Original Name  미스 리플리 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/ripley/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 31 Maria180493 N 26 Nightowl.Kr 10 Elizabeth Jennings CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}