{"link": "https://www.themoviedb.org/tv/71068?language=en", "title": "100% Teacher Pascal", "resume": "Pascal-sensei is an elementary school teacher who is so stupid, he cannot even write his own name. He does whatever he likes in his classroom. Plus, by all appearances, he is not human.", "rate": 0, "genre": ["Comedy", "Animation"], "cast": ["Hana Saitou", "Kouji Takeda", "Yuka Maruyama", "Yuki Kodaira", "Daiki Kobayashi"], "character": ["Pascal-sensei (voice)", "Iwata (voice)", "Hikaru Tachibana (voice)", "Hayato (voice)", "Steve Kanamori (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71068   Expand 100% Teacher Pascal   (2017) User Score Overview Pascal-sensei is an elementary school teacher who is so stupid, he cannot even write his own name. He does whatever he likes in his classroom. Plus, by all appearances, he is not human. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Hana Saitou Pascal-sensei (voice) Kouji Takeda Iwata (voice) Yuka Maruyama Hikaru Tachibana (voice) Yuki Kodaira Hayato (voice) Daiki Kobayashi Steve Kanamori (voice) Full Cast & Crew Last Season Season 1 2017 | 25 Episodes Season 1 of 100% Teacher Pascal premiered on April 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 100% Teacher Pascal. You can help by rating TV shows you've seen. Facts Original Name  100%パスカル先生 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  12m Homepage   http://pasu-chi.com/pasukaru/ Genres Comedy Animation Keywords anime Content Score 79 Pump it up! We're close now. Top Contributors 21 minusha97 10 sp1ti 5 Despair-Paradise 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}