{"link": "https://www.themoviedb.org/tv/78670?language=en", "title": "Impulse", "resume": "Follow 16-year-old Henrietta, aka Henry, who discovers she has the ability to teleport. The first time she realizes this, she is in a truck with her high school’s Golden Boy, who tries to rape her.", "rate": 85, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Drama"], "cast": ["Maddie Hasson", "Missi Pyle", "Sarah Desjardins", "Enuka Okuma", "Craig Arnold"], "character": ["Henrietta \"Henry\" Coles", "Cleo Coles", "Jenna Hope", "Deputy Anne Hulce", "Lucas Boone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78670   Expand Impulse   (2018) User Score  Play Trailer Overview Follow 16-year-old Henrietta, aka Henry, who discovers she has the ability to teleport. The first time she realizes this, she is in a truck with her high school’s Golden Boy, who tries to rape her. Featured Crew Steven Gould Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maddie Hasson Henrietta \"Henry\" Coles Missi Pyle Cleo Coles Sarah Desjardins Jenna Hope Enuka Okuma Deputy Anne Hulce Craig Arnold Lucas Boone Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Impulse premiered on June  6, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Female characters with male names Open 5 by  cswood Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  3 Recommendations   2014-04-20 Salem 7.3    2017-10-24 The End of the F***ing World 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   https://www.youtube.com/channel/UCgLQkRAZsFN6fhqxFyx8qhQ Genres Action & Adventure Sci-Fi & Fantasy Drama Keywords sequel Content Score 100 Yes! Looking good! Top Contributors I 37 Iscoh 8 Elizabeth Jennings 6 Cor Cordium R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}