{"link": "https://www.themoviedb.org/tv/42417?language=en", "title": "Hanasaku Iroha: Blossoms for Tomorrow", "resume": "Ohana is sent off to live with her grandmother, who owns the hot spring inn. Upon arriving, she is put to work at the inn. Thrust into a life where the customers always come first, she struggles to find her place and fit in with her fellow coworkers.", "rate": 77, "genre": ["Animation", "Drama", "Comedy"], "cast": ["Aki Toyosaki", "Junichi Suwabe", "Kenji Hamada", "Mamiko Noto", "Takako Honda"], "character": ["Nako Oshimizu", "Tarō Jirōmaru", "Enishi Shijima", "Tomoe Wajima", "Satsuki Matsumae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42417   Expand Hanasaku Iroha: Blossoms for Tomorrow   (2011) User Score Overview Ohana is sent off to live with her grandmother, who owns the hot spring inn. Upon arriving, she is put to work at the inn. Thrust into a life where the customers always come first, she struggles to find her place and fit in with her fellow coworkers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aki Toyosaki Nako Oshimizu Junichi Suwabe Tarō Jirōmaru Kenji Hamada Enishi Shijima Mamiko Noto Tomoe Wajima Takako Honda Satsuki Matsumae Full Cast & Crew Last Season Season 1 2011 | 26 Episodes Season 1 of Hanasaku Iroha: Blossoms for Tomorrow premiered on April  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Hanasaku Iroha: Blossoms for Tomorrow. You can help by rating TV shows you've seen. Facts Original Name  花咲くいろは Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.hanasakuiroha.jp/ Genres Animation Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors J 7 JeremyRogers 6 Sadwick 4 yoshizuka 4 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}