{"link": "https://www.themoviedb.org/tv/62928?language=en", "title": "My Beautiful Bride", "resume": "This drama is about a husband, Kim Do Hyung who desperately searches for his wife, Yoon Joo Young who suddenly disappears. Meanwhile, Cha Yoon Mi is the detective on the case who helps him along the way.", "rate": 70, "genre": ["Mystery", "Action", "Crime"], "cast": ["Kim Mu-yeol", "Lee Si-young", "Ko Sung-hee", "Ryu Seung-su", "Park Hae-joon"], "character": ["Kim Do-hyung", "Cha Yoon-mi", "Yoon Joo-young", "Seo Jin-gi", "Park Hyeong-sik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62928   Expand My Beautiful Bride   (2015) User Score  Play Trailer Overview This drama is about a husband, Kim Do Hyung who desperately searches for his wife, Yoon Joo Young who suddenly disappears. Meanwhile, Cha Yoon Mi is the detective on the case who helps him along the way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  3 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Mu-yeol Kim Do-hyung Lee Si-young Cha Yoon-mi Ko Sung-hee Yoon Joo-young Ryu Seung-su Seo Jin-gi Park Hae-joon Park Hyeong-sik Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of My Beautiful Bride premiered on June 20, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  4 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on My Beautiful Bride. You can help by rating TV shows you've seen. Facts Original Name  아름다운 나의 신부 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  75m Homepage   http://program.interest.me/ocn/mybride Genres Mystery Action Crime Keywords korea Content Score 93 Almost there... Top Contributors t 45 tmdb38202327 M 9 Maria180493 TB 4 TMDb Bot 3 shadowfurious  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}