{"link": "https://www.themoviedb.org/tv/63010?language=en", "title": "Destined to Love You", "resume": "Set in Shanghai in the late 1910s, Qian Bao Bao is a cunning young woman who assumes the stolen identity of a female instructor at an all-male military academy in order to earn enough money to help her sick mother. During her stay at the academy, Bao Bao finds herself entangled in a complicated love triangle with the flirtatious Xiang Hao and the intelligent Shen Wen Tao, who are both instructors at the academy.", "rate": 0, "genre": ["Drama"], "cast": ["Joe Chen", "Jia Nailiang", "Bosco Wong", "Zheng Shuang", "Vengo Gao"], "character": ["Qian Bao Bao", "Xiang Hao", "Shen Wen Tao", "Xiao Han", "Du Feng"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63010   Expand Destined to Love You   (2015) User Score Overview Set in Shanghai in the late 1910s, Qian Bao Bao is a cunning young woman who assumes the stolen identity of a female instructor at an all-male military academy in order to earn enough money to help her sick mother. During her stay at the academy, Bao Bao finds herself entangled in a complicated love triangle with the flirtatious Xiang Hao and the intelligent Shen Wen Tao, who are both instructors at the academy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Chen Qian Bao Bao Jia Nailiang Xiang Hao Bosco Wong Shen Wen Tao Zheng Shuang Xiao Han Vengo Gao Du Feng Full Cast & Crew Last Season Season 1 2015 | 44 Episodes Season 1 of Destined to Love You premiered on June 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Destined to Love You. You can help by rating TV shows you've seen. Facts Original Name  偏偏喜欢你 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords china romance Content Score 86 Almost there... Top Contributors M 46 Maria180493 z 5 zurman1 4 Elizabeth Jennings 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}