{"link": "https://www.themoviedb.org/tv/67933?language=en", "title": "Proud of Love", "resume": "It  was a vacation that they will never forget. Shen Xi is a  peppy college student who is majoring in dance but loves to eat just a  little too much. He Zhi Zhou is an aloof, moody  engineering major at a nearby university. While Shen Xi goes on vacation  with a group of her girlfriends, Zhi Zhou also is on vacation with his  engineering friends at the same location. During the vacation, Shen Xi  falls into the water at the same time that Zhi Zhou is struck by  lightning! They end up swapping souls, and Zhi Zhou suddenly finds  himself in the body of Shen Xi and Shen Xi finds herself inside the body  of Zhi Zhou. While Shen Xi is delighted by the wonders of her new body  and the fact that she can now get close to her crush, who happens to be  one of Zhi Zhou’s roommates, Zhi Zhou is freaked out about being stuck  inside a woman’s body. What will become of this soul-swapping duo?", "rate": 77, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67933   Expand Proud of Love   (2016) User Score Overview It  was a vacation that they will never forget. Shen Xi is a  peppy college student who is majoring in dance but loves to eat just a  little too much. He Zhi Zhou is an aloof, moody  engineering major at a nearby university. While Shen Xi goes on vacation  with a group of her girlfriends, Zhi Zhou also is on vacation with his  engineering friends at the same location. During the vacation, Shen Xi  falls into the water at the same time that Zhi Zhou is struck by  lightning! They end up swapping souls, and Zhi Zhou suddenly finds  himself in the body of Shen Xi and Shen Xi finds herself inside the body  of Zhi Zhou. While Shen Xi is delighted by the wonders of her new body  and the fact that she can now get close to her crush, who happens to be  one of Zhi Zhou’s roommates, Zhi Zhou is freaked out about being stuck  inside a woman’s body. What will become of this soul-swapping duo? Featured Crew Sui Hou Zhu Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 20 Episodes Season 1 of Proud of Love premiered on September 19, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Proud of Love. You can help by rating TV shows you've seen. Facts Original Name  别那么骄傲 Status  Returning Series Network Certification  - Type  Scripted Original Language  Chinese Runtime  20m Homepage  - Genres Comedy Drama Sci-Fi & Fantasy Keywords based on novel or book romance university Content Score 50 Still needs a little work. Top Contributors 29 daliasued z 15 zurman1 M 7 Maria180493 z 2 zerado  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}