{"link": "https://www.themoviedb.org/tv/58928?language=en", "title": "Dracula", "resume": "It's the late 19th century, and the mysterious Dracula has arrived in London, posing as an American entrepreneur who wants to bring modern science to Victorian society. He's especially interested in the new technology of electricity, which promises to brighten the night - useful for someone who avoids the sun. But he has another reason for his travels: he hopes to take revenge on those who cursed him with immortality centuries earlier. Everything seems to be going according to plan... until he becomes infatuated with a woman who appears to be a reincarnation of his dead wife.", "rate": 63, "genre": ["Drama"], "cast": ["Jonathan Rhys Meyers", "Oliver Jackson-Cohen", "Robert Bathurst", "Ben Miles", "Jessica De Gouw"], "character": ["Dracula/Alexander Grayson/Vlad Tepes", "Jonathan Harker", "Lord Thomas Davenport", "Browning", "Mina Harker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58928   Expand Dracula   (2013) User Score  Play Trailer Overview It's the late 19th century, and the mysterious Dracula has arrived in London, posing as an American entrepreneur who wants to bring modern science to Victorian society. He's especially interested in the new technology of electricity, which promises to brighten the night - useful for someone who avoids the sun. But he has another reason for his travels: he hopes to take revenge on those who cursed him with immortality centuries earlier. Everything seems to be going according to plan... until he becomes infatuated with a woman who appears to be a reincarnation of his dead wife. Featured Crew Cole Haddon Creator Daniel Knauf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Rhys Meyers Dracula/Alexander Grayson/Vlad Tepes Oliver Jackson-Cohen Jonathan Harker Robert Bathurst Lord Thomas Davenport Ben Miles Browning Jessica De Gouw Mina Harker Full Cast & Crew Last Season Season 1 2013 | 10 Episodes Season 1 of Dracula premiered on October 25, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  5 Recommendations   2013-10-06 Witches of East End 6.6    2011-09-15 The Secret Circle 6.6    2013-02-19 Cult 4.2    2015-06-01 The Whispers 5.7    2012-09-30 666 Park Avenue 6.1    2014-03-16 Crisis 5.9    2013-10-22 Ravenswood 4.5    2013-09-16 Sleepy Hollow 6.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/dracula Genres Drama Keywords london england vampire dracula victorian england blood 19th century Content Score 100 Yes! Looking good! Top Contributors 27 Elizabeth Jennings 11 Medianoche 10 Banana 6 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}