{"link": "https://www.themoviedb.org/tv/42295?language=en", "title": "Hemlock Grove", "resume": "One cannot quench his all-consuming thirst. The other cannot tame the beast clawing its way out. In the sleepy Pennsylvania village of Hemlock Grove, two young men struggle to accept painful truths: about family, themselves, the mystery of the White Tower - and a terrifying new threat so powerful it will turn them from predators into prey.", "rate": 66, "genre": ["Mystery"], "cast": ["Landon Liboiron", "Bill Skarsgård", "Famke Janssen", "Madeleine Martin", "Alex Hernandez"], "character": ["Peter Rumancek", "Roman Godfrey", "Olivia Godfrey", "Shelley Godfrey", "Isaac Ochoa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42295   Expand Hemlock Grove   (2013) User Score  Play Trailer Overview One cannot quench his all-consuming thirst. The other cannot tame the beast clawing its way out. In the sleepy Pennsylvania village of Hemlock Grove, two young men struggle to accept painful truths: about family, themselves, the mystery of the White Tower - and a terrifying new threat so powerful it will turn them from predators into prey. Featured Crew Brian McGreevy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  67 Posters  18 Videos Trailers  6 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Landon Liboiron Peter Rumancek Bill Skarsgård Roman Godfrey Famke Janssen Olivia Godfrey Madeleine Martin Shelley Godfrey Alex Hernandez Isaac Ochoa Full Cast & Crew Last Season Season 3 2015 | 10 Episodes Season 3 of Hemlock Grove premiered on October 23, 2015. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Roman: Happy Birthday Bill Skarsgård! Open 1 by  Zack37 L How did this show avoid a crazy feminist backlash? Open 0 by ubuzen\n      \n     L The worthwhile parts of this series would all comfortably fit into one, excellent season Open 0 by ubuzen\n      \n     Go to Discussions Media Most Popular Videos  6 Backdrops  67 Posters  18 Recommendations   2013-01-21 The Following 6.2    2014-05-11 Penny Dreadful 7.4    2003-09-14 Carnivàle 8.1    2013-03-18 Bates Motel 7.6    2013-03-17 In the Flesh 7.4    2014-01-10 Helix 6.4    2012-06-03 Longmire 7.6    2012-04-11 Don't Trust the B---- in Apartment 23 6.7  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   https://www.netflix.com/title/70242310 Genres Mystery Keywords fortune teller based on novel or book gypsy mad scientist werewolf family witchcraft unlikely friendship deformity Content Score 100 Yes! Looking good! Top Contributors 118 nightwing L 26 Law 20 Elizabeth Jennings 20 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}