{"link": "https://www.themoviedb.org/tv/41733?language=en", "title": "Kaseifu no Mita", "resume": "Kaseifu no Mita is a 2011 Japanese television drama series. The story revolves around a family who is grieving over their mother's recent suicide. They hired Mita as a housekeeper to upkeep the house, which has been thrown into disarray. Mita, who is played by actress Nanako Matsushima, will do anything that her employer orders her to do, except smiling or revealing her past.\nThis television series was broadcast from October 12 to December 21, 2011, as part of Nippon Television's Tears Wednesday time slot, which airs every Wednesday from 10pm to 10:54pm. On average, Kaseifu no Mita garnered a viewership rating of 25.2%. Its last episode garnered a viewership rating of over 40% when it was aired, making it the highest watched show of 2011 in Japan. Kaseifu no Mita won several awards, including the \"Best Drama\" award, at the 71st Television Drama Academy Awards. Despite the popularity of Kaseifu no Mita, the scriptwriter revealed that there will not be any sequels to this series.", "rate": 93, "genre": ["Drama"], "cast": ["Nanako Matsushima", "Saki Aibu", "Hiroki Hasegawa", "Shiori Kutsuna", "Taishi Nakagawa"], "character": ["Akari Mita", "Urara Yuuki", "Keiichi Asuda", "Yui Asuda", "Kakeru Asuda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41733   Expand Kaseifu no Mita   (2011) User Score Overview Kaseifu no Mita is a 2011 Japanese television drama series. The story revolves around a family who is grieving over their mother's recent suicide. They hired Mita as a housekeeper to upkeep the house, which has been thrown into disarray. Mita, who is played by actress Nanako Matsushima, will do anything that her employer orders her to do, except smiling or revealing her past. This television series was broadcast from October 12 to December 21, 2011, as part of Nippon Television's Tears Wednesday time slot, which airs every Wednesday from 10pm to 10:54pm. On average, Kaseifu no Mita garnered a viewership rating of 25.2%. Its last episode garnered a viewership rating of over 40% when it was aired, making it the highest watched show of 2011 in Japan. Kaseifu no Mita won several awards, including the \"Best Drama\" award, at the 71st Television Drama Academy Awards. Despite the popularity of Kaseifu no Mita, the scriptwriter revealed that there will not be any sequels to this series. Featured Crew Kazuhiko Yukawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nanako Matsushima Akari Mita Saki Aibu Urara Yuuki Hiroki Hasegawa Keiichi Asuda Shiori Kutsuna Yui Asuda Taishi Nakagawa Kakeru Asuda Full Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of Kaseifu no Mita premiered on October 12, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kaseifu no Mita. You can help by rating TV shows you've seen. Facts Original Name  家政婦のミタ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.ntv.co.jp/kaseifu/ Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors t 11 taxigps 10 CrewMdk e 5 elephane A 5 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}