{"link": "https://www.themoviedb.org/tv/51757?language=en", "title": "Nai Suan Kwan", "resume": "Spike Kamala Nan hundred lakes (audition was for me) to sleep and dream of a gala dinner was fixed besieged by the media and people in the circles of nobility, happily, suddenly. the old man screaming and pointing at me for being ungrateful. And forget their own ancestry Ears, eyes startled Think of the stories in the past grain was dew (phys Suda Lawan the concert m), the mother of the school age be left to Tachgag (Council Jane character) and teachers (immaculate Nilawan) sister since. the infantile By refusing to say who is the father and run away. Build pain is very heartbreaking to Tachgag unbroken cloud over time (that Krist Sirisanthana) is another mother who was brought to the Minority party. Make the ears with a range of cloud close.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Pakorn Chatborirak", "Rasri Balenciaga", "Patarin Jearasuk", "Premanat Suwannannon", "Danai Jarujinda"], "character": ["Mai", "Pedpook", "Bai", "Ohm", "Danai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51757   Expand Nai Suan Kwan   (2014) User Score Overview Spike Kamala Nan hundred lakes (audition was for me) to sleep and dream of a gala dinner was fixed besieged by the media and people in the circles of nobility, happily, suddenly. the old man screaming and pointing at me for being ungrateful. And forget their own ancestry Ears, eyes startled Think of the stories in the past grain was dew (phys Suda Lawan the concert m), the mother of the school age be left to Tachgag (Council Jane character) and teachers (immaculate Nilawan) sister since. the infantile By refusing to say who is the father and run away. Build pain is very heartbreaking to Tachgag unbroken cloud over time (that Krist Sirisanthana) is another mother who was brought to the Minority party. Make the ears with a range of cloud close.  Featured Crew Pin Densakul Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pakorn Chatborirak Mai Rasri Balenciaga Pedpook Patarin Jearasuk Bai Premanat Suwannannon Ohm Danai Jarujinda Danai Full Cast & Crew Last Season Season 1 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Nai Suan Kwan. You can help by rating TV shows you've seen. Facts Original Name  Nai Sawan Kwan Status  Ended Networks - Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 36 Crip z 4 zurman1 4 mariilakorn21 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}