{"link": "https://www.themoviedb.org/tv/40532?language=en", "title": "The Queen", "resume": "The Queen was a 2009 British drama-documentary showing Queen Elizabeth II at different points during her life. Broadcast on Channel 4 over five consecutive nights from 29 November 2009, the Queen was portrayed by a different actress in each episode. The Queen was portrayed by Emilia Fox, Samantha Bond, Susan Jameson, Barbara Flynn and Diana Quick. Katie McGrath played Princess Margaret in the first episode and Lesley Manville played Margaret Thatcher in the third episode. The series was co-funded by the American Broadcasting Company, the network which aired the series in the US.\nThis reunited Emilia Fox and Katie McGrath who had played sisters in BBC One's Merlin.", "rate": 60, "genre": ["Documentary", "Drama"], "cast": ["Samantha Bond", "Emilia Fox", "Katie McGrath", "Barbara Flynn", "Diana Quick"], "character": ["The Queen", "Queen Elizabeth II", "Princess Margaret", "The Queen", "The Queen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40532   Expand The Queen   (2009) User Score Overview The Queen was a 2009 British drama-documentary showing Queen Elizabeth II at different points during her life. Broadcast on Channel 4 over five consecutive nights from 29 November 2009, the Queen was portrayed by a different actress in each episode. The Queen was portrayed by Emilia Fox, Samantha Bond, Susan Jameson, Barbara Flynn and Diana Quick. Katie McGrath played Princess Margaret in the first episode and Lesley Manville played Margaret Thatcher in the third episode. The series was co-funded by the American Broadcasting Company, the network which aired the series in the US. This reunited Emilia Fox and Katie McGrath who had played sisters in BBC One's Merlin. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samantha Bond The Queen Emilia Fox Queen Elizabeth II Katie McGrath Princess Margaret Barbara Flynn The Queen Diana Quick The Queen Full Cast & Crew Last Season Season 1 2009 | 5 Episodes Season 1 of The Queen premiered on November 29, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Queen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.channel4.com/programmes/the-queen/ Genres Documentary Drama Keywords england queen biography miniseries monarch british monarchy Content Score 86 Almost there... Top Contributors TB 79 TMDb Bot R 23 Rebecca O 2 OnNeVitQue2FoisJB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}