{"link": "https://www.themoviedb.org/tv/63440?language=en", "title": "Akagi", "resume": "Akagi Shigeru is a young, white-haired mahjong genius. One summer in 1965, he ends up facing off against Washizu Iwao, Japan’s King of Darkness who has amassed enormous fortune and power, at the request of his acquaintance, the rogue detective Yasuoka. As the observer, Ogi Takeshi, a leader of the henchmen of Inada-gumi watches over them, mahjong with special rules called Washizu Mahjong begins. It is a life or death struggle with Akagi’s fresh blood and Washizu’s entire fortune at stake.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Kanata Hongo", "Masahiko Tsugawa"], "character": ["Akagi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63440   Expand Akagi   (2015) User Score Overview Akagi Shigeru is a young, white-haired mahjong genius. One summer in 1965, he ends up facing off against Washizu Iwao, Japan’s King of Darkness who has amassed enormous fortune and power, at the request of his acquaintance, the rogue detective Yasuoka. As the observer, Ogi Takeshi, a leader of the henchmen of Inada-gumi watches over them, mahjong with special rules called Washizu Mahjong begins. It is a life or death struggle with Akagi’s fresh blood and Washizu’s entire fortune at stake. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kanata Hongo Akagi Masahiko Tsugawa Full Cast & Crew Last Season Season 1 2015 | 2 Episodes Season 1 of Akagi premiered on July 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Akagi. You can help by rating TV shows you've seen. Facts Original Name  アカギ Status  Ended Network BS SKY PerfecTV! Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.bs-sptv.com/zawazawa/ Genres Crime Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 17 saicohtic 4 Elizabeth Jennings 3 Sergiojamon R 3 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}