{"link": "https://www.themoviedb.org/tv/71848?language=en", "title": "Cyrus vs. Cyrus: Design and Conquer", "resume": "After years of perfecting their passion for interior design in their own homes, Tish and Brandi Cyrus take their talents to the streets of their hometown, Nashville, to share their skills with friends and word-of-mouth clients.", "rate": 18, "genre": ["Reality"], "cast": ["Tish Cyrus", "Brandi Cyrus"], "character": ["Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71848   Expand Cyrus vs. Cyrus: Design and Conquer   (2017) User Score  Play Trailer Overview After years of perfecting their passion for interior design in their own homes, Tish and Brandi Cyrus take their talents to the streets of their hometown, Nashville, to share their skills with friends and word-of-mouth clients. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tish Cyrus Herself Brandi Cyrus Herself Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Cyrus vs. Cyrus: Design and Conquer premiered on May 25, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cyrus vs. Cyrus: Design and Conquer. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  - Homepage   http://www.bravotv.com/cyrus-vs-cyrus-design-and-conquer Genres Reality Keywords home renovation Content Score 64 We're so close, yet so far. Top Contributors 29 Elizabeth Jennings 2 Banana TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}