{"link": "https://www.themoviedb.org/tv/51753?language=en", "title": "Roy Marn", "resume": "A slap and kiss lakorn involving a force marriage that wasn’t meant to be. It was her cousin who should have married pra’ek, but the day before the wedding, her cousin was kidnapped by a guy who had loved her for years. He kidnapped her, assaulted her, got her pregnant, and thus everything changed. The young and bratty nang’ek had to take the place of her cousin because it was a marriage to erase a debt. Nang’ek’s uncle owed money to pra’ek (Boy) and his father. Since he can’t use his daughter, you’ll use his niece instead.", "rate": 65, "genre": ["Soap", "Drama"], "cast": ["Pakorn Chatborirak", "Rasri Balenciaga", "Ranee Campen", "Ekkaphong Jongkesakorn", "Mira Komolwanich"], "character": ["Mark", "Bee", "May", "Athit", "Fon (Bee's best friend)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51753   Expand Roy Marn   (2011) User Score  Play Trailer Overview A slap and kiss lakorn involving a force marriage that wasn’t meant to be. It was her cousin who should have married pra’ek, but the day before the wedding, her cousin was kidnapped by a guy who had loved her for years. He kidnapped her, assaulted her, got her pregnant, and thus everything changed. The young and bratty nang’ek had to take the place of her cousin because it was a marriage to erase a debt. Nang’ek’s uncle owed money to pra’ek (Boy) and his father. Since he can’t use his daughter, you’ll use his niece instead.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pakorn Chatborirak Mark Rasri Balenciaga Bee Ranee Campen May Ekkaphong Jongkesakorn Athit Mira Komolwanich Fon (Bee's best friend) Full Cast & Crew Last Season Season 1 2011 | 15 Episodes Season 1 of Roy Marn premiered on September 23, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Roy Marn. You can help by rating TV shows you've seen. Facts Original Name  Roy Marn 2011 Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Thai Runtime  - Homepage   2011-09-23 Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 46 Crip 14 Elizabeth Jennings 5 galactica_j TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}