{"link": "https://www.themoviedb.org/tv/4086?language=en", "title": "Diners, Drive-Ins and Dives", "resume": "Diners, Drive-Ins and Dives is an American food television series that premiered in November 2006 on the Food Network. First produced by Page Productions and now by Citizen Pictures the program stars and is hosted by Guy Fieri. The show originally began as a one-off special, based on the idea proposed by David Page.\nWhen Food Network launched its HD simulcast of its SD channel on March 31, 2008, later episodes of the series began to be presented in high definition, although it never aired on the former Food Network HD channel.\nThe show features a \"road trip\" concept, similar to Road Tasted, Giada's Weekend Getaways and $40 a Day. Fieri travels around North America looking for the best diners, drive-in restaurants, and dive bars.", "rate": 64, "genre": ["Documentary"], "cast": ["Guy Fieri"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4086   Expand Diners, Drive-Ins and Dives   (2007) User Score  Play Trailer Overview Diners, Drive-Ins and Dives is an American food television series that premiered in November 2006 on the Food Network. First produced by Page Productions and now by Citizen Pictures the program stars and is hosted by Guy Fieri. The show originally began as a one-off special, based on the idea proposed by David Page. When Food Network launched its HD simulcast of its SD channel on March 31, 2008, later episodes of the series began to be presented in high definition, although it never aired on the former Food Network HD channel. The show features a \"road trip\" concept, similar to Road Tasted, Giada's Weekend Getaways and $40 a Day. Fieri travels around North America looking for the best diners, drive-in restaurants, and dive bars. Featured Crew Guy Fieri Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guy Fieri Himself - Host Full Cast & Crew Current Season Season 28 2017 | 9 Episodes Season 28 of Diners, Drive-Ins and Dives premiered on December 22, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Diners, Drive-Ins and Dives. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2011-01-19 Restaurant: Impossible 5.7    2009-01-13 Chopped 4.8    2011-11-21 The Layover 7.8    2004-10-19 The Biggest Loser 4.6    1995-09-09 Earthworm Jim 6.6    2008-12-03 Man v. Food 6.7    1999-07-07 Good Eats 8.7    2010-12-01 Storage Wars 5.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.foodnetwork.com/diners-drive-ins-and-dives/index.html Genres Documentary Keywords restaurant food Content Score 71 Just a little bit more... Top Contributors 25 Elizabeth Jennings z 10 zurman1 R 4 Rebecca 4 JaseYANG  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}