{"link": "https://www.themoviedb.org/tv/31066?language=en", "title": "Salad Fingers", "resume": "Salad Fingers is a Animation series originally created by British cartoonist David Firth in July 2004. It gained rapid internet popularity in 2005. The San Francisco Chronicle ranked it in the \"Top 10\" pop culture phenomena for that year.\nThe cartoon revolves around the eponymous Salad Fingers, a thin, green, mentally troubled man who inhabits a desolate world. Already a well-known Flash animation series available on the internet, Salad Fingers premiered in Australia at the 2007 Sydney Underground Film Festival at the Factory Theatre. The first seven episodes were shown back to back, along with a variety of other animated short films, during the \"Re-Animation\" session.", "rate": 76, "genre": ["Animation"], "cast": ["David Firth", "Christian \"Crust\" Pickup"], "character": ["Everyone", "Mable"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31066   Expand Salad Fingers   (2004) User Score Overview Salad Fingers is a Animation series originally created by British cartoonist David Firth in July 2004. It gained rapid internet popularity in 2005. The San Francisco Chronicle ranked it in the \"Top 10\" pop culture phenomena for that year. The cartoon revolves around the eponymous Salad Fingers, a thin, green, mentally troubled man who inhabits a desolate world. Already a well-known Flash animation series available on the internet, Salad Fingers premiered in Australia at the 2007 Sydney Underground Film Festival at the Factory Theatre. The first seven episodes were shown back to back, along with a variety of other animated short films, during the \"Re-Animation\" session. Featured Crew David Firth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast David Firth Everyone Christian \"Crust\" Pickup Mable Full Cast & Crew Last Season Season 1 2004 | 10 Episodes Season 1 of Salad Fingers premiered on July  1, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Salad Fingers. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1998-11-04 Beyond Belief: Fact or Fiction 6.9    2005-03-11 Wonder Showzen 7.4    2003-08-26 Kenny vs. Spenny 7.6    2004-10-27 Drawn Together 6.9    2007-01-25 Skins 7.4    1997-04-27 The Shining 6.0    2008-10-27 Dead Set 7.5    2003-06-27 Dead Like Me 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.fat-pie.com/ Genres Animation Keywords psychological Content Score 71 Just a little bit more... Top Contributors 24 wmorgan23 16 lineker w 10 worldbuilder TB 8 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}