{"link": "https://www.themoviedb.org/tv/60859?language=en", "title": "Mystery Girls", "resume": "Mystery Girls follows two former detective TV show starlets brought back together by a real-life mystery. Charlie Contour is a suburban housewife and mother, while Holly Hamilton longs for her glory days in the 90's when she was on television. Both of their lives are disrupted when Nick, a witness to a crime and a ‘Mystery Girls' fanatic, will only speak to the infamous duo, and the former friends must reunite and put their TV crime-solving skills to the test.", "rate": 46, "genre": ["Comedy"], "cast": ["Jennie Garth", "Tori Spelling", "Miguel Pinzon"], "character": ["Charlie", "Holly", "Nick Diaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60859   Expand Mystery Girls   (2014) User Score  Play Trailer Overview Mystery Girls follows two former detective TV show starlets brought back together by a real-life mystery. Charlie Contour is a suburban housewife and mother, while Holly Hamilton longs for her glory days in the 90's when she was on television. Both of their lives are disrupted when Nick, a witness to a crime and a ‘Mystery Girls' fanatic, will only speak to the infamous duo, and the former friends must reunite and put their TV crime-solving skills to the test. Featured Crew Shepard Boucher Creator Tori Spelling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennie Garth Charlie Tori Spelling Holly Miguel Pinzon Nick Diaz Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Mystery Girls premiered on June 25, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mystery Girls. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://abcfamily.go.com/shows/mystery-girls Genres Comedy Keywords private investigator private detective sitcom actress female private detective Content Score 71 Just a little bit more... Top Contributors 24 Elizabeth Jennings 17 benf45 12 Banana TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}