{"link": "https://www.themoviedb.org/tv/17873?language=en", "title": "I Get That a Lot", "resume": "I Get That A Lot is a reality television special originally created by Danny Harris occasionally airing on CBS, which sets up celebrities in everyday working class jobs. Hidden cameras are used to capture the reactions of unsuspecting customers and bypassers. When the celebrities are recognized, they deny their real identities and say \"I get that a lot,\" until the end of the segment, at which time the cameras are revealed and they come forward about their identities.\nThe first two episodes also aired internationally in Australia on Channel Ten. There is also a French version based on the format, named Sosie! Or Not Sosie?, produced by Carson Prod and aired on French TV leader TF1.", "rate": 0, "genre": ["Comedy"], "cast": ["Heidi Klum", "Jessica Simpson", "Jeff Probst", "LeAnn Rimes", "Ice-T"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17873   Expand I Get That a Lot   (2009) User Score Overview I Get That A Lot is a reality television special originally created by Danny Harris occasionally airing on CBS, which sets up celebrities in everyday working class jobs. Hidden cameras are used to capture the reactions of unsuspecting customers and bypassers. When the celebrities are recognized, they deny their real identities and say \"I get that a lot,\" until the end of the segment, at which time the cameras are revealed and they come forward about their identities. The first two episodes also aired internationally in Australia on Channel Ten. There is also a French version based on the format, named Sosie! Or Not Sosie?, produced by Carson Prod and aired on French TV leader TF1. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Heidi Klum Jessica Simpson Jeff Probst LeAnn Rimes Ice-T Full Cast & Crew Last Season Season 1 2009 | 5 Episodes Season 1 of I Get That a Lot premiered on April  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I Get That a Lot. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cbs.com/specials/i_get_that_a_lot/video/ Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}