{"link": "https://www.themoviedb.org/tv/66463?language=en", "title": "First Impressions", "resume": "A weekly half-hour competition that features Dana Carvey and is hosted by Freddie Prinze Jr. Carvey is the “expert-in-residence” in the comedic series that pits America’s best amateur impressionists against each other in a battle of celebrity impression. Each week a winner will be crowned.", "rate": 0, "genre": ["Comedy"], "cast": ["Freddie Prinze Jr.", "Dana Carvey"], "character": ["Himself - Host", "Himself - Expert-In-Residence"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66463   Expand First Impressions   (2016) User Score Overview A weekly half-hour competition that features Dana Carvey and is hosted by Freddie Prinze Jr. Carvey is the “expert-in-residence” in the comedic series that pits America’s best amateur impressionists against each other in a battle of celebrity impression. Each week a winner will be crowned. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Freddie Prinze Jr. Himself - Host Dana Carvey Himself - Expert-In-Residence Full Cast & Crew Last Season Season 1 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on First Impressions. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  22m Homepage   http://www.usanetwork.com/firstimpressionswithdanacarvey Genres Comedy Keywords stand-up comedy impressionist Content Score 56 We're so close, yet so far. Top Contributors 29 Elizabeth Jennings D 13 Dirk1313  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}