{"link": "https://www.themoviedb.org/tv/902?language=en", "title": "Yu-Gi-Oh! Duel Monsters", "resume": "Yu-Gi-Oh! Duel Monsters is a television anime series produced by Nihon Ad Systems and Studio Gallop, based on chapters 60-343 of the Yu-Gi-Oh! manga written by Kazuki Takahashi. It is the second anime adaptation of the manga following the anime produced by Toei Animation, adapting the manga from where that series finished. The series revolves around a card duelist named Yugi Mutou, who faces various opponents in a game known as Duel Monsters. The series originally aired in Japan on TV Tokyo between April 2000 and September 2004, running for 224 episodes. An English-language adaptation by 4Kids Entertainment aired in North America between September 2001 and June 2006 on Kids' WB under the name Yu-Gi-Oh!, also releasing the series in various countries outside of Japan. Based on the success of the series, 4Kids also commissioned an animated film, Yu-Gi-Oh! The Movie: Pyramid of Light, and a mini-series, Yu-Gi-Oh! Capsule Monsters. The series has spawned three main spin-off anime series; Yu-Gi-Oh! Duel Monsters GX, Yu-Gi-Oh! 5D's and Yu-Gi-Oh! Zexal.", "rate": 75, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 902   Expand Yu-Gi-Oh! Duel Monsters   (2000) User Score Overview Yu-Gi-Oh! Duel Monsters is a television anime series produced by Nihon Ad Systems and Studio Gallop, based on chapters 60-343 of the Yu-Gi-Oh! manga written by Kazuki Takahashi. It is the second anime adaptation of the manga following the anime produced by Toei Animation, adapting the manga from where that series finished. The series revolves around a card duelist named Yugi Mutou, who faces various opponents in a game known as Duel Monsters. The series originally aired in Japan on TV Tokyo between April 2000 and September 2004, running for 224 episodes. An English-language adaptation by 4Kids Entertainment aired in North America between September 2001 and June 2006 on Kids' WB under the name Yu-Gi-Oh!, also releasing the series in various countries outside of Japan. Based on the success of the series, 4Kids also commissioned an animated film, Yu-Gi-Oh! The Movie: Pyramid of Light, and a mini-series, Yu-Gi-Oh! Capsule Monsters. The series has spawned three main spin-off anime series; Yu-Gi-Oh! Duel Monsters GX, Yu-Gi-Oh! 5D's and Yu-Gi-Oh! Zexal. Featured Crew Kazuki Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2017 | 24 Episodes Season 7 of Yu-Gi-Oh! Duel Monsters premiered on September  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   2004-10-06 Yu-Gi-Oh! GX 6.4    2001-10-07 Captain Tsubasa - Road to 2002 6.1    1998-04-04 Yu-Gi-Oh! 6.4    Digimon Adventure 02 5.6    1999-08-30 Monster Rancher 5.6    Digimon Frontier 6.3    2014-04-05 Dragonar Academy 7.0    2004-07-10 DearS 5.0  Facts Original Name  遊☆戯☆王デュエルモンスターズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.yugioh.com/ Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords anime Content Score 64 We're so close, yet so far. Top Contributors d 17 denis 15 andalmeida f 13 fstaske t 10 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}