{"link": "https://www.themoviedb.org/tv/42407?language=en", "title": "Whispered Words", "resume": "Whispered Words is a Japanese yuri manga series written and illustrated by Takashi Ikeda. It was serialized in Media Factory's seinen manga magazine Monthly Comic Alive between May 2007 and September 2011, and was compiled into nine tankōbon volumes. The series has been licensed in North America by One Peace Books. It was adapted as a 13-episode anime television series produced by AIC that aired between October and December 2009 on TV Tokyo. The series, which is set in a co-ed high school, is about Sumika Murasame, a 15-year-old girl who is secretly in love with her female best friend, Ushio Kazama. Ushio likes girls too, but is only into \"cute\" and \"small\" girls, while Sumika is tall, good at sports, and outgoing rather than shy.", "rate": 55, "genre": ["Animation", "Drama"], "cast": ["Ayahi Takagaki", "Megumi Takamoto", "Ayaka Shimizu", "Chiwa Saito", "Emiri Kato"], "character": ["Sumika Murasame", "Ushio Kazama", "Masaki Akemiya", "Miyako Taema", "Kiyori Torioi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42407   Expand Whispered Words   (2009) User Score Overview Whispered Words is a Japanese yuri manga series written and illustrated by Takashi Ikeda. It was serialized in Media Factory's seinen manga magazine Monthly Comic Alive between May 2007 and September 2011, and was compiled into nine tankōbon volumes. The series has been licensed in North America by One Peace Books. It was adapted as a 13-episode anime television series produced by AIC that aired between October and December 2009 on TV Tokyo. The series, which is set in a co-ed high school, is about Sumika Murasame, a 15-year-old girl who is secretly in love with her female best friend, Ushio Kazama. Ushio likes girls too, but is only into \"cute\" and \"small\" girls, while Sumika is tall, good at sports, and outgoing rather than shy. Featured Crew 倉田英之 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayahi Takagaki Sumika Murasame Megumi Takamoto Ushio Kazama Ayaka Shimizu Masaki Akemiya Chiwa Saito Miyako Taema Emiri Kato Kiyori Torioi Full Cast & Crew Last Season Sasameki koto season 1 2009 | 13 Episodes Season 1 of Whispered Words premiered on October  8, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Whispered Words. You can help by rating TV shows you've seen. Facts Original Name  ささめきこと Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.tv-tokyo.co.jp/anime/sasameki/ Genres Animation Drama Keywords yuri Content Score 93 Almost there... Top Contributors 10 suninverse a 5 alfdurand14 m 3 magoozin TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}