{"link": "https://www.themoviedb.org/tv/21494?language=en", "title": "V", "resume": "V is an American science fiction television series that ran for two seasons on ABC, from November 3, 2009 to March 15, 2011. A remake of the 1983 miniseries created by Kenneth Johnson, the new series chronicles the arrival on Earth of a technologically advanced alien species which ostensibly comes in peace, but actually has sinister motives. V stars Morena Baccarin, Lourdes Benedicto, Morris Chestnut, Joel Gretsch, Logan Huffman, Charles Mesure, Elizabeth Mitchell, Laura Vandervoort and Scott Wolf, and was executive produced by Scott Rosenbaum, Yves Simoneau, Scott Peters, and Jace Hall. The series was produced by The Scott Peters Company, HDFilms and Warner Bros. Television.", "rate": 63, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Morris Chestnut", "Morena Baccarin", "Joel Gretsch", "Elizabeth Mitchell", "Laura Vandervoort"], "character": ["Ryan Nichols", "Anna", "Father Jack Landry", "Erica Evans", "Lisa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21494   Expand V   (2009) User Score  Play Trailer Overview V is an American science fiction television series that ran for two seasons on ABC, from November 3, 2009 to March 15, 2011. A remake of the 1983 miniseries created by Kenneth Johnson, the new series chronicles the arrival on Earth of a technologically advanced alien species which ostensibly comes in peace, but actually has sinister motives. V stars Morena Baccarin, Lourdes Benedicto, Morris Chestnut, Joel Gretsch, Logan Huffman, Charles Mesure, Elizabeth Mitchell, Laura Vandervoort and Scott Wolf, and was executive produced by Scott Rosenbaum, Yves Simoneau, Scott Peters, and Jace Hall. The series was produced by The Scott Peters Company, HDFilms and Warner Bros. Television. Featured Crew Scott Peters Creator Kenneth Johnson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  2 Images Backdrops  26 Posters  32 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morris Chestnut Ryan Nichols Morena Baccarin Anna Joel Gretsch Father Jack Landry Elizabeth Mitchell Erica Evans Laura Vandervoort Lisa Full Cast & Crew Last Season Season 2 2011 | 10 Episodes Season 2 of V premiered on January  4, 2011. View All Seasons Social Reviews  0 Discussions  11 Subject Status Replies Last Reply No ending. Open 0 by stugood\n      \n     S Diana's return Open 0 by Strannger18\n      \n     S The soul Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  26 Posters  32 Recommendations   2009-09-24 FlashForward 6.9    2011-09-26 Terra Nova 6.3    2004-07-11 The 4400 6.9    2010-09-20 The Event 6.2    2011-06-19 Falling Skies 6.4    2008-01-13 Terminator: The Sarah Connor Chronicles 7.3    2009-07-07 Warehouse 13 7.2    2010-01-22 Caprica 6.7  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  42m, 60m Homepage   http://abc.go.com/shows/v Genres Sci-Fi & Fantasy Drama Keywords alien alien invasion Content Score 100 Yes! Looking good! Top Contributors t 20 theusedversion M 17 Mec!as 8 Atanas z 8 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}