{"link": "https://www.themoviedb.org/tv/40495?language=en", "title": "Der Bastian", "resume": "Der Bastian is a German television series written by Barbara Noack, broadcast in 13 episodes between 1972 and 1973 on ZDF.", "rate": 60, "genre": ["Comedy"], "cast": ["Horst Janson", "Lina Carstens", "Karin Anselm", "Friedrich von Thun"], "character": ["Bastian Guthmann", "Oma Guthmann", "Dr. Katharina Freude", "Karli Guthmann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40495   Expand Der Bastian   (1973) User Score Overview Der Bastian is a German television series written by Barbara Noack, broadcast in 13 episodes between 1972 and 1973 on ZDF. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Horst Janson Bastian Guthmann Lina Carstens Oma Guthmann Karin Anselm Dr. Katharina Freude Friedrich von Thun Karli Guthmann Full Cast & Crew Last Season Season 1 1973 | 13 Episodes Season 1 of Der Bastian premiered on July  2, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Der Bastian. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  25m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors S 19 Samara CM 4 Cherche Moi s 1 stesme  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}