{"link": "https://www.themoviedb.org/tv/60198?language=en", "title": "Twelve Men In a Year", "resume": "29-year-old magazine reporter Mi-Roo believes heavily that astrology decides fate. She then writes a column for the magazine based on her own dating experience with dating 12 men with the 12 different astrological signs.", "rate": 0, "genre": ["Comedy"], "cast": ["Yoon Jin-seo", "On Ju-wan", "Go Joon-hee", "Bae Geu-rin", "Julien Kang"], "character": ["Na Mi-roo", "Cha Jin-oh", "Park Tan-ya", "Oh Hae-ra", "Alex"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60198   Expand Twelve Men In a Year   (2012) User Score Overview 29-year-old magazine reporter Mi-Roo believes heavily that astrology decides fate. She then writes a column for the magazine based on her own dating experience with dating 12 men with the 12 different astrological signs.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Jin-seo Na Mi-roo On Ju-wan Cha Jin-oh Go Joon-hee Park Tan-ya Bae Geu-rin Oh Hae-ra Julien Kang Alex Full Cast & Crew Last Season Season 1 2012 | 16 Episodes Season 1 of Twelve Men In a Year premiered on February 15, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Twelve Men In a Year. You can help by rating TV shows you've seen. Facts Original Name  일년에 열두남자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  45m Homepage  - Genres Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 29 Maria180493 CM 4 Cherche Moi d 1 daphie t 1 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}