{"link": "https://www.themoviedb.org/tv/10316?language=en", "title": "Mr. Smith", "resume": "Mr. Smith is an American sitcom that aired on NBC from September 23 through December 16, 1983. The series was based around the premise of a talking orangutan. Mr. Smith was canceled after thirteen episodes were aired.\nThe orangutan who played Mr. Smith had previously been featured in the Clint Eastwood movies Any Which Way You Can and Every Which Way But Loose.", "rate": 0, "genre": ["Comedy"], "cast": ["Tim Dunigan", "Leonard Frey", "Stuart Margolin", "Terri Garber"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10316   Expand Mr. Smith   (1983) User Score Overview Mr. Smith is an American sitcom that aired on NBC from September 23 through December 16, 1983. The series was based around the premise of a talking orangutan. Mr. Smith was canceled after thirteen episodes were aired. The orangutan who played Mr. Smith had previously been featured in the Clint Eastwood movies Any Which Way You Can and Every Which Way But Loose. Featured Crew Ed. Weinberger Creator David Lloyd Creator Stan Daniels Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Dunigan Leonard Frey Stuart Margolin Terri Garber Full Cast & Crew Last Season Season 1 1983 | 23 Episodes Season 1 of Mr. Smith premiered on September 23, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mr. Smith. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords talking animal orangutan animal primate sitcom Content Score 79 Pump it up! We're close now. Top Contributors 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}