{"link": "https://www.themoviedb.org/tv/33091?language=en", "title": "The Glades", "resume": "This Crime series follows Matt Passmore as Jim, a Chicago cop who gets kicked off the force after being shot and wrongfully accused by his ex-captain of having an affair with his wife. After receiving his payout, Jim decides to moves to a small Florida town to join the state police.", "rate": 70, "genre": ["Drama", "Action", "Adventure"], "cast": ["Matt Passmore", "Kiele Sanchez", "Carlos Gómez", "Michelle Hurd", "Jordan Wall"], "character": ["Jim Longworth", "Callie Cargill", "Carlos Sanchez", "Colleen Manus", "Daniel Green"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33091   Expand The Glades   (2010) User Score  Play Trailer Overview This Crime series follows Matt Passmore as Jim, a Chicago cop who gets kicked off the force after being shot and wrongfully accused by his ex-captain of having an affair with his wife. After receiving his payout, Jim decides to moves to a small Florida town to join the state police. Featured Crew Clifton Campbell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  10 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt Passmore Jim Longworth Kiele Sanchez Callie Cargill Carlos Gómez Carlos Sanchez Michelle Hurd Colleen Manus Jordan Wall Daniel Green Full Cast & Crew Last Season Season 4 2013 | 13 Episodes Season 4 of The Glades premiered on May 27, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Glades. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  9 Recommendations   2014-01-10 Enlisted 6.2    2006-01-01 In Justice 6.8    2015-04-15 The Delivery Man 6.5    2010-09-21 Detroit 1-8-7 7.2    2016-06-08 Power Monkeys 7.0    2011-01-13 Kidnap and Ransom 7.6    2010-05-19 The Good Guys 7.9    2011-02-07 The Chicago Code 7.3  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.aetv.com/the-glades/ Genres Drama Action & Adventure Keywords florida police detective murder investigation Content Score 100 Yes! Looking good! Top Contributors 51 Banana s 8 speedycars S 7 Simatic R 7 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}