{"link": "https://www.themoviedb.org/tv/11484?language=en", "title": "Chorlton and the Wheelies", "resume": "Chorlton and the Wheelies is an animated children's television series that ran from September 1976 until June 1979 on British Television Channel. It followed the adventures of Chorlton, a fictional happiness dragon, in Wheelie World.\nChorlton and the Wheelies was created by Cosgrove Hall for the ITV station Thames Television, and the eponymous lead character gets his name from the suburb of Manchester in which the Cosgrove Hall studio was based: the legend \"Made in Chorlton-cum-Hardy\" is found written on the inside of the egg from which he hatches in the very first episode of the series.", "rate": 100, "genre": ["Animation"], "cast": ["Joe Lynch"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11484   Expand Chorlton and the Wheelies   (1976) User Score Overview Chorlton and the Wheelies is an animated children's television series that ran from September 1976 until June 1979 on British Television Channel. It followed the adventures of Chorlton, a fictional happiness dragon, in Wheelie World. Chorlton and the Wheelies was created by Cosgrove Hall for the ITV station Thames Television, and the eponymous lead character gets his name from the suburb of Manchester in which the Cosgrove Hall studio was based: the legend \"Made in Chorlton-cum-Hardy\" is found written on the inside of the egg from which he hatches in the very first episode of the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Lynch Full Cast & Crew Last Season Season 3 1979 | 13 Episodes Season 3 of Chorlton and the Wheelies premiered on March 26, 1979. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Chorlton and the Wheelies. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Chorlton and the Wheelies. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  12m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}