{"link": "https://www.themoviedb.org/tv/20130?language=en", "title": "Making Out", "resume": "Making Out is a British television series, shown by the BBC between 1989 and 1991.\nThe series, created by Franc Roddam, written by Debbie Horsfield, mixed comedy and drama in its portrayal of the women who worked on the factory floor at New Lyne Electronics in Manchester, tackling the personal lives of the characters as well as wider issues of recession, redundancy and retrenchment as the factory goes through various crises and take-overs.\nThe music for the series was composed by New Order. The main theme for the show is an adaptation of the song \"Vanishing Point\". There is a specific mix of this song called the Making Out Mix.", "rate": 60, "genre": ["Drama"], "cast": ["Margi Clarke", "Melanie Kilburn", "Shirley Stelfox", "Rachel Davies", "Heather Tobias"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20130   Expand Making Out   (1989) User Score Overview Making Out is a British television series, shown by the BBC between 1989 and 1991. The series, created by Franc Roddam, written by Debbie Horsfield, mixed comedy and drama in its portrayal of the women who worked on the factory floor at New Lyne Electronics in Manchester, tackling the personal lives of the characters as well as wider issues of recession, redundancy and retrenchment as the factory goes through various crises and take-overs. The music for the series was composed by New Order. The main theme for the show is an adaptation of the song \"Vanishing Point\". There is a specific mix of this song called the Making Out Mix. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Margi Clarke Melanie Kilburn Shirley Stelfox Rachel Davies Heather Tobias Full Cast & Crew Last Season Season 3 1991 | 8 Episodes Season 3 of Making Out premiered on September 24, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Making Out. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 39 Markxist 3 Banana 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}