{"link": "https://www.themoviedb.org/tv/1980?language=en", "title": "Do Not Adjust Your Set", "resume": "Do not adjust your set! is a television series produced originally by Rediffusion, London, then, by the fledgling Thames Television for British commercial television channel ITV from 26 December 1967 to 14 May 1969. The show took its name from the message which was displayed when there was a problem with transmission.\nIt included early appearances of many actors and comedians who later became famous, such as Denise Coffey and David Jason. Eric Idle, Terry Jones, and Michael Palin later became members of the hugely successful Monty Python comedy troupe. Although, originally conceived as a children's programme, it quickly acquired a cult crossover following amongst many adults, including future Pythons John Cleese and Graham Chapman.\nThe Bonzo Dog Doo-Dah Band performed a song in each programme and Bob Kerr's Whoopee Band also appeared. The musicians frequently appeared as extras in sketches. The programme comprised a series of sketches, often bizarre and surreal, frequently satirical with a disjointed style which was to become more famous in the more daring Monty Python's Flying Circus, which followed five months later. At least one DNAYS sketch was re-used in Monty Python. Strange animations between sketches were crafted in the final episodes by the then-unknown Terry Gilliam, who also graduated to Python – part of his \"Christmas cards\" animation reappeared there in the \"Joy to the World\" segment.", "rate": 73, "genre": ["Comedy"], "cast": ["David Jason", "Michael Palin", "Denise Coffey", "Terry Jones", "Eric Idle"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1980   Expand Do Not Adjust Your Set   (1967) User Score Overview Do not adjust your set! is a television series produced originally by Rediffusion, London, then, by the fledgling Thames Television for British commercial television channel ITV from 26 December 1967 to 14 May 1969. The show took its name from the message which was displayed when there was a problem with transmission. It included early appearances of many actors and comedians who later became famous, such as Denise Coffey and David Jason. Eric Idle, Terry Jones, and Michael Palin later became members of the hugely successful Monty Python comedy troupe. Although, originally conceived as a children's programme, it quickly acquired a cult crossover following amongst many adults, including future Pythons John Cleese and Graham Chapman. The Bonzo Dog Doo-Dah Band performed a song in each programme and Bob Kerr's Whoopee Band also appeared. The musicians frequently appeared as extras in sketches. The programme comprised a series of sketches, often bizarre and surreal, frequently satirical with a disjointed style which was to become more famous in the more daring Monty Python's Flying Circus, which followed five months later. At least one DNAYS sketch was re-used in Monty Python. Strange animations between sketches were crafted in the final episodes by the then-unknown Terry Gilliam, who also graduated to Python – part of his \"Christmas cards\" animation reappeared there in the \"Joy to the World\" segment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Jason Michael Palin Denise Coffey Terry Jones Eric Idle Full Cast & Crew Last Season Season 2 1969 | 13 Episodes Season 2 of Do Not Adjust Your Set premiered on February 19, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Do Not Adjust Your Set. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sketch comedy surrealist british humour Content Score 86 Almost there... Top Contributors O 5 Ozbourne 3 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}