{"link": "https://www.themoviedb.org/tv/14649?language=en", "title": "Rough Science", "resume": "Rough Science is a British documentary reality television series made by the BBC in collaboration with the Open University. Six series were made between 2000 and 2005. It was broadcast in prime time on BBC Two and is considered something of a \"break-out hit\" for the Open University. Rough Science was first shown in 2000.\nThe series' formula consists of a group of four or five scientists with specialities in different fields who are given a task that they must complete using the natural resources of the surrounding area together with a small set of supplies. Each programme features a different task and follows the scientists as they use their knowledge and ingenuity in attempting to fulfil it and, in the process, educate the viewing public — despite failure being common.\nEach episode either requires the team to work together in smaller groups to create requirements for the overall challenge, for the small groups to fulfil vaguely related challenges or even to complete the same task in competition. It has been set in a different scenic location each series, typically somewhere with plenty of plants for use by the group. The presenter is Kate Humble and groups of scientists — most of the scientists appear in several series.", "rate": 0, "genre": ["Documentary"], "cast": ["Kate Humble", "Iain Stewart"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14649   Expand Rough Science   (2000) User Score Overview Rough Science is a British documentary reality television series made by the BBC in collaboration with the Open University. Six series were made between 2000 and 2005. It was broadcast in prime time on BBC Two and is considered something of a \"break-out hit\" for the Open University. Rough Science was first shown in 2000. The series' formula consists of a group of four or five scientists with specialities in different fields who are given a task that they must complete using the natural resources of the surrounding area together with a small set of supplies. Each programme features a different task and follows the scientists as they use their knowledge and ingenuity in attempting to fulfil it and, in the process, educate the viewing public — despite failure being common. Each episode either requires the team to work together in smaller groups to create requirements for the overall challenge, for the small groups to fulfil vaguely related challenges or even to complete the same task in competition. It has been set in a different scenic location each series, typically somewhere with plenty of plants for use by the group. The presenter is Kate Humble and groups of scientists — most of the scientists appear in several series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Humble Iain Stewart Full Cast & Crew Last Season Season 6 2005 | 6 Episodes Season 6 of Rough Science premiered on November  2, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rough Science. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}