{"link": "https://www.themoviedb.org/tv/73659?language=en", "title": "Final Fantasy XIV: Dad of Light", "resume": "A father and son rekindle their bond through the online role-playing game Final Fantasy XIV in this live-action series based on a true story.", "rate": 70, "genre": ["Drama", "Family"], "cast": ["Yudai Chiba", "Ren Osugi", "Mako Ishino", "Fumika Baba", "Hatsunori Hasegawa"], "character": ["Akio", "Hakutaro", "Mother"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73659   Expand Final Fantasy XIV: Dad of Light   (2017) User Score Overview A father and son rekindle their bond through the online role-playing game Final Fantasy XIV in this live-action series based on a true story. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yudai Chiba Akio Ren Osugi Hakutaro Mako Ishino Mother Fumika Baba Hatsunori Hasegawa Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Final Fantasy XIV: Dad of Light premiered on April 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Final Fantasy XIV: Dad of Light. You can help by rating TV shows you've seen. Facts Original Name  ファイナルファンタジーXIV 光のお父さん Status  Ended Networks Certification  - Type  Miniseries Original Language  Japanese Runtime  24m Homepage   https://www.netflix.com/title/80178543 Genres Drama Family Keywords video game miniseries father son relationship Content Score 86 Almost there... Top Contributors TB 18 TMDb Bot 16 Elizabeth Jennings R 11 Rebecca r 7 r0drigo4  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}