{"link": "https://www.themoviedb.org/tv/57276?language=en", "title": "TURN: Washington's Spies", "resume": "The story of New York farmer, Abe Woodhull, who bands together with a group of childhood friends to form The Culper Ring, an unlikely group of spies who turn the tide in America’s fight for independence.", "rate": 77, "genre": ["Drama", "War", "Politics"], "cast": ["Jamie Bell", "Seth Numrich", "Heather Lind", "Meegan Warner", "Burn Gorman"], "character": ["Abraham Woodhull", "Ben Talmadge", "Anna Strong", "Mary Woodhull", "Major Hewlett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57276   Expand TURN: Washington's Spies   (2014) User Score  Play Trailer Overview The story of New York farmer, Abe Woodhull, who bands together with a group of childhood friends to form The Culper Ring, an unlikely group of spies who turn the tide in America’s fight for independence. Featured Crew Craig Silverstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Jamie Bell Abraham Woodhull Seth Numrich Ben Talmadge Heather Lind Anna Strong Meegan Warner Mary Woodhull Burn Gorman Major Hewlett Full Cast & Crew Last Season Season 4 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply M Mary Open 6 by  Mirabel M Is Simcoe dead? Open 4 by  Urban Commando a Samuel Roukin- a great actor Open 17 by  abaddonhades Go to Discussions Media Most Popular Videos  4 Backdrops  6 Posters  7 Recommendations   2014-09-21 The Code 7.4    2014-06-01 Halt and Catch Fire 7.7    2006-10-10 Intelligence 8.3    2015-06-01 American Genius 7.0    2008-10-20 Danny Dyer's Deadliest Men 7.0    2013-04-22 Rectify 7.6    2014-02-27 The Red Road 6.0    2014-04-21 Jamaica Inn 5.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m, 60m Homepage   http://www.amctv.com/shows/turn Genres Drama War & Politics Keywords spy period drama 18th century american revolution early america Content Score 100 Yes! Looking good! Top Contributors 55 Elizabeth Jennings 18 United600 12 sallaire 11 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}