{"link": "https://www.themoviedb.org/tv/44074?language=en", "title": "Queen of Reversals", "resume": "Hwang Tae Hee leads a charmed life, and after growing up in a wealthy family, she easily attains a coveted job. Too much of a workaholic to make time for romance, she is taken aback when she falls hard for Bong Joon Soo. She pursues him and they soon get married, but when the honeymoon is over, Tae Hee finds that her rival at work and husband's ex, Baek Yeo Jin, has taken over her job. As she struggles with her job and marriage, she must also cope with the attention of her arrogant, immature boss, Goo Yong Shik, who falls for her as her life falls to pieces. Queen of Reversals is an empowering tale of a woman who manages to regain everything she's lost through sheer willpower and determination.", "rate": 0, "genre": ["Comedy", "Romance"], "cast": ["Kim Nam-Ju", "Jung Joon-ho", "Chae Jung-an", "Park Shi Hoo", "You-Mi Ha"], "character": ["Hwang Tae-hee", "Bong Joon-soo", "Baek Yeo-jin", "Goo Yong-shik", "Han Song-yi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44074   Expand Queen of Reversals   (2010) User Score Overview Hwang Tae Hee leads a charmed life, and after growing up in a wealthy family, she easily attains a coveted job. Too much of a workaholic to make time for romance, she is taken aback when she falls hard for Bong Joon Soo. She pursues him and they soon get married, but when the honeymoon is over, Tae Hee finds that her rival at work and husband's ex, Baek Yeo Jin, has taken over her job. As she struggles with her job and marriage, she must also cope with the attention of her arrogant, immature boss, Goo Yong Shik, who falls for her as her life falls to pieces. Queen of Reversals is an empowering tale of a woman who manages to regain everything she's lost through sheer willpower and determination. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Nam-Ju Hwang Tae-hee Jung Joon-ho Bong Joon-soo Chae Jung-an Baek Yeo-jin Park Shi Hoo Goo Yong-shik You-Mi Ha Han Song-yi Full Cast & Crew Last Season Season 1 2010 | 31 Episodes Season 1 of Queen of Reversals premiered on October 18, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Queen of Reversals. You can help by rating TV shows you've seen. Facts Original Name  역전의 여왕 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/queen/ Genres Comedy Romance Keywords korea Content Score 86 Almost there... Top Contributors M 32 Maria180493 N 10 Nightowl.Kr z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}