{"link": "https://www.themoviedb.org/tv/10149?language=en", "title": "Donald Duck Presents", "resume": "Donald Duck Presents was a television series on the Disney Channel beginning in 1983, which featured classic Disney shorts. Although Donald Duck shorts were the primary programming, additional cartoons featuring Goofy, Mickey Mouse, Chip 'n Dale, Pluto, as well as Silly Symphonies, Disney featurettes, and others Disney-based shorts were shown. It was first aired on September 1, 1983, a few months after Disney Channel was launched. Its timeslot for its early run was at 8:00 AM Eastern Time, making it the third program of the Disney Channel's 16 hour programming day.\nBrief clips and segues featuring Donald Duck typically were placed between each short. The shorts often were edited down, removing the opening and closing credits, and in some cases, edited for length.\nThe opening of the show featured a cavalcade of scenes from classic Disney shorts, and a theme song. Unlike the opening of Good Morning, Mickey!, which features all of the characters in the theme, the opening of Donald Duck Presents features only Donald.\nIt was replaced by Donald's Quack Attack in 1992.", "rate": 85, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10149   Expand Donald Duck Presents   (1943) User Score Overview Donald Duck Presents was a television series on the Disney Channel beginning in 1983, which featured classic Disney shorts. Although Donald Duck shorts were the primary programming, additional cartoons featuring Goofy, Mickey Mouse, Chip 'n Dale, Pluto, as well as Silly Symphonies, Disney featurettes, and others Disney-based shorts were shown. It was first aired on September 1, 1983, a few months after Disney Channel was launched. Its timeslot for its early run was at 8:00 AM Eastern Time, making it the third program of the Disney Channel's 16 hour programming day. Brief clips and segues featuring Donald Duck typically were placed between each short. The shorts often were edited down, removing the opening and closing credits, and in some cases, edited for length. The opening of the show featured a cavalcade of scenes from classic Disney shorts, and a theme song. Unlike the opening of Good Morning, Mickey!, which features all of the characters in the theme, the opening of Donald Duck Presents features only Donald. It was replaced by Donald's Quack Attack in 1992. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1943 | 11 Episodes Season 1 of Donald Duck Presents premiered on January  1, 1943. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Donald Duck Presents. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors V 9 Vivo 3 minhus t 2 thermo6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}