{"link": "https://www.themoviedb.org/tv/60556?language=en", "title": "Bitten", "resume": "Elena Micheals thought she left the world of supernatural behind when she left Stonehaven behind 'for good this time' she thought. Until the night she got the mysterious call from her pack leader asking her to come back. So now she is heading back, leaving her life as a normal photographer in Toronto for the moment to re-enter the world of werewolves, rules about protect the pack and a man she has spent years trying to get out of her system. Oh and did she mention she was the only living female werewolf in existence?", "rate": 57, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Laura Vandervoort", "Greyston Holt", "Greg Bryk", "Steve Lund", "Genelle Williams"], "character": ["Elena Michaels", "Clayton Danvers", "Jeremy Danvers", "Nick Sorrentino", "Rachel Sutton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60556   Expand Bitten   (2014) User Score  Play Trailer Overview Elena Micheals thought she left the world of supernatural behind when she left Stonehaven behind 'for good this time' she thought. Until the night she got the mysterious call from her pack leader asking her to come back. So now she is heading back, leaving her life as a normal photographer in Toronto for the moment to re-enter the world of werewolves, rules about protect the pack and a man she has spent years trying to get out of her system. Oh and did she mention she was the only living female werewolf in existence? Featured Crew Daegan Fryklind Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Laura Vandervoort Elena Michaels Greyston Holt Clayton Danvers Greg Bryk Jeremy Danvers Steve Lund Nick Sorrentino Genelle Williams Rachel Sutton Full Cast & Crew Last Season Season 3 2016 | 10 Episodes Season 3 of Bitten premiered on February 12, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Final Episode Open 0 by Katwah\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  9 Recommendations   2010-09-12 Lost Girl 6.7    2010-01-18 Life Unexpected 7.4    2014-02-17 Star-Crossed 5.6    2010-07-09 Haven 7.0    2013-10-06 Witches of East End 6.6    2011-09-26 Hart of Dixie 6.9    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1    2013-10-09 The Tomorrow People 6.6  Facts Status  Returning Series Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  45m Homepage   http://bitten.space.ca/ Genres Drama Sci-Fi & Fantasy Keywords based on novel or book wolf supernatural blood werewolf cursed Content Score 100 Yes! Looking good! Top Contributors 32 yuyuki 25 Elizabeth Jennings VA 23 Viktor Andersson 21 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}