{"link": "https://www.themoviedb.org/tv/76441?language=en", "title": "Silsilay", "resume": "Hira and Abiha have been abandoned by their father (he is a gambler and didn’t want to take daughters’ responsibility) and raised by their mother in khala’s home along with their cousin Jawad. Abiha is in one sided love of Shahzab, he is their neighbor and childhood friend whereas Hira has always pictured a life with Jawad to which Jawad is completely unaware.\nJawad has recently returned from US after finishing his studies to start a life in Pakistan, soon his friend Ujala will arrive from US and with his mother’s agreement they will be married. This would leave Hira heartbroken meanwhile Hira’s father will contact her mother and demands to meet his daughters.\nAs story unfolds new events we will see their mother’s struggle to protect them from their father, Abiha’s struggle to progress in job and help her mother with day to day needs and Hina’s resolve with Jawad once she learns about her father’s true intention and Jawad divorces Ujala.", "rate": 90, "genre": ["Drama"], "cast": ["Shagufta Ejaz", "Hiba Bokhari", "Junaid Khan", "Muneeb Butt", "Simi Raheal"], "character": ["Tanzila", "Hira", "Jawad", "Shahzeb", "Naila"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76441   Expand Silsilay   (2018) User Score  Play Trailer Overview Hira and Abiha have been abandoned by their father (he is a gambler and didn’t want to take daughters’ responsibility) and raised by their mother in khala’s home along with their cousin Jawad. Abiha is in one sided love of Shahzab, he is their neighbor and childhood friend whereas Hira has always pictured a life with Jawad to which Jawad is completely unaware. Jawad has recently returned from US after finishing his studies to start a life in Pakistan, soon his friend Ujala will arrive from US and with his mother’s agreement they will be married. This would leave Hira heartbroken meanwhile Hira’s father will contact her mother and demands to meet his daughters. As story unfolds new events we will see their mother’s struggle to protect them from their father, Abiha’s struggle to progress in job and help her mother with day to day needs and Hina’s resolve with Jawad once she learns about her father’s true intention and Jawad divorces Ujala. Featured Crew Erum Binte Shahid Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shagufta Ejaz Tanzila Hiba Bokhari Hira Junaid Khan Jawad Muneeb Butt Shahzeb Simi Raheal Naila Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Silsilay premiered on January  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Silsilay. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Geo Entertainment Certification  - Type  Scripted Original Language  English Runtime  37m Homepage  - Genres Drama Keywords family drama Content Score 100 Yes! Looking good! Top Contributors c 32 crackme TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}