{"link": "https://www.themoviedb.org/tv/75676?language=en", "title": "Pompeii", "resume": "Forbidden love blossoms in the city of Pompeii, which until the eruption of volcano Vesuvius in 79 AD, is one of the empire's most powerful cities.", "rate": 60, "genre": ["Drama"], "cast": ["Lorenzo Crespi", "Andrea Osvárt", "Maria Grazia Cucinotta", "Massimo Venturiello", "Maurizio Aiello"], "character": ["Marco", "Valeria", "Lavinia", "Chelidone", "Tiberio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75676   Expand Pompeii   (2007) User Score  Play Trailer Overview Forbidden love blossoms in the city of Pompeii, which until the eruption of volcano Vesuvius in 79 AD, is one of the empire's most powerful cities. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lorenzo Crespi Marco Andrea Osvárt Valeria Maria Grazia Cucinotta Lavinia Massimo Venturiello Chelidone Maurizio Aiello Tiberio Full Cast & Crew Last Season Miniseries 2007 | 2 Episodes Season 1 of Pompeii premiered on March  4, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Pompeii. You can help by rating TV shows you've seen. Facts Original Name  Pompei Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  100m Homepage   http://www.luxvide.it/en/pompeii-63.html Genres Drama Keywords ancient rome romance miniseries period drama pompeii Content Score 93 Almost there... Top Contributors 26 Banana TB 25 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}