{"link": "https://www.themoviedb.org/tv/512?language=en", "title": "Third Watch", "resume": "The exploits of a group of men and women who serve the City of New York as police officers, firemen, and paramedics, all working the same fictional 55th precinct during the 3pm to 11pm shift - the 'Third Watch'.", "rate": 73, "genre": ["Drama"], "cast": ["Jason Wiles", "Coby Bell", "Anthony Ruivivar", "Skipp Sudduth", "Molly Price"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 512   Expand Third Watch   (1999) User Score Overview The exploits of a group of men and women who serve the City of New York as police officers, firemen, and paramedics, all working the same fictional 55th precinct during the 3pm to 11pm shift - the 'Third Watch'. Featured Crew John Wells Creator Edward Allen Bernero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Wiles Coby Bell Anthony Ruivivar Skipp Sudduth Molly Price Full Cast & Crew Last Season Season 6 2004 | 22 Episodes Season 6 of Third Watch premiered on September 17, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  2 Recommendations   1997-09-22 Brooklyn South 9.3    2009-09-28 Trauma 6.7    1994-09-19 ER 6.9    1997-03-04 The Practice 7.6    1990-07-12 Northern Exposure 8.1    1995-01-29 Hercules: The Legendary Journeys 6.3    1999-09-19 Judging Amy 7.1    2002-09-26 Without a Trace 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www2.warnerbros.com/thirdwatch/home.html Genres Drama Keywords new york firemen paramedic nypd police precinct Content Score 93 Almost there... Top Contributors 10 Banana 8 dzero 6 Simon V. 5 AxeL Wave  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}