{"link": "https://www.themoviedb.org/tv/2749?language=en", "title": "Fresh Fields", "resume": "Fresh Fields is a British situation comedy written by John T. Chapman and produced by Thames Television for ITV between 7 March 1984 and 23 October 1986. A ratings success at the time, the show is well remembered for its opening titles featuring a silhouette of a person in a rocking chair.\nIt stars Julia McKenzie and Anton Rodgers as Hester and William Fields, a devoted middle-class couple with an idyllic suburban lifestyle. William works while Hester keeps home. The crux of the show was that she was always looking to try new hobbies or find ways to improve her life, much of which exasperated her hard-working husband.\nThe family home had a granny flat attached, in which Hester's mother Nancy lived. She was divorced from Hester's father Guy although remarried him as the series progressed. The couple had a daughter called Emma who frequently telephoned but never appeared. Her husband Peter did appear often. They later had a son — the Fields' first grandchild — whom they named Guy, after his great-grandfather.\nPerhaps, the best remembered supporting character was Sonia Barrett who would frequently pop round to borrow items to replace hers due to breakage, theft or mislaying. Hester was not perturbed by this, as the two were close friends, but it used to irritate William. Sonia had the show's only catchphrase — she would always knock on the back door of the Fields' home and then say It's only Sonia! as she walked in. This would sometimes lead to applause of recognition from the studio audience, a phenomenon more regularly seen within American sitcoms. Sonia's husband John appeared on occasion, as did William's secretary Miss Denham, played by Daphne Oxenford.", "rate": 70, "genre": ["Comedy"], "cast": ["Ballard Berkeley", "Anton Rodgers", "Julia McKenzie", "Daphne Oxenford", "Philip Bird"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2749   Expand Fresh Fields   (1984) User Score Overview Fresh Fields is a British situation comedy written by John T. Chapman and produced by Thames Television for ITV between 7 March 1984 and 23 October 1986. A ratings success at the time, the show is well remembered for its opening titles featuring a silhouette of a person in a rocking chair. It stars Julia McKenzie and Anton Rodgers as Hester and William Fields, a devoted middle-class couple with an idyllic suburban lifestyle. William works while Hester keeps home. The crux of the show was that she was always looking to try new hobbies or find ways to improve her life, much of which exasperated her hard-working husband. The family home had a granny flat attached, in which Hester's mother Nancy lived. She was divorced from Hester's father Guy although remarried him as the series progressed. The couple had a daughter called Emma who frequently telephoned but never appeared. Her husband Peter did appear often. They later had a son — the Fields' first grandchild — whom they named Guy, after his great-grandfather. Perhaps, the best remembered supporting character was Sonia Barrett who would frequently pop round to borrow items to replace hers due to breakage, theft or mislaying. Hester was not perturbed by this, as the two were close friends, but it used to irritate William. Sonia had the show's only catchphrase — she would always knock on the back door of the Fields' home and then say It's only Sonia! as she walked in. This would sometimes lead to applause of recognition from the studio audience, a phenomenon more regularly seen within American sitcoms. Sonia's husband John appeared on occasion, as did William's secretary Miss Denham, played by Daphne Oxenford. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ballard Berkeley Anton Rodgers Julia McKenzie Daphne Oxenford Philip Bird Full Cast & Crew Last Season Season 4 1986 | 8 Episodes Season 4 of Fresh Fields premiered on September  4, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1986-09-01 Brush Strokes 7.8    2006-01-11 Hyperdrive 7.4    1986-05-01 Bread 7.4    1970-11-08 The Goodies 7.3    1978-11-10 Butterflies 6.9    1990-08-09 Drop the Dead Donkey 7.5    1993-01-27 The Detectives 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}