{"link": "https://www.themoviedb.org/tv/60682?language=en", "title": "Macross Zero", "resume": "Taking place one year before the events of the original Macross series, Macross Zero chronicles the final days of the war between the U.N. Spacy and anti-U.N. factions. After being shot down by the anti-U.N.'s newest fighter plane, ace pilot Shin Kudo finds himself on the remote island of Mayan, where technology is almost non-existent. While Shin stays on the island to heal his wounds, the tranquility of the island is shattered by a battle that involves the UN's newest fighter - the VF-0.", "rate": 80, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy", "War", "Politics"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60682   Expand Macross Zero   (2002) User Score Overview Taking place one year before the events of the original Macross series, Macross Zero chronicles the final days of the war between the U.N. Spacy and anti-U.N. factions. After being shot down by the anti-U.N.'s newest fighter plane, ace pilot Shin Kudo finds himself on the remote island of Mayan, where technology is almost non-existent. While Shin stays on the island to heal his wounds, the tranquility of the island is shattered by a battle that involves the UN's newest fighter - the VF-0. Featured Crew Hiroshi Ohnogi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2002 | 5 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Macross Zero. You can help by rating TV shows you've seen. Facts Original Name  マクロス ゼロ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy War & Politics Keywords island air force romance prequel mecha dogfight military priestess seinen anime real robot alien technology macross Content Score 64 We're so close, yet so far. Top Contributors 30 ElgarL 22 Panayotis CM 17 Cherche Moi a 7 asura766  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}