{"link": "https://www.themoviedb.org/tv/9702?language=en", "title": "Yankeeography", "resume": "Yankeeography is a biography-style television program that chronicles the lives and careers of the players, coaches, and other notable personnel associated with the New York Yankees Major League Baseball team. The series is aired on the YES Network and is produced by MLB Productions. The series is hosted by Yankees radio personality John Sterling. The series has earned five New York Sports Emmy Awards since its inception. In addition to airing on YES, MLB Productions has packaged many of the shows into DVD boxed sets.\nAfter debuting as a weekly show with the 2002 launch of YES, Yankeeography only debuts new episodes periodically. For instance, four episodes premiered in 2006: Tino Martinez, David Cone, the Yankees' 1996 World Series team, and Billy Martin. All Yankees with retired numbers have had shows completed with the exception of Bill Dickey. The show has been criticized for producing episodes on players who remain active while Hall of Famers from much earlier eras such as Jack Chesbro, Tony Lazzeri, Red Ruffing and Lefty Gomez were not profiled. Some profiles have been updated to reflect new developments.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9702   Expand Yankeeography   (2002) User Score Overview Yankeeography is a biography-style television program that chronicles the lives and careers of the players, coaches, and other notable personnel associated with the New York Yankees Major League Baseball team. The series is aired on the YES Network and is produced by MLB Productions. The series is hosted by Yankees radio personality John Sterling. The series has earned five New York Sports Emmy Awards since its inception. In addition to airing on YES, MLB Productions has packaged many of the shows into DVD boxed sets. After debuting as a weekly show with the 2002 launch of YES, Yankeeography only debuts new episodes periodically. For instance, four episodes premiered in 2006: Tino Martinez, David Cone, the Yankees' 1996 World Series team, and Billy Martin. All Yankees with retired numbers have had shows completed with the exception of Bill Dickey. The show has been criticized for producing episodes on players who remain active while Hall of Famers from much earlier eras such as Jack Chesbro, Tony Lazzeri, Red Ruffing and Lefty Gomez were not profiled. Some profiles have been updated to reflect new developments. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 2007 | 3 Episodes Season 6 of Yankeeography premiered on July 18, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Yankeeography. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}