{"link": "https://www.themoviedb.org/tv/5154?language=en", "title": "George of the Jungle", "resume": "George of the Jungle is an American animated series produced by Jay Ward and Bill Scott, who created The Rocky and Bullwinkle Show. The character George was inspired by the legend of Tarzan. It ran for 17 episodes on Saturday mornings from September 9 to December 30, 1967, on the American TV network ABC. The half-hour program was distributed for many years by Worldvision Enterprises, currently part of CBS Television Distribution.  Each Full Episode was a compilation of 3 mini episodes from 3 different shows: George of the Jungle; Tom Slick; Super Chicken -Each voiced by the same actors.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5154   Expand George of the Jungle   (1967) User Score Overview George of the Jungle is an American animated series produced by Jay Ward and Bill Scott, who created The Rocky and Bullwinkle Show. The character George was inspired by the legend of Tarzan. It ran for 17 episodes on Saturday mornings from September 9 to December 30, 1967, on the American TV network ABC. The half-hour program was distributed for many years by Worldvision Enterprises, currently part of CBS Television Distribution.  Each Full Episode was a compilation of 3 mini episodes from 3 different shows: George of the Jungle; Tom Slick; Super Chicken -Each voiced by the same actors. Featured Crew Bill Scott Creator Jay Ward Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1967 | 17 Episodes Season 1 of George of the Jungle premiered on January  1, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on George of the Jungle. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors D 8 Doramius s 2 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}