{"link": "https://www.themoviedb.org/tv/31663?language=en", "title": "The Marriage Ref", "resume": "The Marriage Ref is a TV reality show and panel game hosted by comedian Tom Papa and produced by Jerry Seinfeld, in which a rotating group of celebrities decides the winners of real-life marital disputes. The show premiered on NBC on Sunday, February 28, 2010 on the final night of the Olympics before moving to Thursdays. The show's second season debuted on June 26, 2011. On May 13, 2012, NBC cancelled the series.", "rate": 35, "genre": ["Reality"], "cast": ["Jerry Seinfeld"], "character": ["Panelist"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31663   Expand The Marriage Ref   (2010) User Score Overview The Marriage Ref is a TV reality show and panel game hosted by comedian Tom Papa and produced by Jerry Seinfeld, in which a rotating group of celebrities decides the winners of real-life marital disputes. The show premiered on NBC on Sunday, February 28, 2010 on the final night of the Olympics before moving to Thursdays. The show's second season debuted on June 26, 2011. On May 13, 2012, NBC cancelled the series. Featured Crew Jessica Seinfeld Creator Jerry Seinfeld Creator Ellen Rakieten Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Seinfeld Panelist Full Cast & Crew Last Season Season 2 2011 | 10 Episodes Season 2 of The Marriage Ref premiered on June 26, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Marriage Ref. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.nbc.com/the-marriage-ref/ Genres Reality Keywords marriage game show panel show Content Score 64 We're so close, yet so far. Top Contributors 14 Banana 2 Joe Carson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}