{"link": "https://www.themoviedb.org/tv/2482?language=en", "title": "Crime Traveller", "resume": "Crime Traveller is a 1997 science fiction detective television series produced by Carnival Films for the BBC based on the premise of using time travel for the purpose of solving crimes.\nAnthony Horowitz created the series and wrote every episode. He got the idea while writing an episode of Poirot. Despite having over eight million viewers on a regular basis, Crime Traveller was not renewed after its first series, because according to Horowitz, \"The show wasn't exactly cut. There was a chasm at the BBC, created by the arrival of a new Head of Drama and our run ended at that time. There was no-one around to commission a new series...and so it just didn't happen.\" The final episode of the series was followed the next week by the first episode of Jonathan Creek, which became a popular long-running crime series.", "rate": 100, "genre": ["Drama"], "cast": ["Sue Johnston", "Michael French", "Chloë Annett", "Richard Dempsey", "Paul Trussell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2482   Expand Crime Traveller   (1997) User Score Overview Crime Traveller is a 1997 science fiction detective television series produced by Carnival Films for the BBC based on the premise of using time travel for the purpose of solving crimes. Anthony Horowitz created the series and wrote every episode. He got the idea while writing an episode of Poirot. Despite having over eight million viewers on a regular basis, Crime Traveller was not renewed after its first series, because according to Horowitz, \"The show wasn't exactly cut. There was a chasm at the BBC, created by the arrival of a new Head of Drama and our run ended at that time. There was no-one around to commission a new series...and so it just didn't happen.\" The final episode of the series was followed the next week by the first episode of Jonathan Creek, which became a popular long-running crime series. Featured Crew Anthony Horowitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sue Johnston Michael French Chloë Annett Richard Dempsey Paul Trussell Full Cast & Crew Last Season Season 1 1997 | 8 Episodes Season 1 of Crime Traveller premiered on March  1, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crime Traveller. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}