{"link": "https://www.themoviedb.org/tv/16047?language=en", "title": "Anne of Green Gables", "resume": "Anne of Green Gables is an animated television series, part of Nippon Animation's World Masterpiece Theater. It was adapted from the novel, Anne of Green Gables, by Lucy Maud Montgomery. Produced by Nippon Animation in 1979, it was first broadcast on Fuji TV from January 7, 1979 to December 30, 1979. Fifty episodes were produced in total.\nIt has been exported to neighbouring Asian countries and also to Europe and Canada. As with the novels, the animated version of Anne is much beloved in Japan to this day and \"DVD memorial BOX set\" was released on August 22, 2008 and a new anime series that serves as a prequel to the series, Kon'nichiwa Anne 〜 Before Green Gables, which premiered on April 5, 2009 in Japan.", "rate": 100, "genre": ["Animation", "Drama", "Action", "Adventure", "Drama"], "cast": ["Sanae Takagi", "Eiko Hisamura", "Kazuhiko Inoue", "Ryūji Saikachi", "Fumie Kitahara"], "character": ["Jane", "Anne Shirley", "Gilbert Blythe", "Matthew Cuthbert", "Marilla Cuthbert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16047   Expand Anne of Green Gables   (1979) User Score Overview Anne of Green Gables is an animated television series, part of Nippon Animation's World Masterpiece Theater. It was adapted from the novel, Anne of Green Gables, by Lucy Maud Montgomery. Produced by Nippon Animation in 1979, it was first broadcast on Fuji TV from January 7, 1979 to December 30, 1979. Fifty episodes were produced in total. It has been exported to neighbouring Asian countries and also to Europe and Canada. As with the novels, the animated version of Anne is much beloved in Japan to this day and \"DVD memorial BOX set\" was released on August 22, 2008 and a new anime series that serves as a prequel to the series, Kon'nichiwa Anne 〜 Before Green Gables, which premiered on April 5, 2009 in Japan. Featured Crew Lucy Maud Montgomery Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sanae Takagi Jane Eiko Hisamura Anne Shirley Kazuhiko Inoue Gilbert Blythe Ryūji Saikachi Matthew Cuthbert Fumie Kitahara Marilla Cuthbert Full Cast & Crew Last Season Season 1 1979 | 50 Episodes Season 1 of Anne of Green Gables premiered on January  7, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  15 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Anne of Green Gables. You can help by rating TV shows you've seen. Facts Original Name  赤毛のアン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Drama Action & Adventure Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors b 8 baux CN 7 Carmelo Nicolosi 6 TheDerpMan n 3 nutmac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}