{"link": "https://www.themoviedb.org/tv/75850?language=en", "title": "The Wimbledon Poisoner", "resume": "Henry Farr, a Wimbledon solicitor desperate to rid himself of his wife, settles on murder as a solution to his problem.", "rate": 60, "genre": ["Comedy", "Drama"], "cast": ["Philip Jackson", "Larry Lamb", "Art Malik", "Simon Chandler", "Wendy Nottingham"], "character": ["Detective Inspector Russell Rush", "Dr. Donald Templeton", "Karim Jackson", "No. 47", "Mrs 47"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75850   Expand The Wimbledon Poisoner   (1994) User Score Overview Henry Farr, a Wimbledon solicitor desperate to rid himself of his wife, settles on murder as a solution to his problem. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philip Jackson Detective Inspector Russell Rush Larry Lamb Dr. Donald Templeton Art Malik Karim Jackson Simon Chandler No. 47 Wendy Nottingham Mrs 47 Full Cast & Crew Last Season Miniseries 1994 | 2 Episodes Season 1 of The Wimbledon Poisoner premiered on December 11, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Wimbledon Poisoner. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Comedy Drama Keywords based on novel or book dark comedy lawyer miniseries henpecked husband murder plot Content Score 71 Just a little bit more... Top Contributors TB 23 TMDb Bot 21 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}