{"link": "https://www.themoviedb.org/tv/77312?language=en", "title": "The Seventh Scroll", "resume": "Past and present intertwine when an archaeologist and her husband find a mysterious child on the banks of the Nile and adopt him. But the more they learn about the lost tomb of Pharaoh Mamose, the more Hapi, the little child, is plagued by frightening visions. Soon it is clear that powerful forces are trying to prevent the couple from finding the tomb.", "rate": 50, "genre": [], "cast": ["Wilfried Baasner", "Jeff Fahey", "Karina Lombard", "Katrina Gibson"], "character": ["Lord Intef", "Nick Harper", "Royan", "Lostris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77312   Expand The Seventh Scroll   (1999) User Score Overview Past and present intertwine when an archaeologist and her husband find a mysterious child on the banks of the Nile and adopt him. But the more they learn about the lost tomb of Pharaoh Mamose, the more Hapi, the little child, is plagued by frightening visions. Soon it is clear that powerful forces are trying to prevent the couple from finding the tomb. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wilfried Baasner Lord Intef Jeff Fahey Nick Harper Karina Lombard Royan Katrina Gibson Lostris Full Cast & Crew Last Season Miniseries 1999 | 2 Episodes Season 1 of The Seventh Scroll premiered on June 15, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Seventh Scroll. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   http://www.mediasetdistribution.com/format/seventh-scroll-the-154/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors TB 37 TMDb Bot 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}