{"link": "https://www.themoviedb.org/tv/18779?language=en", "title": "Royal Pains", "resume": "A young E.R. doctor who, after being wrongly blamed for a patient's death, moves to the Hamptons and becomes the reluctant \"doctor for hire\" to the rich and famous. When the attractive administrator of the local hospital asks him to treat the town's less fortunate, he finds himself walking the line between doing well for himself and doing good for others.", "rate": 66, "genre": ["Comedy", "Drama"], "cast": ["Paulo Costanzo", "Brooke D'Orsay", "Mark Feuerstein", "Reshma Shetty", "Ben Shenkman"], "character": ["Evan R. Lawson", "Paige Collins", "Hank Lawson", "Divya Katdare", "Dr. Jeremiah Sacani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18779   Expand Royal Pains   (2009) User Score Overview A young E.R. doctor who, after being wrongly blamed for a patient's death, moves to the Hamptons and becomes the reluctant \"doctor for hire\" to the rich and famous. When the attractive administrator of the local hospital asks him to treat the town's less fortunate, he finds himself walking the line between doing well for himself and doing good for others. Featured Crew Andrew Lenchewski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paulo Costanzo Evan R. Lawson Brooke D'Orsay Paige Collins Mark Feuerstein Hank Lawson Reshma Shetty Divya Katdare Ben Shenkman Dr. Jeremiah Sacani Full Cast & Crew Last Season Season 8 2016 | 8 Episodes Season 8 of Royal Pains premiered on May 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  7 Recommendations   2007-06-28 Burn Notice 7.3    2010-07-11 The Glades 6.3    2008-12-07 Leverage 7.2    2009-10-23 White Collar 7.7    2011-01-20 Fairly Legal 5.8    2014-06-29 Reckless 5.5    2009-10-04 Autumn's Concerto 7.8    2015-06-01 American Genius 7.0  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.usanetwork.com/series/royalpains/ Genres Comedy Drama Keywords long island wealthy doctor medical drama hamptons Content Score 100 Yes! Looking good! Top Contributors 63 Banana 30 Elizabeth Jennings D 13 Dee T 12 Ticktock  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}