{"link": "https://www.themoviedb.org/tv/15422?language=en", "title": "Afterworld", "resume": "Afterworld is a computer-animated American science fiction television series created by writer Brent V. Friedman and artist/filmmaker Michael DeCourcey. Its naturalistic future setting, modeled after traditional Western movie motifs, presents an atypical science fiction backdrop for the narrative. Friedman served as executive producer, along with Stan Rogow.\nAfterworld premiered in the United States on YouTube and Bud.tv on February 28, 2007 with the production website being launched in May, 2007. The series quickly built a loyal fanbase but did not really take off until August, 2007 when it was 're-released' on MySpace. In conjunction with that release the series was also released in Australia on the Sci Fi Channel, as a mobile podcast, and as a web series on US based Crackle.\nThe series was also made available by Sony Pictures Television International as 13 half-hour episodes for traditional broadcasters.", "rate": 68, "genre": ["Mystery", "Drama", "Animation"], "cast": ["Roark Critchlow", "Tara Platt", "Nicole Hansen"], "character": ["Russel Shoemaker", "Kizzy Shoemaker", "Janelle Shoemaker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15422   Expand Afterworld   (2007) User Score Overview Afterworld is a computer-animated American science fiction television series created by writer Brent V. Friedman and artist/filmmaker Michael DeCourcey. Its naturalistic future setting, modeled after traditional Western movie motifs, presents an atypical science fiction backdrop for the narrative. Friedman served as executive producer, along with Stan Rogow. Afterworld premiered in the United States on YouTube and Bud.tv on February 28, 2007 with the production website being launched in May, 2007. The series quickly built a loyal fanbase but did not really take off until August, 2007 when it was 're-released' on MySpace. In conjunction with that release the series was also released in Australia on the Sci Fi Channel, as a mobile podcast, and as a web series on US based Crackle. The series was also made available by Sony Pictures Television International as 13 half-hour episodes for traditional broadcasters. Featured Crew Michael DeCourcey Creator Brent V. Friedman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roark Critchlow Russel Shoemaker Tara Platt Kizzy Shoemaker Nicole Hansen Janelle Shoemaker Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of Afterworld premiered on February 28, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Afterworld. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  3m Homepage   http://afterworld.tv/ Genres Mystery Drama Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors L 11 Lysator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}