{"link": "https://www.themoviedb.org/tv/809?language=en", "title": "Catterick", "resume": "Catterick, aka Vic and Bob in Catterick, is a surreal 2004 BBC situation comedy in 6 episodes, written by and starring Vic Reeves and Bob Mortimer, with Reece Shearsmith, Matt Lucas, Morwenna Banks, Tim Healy, Mark Benton and Charlie Higson. The series was originally broadcast on BBC Three and later rerun on BBC2. Reeves has said that the BBC do not want another series of Catterick, though he may produce a spin-off centring on the DI Fowler character.\nCatterick is arguably Vic and Bob's darkest and most bizarre programme to date, balancing their typically odd, idiosyncratic comedy with some genuinely dark scenes. It plays like a darkly comic road movie, albeit full of Vic and Bob's bizarre, often inscrutable and frequently silly humour. Catterick is probably Vic and Bob's most uncompromising show since their notorious and frequently baffling 1999 sketch series Bang Bang, It's Reeves and Mortimer, from which most of the characters are taken. It is in some ways stylistically similar to their short film The Weekenders first broadcast in 1992 on British television as part of Channel 4's \"Bunch of Five\" series.\nThe series is named after Catterick in North Yorkshire, Britain's largest army base. It is about 10 miles away from Darlington where Vic Reeves grew up. It is also about 20 miles away from Middlesbrough where Bob Mortimer grew up.", "rate": 90, "genre": ["Comedy"], "cast": ["Morwenna Banks", "Mark Benton", "Tim Healy", "Reece Shearsmith", "Bob Mortimer"], "character": ["Tess", "Mark", "Ian", "Tony", "Carl Palmer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 809   Expand Catterick   (2004) User Score Overview Catterick, aka Vic and Bob in Catterick, is a surreal 2004 BBC situation comedy in 6 episodes, written by and starring Vic Reeves and Bob Mortimer, with Reece Shearsmith, Matt Lucas, Morwenna Banks, Tim Healy, Mark Benton and Charlie Higson. The series was originally broadcast on BBC Three and later rerun on BBC2. Reeves has said that the BBC do not want another series of Catterick, though he may produce a spin-off centring on the DI Fowler character. Catterick is arguably Vic and Bob's darkest and most bizarre programme to date, balancing their typically odd, idiosyncratic comedy with some genuinely dark scenes. It plays like a darkly comic road movie, albeit full of Vic and Bob's bizarre, often inscrutable and frequently silly humour. Catterick is probably Vic and Bob's most uncompromising show since their notorious and frequently baffling 1999 sketch series Bang Bang, It's Reeves and Mortimer, from which most of the characters are taken. It is in some ways stylistically similar to their short film The Weekenders first broadcast in 1992 on British television as part of Channel 4's \"Bunch of Five\" series. The series is named after Catterick in North Yorkshire, Britain's largest army base. It is about 10 miles away from Darlington where Vic Reeves grew up. It is also about 20 miles away from Middlesbrough where Bob Mortimer grew up. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morwenna Banks Tess Mark Benton Mark Tim Healy Ian Reece Shearsmith Tony Bob Mortimer Carl Palmer Full Cast & Crew Last Season Season 1 2004 | 6 Episodes Season 1 of Catterick premiered on February 15, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Catterick. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords brother dark comedy surreal sitcom british humour Content Score 86 Almost there... Top Contributors f 14 fuzzthekingoftrees O 5 Ozbourne 1 kcdh 1 errormix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}