{"link": "https://www.themoviedb.org/tv/21788?language=en", "title": "Peacemaker Kurogane", "resume": "Peacemaker Kurogane is a historical fiction manga series written and illustrated created by Nanae Chrono. It is unrelated to the Peace Maker manga by Ryōji Minagawa. The story begins in 19th century Japan before the Meiji Restoration, a chain of events that led to enormous changes in Japan's political and social structure while the seeds of the revolution are being planted. The story follows the boy protagonist, Tetsunosuke Ichimura, who joins the Shinsengumi while seeking strength to avenge his parents' death at the hands of a Chōshū rebel.\nThe prequel of Peacemaker Kurogane is Shinsengumi Imon Peace Maker was published by Enix in the magazine Monthly Shōnen Gangan. Shinsengumi Imon Peacemaker is licensed in North America by Tokyopop.\nA live-action adaptation of the manga was aired on TBS entitled Shinsengumi Peace Maker. It premiered on January 15, 2010, until its conclusion on March 19, 2010.", "rate": 100, "genre": ["Animation", "Action", "Adventure"], "cast": ["Jouji Nakata", "Takaya Hashi", "Kappei Yamaguchi", "Masashi Ebara", "Yumiko Kobayashi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21788   Expand Peacemaker Kurogane   (2003) User Score Overview Peacemaker Kurogane is a historical fiction manga series written and illustrated created by Nanae Chrono. It is unrelated to the Peace Maker manga by Ryōji Minagawa. The story begins in 19th century Japan before the Meiji Restoration, a chain of events that led to enormous changes in Japan's political and social structure while the seeds of the revolution are being planted. The story follows the boy protagonist, Tetsunosuke Ichimura, who joins the Shinsengumi while seeking strength to avenge his parents' death at the hands of a Chōshū rebel. The prequel of Peacemaker Kurogane is Shinsengumi Imon Peace Maker was published by Enix in the magazine Monthly Shōnen Gangan. Shinsengumi Imon Peacemaker is licensed in North America by Tokyopop. A live-action adaptation of the manga was aired on TBS entitled Shinsengumi Peace Maker. It premiered on January 15, 2010, until its conclusion on March 19, 2010. Featured Crew Tomohiro Hirata Creator Toshiki Kameyama Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jouji Nakata Takaya Hashi Kappei Yamaguchi Masashi Ebara Yumiko Kobayashi Full Cast & Crew Last Season Season 1 2003 | 24 Episodes Season 1 of Peacemaker Kurogane premiered on October  6, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Peacemaker Kurogane. You can help by rating TV shows you've seen. Facts Original Name  PEACE MAKER鐵 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 13 Banana 9 Sergiojamon m 3 magoozin n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}