{"link": "https://www.themoviedb.org/tv/72899?language=en", "title": "My Daughter's Men", "resume": "Four celebrity dads watch their daughters’ dates with their boyfriends. What will the dads talk about, and how will they react as they watch their daughters’ relationships?", "rate": 0, "genre": [], "cast": ["Shin Hyun-joon", "Lee Soo-geun", "Kim Tae-won", "Kim Hee-chul", "Park So-jin"], "character": ["Shin Hyun-joon", "Lee Soo-geun", "Kim Tae-won"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72899   Expand My Daughter's Men   (2017) User Score Overview Four celebrity dads watch their daughters’ dates with their boyfriends. What will the dads talk about, and how will they react as they watch their daughters’ relationships? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin Hyun-joon Shin Hyun-joon Lee Soo-geun Lee Soo-geun Kim Tae-won Kim Tae-won Kim Hee-chul Park So-jin Full Cast & Crew Current Season Season 3 2018 | 1 Episode Season 3 of My Daughter's Men premiered on April 15, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on My Daughter's Men. You can help by rating TV shows you've seen. Facts Original Name  내 딸의 남자들 : 아빠가 보고 있다 Status  Returning Series Network E Channel Certification  - Type  Reality Original Language  Korean Runtime  60m Homepage   http://www.imtcast.com/cms/index.jsp?spgmdomain=mydaughter Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors M 22 Maria180493 14 koreacpv 6 barto 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}