{"link": "https://www.themoviedb.org/tv/71383?language=en", "title": "The Crossing", "resume": "Refugees from a war-torn country start showing up to seek asylum in an American town. Only the country these people are from is America and the war they are fleeing is 250 years in the future. The local sheriff with a past, a federal agent and a mother in search of her missing refugee daughter drive this allegory with a surprising conspiracy at the center.", "rate": 71, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Steve Zahn", "Natalie Martinez", "Sandrine Holt", "Georgina Haig", "Tommy Bastow"], "character": ["Jude Ellis", "Reece", "Emma Ren", "Dr. Sophie Forbin", "Marshall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71383   Expand The Crossing   (2018) User Score  Play Trailer Overview Refugees from a war-torn country start showing up to seek asylum in an American town. Only the country these people are from is America and the war they are fleeing is 250 years in the future. The local sheriff with a past, a federal agent and a mother in search of her missing refugee daughter drive this allegory with a surprising conspiracy at the center. Featured Crew Dan Dworkin Creator Jay Beattie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Zahn Jude Ellis Natalie Martinez Reece Sandrine Holt Emma Ren Georgina Haig Dr. Sophie Forbin Tommy Bastow Marshall Full Cast & Crew Current Season Season 1 2018 | 11 Episodes Season 1 of The Crossing premiered on April  2, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply c Pilot Episode Reactions (Spoilers!) Open 12 by  chrisjdel c Fourth Episode (Spoilers) Open 5 by  Jessica Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  3 Recommendations   2013-11-14 Ground Floor 6.1    2018-03-29 Siren 7.3    2017-10-13 Lore 6.1    2018-03-18 Instinct 5.9    2018-05-04 The Rain 6.1    2014-07-17 Married 6.3    2018-05-30 Reverie 7.0    2018-04-08 Killing Eve 8.7  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  44m Homepage   http://abc.go.com/shows/the-crossing Genres Sci-Fi & Fantasy Action & Adventure Keywords immigrant time travel Content Score 100 Yes! Looking good! Top Contributors 51 Elizabeth Jennings m 14 misfit_noel 9 Gabriel W. Almeida t 8 tmdb42368388  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}