{"link": "https://www.themoviedb.org/tv/10400?language=en", "title": "The Little Lulu Show", "resume": "The Little Lulu Show is an animated television series, based on the Marjorie Henderson Buell comic book character Little Lulu. The show was produced by CINAR Animation after Marge's death in 1993, and aired on HBO Family and Cartoon Network in the United States and on, CTV, and the Family Channel in Canada from 1995 to 1999. In Canada, reruns are currently being shown on both the English and French versions of Teletoon Retro. The series centered on the life and adventures of Lulu Moppet and Tubby Thompkins. Between stories, they showed stand-up comedy that Lulu hosted.\nThis show is not to be confused with Little Lulu and Her Little Friends, an anime TV series featuring the same characters made in 1976.", "rate": 70, "genre": ["Animation"], "cast": ["Vanessa Lengies", "Tracey Ullman", "Justin Bradley", "Ricky Mabe", "Michael Yarmush"], "character": ["Annie Inch", "Little Lulu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10400   Expand The Little Lulu Show   (1995) User Score Overview The Little Lulu Show is an animated television series, based on the Marjorie Henderson Buell comic book character Little Lulu. The show was produced by CINAR Animation after Marge's death in 1993, and aired on HBO Family and Cartoon Network in the United States and on, CTV, and the Family Channel in Canada from 1995 to 1999. In Canada, reruns are currently being shown on both the English and French versions of Teletoon Retro. The series centered on the life and adventures of Lulu Moppet and Tubby Thompkins. Between stories, they showed stand-up comedy that Lulu hosted. This show is not to be confused with Little Lulu and Her Little Friends, an anime TV series featuring the same characters made in 1976. Featured Crew Marjorie Henderson Buell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vanessa Lengies Annie Inch Tracey Ullman Little Lulu Justin Bradley Ricky Mabe Michael Yarmush Full Cast & Crew Last Season Season 3 1998 | 26 Episodes Season 3 of The Little Lulu Show premiered on November 30, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Little Lulu Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors T 6 TVPlayerLatino NS 6 Norte Serra 2 andruxtor b 1 bluwy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}