{"link": "https://www.themoviedb.org/tv/35310?language=en", "title": "The Magicians", "resume": "The Magicians was a British family entertainment television show, first broadcast throughout January 2011 on BBC One.\nThe show features magicians performing a number of magic tricks with guest celebrities, to decide which pair will face a forfeit trick at the end of the episode. In the first series, this was decided through audience participation, however, for the second series, a phone vote was introduced. The first series was hosted by Lenny Henry, and featured magicians Luis de Matos, Barry and Stuart and Chris Korn. At the end of series 1, Luis de Matos was deemed series champion.\nThe second series, which began airing in January 2012, is hosted by Darren McMullen, and replaces magicians de Matos and Korn with Jason Latimer and Pete Firman. While the first series was completely pre-recorded, the second series was broadcast live on Saturday nights, with the exception of the pre-recorded \"Street Magic\" and \"Location Grand Illusion\" segments. Thus, The Magicians became the first live magic programme to be broadcast on the BBC in over 30 years. At the end of series 2 Jason Latimer was deemed series champion by the UK viewers.\nIt was announced on 28 June 2012 that The Magicians had been axed.", "rate": 0, "genre": ["Comedy"], "cast": ["Barry Jones"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35310   Expand The Magicians   (2011) User Score Overview The Magicians was a British family entertainment television show, first broadcast throughout January 2011 on BBC One. The show features magicians performing a number of magic tricks with guest celebrities, to decide which pair will face a forfeit trick at the end of the episode. In the first series, this was decided through audience participation, however, for the second series, a phone vote was introduced. The first series was hosted by Lenny Henry, and featured magicians Luis de Matos, Barry and Stuart and Chris Korn. At the end of series 1, Luis de Matos was deemed series champion. The second series, which began airing in January 2012, is hosted by Darren McMullen, and replaces magicians de Matos and Korn with Jason Latimer and Pete Firman. While the first series was completely pre-recorded, the second series was broadcast live on Saturday nights, with the exception of the pre-recorded \"Street Magic\" and \"Location Grand Illusion\" segments. Thus, The Magicians became the first live magic programme to be broadcast on the BBC in over 30 years. At the end of series 2 Jason Latimer was deemed series champion by the UK viewers. It was announced on 28 June 2012 that The Magicians had been axed. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barry Jones Full Cast & Crew Last Season Season 2 2012 | 6 Episodes Season 2 of The Magicians premiered on January  7, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Magicians. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/bbcone/magicians/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 4 t0by M 1 MrHunter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}