{"link": "https://www.themoviedb.org/tv/33374?language=en", "title": "Say Yes to the Dress: Atlanta", "resume": "Set in the nation's largest full service bridal salon, viewers go behind the scenes at Bridal's by Lori to see what each bride goes through to find the perfect wedding dress. Particular, fashionable and strong willed, these Southern brides keep the staff on their toes to make sure they get exactly what they want for one of the most important days of their life.", "rate": 35, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33374   Expand Say Yes to the Dress: Atlanta   (2010) User Score Overview Set in the nation's largest full service bridal salon, viewers go behind the scenes at Bridal's by Lori to see what each bride goes through to find the perfect wedding dress. Particular, fashionable and strong willed, these Southern brides keep the staff on their toes to make sure they get exactly what they want for one of the most important days of their life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 10 2018 | 5 Episodes Season 10 of Say Yes to the Dress: Atlanta premiered on June  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Say Yes to the Dress: Atlanta. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  22m Homepage   http://www.tlc.discovery.com/tv/say-yes-to-the-dress-atlanta/ Genres Reality Keywords documentary Content Score 56 We're so close, yet so far. Top Contributors TB 8 TMDb Bot 5 Elizabeth Jennings d 4 diwasta a 3 apung21  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}