{"link": "https://www.themoviedb.org/tv/30668?language=en", "title": "Thieves", "resume": "Two high-class thieves caught red-handed strike a deal with the FBI to avoid imprisonment: put their skills at the service of an inter-agency task force whose mission is to recover missing and stolen government property.", "rate": 85, "genre": ["Drama"], "cast": ["John Stamos", "Melissa George", "Robert Knepper"], "character": ["Johnny", "Rita", "Special Agent Shue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30668   Expand Thieves   (2001) User Score Overview Two high-class thieves caught red-handed strike a deal with the FBI to avoid imprisonment: put their skills at the service of an inter-agency task force whose mission is to recover missing and stolen government property. Featured Crew Jim Leonard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Stamos Johnny Melissa George Rita Robert Knepper Special Agent Shue Full Cast & Crew Last Season Season 1 2001 | 10 Episodes Season 1 of Thieves premiered on September 28, 2001. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply rewatching it now Open 0 by lonegunman\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Thieves. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords thief criminal criminal consultant Content Score 50 Still needs a little work. Top Contributors 9 Banana D 2 Daniel R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}