{"link": "https://www.themoviedb.org/tv/34284?language=en", "title": "The Only Way Is Essex", "resume": "Part soap opera, part reality show, TOWIE follows the lives, loves and scandals of a group of real-life Essex guys and girls. Cameras capture the happenings at all kinds of glamorous locations as the cast meet up in nail bars, nightclubs and salons. Each episode features action filmed just a few days previously.", "rate": 48, "genre": ["Reality"], "cast": ["Denise Van Outen"], "character": ["Voiceover"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34284   Expand The Only Way Is Essex   (2010) User Score Overview Part soap opera, part reality show, TOWIE follows the lives, loves and scandals of a group of real-life Essex guys and girls. Cameras capture the happenings at all kinds of glamorous locations as the cast meet up in nail bars, nightclubs and salons. Each episode features action filmed just a few days previously. Featured Crew Ruth Wrigley Creator Tony Wood Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Denise Van Outen Voiceover Full Cast & Crew Current Season Season 22 2018 | 10 Episodes Season 22 of The Only Way Is Essex premiered on March 25, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Only Way Is Essex. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Only Way Is Essex. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Reality Original Language  English Runtime  60m Homepage   http://www.itv.com/essex Genres Reality Keywords england Content Score 64 We're so close, yet so far. Top Contributors 40 Elizabeth Jennings L 25 Leah b 13 basher b 9 babibu123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}