{"link": "https://www.themoviedb.org/tv/13955?language=en", "title": "Blue Murder", "resume": "Blue Murder is a British crime drama television series based in Manchester. Shown on ITV from 2003 until 2009 when it was cancelled by the network, it starred Caroline Quentin as DCI Janine Lewis.", "rate": 55, "genre": ["Drama"], "cast": ["Caroline Quentin", "Ian Kelsey", "Paul Loughran", "Saskia Wickham", "Holliday Grainger"], "character": ["DCI Janine Lewis", "DI Richard Mayne", "DS Butchers", "Jess Burgess"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13955   Expand Blue Murder   (2003) User Score Overview Blue Murder is a British crime drama television series based in Manchester. Shown on ITV from 2003 until 2009 when it was cancelled by the network, it starred Caroline Quentin as DCI Janine Lewis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Caroline Quentin DCI Janine Lewis Ian Kelsey DI Richard Mayne Paul Loughran DS Butchers Saskia Wickham Holliday Grainger Jess Burgess Full Cast & Crew Last Season (uk) season 5 2009 | 6 Episodes Season 5 of Blue Murder premiered on September  7, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Blue Murder. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 90m Homepage   http://www.itv.com/Drama/copsandcrime/bluemurder/default.htm Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors j 3 jnylen TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}