{"link": "https://www.themoviedb.org/tv/13533?language=en", "title": "Harry's Game", "resume": "Harry's Game is a British television miniseries made by Yorkshire Television for ITV in 1982. It is based on the novel of the same name by Gerald Seymour, which was published in 1975.\nThe three-part serial starred Ray Lonnen as Capt. Harry Brown, a British soldier, sent undercover to Northern Ireland to find information to arrest Billy Downes, a Provisional Irish Republican Army gunman. The series' theme tune was performed by Clannad and was successfully released as a single, reaching the top five in both Ireland and the United Kingdom and bringing Clannad its first major international exposure.", "rate": 56, "genre": ["Drama"], "cast": ["Ray Lonnen", "Derek Thompson", "Benjamin Whitrow", "Nicholas Day", "Gil Brailey"], "character": ["Harry Brown", "Billy Downes", "Davidson", "Bannen", "Josephine Laverty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13533   Expand Harry's Game   (1982) User Score Overview Harry's Game is a British television miniseries made by Yorkshire Television for ITV in 1982. It is based on the novel of the same name by Gerald Seymour, which was published in 1975. The three-part serial starred Ray Lonnen as Capt. Harry Brown, a British soldier, sent undercover to Northern Ireland to find information to arrest Billy Downes, a Provisional Irish Republican Army gunman. The series' theme tune was performed by Clannad and was successfully released as a single, reaching the top five in both Ireland and the United Kingdom and bringing Clannad its first major international exposure. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ray Lonnen Harry Brown Derek Thompson Billy Downes Benjamin Whitrow Davidson Nicholas Day Bannen Gil Brailey Josephine Laverty Full Cast & Crew Last Season Miniseries 1982 | 3 Episodes Season 1 of Harry's Game premiered on October 25, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Harry's Game. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  180m Homepage  - Genres Drama Keywords based on novel or book miniseries irish republican army Content Score 86 Almost there... Top Contributors TB 44 TMDb Bot R 10 Rebecca 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}