{"link": "https://www.themoviedb.org/tv/2903?language=en", "title": "Le cœur a ses raisons", "resume": "Le cœur a ses raisons is a French language Québécois téléroman which heavily parodies American soap operas, often involving great exaggeration to ridiculous proportions. Its English title would literally be The Heart Has Its Reasons, but the distributor has chosen to translate it by Sins of Love. The title comes from Blaise Pascal, a 17th-century French author, who said, « Le cœur a ses raisons que la raison ne connaît point ». It was written by author Marc Brunet and first appeared on television screens in February 2005 on the TVA television network.\nThe program was first shown in September 2001 as short segments during the show Le Grand Blond avec un show sournois, and became very popular, thus making way for a full television series. There were 17 short episodes preceding the first series.\nThe program airs internationally on TV5MONDE. A Polish version of the show, entitled Grzeszni i bogaci, premiered on October 25, 2009 on TVN television network.", "rate": 90, "genre": ["Soap", "Drama", "Comedy"], "cast": ["Anne Dorval", "Marc Labrèche"], "character": ["Criquette Rockwell / Ashley Rockwell", "Brett / Brad / Brenda / Clifford Montgomery"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2903   Expand Le cœur a ses raisons   (2005) User Score Overview Le cœur a ses raisons is a French language Québécois téléroman which heavily parodies American soap operas, often involving great exaggeration to ridiculous proportions. Its English title would literally be The Heart Has Its Reasons, but the distributor has chosen to translate it by Sins of Love. The title comes from Blaise Pascal, a 17th-century French author, who said, « Le cœur a ses raisons que la raison ne connaît point ». It was written by author Marc Brunet and first appeared on television screens in February 2005 on the TVA television network. The program was first shown in September 2001 as short segments during the show Le Grand Blond avec un show sournois, and became very popular, thus making way for a full television series. There were 17 short episodes preceding the first series. The program airs internationally on TV5MONDE. A Polish version of the show, entitled Grzeszni i bogaci, premiered on October 25, 2009 on TVN television network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne Dorval Criquette Rockwell / Ashley Rockwell Marc Labrèche Brett / Brad / Brenda / Clifford Montgomery Full Cast & Crew Last Season Season 3 2007 | 13 Episodes Season 3 of Le cœur a ses raisons premiered on September 10, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Le cœur a ses raisons. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  22m Homepage   http://www.tva.canoe.com/emissions/lecoeurasesraisons/ Genres Soap Drama Comedy Keywords quebec parody family Content Score 56 We're so close, yet so far. Top Contributors 20 Banana t 8 tmdb84253387 3 roimidas p 2 pvarry  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}