{"link": "https://www.themoviedb.org/tv/926?language=en", "title": "Scooby-Doo, Where Are You!", "resume": "Scooby Doo, Where Are You! is the first incarnation of the long-running Hanna-Barbera Saturday morning cartoon series, Scooby-Doo. Created by Joe Ruby and Ken Spears, it premiered on September 13, 1969 at 10:30 a.m. EST and ran for two seasons for a total of 25 episodes. Its final first-run episode aired in January 1971.\nNine episodes from Scooby-Doo's 1976-78 seasons, first run on ABC, were originally broadcast with the 1969 Scooby Doo, Where Are You! opening and closing sequences. The entire 1976-78 series is sometimes marketed as third-fourth seasons of the original \"Where Are You!\" series.", "rate": 74, "genre": ["Animation", "Mystery", "Comedy"], "cast": ["Nicole Jaffe", "Alan Oppenheimer", "Heather North", "Jack Angel", "Lennie Weinrib"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 926   Expand Scooby-Doo, Where Are You!   (1969) User Score  Play Trailer Overview Scooby Doo, Where Are You! is the first incarnation of the long-running Hanna-Barbera Saturday morning cartoon series, Scooby-Doo. Created by Joe Ruby and Ken Spears, it premiered on September 13, 1969 at 10:30 a.m. EST and ran for two seasons for a total of 25 episodes. Its final first-run episode aired in January 1971. Nine episodes from Scooby-Doo's 1976-78 seasons, first run on ABC, were originally broadcast with the 1969 Scooby Doo, Where Are You! opening and closing sequences. The entire 1976-78 series is sometimes marketed as third-fourth seasons of the original \"Where Are You!\" series. Featured Crew Iwao Takamoto Creator Joe Ruby Creator Ken Spears Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicole Jaffe Alan Oppenheimer Heather North Jack Angel Lennie Weinrib Full Cast & Crew Last Season Season 3 1978 | 16 Episodes Season 3 of Scooby-Doo, Where Are You! premiered on September  9, 1978. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply M Like Zoinks, haha! Open 3 by  Moonglum9 Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  7 Recommendations   1960-09-30 The Flintstones 7.0    1962-09-23 The Jetsons 6.6    1995-09-09 Pinky and the Brain 7.7    1999-01-04 Ed, Edd n Eddy 7.0    1997-07-07 Johnny Bravo 6.6    2002-09-14 What's New, Scooby-Doo? 7.0    1993-09-13 Animaniacs 7.6    1964-12-18 The Pink Panther Show 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www2.warnerbros.com/scoobydoo/brand_site.html Genres Animation Mystery Comedy Keywords crime solving Content Score 100 Yes! Looking good! Top Contributors AK 12 Avshalom Kor 8 d00ziie 7 Banana E 6 EightNine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}