{"link": "https://www.themoviedb.org/tv/34688?language=en", "title": "Puni Puni Poemy", "resume": "Puni Puni Poemy is a two-part original video animation spin-off from the Excel Saga manga and TV animation. It features some of that series' secondary characters and many of its staff, primarily director Shinichi Watanabe. Like Excel Saga, it is a parody of other anime, manga and various aspects of popular culture, though in this case with the magical girl genre providing its primary focus and general structure. The series was originally an in-joke from an episode of Excel Saga; Watanabe decided to take the in-joke to its most extreme logical conclusion, creating the series.\nPuni was banned in New Zealand in December 2004, on the grounds that it \"tends to promote and support the exploitation of children and young persons for sexual purposes, and to a lesser extent, the use of sexual coercion to compel persons to submit to sexual conduct.\" A New Zealand anime fan, Simon Brady, applied to have the decision reviewed using the basis that the show was only rated MA15+ in neighbouring country Australia and that it does not exploit its children characters within the work, but in June 2005, the review authority reached a similar conclusion about the show's legal status.", "rate": 73, "genre": ["Action", "Adventure", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34688   Expand Puni Puni Poemy   (2001) User Score Overview Puni Puni Poemy is a two-part original video animation spin-off from the Excel Saga manga and TV animation. It features some of that series' secondary characters and many of its staff, primarily director Shinichi Watanabe. Like Excel Saga, it is a parody of other anime, manga and various aspects of popular culture, though in this case with the magical girl genre providing its primary focus and general structure. The series was originally an in-joke from an episode of Excel Saga; Watanabe decided to take the in-joke to its most extreme logical conclusion, creating the series. Puni was banned in New Zealand in December 2004, on the grounds that it \"tends to promote and support the exploitation of children and young persons for sexual purposes, and to a lesser extent, the use of sexual coercion to compel persons to submit to sexual conduct.\" A New Zealand anime fan, Simon Brady, applied to have the decision reviewed using the basis that the show was only rated MA15+ in neighbouring country Australia and that it does not exploit its children characters within the work, but in June 2005, the review authority reached a similar conclusion about the show's legal status. Featured Crew Shinichi Watanabe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2001 | 2 Episodes Season 1 of Puni Puni Poemy premiered on March  7, 2001. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Puni Puni Poemy. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Puni Puni Poemy. You can help by rating TV shows you've seen. Facts Original Name  ぷにぷに☆ぽえみぃ Status  Ended Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Animation Keywords parody magical girl anime Content Score 64 We're so close, yet so far. Top Contributors 12 kuzronk TB 8 TMDb Bot 5 Ailurus Fulgens R 5 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}