{"link": "https://www.themoviedb.org/tv/43082?language=en", "title": "Key & Peele", "resume": "Key & Peele is an American sketch comedy television show. It stars Keegan-Michael Key and Jordan Peele, both former cast members of MADtv. Each episode of the show consists of several pre-taped sketches starring the two actors, introduced by Key and Peele in front of a live studio audience.", "rate": 76, "genre": ["Comedy"], "cast": ["Keegan-Michael Key", "Jordan Peele"], "character": ["Various Characters", "Various Characters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43082   Expand Key & Peele   (2012) User Score Overview Key & Peele is an American sketch comedy television show. It stars Keegan-Michael Key and Jordan Peele, both former cast members of MADtv. Each episode of the show consists of several pre-taped sketches starring the two actors, introduced by Key and Peele in front of a live studio audience. Featured Crew Keegan-Michael Key Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keegan-Michael Key Various Characters Jordan Peele Various Characters Full Cast & Crew Last Season Season 5 2015 | 11 Episodes Season 5 of Key & Peele premiered on July  8, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply St What's your favorite sketch of theirs? Open 0 by Satch the Man\n      \n     So much talent Open 1 by  Bloodshot77 Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   2013-07-09 Drunk History 7.2    2007-03-20 The Whitest Kids U' Know 7.9    2013-01-16 Kroll Show 7.1    2007-08-06 Drunk History 6.6    2011-04-06 Workaholics 6.9    2007-04-05 Human Giant 7.8    1986-09-13 At the Movies 5.9    1999-10-04 Angela Anaconda 3.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  20m Homepage   http://www.cc.com/shows/key-and-peele Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 31 Elizabeth Jennings 10 BudsieBuds TB 9 TMDb Bot ea 5 elizabeth aden  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}