{"link": "https://www.themoviedb.org/tv/1968?language=en", "title": "Canada's Next Top Model", "resume": "Canada's Next Top Model is a Canadian reality show in which female contestants compete for the title \"Canada's Next Top Model\" and a chance to start their career in the modeling industry. The winner receives a modeling contract from Elmer Olsen Modeling Agency, a $100,000 beauty contract from Procter & Gamble, and an editorial spread in Fashion magazine.\nCNTM is based on the successful American franchise America's Next Top Model. It is produced by Temple Street Productions in association with CTVglobemedia and CBS Paramount International TV. Three cycles have been produced and aired.", "rate": 0, "genre": ["Reality"], "cast": ["Tricia Helfer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1968   Expand Canada's Next Top Model   (2006) User Score Overview Canada's Next Top Model is a Canadian reality show in which female contestants compete for the title \"Canada's Next Top Model\" and a chance to start their career in the modeling industry. The winner receives a modeling contract from Elmer Olsen Modeling Agency, a $100,000 beauty contract from Procter & Gamble, and an editorial spread in Fashion magazine. CNTM is based on the successful American franchise America's Next Top Model. It is produced by Temple Street Productions in association with CTVglobemedia and CBS Paramount International TV. Three cycles have been produced and aired. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tricia Helfer Full Cast & Crew Last Season Season 3 2009 | 8 Episodes Season 3 of Canada's Next Top Model premiered on May 26, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Canada's Next Top Model. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://model.ctv.ca/ Genres Reality Keywords competition modeling Content Score 56 We're so close, yet so far. Top Contributors 9 Ly 1 lineker S 1 Streed  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}