{"link": "https://www.themoviedb.org/tv/77426?language=en", "title": "Death Row Chronicles", "resume": "Death Row Chronicles is the story of the world's most dangerous record label could only be told in a definitive 6-part documentary series. While Death Row Records boasted the success of Snoop Dogg, 2Pac, and Dr. Dre forged by unmatched creativity, the chart-topping and record-breaking sales came at a bloody, controversial cost. Part true-crime murder mystery and part hip hop drama, this compelling docu-series will comb through mountains of misinformation, uncovering key evidence and witnesses who will reveal the truth about the bitter rivalries surrounding its legends. The limited series will also celebrate the groundbreaking music of Death Row, explain how it reflected society at the time, and how it influenced some of today's biggest hip hop artists. On the eve of the label's 25th anniversary, Death Row Chronicles offers an unflinching look at the label and its legacy.", "rate": 85, "genre": ["Documentary", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77426   Expand Death Row Chronicles   (2018) User Score  Play Trailer Overview Death Row Chronicles is the story of the world's most dangerous record label could only be told in a definitive 6-part documentary series. While Death Row Records boasted the success of Snoop Dogg, 2Pac, and Dr. Dre forged by unmatched creativity, the chart-topping and record-breaking sales came at a bloody, controversial cost. Part true-crime murder mystery and part hip hop drama, this compelling docu-series will comb through mountains of misinformation, uncovering key evidence and witnesses who will reveal the truth about the bitter rivalries surrounding its legends. The limited series will also celebrate the groundbreaking music of Death Row, explain how it reflected society at the time, and how it influenced some of today's biggest hip hop artists. On the eve of the label's 25th anniversary, Death Row Chronicles offers an unflinching look at the label and its legacy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Death Row Chronicles premiered on February 20, 2018. View All Seasons Social Reviews  1 Discussions  0 D A review by Dan_Tebasco  7.0 Written by  Dan_Tebasco  on March  5, 2018 Competently put together 6 part documentary about the 'world's most dangerous record label' with it's founder (Suge Knight) being a member of the Mob Piru Bloods gang and hiring mostly people from the same gang leading to rather unconventional business-tactics ocassionally never shying away from violence. While still having the proffesionalism to being able to belt out some of the best artists in 90's rap including Tupac, Snoop, Dogg Pound and Dre as a solo-artist. The first part is about Suge Knight, the second mostly about Dre. The third mostly about Snoop. The fourth, fifth and sixth b...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Death Row Chronicles. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Miniseries Original Language  English Runtime  41m Homepage   https://www.bet.com/shows/death-row-chronicles.html Genres Documentary Drama Keywords music crime Content Score 64 We're so close, yet so far. Top Contributors b 16 basher 2 tigru89 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}