{"link": "https://www.themoviedb.org/tv/7859?language=en", "title": "The Face of Analia", "resume": "El Rostro de Analía is a Spanish-language telenovela produced by the American-based television network Telemundo. It stars Elizabeth Gutiérrez, Martin Karpan, Maritza Rodríguez and Gabriel Porras, with the special appearance of Gaby Espino.", "rate": 38, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Elizabeth Gutiérrez", "Martín Karpan", "Maritza Rodríguez", "Gabriel Porras", "Karla Monroig"], "character": ["Ana Lucía \"Analía\" Moncada / Mariana Andrade de Montiel", "Daniel Montiel", "Sara Andrade", "Ricardo \"Ricky\" Montana", "Isabel Martinez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7859   Expand The Face of Analia   (2008) User Score  Play Trailer Overview El Rostro de Analía is a Spanish-language telenovela produced by the American-based television network Telemundo. It stars Elizabeth Gutiérrez, Martin Karpan, Maritza Rodríguez and Gabriel Porras, with the special appearance of Gaby Espino. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elizabeth Gutiérrez Ana Lucía \"Analía\" Moncada / Mariana Andrade de Montiel Martín Karpan Daniel Montiel Maritza Rodríguez Sara Andrade Gabriel Porras Ricardo \"Ricky\" Montana Karla Monroig Isabel Martinez Full Cast & Crew Last Season Season 1 2008 | 1 Episode Season 1 of The Face of Analia premiered on October 20, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   1975-10-20 PBS NewsHour 5.6    2016-07-19 Sin senos sí hay paraíso 6.1    1996-02-07 Dragon Ball GT 5.7    2012-10-10 Arrow 6.0    2010-10-31 The Walking Dead 7.3    2017-10-13 Mindhunter 7.4    1989-12-17 The Simpsons 7.1    2011-01-09 Shameless 7.8  Facts Original Name  El Rostro de Analía Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  42m Homepage   http://www.elrostrodeanalia.com/ Genres Action & Adventure Crime Drama Keywords telenovela Content Score 93 Almost there... Top Contributors V 27 Vaine VM 12 Vaishnav MK CM 9 Cherche Moi 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}