{"link": "https://www.themoviedb.org/tv/46033?language=en", "title": "Samurai Harem", "resume": "Having been raised and trained for the past seventeen years as a traditional samurai 'bushi', Yoichi was surprised when his father suddenly announces that there nothing more that he could teach his son, but he arranges for Yoichi to continue training at a dojo owned by one of his fathers friends. So now, Yoichi must leave the tranquility of his remote rural mountain life and move to city to live with his fathers friend's family to continue his studies. And if learning how to cope with city life were not hard enough, he finds himself living with 4 beautiful sisters, and having to endure a ‘training’ regiment more severe than he could ever imagine...", "rate": 77, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Haruka Tomatsu", "Nobuhiko Okamoto", "Rina Satou", "Yukari Tamura", "Kana Hanazawa"], "character": ["Ayame Ikaruga", "Yoichi Karasuma", "Ibuki Ikaruga", "Chihaya Ikaruga", "Kagome Ikaruga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46033   Expand Samurai Harem   (2009) User Score Overview Having been raised and trained for the past seventeen years as a traditional samurai 'bushi', Yoichi was surprised when his father suddenly announces that there nothing more that he could teach his son, but he arranges for Yoichi to continue training at a dojo owned by one of his fathers friends. So now, Yoichi must leave the tranquility of his remote rural mountain life and move to city to live with his fathers friend's family to continue his studies. And if learning how to cope with city life were not hard enough, he finds himself living with 4 beautiful sisters, and having to endure a ‘training’ regiment more severe than he could ever imagine... Featured Crew Akita Shoten Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  19 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruka Tomatsu Ayame Ikaruga Nobuhiko Okamoto Yoichi Karasuma Rina Satou Ibuki Ikaruga Yukari Tamura Chihaya Ikaruga Kana Hanazawa Kagome Ikaruga Full Cast & Crew Last Season Season 1 2009 | 12 Episodes Season 1 of Samurai Harem premiered on January  8, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Samurai Harem. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  19 Recommendations   2012-10-04 BTOOOM! 6.3    2011-04-15 Anohana: The Flower We Saw That Day 7.6    2011-10-07 Haganai: I Don't Have Many Friends 7.7  Facts Original Name  明日のよいち! Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tbs.co.jp/anime/yoichi/ Genres Animation Comedy Drama Keywords romance anime Content Score 100 Yes! Looking good! Top Contributors 13 Levi Seguel p 8 psy4trik 8 Banana U 7 Uilio  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}