{"link": "https://www.themoviedb.org/tv/31577?language=en", "title": "Shinsengumi!", "resume": "Shinsengumi! is a Taiga drama television series produced by Japanese broadcaster NHK. It was a popular drama about the Shinsengumi, a Japanese special police force from the Bakumatsu period.\nActors include Koji Yamamoto, Tatsuya Fujiwara, Joe Odagiri, and Shingo Katori of the pop idol group SMAP. It was written by Japanese director and playwright, Kōki Mitani.", "rate": 80, "genre": ["Action", "Adventure", "Drama", "War", "Politics"], "cast": ["Shingo Katori", "Yuka", "Kankuro Nakamura", "Tatsuya Fujiwara", "Masato Sakai"], "character": ["Kondō Isami", "Miyukidayuu", "Todō Heisuke", "Okita Sōji", "Yamanami Keisuke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31577   Expand Shinsengumi!   (2004) User Score Overview Shinsengumi! is a Taiga drama television series produced by Japanese broadcaster NHK. It was a popular drama about the Shinsengumi, a Japanese special police force from the Bakumatsu period. Actors include Koji Yamamoto, Tatsuya Fujiwara, Joe Odagiri, and Shingo Katori of the pop idol group SMAP. It was written by Japanese director and playwright, Kōki Mitani. Featured Crew NHK Enterprises, Inc. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shingo Katori Kondō Isami Yuka Miyukidayuu Kankuro Nakamura Todō Heisuke Tatsuya Fujiwara Okita Sōji Masato Sakai Yamanami Keisuke Full Cast & Crew Last Season Season 1 2004 | 49 Episodes Season 1 of Shinsengumi! premiered on January 11, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Shinsengumi!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Action & Adventure Drama War & Politics Keywords taiga drama Content Score 93 Almost there... Top Contributors 26 Bishamonten 11 thirstyhippo A 4 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}