{"link": "https://www.themoviedb.org/tv/71854?language=en", "title": "Hero Seorang Cinderella", "resume": "Hero Seorang Cinderella tells a story of a woman by the name of Nura Medina. Living with her cunning and malicious stepmother, Puan Sri Mawar, and her stepsister, Puteri, a vile and hateful yet gullible person, Medina has to endure endless verbal abuse and unjust treatment. Things took a turn in her life when she meets Tengku Ian, a charming, cheeky, and helpful young man, whose background and life is a mystery to her. Despite being someone who is careful with her emotions, Medina finds herself attracted to Tengku Ian without her fully realizing it.", "rate": 80, "genre": ["Drama"], "cast": ["Nur Fazura", "Fattah Amin", "Uqasha Senrose", "Fikri Ibrahim", "Jasmine Suraya"], "character": ["Nura Medina", "Tengku Ian Uzzam", "Puteri Emallyn", "Farizzam", "Zuyyin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71854   Expand Hero Seorang Cinderella   (2017) User Score Overview Hero Seorang Cinderella tells a story of a woman by the name of Nura Medina. Living with her cunning and malicious stepmother, Puan Sri Mawar, and her stepsister, Puteri, a vile and hateful yet gullible person, Medina has to endure endless verbal abuse and unjust treatment. Things took a turn in her life when she meets Tengku Ian, a charming, cheeky, and helpful young man, whose background and life is a mystery to her. Despite being someone who is careful with her emotions, Medina finds herself attracted to Tengku Ian without her fully realizing it. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  3 Clips  6 Featurettes  0 Opening Credits  0 Top Billed Cast Nur Fazura Nura Medina Fattah Amin Tengku Ian Uzzam Uqasha Senrose Puteri Emallyn Fikri Ibrahim Farizzam Jasmine Suraya Zuyyin Full Cast & Crew Last Season Season 1 2017 | 24 Episodes Season 1 of Hero Seorang Cinderella premiered on May 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  9 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hero Seorang Cinderella. You can help by rating TV shows you've seen. Facts Status  Ended Network Astro Ria Certification  - Type  Scripted Original Language  Malay Runtime  45m Homepage   http://www.astrogempak.com.my/kosong-kosong/video?mediaid=1572720&title=hero-seorang-cinderella Genres Drama Keywords based on novel or book platonic love family relationships family reunion modern fairy tale tv adaptation malaysian novel Content Score 79 Pump it up! We're close now. Top Contributors 89 love.warrior 40 CyberTech TB 9 TMDb Bot 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}