{"link": "https://www.themoviedb.org/tv/73377?language=en", "title": "Crash Course Study Skills", "resume": "Welcome to Crash Course Study Skills! Over the next 10 weeks, Thomas Frank is going to help you learn to be a better student. We'll go over study tips, note taking, getting organized, and so much more!", "rate": 80, "genre": [], "cast": ["Thomas Frank"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73377   Expand Crash Course Study Skills   (2017) User Score  Play Trailer Overview Welcome to Crash Course Study Skills! Over the next 10 weeks, Thomas Frank is going to help you learn to be a better student. We'll go over study tips, note taking, getting organized, and so much more! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thomas Frank Himself - Host Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Crash Course Study Skills premiered on August  8, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Crash Course Study Skills. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crash Course Study Skills. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   https://www.youtube.com/playlist?list=PL8dPuuaLjXtNcAJRf3bE1IJU6nMfHj86W Genres No genres have been added. Keywords studies skills Content Score 56 We're so close, yet so far. Top Contributors 40 Gabriel W. Almeida 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}