{"link": "https://www.themoviedb.org/tv/52720?language=en", "title": "Mackerel Run", "resume": "Cha Gong-chan was able to enter the top private high school in the affluent Gangnam District, Myoung-mun High, because of his soccer skills. But when he quits the sport, he finds himself an outcast and starts cutting class. One day, a beautiful new girl transfers to the school, and when she walks into his class, Gong-chan falls for her instantly. He is finally enthusiastic about going to school, but the school administrator informs him that he will be expelled if he misses one more day. Gong-chan vows that he won't give up on either his school life or his love.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": ["Lee Min-ho", "Moon Chae-won", "Kwon Yul", "Lee Byung-joon", "Park Bo-young"], "character": ["Cha Gong-chan", "Min Yoon-seo", "Baek Heon", "Ma Do-shik", "Shim Chung-ah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52720   Expand Mackerel Run   (2007) User Score Overview Cha Gong-chan was able to enter the top private high school in the affluent Gangnam District, Myoung-mun High, because of his soccer skills. But when he quits the sport, he finds himself an outcast and starts cutting class. One day, a beautiful new girl transfers to the school, and when she walks into his class, Gong-chan falls for her instantly. He is finally enthusiastic about going to school, but the school administrator informs him that he will be expelled if he misses one more day. Gong-chan vows that he won't give up on either his school life or his love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Min-ho Cha Gong-chan Moon Chae-won Min Yoon-seo Kwon Yul Baek Heon Lee Byung-joon Ma Do-shik Park Bo-young Shim Chung-ah Full Cast & Crew Last Season Season 1 2007 | 8 Episodes Season 1 of Mackerel Run premiered on May 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mackerel Run. You can help by rating TV shows you've seen. Facts Original Name  달려라 고등어 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  50m Homepage   http://tv.sbs.co.kr/dalgo/ Genres Drama Comedy Keywords korea Content Score 86 Almost there... Top Contributors t 40 tmdb38202327 4 andermairena N 3 Nosirus s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}