{"link": "https://www.themoviedb.org/tv/31585?language=en", "title": "Rookie Blue", "resume": "Ambitious young cops try to prove themselves in their high-stakes careers, in which the smallest mistake can have deadly consequences. At the core of the close-knit group is perfectionist Andy McNally, whose father was a homicide detective before he burned out on the job. The series follows Andy and her four colleagues -- Dov Epstein, Gail Peck, Traci Nash and Chris Diaz -- as they experience the trials, triumphs and tribulations of police work, as well as its effect on their personal lives.", "rate": 71, "genre": ["Drama"], "cast": ["Gregory Smith", "Missy Peregrym", "Enuka Okuma", "Charlotte Sullivan", "Travis Milne"], "character": ["Dov Epstein", "Andy McNally", "Traci Nash", "Gail Peck", "Chris Diaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31585   Expand Rookie Blue   (2010) User Score Overview Ambitious young cops try to prove themselves in their high-stakes careers, in which the smallest mistake can have deadly consequences. At the core of the close-knit group is perfectionist Andy McNally, whose father was a homicide detective before he burned out on the job. The series follows Andy and her four colleagues -- Dov Epstein, Gail Peck, Traci Nash and Chris Diaz -- as they experience the trials, triumphs and tribulations of police work, as well as its effect on their personal lives. Featured Crew Morwyn Brebner Creator Tassie Cameron Creator Ellen Vanstone Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  11 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gregory Smith Dov Epstein Missy Peregrym Andy McNally Enuka Okuma Traci Nash Charlotte Sullivan Gail Peck Travis Milne Chris Diaz Full Cast & Crew Last Season Season 6 2015 | 11 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Rookie Blue. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  11 Posters  7 Recommendations   2008-07-11 Flashpoint 6.6    2011-03-14 Endgame 6.3    2011-06-29 Necessary Roughness 6.6    2010-05-19 The Good Guys 7.9    2013-06-06 Graceland 7.0    2011-09-20 Unforgettable 6.1    2015-01-22 Backstrom 6.4    2010-07-12 Rizzoli & Isles 7.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   http://www.globaltv.com/rookieblue/index.html Genres Drama Keywords canada police toronto cop rookie cop police precinct cop drama Content Score 93 Almost there... Top Contributors 53 Banana 29 Elizabeth Jennings 9 seawolf TB 9 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}