{"link": "https://www.themoviedb.org/tv/5146?language=en", "title": "The First 48", "resume": "The First 48 follows detectives from around the country during these first critical hours as they race against time to find the suspect. Gritty and fast-paced, it takes viewers behind the scenes of real-life investigations with unprecedented access to crime scenes, autopsies, forensic processing, and interrogations.", "rate": 76, "genre": ["Documentary", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5146   Expand The First 48   (2004) User Score  Play Trailer Overview The First 48 follows detectives from around the country during these first critical hours as they race against time to find the suspect. Gritty and fast-paced, it takes viewers behind the scenes of real-life investigations with unprecedented access to crime scenes, autopsies, forensic processing, and interrogations. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 17 2017 | 16 Episodes Season 17 of The First 48 premiered on October 19, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The First 48. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   2005-06-04 Lockup 7.8    2014-03-11 Chrisley Knows Best 6.6    2006-03-21 The Real Housewives of Orange County 5.1    2005-03-06 Intervention 6.1    1986-03-03 Matlock 6.9    2013-05-19 Life Below Zero 7.3    2016-11-29 Leah Remini: Scientology and the Aftermath 8.2  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.aetv.com/shows/the-first-48 Genres Documentary Drama Keywords documentary Content Score 64 We're so close, yet so far. Top Contributors TB 18 TMDb Bot b 12 basher 8 Elizabeth Jennings t 8 thors  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}