{"link": "https://www.themoviedb.org/tv/38973?language=en", "title": "Dragon Age: Redemption", "resume": "Dragon Age: Redemption is a six-part webseries based on the BioWare video game series of the same name. It is created by and stars Felicia Day, creator and star of the webseries The Guild. Day is playing Tallis, an Elven assassin. Filming began in early January 2011 and Day has enlisted the help of many prior Hollywood acquaintances.\nThe web series premiered on October 10, 2011.", "rate": 58, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Felicia Day", "Adam Rayner", "Doug Jones", "Marcia Battise"], "character": ["Tallis", "Saarebas", "Nyree"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38973   Expand Dragon Age: Redemption   (2011) User Score Overview Dragon Age: Redemption is a six-part webseries based on the BioWare video game series of the same name. It is created by and stars Felicia Day, creator and star of the webseries The Guild. Day is playing Tallis, an Elven assassin. Filming began in early January 2011 and Day has enlisted the help of many prior Hollywood acquaintances. The web series premiered on October 10, 2011. Featured Crew Felicia Day Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Felicia Day Tallis Adam Rayner Doug Jones Saarebas Marcia Battise Nyree Full Cast & Crew Last Season Season 1 2011 | 6 Episodes Season 1 of Dragon Age: Redemption premiered on October 10, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dragon Age: Redemption. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  15m Homepage   https://www.youtube.com/show/dragonageredemption Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 5 Rebecca w 3 webmaster z 3 zurman1 2 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}