{"link": "https://www.themoviedb.org/tv/75427?language=en", "title": "VIP Gymnasium", "resume": "Trying to get Guo Xiao Mei - an heiress, fujoshi and magazine editor to join his gym, Gu Zhi pretends to be gay in order to fulfill her wishes. With her sharp fujoshi eyes, Xiao Mei immediately pairs him up with the gym's really hot boss, Qin Nan. Wanting to have a front row seat to their real-life 'romance', Xiao Mei agrees to sign up for a 5-year VIP Diamond membership. Ofcourse, to actually keep her from withdrawing her gym membership and/or buying up the whole gym, she's going to need proof of their relationship, isn't she?", "rate": 100, "genre": ["Comedy"], "cast": ["Yu Wen Tao"], "character": ["Gu Zhi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75427   Expand VIP Gymnasium   (2016) User Score Overview Trying to get Guo Xiao Mei - an heiress, fujoshi and magazine editor to join his gym, Gu Zhi pretends to be gay in order to fulfill her wishes. With her sharp fujoshi eyes, Xiao Mei immediately pairs him up with the gym's really hot boss, Qin Nan. Wanting to have a front row seat to their real-life 'romance', Xiao Mei agrees to sign up for a 5-year VIP Diamond membership. Ofcourse, to actually keep her from withdrawing her gym membership and/or buying up the whole gym, she's going to need proof of their relationship, isn't she? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yu Wen Tao Gu Zhi Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of VIP Gymnasium premiered on October  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on VIP Gymnasium. You can help by rating TV shows you've seen. Facts Original Name  健身房 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Comedy Keywords academia Content Score 56 We're so close, yet so far. Top Contributors 27 robertyman 11 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}