{"link": "https://www.themoviedb.org/tv/50640?language=en", "title": "An Evil Game, A Love Game", "resume": "Game Rai Game Rak is a Thai television drama. Saichon is an islander living on Min island. One day, destiny leads him to find Fahlada, a 17 years old girl lying unconscious on the beach. When she wakes up, he realizes that she lost all her memories.", "rate": 70, "genre": ["Drama", "Soap"], "cast": ["Urassaya Sperbund", "Nadech Kugimiya", "Natwara Wongwasana", "Thanawat Wattanaputi", "Chotika Wongwilas"], "character": ["Fahlada/Nang Fah", "Saichon/Charles", "Doctor Wattana/P'Mor", "Doctor Wattana/P'Mor", "Plernta/Ta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50640   Expand An Evil Game, A Love Game   (2011) User Score  Play Trailer Overview Game Rai Game Rak is a Thai television drama. Saichon is an islander living on Min island. One day, destiny leads him to find Fahlada, a 17 years old girl lying unconscious on the beach. When she wakes up, he realizes that she lost all her memories. Featured Crew Lakorn Thai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Urassaya Sperbund Fahlada/Nang Fah Nadech Kugimiya Saichon/Charles Natwara Wongwasana Doctor Wattana/P'Mor Thanawat Wattanaputi Doctor Wattana/P'Mor Chotika Wongwilas Plernta/Ta Full Cast & Crew Last Season Season 1 2011 | 21 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on An Evil Game, A Love Game. You can help by rating TV shows you've seen. Facts Original Name  เกมร้ายเกมรัก Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  97m Homepage  - Genres Drama Soap Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 40 Crip z 5 zurman1 3 lareina123 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}