{"link": "https://www.themoviedb.org/tv/65714?language=en", "title": "Happy Home", "resume": "Drama series follows the Bong family. Bong Sam-Bong runs Chinese restaurant Gahwamansasung.", "rate": 68, "genre": ["Family", "Drama"], "cast": ["Kim So-yeon", "Lee Sang-woo", "Lee Pil-mo", "Kim Yeong-cheol"], "character": ["Bong Hae-Ryung", "Seo Ji-Gun", "Yoo Hyun-Ki", "Bong Sam-Bong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65714   Expand Happy Home   (2016) User Score Overview Drama series follows the Bong family. Bong Sam-Bong runs Chinese restaurant Gahwamansasung. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim So-yeon Bong Hae-Ryung Lee Sang-woo Seo Ji-Gun Lee Pil-mo Yoo Hyun-Ki Kim Yeong-cheol Bong Sam-Bong Full Cast & Crew Last Season Season 1 2016 | 4 Episodes Season 1 of Happy Home premiered on February 27, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Happy Home. You can help by rating TV shows you've seen. Facts Original Name  가화만사성 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/gahwa/ Genres Family Drama Keywords korea Content Score 86 Almost there... Top Contributors M 29 Maria180493 z 15 zurman1 w 4 woogoldsgreat 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}