{"link": "https://www.themoviedb.org/tv/49930?language=en", "title": "The Winner Is", "resume": "The Winner Is is an American vocal game show that airs on NBC. Hosted by Nick Lachey, the seven-episode series features singers of all ages who will compete for a chance to win $1,000,000. The show premiered on June 10, 2013.\nThe winner of the series was Katie Ohh, a nurse who won by a 57-44 decision from the 101 expert judges. For her final song, she sang \"The Climb\". The runner-up was Sharde Bivans, a teacher, who performed \"It's a Man's Man's Man's World\". The other four finalists in the Final 6 were the performers Amy Showalter, Leah Grace, and the vocal groups Senior Sounds of Touch and The LaFontaines.\nWith a dismal 1.0 rating/3 share among adults 18-49, NBC announced its immediate cancellation on August 6, 2013, with two episodes remaining.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49930   Expand The Winner Is   (2013) User Score Overview The Winner Is is an American vocal game show that airs on NBC. Hosted by Nick Lachey, the seven-episode series features singers of all ages who will compete for a chance to win $1,000,000. The show premiered on June 10, 2013. The winner of the series was Katie Ohh, a nurse who won by a 57-44 decision from the 101 expert judges. For her final song, she sang \"The Climb\". The runner-up was Sharde Bivans, a teacher, who performed \"It's a Man's Man's Man's World\". The other four finalists in the Final 6 were the performers Amy Showalter, Leah Grace, and the vocal groups Senior Sounds of Touch and The LaFontaines. With a dismal 1.0 rating/3 share among adults 18-49, NBC announced its immediate cancellation on August 6, 2013, with two episodes remaining. Featured Crew John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2013 | 7 Episodes Season 1 of The Winner Is premiered on June 25, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Winner Is. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  42m Homepage  - Genres No genres have been added. Keywords competition music tv program singer Content Score 56 We're so close, yet so far. Top Contributors 15 Banana CM 2 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}