{"link": "https://www.themoviedb.org/tv/18415?language=en", "title": "Trauma", "resume": "When emergencies occur, the trauma team from San Francisco City Hospital is first on the scene, traveling by land, by sea or by air to reach their victims in time. From the heights of the city's Transamerica Pyramid to the depths of the San Francisco Bay, these heroes must face the most extreme conditions to save lives, and give meaning to their own existence in the process.", "rate": 63, "genre": ["Drama"], "cast": ["Cliff Curtis", "Derek Luke", "Anastasia Griffith", "Aimee Garcia", "Kevin Rankin"], "character": ["Reuben 'Rabbit' Palchuck", "Cameron Boone", "Nancy Carnahan", "Nancy Carnahan", "EMT Tyler Briggs"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18415   Expand Trauma   (2009) User Score Overview When emergencies occur, the trauma team from San Francisco City Hospital is first on the scene, traveling by land, by sea or by air to reach their victims in time. From the heights of the city's Transamerica Pyramid to the depths of the San Francisco Bay, these heroes must face the most extreme conditions to save lives, and give meaning to their own existence in the process. Featured Crew Dario Scardapane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cliff Curtis Reuben 'Rabbit' Palchuck Derek Luke Cameron Boone Anastasia Griffith Nancy Carnahan Aimee Garcia Nancy Carnahan Kevin Rankin EMT Tyler Briggs Full Cast & Crew Last Season Season 1 2009 | 18 Episodes Season 1 of Trauma premiered on September 28, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Trauma. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations   1993-01-20 Time Trax 6.6    2010-09-23 Outsourced 6.7    2006-06-25 Broken Trail 7.3    2011-01-17 Being Human 5.8    2013-02-03 Motive 5.9    2012-09-27 Last Resort 6.8    2011-01-09 The Cape 4.3    1999-09-23 Third Watch 7.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.nbc.com/trauma/ Genres Drama Keywords san francisco paramedic medical drama first responders Content Score 93 Almost there... Top Contributors 40 Banana 5 Elizabeth Jennings 4 seboseboss w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}