{"link": "https://www.themoviedb.org/tv/63763?language=en", "title": "The Fourth Man", "resume": "The year is 1975, and the West German embassy in Stockholm is occupied by German terrorists. It's an attack not only on the embassy, but on Sweden's long-standing pride as a peaceful nation. In the aftermath of the violent occupation, the Swedish Security Police suspects the six terrorists had help from the outside, possibly from a group of Swedish sympathizers. But no leads can be found until fourteen years later.", "rate": 0, "genre": ["Drama", "Crime"], "cast": ["Rolf Lassgård", "Helena af Sandeberg", "Claes Malmberg", "Per Svensson", "Henrik Norlén"], "character": ["Lars Martin Johansson", "Jeanette Eriksson", "Evert Bäckström", "Bo Jarnebring", "Jan Lewin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63763   Expand The Fourth Man   (2014) User Score Overview The year is 1975, and the West German embassy in Stockholm is occupied by German terrorists. It's an attack not only on the embassy, but on Sweden's long-standing pride as a peaceful nation. In the aftermath of the violent occupation, the Swedish Security Police suspects the six terrorists had help from the outside, possibly from a group of Swedish sympathizers. But no leads can be found until fourteen years later. Featured Crew Kristian Petri Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rolf Lassgård Lars Martin Johansson Helena af Sandeberg Jeanette Eriksson Claes Malmberg Evert Bäckström Per Svensson Bo Jarnebring Henrik Norlén Jan Lewin Full Cast & Crew Last Season Season 1 2014 | 3 Episodes Season 1 of The Fourth Man premiered on December 30, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Fourth Man. You can help by rating TV shows you've seen. Facts Original Name  Den fjärde mannen Status  Ended Networks - Certification  - Type  Miniseries Original Language  Swedish Runtime  60m Homepage   http://www.svt.se/den-fjarde-mannen/ Genres Drama Crime Keywords miniseries Content Score 93 Almost there... Top Contributors TB 30 TMDb Bot 13 Razorback121 12 lineker L 9 Littlefeather95  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}