{"link": "https://www.themoviedb.org/tv/66912?language=en", "title": "Chance", "resume": "San Francisco-based forensic neuropsychiatrist Eldon Chance reluctantly gets sucked into a violent and dangerous world of mistaken identity, police corruption and mental illness.", "rate": 74, "genre": ["Drama"], "cast": ["Hugh Laurie", "Gretchen Mol", "Ethan Suplee", "Sal Lopez"], "character": ["Eldon Chance", "Jaclyn Blackstone", "D", "Jean-Baptiste"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66912   Expand Chance   (2016) User Score Overview San Francisco-based forensic neuropsychiatrist Eldon Chance reluctantly gets sucked into a violent and dangerous world of mistaken identity, police corruption and mental illness. Featured Crew Alexandra Cunningham Creator Kem Nunn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hugh Laurie Eldon Chance Gretchen Mol Jaclyn Blackstone Ethan Suplee D Sal Lopez Jean-Baptiste Full Cast & Crew Current Season Season 2 2017 | 10 Episodes Season 2 of Chance premiered on October 11, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply CHANCE   SEASON TWO Open 0 by Anna\n      \n     Just finished (don't read if you haven't seen all episodes) Open 0 by YYMBR\n      \n     J Not so sure about this one.  I want it to be great, but it just isn't. Open 1 by  YYMBR Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations   2016-10-16 Berlin Station 7.4    2016-09-09 Quarry 7.7    2017-09-25 Absentia 7.3    2016-02-21 The Night Manager 7.7    2017-09-26 Law & Order True Crime 6.1    2016-10-14 Goliath 7.8    2016-11-15 Good Behavior 6.9    2014-08-28 Hand of God 6.8  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.hulu.com/chance Genres Drama Keywords corruption mistaken identity mental illness Content Score 100 Yes! Looking good! Top Contributors 31 Elizabeth Jennings p 20 plumpro a 17 adambakir92 s 5 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}