{"link": "https://www.themoviedb.org/tv/30769?language=en", "title": "Live from Studio Five", "resume": "Live from Studio Five was an early-evening British magazine programme which was produced by Sky News for Channel 5. It was presented by Kate Walsh and a line-up of other co-presenters during its run. It consisted of interviews and discussing topical issues, with an emphasis on showbusiness news and celebrity gossip, after originally covering stories from a popular news agenda. It aired its final edition on 4 February 2011 and was replaced by OK! TV in February 2011 which lasted just nine months on air before itself being axed.", "rate": 21, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30769   Expand Live from Studio Five   (2009) User Score Overview Live from Studio Five was an early-evening British magazine programme which was produced by Sky News for Channel 5. It was presented by Kate Walsh and a line-up of other co-presenters during its run. It consisted of interviews and discussing topical issues, with an emphasis on showbusiness news and celebrity gossip, after originally covering stories from a popular news agenda. It aired its final edition on 4 February 2011 and was replaced by OK! TV in February 2011 which lasted just nine months on air before itself being axed. Featured Crew James Haggar Creator Erron Gordon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 — | 204 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Live from Studio Five. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.five.tv/programmes/daytime/live-from-studio-five/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors n 17 navarro2018 2 lineker D 2 Daniel 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}