{"link": "https://www.themoviedb.org/tv/33828?language=en", "title": "Giant", "resume": "Giant is a 2010 South Korean television series starring Lee Beom-soo, Park Jin-hee, Joo Sang-wook, Hwang Jung-eum, Park Sang-min, and Jeong Bo-seok. It aired on SBS from May 10 to December 7, 2010 on Mondays and Tuesdays at 21:55 for 60 episodes. Giant is a sprawling period drama about three siblings' quest for revenge during the economic boom of 1970-80s Korea. Tragically separated during childhood, the three reunite as adults and set out to avenge their parents' deaths, their fates playing out against a larger tide of power, money, politics, and the growth of a city.", "rate": 83, "genre": ["Drama"], "cast": ["Lee Beom-soo", "Hwang Jung-eum", "Lee Deok-hwa ", "Joo Sang-wook", "Nam Ji-hyeon"], "character": ["Kang Mo Lee", "Mi-joo Lee", "Tae-seob Hwang", "Min-woo Jo", "young Hwang Jung-yeon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33828   Expand Giant   (2010) User Score Overview Giant is a 2010 South Korean television series starring Lee Beom-soo, Park Jin-hee, Joo Sang-wook, Hwang Jung-eum, Park Sang-min, and Jeong Bo-seok. It aired on SBS from May 10 to December 7, 2010 on Mondays and Tuesdays at 21:55 for 60 episodes. Giant is a sprawling period drama about three siblings' quest for revenge during the economic boom of 1970-80s Korea. Tragically separated during childhood, the three reunite as adults and set out to avenge their parents' deaths, their fates playing out against a larger tide of power, money, politics, and the growth of a city. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Beom-soo Kang Mo Lee Hwang Jung-eum Mi-joo Lee Lee Deok-hwa  Tae-seob Hwang Joo Sang-wook Min-woo Jo Nam Ji-hyeon young Hwang Jung-yeon Full Cast & Crew Last Season Season 1 2010 | 60 Episodes Season 1 of Giant premiered on May 10, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Giant. You can help by rating TV shows you've seen. Facts Original Name  자이언트 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.tv.sbs.co.kr/giant/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 16 Nightowl.Kr 10 Elizabeth Jennings t 7 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}