{"link": "https://www.themoviedb.org/tv/93?language=en", "title": "Falcon Crest", "resume": "Falcon Crest is an American primetime television soap opera which aired on the CBS network for nine seasons, from December 4, 1981 to May 17, 1990. A total of 227 episodes were produced.\nThe series revolves around the feuding factions of the wealthy Gioberti/Channing family in the Californian wine industry. Jane Wyman starred as Angela Channing, the tyrannical matriarch of the Falcon Crest Winery, alongside Robert Foxworth as Chase Gioberti, Angela's nephew who returns to Falcon Crest following the death of his father. The series was set in the fictitious Tuscany Valley northeast of San Francisco.", "rate": 53, "genre": ["Soap", "Drama"], "cast": ["Abby Dalton", "David Selby", "Jane Wyman", "William R. Moses", "Lorenzo Lamas"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 93   Expand Falcon Crest   (1981) User Score Overview Falcon Crest is an American primetime television soap opera which aired on the CBS network for nine seasons, from December 4, 1981 to May 17, 1990. A total of 227 episodes were produced. The series revolves around the feuding factions of the wealthy Gioberti/Channing family in the Californian wine industry. Jane Wyman starred as Angela Channing, the tyrannical matriarch of the Falcon Crest Winery, alongside Robert Foxworth as Chase Gioberti, Angela's nephew who returns to Falcon Crest following the death of his father. The series was set in the fictitious Tuscany Valley northeast of San Francisco. Featured Crew Earl Hamner, Jr. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Abby Dalton David Selby Jane Wyman William R. Moses Lorenzo Lamas Full Cast & Crew Last Season Season 9 1989 | 22 Episodes Season 9 of Falcon Crest premiered on September 29, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   1981-01-12 Dynasty 6.0    1988-10-23 Mission: Impossible 6.8    1984-09-18 Hunter 7.1    1984-09-20 Who's the Boss? 6.4    1976-03-21 Charlie's Angels 5.9    1978-04-02 Dallas 6.1    1974-09-11 Little House on the Prairie 7.0    1978-03-10 The Incredible Hulk 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage   http://www.falconcrest.org/ Genres Soap Drama Keywords california vineyard wealthy Content Score 100 Yes! Looking good! Top Contributors m 12 mode2 11 dzero 9 niqo19 S 9 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}