{"link": "https://www.themoviedb.org/tv/34182?language=en", "title": "Stratos 4", "resume": "Stratos 4 is an anime series by Studio Fantasia and Bandai Visual, and directed by Takeshi Mori. Originally spanning a 13-episode anime TV series, which premiered across Japan between January 5, 2003 to March 30, 2003, the series was continued onto three OVA-series sequels, the first of which was released on 28 May 2004 and spanned 2-episodes, followed by Stratos 4: Advance, which spanned 6 episodes and was released on 25 March 2005, and Stratos 4: Advance Final, which was released on 22 September 2006 and spanned 2-episodes, respectively.\nThe series has been broadcast by the anime satellite television network, Animax, across its respective networks worldwide, including East Asia, Southeast Asia, South Asia, Latin America, and other regions. The original 13-episode television series and its first subsequent two-episode OVA series were licensed for North American distribution by Bandai's distributive unit across the region, Bandai Entertainment.", "rate": 10, "genre": ["Animation", "Action", "Adventure"], "cast": ["Hideki Tasaka", "Kaori Shimizu", "Tomokazu Seki", "Shiho Kikuchi", "Fumiko Orikasa"], "character": ["Tsubasa Miyazaki", "Shizuha Doi", "Kei Fujitani", "Ayamo Nakamura", "Karin Kikuhara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34182   Expand Stratos 4   (2003) User Score Overview Stratos 4 is an anime series by Studio Fantasia and Bandai Visual, and directed by Takeshi Mori. Originally spanning a 13-episode anime TV series, which premiered across Japan between January 5, 2003 to March 30, 2003, the series was continued onto three OVA-series sequels, the first of which was released on 28 May 2004 and spanned 2-episodes, followed by Stratos 4: Advance, which spanned 6 episodes and was released on 25 March 2005, and Stratos 4: Advance Final, which was released on 22 September 2006 and spanned 2-episodes, respectively. The series has been broadcast by the anime satellite television network, Animax, across its respective networks worldwide, including East Asia, Southeast Asia, South Asia, Latin America, and other regions. The original 13-episode television series and its first subsequent two-episode OVA series were licensed for North American distribution by Bandai's distributive unit across the region, Bandai Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hideki Tasaka Tsubasa Miyazaki Kaori Shimizu Shizuha Doi Tomokazu Seki Kei Fujitani Shiho Kikuchi Ayamo Nakamura Fumiko Orikasa Karin Kikuhara Full Cast & Crew Last Season Season 2 2005 | 6 Episodes Season 2 of Stratos 4 premiered on March 25, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Stratos 4. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 1 Irresponsibletyler  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}