{"link": "https://www.themoviedb.org/tv/16502?language=en", "title": "Poor Little Rich Girl: The Barbara Hutton Story", "resume": "Poor Little Rich Girl: The Barbara Hutton Story is a 1987 television biographical drama starring Farrah Fawcett. The film chronicles the life of Barbara Hutton, who was one of the richest American socialites but was never happy. Released in two versions, as a TV miniseries and TV movie, the project was based on a book by C. David Heymann.\nFawcett's performance earned her fifth Golden Globe Award nomination, for Best Performance by an Actress in a Mini-Series or Motion Picture Made for TV. The film won a Golden Globe Award for Best Miniseries or Television Film and three Emmy Awards, for Hairstyling, Makeup and Costume Design in a Miniseries or a Special.", "rate": 80, "genre": ["Drama"], "cast": ["Zoë Wanamaker", "Brenda Blethyn", "Farrah Fawcett", "Burl Ives", "David Ackroyd"], "character": ["Jean Kennerly", "Ticki Tocquet", "Barbara Hutton", "F.W. Woolworth", "Graham Mattison"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16502   Expand Poor Little Rich Girl: The Barbara Hutton Story   (1987) User Score Overview Poor Little Rich Girl: The Barbara Hutton Story is a 1987 television biographical drama starring Farrah Fawcett. The film chronicles the life of Barbara Hutton, who was one of the richest American socialites but was never happy. Released in two versions, as a TV miniseries and TV movie, the project was based on a book by C. David Heymann. Fawcett's performance earned her fifth Golden Globe Award nomination, for Best Performance by an Actress in a Mini-Series or Motion Picture Made for TV. The film won a Golden Globe Award for Best Miniseries or Television Film and three Emmy Awards, for Hairstyling, Makeup and Costume Design in a Miniseries or a Special. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zoë Wanamaker Jean Kennerly Brenda Blethyn Ticki Tocquet Farrah Fawcett Barbara Hutton Burl Ives F.W. Woolworth David Ackroyd Graham Mattison Full Cast & Crew Last Season Miniseries 1987 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Poor Little Rich Girl: The Barbara Hutton Story. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  300m Homepage  - Genres Drama Keywords biography historical figure tragedy wealth hedonism Content Score 86 Almost there... Top Contributors 18 Steve TB 17 TMDb Bot s 3 speedycars m 1 movienator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}