{"link": "https://www.themoviedb.org/tv/72025?language=en", "title": "The Jim Jefferies Show", "resume": "Each week, Jefferies tackles the week’s top stories from behind his desk and travels the globe to far-off locations to provide an eye opening look at hypocrisy around the world. Featuring interviews, international field pieces, and man on the ground investigations, Jim tackles the news of the day with no-bulls**t candor, piercing insight and a uniquely Aussie viewpoint.", "rate": 73, "genre": ["Comedy", "Talk"], "cast": ["Jim Jefferies"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72025   Expand The Jim Jefferies Show   (2017) User Score  Play Trailer Overview Each week, Jefferies tackles the week’s top stories from behind his desk and travels the globe to far-off locations to provide an eye opening look at hypocrisy around the world. Featuring interviews, international field pieces, and man on the ground investigations, Jim tackles the news of the day with no-bulls**t candor, piercing insight and a uniquely Aussie viewpoint. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Jefferies Himself - Host Full Cast & Crew Current Season Season 2 2018 | 12 Episodes Season 2 of The Jim Jefferies Show premiered on March 27, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Brilliant sarcasm Open 0 by PT 100\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  6 Posters  3 Recommendations   1971-09-15 Columbo 7.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Talk Show Original Language  English Runtime  22m Homepage   http://www.cc.com/shows/the-jim-jefferies-show Genres Comedy Talk Keywords stand-up comedian current affairs Content Score 64 We're so close, yet so far. Top Contributors 63 Elizabeth Jennings 4 oldboy3 d 2 daftie L 2 Limonliza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}