{"link": "https://www.themoviedb.org/tv/74343?language=en", "title": "Gol & Gincu The Series", "resume": "Gol & Gincu (English: Goalpost and Lipsticks) was a 2006 Malaysian TV series spun off from the 2005 film of the same title by Bernard Chauly, continuing upon the affairs of the all-female futsal team \"Bukan Team Biasa\" (Malay: \"Not an Ordinary Team\"). Its first season was first aired from 4 June till 27 August 2006 on 8TV and while its second and final season ran from 8 July to 30 September 2007. The first season of the series was also aired in Singapore on Suria from 26 December 2006 till 20 March 2007.", "rate": 100, "genre": ["Drama", "Family", "Comedy"], "cast": ["Nur Fazura", "Pierre Andre", "Sazzy Falak", "Ashraf Sinclair", "Razif Hashim"], "character": ["Putri", "Reza", "Shasha", "Eddy", "Haikal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74343   Expand Gol & Gincu The Series   (2006) User Score Overview Gol & Gincu (English: Goalpost and Lipsticks) was a 2006 Malaysian TV series spun off from the 2005 film of the same title by Bernard Chauly, continuing upon the affairs of the all-female futsal team \"Bukan Team Biasa\" (Malay: \"Not an Ordinary Team\"). Its first season was first aired from 4 June till 27 August 2006 on 8TV and while its second and final season ran from 8 July to 30 September 2007. The first season of the series was also aired in Singapore on Suria from 26 December 2006 till 20 March 2007. Featured Crew Bernard Chauly Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  1 Top Billed Cast Nur Fazura Putri Pierre Andre Reza Sazzy Falak Shasha Ashraf Sinclair Eddy Razif Hashim Haikal Full Cast & Crew Last Season Season 2 2007 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Gol & Gincu The Series. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Malay Runtime  60m Homepage  - Genres Drama Family Comedy Keywords girl power youth sports teenage life futsal team Content Score 100 Yes! Looking good! Top Contributors 54 love.warrior TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}