{"link": "https://www.themoviedb.org/tv/60987?language=en", "title": "Wiang Roy Dao", "resume": "Roy Dao lived in American and was raised by an American parent after her biological mother passed away when she was a baby. She grow up into a young beautiful lady and came back to Thailand to inheritance her death father will, but She start to heard a mystery noise coming from Wiang Roy Dao, the place where Wiang Kaew (her biological mother) used to lived there when she was still alive. Roy Dao started to go investigated the voice that she heard and the communicated start happening to her, she see the spirit of Wiang Kaew coming to hunted everyone in the Badanto's House...", "rate": 65, "genre": ["Drama", "Romance"], "cast": ["Natapohn Tameeruks", "Smart Krissada Pornweroj", "Manasnan Panlertwongskul", "Jaron Sorat", "Pattrakorn Tungsupakul"], "character": ["Roy Dao", "Khun Chai (Mor) Sipthip Wirumat", "Wiang Kaew", "Poramat (Por) Yutitada", "Dala"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60987   Expand Wiang Roy Dao   (2014) User Score Overview Roy Dao lived in American and was raised by an American parent after her biological mother passed away when she was a baby. She grow up into a young beautiful lady and came back to Thailand to inheritance her death father will, but She start to heard a mystery noise coming from Wiang Roy Dao, the place where Wiang Kaew (her biological mother) used to lived there when she was still alive. Roy Dao started to go investigated the voice that she heard and the communicated start happening to her, she see the spirit of Wiang Kaew coming to hunted everyone in the Badanto's House... Featured Crew Dang Tanya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natapohn Tameeruks Roy Dao Smart Krissada Pornweroj Khun Chai (Mor) Sipthip Wirumat Manasnan Panlertwongskul Wiang Kaew Jaron Sorat Poramat (Por) Yutitada Pattrakorn Tungsupakul Dala Full Cast & Crew Last Season Season 1 2014 | 14 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wiang Roy Dao. You can help by rating TV shows you've seen. Facts Original Name  เวียงร้อยดาว Status  Ended Networks - Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  105m Homepage   http://drama.kapook.com/view63119.html Genres Drama Romance Keywords thai lakorn Content Score 93 Almost there... Top Contributors 53 Crip 20 Elizabeth Jennings TB 3 TMDb Bot 1 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}