{"link": "https://www.themoviedb.org/tv/58474?language=en", "title": "Cosmos: A Spacetime Odyssey", "resume": "Cosmos: A Spacetime Odyssey invents new modes of scientific storytelling to reveal the grandeur of the universe and re-invent celebrated elements of the original series, including the Cosmic Calendar and the Ship of the Imagination. \nUniting scepticism and wonder, and weaving rigorous science with visual, emotional and spiritual elements, it is a transcendent experience – a vision of the cosmos on the grandest scale we know.", "rate": 81, "genre": ["Documentary"], "cast": ["Neil deGrasse Tyson"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58474   Expand Cosmos: A Spacetime Odyssey   (2014) User Score  Play Trailer Overview Cosmos: A Spacetime Odyssey invents new modes of scientific storytelling to reveal the grandeur of the universe and re-invent celebrated elements of the original series, including the Cosmic Calendar and the Ship of the Imagination.  Uniting scepticism and wonder, and weaving rigorous science with visual, emotional and spiritual elements, it is a transcendent experience – a vision of the cosmos on the grandest scale we know. Featured Crew Ann Druyan Creator Steven Soter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  10 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil deGrasse Tyson Himself - Host Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of Cosmos: A Spacetime Odyssey premiered on March  9, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Cosmos: A Spacetime Odyssey. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  7 Recommendations   1980-09-28 Cosmos: A Personal Voyage 8.2    2010-06-09 Through the Wormhole 7.6    2006-03-05 Planet Earth 8.5    2009-10-11 Life 8.3    2004-10-18 Battlestar Galactica 8.1    1990-01-01 Mr. Bean 7.8    2010-09-19 Boardwalk Empire 7.7    1999-03-28 Futurama 8.2  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  60m Homepage   http://channel.nationalgeographic.com/cosmos-a-spacetime-odyssey/ Genres Documentary Keywords biology space cosmology science astronomy astrophysics astrobiology spacetime cosmos Content Score 71 Just a little bit more... Top Contributors 21 Elizabeth Jennings 19 Greg 13 Travis Bell 12 Peter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}