{"link": "https://www.themoviedb.org/tv/21344?language=en", "title": "George Washington", "resume": "George Washington is a 1984 television miniseries directed by Buzz Kulik. The miniseries, released in three parts, chronicles the life of George Washington, the 1st President of the United States, from age 11 to age 51. George Washington is based on the biography by James Thomas Flexner.\nThe miniseries was shot mainly on location near Washington, D.C. and was aired on April 8, 10 and 11, 1984. The first part covers Washington's life in the French and Indian War, the second part shows the coming and commencement of the Revolutionary War and the final part describes the victory of the Independence from England. It was nominated for six Primetime Emmys.", "rate": 80, "genre": ["War", "Politics", "Drama"], "cast": ["Clive Revill", "Barry Bostwick", "Hal Holbrook", "David Dukes", "Jaclyn Smith"], "character": ["Lord Loudoun", "Gen. George Washington", "John Adams", "George William 'Will' Fairfax", "Sally Fairfax"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21344   Expand George Washington   (1984) User Score Overview George Washington is a 1984 television miniseries directed by Buzz Kulik. The miniseries, released in three parts, chronicles the life of George Washington, the 1st President of the United States, from age 11 to age 51. George Washington is based on the biography by James Thomas Flexner. The miniseries was shot mainly on location near Washington, D.C. and was aired on April 8, 10 and 11, 1984. The first part covers Washington's life in the French and Indian War, the second part shows the coming and commencement of the Revolutionary War and the final part describes the victory of the Independence from England. It was nominated for six Primetime Emmys. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clive Revill Lord Loudoun Barry Bostwick Gen. George Washington Hal Holbrook John Adams David Dukes George William 'Will' Fairfax Jaclyn Smith Sally Fairfax Full Cast & Crew Last Season Season 1 1984 | 3 Episodes Season 1 of George Washington premiered on April  8, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on George Washington. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  360m Homepage  - Genres War & Politics Drama Keywords usa president biography miniseries american civil war american revolution george washington french and indian war Content Score 71 Just a little bit more... Top Contributors TB 17 TMDb Bot 11 Banana R 1 Rebecca 1 agenthall  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}