{"link": "https://www.themoviedb.org/tv/64044?language=en", "title": "Mighty Planes", "resume": "Mighty Planes explores the art and science of aviation, on planes that soar to faraway places on astounding missions. From preparation, loading and take off, through the journey and to the landing and unloading, viewers will experience the high-stakes and high-stress jobs through the eyes and lives of the characters that make it all happen. Featuring the genius of flight technology with the aid of high-end CGI, shot in HD, and recorded in 5.1 surround sound, MIGHTY PLANES captures all the action as it happens.", "rate": 50, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64044   Expand Mighty Planes   (2012) User Score Overview Mighty Planes explores the art and science of aviation, on planes that soar to faraway places on astounding missions. From preparation, loading and take off, through the journey and to the landing and unloading, viewers will experience the high-stakes and high-stress jobs through the eyes and lives of the characters that make it all happen. Featuring the genius of flight technology with the aid of high-end CGI, shot in HD, and recorded in 5.1 surround sound, MIGHTY PLANES captures all the action as it happens. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2016 | 6 Episodes Season 3 of Mighty Planes premiered on November  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mighty Planes. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Documentary Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords airplane Content Score 56 We're so close, yet so far. Top Contributors o 19 obishiro 15 Aty 9 Elizabeth Jennings G 5 Gonçalo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}