{"link": "https://www.themoviedb.org/tv/74811?language=en", "title": "Soundbreaking", "resume": "Explore the art of music recording with a behind-the-scenes look at the birth of brand new sounds. Featuring more than 160 original interviews with some of the most celebrated recording artists of all time, Soundbreaking explores the nexus of cutting-edge technology and human artistry that has created the soundtrack of our lives.", "rate": 80, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74811   Expand Soundbreaking   (2016) User Score  Play Trailer Overview Explore the art of music recording with a behind-the-scenes look at the birth of brand new sounds. Featuring more than 160 original interviews with some of the most celebrated recording artists of all time, Soundbreaking explores the nexus of cutting-edge technology and human artistry that has created the soundtrack of our lives. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Miniseries 2016 | 8 Episodes Season 1 of Soundbreaking premiered on November 14, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  15 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Soundbreaking. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  53m Homepage   http://soundbreaking.com/ Genres Documentary Keywords music miniseries music recording record industry Content Score 64 We're so close, yet so far. Top Contributors 20 Elizabeth Jennings 17 dgw TB 10 TMDb Bot R 9 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}