{"link": "https://www.themoviedb.org/tv/28136?language=en", "title": "Rurouni Kenshin", "resume": "The Meiji Era was one of great renewal for Japan, where swords and killing were outlawed. However, many survivors from the time of Revolution still live, lurking in the shadows and waiting for a chance to use their killing blades again. Only Kenshin Himura, formerly one of the most brutal of killers, hopes to keep his swordsman's honor and still live in the new era.", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Mayo Suzukaze", "Miki Fujitani", "Miina Tominaga", "Yuji Ueda", "Mika Doi"], "character": ["Kenshin Himura (voice)", "Kaoru Kamiya (voice)", "Yahiko Myoujin (voice)", "Sanosuke Sagara (voice)", "Megumi Takani (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 28136   Expand Rurouni Kenshin   (1996) User Score Overview The Meiji Era was one of great renewal for Japan, where swords and killing were outlawed. However, many survivors from the time of Revolution still live, lurking in the shadows and waiting for a chance to use their killing blades again. Only Kenshin Himura, formerly one of the most brutal of killers, hopes to keep his swordsman's honor and still live in the new era. Featured Crew Nobuhiro Watsuki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mayo Suzukaze Kenshin Himura (voice) Miki Fujitani Kaoru Kamiya (voice) Miina Tominaga Yahiko Myoujin (voice) Yuji Ueda Sanosuke Sagara (voice) Mika Doi Megumi Takani (voice) Full Cast & Crew Last Season Season 3 1997 | 32 Episodes Season 3 of Rurouni Kenshin premiered on October 13, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  8 Recommendations   2006-10-05 Code Geass: Lelouch of the Rebellion 8.1    2004-05-20 Samurai Champloo 8.0    2004-06-12 Samurai 7 6.6    2001-07-04 Shaman King 5.2    2007-04-01 Gurren Lagann 7.9    2000-04-19 Love Hina 7.2    2006-07-03 The Familiar of Zero 8.6    1995-10-04 Neon Genesis Evangelion 8.0  Facts Original Name  るろうに剣心―明治剣客浪漫譚― Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.kenshin-tv.com/ Genres Action & Adventure Animation Comedy Keywords samurai romance historic anime Content Score 93 Almost there... Top Contributors 78 Claudio 35 Banana 23 United600 11 Renato  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}