{"link": "https://www.themoviedb.org/tv/67652?language=en", "title": "Sien van Sellingen", "resume": "Children's tale that follows the adventures of Sien, a tough and down-to-earth girl who lives on a traditional farm on the country side: In a big family, with lots of animals and lots of free space.", "rate": 75, "genre": ["Family"], "cast": ["Isabelle Smit", "Emma-Sophie Smit", "Diederik Ebbinge", "Lies Visschedijk", "Joke Tjalsma"], "character": ["Sien van Sellingen", "Saar van Sellingen", "Mr. van Sellingen", "Mrs. van Sellingen", "Grandma"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67652   Expand Sien van Sellingen   (2010) User Score Overview Children's tale that follows the adventures of Sien, a tough and down-to-earth girl who lives on a traditional farm on the country side: In a big family, with lots of animals and lots of free space. Featured Crew Jan-Willem Bult Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Isabelle Smit Sien van Sellingen Emma-Sophie Smit Saar van Sellingen Diederik Ebbinge Mr. van Sellingen Lies Visschedijk Mrs. van Sellingen Joke Tjalsma Grandma Full Cast & Crew Last Season Season 2 2012 | 5 Episodes Season 2 of Sien van Sellingen premiered on November  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sien van Sellingen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  7m Homepage  - Genres Family Keywords farm farm life Content Score 100 Yes! Looking good! Top Contributors 45 Marr 🇳🇱 TB 3 TMDb Bot 1 MichelD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}