{"link": "https://www.themoviedb.org/tv/43333?language=en", "title": "Noel Fielding's Luxury Comedy", "resume": "Noel Fielding's Luxury Comedy is a British sketch television series written and directed by Noel Fielding and Nigel Coan. The series stars Fielding, his brother Michael Fielding, Tom Meeten, and Dolly Wells. Various guest stars also appear, including Rich Fulcher and Richard Ayoade, and it features numerous members of The Mighty Boosh. The first episode premiered on 26 January 2012 on E4. The music was written by Kasabian's Sergio Pizzorno, a good friend of Fielding's.\nPrior to the creation of the Luxury Comedy, Fielding had worked in a double act with comedian Julian Barratt as The Mighty Boosh. Together, Fielding and Barratt produced a series of stage shows, a radio series, and a television series between 1998 and 2008. Going their separate ways, Fielding became a team captain on Never Mind the Buzzcocks from 2009, and also began co-operating on a new sketch show with Coan. The show originally had the provisional title Noel Fielding: Boopus.\nIt is described on the Channel 4 website as \"a psychedelic character based comedy show half filmed and half animated\".", "rate": 77, "genre": ["Comedy"], "cast": ["Noel Fielding", "Richard Ayoade", "Michael Fielding", "Rich Fulcher", "Dolly Wells"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43333   Expand Noel Fielding's Luxury Comedy   (2012) User Score Overview Noel Fielding's Luxury Comedy is a British sketch television series written and directed by Noel Fielding and Nigel Coan. The series stars Fielding, his brother Michael Fielding, Tom Meeten, and Dolly Wells. Various guest stars also appear, including Rich Fulcher and Richard Ayoade, and it features numerous members of The Mighty Boosh. The first episode premiered on 26 January 2012 on E4. The music was written by Kasabian's Sergio Pizzorno, a good friend of Fielding's. Prior to the creation of the Luxury Comedy, Fielding had worked in a double act with comedian Julian Barratt as The Mighty Boosh. Together, Fielding and Barratt produced a series of stage shows, a radio series, and a television series between 1998 and 2008. Going their separate ways, Fielding became a team captain on Never Mind the Buzzcocks from 2009, and also began co-operating on a new sketch show with Coan. The show originally had the provisional title Noel Fielding: Boopus. It is described on the Channel 4 website as \"a psychedelic character based comedy show half filmed and half animated\". Featured Crew Noel Fielding Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Noel Fielding Richard Ayoade Michael Fielding Rich Fulcher Dolly Wells Full Cast & Crew Last Season Season 1 2012 | 7 Episodes Season 1 of Noel Fielding's Luxury Comedy premiered on January 26, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2004-05-18 The Mighty Boosh 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}