{"link": "https://www.themoviedb.org/tv/3966?language=en", "title": "Agony Again", "resume": "Agony Again is a British sitcom that aired on BBC1 in 1995. Starring Maureen Lipman, it is the sequel to Agony, an ITV sitcom that aired from 1979 to 1981. Agony Again was written by Carl Gorham, Michael Hatt and Amanda Swift.", "rate": 70, "genre": ["Comedy"], "cast": ["Maria Charles", "Doon Mackichan", "Maureen Lipman", "David Harewood"], "character": ["Bea Fisher", "Debra", "Jane Lucas", "Daniel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3966   Expand Agony Again   (1995) User Score Overview Agony Again is a British sitcom that aired on BBC1 in 1995. Starring Maureen Lipman, it is the sequel to Agony, an ITV sitcom that aired from 1979 to 1981. Agony Again was written by Carl Gorham, Michael Hatt and Amanda Swift. Featured Crew Anna Raeburn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maria Charles Bea Fisher Doon Mackichan Debra Maureen Lipman Jane Lucas David Harewood Daniel Full Cast & Crew Last Season Season 1 1995 | 7 Episodes Season 1 of Agony Again premiered on August 31, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Agony Again. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sitcom british humour Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana O 4 Ozbourne M 1 MeatHookFF 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}