{"link": "https://www.themoviedb.org/tv/70916?language=en", "title": "Vidago Palace", "resume": "Vidago Palace has the background of the year 1936 and tells us a love story between two young people from different classes, ready to face all obstacles.", "rate": 0, "genre": ["Drama"], "cast": ["Pedro Barroso", "Mikaela Lupu", "Fernando da Costa", "Eva Fernández", "Xosé Antonio Touriñán"], "character": ["César Augusto", "Carlota de Vimieiro", "Ignácio Aranjuez", "Xenoveva", "Padre Raimundo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70916   Expand Vidago Palace   (2017) User Score Overview Vidago Palace has the background of the year 1936 and tells us a love story between two young people from different classes, ready to face all obstacles. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pedro Barroso César Augusto Mikaela Lupu Carlota de Vimieiro Fernando da Costa Ignácio Aranjuez Eva Fernández Xenoveva Xosé Antonio Touriñán Padre Raimundo Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Vidago Palace premiered on March 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Vidago Palace. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Portuguese Runtime  60m Homepage   http://media.rtp.pt/vidagopalace/ Genres Drama Keywords portugal palace galicia, spain vidago Content Score 86 Almost there... Top Contributors HS 62 Hugo S. 4 Elizabeth Jennings TB 2 TMDb Bot 2 pedrocrispim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}