{"link": "https://www.themoviedb.org/tv/19499?language=en", "title": "The Private Life of a Masterpiece", "resume": "The Private Life of a Masterpiece was a BBC arts documentary series which told the stories behind great works of art; 29 episodes of the series were broadcast on BBC Two, commencing in 2001 and ending in 2010. It initially ran for five seasons from 2001 to 2006, for a total of 22 episodes; each episode was 50 minutes long. A seven-DVD box set of the first five series was released in 2007, which re-arranged the documentaries into genres from art history. A further seven episodes were broadcast between 2006 and 2010. The series has been widely broadcast around the world, often in re-voiced into national languages. The original narrations were done by the actor Samuel West. Works of art featured range from Michelangelo's David for the first episode to Fillippo Lippi's Adoration of the Christ Child for the last.\nThe series was produced by independent TV production company Fulmar Television & Film, based in Cardiff. The series producer, who also devised the concept of the programme, was Jeremy Bugler.\nThe series was praised by the TV critic of The Times, David Chater, who listed it at Number 30 in The top 50 TV shows of the Noughties.", "rate": 0, "genre": ["Documentary"], "cast": ["Samuel West"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19499   Expand The Private Life of a Masterpiece   (2004) User Score Overview The Private Life of a Masterpiece was a BBC arts documentary series which told the stories behind great works of art; 29 episodes of the series were broadcast on BBC Two, commencing in 2001 and ending in 2010. It initially ran for five seasons from 2001 to 2006, for a total of 22 episodes; each episode was 50 minutes long. A seven-DVD box set of the first five series was released in 2007, which re-arranged the documentaries into genres from art history. A further seven episodes were broadcast between 2006 and 2010. The series has been widely broadcast around the world, often in re-voiced into national languages. The original narrations were done by the actor Samuel West. Works of art featured range from Michelangelo's David for the first episode to Fillippo Lippi's Adoration of the Christ Child for the last. The series was produced by independent TV production company Fulmar Television & Film, based in Cardiff. The series producer, who also devised the concept of the programme, was Jeremy Bugler. The series was praised by the TV critic of The Times, David Chater, who listed it at Number 30 in The top 50 TV shows of the Noughties. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samuel West Full Cast & Crew Last Season Season 10 2010 | 2 Episodes Season 10 of The Private Life of a Masterpiece premiered on April  3, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Private Life of a Masterpiece. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}