{"link": "https://www.themoviedb.org/tv/46638?language=en", "title": "Top of the Lake", "resume": "A woman haunted by her past, Detective Robin Griffin, investigates complex and unsettling cases.", "rate": 71, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Elisabeth Moss", "David Dencik", "Nicole Kidman", "Gwendoline Christie", "Alice Englert"], "character": ["Det. Robin Griffin", "Alexander \"Puss\"", "Julia", "Miranda", "Mary"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46638   Expand Top of the Lake   (2013) User Score Overview A woman haunted by her past, Detective Robin Griffin, investigates complex and unsettling cases. Featured Crew Jane Campion Creator Gerard Lee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  11 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elisabeth Moss Det. Robin Griffin David Dencik Alexander \"Puss\" Nicole Kidman Julia Gwendoline Christie Miranda Alice Englert Mary Full Cast & Crew Last Season Season 2: China Girl 2017 | 6 Episodes View All Seasons Social Reviews  2 Discussions  5 D A review by Dan_Tebasco  4.0 Written by  Dan_Tebasco  on August 17, 2017 Takes 6 full hours to tell a story that most films can tell in 2.  It gets painfully boring quite alot and Tui is one annoying kid who I suppose we are suppose to feel for but impossible since she's such an idiot. Only for hardcore Elizabeth Moss fans (if they exist). Read All Reviews Media Most Popular Videos  0 Backdrops  11 Posters  12 Recommendations   2014-04-29 Happy Valley 7.7    2013-04-22 Rectify 7.6    2011-07-19 The Hour 7.3    2013-03-04 Broadchurch 8.1    2011-03-27 Mildred Pierce 7.0    2013-01-15 Utopia 8.0    2006-03-12 Big Love 7.6    2013-05-12 The Fall 7.6  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.sundance.tv/series/top-of-the-lake Genres Crime Drama Mystery Keywords sexual abuse new zealand female cop police detective missing child female detective small community Content Score 100 Yes! Looking good! Top Contributors 75 Elizabeth Jennings 10 Banana CM 7 Cherche Moi 6 velpi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}