{"link": "https://www.themoviedb.org/tv/22639?language=en", "title": "Smuggler", "resume": "Set during the Napoleonic wars of the early 1800s, Oliver Tobias stars as Jack Vincent, a swashbuckling ex-British naval captain turned smuggler. A strong-willed, independent man who lives by both his wits and the sword, Vincent is ably assisted by Sarah and petty thief Honesty Evans in his struggle to stay one step ahead of the Excise Men...", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Lesley Dunlop", "Oliver Tobias", "Peter Capell", "George Murcell", "Michael O'Hagan"], "character": ["Sarah Morton", "Jack Vincent", "Captain König", "Silas Kemble", "Jacob"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 22639   Expand Smuggler   (1981) User Score Overview Set during the Napoleonic wars of the early 1800s, Oliver Tobias stars as Jack Vincent, a swashbuckling ex-British naval captain turned smuggler. A strong-willed, independent man who lives by both his wits and the sword, Vincent is ably assisted by Sarah and petty thief Honesty Evans in his struggle to stay one step ahead of the Excise Men... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lesley Dunlop Sarah Morton Oliver Tobias Jack Vincent Peter Capell Captain König George Murcell Silas Kemble Michael O'Hagan Jacob Full Cast & Crew Last Season Season 1 1981 | 13 Episodes Season 1 of Smuggler premiered on April  5, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Smuggler. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Keywords smuggler 19th century Content Score 71 Just a little bit more... Top Contributors TB 8 TMDb Bot S 7 Samara R 7 Rebecca L 3 Lemmy_6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}