{"link": "https://www.themoviedb.org/tv/66954?language=en", "title": "The Blue Bicycle", "resume": "In 1939 France, Léa, the daughter of a rich wine grower in Bordeaux, sees her adored childhood sweetheart married to his namby-pamby cousin. Léa has lovers but never stops carrying the torch for Laurent. Be it while tending pregnant Camille during Laurent's service at the front, holding down the family estate of Montillac where Germans are billeted, or cycling through occupied checkpoints with messages for the Résistance movement...", "rate": 67, "genre": ["Drama"], "cast": ["François Marthouret", "Delphine Serina", "Jacques Spiesser", "Laetitia Casta", "Georges Corraface"], "character": ["Pierre Delmas", "Sarah Mühlstein", "Adrien Delmas", "Léa Delmas", "François Tavernier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66954   Expand The Blue Bicycle   (2000) User Score Overview In 1939 France, Léa, the daughter of a rich wine grower in Bordeaux, sees her adored childhood sweetheart married to his namby-pamby cousin. Léa has lovers but never stops carrying the torch for Laurent. Be it while tending pregnant Camille during Laurent's service at the front, holding down the family estate of Montillac where Germans are billeted, or cycling through occupied checkpoints with messages for the Résistance movement... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast François Marthouret Pierre Delmas Delphine Serina Sarah Mühlstein Jacques Spiesser Adrien Delmas Laetitia Casta Léa Delmas Georges Corraface François Tavernier Full Cast & Crew Last Season Season 1 2000 | 3 Episodes Season 1 of The Blue Bicycle premiered on October  8, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Blue Bicycle. You can help by rating TV shows you've seen. Facts Original Name  La bicyclette bleue Status  Returning Series Network Certification  - Type  Scripted Original Language  French Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 25 TMDb Bot 18 lol32lol a 8 asusar 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}