{"link": "https://www.themoviedb.org/tv/37850?language=en", "title": "Jang Bo Ri Is Here", "resume": "A story about the life of a mother and her two daughters; a real daughter and an adopted daughter whose fates are twisted and lives change due to the real daughter and the adopted daughter have been swapped, cause intense conflicts within the family.", "rate": 0, "genre": ["Family", "Drama"], "cast": ["Oh Yeon-Seo", "Kim Ji-hun", "Lee Yoo-ri", "Oh Chang-seok", "Kim Yong-rim"], "character": ["Jang Bo-ri", "Lee Jae-hwa", "Yeon Min-jung", "Lee Jae-hee", "Park Soo-mi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37850   Expand Jang Bo Ri Is Here   (2014) User Score Overview A story about the life of a mother and her two daughters; a real daughter and an adopted daughter whose fates are twisted and lives change due to the real daughter and the adopted daughter have been swapped, cause intense conflicts within the family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oh Yeon-Seo Jang Bo-ri Kim Ji-hun Lee Jae-hwa Lee Yoo-ri Yeon Min-jung Oh Chang-seok Lee Jae-hee Kim Yong-rim Park Soo-mi Full Cast & Crew Last Season Season 1 2014 | 1 Episode Season 1 of Jang Bo Ri Is Here premiered on April  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Jang Bo Ri Is Here. You can help by rating TV shows you've seen. Facts Original Name  왔다! 장보리 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage  - Genres Family Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 16 Nightowl.Kr L 16 Leah 14 sansalayne z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}