{"link": "https://www.themoviedb.org/tv/68416?language=en", "title": "The Hunt", "resume": "In the forest are found the bodies of young women. The case is assigned to the young, diligent and thorough detective Lea Smith and it is asked help to Thomas Wolf, a forensic psychologist.", "rate": 0, "genre": ["Crime"], "cast": ["Loes Haverkort", "Fedja van Huêt", "Mark Rietman"], "character": ["Lea Smid", "Thomas de Wolf", "Hoofdinspecteur van Praag"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68416   Expand The Hunt   (2016) User Score Overview In the forest are found the bodies of young women. The case is assigned to the young, diligent and thorough detective Lea Smith and it is asked help to Thomas Wolf, a forensic psychologist. Featured Crew John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Loes Haverkort Lea Smid Fedja van Huêt Thomas de Wolf Mark Rietman Hoofdinspecteur van Praag Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of The Hunt premiered on May 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Hunt. You can help by rating TV shows you've seen. Facts Original Name  De Jacht Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  - Homepage   http://www.sbs6.nl/programmas/de-jacht/ Genres Crime Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 21 Razorback121 7 Hollander_1908  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}