{"link": "https://www.themoviedb.org/tv/1126?language=en", "title": "Happy Tree Friends", "resume": "Happy Tree Friends is an American flash cartoon created and developed by Aubrey Ankrum, Rhode Montijo, Kenn Navarro and Warren Graff for Mondo Media. The show is cited as an early example of a popular Internet phenomenon achieving a cult following.\nThe action and adventure comedy is drawn in simple appearance and combines cute forest animals with extreme graphic violence. Each episode revolves around the characters enduring accidental events of bloodshed, pain, dismemberment and/or death. The episodes last from between 1 to 7 minutes. At one point, the warning \"Cartoon Violence: Not recommended for small children, or big babies\" was given on the official website. In 2006, a television series featuring longer episodes aired. A spin-off called Ka-Pow! premiered on September 2, 2008.", "rate": 67, "genre": ["Animation", "Comedy"], "cast": ["Aubrey Ankrum", "David Winn", "Warren Graff", "Kenn Navarro", "Ellen Connell"], "character": ["Pop (voice)", "Lumpy (voice)", "Toothy (voice)", "Cuddles (voice)", "Petunia (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1126   Expand Happy Tree Friends   (1999) User Score Overview Happy Tree Friends is an American flash cartoon created and developed by Aubrey Ankrum, Rhode Montijo, Kenn Navarro and Warren Graff for Mondo Media. The show is cited as an early example of a popular Internet phenomenon achieving a cult following. The action and adventure comedy is drawn in simple appearance and combines cute forest animals with extreme graphic violence. Each episode revolves around the characters enduring accidental events of bloodshed, pain, dismemberment and/or death. The episodes last from between 1 to 7 minutes. At one point, the warning \"Cartoon Violence: Not recommended for small children, or big babies\" was given on the official website. In 2006, a television series featuring longer episodes aired. A spin-off called Ka-Pow! premiered on September 2, 2008. Featured Crew Kenn Navarro Creator Rhode Montijo Creator Aubrey Ankrum Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  13 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aubrey Ankrum Pop (voice) David Winn Lumpy (voice) Warren Graff Toothy (voice) Kenn Navarro Cuddles (voice) Ellen Connell Petunia (voice) Full Cast & Crew Last Season Season 4 2013 | 14 Episodes Season 4 of Happy Tree Friends premiered on June 14, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Happy Tree Friends. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  13 Posters  1 Recommendations   1997-09-16 Cow and Chicken 6.4    1996-04-28 Dexter's Laboratory 7.3    1995-09-09 Pinky and the Brain 7.7    1989-09-04 The Super Mario Bros. Super Show! 5.9    2010-02-19 The Ricky Gervais Show 7.9    1993-09-18 Marsupilami 3.8    1990-09-10 Captain Planet and the Planeteers 5.9    1994-01-26 The Critic 7.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  4m Homepage   http://www.mondomedia.com/shows/happytreefriends/ Genres Animation Comedy Keywords gore blood death Content Score 93 Almost there... Top Contributors 26 Banana DA 16 Dmitry A. Kuznetsov 10 TheOneManBoxOffice M 7 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}