{"link": "https://www.themoviedb.org/tv/9473?language=en", "title": "Tales of the Wizard of Oz", "resume": "Tales of the Wizard of Oz is a 1961 animated television series, produced by Crawley Films for Videocrafts. This is the second animated series produced by the studio, and the first by Rankin/Bass to feature traditional animation.\nThe series features stories derived from characters created in L. Frank Baum's book The Wonderful Wizard of Oz. Several characters are given additional names, including Dandy Lion, Rusty Tin Man, and Socrates the Scarecrow.\nArtistic renditions of the Oz characters created for this series were later featured in the hour-long television special, Return to Oz. The series was also adapted to a comic book for a one-shot in Dell's Four Color #1308 [March–May 1962].\nAs of 2013, this series has yet to be released on DVD. Ironically, both this series and Filmation's own animated project, Journey Back to Oz, are now owned by the same company, DreamWorks Animation.\nIn October 2010, the series was re-issued on the Retro Television Network.", "rate": 20, "genre": ["Animation"], "cast": ["Larry D. Mann", "Carl Banas", "Alfie Scopp"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9473   Expand Tales of the Wizard of Oz   (1961) User Score Overview Tales of the Wizard of Oz is a 1961 animated television series, produced by Crawley Films for Videocrafts. This is the second animated series produced by the studio, and the first by Rankin/Bass to feature traditional animation. The series features stories derived from characters created in L. Frank Baum's book The Wonderful Wizard of Oz. Several characters are given additional names, including Dandy Lion, Rusty Tin Man, and Socrates the Scarecrow. Artistic renditions of the Oz characters created for this series were later featured in the hour-long television special, Return to Oz. The series was also adapted to a comic book for a one-shot in Dell's Four Color #1308 [March–May 1962]. As of 2013, this series has yet to be released on DVD. Ironically, both this series and Filmation's own animated project, Journey Back to Oz, are now owned by the same company, DreamWorks Animation. In October 2010, the series was re-issued on the Retro Television Network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Larry D. Mann Carl Banas Alfie Scopp Full Cast & Crew Last Season Season 1 2006 | 98 Episodes Season 1 of Tales of the Wizard of Oz premiered on January  1, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tales of the Wizard of Oz. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}