{"link": "https://www.themoviedb.org/tv/35710?language=en", "title": "Thousand Years of Love", "resume": "It was about 1,400 years ago. The story revolves around Princess Buyeu Ju, the Daughter of last king, general Ari who attempts to reconstruct Bakje for the love of the princess, and general Yu Suk Kim from Shila whos after him. When the princess falls into YuSuks trap, she jumps off the cliff and then, the princess leaps through 1400 years and is brought to modern society in 2003. And meets Inchul (Ari) and Tasuji who have no idea of their past lives and creates love fantasy that overcome time and space.", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Sung Yu-ri", "So Ji-sub", "Kim Nam-jin", "Kim Sa-rang", "Lee Sun-kyun"], "character": ["Princess Puyeoju", "General Guishil Ari / Kang In-chul", "General Kim Yu-seok / Fujiwara Tatsuji", "Kum-hwa / Go Eun-bi", "Pil-ga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35710   Expand Thousand Years of Love   (2003) User Score Overview It was about 1,400 years ago. The story revolves around Princess Buyeu Ju, the Daughter of last king, general Ari who attempts to reconstruct Bakje for the love of the princess, and general Yu Suk Kim from Shila whos after him. When the princess falls into YuSuks trap, she jumps off the cliff and then, the princess leaps through 1400 years and is brought to modern society in 2003. And meets Inchul (Ari) and Tasuji who have no idea of their past lives and creates love fantasy that overcome time and space.  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sung Yu-ri Princess Puyeoju So Ji-sub General Guishil Ari / Kang In-chul Kim Nam-jin General Kim Yu-seok / Fujiwara Tatsuji Kim Sa-rang Kum-hwa / Go Eun-bi Lee Sun-kyun Pil-ga Full Cast & Crew Last Season Season 1 2003 | 20 Episodes Season 1 of Thousand Years of Love premiered on March 22, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Thousand Years of Love. You can help by rating TV shows you've seen. Facts Original Name  천년지애 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords korea Content Score 86 Almost there... Top Contributors M 19 Maria180493 N 15 Nightowl.Kr CM 8 Cherche Moi 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}