{"link": "https://www.themoviedb.org/tv/45234?language=en", "title": "Dakara Boku wa, H ga Dekinai", "resume": "So, I Can't Play H?, shortened to Boku-H, is a Japanese light novel series written by Pan Tachibana and illustrated by Yoshiaki Katsurai. The story centers on Ryosuke Kaga, a perverted high school student who makes a contract with Lisara Restall, a beautiful Grim Reaper, in exchange for his perverted spirit.\nDakara Boku wa, H ga Dekinai began serialization in Fujimi Shobo's Dragon Magazine in 2010. The first volume was released on June 19, 2010, with a total of ten volumes released in Japan as of April 20, 2013 under their Fujimi Fantasia Bunko imprint. A manga adaptation illustrated by Shou Okagiri began serialization in the May 2011 issue of Monthly Dragon Age, and sold four volumes as of March 27, 2013. A 12-episode anime adaptation produced by feel. was announced, and aired from July to September 2012 on AT-X and other networks. The anime has been licensed by Sentai Filmworks in North America.", "rate": 90, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Hiro Shimono", "Kaori Ishihara", "Aya Endo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45234   Expand Dakara Boku wa, H ga Dekinai   (2012) User Score Overview So, I Can't Play H?, shortened to Boku-H, is a Japanese light novel series written by Pan Tachibana and illustrated by Yoshiaki Katsurai. The story centers on Ryosuke Kaga, a perverted high school student who makes a contract with Lisara Restall, a beautiful Grim Reaper, in exchange for his perverted spirit. Dakara Boku wa, H ga Dekinai began serialization in Fujimi Shobo's Dragon Magazine in 2010. The first volume was released on June 19, 2010, with a total of ten volumes released in Japan as of April 20, 2013 under their Fujimi Fantasia Bunko imprint. A manga adaptation illustrated by Shou Okagiri began serialization in the May 2011 issue of Monthly Dragon Age, and sold four volumes as of March 27, 2013. A 12-episode anime adaptation produced by feel. was announced, and aired from July to September 2012 on AT-X and other networks. The anime has been licensed by Sentai Filmworks in North America. Featured Crew Takeo Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiro Shimono Kaori Ishihara Aya Endo Full Cast & Crew Last Season ? season 1 2012 | 12 Episodes Season 1 of Dakara Boku wa, H ga Dekinai premiered on July  6, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  12 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dakara Boku wa, H ga Dekinai. You can help by rating TV shows you've seen. Facts Original Name  だから僕は、Hができない。 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://boku-h.com/ Genres Action & Adventure Animation Comedy Keywords harem demon super power Content Score 64 We're so close, yet so far. Top Contributors t 19 tmdb62726470 S 7 Sergey x 3 xoINARIox f 3 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}