{"link": "https://www.themoviedb.org/tv/15780?language=en", "title": "Flower Shop Without a Rose", "resume": "Shiomi Eiji is forced to become a single father when his girlfriend passes away while giving birth to their daughter, Shizuku. Desolate after the loss of the woman he loved, Eiji has little time or desire to even consider remarrying, working part-time jobs just to make ends meet. The one thing that gives meaning and joy to his life is Shizuku, but even that begins to trouble him when Shizuku begins acting strange, hiding her face by putting a cloth over her head when around other people.\nOne day after opening his flower shop, Eiji comes across a blind woman standing by the door, taking shelter from the rain. When he invites her to come inside the shop, she at first refuses, but later gives in to Eiji's kindness. They become intimate friends and she slowly grows to depend on Eiji's sincerity and good heartedness. After rescuing her a following evening when she walks into the street and is nearly struck by traffic, Eiji himself inexplicably discovers the cold of winter that has saddled his heart all these years slowly melting away...", "rate": 75, "genre": ["Drama"], "cast": ["Shingo Katori", "Yuko Takeuchi", "Susumu Terajima", "Yumiko Shaku", "Yuki Yagi"], "character": ["Eji Shiomi", "Miou Shirato", "Kengo Shijo", "Yuki Ono", "Shizuku Shimoi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15780   Expand Flower Shop Without a Rose   (2008) User Score Overview Shiomi Eiji is forced to become a single father when his girlfriend passes away while giving birth to their daughter, Shizuku. Desolate after the loss of the woman he loved, Eiji has little time or desire to even consider remarrying, working part-time jobs just to make ends meet. The one thing that gives meaning and joy to his life is Shizuku, but even that begins to trouble him when Shizuku begins acting strange, hiding her face by putting a cloth over her head when around other people. One day after opening his flower shop, Eiji comes across a blind woman standing by the door, taking shelter from the rain. When he invites her to come inside the shop, she at first refuses, but later gives in to Eiji's kindness. They become intimate friends and she slowly grows to depend on Eiji's sincerity and good heartedness. After rescuing her a following evening when she walks into the street and is nearly struck by traffic, Eiji himself inexplicably discovers the cold of winter that has saddled his heart all these years slowly melting away...  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shingo Katori Eji Shiomi Yuko Takeuchi Miou Shirato Susumu Terajima Kengo Shijo Yumiko Shaku Yuki Ono Yuki Yagi Shizuku Shimoi Full Cast & Crew Last Season Season 1 2008 | 11 Episodes Season 1 of Flower Shop Without a Rose premiered on January 14, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Flower Shop Without a Rose. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Flower Shop Without a Rose. You can help by rating TV shows you've seen. Facts Original Name  薔薇のない花屋 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://wwwz.fujitv.co.jp/rose Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 22 Elizabeth Jennings t 6 taxigps A 4 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}