{"link": "https://www.themoviedb.org/tv/57736?language=en", "title": "The Musketeers", "resume": "Set in 17th century Paris, musketeers Athos, Porthos, Aramis and D'Artagnan are members of an elite band of soldiers who fight for what is just. They are heroes in the truest and most abiding sense – men that can be trusted and believed in to do the right thing, regardless of personal risk.", "rate": 66, "genre": ["Drama", "Action", "Adventure"], "cast": ["Luke Pasqualino", "Santiago Cabrera", "Tom Burke", "Howard Charles", "Ryan Gage"], "character": ["D'Artagnan", "Aramis", "Athos", "Porthos", "King Louis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57736   Expand The Musketeers   (2014) User Score  Play Trailer Overview Set in 17th century Paris, musketeers Athos, Porthos, Aramis and D'Artagnan are members of an elite band of soldiers who fight for what is just. They are heroes in the truest and most abiding sense – men that can be trusted and believed in to do the right thing, regardless of personal risk. Featured Crew Adrian Hodges Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  33 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Pasqualino D'Artagnan Santiago Cabrera Aramis Tom Burke Athos Howard Charles Porthos Ryan Gage King Louis Full Cast & Crew Last Season Season 3 2016 | 10 Episodes Season 3 of The Musketeers premiered on May 28, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  33 Posters  7 Recommendations   2014-06-29 Reckless 5.5    2013-07-04 Free! 6.4    2014-01-29 Fleming 6.3    2013-04-30 Inside Amy Schumer 5.4    1999-10-06 Roswell 7.0    2013-08-22 Crossing Lines 6.8    2016-10-16 Eyewitness 7.4    2014-01-07 Intelligence 6.3  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b04ww8fq Genres Drama Action & Adventure Keywords france musketeer period drama historical drama 17th century Content Score 100 Yes! Looking good! Top Contributors 87 Elizabeth Jennings 16 Banana 7 acamposxp 7 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}