{"link": "https://www.themoviedb.org/tv/54985?language=en", "title": "Poliisit", "resume": "Poliisit on suomalainen Aito Median tuottama dokumentaarinen televisiosarja, jota esitetään Jim-kanavalla. Ohjelma kuvaa todellista poliisin työtä ja sitä, mitä poliisipartio saa työssään kohdata Suomen suurimmissa kaupungeissa. Sarja toteutetaan yhteistyössä sisäasiainministeriön poliisiosaston kanssa. Sarjan ensiesitys 26. tammikuuta 2009 rikkoi 247 000 katsojallaan Jimin katsojaennätyksen. Poliisit on myös Nelonen Median netti-tv:n katsotuimpia ohjelmia. Muita suomalaisia poliisin toimintaan liittyviä televisiosarjoja ovat Subin Lainvalvojat ja Yle TV2:n Poliisi-TV.\nSarjan ohjelmaformaatti myytiin Yhdysvaltoihin keväällä 2010. Aito Media Oy solmi sopimuksen Scott Sternberg -tuotantoyhtiön ja Weinberger Median kanssa. Sopimus solmittiin Scott Sternbergin kanssa Cannesissa järjestettävillä MIPTV-messuilla.", "rate": 62, "genre": ["Reality", "Crime"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54985   Expand Poliisit User Score Overview Poliisit on suomalainen Aito Median tuottama dokumentaarinen televisiosarja, jota esitetään Jim-kanavalla. Ohjelma kuvaa todellista poliisin työtä ja sitä, mitä poliisipartio saa työssään kohdata Suomen suurimmissa kaupungeissa. Sarja toteutetaan yhteistyössä sisäasiainministeriön poliisiosaston kanssa. Sarjan ensiesitys 26. tammikuuta 2009 rikkoi 247 000 katsojallaan Jimin katsojaennätyksen. Poliisit on myös Nelonen Median netti-tv:n katsotuimpia ohjelmia. Muita suomalaisia poliisin toimintaan liittyviä televisiosarjoja ovat Subin Lainvalvojat ja Yle TV2:n Poliisi-TV. Sarjan ohjelmaformaatti myytiin Yhdysvaltoihin keväällä 2010. Aito Media Oy solmi sopimuksen Scott Sternberg -tuotantoyhtiön ja Weinberger Median kanssa. Sopimus solmittiin Scott Sternbergin kanssa Cannesissa järjestettävillä MIPTV-messuilla. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 8 2016 | 22 Episodes Season 8 of Poliisit premiered on January 11, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  Finnish Runtime  22m Homepage   http://www.jimtv.fi/poliisit Genres Reality Crime Keywords police finland Content Score 50 Still needs a little work. Top Contributors 25 Petja Touru 3 ressu b 1 bowen4514@gmail.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}