{"link": "https://www.themoviedb.org/tv/31920?language=en", "title": "The Buried Life", "resume": "The Buried Life is a reality documentary series on MTV. The series features Duncan Penn, Jonnie Penn, Ben Nemtin, and Dave Lingwood attempting to complete a list of \"100 things to do before you die.\" The pilot episode aired on January 18, 2010, and the show was renewed for a second season in 2010. On Oct 25, 2011, The Buried Life announced they wouldn't be doing any more episodes of the show. However, the show's creators claim they are working on a \"new and improved\" show for the network based on the premise of the original series. Penn, Lingwood, Penn and Nemtin released their first book as The Buried Life, \"What Do You Want to Do Before You Die?\" on March 27, 2012. On the week of its release the book climbed to #1 on the NYT Best Sellers List.", "rate": 0, "genre": ["Comedy", "Documentary"], "cast": ["Sarah Silverman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31920   Expand The Buried Life   (2010) User Score Overview The Buried Life is a reality documentary series on MTV. The series features Duncan Penn, Jonnie Penn, Ben Nemtin, and Dave Lingwood attempting to complete a list of \"100 things to do before you die.\" The pilot episode aired on January 18, 2010, and the show was renewed for a second season in 2010. On Oct 25, 2011, The Buried Life announced they wouldn't be doing any more episodes of the show. However, the show's creators claim they are working on a \"new and improved\" show for the network based on the premise of the original series. Penn, Lingwood, Penn and Nemtin released their first book as The Buried Life, \"What Do You Want to Do Before You Die?\" on March 27, 2012. On the week of its release the book climbed to #1 on the NYT Best Sellers List. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Silverman Full Cast & Crew Last Season Season 2 2010 | 10 Episodes Season 2 of The Buried Life premiered on September 27, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Buried Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.mtv.com/shows/buried_life/series.jhtml Genres Comedy Documentary Keywords male friendship travel bucket list Content Score 56 We're so close, yet so far. Top Contributors 17 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}