{"link": "https://www.themoviedb.org/tv/217?language=en", "title": "Inside the Actors Studio", "resume": "James Lipton sits down with some of the world's most accomplished actors and directors for penetrating, fascinating interviews.", "rate": 76, "genre": ["Talk"], "cast": ["James Lipton"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 217   Expand Inside the Actors Studio   (1994) User Score Overview James Lipton sits down with some of the world's most accomplished actors and directors for penetrating, fascinating interviews. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Lipton Himself - Host Full Cast & Crew Last Season Season 22 2016 | 4 Episodes Season 22 of Inside the Actors Studio premiered on December 21, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2006-08-07 Gene Simmons Family Jewels 4.4    2002-01-23 That '80s Show 3.7    1963-09-29 The Judy Garland Show 5.0    1995-09-16 Brotherly Love 6.3    1952-12-05 The Abbott and Costello Show 5.6    1966-09-08 Tarzan 5.5    2003-12-03 Extreme Makeover: Home Edition 4.6    2005-01-03 The Late Late Show with Craig Ferguson 7.5  Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  60m Homepage   http://www.bravotv.com/inside-the-actors-studio Genres Talk Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 17 Elizabeth Jennings TB 4 TMDb Bot 3 Zlogorek D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}