{"link": "https://www.themoviedb.org/tv/80010?language=en", "title": "Flower and The Beast", "resume": "Kumi (Yurika Nakamura) is a transfer student at a prestigious high school. She meets Hyo (Yosuke Sugino) who is handsome and kind. Kumi falls in love with him and has her first kiss with him, but Hyo is famous for being a womanizer at school. After she discovers his true side, she gets hurts, but her feelings for him doesn't go away.", "rate": 0, "genre": [], "cast": ["Yurika Nakamura", "Yosuke Sugino", "Anna Iriyama", "Shouma Kai", "Matsuo Takahashi"], "character": ["Kumakura Kumi", "Kakizono Hyo", "Ogami Kanna", "Hiyoshi Tatsuki", "Izumi Chihaya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80010   Expand Flower and The Beast   (2017) User Score Overview Kumi (Yurika Nakamura) is a transfer student at a prestigious high school. She meets Hyo (Yosuke Sugino) who is handsome and kind. Kumi falls in love with him and has her first kiss with him, but Hyo is famous for being a womanizer at school. After she discovers his true side, she gets hurts, but her feelings for him doesn't go away. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yurika Nakamura Kumakura Kumi Yosuke Sugino Kakizono Hyo Anna Iriyama Ogami Kanna Shouma Kai Hiyoshi Tatsuki Matsuo Takahashi Izumi Chihaya Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Flower and The Beast premiered on October 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Flower and The Beast. You can help by rating TV shows you've seen. Facts Original Name  花にけだもの Status  Ended Network dTV Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres No genres have been added. Keywords romance school Content Score 79 Pump it up! We're close now. Top Contributors 18 galactica_j z 9 zetobelt 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}