{"link": "https://www.themoviedb.org/tv/9550?language=en", "title": "Ultimate Muscle", "resume": "Ultimate Muscle: The Kinnikuman Legacy, known in Japan as Kinnikuman II sei, is a manga and anime series made by Yoshinori Nakai and Takashi Shimada under the pen name Yudetamago. It is the sequel to the hit manga Kinnikuman that they started in 1979. The toy line of Kinnikuman was released in North America as M.U.S.C.L.E.. The name of Ultimate Muscle was chosen to connect the Americanized storyline of the M.U.S.C.L.E. toyline of the 1980s into the anime. Bandai also produced intermittently distributed toy tie-ins during the initial run of Ultimate Muscle.", "rate": 0, "genre": ["Animation"], "cast": ["Konami Yoshida", "Masaya Onosaka", "Toshiyuki Morikawa", "Takumi Yamazaki", "Yasunori Masutani"], "character": ["Alexandria Meat", "Mantaro Muscle", "Terry the Kid", "Seiuchin", "Gazelleman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9550   Expand Ultimate Muscle   (2002) User Score Overview Ultimate Muscle: The Kinnikuman Legacy, known in Japan as Kinnikuman II sei, is a manga and anime series made by Yoshinori Nakai and Takashi Shimada under the pen name Yudetamago. It is the sequel to the hit manga Kinnikuman that they started in 1979. The toy line of Kinnikuman was released in North America as M.U.S.C.L.E.. The name of Ultimate Muscle was chosen to connect the Americanized storyline of the M.U.S.C.L.E. toyline of the 1980s into the anime. Bandai also produced intermittently distributed toy tie-ins during the initial run of Ultimate Muscle. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Konami Yoshida Alexandria Meat Masaya Onosaka Mantaro Muscle Toshiyuki Morikawa Terry the Kid Takumi Yamazaki Seiuchin Yasunori Masutani Gazelleman Full Cast & Crew Last Season Season 3 2003 | 26 Episodes Season 3 of Ultimate Muscle premiered on October 18, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ultimate Muscle. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}