{"link": "https://www.themoviedb.org/tv/75939?language=en", "title": "The Sinner", "resume": "When Vlad was five his mother was killed. And the only person whom Vlad blames for her death is his father . On the 20th anniversary of the tragedy the young man decides to gather all his relatives together to dot all the i's and cross all the t's. But at some point Vlad finds out many facts which totally change his life.", "rate": 100, "genre": ["Drama"], "cast": ["Evgeny Antropov", "Andrey Smolyakov", "Lyubov Aksyonova", "Dmitriy Kulichkov", "Darya Ursulyak"], "character": ["Vlad", "Viktor Mikhailovich (Vlad's father)", "Mariyana", "Pavel Nikitin (uncle of Vlad)", "Yulia Nikitina (daughter of Pavel)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75939   Expand The Sinner   (2014) User Score Overview When Vlad was five his mother was killed. And the only person whom Vlad blames for her death is his father . On the 20th anniversary of the tragedy the young man decides to gather all his relatives together to dot all the i's and cross all the t's. But at some point Vlad finds out many facts which totally change his life. Featured Crew Dmitriy Konstantinov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Evgeny Antropov Vlad Andrey Smolyakov Viktor Mikhailovich (Vlad's father) Lyubov Aksyonova Mariyana Dmitriy Kulichkov Pavel Nikitin (uncle of Vlad) Darya Ursulyak Yulia Nikitina (daughter of Pavel) Full Cast & Crew Last Season Season 1 2014 | 2 Episodes Season 1 of The Sinner premiered on September  9, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Sinner. You can help by rating TV shows you've seen. Facts Original Name  Грешник Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Miniseries Original Language  Russian Runtime  88m Homepage   http://marsme.ru/ru/project-greshnik Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 56 zoroman2017 3 Mark Gubarenko TB 2 TMDb Bot 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}