{"link": "https://www.themoviedb.org/tv/17753?language=en", "title": "Skärgårdsdoktorn", "resume": "Skärgårdsdoktorn was a Swedish television series produced by SVT Drama. The series ran from 1997 to 2000 and a total of 18 episodes were produced. In English, the title could be translated as The archipelago doctor, and it came to be one of the most popular Swedish TV series of the 90s, and with its average viewership of approximately 2.5 million it is considered one of the greatest successes of SVT Drama. Created by Lars Bill Lundholm and Gunilla Linn Persson, the first 8 episodes were directed by Martin Asphaug. The series was also broadcast in Norway, Finland and Denmark.\nIn May 2009, the plans to produce a cinema feature film of Skärgårdsdoktorn were announced. Featuring the same characters ten years after, the estimated release date is Christmas 2010, or possibly January or February 2011.", "rate": 0, "genre": ["Drama"], "cast": ["Samuel Fröler", "Sten Ljunggren", "Ebba Hultkvist", "Helena Brodin", "Göran Engman"], "character": ["Johan Steen", "Axel Holtman", "Wilma Steen", "Syster Berit", "Sören Rapp"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17753   Expand Skärgårdsdoktorn   (1997) User Score Overview Skärgårdsdoktorn was a Swedish television series produced by SVT Drama. The series ran from 1997 to 2000 and a total of 18 episodes were produced. In English, the title could be translated as The archipelago doctor, and it came to be one of the most popular Swedish TV series of the 90s, and with its average viewership of approximately 2.5 million it is considered one of the greatest successes of SVT Drama. Created by Lars Bill Lundholm and Gunilla Linn Persson, the first 8 episodes were directed by Martin Asphaug. The series was also broadcast in Norway, Finland and Denmark. In May 2009, the plans to produce a cinema feature film of Skärgårdsdoktorn were announced. Featuring the same characters ten years after, the estimated release date is Christmas 2010, or possibly January or February 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samuel Fröler Johan Steen Sten Ljunggren Axel Holtman Ebba Hultkvist Wilma Steen Helena Brodin Syster Berit Göran Engman Sören Rapp Full Cast & Crew Last Season Season 3 2000 | 6 Episodes Season 3 of Skärgårdsdoktorn premiered on April  3, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Skärgårdsdoktorn. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Swedish Runtime  53m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 thedarer VA 5 Viktor Andersson A 3 Antte87 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}