{"link": "https://www.themoviedb.org/tv/60685?language=en", "title": "Dominion", "resume": "Dominion is an epic supernatural drama set in the near future. Specifically, 25 years after \"The Extinction War,\" when an army of lower angels, assembled by the archangel Gabriel, waged war against mankind. The archangel Michael, turning against his own kind, chose to side with humanity. Rising out of the ashes of this long battle are newly fortified cities which protect human survivors. At the center of the series is the city of Vega, a glistening empire that has formed from the ruins of what was once Las Vegas.", "rate": 61, "genre": ["Sci-Fi", "Fantasy", "Action", "Drama"], "cast": ["Christopher Egan", "Tom Wisdom", "Roxanne McKee", "Alan Dale", "Anthony Stewart Head"], "character": ["Alex Lannen", "Michael", "Claire Rysen", "General Rysen", "David Weel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60685   Expand Dominion   (2014) User Score  Play Trailer Overview Dominion is an epic supernatural drama set in the near future. Specifically, 25 years after \"The Extinction War,\" when an army of lower angels, assembled by the archangel Gabriel, waged war against mankind. The archangel Michael, turning against his own kind, chose to side with humanity. Rising out of the ashes of this long battle are newly fortified cities which protect human survivors. At the center of the series is the city of Vega, a glistening empire that has formed from the ruins of what was once Las Vegas.  Featured Crew Scott Stewart Creator Vaun Wilmott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  12 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Egan Alex Lannen Tom Wisdom Michael Roxanne McKee Claire Rysen Alan Dale General Rysen Anthony Stewart Head David Weel Full Cast & Crew Last Season Season 2 2015 | 13 Episodes Season 2 of Dominion premiered on July  9, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Dominion. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  6 Recommendations   2013-04-15 Defiance 6.2    2014-07-09 Extant 6.1    2015-06-01 The Whispers 5.7    2014-01-10 Helix 6.4    2013-11-17 Almost Human 7.0    2011-06-19 Falling Skies 6.4    2014-10-24 Constantine 7.2    2012-05-27 Continuum 7.1  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.syfy.com/dominion Genres Sci-Fi & Fantasy Action Drama Keywords future angel supernatural archangel gabriel apocalypse biblical prophecy based on movie Content Score 100 Yes! Looking good! Top Contributors 56 Elizabeth Jennings 39 Travis Bell t 9 taces2 8 benf45  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}