{"link": "https://www.themoviedb.org/tv/38132?language=en", "title": "Three Inches", "resume": "Three Inches is an American action with science fiction made-for-television film, intended to serve as the pilot episode for a new series. Created by writer-producer Harley Peyton and directed by Jace Alexander it aired on Syfy on December 29, 2011. The show follows a group of people with superhuman abilities, focusing on Walter Spackman, played by Noah Reid, an underachiever who develops a telekinetic ability after being struck by lightning.\nThe movie received favorable reviews, however, there is no information about making a TV series.", "rate": 53, "genre": [], "cast": ["Stephanie Jacobsen", "Andrea Martin", "Brandon Jay McLaren", "Noah Reid", "James Marsters"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38132   Expand Three Inches   (2011) User Score Overview Three Inches is an American action with science fiction made-for-television film, intended to serve as the pilot episode for a new series. Created by writer-producer Harley Peyton and directed by Jace Alexander it aired on Syfy on December 29, 2011. The show follows a group of people with superhuman abilities, focusing on Walter Spackman, played by Noah Reid, an underachiever who develops a telekinetic ability after being struck by lightning. The movie received favorable reviews, however, there is no information about making a TV series. Featured Crew Harley Peyton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stephanie Jacobsen Andrea Martin Brandon Jay McLaren Noah Reid James Marsters Full Cast & Crew Last Season Season 1 2011 | 1 Episode Season 1 of Three Inches premiered on December 29, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Three Inches. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 90m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors p 3 pppetrenko  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}