{"link": "https://www.themoviedb.org/tv/61406?language=en", "title": "Transparent", "resume": "An LA family with serious boundary issues have their past and future unravel when a dramatic admission causes everyone's secrets to spill out.", "rate": 67, "genre": ["Comedy", "Drama"], "cast": ["Jeffrey Tambor", "Gaby Hoffmann", "Amy Landecker", "Judith Light", "Jay Duplass"], "character": ["Maura Pfefferman", "Ali Pfefferman", "Sarah Pfefferman", "Shelly Pfefferman", "Josh Pfefferman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61406   Expand Transparent   (2014) User Score Overview An LA family with serious boundary issues have their past and future unravel when a dramatic admission causes everyone's secrets to spill out. Featured Crew Jill Soloway Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  14 Posters  21 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeffrey Tambor Maura Pfefferman Gaby Hoffmann Ali Pfefferman Amy Landecker Sarah Pfefferman Judith Light Shelly Pfefferman Jay Duplass Josh Pfefferman Full Cast & Crew Last Season Season 4 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply great show! Open 1 by  Satai Delenn Go to Discussions Media Most Popular Videos  0 Backdrops  14 Posters  21 Recommendations   2015-01-11 Togetherness 6.0    2015-01-19 Catastrophe 7.3    Decker 4.8    2015-08-05 Difficult People 7.4    2003-06-29 Fortysomething 7.4    2016-08-18 I Love Dick 5.2    2014-01-22 Broad City 7.6    2010-06-29 Louie 7.7  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   https://www.amazon.com/dp/B00I3MPZUW Genres Comedy Drama Keywords family drama los angeles lgbt trans woman Content Score 100 Yes! Looking good! Top Contributors 53 Elizabeth Jennings 41 Banana t 12 tmdb64845936 a 10 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}