{"link": "https://www.themoviedb.org/tv/11460?language=en", "title": "No Place Like Home", "resume": "No Place Like Home is a BBC situation comedy written by Jon Watkins and stars William Gaunt and Patricia Garwood as Arthur and Beryl Crabtree, a middle-aged couple who plan for a quiet life once their children have left home. Sadly, it is not to be.\nNo Place Like Home was broadcast for five series between 1983 and 1987, with an early appearance by Martin Clunes.", "rate": 70, "genre": ["Comedy"], "cast": ["Martin Clunes", "William Gaunt", "Beverly Adams", "Marcia Warren", "Daniel Hill"], "character": ["Nigel Crabtree"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11460   Expand No Place Like Home   (1983) User Score Overview No Place Like Home is a BBC situation comedy written by Jon Watkins and stars William Gaunt and Patricia Garwood as Arthur and Beryl Crabtree, a middle-aged couple who plan for a quiet life once their children have left home. Sadly, it is not to be. No Place Like Home was broadcast for five series between 1983 and 1987, with an early appearance by Martin Clunes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Clunes Nigel Crabtree William Gaunt Beverly Adams Marcia Warren Daniel Hill Full Cast & Crew Last Season Season 5 1987 | 8 Episodes Season 5 of No Place Like Home premiered on September  8, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on No Place Like Home. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords family sitcom british humour Content Score 86 Almost there... Top Contributors O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}