{"link": "https://www.themoviedb.org/tv/46975?language=en", "title": "Crossing Lines", "resume": "Through globalization, many countries have been opened and barriers removed to ensure easy trade, travel and cultural diversity. However, this openness has given opportunities to criminals looking to exploit the system and ultimately threaten our global safety. As Europe has become a \"safe house\" for criminals eluding law enforcers, a special kind of law enforcement team is needed to handle specific ongoing crimes on a global level. \"Crossing Lines\" is the story of one such team, made up of five international cops, headed by Captain Daniel. The team - comprised of individuals who have little in common - must learn to live and work under the most dangerous and potentially deadly conditions. Housed in an unused storage section underneath the ICC, this mismatched team faces bureaucratic, jurisdictional and cultural obstacles while traversing continents in pursuit of justice.", "rate": 68, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Tom Wlaschiha", "Donald Sutherland", "Lara Rossi", "Goran Visnjic", "Elizabeth Mitchell"], "character": ["Sebastian Berger", "Michael Dorn", "Arabela Seeger", "Marco Costante", "Carine Strand"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46975   Expand Crossing Lines   (2013) User Score  Play Trailer Overview Through globalization, many countries have been opened and barriers removed to ensure easy trade, travel and cultural diversity. However, this openness has given opportunities to criminals looking to exploit the system and ultimately threaten our global safety. As Europe has become a \"safe house\" for criminals eluding law enforcers, a special kind of law enforcement team is needed to handle specific ongoing crimes on a global level. \"Crossing Lines\" is the story of one such team, made up of five international cops, headed by Captain Daniel. The team - comprised of individuals who have little in common - must learn to live and work under the most dangerous and potentially deadly conditions. Housed in an unused storage section underneath the ICC, this mismatched team faces bureaucratic, jurisdictional and cultural obstacles while traversing continents in pursuit of justice. Featured Crew Rola Bauer Creator Edward Allen Bernero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Wlaschiha Sebastian Berger Donald Sutherland Michael Dorn Lara Rossi Arabela Seeger Goran Visnjic Marco Costante Elizabeth Mitchell Carine Strand Full Cast & Crew Last Season Season 3 2015 | 12 Episodes Season 3 of Crossing Lines premiered on September 30, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  5 Recommendations   2014-04-20 Filthy Riches 6.7    2007-05-17 Embarrassing Bodies 6.8    2016-09-22 Paranoid 6.4    2008-10-12 Stephen Fry in America 8.0    2014-10-06 Strange Empire 6.2    1997-11-24 Breaking the Magician's Code: Magic's Biggest Secrets Finally Revealed 7.6    2012-09-04 Highway Thru Hell 7.0    2011-03-29 Body of Proof 6.7  Facts Status  Cancelled Networks Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.nbc.com/crossing-lines Genres Action & Adventure Crime Drama Keywords police detective investigation europe crime drugs crime investigation european union international crime effects from the past Content Score 100 Yes! Looking good! Top Contributors 30 Banana S 30 Samara 21 Elizabeth Jennings 13 david8s95  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}