{"link": "https://www.themoviedb.org/tv/43384?language=en", "title": "DNA²", "resume": "DNA² is a science fiction manga series written and illustrated by Masakazu Katsura. It was serialized across Shueisha's Weekly Shōnen Jump magazine between 1993 and 1994, spanning a total of five tankōbon volumes.\nDNA² was adapted into a 12-episode anime television series which ran on Nippon Television from October 7, 1994 to December 23, 1994. This was followed by a three-episode anime original video animation in 1995. Produced by Madhouse and Studio Deen, the anime series was directed by Jun'ichi Sakata, whereas the character designer and animation director for the series was Kumiko Takahashi. DNA² has been broadcast in Japan by Animax, which has also aired the series across its respective networks worldwide, including its English-language networks in Southeast Asia and South Asia. All 15 episodes were licensed in North America by Central Park Media until their closing in 2009. The five volumes and box set are out-of-print.", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Keiichi Nanba", "Miina Tominaga", "Hiroko Kasahara", "Megumi Hayashibara"], "character": ["Junta Momonari", "Karin Aoi", "Ami Kurimoto", "Tomoko Saeki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43384   Expand DNA²   (1994) User Score Overview DNA² is a science fiction manga series written and illustrated by Masakazu Katsura. It was serialized across Shueisha's Weekly Shōnen Jump magazine between 1993 and 1994, spanning a total of five tankōbon volumes. DNA² was adapted into a 12-episode anime television series which ran on Nippon Television from October 7, 1994 to December 23, 1994. This was followed by a three-episode anime original video animation in 1995. Produced by Madhouse and Studio Deen, the anime series was directed by Jun'ichi Sakata, whereas the character designer and animation director for the series was Kumiko Takahashi. DNA² has been broadcast in Japan by Animax, which has also aired the series across its respective networks worldwide, including its English-language networks in Southeast Asia and South Asia. All 15 episodes were licensed in North America by Central Park Media until their closing in 2009. The five volumes and box set are out-of-print. Featured Crew Masakazu Katsura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keiichi Nanba Junta Momonari Miina Tominaga Karin Aoi Hiroko Kasahara Ami Kurimoto Megumi Hayashibara Tomoko Saeki Full Cast & Crew Last Season Season 1 1994 | 12 Episodes Season 1 of DNA² premiered on October  7, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on DNA². You can help by rating TV shows you've seen. Facts Original Name  D・N・A² ～何処かで失くしたあいつのアイツ～ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Keywords future dna time travel anime Content Score 93 Almost there... Top Contributors 25 Erwin D. Glockner j 8 jafichan A 5 Axiobyte 5 Renato  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}