{"link": "https://www.themoviedb.org/tv/72766?language=en", "title": "Amelia Earhart: The Lost Evidence", "resume": "Former FBI official Shawn Henry investigates new, shocking evidence that aviator Amelia Earhart was captured by the Japanese military, including a photograph that purports to show Earhart and navigator Fred Noonan alive after their disappearance. Evidence includes documents containing new information indicating that the U.S. government knew that she was in the custody of a foreign power, and may have covered it up.", "rate": 80, "genre": ["Documentary"], "cast": ["Mike New"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72766   Expand Amelia Earhart: The Lost Evidence   (2017) User Score Overview Former FBI official Shawn Henry investigates new, shocking evidence that aviator Amelia Earhart was captured by the Japanese military, including a photograph that purports to show Earhart and navigator Fred Noonan alive after their disappearance. Evidence includes documents containing new information indicating that the U.S. government knew that she was in the custody of a foreign power, and may have covered it up. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike New Narrator Full Cast & Crew Last Season Season 0 2017 | 1 Episode Season 1 of Amelia Earhart: The Lost Evidence premiered on July  9, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply t photograph as been debunked Open 3 by  Kewl Kat Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Amelia Earhart: The Lost Evidence. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  84m Homepage  - Genres Documentary Keywords amelia earhart the lost evidence Content Score 43 There's no 'I' in team... Top Contributors 13 Zipster79 11 Ryan Bradley TB 2 TMDb Bot OS 1 O Sage One  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}