{"link": "https://www.themoviedb.org/tv/25504?language=en", "title": "After War Gundam X", "resume": "Taking place 15 years after the 7th Space War, the surviving 98 million residents of Earth try to make a living as best they can in the post apocalyptic landscape. Mobile Suits and weapons left over from the war fall into the hands of civilians as well as other organizations on the planet. In an effort to keep the past from repeating itself, Jamil Neate brings together a crew of Vultures to search for Newtypes and protect them from being exploited. As they try to carry out this task, an old government rises from the ashes to try and unify the Earth as other forces slowly fan the flames of war once more between the newly formed New United Nations Earth and the Space Revolutionary Army. Now the crew of the Freeden face a multitude of enemies as they try to prevent another catastrophic war.", "rate": 0, "genre": ["Animation", "War", "Sci-Fi", "Fantasy"], "cast": ["Wataru Takagi", "Takumi Yamazaki", "Toshiyuki Morikawa", "Kazuya Nakai", "Chieko Honda"], "character": ["Garrod Ran", "Roybea Loy", "Shagia Frost", "Witz Sou", "Ennil El"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25504   Expand After War Gundam X   (1996) User Score Overview Taking place 15 years after the 7th Space War, the surviving 98 million residents of Earth try to make a living as best they can in the post apocalyptic landscape. Mobile Suits and weapons left over from the war fall into the hands of civilians as well as other organizations on the planet. In an effort to keep the past from repeating itself, Jamil Neate brings together a crew of Vultures to search for Newtypes and protect them from being exploited. As they try to carry out this task, an old government rises from the ashes to try and unify the Earth as other forces slowly fan the flames of war once more between the newly formed New United Nations Earth and the Space Revolutionary Army. Now the crew of the Freeden face a multitude of enemies as they try to prevent another catastrophic war. Featured Crew Hiroyuki Kawasaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wataru Takagi Garrod Ran Takumi Yamazaki Roybea Loy Toshiyuki Morikawa Shagia Frost Kazuya Nakai Witz Sou Chieko Honda Ennil El Full Cast & Crew Last Season After War Gundam X 1996 | 39 Episodes Season 1 of After War Gundam X premiered on April  5, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on After War Gundam X. You can help by rating TV shows you've seen. Facts Original Name  機動新世紀ガンダムＸ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation War Sci-Fi & Fantasy Keywords mecha Content Score 93 Almost there... Top Contributors 40 Irresponsibletyler h 17 heeroyuy176 8 Banana t 6 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}