{"link": "https://www.themoviedb.org/tv/4598?language=en", "title": "Boston Legal", "resume": "Boston Legal is an American legal dramedy created by David E. Kelley and produced in association with 20th Century Fox Television for ABC. The series aired from October 3, 2004, to December 8, 2008.\nBoston Legal is a spin-off of long-running Kelley series The Practice, following the exploits of former Practice character Alan Shore at the legal firm of Crane, Poole & Schmidt.", "rate": 78, "genre": ["Comedy", "Drama"], "cast": ["James Spader", "William Shatner", "Candice Bergen", "John Larroquette", "Tara Summers"], "character": ["Alan Shore", "Denny Crane", "Shirley Schmidt", "Carl Sack", "Katie Lloyd"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4598   Expand Boston Legal   (2004) User Score  Play Trailer Overview Boston Legal is an American legal dramedy created by David E. Kelley and produced in association with 20th Century Fox Television for ABC. The series aired from October 3, 2004, to December 8, 2008. Boston Legal is a spin-off of long-running Kelley series The Practice, following the exploits of former Practice character Alan Shore at the legal firm of Crane, Poole & Schmidt. Featured Crew David E. Kelley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Spader Alan Shore William Shatner Denny Crane Candice Bergen Shirley Schmidt John Larroquette Carl Sack Tara Summers Katie Lloyd Full Cast & Crew Last Season Season 5 2008 | 13 Episodes Season 5 of Boston Legal premiered on September 22, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  14 Posters  8 Recommendations   1996-09-17 Spin City 7.0    1997-09-08 Ally McBeal 5.9    1999-09-22 The West Wing 7.9    1996-01-09 3rd Rock from the Sun 7.3    2006-03-05 Numb3rs 6.5    2009-01-21 Lie to Me 7.4    2002-09-23 CSI: Miami 5.8    2007-06-28 Burn Notice 7.3  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  42m Homepage  - Genres Comedy Drama Keywords boston lawyer spin off law firm Content Score 100 Yes! Looking good! Top Contributors 55 SuperMario 24 Elizabeth Jennings 10 Banana Z 5 Zerstin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}