{"link": "https://www.themoviedb.org/tv/33257?language=en", "title": "Desafio", "resume": "Desafío is a reality show in which a number of participants should survive, live together, and compete in 4 different stages, for a big price in money. These contestants are grouped into three teams according to the theme chosen in each season. Social classes, generations, regions of the country and the degree of popularity are the elements used to give identity to these groups. Another one of the characteristics of the Challenge and which encloses the success of this format is that the conditions of life in this competition are not fair. While a group spends its day in a beach house with servants, exquisite delicacies (High Beach), the other group suffers the complete lack of accommodation and food (Low Beach). In this reality, as in real life, the teams would be able to exceed or fall on their comfort levels, depending on the performance in the territorial Challenges.", "rate": 66, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33257   Expand Desafio   (2004) User Score  Play Trailer Overview Desafío is a reality show in which a number of participants should survive, live together, and compete in 4 different stages, for a big price in money. These contestants are grouped into three teams according to the theme chosen in each season. Social classes, generations, regions of the country and the degree of popularity are the elements used to give identity to these groups. Another one of the characteristics of the Challenge and which encloses the success of this format is that the conditions of life in this competition are not fair. While a group spends its day in a beach house with servants, exquisite delicacies (High Beach), the other group suffers the complete lack of accommodation and food (Low Beach). In this reality, as in real life, the teams would be able to exceed or fall on their comfort levels, depending on the performance in the territorial Challenges. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Desafío Súper Humanos 2016 | 17 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Desafio. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.desafio.caracoltv.com/ Genres Reality Keywords game show challenge reality competition physical condition Content Score 64 We're so close, yet so far. Top Contributors I 177 Ijrj z 5 zurman1 4 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}