{"link": "https://www.themoviedb.org/tv/35398?language=en", "title": "Crystal Empire", "resume": "Imperio de Cristal is a Mexican telenovela that aired on Televisa in 1994 with 124-episode from the plot to the main cast it was officially first launched on Monday, 29 August 1994 & ceased transmission on Friday, 17 February 1995 was aired runtime of 45-minutes with commercial on weekday at 21:00 to 22:00 CST/22:00 to 23:00 MST/23:00 to 00:00 PST.", "rate": 60, "genre": ["Drama"], "cast": ["Rebecca Jones", "Ari Telch", "Alejandro Camacho", "María Rubio", "Ignacio López Tarso"], "character": ["Sofía Vidal / Elena Terán de Vidal", "Julio Lombardo", "Augusto Lombardo", "Livia Arizmendi de Lombardo", "César Lombardo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35398   Expand Crystal Empire   (1994) User Score Overview Imperio de Cristal is a Mexican telenovela that aired on Televisa in 1994 with 124-episode from the plot to the main cast it was officially first launched on Monday, 29 August 1994 & ceased transmission on Friday, 17 February 1995 was aired runtime of 45-minutes with commercial on weekday at 21:00 to 22:00 CST/22:00 to 23:00 MST/23:00 to 00:00 PST. Featured Crew Rebecca Jones Creator Alejandro Camacho Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rebecca Jones Sofía Vidal / Elena Terán de Vidal Ari Telch Julio Lombardo Alejandro Camacho Augusto Lombardo María Rubio Livia Arizmendi de Lombardo Ignacio López Tarso César Lombardo Full Cast & Crew Last Season Season 1 1994 | 120 Episodes Season 1 of Crystal Empire premiered on August 29, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Crystal Empire. You can help by rating TV shows you've seen. Facts Original Name  Imperio de Cristal Status  Ended Network Certification 14 Meaning Content suitable for viewers over the age of 14. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors s 23 shiff7 18 Amanda L 14 Leah p 4 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}