{"link": "https://www.themoviedb.org/tv/15136?language=en", "title": "Unhitched", "resume": "A 35-year old guy who got married right out of college finds himself  newly divorced and ill-prepared to re-enter the dating scene.", "rate": 0, "genre": ["Comedy"], "cast": ["Rashida Jones", "Shaun Majumder", "Johnny Sneed", "Craig Bierko"], "character": ["Kate", "Freddy Sahgal", "Tommy Leegan", "Jack \"Gator\" Gately"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15136   Expand Unhitched   (2008) User Score Overview A 35-year old guy who got married right out of college finds himself  newly divorced and ill-prepared to re-enter the dating scene. Featured Crew Chris Pappas Creator Mike Bernier Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rashida Jones Kate Shaun Majumder Freddy Sahgal Johnny Sneed Tommy Leegan Craig Bierko Jack \"Gator\" Gately Full Cast & Crew Last Season Season 1 2008 | 6 Episodes Season 1 of Unhitched premiered on March  2, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Unhitched. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.fox.com/unhitched/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 25 United600 4 janar 4 lineker 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}