{"link": "https://www.themoviedb.org/tv/10516?language=en", "title": "Love, Sidney", "resume": "Love, Sidney is an American situation comedy which ran on NBC from October 28, 1981 until June 6, 1983. The series was based on a short story written by Marilyn Cantor Baker, which was subsequently adapted into a TV movie entitled Sidney Shorr: A Girl's Best Friend, which NBC aired on October 5, 1981, a few weeks before the series premiered. The premise involved a gay man and his relationship with a single mother and her five year-old daughter whom he invites to live with him. Tony Randall stars as Sidney Shorr, with Swoosie Kurtz as Laurie Morgan and Kaleena Kiff as her daughter Patti. The series was produced by Warner Bros. Television.\nLove, Sidney was the first program on American television to feature a gay character as the central lead, although for the series, Sidney's homosexuality was almost entirely downplayed from its subtle yet unmistakable presence in the two-hour pilot.", "rate": 0, "genre": ["Comedy"], "cast": ["Swoosie Kurtz", "Lynne Thigpen", "Tony Randall", "Chip Zien", "Alan North"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10516   Expand Love, Sidney   (1981) User Score Overview Love, Sidney is an American situation comedy which ran on NBC from October 28, 1981 until June 6, 1983. The series was based on a short story written by Marilyn Cantor Baker, which was subsequently adapted into a TV movie entitled Sidney Shorr: A Girl's Best Friend, which NBC aired on October 5, 1981, a few weeks before the series premiered. The premise involved a gay man and his relationship with a single mother and her five year-old daughter whom he invites to live with him. Tony Randall stars as Sidney Shorr, with Swoosie Kurtz as Laurie Morgan and Kaleena Kiff as her daughter Patti. The series was produced by Warner Bros. Television. Love, Sidney was the first program on American television to feature a gay character as the central lead, although for the series, Sidney's homosexuality was almost entirely downplayed from its subtle yet unmistakable presence in the two-hour pilot. Featured Crew Oliver Hailey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Swoosie Kurtz Lynne Thigpen Tony Randall Chip Zien Alan North Full Cast & Crew Last Season Season 2 1982 | 24 Episodes Season 2 of Love, Sidney premiered on September  8, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love, Sidney. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords new york single mother gay man sitcom Content Score 79 Pump it up! We're close now. Top Contributors 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}