{"link": "https://www.themoviedb.org/tv/7869?language=en", "title": "The Penguins of Madagascar", "resume": "The Penguins of Madagascar is an American CGI animated television series airing on Nickelodeon. It stars nine characters from the DreamWorks Animation animated film Madagascar: The penguins Skipper, Kowalski, Private, and Rico; the lemurs King Julien, Maurice, and Mort; and Mason and Phil the chimpanzees. Characters new to the series include Marlene the otter and a zookeeper named Alice. It is the first Nicktoon produced with DreamWorks Animation.\nA pilot episode, \"Gone in a Flash\", aired as part of \"Superstuffed Nicktoons Weekend\" on November 29, 2008, and The Penguins of Madagascar became a regular series on March 28, 2009. The series premiere drew 6.1 million viewers, setting a new record as the most-watched premiere.\nAlthough the series occasionally alludes to the rest of the franchise, The Penguins of Madagascar does not take place at a precise time within it. McGrath, who is also the co-creator of the film characters, has said that the series takes place \"not specifically before or after the movie, I just wanted them all back at the zoo. I think of it as taking place in a parallel universe.\"", "rate": 69, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7869   Expand The Penguins of Madagascar   (2009) User Score  Play Trailer Overview The Penguins of Madagascar is an American CGI animated television series airing on Nickelodeon. It stars nine characters from the DreamWorks Animation animated film Madagascar: The penguins Skipper, Kowalski, Private, and Rico; the lemurs King Julien, Maurice, and Mort; and Mason and Phil the chimpanzees. Characters new to the series include Marlene the otter and a zookeeper named Alice. It is the first Nicktoon produced with DreamWorks Animation. A pilot episode, \"Gone in a Flash\", aired as part of \"Superstuffed Nicktoons Weekend\" on November 29, 2008, and The Penguins of Madagascar became a regular series on March 28, 2009. The series premiere drew 6.1 million viewers, setting a new record as the most-watched premiere. Although the series occasionally alludes to the rest of the franchise, The Penguins of Madagascar does not take place at a precise time within it. McGrath, who is also the co-creator of the film characters, has said that the series takes place \"not specifically before or after the movie, I just wanted them all back at the zoo. I think of it as taking place in a parallel universe.\" Featured Crew Eric Darnell Creator Tom McGrath Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2012 | 33 Episodes Season 3 of The Penguins of Madagascar premiered on April 16, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Penguins of Madagascar. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2009-11-06 Fanboy and Chum Chum 2.0    2002-09-14 What's New, Scooby-Doo? 7.0    1990-09-08 The Tom & Jerry Kids Show 6.0    2010-10-02 Planet Sheen 3.7    2007-08-17 Phineas and Ferb 7.5    2003-08-23 Duck Dodgers 7.4    2001-03-30 The Fairly OddParents 6.7    2002-07-20 The Adventures of Jimmy Neutron: Boy Genius 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  11m, 10m, 12m Homepage   http://www.nick.com/shows/penguins-of-madagascar/index.jhtml Genres Animation Comedy Keywords penguin madagascar animation 3d Content Score 71 Just a little bit more... Top Contributors 15 Maikkoum 10 Elizabeth Jennings 6 sdanix M 6 Mariusz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}