{"link": "https://www.themoviedb.org/tv/39613?language=en", "title": "Vanguard", "resume": "Vanguard is a television documentary series broadcast on the Current TV television network. Vanguard reported on such issues as the environment, drugs and the effects of globalization and conflict.\nThe focus of most Vanguard episodes is to explore and immerse viewers in global issues that have a large social significance. Unlike sound-bite driven reporting, the show’s correspondents conduct interviews with affected peoples and the regions involved usually being led by a guide and translator who facilitates access. Since Vanguard's subject matter often involved exposés about organized crime, drug trafficking and armed revolts, the correspondents can face significant danger because of their reporting due to unstable political or security situations.\nVanguard has received some of the media industry’s highest honors for journalism, including the 69th Annual Peabody Award, given for excellence in electronic media, and the 2010 Television Academy Honor, which recognizes \"achievements in programming that present issues of concern to our society in a compelling, emotional and insightful way.\" Vanguard has also been awarded the 2009 Alfred I. duPont-Columbia Award and the 2009 Livingston Award and was nominated four times for a news and documentary Emmy and for a sports Emmy®.", "rate": 0, "genre": ["Documentary", "News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39613   Expand Vanguard   (2006) User Score Overview Vanguard is a television documentary series broadcast on the Current TV television network. Vanguard reported on such issues as the environment, drugs and the effects of globalization and conflict. The focus of most Vanguard episodes is to explore and immerse viewers in global issues that have a large social significance. Unlike sound-bite driven reporting, the show’s correspondents conduct interviews with affected peoples and the regions involved usually being led by a guide and translator who facilitates access. Since Vanguard's subject matter often involved exposés about organized crime, drug trafficking and armed revolts, the correspondents can face significant danger because of their reporting due to unstable political or security situations. Vanguard has received some of the media industry’s highest honors for journalism, including the 69th Annual Peabody Award, given for excellence in electronic media, and the 2010 Television Academy Honor, which recognizes \"achievements in programming that present issues of concern to our society in a compelling, emotional and insightful way.\" Vanguard has also been awarded the 2009 Alfred I. duPont-Columbia Award and the 2009 Livingston Award and was nominated four times for a news and documentary Emmy and for a sports Emmy®. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2011 | 14 Episodes Season 5 of Vanguard premiered on June 20, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Vanguard. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Current TV Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.current.com/shows/vanguard/ Genres Documentary News Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 1 Michael W 1 WaLLY  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}