{"link": "https://www.themoviedb.org/tv/73217?language=en", "title": "Pikotaro's Lullaby La La By", "resume": "Drawing inspiration from illustrations, Pikotaro does the unthinkable: three-minute, scriptless fairy tale anime. Pikotaro is presented with classics loved around the world, including The Little Match Girl and Little Red Riding-Hood. The mad genius who took the world by storm returns to bring you unique bedtime stories certain to rock you into absurd sleep.", "rate": 60, "genre": ["Comedy"], "cast": ["Kazuhito Kosaka"], "character": ["Pikotaro (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73217   Expand Pikotaro's Lullaby La La By   (2017) User Score Overview Drawing inspiration from illustrations, Pikotaro does the unthinkable: three-minute, scriptless fairy tale anime. Pikotaro is presented with classics loved around the world, including The Little Match Girl and Little Red Riding-Hood. The mad genius who took the world by storm returns to bring you unique bedtime stories certain to rock you into absurd sleep. Featured Crew Kazuhito Kosaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Kazuhito Kosaka Pikotaro (voice) Full Cast & Crew Last Season Season 1 2017 | 9 Episodes Season 1 of Pikotaro's Lullaby La La By premiered on August  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pikotaro's Lullaby La La By. You can help by rating TV shows you've seen. Facts Original Name  ピコ太郎のララバイラーラバイ Status  Ended Networks dTV Certification  - Type  Scripted Original Language  Japanese Runtime  3m Homepage   http://avex.jp/piko-lullaby/ Genres Comedy Keywords based on fairy tale anime short episodes Content Score 56 We're so close, yet so far. Top Contributors 49 Marr 🇳🇱 D 17 Destr0y 7 irkillroy TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}