{"link": "https://www.themoviedb.org/tv/62527?language=en", "title": "Beyond the Tank", "resume": "“Beyond the Tank” is a one-hour companion series from the producers of the Emmy-winning reality series, “Shark Tank.” Audiences familiar with the compelling ups and downs of the negotiations will be further engaged in the drama that takes place after the entrepreneurs’ appearance on “Shark Tank.” What lies in the aftermath of their investment? Did a promising deal turn sour, or did it lead to millions of dollars in sales?  http://gg.gg/3xt3f", "rate": 67, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62527   Expand Beyond the Tank   (2015) User Score Overview “Beyond the Tank” is a one-hour companion series from the producers of the Emmy-winning reality series, “Shark Tank.” Audiences familiar with the compelling ups and downs of the negotiations will be further engaged in the drama that takes place after the entrepreneurs’ appearance on “Shark Tank.” What lies in the aftermath of their investment? Did a promising deal turn sour, or did it lead to millions of dollars in sales?  http://gg.gg/3xt3f Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2016 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2009-08-09 Shark Tank 6.8  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://gg.gg/3xt3f Genres Reality Keywords entrepreneur Content Score 56 We're so close, yet so far. Top Contributors 17 Elizabeth Jennings LC 5 Legit Corporation 9 5 9klpy85nloo8r4f8 z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}