{"link": "https://www.themoviedb.org/tv/67442?language=en", "title": "Autumn In My Heart", "resume": "A Thai remake of the Korean Drama of the same name made in the year 2000. This follows a similar plot, there were two girls who were born in October. They had same birthday and were raised in the same village and in the same class. The story goes on and entwines the lives of these two characters within a tale of love and drama.", "rate": 70, "genre": ["Drama"], "cast": ["ซง ซึงฮย็อน", "ซอง เฮเคียว", "วอน บิน"], "character": ["รับบท ยุน จุนโซ", "ยุน/ชอย อุนโซ", "ฮัน เทซก"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67442   Expand Autumn In My Heart   (2013) User Score  Play Trailer Overview A Thai remake of the Korean Drama of the same name made in the year 2000. This follows a similar plot, there were two girls who were born in October. They had same birthday and were raised in the same village and in the same class. The story goes on and entwines the lives of these two characters within a tale of love and drama. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast ซง ซึงฮย็อน รับบท ยุน จุนโซ ซอง เฮเคียว ยุน/ชอย อุนโซ วอน บิน ฮัน เทซก Full Cast & Crew Last Season Season 1 2013 | 18 Episodes Season 1 of Autumn In My Heart premiered on November  1, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Autumn In My Heart. You can help by rating TV shows you've seen. Facts Original Name  รักนี้ชั่วนิรันดร์ Status  Ended Networks - Certification น 13+ Meaning Nor 13+ Movies appropriate for audiences aged 13 and older. Type  Scripted Original Language  Thai Runtime  - Homepage  - Genres Drama Keywords thai lakorn Content Score 64 We're so close, yet so far. Top Contributors 28 Crip TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}