{"link": "https://www.themoviedb.org/tv/14069?language=en", "title": "In Treatment", "resume": "Set within the highly charged confines of individual psychotherapy sessions and centering around Dr. Paul Weston, a psychotherapist who exhibits an insightful, reserved demeanor while treating his patients—but displays a crippling insecurity while counseled by his own therapist.", "rate": 79, "genre": ["Drama"], "cast": ["Gabriel Byrne", "Irrfan Khan", "Debra Winger", "Dane DeHaan", "Amy Ryan"], "character": ["Paul Weston", "Sunil", "Frances", "Jesse", "Adele"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14069   Expand In Treatment   (2008) User Score Overview Set within the highly charged confines of individual psychotherapy sessions and centering around Dr. Paul Weston, a psychotherapist who exhibits an insightful, reserved demeanor while treating his patients—but displays a crippling insecurity while counseled by his own therapist. Featured Crew Hagai Levi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabriel Byrne Paul Weston Irrfan Khan Sunil Debra Winger Frances Dane DeHaan Jesse Amy Ryan Adele Full Cast & Crew Last Season Season 3 2010 | 28 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  5 Recommendations   2006-03-12 Big Love 7.6    2012-01-29 Luck 7.8    2003-09-14 K Street 5.5    2009-02-15 Eastbound & Down 7.4    2011-09-23 A Gifted Man 6.2    1999-09-29 Popular 6.9    1994-09-19 ER 6.9    2010-09-06 Mad 4.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.hbo.com/in-treatment Genres Drama Keywords psychotherapy psychotherapist mental health professional Content Score 93 Almost there... Top Contributors 34 lineker 31 Travis Bell 19 Elizabeth Jennings S 7 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}