{"link": "https://www.themoviedb.org/tv/35429?language=en", "title": "Дети Арбата", "resume": "Children of the Arbat is a 16-part television serial based on the Children of the Arbat trilogy by Anatoly Rybakov. It aired on the Channel One network in Russia in 2004.\nThe series closely follows the plot of Rybakov's trilogy. Set in the Soviet Union in the 1930s, it tells the story of Sasha Pankratov, a student and loyal Komsomol member from the Arbat neighborhood of Moscow who is unfairly exiled to Siberia. As his family and friends, including his love interest Varya Ivanova, grapple with Sasha's sudden detention and departure, the series shows the growing fear and paranoia that gripped Moscow in the years before the murder of Sergey Kirov and the start of Stalin's Great Purge.", "rate": 10, "genre": ["Drama"], "cast": ["Yevgeni Tsyganov", "Daniil Strakhov", "Yevgeniya Simonova", "Maksim Sukhanov", "Chulpan Khamatova"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35429   Expand Дети Арбата   (2004) User Score Overview Children of the Arbat is a 16-part television serial based on the Children of the Arbat trilogy by Anatoly Rybakov. It aired on the Channel One network in Russia in 2004. The series closely follows the plot of Rybakov's trilogy. Set in the Soviet Union in the 1930s, it tells the story of Sasha Pankratov, a student and loyal Komsomol member from the Arbat neighborhood of Moscow who is unfairly exiled to Siberia. As his family and friends, including his love interest Varya Ivanova, grapple with Sasha's sudden detention and departure, the series shows the growing fear and paranoia that gripped Moscow in the years before the murder of Sergey Kirov and the start of Stalin's Great Purge. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yevgeni Tsyganov Daniil Strakhov Yevgeniya Simonova Maksim Sukhanov Chulpan Khamatova Full Cast & Crew Last Season Season 1 2004 | 16 Episodes Season 1 of Дети Арбата premiered on September  1, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Дети Арбата. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Russian Runtime  705m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors R 23 RomanGalperin Z 5 Zhuk72 n 4 navarro2018 l 3 ldq  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}