{"link": "https://www.themoviedb.org/tv/77577?language=en", "title": "Idol Producer", "resume": "Idol Producer (偶像练习生) is a Chinese reality boy group survival show produced by iQiyi. Idol Producer brings together 100 trainees from 31 different entertainment companies and talent agencies, both within and beyond China, including individual trainees who aren't associated with any agencies. Out of the 100 trainees, 9 of them will be chosen to debut through viewer voting.", "rate": 80, "genre": ["Reality"], "cast": ["Yixing Zhang", "Jackson Wang", "Jin Au-Yeung", "Xiao Cheng", "Jieqiong Zhou"], "character": ["Nation's Representative Producer", "Rap Mentor", "Rap Mentor", "Dance Mentor", "Dance Mentor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77577   Expand Idol Producer   (2018) User Score Overview Idol Producer (偶像练习生) is a Chinese reality boy group survival show produced by iQiyi. Idol Producer brings together 100 trainees from 31 different entertainment companies and talent agencies, both within and beyond China, including individual trainees who aren't associated with any agencies. Out of the 100 trainees, 9 of them will be chosen to debut through viewer voting. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yixing Zhang Nation's Representative Producer Jackson Wang Rap Mentor Jin Au-Yeung Rap Mentor Xiao Cheng Dance Mentor Jieqiong Zhou Dance Mentor Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Idol Producer premiered on January 19, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Idol Producer. You can help by rating TV shows you've seen. Facts Original Name  偶像练习生 Status  Returning Series Network Certification  - Type  Reality Original Language  Chinese Runtime  215m Homepage   http://www.iqiyi.com/a_19rrh1ji0t.html Genres Reality Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 30 luxaurc H 6 Herdas p 1 pokego1234  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}