{"link": "https://www.themoviedb.org/tv/34213?language=en", "title": "Kamichama Karin", "resume": "Kamichama Karin is a Japanese manga originally written by Koge-Donbo about a seventh grade girl named Karin who finds out that she can transform into a goddess. The series began as a manga first serialized in January 2003. Kamichama Karin was serialized in the Japanese shōjo manga magazine Nakayoshi and published by Kodansha. While the first manga series ended at seven bound volumes, a second entitled Kamichama Karin Chu began serialization in the same magazine in July 2006, and as of April 2008, the series end with seven bound volumes being released. The first one came into the stores on June 24, 2008. Kamichama Karin has been licensed in the U.S. and Canada by Tokyopop. An anime series based on the original manga began airing in Japan on April 6, 2007, on TV Tokyo, produced by the animation studio Satelight and directed by Takashi Anno.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Akira Ishida", "Shintarou Asanuma", "Nanae Katō", "Mai Nakahara", "Miyuki Sawashiro"], "character": ["Michiru Nishikiori", "Kirio Karasuma", "Nike", "Karin Hanazono", "Kazune Kujyou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34213   Expand Kamichama Karin   (2007) User Score Overview Kamichama Karin is a Japanese manga originally written by Koge-Donbo about a seventh grade girl named Karin who finds out that she can transform into a goddess. The series began as a manga first serialized in January 2003. Kamichama Karin was serialized in the Japanese shōjo manga magazine Nakayoshi and published by Kodansha. While the first manga series ended at seven bound volumes, a second entitled Kamichama Karin Chu began serialization in the same magazine in July 2006, and as of April 2008, the series end with seven bound volumes being released. The first one came into the stores on June 24, 2008. Kamichama Karin has been licensed in the U.S. and Canada by Tokyopop. An anime series based on the original manga began airing in Japan on April 6, 2007, on TV Tokyo, produced by the animation studio Satelight and directed by Takashi Anno. Featured Crew Koge-Donbo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akira Ishida Michiru Nishikiori Shintarou Asanuma Kirio Karasuma Nanae Katō Nike Mai Nakahara Karin Hanazono Miyuki Sawashiro Kazune Kujyou Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of Kamichama Karin premiered on April  6, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kamichama Karin. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 4 seboseboss m 3 magoozin n 2 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}