{"link": "https://www.themoviedb.org/tv/63927?language=en", "title": "Six Flying Dragons", "resume": "“Six Flying Dragons” is a Period drama depicts the ambitions and success stories of 6 people around Prince Lee Bang Won. This drama also depicts the ideological and political conflict between Prince Lee Bang Won and Jung Do Jeon who is the man instrumental in helping King Taejo to establish the fledgling Joseon nation. Jung Do Jeon wants a country ruled by ministers, while Lee Bang Won wants absolute power. Prince Lee Bang Won later become King TaeJong who was the third king in the Joseon Dynasty. He helped his father King Taejo to establish the Joseon Dynasty.", "rate": 78, "genre": ["Drama", "History"], "cast": ["Kim Myung-min", "Yoo Ah-in", "Shin Se-kyung", "Byun Yo-han", "Cheon Ho-jin"], "character": ["Jeong Do-jeon", "Yi Bang-won (King Taejong)", "Boon-yi", "Ddang-sae", "Yi Seong-gye (King Taejo)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63927   Expand Six Flying Dragons   (2015) User Score Overview “Six Flying Dragons” is a Period drama depicts the ambitions and success stories of 6 people around Prince Lee Bang Won. This drama also depicts the ideological and political conflict between Prince Lee Bang Won and Jung Do Jeon who is the man instrumental in helping King Taejo to establish the fledgling Joseon nation. Jung Do Jeon wants a country ruled by ministers, while Lee Bang Won wants absolute power. Prince Lee Bang Won later become King TaeJong who was the third king in the Joseon Dynasty. He helped his father King Taejo to establish the Joseon Dynasty. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Myung-min Jeong Do-jeon Yoo Ah-in Yi Bang-won (King Taejong) Shin Se-kyung Boon-yi Byun Yo-han Ddang-sae Cheon Ho-jin Yi Seong-gye (King Taejo) Full Cast & Crew Last Season Season 1 2015 | 50 Episodes Season 1 of Six Flying Dragons premiered on October  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  2 Recommendations   2016-06-20 Beautiful Mind 6.7    2011-10-05 Tree With Deep Roots 8.9    2015-10-07 The Village: Achiara's Secret 7.9    2016-05-25 Lucky Romance 7.3    2015-01-07 Kill Me, Heal Me 8.7    2016-01-11 Moorim School 6.2    2016-01-22 Signal 7.4    2016-06-17 Squad 38 7.7  Facts Original Name  육룡이 나르샤 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/6dragons/ Genres Drama History Keywords korea Content Score 93 Almost there... Top Contributors M 63 Maria180493 t 10 tmdb38202327 9 Elizabeth Jennings d 8 daphie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}