{"link": "https://www.themoviedb.org/tv/74292?language=en", "title": "Mountain: Life at the Extreme", "resume": "A landmark 3-part series from the BBC's Natural History Unit revealing the extraordinary animals and remarkable people who make a home in the iconic mountain ranges of the world. There is one episode each on the Himalaya, Rockies and Andes.", "rate": 60, "genre": ["Documentary"], "cast": ["Douglas Henshall"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74292   Expand Mountain: Life at the Extreme   (2017) User Score Overview A landmark 3-part series from the BBC's Natural History Unit revealing the extraordinary animals and remarkable people who make a home in the iconic mountain ranges of the world. There is one episode each on the Himalaya, Rockies and Andes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Douglas Henshall Narrator Full Cast & Crew Last Season Season 1 2017 | 3 Episodes Season 1 of Mountain: Life at the Extreme premiered on August 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mountain: Life at the Extreme. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b093xhxm Genres Documentary Keywords mountain extreme Content Score 64 We're so close, yet so far. Top Contributors 51 PNO Movies 41 Elizabeth Jennings R 6 Rebecca 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}