{"link": "https://www.themoviedb.org/tv/20592?language=en", "title": "Jūsō Kikō Dancouga Nova", "resume": "Jūsō Kikō Dancouga Nova is a Super Robot anime television series, produced by Ashi Productions and is directed by Masami Ōbari, who was also in charge of mechanical design. The series is supposedly a follow up of its predecessor, Dancouga – Super Beast Machine God but became a spiritual sequel to Gravion. The series premiered across Japan on the Japanese CS television network Animax on 15 February 2007, spanning a total of 12 episodes.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Haruna Ikezawa"], "character": ["Aoi Hidaka"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20592   Expand Jūsō Kikō Dancouga Nova   (2007) User Score Overview Jūsō Kikō Dancouga Nova is a Super Robot anime television series, produced by Ashi Productions and is directed by Masami Ōbari, who was also in charge of mechanical design. The series is supposedly a follow up of its predecessor, Dancouga – Super Beast Machine God but became a spiritual sequel to Gravion. The series premiered across Japan on the Japanese CS television network Animax on 15 February 2007, spanning a total of 12 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruna Ikezawa Aoi Hidaka Full Cast & Crew Last Season Season 1 2007 | 12 Episodes Season 1 of Jūsō Kikō Dancouga Nova premiered on February 15, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Jūsō Kikō Dancouga Nova. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jūsō Kikō Dancouga Nova. You can help by rating TV shows you've seen. Facts Original Name  獣装機攻ダンクーガ ノヴァ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Action & Adventure Keywords combat mechas Content Score 56 We're so close, yet so far. Top Contributors 12 seboseboss t 8 tmdb983464 1 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}