{"link": "https://www.themoviedb.org/tv/40107?language=en", "title": "Beaver Falls", "resume": "Beaver Falls is a British comedy-drama that follows a trio of Oxford Brookes University graduates who managed to deceitfully get jobs at Beaver Falls, an elitist American summer camp for the beautiful teenage offspring of California's rich and powerful. The first episode aired on E4 at 27 July 2011. The show was renewed for a second series, which aired on Monday 6 August, also on E4.\nOn 22 September 2012, it was reported that E4 had cancelled Beaver Falls.", "rate": 85, "genre": ["Comedy", "Drama"], "cast": ["Todd Boyce", "Alison Doody", "John Dagleish", "Jon Cor", "Kristen Gutoskie"], "character": ["Bobby", "Pam", "Barry", "Jake", "Rachael"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40107   Expand Beaver Falls   (2011) User Score Overview Beaver Falls is a British comedy-drama that follows a trio of Oxford Brookes University graduates who managed to deceitfully get jobs at Beaver Falls, an elitist American summer camp for the beautiful teenage offspring of California's rich and powerful. The first episode aired on E4 at 27 July 2011. The show was renewed for a second series, which aired on Monday 6 August, also on E4. On 22 September 2012, it was reported that E4 had cancelled Beaver Falls. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Todd Boyce Bobby Alison Doody Pam John Dagleish Barry Jon Cor Jake Kristen Gutoskie Rachael Full Cast & Crew Last Season Season 2 2012 | 6 Episodes Season 2 of Beaver Falls premiered on August  6, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Beaver Falls. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.e4.com/beaverfalls/ Genres Comedy Drama Keywords california summer camp camp summer Content Score 86 Almost there... Top Contributors 16 Banana z 5 zurman1 s 4 speedycars 3 DBD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}