{"link": "https://www.themoviedb.org/tv/4457?language=en", "title": "Degrassi High", "resume": "Degrassi High is the third television show in the Degrassi series of teen dramas about the lives of a group of teenagers living on or near De Grassi Street in Toronto, Ontario, Canada. It first aired from 1989 to 1991 and followed the young people from The Kids of Degrassi Street and Degrassi Junior High through high school. The show was filmed in downtown Toronto and at Centennial College.\nMuch like its predecessor, Degrassi High dealt with controversial issues ranging from AIDS, abortion, abuse, alcoholism, cheating, sex, death and suicide, dating, depression, bullying, gay rights, homophobia, racism, the environment, drugs, and eating disorders.\nThe show's impact on Canadian identity is discussed in the September 2007 issue of u're Magazine.", "rate": 80, "genre": ["Drama"], "cast": ["Siluck Saysanasy", "Stacie Mistysyn", "Anais Granofsky", "Stefan Brogren", "Amanda Stepto"], "character": ["Yick Yu", "Caitlin Ryan", "Lucy Fernandez", "Archibald 'Snake' Simpson", "Christine 'Spike' Nelson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4457   Expand Degrassi High   (1989) User Score Overview Degrassi High is the third television show in the Degrassi series of teen dramas about the lives of a group of teenagers living on or near De Grassi Street in Toronto, Ontario, Canada. It first aired from 1989 to 1991 and followed the young people from The Kids of Degrassi Street and Degrassi Junior High through high school. The show was filmed in downtown Toronto and at Centennial College. Much like its predecessor, Degrassi High dealt with controversial issues ranging from AIDS, abortion, abuse, alcoholism, cheating, sex, death and suicide, dating, depression, bullying, gay rights, homophobia, racism, the environment, drugs, and eating disorders. The show's impact on Canadian identity is discussed in the September 2007 issue of u're Magazine. Featured Crew Kit Hood Creator Linda Schuyler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Siluck Saysanasy Yick Yu Stacie Mistysyn Caitlin Ryan Anais Granofsky Lucy Fernandez Stefan Brogren Archibald 'Snake' Simpson Amanda Stepto Christine 'Spike' Nelson Full Cast & Crew Last Season Season 2 1990 | 13 Episodes Season 2 of Degrassi High premiered on September  3, 1990. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply memories Open 1 by  Strannger18 Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Degrassi High. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords high school toronto teenager teen social issues Content Score 93 Almost there... Top Contributors 68 Banana n 1 neil1269  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}