{"link": "https://www.themoviedb.org/tv/43142?language=en", "title": "Mobile Suit Gundam SEED C.E. 73: Stargazer", "resume": "Mobile Suit Gundam SEED C.E. 73: Stargazer is a side story to the anime TV series, Mobile Suit Gundam SEED Destiny. As of July 2006, it is being streamed on Bandai Channel as an original net animation. The show is directed by Susumu Nishizawa and written by Shigeru Morita, both staff members of Gundam SEED Destiny.\nThe series consists of three episodes, each running at 15-minutes long. The web broadcast began in July 2006, with a new episode showing monthly. A DVD containing all three episodes as well as the two 5-minute long Mobile Suit Gundam SEED Astray animated shorts was released on November 24, 2006. This DVD also contained a different ending for Stage 3 in which several scenes after the Phantom Pain attack are shown.\nA manga adaptation of the series has been released in 2007. Authored by Naoki Moriya, it features an epilogue reveals the previously uncertain fate of Selene and Sven as they are shown to be alive and mostly unharmed from their ordeal. Sven joins the DSSD.", "rate": 50, "genre": ["Drama", "Animation", "Science", "Fiction"], "cast": ["Hiroshi Kamiya", "Jun Fukuyama", "Rina Satou", "Jouji Nakata", "Daisuke Ono"], "character": ["Shams Couza", "Sol Ryūne l'Ange", "Sven Cal Bryan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43142   Expand Mobile Suit Gundam SEED C.E. 73: Stargazer   (2006) User Score Overview Mobile Suit Gundam SEED C.E. 73: Stargazer is a side story to the anime TV series, Mobile Suit Gundam SEED Destiny. As of July 2006, it is being streamed on Bandai Channel as an original net animation. The show is directed by Susumu Nishizawa and written by Shigeru Morita, both staff members of Gundam SEED Destiny. The series consists of three episodes, each running at 15-minutes long. The web broadcast began in July 2006, with a new episode showing monthly. A DVD containing all three episodes as well as the two 5-minute long Mobile Suit Gundam SEED Astray animated shorts was released on November 24, 2006. This DVD also contained a different ending for Stage 3 in which several scenes after the Phantom Pain attack are shown. A manga adaptation of the series has been released in 2007. Authored by Naoki Moriya, it features an epilogue reveals the previously uncertain fate of Selene and Sven as they are shown to be alive and mostly unharmed from their ordeal. Sven joins the DSSD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroshi Kamiya Shams Couza Jun Fukuyama Sol Ryūne l'Ange Rina Satou Jouji Nakata Daisuke Ono Sven Cal Bryan Full Cast & Crew Last Season Season 1 2008 | 3 Episodes Season 1 of Mobile Suit Gundam SEED C.E. 73: Stargazer premiered on July 14, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mobile Suit Gundam SEED C.E. 73: Stargazer. You can help by rating TV shows you've seen. Facts Original Name  机动戦士ガンダムSEED C.E.73  STARGAZER Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  15m Homepage   http://www.seed-stargazer.net Genres Drama Animation Science Fiction Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors k 18 kenhyg i 4 i90i90 h 3 hmomochi o 1 ohuaithnin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}