{"link": "https://www.themoviedb.org/tv/15081?language=en", "title": "Born Free", "resume": "The adventures of two married game wardens in Kenya. George Adamson and Diana Muldaur live with their adopted lioness Elsa the Lioness, where they protect the animals in the surrounding area from all sorts of danger, both natural and human.", "rate": 0, "genre": ["Drama", "Action", "Adventure"], "cast": ["Diana Muldaur", "Gary Collins"], "character": ["Joy Adamson", "George Adamson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15081   Expand Born Free   (1974) User Score Overview The adventures of two married game wardens in Kenya. George Adamson and Diana Muldaur live with their adopted lioness Elsa the Lioness, where they protect the animals in the surrounding area from all sorts of danger, both natural and human. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diana Muldaur Joy Adamson Gary Collins George Adamson Full Cast & Crew Last Season Season 1 1974 | 13 Episodes Season 1 of Born Free premiered on September  9, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Born Free. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 48m Homepage  - Genres Drama Action & Adventure Keywords africa lion kenya based on memoir or autobiography based on movie living abroad wild Content Score 43 There's no 'I' in team... Top Contributors 14 Banana 4 rudely_murray 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}