{"link": "https://www.themoviedb.org/tv/68736?language=en", "title": "Getter Robo: Armageddon", "resume": "Dr. Saotome returns from the dead after being seemingly murdered by Getter pilot Nagare Ryoma and threatens the world with his ultimate creation: the Shin Dragon. Ryoma reluctantly teams up with his former co-pilots Jin Hayato and Tomoe Mushashi to combat Dr. Saotome. The pilots must also deal with the mysterious Invaders, aliens that have the ability to possess humans and warp their flesh to form hideous creatures.", "rate": 80, "genre": ["Animation", "Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68736   Expand Getter Robo: Armageddon   (1998) User Score Overview Dr. Saotome returns from the dead after being seemingly murdered by Getter pilot Nagare Ryoma and threatens the world with his ultimate creation: the Shin Dragon. Ryoma reluctantly teams up with his former co-pilots Jin Hayato and Tomoe Mushashi to combat Dr. Saotome. The pilots must also deal with the mysterious Invaders, aliens that have the ability to possess humans and warp their flesh to form hideous creatures. Featured Crew Ken Ishikawa Creator Gou Nagai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1998 | 13 Episodes Season 1 of Getter Robo: Armageddon premiered on August 25, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Getter Robo: Armageddon. You can help by rating TV shows you've seen. Facts Original Name  真ゲッターロボ~世界最後の日 Status  Ended Networks - Certification  - Type  Miniseries Original Language  Japanese Runtime  25m Homepage  - Genres Animation Action & Adventure Sci-Fi & Fantasy Keywords cartoon robot anime Content Score 71 Just a little bit more... Top Contributors 22 YabukiJoe1 M 20 MilkLion P 18 PieroMartini a 13 asura766  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}