{"link": "https://www.themoviedb.org/tv/64199?language=en", "title": "Sneaky Pete", "resume": "A con man on the run from a vicious gangster takes cover from his past by assuming the identity of his prison cellmate, Pete, “reuniting” with Pete’s estranged family, a colorful, dysfunctional group that threatens to drag him into a world just as dangerous as the one he’s trying to escape - and, just maybe, give him a taste of the loving family he’s never had.", "rate": 80, "genre": ["Drama", "Crime"], "cast": ["Giovanni Ribisi", "Marin Ireland", "Libe Barer", "Peter Gerety", "Margo Martindale"], "character": ["Pete / Marius", "Julia", "Carly", "Otto Bernhardt", "Audrey Bernhardt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64199   Expand Sneaky Pete   (2015) User Score  Play Trailer Overview A con man on the run from a vicious gangster takes cover from his past by assuming the identity of his prison cellmate, Pete, “reuniting” with Pete’s estranged family, a colorful, dysfunctional group that threatens to drag him into a world just as dangerous as the one he’s trying to escape - and, just maybe, give him a taste of the loving family he’s never had. Featured Crew David Shore Creator Bryan Cranston Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  1 Teasers  0 Clips  2 Featurettes  0 Opening Credits  0 Top Billed Cast Giovanni Ribisi Pete / Marius Marin Ireland Julia Libe Barer Carly Peter Gerety Otto Bernhardt Margo Martindale Audrey Bernhardt Full Cast & Crew Current Season Season 2 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply T second season ruined Open 0 by THEmovieExpert\n      \n     Is this a sequal to Breaking Bad? Open 2 by  Fifthfreedom Go to Discussions Media Most Popular Videos  3 Backdrops  5 Posters  6 Recommendations   2016-10-14 Goliath 7.8    2014-08-28 Hand of God 6.8    2011-06-06 Injustice 7.3    2006-01-01 In Justice 6.8    2011-05-05 The Shadow Line 8.1    2014-02-06 Bosch 7.9    2017-01-25 Cardinal 6.9    2017-11-05 SMILF 6.7  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   https://www.amazon.com/dp/B013488XFS Genres Drama Crime Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 33 Elizabeth Jennings 18 senckyz 6 Bendik 6 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}