{"link": "https://www.themoviedb.org/tv/3727?language=en", "title": "Car 54, Where Are You?", "resume": "Car 54, Where Are You? is an American sitcom that ran on NBC from 1961 to 1963, and was about two New York police officers based at the fictional 53rd precinct in The Bronx. Car 54 was their patrol car. The show was filmed only in black-and-white. Episodes had different directors, the most recognized being Al De Caprio. Stanley Prager and Nat Hiken also directed several episodes. Most filming was on location in the New York City borough of The Bronx, and at Gold Medal Studios in The Bronx.", "rate": 55, "genre": ["Comedy"], "cast": ["Fred Gwynne", "Joe E. Ross"], "character": ["Officer Francis Muldoon", "Officer Gunther Toody"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3727   Expand Car 54, Where Are You?   (1961) User Score Overview Car 54, Where Are You? is an American sitcom that ran on NBC from 1961 to 1963, and was about two New York police officers based at the fictional 53rd precinct in The Bronx. Car 54 was their patrol car. The show was filmed only in black-and-white. Episodes had different directors, the most recognized being Al De Caprio. Stanley Prager and Nat Hiken also directed several episodes. Most filming was on location in the New York City borough of The Bronx, and at Gold Medal Studios in The Bronx. Featured Crew Nat Hiken Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Gwynne Officer Francis Muldoon Joe E. Ross Officer Gunther Toody Full Cast & Crew Last Season Season 2 1962 | 1 Episode Season 2 of Car 54, Where Are You? premiered on September 16, 1962. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1962-10-11 McHale's Navy 6.1    1961-09-27 Dr. Kildare 5.8    1967-09-11 The Carol Burnett Show 7.8    1977-09-20 Lou Grant 6.2    1960-09-29 My Three Sons 6.0    1969-11-19 The Benny Hill Show 6.0    1982-03-25 Cagney & Lacey 6.0    1970-09-24 The Odd Couple 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords new york police nypd sitcom Content Score 64 We're so close, yet so far. Top Contributors 16 Banana z 4 zurman1 TB 2 TMDb Bot 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}