{"link": "https://www.themoviedb.org/tv/74309?language=en", "title": "Russia with Simon Reeve", "resume": "One hundred years after the Russian Revolution, Simon Reeve embarks on an extraordinary three-part journey across Russia.", "rate": 80, "genre": ["Documentary"], "cast": ["Simon Reeve"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74309   Expand Russia with Simon Reeve   (2017) User Score  Play Trailer Overview One hundred years after the Russian Revolution, Simon Reeve embarks on an extraordinary three-part journey across Russia. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Reeve Himself - Host Full Cast & Crew Last Season Season 1 2017 | 3 Episodes Season 1 of Russia with Simon Reeve premiered on September 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Russia with Simon Reeve. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b096sbzx Genres Documentary Keywords russia travel culture Content Score 64 We're so close, yet so far. Top Contributors 37 PNO Movies 25 Elizabeth Jennings 10 Marr 🇳🇱 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}