{"link": "https://www.themoviedb.org/tv/2028?language=en", "title": "Scariest Places on Earth", "resume": "Scariest Places on Earth is an American paranormal documentary reality television series that originally aired from October 23, 2000 to October 29, 2006. The program was produced by Triage Entertainment for the Fox Family Channel, which is now ABC Family and owns the rights to the show. The show featured reported cases of the paranormal by sending an ordinary family to visit the location in a reality TV-style vigil.", "rate": 60, "genre": ["Documentary"], "cast": ["Linda Blair"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2028   Expand Scariest Places on Earth   (2000) User Score Overview Scariest Places on Earth is an American paranormal documentary reality television series that originally aired from October 23, 2000 to October 29, 2006. The program was produced by Triage Entertainment for the Fox Family Channel, which is now ABC Family and owns the rights to the show. The show featured reported cases of the paranormal by sending an ordinary family to visit the location in a reality TV-style vigil. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Linda Blair Full Cast & Crew Last Season Season 2 2002 | 4 Episodes Season 2 of Scariest Places on Earth premiered on October 20, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Scariest Places on Earth. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords paranormal show Content Score 56 We're so close, yet so far. Top Contributors 14 Banana TB 2 TMDb Bot 1 amian123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}