{"link": "https://www.themoviedb.org/tv/72565?language=en", "title": "My Well-Organized Home", "resume": "Mai Yururi decides to get rid of her old books, memorabilia, furniture and clothes. Everything around her room, except the basic necessities. Her friend visits her place and is shocked that her place is empty. Mai realizes how good it feels to get rid of clutter.", "rate": 0, "genre": ["Comedy", "Family"], "cast": ["Kaho", "Kyôko Enami", "Mayumi Asaka", "Kôen Kondô", "Shuri"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72565   Expand My Well-Organized Home   (2016) User Score Overview Mai Yururi decides to get rid of her old books, memorabilia, furniture and clothes. Everything around her room, except the basic necessities. Her friend visits her place and is shocked that her place is empty. Mai realizes how good it feels to get rid of clutter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaho Kyôko Enami Mayumi Asaka Kôen Kondô Shuri Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of My Well-Organized Home premiered on February  6, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on My Well-Organized Home. You can help by rating TV shows you've seen. Facts Original Name  わたしのウチには、なんにもない。 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Comedy Family Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 29 againlin 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}