{"link": "https://www.themoviedb.org/tv/2362?language=en", "title": "The Jetsons", "resume": "The Jetsons is an American animated sitcom produced by Hanna-Barbera, originally airing in primetime from 1962-1963, then later as part of the weekday/weekend morning programming block called The Funtastic World of Hanna-Barbera, until 1987. New episodes were produced from 1984-1987 as well. It was Hanna-Barbera’s Space Age counterpart to The Flintstones. Reruns can be seen frequently on Boomerang.\nWhile the Flintstones live in a world with machines powered by birds and dinosaurs, the Jetsons live in the year 2062 in a futuristic utopia of elaborate robotic contraptions, aliens, holograms, and whimsical inventions.\nThe original series comprised 24 episodes and aired on Sunday nights on ABC beginning September 23, 1962, with primetime reruns continuing through September 8, 1963. At the time of its debut, it was the first program ever to be broadcast in color on ABC-TV. In contrast, The Flintstones, while always produced in color, was broadcast in black-and-white for its first two seasons. Following its primetime run, the series aired on Saturday mornings for decades, starting on ABC for the 1963-64 season and then in future seasons on CBS and NBC.", "rate": 67, "genre": ["Animation"], "cast": ["Jean Vander Pyl", "Janet Waldo", "George O'Hanlon", "Penny Singleton", "Daws Butler"], "character": ["Rosie the Robot (voice)", "Judy Jetson (voice)", "George Jetson (voice)", "Jane Jetson (voice)", "Elroy Jetson (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2362   Expand The Jetsons   (1962) User Score Overview The Jetsons is an American animated sitcom produced by Hanna-Barbera, originally airing in primetime from 1962-1963, then later as part of the weekday/weekend morning programming block called The Funtastic World of Hanna-Barbera, until 1987. New episodes were produced from 1984-1987 as well. It was Hanna-Barbera’s Space Age counterpart to The Flintstones. Reruns can be seen frequently on Boomerang. While the Flintstones live in a world with machines powered by birds and dinosaurs, the Jetsons live in the year 2062 in a futuristic utopia of elaborate robotic contraptions, aliens, holograms, and whimsical inventions. The original series comprised 24 episodes and aired on Sunday nights on ABC beginning September 23, 1962, with primetime reruns continuing through September 8, 1963. At the time of its debut, it was the first program ever to be broadcast in color on ABC-TV. In contrast, The Flintstones, while always produced in color, was broadcast in black-and-white for its first two seasons. Following its primetime run, the series aired on Saturday mornings for decades, starting on ABC for the 1963-64 season and then in future seasons on CBS and NBC. Featured Crew Joseph Barbera Creator William Hanna Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  2 Top Billed Cast Jean Vander Pyl Rosie the Robot (voice) Janet Waldo Judy Jetson (voice) George O'Hanlon George Jetson (voice) Penny Singleton Jane Jetson (voice) Daws Butler Elroy Jetson (voice) Full Cast & Crew Last Season Season 3 1987 | 10 Episodes Season 3 of The Jetsons premiered on October 19, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply live action Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  4 Recommendations   1960-09-30 The Flintstones 7.0    1995-09-09 Pinky and the Brain 7.7    1983-09-10 Inspector Gadget 6.6    1969-09-13 Scooby-Doo, Where Are You! 7.5    1961-09-27 Top Cat 6.9    1990-09-14 Tiny Toon Adventures 7.3    1960-10-11 The Bugs Bunny Show 7.8    1991-09-07 Taz-Mania 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords future family Content Score 100 Yes! Looking good! Top Contributors 57 Banana 6 d00ziie z 5 zurman1 4 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}