{"link": "https://www.themoviedb.org/tv/4482?language=en", "title": "Bewitched", "resume": "Bewitched is an American fantasy situation comedy originally broadcast for eight seasons on ABC from 1964 to 1972. It was created by Sol Saks under executive director Harry Ackerman, and stars Elizabeth Montgomery, Dick York, Dick Sargent, Agnes Moorehead, and David White. The show is about a witch who marries an ordinary mortal man and tries to lead the life of a typical suburban housewife. Bewitched enjoyed great popularity, finishing as the number two show in America during its debut season, and becoming the longest-running supernatural-themed sitcom of the 1960s–1970s. The show continues to be seen throughout the world in syndication and on recorded media.\nIn 2002, Bewitched was ranked #50 on \"TV Guide's 50 Greatest TV Shows of All Time\". In 1997, the same magazine ranked the season 2 episode \"Divided He Falls\" #48 on their list of the \"100 Greatest Episodes of All Time\".", "rate": 71, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Elizabeth Montgomery", "Dick York", "Dick Sargent", "Agnes Moorehead", "David White"], "character": ["Samantha Stephens", "Darrin Stephens (1964-1969 eps.)", "Darrin Stephens (1969-1972 eps.)", "Endora", "Larry Tate"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4482   Expand Bewitched   (1964) User Score  Play Trailer Overview Bewitched is an American fantasy situation comedy originally broadcast for eight seasons on ABC from 1964 to 1972. It was created by Sol Saks under executive director Harry Ackerman, and stars Elizabeth Montgomery, Dick York, Dick Sargent, Agnes Moorehead, and David White. The show is about a witch who marries an ordinary mortal man and tries to lead the life of a typical suburban housewife. Bewitched enjoyed great popularity, finishing as the number two show in America during its debut season, and becoming the longest-running supernatural-themed sitcom of the 1960s–1970s. The show continues to be seen throughout the world in syndication and on recorded media. In 2002, Bewitched was ranked #50 on \"TV Guide's 50 Greatest TV Shows of All Time\". In 1997, the same magazine ranked the season 2 episode \"Divided He Falls\" #48 on their list of the \"100 Greatest Episodes of All Time\". Featured Crew Sol Saks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  14 Content Issues  0 Images Backdrops  17 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elizabeth Montgomery Samantha Stephens Dick York Darrin Stephens (1964-1969 eps.) Dick Sargent Darrin Stephens (1969-1972 eps.) Agnes Moorehead Endora David White Larry Tate Full Cast & Crew Last Season Season 8 1971 | 26 Episodes Season 8 of Bewitched premiered on September 15, 1971. View All Seasons Social Reviews  0 Discussions  14 Subject Status Replies Last Reply w Tabitha: Happy Birthday Erin and Diane Murphy! Open 0 by wonder2wonder\n      \n     w My favourite witch Open 1 by  genplant29 w Uncle Arthur: Favorite episode? Open 1 by  NorthernLad Go to Discussions Media Most Popular Videos  1 Backdrops  17 Posters  10 Recommendations   1965-09-18 I Dream of Jeannie 7.1    1964-09-24 The Munsters 7.1    1964-09-26 Gilligan's Island 6.6    1964-09-18 The Addams Family 7.5    1966-01-12 Batman 7.0    1962-09-26 The Beverly Hillbillies 6.6    1957-10-04 Leave It to Beaver 7.1    1951-06-15 I Love Lucy 7.6  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords witch Content Score 100 Yes! Looking good! Top Contributors 18 waaw r 10 rolob 9 Banana m 8 mode2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}