{"link": "https://www.themoviedb.org/tv/13476?language=en", "title": "The Adventures of Hiram Holliday", "resume": "The Adventures of Hiram Holliday is an American adventure sitcom that aired on NBC from October 3, 1956 to February 27, 1957. Starring Wally Cox in the title role, the series is based on the 1939 novel of the same name by Paul Gallico.", "rate": 0, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Stanley Adams", "Wally Cox", "Thurston Hall", "Ainslie Pryor"], "character": ["Garreaux", "Hiram Holliday", "Harrison Prentice", "Joel Smith"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13476   Expand The Adventures of Hiram Holliday   (1956) User Score Overview The Adventures of Hiram Holliday is an American adventure sitcom that aired on NBC from October 3, 1956 to February 27, 1957. Starring Wally Cox in the title role, the series is based on the 1939 novel of the same name by Paul Gallico. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stanley Adams Garreaux Wally Cox Hiram Holliday Thurston Hall Harrison Prentice Ainslie Pryor Joel Smith Full Cast & Crew Last Season Season 1 1956 | 23 Episodes Season 1 of The Adventures of Hiram Holliday premiered on October  3, 1956. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of Hiram Holliday. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Action & Adventure Comedy Keywords nerd sitcom traveller Content Score 71 Just a little bit more... Top Contributors 14 Banana N 2 NetU  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}