{"link": "https://www.themoviedb.org/tv/15308?language=en", "title": "Bonde söker fru", "resume": "Bonde söker fru is a Swedish reality television program broadcast by TV4 based on the Fremantle format Farmer Wants a Wife. It features a number of single farmers who get to meet a number of potential partners and host some of them on their farms and go on an extended date with one. When a marriage results, it is televised.\nThe program premiered in 2006 with two episodes in the spring where the farmers were presented. Those interested in the farmers then write to them through the program. The main show is then shown in the autumn. It proved very successful, averaging 1.5 million viewers per episode.\nFrom the second season, the show has included female farmers. The third season, in 2008, included a gay farmer.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15308   Expand Bonde söker fru   (2006) User Score Overview Bonde söker fru is a Swedish reality television program broadcast by TV4 based on the Fremantle format Farmer Wants a Wife. It features a number of single farmers who get to meet a number of potential partners and host some of them on their farms and go on an extended date with one. When a marriage results, it is televised. The program premiered in 2006 with two episodes in the spring where the farmers were presented. Those interested in the farmers then write to them through the program. The main show is then shown in the autumn. It proved very successful, averaging 1.5 million viewers per episode. From the second season, the show has included female farmers. The third season, in 2008, included a gay farmer. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2012 | 10 Episodes Season 7 of Bonde söker fru premiered on September 12, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bonde söker fru. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.tv4.se/bondesokerfru/ Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}