{"link": "https://www.themoviedb.org/tv/34763?language=en", "title": "Studio Julmahuvi", "resume": "Sketch show Studio Julmahuvi ran for 8 episodes on YLE in 1998. The show is a parody of YLE's own programming, squeezing an entire evening's worth of programming into a half-hour show which included everything from news and weather to a children's show and a German police drama, with commercials and TV-spots on the side. The show was created with an impressive budget of 67 000 € per episode which resulted in extremely high production-values.", "rate": 100, "genre": ["Comedy"], "cast": ["Petteri Summanen", "Tommi Korpela", "Jukka Rasila", "Janne Reinikainen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34763   Expand Studio Julmahuvi   (1998) User Score Overview Sketch show Studio Julmahuvi ran for 8 episodes on YLE in 1998. The show is a parody of YLE's own programming, squeezing an entire evening's worth of programming into a half-hour show which included everything from news and weather to a children's show and a German police drama, with commercials and TV-spots on the side. The show was created with an impressive budget of 67 000 € per episode which resulted in extremely high production-values. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Petteri Summanen Tommi Korpela Jukka Rasila Janne Reinikainen Full Cast & Crew Last Season Season 1 1998 | 8 Episodes Season 1 of Studio Julmahuvi premiered on October 30, 1998. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Studio Julmahuvi. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2005-09-13 Supernatural 7.2    2008-01-19 Breaking Bad 8.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Finnish Runtime  30m Homepage  - Genres Comedy Keywords parody sketch comedy Content Score 86 Almost there... Top Contributors 25 BryGur 5 Banana m 1 mhk76  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}