{"link": "https://www.themoviedb.org/tv/30689?language=en", "title": "Laughing in the Wind", "resume": "Laughing in the Wind is a 2001 Chinese television series produced by Zhang Jizhong, starring Li Yapeng and Xu Qing in the leading roles. The series is an adaptation of Louis Cha's novel The Smiling, Proud Wanderer. It was first broadcast on CCTV in China in 2001.", "rate": 0, "genre": [], "cast": ["Xu Qing", "Li Yapeng"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30689   Expand Laughing in the Wind   (2001) User Score Overview Laughing in the Wind is a 2001 Chinese television series produced by Zhang Jizhong, starring Li Yapeng and Xu Qing in the leading roles. The series is an adaptation of Louis Cha's novel The Smiling, Proud Wanderer. It was first broadcast on CCTV in China in 2001. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Xu Qing Li Yapeng Full Cast & Crew Last Season Season 1 2001 | 40 Episodes Season 1 of Laughing in the Wind premiered on March 25, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Laughing in the Wind. You can help by rating TV shows you've seen. Facts Original Name  笑傲江湖 Status  Ended Network CCTV Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres No genres have been added. Keywords wuxia Content Score 36 There's no 'I' in team... Top Contributors 9 thirstyhippo 1 galani 1 Hamid Mohammadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}