{"link": "https://www.themoviedb.org/tv/4331?language=en", "title": "Wonder Woman", "resume": "Wonder Woman is an American television series based on the DC Comics comic book superheroine of the same name. Starring Lynda Carter as Wonder Woman/Diana Prince and Lyle Waggoner as Steve Trevor (both Sr. & Jr.), the show originally aired from 1975 to 1979.\nThe series was first introduced to audiences in 1975 with a TV movie (the pilot) as \"The New, Original Wonder Woman.\"  Two subsequent \"specials\" followed, which would be the next two episodes in the series' run (\"Wonder Woman Meets Baroness Von Gunther\" & \"Fausta, The Nazi Wonder Woman\").  ABC ordered the remaining 10 episodes to finish out what would be season one.\nABC canceled the show after one season, but CBS picked it up for seasons 2 and 3.  Revamped to modern day 1977, the show began season 2 retitled \"The New Adventures of Wonder Woman,\" and showcased Diana returning to the U.S. 35 years after she'd first left Paradise Island.  Lynda's Wonder Woman costume was altered a bit by original designer Donfeld, Diana would now be employed by the I.A.D.C. (Inter-Agency Defense Command), and her boss would be the son of Steve Trevor, Sr., from Diana's first foray to the U.S. in 1942.\nThe show was canceled in 1979, the last true episode being \"The Man Who Could Not Die.\"  This episode began with Diana moving into a new house in L.A. (working at the west coast headquarters of the I.A.D.C.), Lyle Waggoner having left the show altogether (and out of the opening credits).  Often aired out of order, though, the show's last two episodes (including Waggoner) are sometimes run as \"The Phantom of the Roller Coaster\" Parts 1 & 2.", "rate": 65, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Drama"], "cast": ["Lynda Carter", "Lyle Waggoner"], "character": ["Wonder Woman / Diana Prince", "Steve Trevor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4331   Expand Wonder Woman   (1975) User Score  Play Trailer Overview Wonder Woman is an American television series based on the DC Comics comic book superheroine of the same name. Starring Lynda Carter as Wonder Woman/Diana Prince and Lyle Waggoner as Steve Trevor (both Sr. & Jr.), the show originally aired from 1975 to 1979. The series was first introduced to audiences in 1975 with a TV movie (the pilot) as \"The New, Original Wonder Woman.\"  Two subsequent \"specials\" followed, which would be the next two episodes in the series' run (\"Wonder Woman Meets Baroness Von Gunther\" & \"Fausta, The Nazi Wonder Woman\").  ABC ordered the remaining 10 episodes to finish out what would be season one. ABC canceled the show after one season, but CBS picked it up for seasons 2 and 3.  Revamped to modern day 1977, the show began season 2 retitled \"The New Adventures of Wonder Woman,\" and showcased Diana returning to the U.S. 35 years after she'd first left Paradise Island.  Lynda's Wonder Woman costume was altered a bit by original designer Donfeld, Diana would now be employed by the I.A.D.C. (Inter-Agency Defense Command), and her boss would be the son of Steve Trevor, Sr., from Diana's first foray to the U.S. in 1942. The show was canceled in 1979, the last true episode being \"The Man Who Could Not Die.\"  This episode began with Diana moving into a new house in L.A. (working at the west coast headquarters of the I.A.D.C.), Lyle Waggoner having left the show altogether (and out of the opening credits).  Often aired out of order, though, the show's last two episodes (including Waggoner) are sometimes run as \"The Phantom of the Roller Coaster\" Parts 1 & 2. Featured Crew William Moulton Marston Creator Stanley Ralph Ross Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  3 Images Backdrops  7 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Lynda Carter Wonder Woman / Diana Prince Lyle Waggoner Steve Trevor Full Cast & Crew Last Season Season 3 1978 | 24 Episodes Season 3 of Wonder Woman premiered on September 22, 1978. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply w Male or female villains Open 1 by  thomasguide2 jumped time era Open 1 by  thomasguide2 w Wonder Woman: Happy Birthday Lynda Carter! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  7 Posters  7 Recommendations   1966-09-10 Space Ghost and Dino Boy 7.2    1968-09-14 The Adventures of Batman 7.4    1977-01-14 Fantasy Island 6.5    Silver Surfer: The Animated Series 7.7    1977-02-10 The New Adventures of Batman 6.0    1978-03-10 The Incredible Hulk 6.4    1983-10-03 Scarecrow and Mrs. King 5.5    1972-09-09 Fat Albert and the Cosby Kids 8.0  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Drama Keywords strong woman dc comics superhero superheroine based on comic super power Content Score 71 Just a little bit more... Top Contributors 26 Banana 26 BryanB 10 Elizabeth Jennings C 9 Chris  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}