{"link": "https://www.themoviedb.org/tv/18371?language=en", "title": "On Air", "resume": "On Air is a 2008 South Korean television series, starring Kim Ha-neul, Park Yong-ha, Lee Beom-soo and Song Yun-ah. It aired on SBS from March 5 to May 15, 2008 on Wednesdays and Thursdays at 21:55 for 21 episodes. The series is a behind-the-scenes look at a fictional television drama, revealing fascinating details about what normally goes on behind a TV drama production.", "rate": 0, "genre": ["Drama"], "cast": ["Park Yong-ha", "Kim Ha-neul", "Song Yun-ah", "Kang Hye-jung", "Lee Hyeong-cheol"], "character": ["Jin Sang-woo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18371   Expand On Air   (2008) User Score Overview On Air is a 2008 South Korean television series, starring Kim Ha-neul, Park Yong-ha, Lee Beom-soo and Song Yun-ah. It aired on SBS from March 5 to May 15, 2008 on Wednesdays and Thursdays at 21:55 for 21 episodes. The series is a behind-the-scenes look at a fictional television drama, revealing fascinating details about what normally goes on behind a TV drama production. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Yong-ha Kim Ha-neul Song Yun-ah Kang Hye-jung Lee Hyeong-cheol Jin Sang-woo Full Cast & Crew Last Season Season 1 — | 21 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on On Air. You can help by rating TV shows you've seen. Facts Original Name  온에어 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://tv.sbs.co.kr/onair/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 7 tmdb983464 N 5 Nightowl.Kr A 2 Aka75 2 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}