{"link": "https://www.themoviedb.org/tv/7561?language=en", "title": "Roman Mysteries", "resume": "Roman Mysteries is a television series based on the series of children's historical novels by Caroline Lawrence. It is reportedly the most expensive British children's TV series to date at £1 million per hour.\nThe series began filming in June 2006 and was first broadcast from 8 May 2007. The series is divided into \"scrolls\", each based on one book, starting with The Secrets of Vesuvius. The stories are told in the same order as the book series, except for book 6, The Twelve Tasks of Flavia Gemina, which is transposed to the second season. Books 11 and 12 were not adapted, and the series ends with the adaptation of Book 13. Each scroll consists of two half-hour episodes. The first scroll guest-starred Simon Callow as Pliny the Elder.\nOn 22 May 2007, after just two episodes, Anne Foy announced on CBBC on BBC One that the show has been postponed due to recent events in the news and would return later in the year on CBBC on BBC One. Since \"The Pirates of Pompeii\" was about children being kidnapped, the postponement was most likely due to the then recent disappearance of Madeleine McCann. On 19 June the series began broadcasting again from the beginning.\nFilming for the second season began on 13 August 2007. The episodes are based on the novels The Gladiators from Capua, The Twelve Tasks of Flavia Gemina, The Colossus of Rhodes, The Fugitive from Corinth and The Slave-girl from Jerusalem.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Harry Stott", "Francesca Isherwood", "Simon Callow"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7561   Expand Roman Mysteries   (2007) User Score Overview Roman Mysteries is a television series based on the series of children's historical novels by Caroline Lawrence. It is reportedly the most expensive British children's TV series to date at £1 million per hour. The series began filming in June 2006 and was first broadcast from 8 May 2007. The series is divided into \"scrolls\", each based on one book, starting with The Secrets of Vesuvius. The stories are told in the same order as the book series, except for book 6, The Twelve Tasks of Flavia Gemina, which is transposed to the second season. Books 11 and 12 were not adapted, and the series ends with the adaptation of Book 13. Each scroll consists of two half-hour episodes. The first scroll guest-starred Simon Callow as Pliny the Elder. On 22 May 2007, after just two episodes, Anne Foy announced on CBBC on BBC One that the show has been postponed due to recent events in the news and would return later in the year on CBBC on BBC One. Since \"The Pirates of Pompeii\" was about children being kidnapped, the postponement was most likely due to the then recent disappearance of Madeleine McCann. On 19 June the series began broadcasting again from the beginning. Filming for the second season began on 13 August 2007. The episodes are based on the novels The Gladiators from Capua, The Twelve Tasks of Flavia Gemina, The Colossus of Rhodes, The Fugitive from Corinth and The Slave-girl from Jerusalem. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Harry Stott Francesca Isherwood Simon Callow Full Cast & Crew Last Season The  season 2 2008 | 10 Episodes Season 2 of Roman Mysteries premiered on July  8, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Roman Mysteries. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 60m, 30m Homepage   http://www.bbc.co.uk/cbbc/romanmysteries/index.shtml Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors s 3 speedycars TS 3 Tony S.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}