{"link": "https://www.themoviedb.org/tv/39484?language=en", "title": "Extreme Weight Loss", "resume": "Extreme Weight Loss is a television program from ABC in which individuals volunteer to receive training and lifestyle changes from trainer Chris Powell. The show is slightly based on the original concept of Extreme Makeover, where individuals receive life-changing makeovers. The exception is that this show focuses primarily on participants losing massive amounts of weight over one year and receiving plastic surgery to remove the excess skin from their transformations.", "rate": 50, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39484   Expand Extreme Weight Loss   (2011) User Score Overview Extreme Weight Loss is a television program from ABC in which individuals volunteer to receive training and lifestyle changes from trainer Chris Powell. The show is slightly based on the original concept of Extreme Makeover, where individuals receive life-changing makeovers. The exception is that this show focuses primarily on participants losing massive amounts of weight over one year and receiving plastic surgery to remove the excess skin from their transformations. Featured Crew Tom Forman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2015 | 13 Episodes Season 5 of Extreme Weight Loss premiered on May 26, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Extreme Weight Loss. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://abc.go.com/shows/extreme-weight-loss Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors TB 10 TMDb Bot 9 Elizabeth Jennings z 5 zurman1 ea 5 elizabeth aden  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}