{"link": "https://www.themoviedb.org/tv/59149?language=en", "title": "Burning Bush", "resume": "Burning Bush is a 2013 three-part mini-series created for HBO by Polish director Agnieszka Holland. Based on real characters and events, this haunting drama focuses on the personal sacrifice of a Prague history student, Jan Palach, who set himself on fire in protest against the Soviet occupation of Czechoslovakia in 1969. Dagmar Burešová, a young female lawyer, became part of his legacy by defending Jan's family in a trial against the communist government, a regime which tried to dishonour Palach’s sacrifice, a heroic action for the freedom of Czechoslovakia. Jan and Dagmar’s story is one of basic human values, truth, honour, justice and courage.", "rate": 74, "genre": ["Drama", "War", "Politics"], "cast": ["Petr Stach", "Igor Bareš", "Tatiana Pauhofová", "Jaroslava Pokorná", "Martin Huba"], "character": ["Jiří Palach", "Major Dočekal", "Dagmar Buresová", "Libuše Palachová", "Vilém Nový"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59149   Expand Burning Bush   (2013) User Score  Play Trailer Overview Burning Bush is a 2013 three-part mini-series created for HBO by Polish director Agnieszka Holland. Based on real characters and events, this haunting drama focuses on the personal sacrifice of a Prague history student, Jan Palach, who set himself on fire in protest against the Soviet occupation of Czechoslovakia in 1969. Dagmar Burešová, a young female lawyer, became part of his legacy by defending Jan's family in a trial against the communist government, a regime which tried to dishonour Palach’s sacrifice, a heroic action for the freedom of Czechoslovakia. Jan and Dagmar’s story is one of basic human values, truth, honour, justice and courage. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Petr Stach Jiří Palach Igor Bareš Major Dočekal Tatiana Pauhofová Dagmar Buresová Jaroslava Pokorná Libuše Palachová Martin Huba Vilém Nový Full Cast & Crew Last Season Miniseries 2013 | 3 Episodes Season 1 of Burning Bush premiered on January 27, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Burning Bush. You can help by rating TV shows you've seen. Facts Original Name  Hořící keř Status  Ended Network Certification  - Type  Miniseries Original Language  Czech Runtime  77m Homepage   http://www.hbo.cz/series/horici-ker Genres Drama War & Politics Keywords czechoslovakia miniseries 1960s Content Score 93 Almost there... Top Contributors R 36 Rebecca TB 34 TMDb Bot 16 mr_enes md 8 movie dino  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}