{"link": "https://www.themoviedb.org/tv/63063?language=en", "title": "Singles Villa", "resume": "Love thy neighbor? Think again! Singles Villa may be the hottest apartment complex around, but all its tenants face eviction if they fall in love with one another. Residents Qiao Sheng Yu and Jiang Ke Xin agree to these terms — up until they fall in love, that is. On top of making sure that whatever happens behind closed doors stays behind closed doors, things get even trickier for these loving neighbors when Ke Xin's former sweetheart Chi Bo Yuan turns up on her doorstep.", "rate": 75, "genre": ["Drama"], "cast": ["Joe Cheng", "Jiro Wang", "Lulu Xu", "Zhang Xinyu"], "character": ["Qiao Sheng Yu", "Chi Bo Yuan", "Jiang Ke Xin", "Lin Man Ni"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63063   Expand Singles Villa   (2015) User Score Overview Love thy neighbor? Think again! Singles Villa may be the hottest apartment complex around, but all its tenants face eviction if they fall in love with one another. Residents Qiao Sheng Yu and Jiang Ke Xin agree to these terms — up until they fall in love, that is. On top of making sure that whatever happens behind closed doors stays behind closed doors, things get even trickier for these loving neighbors when Ke Xin's former sweetheart Chi Bo Yuan turns up on her doorstep. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Cheng Qiao Sheng Yu Jiro Wang Chi Bo Yuan Lulu Xu Jiang Ke Xin Zhang Xinyu Lin Man Ni Full Cast & Crew Last Season Season 1 2015 | 24 Episodes Season 1 of Singles Villa premiered on January  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Singles Villa. You can help by rating TV shows you've seen. Facts Original Name  只因单身在一起 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.hunantv.com/v/2/101595/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 31 Maria180493 6 Elizabeth Jennings TB 2 TMDb Bot 1 MaFt  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}