{"link": "https://www.themoviedb.org/tv/68645?language=en", "title": "Nissene over skog og hei", "resume": "Ten years after the smash hit \"Nissene på låven\", the Christmas gnomes are finally back. In \"Nissene over Skog og Hei\" the Christmas gnomes has left the barn, and embarks on a journey through our vast country. There will be a reunion with beloved characters, and we meet some newcomers.", "rate": 0, "genre": ["Comedy", "Family"], "cast": ["Espen Eckbo", "Kristian Ødegård", "Henrik Elvestad", "Atle Antonsen", "Trond Fausa Aurvåg"], "character": ["Asbjørn Brekke / Rhino Thue", "Himself", "Timothy Dahle", "Bent Leikvoll", "Steven Evensen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68645   Expand Nissene over skog og hei   (2011) User Score Overview Ten years after the smash hit \"Nissene på låven\", the Christmas gnomes are finally back. In \"Nissene over Skog og Hei\" the Christmas gnomes has left the barn, and embarks on a journey through our vast country. There will be a reunion with beloved characters, and we meet some newcomers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Espen Eckbo Asbjørn Brekke / Rhino Thue Kristian Ødegård Himself Henrik Elvestad Timothy Dahle Atle Antonsen Bent Leikvoll Trond Fausa Aurvåg Steven Evensen Full Cast & Crew Last Season Season 1 2011 | 24 Episodes Season 1 of Nissene over skog og hei premiered on December  1, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nissene over skog og hei. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Norwegian Runtime  12m Homepage  - Genres Comedy Family Keywords nordic christmas calendar Content Score 86 Almost there... Top Contributors 29 Bendik t 6 thimbo9 M 6 Mr_Democracy 5 tbonus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}