{"link": "https://www.themoviedb.org/tv/53414?language=en", "title": "Secret Fairway", "resume": "Year 1944 ... Year breakthrough victorious in World War II, but in the Baltic theater of naval battles yet quiet. The line of duty, the commander of a torpedo boat Boris Shubin accidentally discovers a secret German submarine fairway unmarked. An emergency throws it on the \"Flying Dutchman\" and makes it possible to lift the veil of the strictest secrecy of the Third Reich, which surrounds it ...", "rate": 85, "genre": ["Action", "Adventure", "Drama", "War", "Politics"], "cast": ["Vyacheslav Bogatyrev", "Anatoliy Kotenyov", "Sergey Bystritskiy", "Larisa Guzeeva", "Boris Borisov"], "character": ["Lastikov v detstve", "Boris Shubin", "Shurka Lastikov (adult)", "Viktoria Mezentseva", "Ryshkov"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53414   Expand Secret Fairway   (1986) User Score Overview Year 1944 ... Year breakthrough victorious in World War II, but in the Baltic theater of naval battles yet quiet. The line of duty, the commander of a torpedo boat Boris Shubin accidentally discovers a secret German submarine fairway unmarked. An emergency throws it on the \"Flying Dutchman\" and makes it possible to lift the veil of the strictest secrecy of the Third Reich, which surrounds it ... Featured Crew Vadim Kostromenko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vyacheslav Bogatyrev Lastikov v detstve Anatoliy Kotenyov Boris Shubin Sergey Bystritskiy Shurka Lastikov (adult) Larisa Guzeeva Viktoria Mezentseva Boris Borisov Ryshkov Full Cast & Crew Last Season Season 1 1986 | 4 Episodes Season 1 of Secret Fairway premiered on January  5, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Secret Fairway. You can help by rating TV shows you've seen. Facts Original Name  Секретный фарватер Status  Ended Network Certification 0+ Meaning Can be watched by Any Age. Type  Miniseries Original Language  Russian Runtime  - Homepage  - Genres Action & Adventure Drama War & Politics Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors n 22 navarro2018 A 8 Andrey_T 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}