{"link": "https://www.themoviedb.org/tv/43912?language=en", "title": "Decked Out", "resume": "Decked Out is a Canadian home renovation television series, which airs on HGTV Canada. Hosted by Paul Lafrance, a contractor who owns Cutting Edge Construction and Design in Pickering, Ontario, each episode depicts Lafrance and his team designing and building a unique and dramatic deck for a client.\nPrior to launching his own series, Lafrance appeared on several episodes of Breakfast Television and Holmes Inspection.\nLafrance subsequently also launched Deck Wars, a spinoff program in which he moderates a competition between two homeowners each building their own decks.", "rate": 0, "genre": ["Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43912   Expand Decked Out   (2012) User Score Overview Decked Out is a Canadian home renovation television series, which airs on HGTV Canada. Hosted by Paul Lafrance, a contractor who owns Cutting Edge Construction and Design in Pickering, Ontario, each episode depicts Lafrance and his team designing and building a unique and dramatic deck for a client. Prior to launching his own series, Lafrance appeared on several episodes of Breakfast Television and Holmes Inspection. Lafrance subsequently also launched Deck Wars, a spinoff program in which he moderates a competition between two homeowners each building their own decks. Featured Crew Stephen Milne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2013 | 13 Episodes Season 3 of Decked Out premiered on May  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Decked Out. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Family Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}