{"link": "https://www.themoviedb.org/tv/62530?language=en", "title": "Dead End Express", "resume": "Across our country's vast and untamed wildernesses a hardy breed of American still lives a life set apart. They are not just off-the-grid, they are physically cut off from society by Rocky Mountains, roaring rivers and frozen tundra. But however self-sufficient...no man’s an island. Sooner or later, these off-gridders need a life-giving tool - like fuel or bullets - or a life-saving essential - like food or medicine. When they do, they turn to the cast of Dead End Express. By pack horse, dog sled, power boat, snow machine and bush plane this unique group of men risk all to deliver where no one else can or will. Delivering their payload is a matter of life or death, not just for their clients but for them, in their ongoing mission to survive and deliver.", "rate": 60, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62530   Expand Dead End Express   (2015) User Score Overview Across our country's vast and untamed wildernesses a hardy breed of American still lives a life set apart. They are not just off-the-grid, they are physically cut off from society by Rocky Mountains, roaring rivers and frozen tundra. But however self-sufficient...no man’s an island. Sooner or later, these off-gridders need a life-giving tool - like fuel or bullets - or a life-saving essential - like food or medicine. When they do, they turn to the cast of Dead End Express. By pack horse, dog sled, power boat, snow machine and bush plane this unique group of men risk all to deliver where no one else can or will. Delivering their payload is a matter of life or death, not just for their clients but for them, in their ongoing mission to survive and deliver. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Dead End Express premiered on May  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dead End Express. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://channel.nationalgeographic.com/dead-end-express/ Genres Reality Keywords wilderness Content Score 56 We're so close, yet so far. Top Contributors 14 Elizabeth Jennings 6 Banana LC 5 Legit Corporation TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}