{"link": "https://www.themoviedb.org/tv/67015?language=en", "title": "Ice Fantasy", "resume": "The story is set a hundred years after a war between the Empire of Snow (Ice Tribe) and the Fire Tribe, where the Fire Tribe was defeated. However, the war was fatal, leaving Prince Ka Suo and his younger half-brother Ying Kong Shi the only royal heirs and pure-blood ice illusionists left in the Ice Tribe. Conflict ensues after Ka Suo reluctantly ascends to the throne as his lover, Li Luo, and his brother go missing. Ka Suo also accidentally discovers an evil presence lurking in the Ice Tribe's holy shrine. He and his companions enter the mysterious shrine, and defeat head of the shrine, Lady Yuan Ji, only to find out that she has been plotting a conspiracy against him. Ka Suo also experiences hardships in trying to find his lover and brother, not knowing that his brother has lost all of his memories and has become the Fire Prince under his mother's command. A war between the two tribes commences once again, with the two brothers pitted against each other.", "rate": 59, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["William Feng", "Victoria Song", "Ma Tianyu", "Zhang Meng", "Madina Memet"], "character": ["Ka Suo", "Li Luo", "Ying Kongshi", "Yan Da", "Lan Shang"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67015   Expand Ice Fantasy   (2016) User Score Overview The story is set a hundred years after a war between the Empire of Snow (Ice Tribe) and the Fire Tribe, where the Fire Tribe was defeated. However, the war was fatal, leaving Prince Ka Suo and his younger half-brother Ying Kong Shi the only royal heirs and pure-blood ice illusionists left in the Ice Tribe. Conflict ensues after Ka Suo reluctantly ascends to the throne as his lover, Li Luo, and his brother go missing. Ka Suo also accidentally discovers an evil presence lurking in the Ice Tribe's holy shrine. He and his companions enter the mysterious shrine, and defeat head of the shrine, Lady Yuan Ji, only to find out that she has been plotting a conspiracy against him. Ka Suo also experiences hardships in trying to find his lover and brother, not knowing that his brother has lost all of his memories and has become the Fire Prince under his mother's command. A war between the two tribes commences once again, with the two brothers pitted against each other. Featured Crew Jingming Guo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Feng Ka Suo Victoria Song Li Luo Ma Tianyu Ying Kongshi Zhang Meng Yan Da Madina Memet Lan Shang Full Cast & Crew Last Season Season 2 2017 | 16 Episodes Season 2 of Ice Fantasy premiered on March  8, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Ice Fantasy. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2015-07-22 Diamond Lover 6.9    2016-03-06 Refresh Man 7.0  Facts Original Name  幻城 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   https://www.famitsu.tw/product/IceFantasy.html Genres Drama Sci-Fi & Fantasy Keywords china romance Content Score 93 Almost there... Top Contributors M 58 Maria180493 19 Elizabeth Jennings 13 Mohammed Osama Mohamed M 8 MLATHOT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}