{"link": "https://www.themoviedb.org/tv/5184?language=en", "title": "The Best Years", "resume": "The Best Years is a Canadian teen drama series set in Boston, Massachusetts. The series was created by producer and writer of Degrassi: The Next Generation, Aaron Martin. The first season was shown on Global in Canada and The N in the United States. The second season was shown in the U.S. on The N and in Canada on E!, CanWest's secondary network.", "rate": 0, "genre": ["Drama"], "cast": ["Brandon Jay McLaren", "Athena Karkanis", "Niall Matter", "Jennifer Miller", "Charity Shea"], "character": ["Devon Sylver", "Dawn Vargaz", "Trent Hamilton", "Kathryn Klarner", "Samantha Best"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5184   Expand The Best Years   (2007) User Score Overview The Best Years is a Canadian teen drama series set in Boston, Massachusetts. The series was created by producer and writer of Degrassi: The Next Generation, Aaron Martin. The first season was shown on Global in Canada and The N in the United States. The second season was shown in the U.S. on The N and in Canada on E!, CanWest's secondary network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brandon Jay McLaren Devon Sylver Athena Karkanis Dawn Vargaz Niall Matter Trent Hamilton Jennifer Miller Kathryn Klarner Charity Shea Samantha Best Full Cast & Crew Last Season Season 2 2009 | 8 Episodes Season 2 of The Best Years premiered on April 21, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Best Years. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  43m, 60m, 42m Homepage   http://www.the-n.com/ntv/shows/index.php?id=654 Genres Drama Keywords boston college foster child young adult Content Score 86 Almost there... Top Contributors 11 Banana N 4 NoemiTalavera s 3 speedycars T 1 Torq00  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}