{"link": "https://www.themoviedb.org/tv/34159?language=en", "title": "Corrector Yui", "resume": "Corrector Yui is a magical girl anime series created by Kia Asamiya. The anime series was produced by Nippon Animation and Studio Pierrot. Broadcast on NHK from 1999 to 2000. It was licensed for North American release by Viz Media. This series has aired on Cartoon Network outside of the United States.\nTwo manga series were also released: a two volume series by Asamiya and published in Ciao from 1999 to 2000; and a nine volume two-part series by Keiko Okamoto which was published by NHK Publishing. The second manga series was licensed in North America and translated into English by TOKYOPOP beginning in 2002.\nThis series follows a basic magical-girl progression, and falls into many of the magical girl tropes common in the late nineties. The series is innovative amongst magical girl series in that Yui's powers all derive from not just the technology she uses, but are incorporated entirely into her on-line avatar, with no real powers granted outside of the network.", "rate": 0, "genre": ["Animation"], "cast": ["Mugihito", "Makiko Ohmoto", "Yuko Kagata", "Kae Araki", "Akiko Kimura"], "character": ["Professor Inukai", "Yui Kasuga", "Haruna Kisaragi", "Ai Shinozaki", "Rescue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34159   Expand Corrector Yui   (1999) User Score Overview Corrector Yui is a magical girl anime series created by Kia Asamiya. The anime series was produced by Nippon Animation and Studio Pierrot. Broadcast on NHK from 1999 to 2000. It was licensed for North American release by Viz Media. This series has aired on Cartoon Network outside of the United States. Two manga series were also released: a two volume series by Asamiya and published in Ciao from 1999 to 2000; and a nine volume two-part series by Keiko Okamoto which was published by NHK Publishing. The second manga series was licensed in North America and translated into English by TOKYOPOP beginning in 2002. This series follows a basic magical-girl progression, and falls into many of the magical girl tropes common in the late nineties. The series is innovative amongst magical girl series in that Yui's powers all derive from not just the technology she uses, but are incorporated entirely into her on-line avatar, with no real powers granted outside of the network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mugihito Professor Inukai Makiko Ohmoto Yui Kasuga Yuko Kagata Haruna Kisaragi Kae Araki Ai Shinozaki Akiko Kimura Rescue Full Cast & Crew Last Season Season 1 2006 | 24 Episodes Season 1 of Corrector Yui premiered on January  1, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Corrector Yui. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors m 3 magoozin NS 1 Norte Serra 1 LeonardoRCS  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}