{"link": "https://www.themoviedb.org/tv/68954?language=en", "title": "The Cliff", "resume": "A Reykjavik crime detective is sent to a small rural community in Iceland to help a young local policewoman investigate a suspicious accident. Together they unravel a mystery that involves bizarre incidents and unexplained deaths, set against the backdrop of a controversial hydroelectric project.", "rate": 73, "genre": ["Crime"], "cast": ["Björn Hlynur Haraldsson", "Thorir Sæmundsson", "Dóra Jóhannsdóttir", "Tinna Hrafnsdóttir", "Elma Lísa Gunnarsdóttir"], "character": ["Homicide and Violent Crimes Detective Helgi Marvinsson", "Snorri", "Inga", "Anna", "Dora"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68954   Expand The Cliff   (2009) User Score Overview A Reykjavik crime detective is sent to a small rural community in Iceland to help a young local policewoman investigate a suspicious accident. Together they unravel a mystery that involves bizarre incidents and unexplained deaths, set against the backdrop of a controversial hydroelectric project. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Björn Hlynur Haraldsson Homicide and Violent Crimes Detective Helgi Marvinsson Thorir Sæmundsson Snorri Dóra Jóhannsdóttir Inga Tinna Hrafnsdóttir Anna Elma Lísa Gunnarsdóttir Dora Full Cast & Crew Last Season Miniseries 2009 | 4 Episodes Season 1 of The Cliff premiered on October  4, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Cliff. You can help by rating TV shows you've seen. Facts Original Name  Hamarinn Status  Ended Network Certification  - Type  Miniseries Original Language  Icelandic Runtime  45m Homepage   http://ruv.is/thaettir/hamarinn Genres Crime Keywords cliff supernatural iceland mystery miniseries tv series Content Score 71 Just a little bit more... Top Contributors B 50 Babalube 8 Banana TB 6 TMDb Bot 3 MichelD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}