{"link": "https://www.themoviedb.org/tv/64254?language=en", "title": "Master of None", "resume": "30-year-old New York actor Dev takes on such pillars of maturity as the first big job, a serious relationship, and busting sex offenders on the subway.", "rate": 80, "genre": ["Comedy"], "cast": ["Aziz Ansari", "Eric Wareheim", "Alessandra Mastronardi", "Lena Waithe", "Bobby Cannavale"], "character": ["Dev", "Arnold", "Francesca", "Denise", "Jeff"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64254   Expand Master of None   (2015) User Score  Play Trailer Overview 30-year-old New York actor Dev takes on such pillars of maturity as the first big job, a serious relationship, and busting sex offenders on the subway. Featured Crew Aziz Ansari Creator Alan Yang Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  7 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aziz Ansari Dev Eric Wareheim Arnold Alessandra Mastronardi Francesca Lena Waithe Denise Bobby Cannavale Jeff Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of Master of None premiered on May 12, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Did they ever explain Open 4 by  kmyre \"Did she stay or not...?\" (SPOILERS!!!) Open 3 by  MirrorMask Season 2 Open 10 by  gilknut Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  7 Recommendations   2016-02-19 Love 7.4    2015-03-06 Unbreakable Kimmy Schmidt 7.2    2014-08-22 BoJack Horseman 8.0    2016-03-11 Flaked 7.2    2016-09-06 Atlanta 7.5    2003-11-02 Arrested Development 8.2    2009-04-09 Parks and Recreation 7.9    2016-05-20 Lady Dynamite 5.9  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 30m Homepage   http://www.netflix.com/title/80049714 Genres Comedy Keywords new york indian lead thirty something actor Content Score 100 Yes! Looking good! Top Contributors 61 Elizabeth Jennings 24 charlieaus 14 Banana 11 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}