{"link": "https://www.themoviedb.org/tv/34787?language=en", "title": "Futakoi Alternative", "resume": "Futakoi Alternative is a Japanese anime series by ufotable. The series ran for 13 episodes from 7 April 2005 to 30 June 2005. The show features many of the characters from the original Futakoi, though the story and settings are completely different. A manga adaptation of the show is illustrated by Kanao Araki.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Kaori Mizuhashi", "Tomokazu Seki", "Mai Kadowaki", "Yui Horie", "Ami Koshimizu"], "character": ["Sara Shirogane", "Rentarou Futaba", "Souju Shirogane", "Kaoruko Ichijō", "Sumireko Ichijō"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34787   Expand Futakoi Alternative   (2005) User Score Overview Futakoi Alternative is a Japanese anime series by ufotable. The series ran for 13 episodes from 7 April 2005 to 30 June 2005. The show features many of the characters from the original Futakoi, though the story and settings are completely different. A manga adaptation of the show is illustrated by Kanao Araki. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaori Mizuhashi Sara Shirogane Tomokazu Seki Rentarou Futaba Mai Kadowaki Souju Shirogane Yui Horie Kaoruko Ichijō Ami Koshimizu Sumireko Ichijō Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of Futakoi Alternative premiered on April  7, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Futakoi Alternative. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 seboseboss m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}