{"link": "https://www.themoviedb.org/tv/563?language=en", "title": "Stingers", "resume": "Stingers was an Australian police drama television series. It ran for eight seasons on the Nine Network before it was canceled in late 2004 due to declining ratings and the late timeslot Channel Nine gave the program. The series has also aired in 65 countries, including Canada, Denmark, Egypt, France, Iran, Ireland, Belgium, Luxembourg, Netherlands, New Zealand, Norway, Poland, Portugal, South Africa, Spain, Sweden, Turkey, and the United Kingdom.\nInspired by true events, Stingers chronicled the cases of a deep undercover unit of the Victoria Police. The series also followed their personal lives, which sometimes became intertwined with their jobs. The show received average ratings during its debut season, but after some major changes, including intensive character development, the series turned out to be a success during the following year. The original cast members include Peter Phelps, Joe Petruzzi, Kate Kendall, Ian Stenlake, Anita Hegh, and Jessica Napier. All except Kendall and Phelps left the show during its run.", "rate": 0, "genre": ["Drama"], "cast": ["Anita Hegh", "Peter Phelps", "Kate Kendall", "Roxane Wilson", "Ian Stenlake"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 563   Expand Stingers   (1998) User Score Overview Stingers was an Australian police drama television series. It ran for eight seasons on the Nine Network before it was canceled in late 2004 due to declining ratings and the late timeslot Channel Nine gave the program. The series has also aired in 65 countries, including Canada, Denmark, Egypt, France, Iran, Ireland, Belgium, Luxembourg, Netherlands, New Zealand, Norway, Poland, Portugal, South Africa, Spain, Sweden, Turkey, and the United Kingdom. Inspired by true events, Stingers chronicled the cases of a deep undercover unit of the Victoria Police. The series also followed their personal lives, which sometimes became intertwined with their jobs. The show received average ratings during its debut season, but after some major changes, including intensive character development, the series turned out to be a success during the following year. The original cast members include Peter Phelps, Joe Petruzzi, Kate Kendall, Ian Stenlake, Anita Hegh, and Jessica Napier. All except Kendall and Phelps left the show during its run. Featured Crew Tony Morphett Creator Mikael Borglund Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anita Hegh Peter Phelps Kate Kendall Roxane Wilson Ian Stenlake Full Cast & Crew Last Season Season 1 1998 | 1 Episode Season 1 of Stingers premiered on September 29, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Stingers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors i 13 ismax935 s 2 speedycars H 1 Hard t 1 tmdb59661364  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}