{"link": "https://www.themoviedb.org/tv/74335?language=en", "title": "Monster List", "resume": "A story about two young demons who are always slacking off at work, a place that happens to be an organization that vows to keep the balA foxy temptress. A strange misty tree demon. A girl with the power of the goddess Xianjia! Being caught between these women is a feat in it of itself, but our hero Feng Xi must fight in order to protect the peace and save the world!ance between the worlds of the living and dead by killing humans!", "rate": 0, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74335   Expand Monster List   (2014) User Score Overview A story about two young demons who are always slacking off at work, a place that happens to be an organization that vows to keep the balA foxy temptress. A strange misty tree demon. A girl with the power of the goddess Xianjia! Being caught between these women is a feat in it of itself, but our hero Feng Xi must fight in order to protect the peace and save the world!ance between the worlds of the living and dead by killing humans! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2017 | 21 Episodes Season 2 of Monster List premiered on August  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Monster List. You can help by rating TV shows you've seen. Facts Original Name  妖怪名单 Status  Ended Networks - Certification 12 Meaning Not recommended for children under 12. Not allowed air before 10:00 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  Chinese Runtime  13m Homepage  - Genres Animation Comedy Keywords fantasy romance demon combat ecchi Content Score 56 We're so close, yet so far. Top Contributors 23 seboseboss m 3 magoozin 3 Sandkyle H 1 Heleandra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}