{"link": "https://www.themoviedb.org/tv/194?language=en", "title": "NYPD Blue", "resume": "NYPD Blue is an American television police drama set in New York City, exploring the internal and external struggles of the fictional 15th precinct of Manhattan. Each episode typically intertwined several plots involving an ensemble cast.\nThe show was created by Steven Bochco and David Milch and was inspired by Milch's relationship with Bill Clark, a former member of the New York City Police Department who eventually became one of the show's producers. The series was broadcast on the ABC network from its debut on September 21, 1993‚ and aired its final episode on March 1, 2005. It remains ABC's longest-running primetime one-hour drama series.\nIn 1997, \"True Confessions\", written by Art Monterastelli and directed by Charles Haid was ranked #36 on TV Guide's 100 Greatest Episodes of All Time. In 2009, TV Guide ranked Hearts and Souls, Jimmy Smits' final episode written by Steven Bochco, David Milch, Bill Clark, and Nicholas Wootton and directed by Paris Barclay, #30 on TV Guide's 100 Greatest Episodes of All Time.", "rate": 67, "genre": ["Drama"], "cast": ["Dennis Franz", "Mark-Paul Gosselaar", "Gordon Clapp", "Henry Simmons", "Bill Brochtrup"], "character": ["Andy Sipowicz", "John Clark Jr.", "Greg Medavoy", "Baldwin Jones", "John Irvin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 194   Expand NYPD Blue   (1993) User Score  Play Trailer Overview NYPD Blue is an American television police drama set in New York City, exploring the internal and external struggles of the fictional 15th precinct of Manhattan. Each episode typically intertwined several plots involving an ensemble cast. The show was created by Steven Bochco and David Milch and was inspired by Milch's relationship with Bill Clark, a former member of the New York City Police Department who eventually became one of the show's producers. The series was broadcast on the ABC network from its debut on September 21, 1993‚ and aired its final episode on March 1, 2005. It remains ABC's longest-running primetime one-hour drama series. In 1997, \"True Confessions\", written by Art Monterastelli and directed by Charles Haid was ranked #36 on TV Guide's 100 Greatest Episodes of All Time. In 2009, TV Guide ranked Hearts and Souls, Jimmy Smits' final episode written by Steven Bochco, David Milch, Bill Clark, and Nicholas Wootton and directed by Paris Barclay, #30 on TV Guide's 100 Greatest Episodes of All Time. Featured Crew David Milch Creator Steven Bochco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dennis Franz Andy Sipowicz Mark-Paul Gosselaar John Clark Jr. Gordon Clapp Greg Medavoy Henry Simmons Baldwin Jones Bill Brochtrup John Irvin Full Cast & Crew Last Season Season 12 2004 | 20 Episodes Season 12 of NYPD Blue premiered on September 21, 2004. View All Seasons Social Reviews  1 Discussions  0 A review by Baz  10.0 Written by  Baz  on April 12, 2018 Probably one of the pioneers in television series history. Some great writing and really compelling characters. Jimmy Smit’s shines.\nFirst tv show to reveal a man’s bare backside.\nAlso introduced the openly gay character who works in the police precinct.\nIt’s good old tv done well! Read All Reviews Media Most Popular Videos  1 Backdrops  3 Posters  15 Recommendations   1981-01-15 Hill Street Blues 7.4    1990-09-13 Law & Order 7.2    1994-09-19 ER 6.9    2001-09-30 Law & Order: Criminal Intent 7.1    1976-03-21 Charlie's Angels 5.9    2001-09-24 Crossing Jordan 6.8    1978-03-10 The Incredible Hulk 6.4    1993-01-01 Dr. Quinn, Medicine Woman 6.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Drama Keywords new york police nypd police precinct Content Score 100 Yes! Looking good! Top Contributors 55 Elizabeth Jennings 27 United600 r 24 rick555 TS 6 Tony S.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}