{"link": "https://www.themoviedb.org/tv/66118?language=en", "title": "The Katering Show", "resume": "Fill the void in your life by joining celebrity chef, Kate McLennan, and her food intolerant friend, Kate McCartney, as they cook their way into the Food Culture Revolution with a series of edible recipes! Watch as The Kates create food intolerant-friendly meals and explore modern culinary trends like quitting sugar, food porn, food trucks and drinking shit out of jars! They road test everybody’s favourite culinary moneysuck, the Thermomix, and sample a range of libations like wine, whiskey and kombucha, the hot new drink that combines parasitical fungi with intestinal spasming! The Katering Show! Change your life through the power of good food and even better Friendship.", "rate": 80, "genre": ["Comedy"], "cast": ["Kate McCartney", "Kate McLennan"], "character": ["Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66118   Expand The Katering Show   (2015) User Score  Play Trailer Overview Fill the void in your life by joining celebrity chef, Kate McLennan, and her food intolerant friend, Kate McCartney, as they cook their way into the Food Culture Revolution with a series of edible recipes! Watch as The Kates create food intolerant-friendly meals and explore modern culinary trends like quitting sugar, food porn, food trucks and drinking shit out of jars! They road test everybody’s favourite culinary moneysuck, the Thermomix, and sample a range of libations like wine, whiskey and kombucha, the hot new drink that combines parasitical fungi with intestinal spasming! The Katering Show! Change your life through the power of good food and even better Friendship. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate McCartney Herself Kate McLennan Herself Full Cast & Crew Last Season Series 2 2016 | 8 Episodes Season 2 of The Katering Show premiered on April 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Katering Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  9m, 7m Homepage   http://thekateringshow.com/ Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 25 United600 4 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}