{"link": "https://www.themoviedb.org/tv/31386?language=en", "title": "A Chip Off the Old Block", "resume": "A Chip Off the Old Block is a 2009 TVB television drama from Hong Kong produced and created by Poon Ka Tak. The original broadcast was on the TVB Jade with approximately 45-minute long episodes airing five days a week. The final two episodes were an hour and a half long each, which aired during the weekends. A Chip Off the Old Block tells the story of the articulate businessman Chor Chi, who accidentally travels back in time to the 1960s and meets his younger father, Chor Fan.", "rate": 0, "genre": ["Drama"], "cast": ["Nancy Wu", "Sunny Chan", "Myolie Wu"], "character": ["So Fung-nei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31386   Expand A Chip Off the Old Block   (2009) User Score Overview A Chip Off the Old Block is a 2009 TVB television drama from Hong Kong produced and created by Poon Ka Tak. The original broadcast was on the TVB Jade with approximately 45-minute long episodes airing five days a week. The final two episodes were an hour and a half long each, which aired during the weekends. A Chip Off the Old Block tells the story of the articulate businessman Chor Chi, who accidentally travels back in time to the 1960s and meets his younger father, Chor Fan. Featured Crew Poon Ka Tak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nancy Wu Sunny Chan Myolie Wu So Fung-nei Full Cast & Crew Last Season Season 1 2009 | 19 Episodes Season 1 of A Chip Off the Old Block premiered on November 30, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Chip Off the Old Block. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.programme.tvb.com/drama/achipofftheoldblock Genres Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}