{"link": "https://www.themoviedb.org/tv/61174?language=en", "title": "Bee and Puppycat", "resume": "Bee, a reluctant hero, becomes entangled in the adventures of a puppy (...or is he a cat?) as they travel between reality and the void of Fishbowl Space.", "rate": 85, "genre": ["Sci-Fi", "Fantasy", "Animation"], "cast": ["Allyn Rachel", "OLIVER (Vocaloid)", "Ashly Burch", "Frank Gibson", "Kent Osborne"], "character": ["Bee", "PuppyCat", "Cass", "Wallace", "Deckard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61174   Expand Bee and Puppycat   (2014) User Score Overview Bee, a reluctant hero, becomes entangled in the adventures of a puppy (...or is he a cat?) as they travel between reality and the void of Fishbowl Space. Featured Crew Natasha Allegri Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  2 Featurettes  0 Opening Credits  0 Top Billed Cast Allyn Rachel Bee OLIVER (Vocaloid) PuppyCat Ashly Burch Cass Frank Gibson Wallace Kent Osborne Deckard Full Cast & Crew Last Season Season 1 2014 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bee and Puppycat. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  7m Homepage   http://beeandpuppycat.cartoonhangover.com/ Genres Sci-Fi & Fantasy Animation Keywords hero cat slice of life female hero adventure hero odd job dimensional travel interdimensional beings space cat vocaloid temp agency Content Score 100 Yes! Looking good! Top Contributors 42 Stephen 7 McButton 3 lineker TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}