{"link": "https://www.themoviedb.org/tv/18421?language=en", "title": "The Jace Hall Show", "resume": "The Jace Hall Show is a video game show hosted by Jace Hall consisting of interviews with Hollywood celebrities and those involved in the video game industry. The Jace Hall Show is a production of HDFILMS, INC. and is distributed by IGN Entertainment. The complete series is available on Jacehallshow.com and syndicated on Crackle, IGN, Hulu, PlayStation Network, and Xbox Live. Co-starring on the show are Gary Graham, Todd Roy, Corey Craig, Marti Resteghini.", "rate": 0, "genre": ["Comedy"], "cast": ["Gary Graham"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18421   Expand The Jace Hall Show   (2008) User Score Overview The Jace Hall Show is a video game show hosted by Jace Hall consisting of interviews with Hollywood celebrities and those involved in the video game industry. The Jace Hall Show is a production of HDFILMS, INC. and is distributed by IGN Entertainment. The complete series is available on Jacehallshow.com and syndicated on Crackle, IGN, Hulu, PlayStation Network, and Xbox Live. Co-starring on the show are Gary Graham, Todd Roy, Corey Craig, Marti Resteghini. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Graham Full Cast & Crew Last Season Season 5 2012 | 13 Episodes Season 5 of The Jace Hall Show premiered on July 11, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Jace Hall Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://jacehall.tv/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}