{"link": "https://www.themoviedb.org/tv/2496?language=en", "title": "Mind of Mencia", "resume": "Mind of Mencia was an American television comedy series on the cable channel Comedy Central. Hosted by Carlos Mencia, it aired from 2005 to 2008.", "rate": 43, "genre": ["Comedy"], "cast": ["Carlos Mencia"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2496   Expand Mind of Mencia   (2005) User Score Overview Mind of Mencia was an American television comedy series on the cable channel Comedy Central. Hosted by Carlos Mencia, it aired from 2005 to 2008. Featured Crew Carlos Mencia Creator Robert Morton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carlos Mencia Full Cast & Crew Last Season Season 4 2008 | 10 Episodes Season 4 of Mind of Mencia premiered on May 21, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1994-10-30 Aaahh!!! Real Monsters 6.4    1993-09-18 Rocko's Modern Life 7.7  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://cc.com/shows/mind-of-mencia Genres Comedy Keywords sketch comedy Content Score 64 We're so close, yet so far. Top Contributors 6 Banana w 1 wonder2wonder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}