{"link": "https://www.themoviedb.org/tv/63789?language=en", "title": "Late Night Restaurant", "resume": "A restaurant opens at midnight until seven in the morning. Its mysterious owner and chef, simply called the \"Master,\" has no fixed items on his menu, but will take orders from any customer and cook up whatever they ask for. As the Master cooks, his customers tell him their life stories.", "rate": 73, "genre": ["Drama", "Mystery"], "cast": ["Kim Seung-woo", "Nam Tae-hyun", "Min-jung Ban", "Choi Jae-sung"], "character": ["Master", "Min-woo", "\"Banquet noodles\"", "Ryoo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63789   Expand Late Night Restaurant   (2015) User Score Overview A restaurant opens at midnight until seven in the morning. Its mysterious owner and chef, simply called the \"Master,\" has no fixed items on his menu, but will take orders from any customer and cook up whatever they ask for. As the Master cooks, his customers tell him their life stories. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Seung-woo Master Nam Tae-hyun Min-woo Min-jung Ban \"Banquet noodles\" Choi Jae-sung Ryoo Full Cast & Crew Last Season Season 1 2015 | 20 Episodes Season 1 of Late Night Restaurant premiered on July  4, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Late Night Restaurant. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Late Night Restaurant. You can help by rating TV shows you've seen. Facts Original Name  심야식당 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  30m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000008149 Genres Drama Mystery Keywords slice of life korea food Content Score 71 Just a little bit more... Top Contributors t 31 tmdb38202327 1 5 1knod a 4 asura766 3 part-mozi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}