{"link": "https://www.themoviedb.org/tv/7655?language=en", "title": "Black Tie Nights", "resume": "Black Tie Nights was a softcore drama anthology series which aired on Cinemax in the United States from 2004 to 2005.\nThis anthology show revolved around the adventures of Olivia Hartley and Cooper Snow who ran Black Tie dating service. They were assisted by their geeky sidekick, Ryan Lundy. Each week they would encounter new or returning customers and try to play matchmaker. The first season had two main subplots that continued in each episode. The first was the budding romance between Ryan and Cooper. The second was Olivia getting over the loss of her husband and dating again.\nIn the second season, the show was retooled. The anthology series was renamed Hollywood Sexcapades and the characters of Olivia and Cooper were said to be out of the country opening a new branch. Candi Hicks, a recurring customer in the first season, became the new employee of Black Tie dating service. She and Ryan partnered to run the company, and the continuing subplot was the budding romance between these two characters. Each week they would continue to try to play matchmaker to that episode's guest stars.", "rate": 100, "genre": ["Drama"], "cast": ["Tiffany Bolton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7655   Expand Black Tie Nights   (2004) User Score Overview Black Tie Nights was a softcore drama anthology series which aired on Cinemax in the United States from 2004 to 2005. This anthology show revolved around the adventures of Olivia Hartley and Cooper Snow who ran Black Tie dating service. They were assisted by their geeky sidekick, Ryan Lundy. Each week they would encounter new or returning customers and try to play matchmaker. The first season had two main subplots that continued in each episode. The first was the budding romance between Ryan and Cooper. The second was Olivia getting over the loss of her husband and dating again. In the second season, the show was retooled. The anthology series was renamed Hollywood Sexcapades and the characters of Olivia and Cooper were said to be out of the country opening a new branch. Candi Hicks, a recurring customer in the first season, became the new employee of Black Tie dating service. She and Ryan partnered to run the company, and the continuing subplot was the budding romance between these two characters. Each week they would continue to try to play matchmaker to that episode's guest stars. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tiffany Bolton Full Cast & Crew Last Season Season 1 2004 | 13 Episodes Season 1 of Black Tie Nights premiered on June  4, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Black Tie Nights. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors f 1 florin1704 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}