{"link": "https://www.themoviedb.org/tv/4779?language=en", "title": "Hallmark Hall of Fame", "resume": "Hallmark Hall of Fame is an anthology program on American television, sponsored by Hallmark Cards, a Kansas City based greeting card company. The longest-running primetime series in the history of television, it has a historically long run, beginning during 1951 and continuing into 2013. From 1954 onward, all of its productions have been shown in color, although color television video productions were extremely rare in 1954. Many television movies have been shown on the program since its debut, though the program began with live telecasts of dramas and then changed to videotaped productions before finally changing to filmed ones.\nThe series has received eighty Emmy Awards, twenty-four Christopher Awards, eleven Peabody Awards, nine Golden Globes, and four Humanitas Prizes. Once a common practice in American television, it is the last remaining television program such that the title includes the name of the sponsor. Unlike other long-running TV series still on the air, it differs in that it broadcasts only occasionally and not on a weekly broadcast programming schedule.", "rate": 90, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4779   Expand Hallmark Hall of Fame   (1951) User Score Overview Hallmark Hall of Fame is an anthology program on American television, sponsored by Hallmark Cards, a Kansas City based greeting card company. The longest-running primetime series in the history of television, it has a historically long run, beginning during 1951 and continuing into 2013. From 1954 onward, all of its productions have been shown in color, although color television video productions were extremely rare in 1954. Many television movies have been shown on the program since its debut, though the program began with live telecasts of dramas and then changed to videotaped productions before finally changing to filmed ones. The series has received eighty Emmy Awards, twenty-four Christopher Awards, eleven Peabody Awards, nine Golden Globes, and four Humanitas Prizes. Once a common practice in American television, it is the last remaining television program such that the title includes the name of the sponsor. Unlike other long-running TV series still on the air, it differs in that it broadcasts only occasionally and not on a weekly broadcast programming schedule. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2011 — | 3 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hallmark Hall of Fame. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage   http://online.hallmark.com/hall-of-fame Genres Drama Keywords anthology Content Score 56 We're so close, yet so far. Top Contributors 323 lineker 63 t0by 17 Banana 4 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}