{"link": "https://www.themoviedb.org/tv/61577?language=en", "title": "Kourtney & Khloé Take the Hamptons", "resume": "Reality-TV stars Kourtney and Khloé Kardashian continue to roll out their Dash clothing boutiques in U.S. cities. This series follows the sisters as they open a pop-up shop in the trendy Hamptons on eastern Long Island. Kourtney's sometimes beau, Scott Disick, joins them as they try to manage obstacles of starting a shop in the resort area. Although the business is at the heart of the series, no Kardashian show is complete without personal relationships and drama overtaking them.", "rate": 32, "genre": ["Reality"], "cast": ["Kourtney Kardashian", "Khloé Kardashian"], "character": ["Kourtney Kardashian", "Khloé Kardashian"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61577   Expand Kourtney & Khloé Take the Hamptons   (2014) User Score Overview Reality-TV stars Kourtney and Khloé Kardashian continue to roll out their Dash clothing boutiques in U.S. cities. This series follows the sisters as they open a pop-up shop in the trendy Hamptons on eastern Long Island. Kourtney's sometimes beau, Scott Disick, joins them as they try to manage obstacles of starting a shop in the resort area. Although the business is at the heart of the series, no Kardashian show is complete without personal relationships and drama overtaking them. Featured Crew Jonathan Murray Creator Ryan Seacrest Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kourtney Kardashian Kourtney Kardashian Khloé Kardashian Khloé Kardashian Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Kourtney & Khloé Take the Hamptons premiered on November  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kourtney & Khloé Take the Hamptons. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.eonline.com/shows/kourtney_and_khloe_take_the_hamptons Genres Reality Keywords hamptons Content Score 64 We're so close, yet so far. Top Contributors 12 Elizabeth Jennings R 11 Rebecca r 6 robert123 4 jameswhickmott  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}