{"link": "https://www.themoviedb.org/tv/61675?language=en", "title": "One Child", "resume": "Mei, a young woman who was adopted from China as a baby, is dramatically pulled back into the land of her birth. As she embarks on a dangerous mission to save the brother she never knew, she is forced to confront the truth of who she truly is and what family really means.", "rate": 0, "genre": ["Drama"], "cast": ["Katie Leung", "Andy Cheung", "Enoch Frost", "Nicholas Goh", "Emmanuel Ighodaro"], "character": ["Mei", "Chen Jin", "Solomon Ibori", "Dongping", "Samuel Abulu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61675   Expand One Child   (2014) User Score  Play Trailer Overview Mei, a young woman who was adopted from China as a baby, is dramatically pulled back into the land of her birth. As she embarks on a dangerous mission to save the brother she never knew, she is forced to confront the truth of who she truly is and what family really means. Featured Crew Guy Hibbert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katie Leung Mei Andy Cheung Chen Jin Enoch Frost Solomon Ibori Nicholas Goh Dongping Emmanuel Ighodaro Samuel Abulu Full Cast & Crew Last Season Miniseries 2014 | 4 Episodes Season 1 of One Child premiered on December  5, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for One Child. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on One Child. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.sundance.tv/series/one-child Genres Drama Keywords china Content Score 100 Yes! Looking good! Top Contributors 32 Elizabeth Jennings TB 16 TMDb Bot 3 Banana 1 cheriot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}