{"link": "https://www.themoviedb.org/tv/46511?language=en", "title": "Utopia", "resume": "The  Utopia Experiments is a legendary graphic novel shrouded in mystery.  When a group of strangers find themselves in possession of an original  manuscript, their lives suddenly and brutally implode.", "rate": 81, "genre": ["Drama"], "cast": ["Alexandra Roach", "Nathan Stewart-Jarrett", "Adeel Akhtar", "Oliver Woollford", "Paul Higgins"], "character": ["Becky", "Ian Johnson", "Wilson Wilson", "Grant Leetham", "Michael Dugdale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46511   Expand Utopia   (2013) User Score  Play Trailer Overview The  Utopia Experiments is a legendary graphic novel shrouded in mystery.  When a group of strangers find themselves in possession of an original  manuscript, their lives suddenly and brutally implode. Featured Crew Dennis Kelly Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexandra Roach Becky Nathan Stewart-Jarrett Ian Johnson Adeel Akhtar Wilson Wilson Oliver Woollford Grant Leetham Paul Higgins Michael Dugdale Full Cast & Crew Last Season Season 2 2014 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply lack of nudity Open 0 by Markoff\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  4 Posters  5 Recommendations   2009-11-12 Misfits 7.7    2013-03-04 Broadchurch 8.1    2013-03-30 Orphan Black 7.6    2010-05-04 Luther 7.9    2012-05-27 Continuum 7.1    2014-04-15 Fargo 8.2    2014-06-29 The Leftovers 7.7    2011-04-03 The Killing 7.5  Facts Status  Ended Network Certification 18 Meaning Can be aired only from 11:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  50m Homepage   http://www.channel4.com/programmes/utopia Genres Drama Keywords flu conspiracy scientist based on graphic novel government conspiracy Content Score 100 Yes! Looking good! Top Contributors 81 Marr 🇳🇱 m 16 marionauta 8 highroller 8 xyzl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}