{"link": "https://www.themoviedb.org/tv/20651?language=en", "title": "Anzacs", "resume": "Anzacs was a 1985 5-part Australian miniseries set in World War I. The series follows the lives of a group of young Australian men who enlist in the 8th Battalion of the First Australian Imperial Force in 1914, fighting first at Gallipoli in 1915, and then on the Western Front for the remainder of the war.\nIt follows in the wake of Australian New Wave war films such as Breaker Morant, Gallipoli, and precedes The Lighthorsemen. Recurring themes of these films include the Australian identity, such as mateship and larrikinism, the loss of innocence in war, and also the continued coming of age of the Australian nation and its soldiers.", "rate": 68, "genre": ["Drama"], "cast": ["Paul Hogan", "Andrew Clarke", "Megan Williams", "Patrick Ward", "Tony Bonner"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20651   Expand Anzacs   (1985) User Score Overview Anzacs was a 1985 5-part Australian miniseries set in World War I. The series follows the lives of a group of young Australian men who enlist in the 8th Battalion of the First Australian Imperial Force in 1914, fighting first at Gallipoli in 1915, and then on the Western Front for the remainder of the war. It follows in the wake of Australian New Wave war films such as Breaker Morant, Gallipoli, and precedes The Lighthorsemen. Recurring themes of these films include the Australian identity, such as mateship and larrikinism, the loss of innocence in war, and also the continued coming of age of the Australian nation and its soldiers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Hogan Andrew Clarke Megan Williams Patrick Ward Tony Bonner Full Cast & Crew Last Season Season 1 1985 | 6 Episodes Season 1 of Anzacs premiered on October 27, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Anzacs. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors WT 1 William Ten Broek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}