{"link": "https://www.themoviedb.org/tv/61021?language=en", "title": "Magic", "resume": "Kang-jae grew up under a jobless, gangster father. When Kang-jae accidentally meets Lee Dae-hae and his son Sun-mo, he feels more attached to Dae-hae than to his own father. Through Dae-hae and Sun-mo, Kang-jae learns the basics of magic as well as what fatherly love really means. Sun-mo, on the other hand, has a love-hate relationship with his father, who only cares about magic and nothing else. Meanwhile, Sun-mo is heartbroken by Dan-young, who falls in love with Kang-jae. Before that Dan-young was living with Sun-mo, mistakenly thinking that he is her long-lost brother before she was adopted. Yun-jin, Dan-young’s stepsister, instantly falls in love with Kang-jae and Kang-jae decides to marry her, not for love but for the sake of fulfilling his own ambitions at the price of spurning Dan-young.", "rate": 0, "genre": ["Drama", "Romance"], "cast": ["Kang Dong-won", "Kim Hyo-jin", "Lee In"], "character": ["Cha Kang-jae", "Dan-young", "Yoon Do-young"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61021   Expand Magic   (2004) User Score Overview Kang-jae grew up under a jobless, gangster father. When Kang-jae accidentally meets Lee Dae-hae and his son Sun-mo, he feels more attached to Dae-hae than to his own father. Through Dae-hae and Sun-mo, Kang-jae learns the basics of magic as well as what fatherly love really means. Sun-mo, on the other hand, has a love-hate relationship with his father, who only cares about magic and nothing else. Meanwhile, Sun-mo is heartbroken by Dan-young, who falls in love with Kang-jae. Before that Dan-young was living with Sun-mo, mistakenly thinking that he is her long-lost brother before she was adopted. Yun-jin, Dan-young’s stepsister, instantly falls in love with Kang-jae and Kang-jae decides to marry her, not for love but for the sake of fulfilling his own ambitions at the price of spurning Dan-young. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kang Dong-won Cha Kang-jae Kim Hyo-jin Dan-young Lee In Yoon Do-young Full Cast & Crew Last Season Season 1 2004 | 16 Episodes Season 1 of Magic premiered on August 28, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Magic. You can help by rating TV shows you've seen. Facts Original Name  매직 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/collection/sbs_review_list.jsp?vod_id=V0000281878 Genres Drama Romance Keywords korea Content Score 43 There's no 'I' in team... Top Contributors t 15 tmdb38202327 N 13 Nightowl.Kr 3 Elizabeth Jennings 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}