{"link": "https://www.themoviedb.org/tv/12863?language=en", "title": "Emily of New Moon", "resume": "Emily of New Moon is a Canadian television series, which aired on CBC Television from 1998 to 2000. The series originally aired in the United States on the Cookie Jar Toons block on This TV and it is currently seen in Canada on the Viva, Bravo! and Vision TV cable channels. The series, produced by Salter Street Films, was based on the Emily of New Moon series of novels by Lucy Maud Montgomery. The series consisted of three seasons of thirteen episodes and one season of seven episodes, for a total of forty-six. The executive producers were Micheline Charest, Michael Donovan, and Ronald Weinberg.\nThe series starred Martha MacIsaac as the titular orphan Emily Starr. Susan Clark and Sheila McCarthy played Emily's aunts Elizabeth and Laura, who had taken on the responsibility of raising Emily following her father's death, and Stephen McHattie played her cousin Jimmy. Susan Clark left the series after the first season when her character, Elizabeth, was killed off.\nRecurring cast included Chip Ciupka as Mr. Carpenter, Peter Donaldson as Ian Bowles, Richard Donat as Dr. Burnley, Kris Lemche as Perry Miller, John Neville as Uncle Malcolm, Jessica Pellerin as Ilse Burnley, Shawn Roberts as Teddy Kent, and Linda Thorson as Cousin Isabel.", "rate": 0, "genre": ["Drama"], "cast": ["Martha MacIsaac", "Stephen McHattie", "Sheila McCarthy", "Kris Lemche", "Jessica Pellerin"], "character": ["Emily Byrd Starr", "Jimmy Murray", "Laura Murray", "Perry Miller", "Ilse Burnley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12863   Expand Emily of New Moon   (1998) User Score Overview Emily of New Moon is a Canadian television series, which aired on CBC Television from 1998 to 2000. The series originally aired in the United States on the Cookie Jar Toons block on This TV and it is currently seen in Canada on the Viva, Bravo! and Vision TV cable channels. The series, produced by Salter Street Films, was based on the Emily of New Moon series of novels by Lucy Maud Montgomery. The series consisted of three seasons of thirteen episodes and one season of seven episodes, for a total of forty-six. The executive producers were Micheline Charest, Michael Donovan, and Ronald Weinberg. The series starred Martha MacIsaac as the titular orphan Emily Starr. Susan Clark and Sheila McCarthy played Emily's aunts Elizabeth and Laura, who had taken on the responsibility of raising Emily following her father's death, and Stephen McHattie played her cousin Jimmy. Susan Clark left the series after the first season when her character, Elizabeth, was killed off. Recurring cast included Chip Ciupka as Mr. Carpenter, Peter Donaldson as Ian Bowles, Richard Donat as Dr. Burnley, Kris Lemche as Perry Miller, John Neville as Uncle Malcolm, Jessica Pellerin as Ilse Burnley, Shawn Roberts as Teddy Kent, and Linda Thorson as Cousin Isabel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martha MacIsaac Emily Byrd Starr Stephen McHattie Jimmy Murray Sheila McCarthy Laura Murray Kris Lemche Perry Miller Jessica Pellerin Ilse Burnley Full Cast & Crew Last Season Season 4 2000 | 7 Episodes Season 4 of Emily of New Moon premiered on March 29, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Emily of New Moon. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords canada based on novel or book orphan period drama Content Score 71 Just a little bit more... Top Contributors 15 Banana s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}