{"link": "https://www.themoviedb.org/tv/45757?language=en", "title": "Doomsday Preppers", "resume": "Doomsday Preppers is an American reality television series that airs on the National Geographic Channel. Dräger Equipment, Wise Food Storage Company and the United States Gold Bureau are sponsors of the show.", "rate": 45, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45757   Expand Doomsday Preppers   (2011) User Score Overview Doomsday Preppers is an American reality television series that airs on the National Geographic Channel. Dräger Equipment, Wise Food Storage Company and the United States Gold Bureau are sponsors of the show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2013 | 14 Episodes Season 3 of Doomsday Preppers premiered on August 13, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply The Prepper Open 0 by TheShredder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Doomsday Preppers. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m, 44m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 5 zurman1 TB 2 TMDb Bot 1 Michael 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}