{"link": "https://www.themoviedb.org/tv/1749?language=en", "title": "How It's Made", "resume": "Have you ever wondered how the products you use every day are made? How It's Made leads you through the process of how everyday products, such as apple juice, skateboards, engines, contact lenses, and many more objects are manufactured.", "rate": 75, "genre": ["Documentary"], "cast": ["Gianluca Tusco"], "character": ["Narrator (Italian)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1749   Expand How It's Made   (2001) User Score Overview Have you ever wondered how the products you use every day are made? How It's Made leads you through the process of how everyday products, such as apple juice, skateboards, engines, contact lenses, and many more objects are manufactured. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  7 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gianluca Tusco Narrator (Italian) Full Cast & Crew Last Season Season 30 2017 | 13 Episodes Season 30 of How It's Made premiered on September 11, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for How It's Made. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  7 Recommendations   2003-11-07 Dirty Jobs 7.6    2006-05-06 How Do They Do It? 7.0    2010-12-01 Storage Wars 5.3    1960-11-14 Popeye the Sailor 5.8    2003-03-31 American Chopper 5.9    1969-09-13 Scooby-Doo, Where Are You! 7.5    1997-04-03 Police Academy: The Series 5.6    1996-11-12 Never Mind the Buzzcocks 7.5  Facts Status  Returning Series Networks Certification  - Type  Documentary Original Language  English Runtime  30m Homepage   http://www.sciencechannel.com/tv-shows/how-its-made/ Genres Documentary Keywords factory manufacturing Content Score 56 We're so close, yet so far. Top Contributors 25 Elizabeth Jennings 24 Goffred0 22 marasgns TB 10 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}