{"link": "https://www.themoviedb.org/tv/35097?language=en", "title": "Almost Naked Animals", "resume": "Underwear-clad animals led by Howie the canine  run the beachfront hotel Banana Cabana, leading to mayhem, destruction  and tons of all-around fun.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": ["Emilie-Claire Barlow", "Seán Cullen", "Linda Kash", "Robert Tinkler", "David Berni"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35097   Expand Almost Naked Animals   (2011) User Score Overview Underwear-clad animals led by Howie the canine  run the beachfront hotel Banana Cabana, leading to mayhem, destruction  and tons of all-around fun. Featured Crew Noah Z. Jones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emilie-Claire Barlow Seán Cullen Linda Kash Robert Tinkler David Berni Full Cast & Crew Last Season Season 3 2013 | 18 Episodes Season 3 of Almost Naked Animals premiered on April 15, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Almost Naked Animals. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.almostnakedanimals.com/ Genres Animation Comedy Keywords resort animal resort hotel Content Score 93 Almost there... Top Contributors 12 Banana 11 Marr 🇳🇱 a 3 asusar 2 Damien Haynes  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}