{"link": "https://www.themoviedb.org/tv/69851?language=en", "title": "FEUD", "resume": "Anthology series of famous feuds with the first season based on the legendary rivalry between Bette Davis and Joan Crawford which began early on their careers, climaxed on the set of \"Whatever Happened to Baby Jane?\" and evolved into an Oscar vendetta.", "rate": 79, "genre": ["Drama"], "cast": ["Susan Sarandon", "Jessica Lange", "Alfred Molina", "Stanley Tucci", "Jackie Hoffman"], "character": ["Bette Davis", "Joan Crawford", "Robert Aldrich", "Jack Warner", "Mamasita"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69851   Expand FEUD   (2017) User Score  Play Trailer Overview Anthology series of famous feuds with the first season based on the legendary rivalry between Bette Davis and Joan Crawford which began early on their careers, climaxed on the set of \"Whatever Happened to Baby Jane?\" and evolved into an Oscar vendetta. Featured Crew Ryan Murphy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  33 Content Issues  0 Images Backdrops  16 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Susan Sarandon Bette Davis Jessica Lange Joan Crawford Alfred Molina Robert Aldrich Stanley Tucci Jack Warner Jackie Hoffman Mamasita Full Cast & Crew Last Season Bette and Joan 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  33 Subject Status Replies Last Reply Susan's portrayal of Bette Open 71 by  GerardKennelly a Jessica Lange deserves the Emmy Open 13 by  tmdb18418769 h Joan's son Christopher? Open 3 by  Dedoc1967 Go to Discussions Media Most Popular Videos  1 Backdrops  16 Posters  5 Recommendations   2017-09-10 The Deuce 7.9    2018-03-25 Trust 7.4    2015-05-08 Grace and Frankie 7.8    2017-02-19 Big Little Lies 7.9    2017-10-03 Kevin (Probably) Saves the World 7.3    2018-02-26 Good Girls 5.8    2016-08-18 I Love Dick 5.2    2015-03-05 American Crime 6.6  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.fxnetworks.com/shows/feud Genres Drama Keywords biography feud Content Score 100 Yes! Looking good! Top Contributors 57 Elizabeth Jennings g 7 gonegirl a 6 adambakir92 6 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}