{"link": "https://www.themoviedb.org/tv/2905?language=en", "title": "The Ropers", "resume": "The Ropers is an American sitcom that ran from March 13, 1979 to May 22, 1980 on ABC. The series is a spin-off of Three's Company and based on the British sitcom George and Mildred. The series focused on middle-aged couple Stanley and Helen Roper who were landlords to Jack, Janet, and Chrissy on Three's Company.\nAs was the case during their time on Three's Company, opening credits for The Ropers exist with either Audra Lindley or Norman Fell credited first.", "rate": 35, "genre": ["Comedy"], "cast": ["Jeffrey Tambor", "Norman Fell", "Audra Lindley", "Patty McCormack", "Evan Cohen"], "character": ["Jeffrey P. Brookes III", "Stanley Roper", "Helen Roper", "Anne Brookes", "David Brookes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2905   Expand The Ropers   (1979) User Score Overview The Ropers is an American sitcom that ran from March 13, 1979 to May 22, 1980 on ABC. The series is a spin-off of Three's Company and based on the British sitcom George and Mildred. The series focused on middle-aged couple Stanley and Helen Roper who were landlords to Jack, Janet, and Chrissy on Three's Company. As was the case during their time on Three's Company, opening credits for The Ropers exist with either Audra Lindley or Norman Fell credited first. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeffrey Tambor Jeffrey P. Brookes III Norman Fell Stanley Roper Audra Lindley Helen Roper Patty McCormack Anne Brookes Evan Cohen David Brookes Full Cast & Crew Last Season Season 2 1979 | 22 Episodes Season 2 of The Ropers premiered on September 15, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Ropers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords remake spin off sitcom Content Score 86 Almost there... Top Contributors n 5 nixskits O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}