{"link": "https://www.themoviedb.org/tv/11904?language=en", "title": "Berlin, Berlin", "resume": "Berlin, Berlin is a television series produced for the ARD. It aired in Germany from 2002 to 2005 Tuesdays through Fridays at 6:50PM on the German public TV network Das Erste. The show won both national and international awards.", "rate": 80, "genre": ["Comedy"], "cast": ["Felicitas Woll", "Matthias Klimsa", "Jan Sosniok", "Rhea Harder", "Alexandra Neldel"], "character": ["Carlotta 'Lolle' Holzmann", "Hart", "Sven Ehlers", "Sarah Hermann", "Vero Gol-Sawatzki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11904   Expand Berlin, Berlin   (2002) User Score Overview Berlin, Berlin is a television series produced for the ARD. It aired in Germany from 2002 to 2005 Tuesdays through Fridays at 6:50PM on the German public TV network Das Erste. The show won both national and international awards. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Felicitas Woll Carlotta 'Lolle' Holzmann Matthias Klimsa Hart Jan Sosniok Sven Ehlers Rhea Harder Sarah Hermann Alexandra Neldel Vero Gol-Sawatzki Full Cast & Crew Last Season Season 4 2005 | 20 Episodes Season 4 of Berlin, Berlin premiered on March  8, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Berlin, Berlin. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  30m, 25m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 18 Samara L 4 Loopioh 2 Julien Lefebvre 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}