{"link": "https://www.themoviedb.org/tv/62417?language=en", "title": "Emerald City", "resume": "In the blink of a tornado’s eye, 20-year-old Dorothy Gale and her K9 police dog are transported to another world, one far removed from our own — a mystical land of competing kingdoms, lethal warriors, dark magic and a bloody battle for supremacy. This is the fabled Land of Oz in a way you’ve never seen before, where wicked witches don’t stay dead for long and a young girl becomes a headstrong warrior who holds the fate of kingdoms in her hands.", "rate": 63, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Adria Arjona", "Oliver Jackson-Cohen", "Vincent D'Onofrio", "Joely Richardson", "Ana Ularu"], "character": ["Dorothy Gale", "Lucas", "The Wizard (Frank Morgan)", "Glinda", "West"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62417   Expand Emerald City   (2017) User Score  Play Trailer Overview In the blink of a tornado’s eye, 20-year-old Dorothy Gale and her K9 police dog are transported to another world, one far removed from our own — a mystical land of competing kingdoms, lethal warriors, dark magic and a bloody battle for supremacy. This is the fabled Land of Oz in a way you’ve never seen before, where wicked witches don’t stay dead for long and a young girl becomes a headstrong warrior who holds the fate of kingdoms in her hands. Featured Crew Matthew Arnold Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  10 Content Issues  0 Images Backdrops  8 Posters  18 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adria Arjona Dorothy Gale Oliver Jackson-Cohen Lucas Vincent D'Onofrio The Wizard (Frank Morgan) Joely Richardson Glinda Ana Ularu West Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Emerald City premiered on January  6, 2017. View All Seasons Social Reviews  0 Discussions  10 Subject Status Replies Last Reply Cancellation Announced Open 4 by  Master_YODA T can't identify who is scarecrow and scared lion Open 7 by  genplant29 Is she? Open 5 by  Warpath Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  18 Recommendations   2016-10-05 Frequency 7.3    2017-01-25 Mary Kills People 7.5    2016-10-13 Zapped 6.0    2018-01-03 9-1-1 6.7    2017-02-06 APB 5.9    2017-03-01 Chicago Justice 4.8    2017-09-29 Marvel's Inhumans 5.6    2017-02-23 The Blacklist: Redemption 6.6  Facts Status  Cancelled Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  42m, 60m Homepage   http://www.nbc.com/emerald-city Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords based on children's book fantasy world wizard of oz Content Score 100 Yes! Looking good! Top Contributors 48 Elizabeth Jennings 38 Nero Kosonen 19 Medianoche 9 Antonis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}