{"link": "https://www.themoviedb.org/tv/604?language=en", "title": "Teen Titans", "resume": "Teen Titans is an American animated television series based on the DC Comics characters of the same name, primarily the run of stories by Marv Wolfman and George Pérez in the early-1980s The New Teen Titans comic book series. The show was created by Glen Murakami, developed by David Slack, and produced by Warner Bros. Animation. It premiered on Cartoon Network on July 19, 2003 with the episode \"Divide and Conquer\" and the final episode \"Things Change\" aired on January 16, 2006, with the film Teen Titans: Trouble in Tokyo serving as the series finale. A comic book series, Teen Titans Go!, was based on the TV series. On June 8, 2012, it was announced that the series would be revived as Teen Titans Go! in April 23, 2013 and air on the DC Nation block.IT now airs on the Boomerang channel.", "rate": 75, "genre": ["Animation", "Action", "Adventure"], "cast": ["Hynden Walch", "Scott Menville", "Greg Cipes", "Khary Payton", "Tara Strong"], "character": ["Starfire (voice)", "Robin (voice)", "Beast Boy (voice)", "Cyborg (voice)", "Raven (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 604   Expand Teen Titans   (2003) User Score  Play Trailer Overview Teen Titans is an American animated television series based on the DC Comics characters of the same name, primarily the run of stories by Marv Wolfman and George Pérez in the early-1980s The New Teen Titans comic book series. The show was created by Glen Murakami, developed by David Slack, and produced by Warner Bros. Animation. It premiered on Cartoon Network on July 19, 2003 with the episode \"Divide and Conquer\" and the final episode \"Things Change\" aired on January 16, 2006, with the film Teen Titans: Trouble in Tokyo serving as the series finale. A comic book series, Teen Titans Go!, was based on the TV series. On June 8, 2012, it was announced that the series would be revived as Teen Titans Go! in April 23, 2013 and air on the DC Nation block.IT now airs on the Boomerang channel.  Featured Crew Sam Register Creator Glen Murakami Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Hynden Walch Starfire (voice) Scott Menville Robin (voice) Greg Cipes Beast Boy (voice) Khary Payton Cyborg (voice) Tara Strong Raven (voice) Full Cast & Crew Last Season Season 5 2005 | 13 Episodes Season 5 of Teen Titans premiered on September 24, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply who thought Teen Titans GO! was the natural progression after this series? Open 0 by BarkingBaphomet\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  6 Posters  1 Recommendations   1999-11-12 Courage the Cowardly Dog 7.6    2001-08-24 The Grim Adventures of Billy and Mandy 7.3    2001-11-17 Justice League 8.2    1999-01-04 Ed, Edd n Eddy 7.0    2010-11-26 Young Justice 8.2    2000-09-09 Jackie Chan Adventures 7.1    2001-03-30 The Fairly OddParents 6.7    1998-11-18 The Powerpuff Girls 7.0  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  23m Homepage   http://cartoonnetwork.com/tv_shows/titans/index.html Genres Animation Action & Adventure Keywords dc comics superhero superhero team Content Score 100 Yes! Looking good! Top Contributors 23 Banana 8 niqo19 z 4 zurman1 4 Rafaelasauani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}