{"link": "https://www.themoviedb.org/tv/62330?language=en", "title": "Tatau", "resume": "Tatau follows Kyle and Budgie, two twenty-something friends from London that set off to travel the world. Ahead of the journey, Kyle gets a Maori-style tattoo to celebrate their eventual destination: the Cook Islands. When snorkeling in a lagoon, Kyle finds the dead body of a local girl, Aumea, tied up underwater. Returning to the lagoon with the police, Kyle finds her corpse has disappeared. But Kyle knows what he saw. Desperate to uncover what happened, Kyle and Budgie find themselves sucked deeper and deeper into a world of Maori myths, symbols, and hallucinatory visions... until finally the full meaning of Kyle’s tattoo is revealed.", "rate": 45, "genre": ["Crime", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Joe Layton", "Theo Barklem-Biggs", "Cian Elyse White", "Rangimoana Taylor", "Alex Tarrant"], "character": ["Kyle Connor", "Pete 'Budgie' Griffiths", "Lara Morgan", "Chief Matikutu", "Maui Vaipiti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62330   Expand Tatau   (2015) User Score  Play Trailer Overview Tatau follows Kyle and Budgie, two twenty-something friends from London that set off to travel the world. Ahead of the journey, Kyle gets a Maori-style tattoo to celebrate their eventual destination: the Cook Islands. When snorkeling in a lagoon, Kyle finds the dead body of a local girl, Aumea, tied up underwater. Returning to the lagoon with the police, Kyle finds her corpse has disappeared. But Kyle knows what he saw. Desperate to uncover what happened, Kyle and Budgie find themselves sucked deeper and deeper into a world of Maori myths, symbols, and hallucinatory visions... until finally the full meaning of Kyle’s tattoo is revealed. Featured Crew Richard Zajdlic Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Layton Kyle Connor Theo Barklem-Biggs Pete 'Budgie' Griffiths Cian Elyse White Lara Morgan Rangimoana Taylor Chief Matikutu Alex Tarrant Maui Vaipiti Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Tatau premiered on April 12, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tatau. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  40m Homepage   http://www.bbc.co.uk/programmes/p02ldr6x Genres Crime Drama Sci-Fi & Fantasy Keywords island murder travel Content Score 100 Yes! Looking good! Top Contributors 31 Elizabeth Jennings 9 Banana CM 8 Cherche Moi 6 KE  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}