{"link": "https://www.themoviedb.org/tv/18892?language=en", "title": "Nazis: A Warning from History", "resume": "Documentary film series that examines Adolf Hitler and the Nazis' rise to power, their zenith, their decline and fall, and the consequences of their reign featuring archive footage and interviews with eyewitnesses.", "rate": 90, "genre": ["Documentary"], "cast": ["Samuel West"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18892   Expand Nazis: A Warning from History   (1997) User Score Overview Documentary film series that examines Adolf Hitler and the Nazis' rise to power, their zenith, their decline and fall, and the consequences of their reign featuring archive footage and interviews with eyewitnesses. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samuel West Himself - Narrator Full Cast & Crew Last Season Season 1 1997 | 6 Episodes Season 1 of Nazis: A Warning from History premiered on September 10, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  10 Recommendations   1973-10-31 The World at War 8.1    1967-09-29 The Prisoner 7.6    1995-04-21 Father Ted 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  48m Homepage   http://www.bbc.co.uk/programmes/b01kkxvd Genres Documentary Keywords nazi holocaust world war ii nazi germany nazi party Content Score 56 We're so close, yet so far. Top Contributors TB 29 TMDb Bot 9 Banana J 5 JPlex3 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}