{"link": "https://www.themoviedb.org/tv/62232?language=en", "title": "Cedric's Barber Battle", "resume": "Hosted by actor and comedian Cedric The Entertainer, \"Cedric's Barber Battle\" sets out to capture the unique barbering culture in a hilariously unfiltered, no-holds-barred arena. Creating hair sculptures that feature elaborate designs, ranging from images of a person's face to grand cityscapes, the barbers will use nothing more than their clippers and a few coloring tools to create intricate works of art that are both imaginative and location-centric.", "rate": 5, "genre": ["Reality"], "cast": ["Cedric the Entertainer"], "character": ["Herself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62232   Expand Cedric's Barber Battle   (2015) User Score Overview Hosted by actor and comedian Cedric The Entertainer, \"Cedric's Barber Battle\" sets out to capture the unique barbering culture in a hilariously unfiltered, no-holds-barred arena. Creating hair sculptures that feature elaborate designs, ranging from images of a person's face to grand cityscapes, the barbers will use nothing more than their clippers and a few coloring tools to create intricate works of art that are both imaginative and location-centric. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cedric the Entertainer Herself - Host Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Cedric's Barber Battle premiered on April 17, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cedric's Barber Battle. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://www.cwtv.com/shows/cedrics-barber-battle Genres Reality Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 16 Elizabeth Jennings LC 5 Legit Corporation TB 5 TMDb Bot G 1 GrEg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}