{"link": "https://www.themoviedb.org/tv/64551?language=en", "title": "Baskets", "resume": "Chip Baskets wants to follow his dream of being a French clown—however, reality keeps interfering. Saddled with financial difficulties and facing an impenetrable language barrier, he moves back home to Bakersfield with high hopes. There, he is forced to confront his past while working as a rodeo clown and competing with his siblings for his mother's approval and affection.", "rate": 71, "genre": ["Comedy"], "cast": ["Zach Galifianakis", "Martha Kelly", "Louie Anderson"], "character": ["Chip Baskets / Dale Baskets", "Martha", "Christine Baskets"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64551   Expand Baskets   (2016) User Score  Play Trailer Overview Chip Baskets wants to follow his dream of being a French clown—however, reality keeps interfering. Saddled with financial difficulties and facing an impenetrable language barrier, he moves back home to Bakersfield with high hopes. There, he is forced to confront his past while working as a rodeo clown and competing with his siblings for his mother's approval and affection. Featured Crew Louis C.K. Creator Zach Galifianakis Creator Jonathan Krisel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zach Galifianakis Chip Baskets / Dale Baskets Martha Kelly Martha Louie Anderson Christine Baskets Full Cast & Crew Current Season Season 3 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Why does Dale have a southern accent? Open 2 by  ScorpionQ2 Louie Anderson Steals the Show! Open 5 by  StonerWithaBoner The Funeral (03/09/2017) Open 1 by  walking_bread Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  5 Recommendations   2016-09-08 Better Things 6.7    2014-02-18 Doll & Em 6.9    2016-02-05 Animals. 5.8    2014-09-21 Mr. Pickles 7.0    2016-08-18 I Love Dick 5.2    2014-09-26 Transparent 6.7    2015-11-06 Master of None 8.0    2016-01-22 Stan Lee's Lucky Man 7.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage   http://www.fxnetworks.com/shows/baskets/about Genres Comedy Keywords sibling relationship clown sibling rivalry rodeo clown Content Score 71 Just a little bit more... Top Contributors 54 Elizabeth Jennings 9 Bendik 7 Wong AK 7 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}