{"link": "https://www.themoviedb.org/tv/37012?language=en", "title": "Alt For Norge", "resume": "Alt for Norge is a Norwegian reality television series which debuted in 2010 and appears on TVNorge. The series features Americans of Norwegian descent, but who have never visited Norway, competing in various tasks while traveling the country, aiming to win $50,000 and meet their Norwegian relatives. The popular series won the Gullruten award for best reality show in 2011 and 2012.\nSeason 1 was won by Seattle resident Doug Miner, and Season 2 was won by Wisconsin native and Colorado resident Matti Rowe. Season 3 winner was Todd Ferris from Zionsville, Indiana.\nThe phrase Alt for Norge is the royal motto of Norway.\nA Swedish version of the program, Allt för Sverige, debuted in 2011 and a Danish version of the program \"Alt for Danmark\", debuted in 2012. The series concept has been sold to several countries / TV networks.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37012   Expand Alt For Norge   (2010) User Score Overview Alt for Norge is a Norwegian reality television series which debuted in 2010 and appears on TVNorge. The series features Americans of Norwegian descent, but who have never visited Norway, competing in various tasks while traveling the country, aiming to win $50,000 and meet their Norwegian relatives. The popular series won the Gullruten award for best reality show in 2011 and 2012. Season 1 was won by Seattle resident Doug Miner, and Season 2 was won by Wisconsin native and Colorado resident Matti Rowe. Season 3 winner was Todd Ferris from Zionsville, Indiana. The phrase Alt for Norge is the royal motto of Norway. A Swedish version of the program, Allt för Sverige, debuted in 2011 and a Danish version of the program \"Alt for Danmark\", debuted in 2012. The series concept has been sold to several countries / TV networks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2016 | 7 Episodes Season 7 of Alt For Norge premiered on September 11, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Alt For Norge. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors MG 5 Melanie Guevara BH 2 Budi Hideung TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}