{"link": "https://www.themoviedb.org/tv/2269?language=en", "title": "Hardware", "resume": "Hardware is a British sitcom that aired on ITV from 2003 to 2004. Starring Martin Freeman, it was written and created by Simon Nye, the creator of Men Behaving Badly.\nThe show's opening theme was A Taste of Honey by Herb Alpert's Tijuana Brass.", "rate": 37, "genre": ["Comedy"], "cast": ["Ryan Cartwright", "Ken Morley", "Peter Serafinowicz", "Martin Freeman", "Ella Kenion"], "character": ["Mike"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2269   Expand Hardware   (2003) User Score Overview Hardware is a British sitcom that aired on ITV from 2003 to 2004. Starring Martin Freeman, it was written and created by Simon Nye, the creator of Men Behaving Badly. The show's opening theme was A Taste of Honey by Herb Alpert's Tijuana Brass. Featured Crew Simon Nye Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Cartwright Ken Morley Peter Serafinowicz Martin Freeman Mike Ella Kenion Full Cast & Crew Last Season Season 2 2004 | 6 Episodes Season 2 of Hardware premiered on March  7, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hardware. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords diner shop cafe battle of the sexes marital problem hardware store sitcom hardware salesman british humour workplace comedy british sitcom gender stereotypes Content Score 93 Almost there... Top Contributors s 9 sibilant O 6 Ozbourne 2 kcdh 1 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}