{"link": "https://www.themoviedb.org/tv/12472?language=en", "title": "Piece of Cake", "resume": "The life of a Royal Air Force fighter squadron from the day of the British entry into World War II through to one of the toughest days in the Battle of Britain.", "rate": 68, "genre": ["Action", "Adventure", "Comedy", "Drama"], "cast": ["Jeremy Northam", "Nathaniel Parker", "Tom Burlinson", "Neil Dudgeon", "Tim Woodward"], "character": ["'Fitz' Fitzgerald", "'Flash' Gordon", "'Fanny' Barton", "'Moggy' Cattermole", "Squadron Leader Rex"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12472   Expand Piece of Cake   (1988) User Score  Play Trailer Overview The life of a Royal Air Force fighter squadron from the day of the British entry into World War II through to one of the toughest days in the Battle of Britain. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Northam 'Fitz' Fitzgerald Nathaniel Parker 'Flash' Gordon Tom Burlinson 'Fanny' Barton Neil Dudgeon 'Moggy' Cattermole Tim Woodward Squadron Leader Rex Full Cast & Crew Last Season Season 1 1988 | 6 Episodes Season 1 of Piece of Cake premiered on October  2, 1988. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Piece of Cake. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Piece of Cake. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Action & Adventure Comedy Drama Keywords based on novel or book world war ii royal air force stunts and teasing spitfire pilots Content Score 93 Almost there... Top Contributors TB 41 TMDb Bot PE 12 Patrick E. Abe 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}