{"link": "https://www.themoviedb.org/tv/3913?language=en", "title": "After Henry", "resume": "After Henry is a British sitcom that aired on ITV from 1988 to 1992. Starring Prunella Scales and Joan Sanderson, it had started on BBC Radio 4 in 1985, finishing in 1989. It was written by Simon Brett. After Henry was made for the ITV network by Thames Television.\nThe BBC was reluctant to produce After Henry for television, so in 1988 after the third radio series Thames Television did so. The show was surprisingly popular, attracting over 14 million viewers. A second television series was shown during the same months as the fourth radio series with, in many cases, both radio and television episodes being broadcast on the same nights. The fourth television series was broadcast from July 1992, after the death of Joan Sanderson, who had died on 24 May.", "rate": 0, "genre": ["Comedy"], "cast": ["Prunella Scales", "Joan Sanderson", "Edward de Souza", "Jonathan Newth", "Peggy Ann Wood"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3913   Expand After Henry   (1988) User Score Overview After Henry is a British sitcom that aired on ITV from 1988 to 1992. Starring Prunella Scales and Joan Sanderson, it had started on BBC Radio 4 in 1985, finishing in 1989. It was written by Simon Brett. After Henry was made for the ITV network by Thames Television. The BBC was reluctant to produce After Henry for television, so in 1988 after the third radio series Thames Television did so. The show was surprisingly popular, attracting over 14 million viewers. A second television series was shown during the same months as the fourth radio series with, in many cases, both radio and television episodes being broadcast on the same nights. The fourth television series was broadcast from July 1992, after the death of Joan Sanderson, who had died on 24 May. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Prunella Scales Joan Sanderson Edward de Souza Jonathan Newth Peggy Ann Wood Full Cast & Crew Last Season Season 4 1992 | 6 Episodes Season 4 of After Henry premiered on July 20, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on After Henry. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords bookshop parent child relationship grandparent grandchild relationship family british humour living with parents british sitcom Content Score 86 Almost there... Top Contributors 8 Banana 2 kcdh B 2 BWYoda 1 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}