{"link": "https://www.themoviedb.org/tv/12513?language=en", "title": "Operación Triunfo", "resume": "Operación Triunfo is a reality-show talent contest which first aired on Spain's TVE network in 2001. A kind of cross between Pop Idol, Voces en Función, Star Search, and Big Brother, the show aimed to find the country's next solo singing sensation, putting a selection of hopefuls through their paces by getting them to sing a variety of cover versions of popular songs, with tutoring from various professionals, and a headmaster like a school and 8 with Nina.\nOperación triunfo has been broadcast since 2001, first by TVE and then Telecinco. Successful program and audience, was broadcast on TVE in his first three seasons and in Telecinco in the fourth, fifth, sixth, seventh and eighth. In it, a series of week after week contestants demonstrated their skills as singers in a gala live one day a week. The first contest was the most successful, being one of the most popular shows in the history of Spanish television and featuring singers that went on to enjoy long-term recognition from the public. In his first three seasons, the top prize was to represent Spain in the Eurovision Song Contest. TVE in this way was able to build on a popularity surge the Eurovision contest was experiencing in Spain.", "rate": 67, "genre": ["Reality"], "cast": ["Roberto Leal", "Mónica Naranjo"], "character": ["Host", "Herself - Jury Member"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12513   Expand Operación Triunfo   (2001) User Score Overview Operación Triunfo is a reality-show talent contest which first aired on Spain's TVE network in 2001. A kind of cross between Pop Idol, Voces en Función, Star Search, and Big Brother, the show aimed to find the country's next solo singing sensation, putting a selection of hopefuls through their paces by getting them to sing a variety of cover versions of popular songs, with tutoring from various professionals, and a headmaster like a school and 8 with Nina. Operación triunfo has been broadcast since 2001, first by TVE and then Telecinco. Successful program and audience, was broadcast on TVE in his first three seasons and in Telecinco in the fourth, fifth, sixth, seventh and eighth. In it, a series of week after week contestants demonstrated their skills as singers in a gala live one day a week. The first contest was the most successful, being one of the most popular shows in the history of Spanish television and featuring singers that went on to enjoy long-term recognition from the public. In his first three seasons, the top prize was to represent Spain in the Eurovision Song Contest. TVE in this way was able to build on a popularity surge the Eurovision contest was experiencing in Spain. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roberto Leal Host Mónica Naranjo Herself - Jury Member Full Cast & Crew Current Season Season 9 2017 | 17 Episodes Season 9 of Operación Triunfo premiered on October 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Operación Triunfo. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  Spanish; Castilian Runtime  180m Homepage   http://www.rtve.es/television/ot/ Genres Reality Keywords music operacion triunfo Content Score 56 We're so close, yet so far. Top Contributors 29 Takox jp 24 juan perez 17 radocity 8 virtualnation  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}