{"link": "https://www.themoviedb.org/tv/14784?language=en", "title": "Wie is de Mol?", "resume": "Wie is de Mol? is the Dutch version of the Belgian reality television game show De Mol. The first four seasons were regular seasons with ordinary people. After the break in 2004, all participants in the following seasons were Dutch celebrities. The show is currently presented by Art Rooijakkers.\nThe program is about 10 candidates, who have to complete assignments by which they can earn money. However, one of the groupmembers is the Mole. The Mole's goal is to make the assignments fail and keep the amount of money earned as low as possible. The other candidates do not know who the Mole is, and need to unmask him or her. At the end of every episode the candidates take a multiple choice test about the mole's identity. The test contains 20 questions about the mole's activities since the previous test and personal questions about the Mole. With the help of 'jokers', which they can earn during the assignments, the contastents can turn a wrong test answers into a good one. The person who gives the least amount of correct answers is \"executed\" and must leave. In most series this process continues until only two contestants and the Mole remain. The winner is the person with the most correct answers in the final test and he or she gets all of the money earned in previous stages of the game.", "rate": 83, "genre": ["Mystery"], "cast": ["Art Rooijakkers", "Bella Hay", "Emilio Guzman", "Jean-Marc van Tol", "Olcay Gulsen"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14784   Expand Wie is de Mol?   (1999) User Score Overview Wie is de Mol? is the Dutch version of the Belgian reality television game show De Mol. The first four seasons were regular seasons with ordinary people. After the break in 2004, all participants in the following seasons were Dutch celebrities. The show is currently presented by Art Rooijakkers. The program is about 10 candidates, who have to complete assignments by which they can earn money. However, one of the groupmembers is the Mole. The Mole's goal is to make the assignments fail and keep the amount of money earned as low as possible. The other candidates do not know who the Mole is, and need to unmask him or her. At the end of every episode the candidates take a multiple choice test about the mole's identity. The test contains 20 questions about the mole's activities since the previous test and personal questions about the Mole. With the help of 'jokers', which they can earn during the assignments, the contastents can turn a wrong test answers into a good one. The person who gives the least amount of correct answers is \"executed\" and must leave. In most series this process continues until only two contestants and the Mole remain. The winner is the person with the most correct answers in the final test and he or she gets all of the money earned in previous stages of the game. Featured Crew Michiel Devlieger Creator Tom Lenaerts Creator Michel Vanhove Creator Bart De Pauw Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Art Rooijakkers Presenter Bella Hay Emilio Guzman Jean-Marc van Tol Olcay Gulsen Full Cast & Crew Current Season Season 18 2018 | 3 Episodes Season 18 of Wie is de Mol? premiered on January  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wie is de Mol?. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  60m, 50m Homepage   http://www.wieisdemol.nl Genres Mystery Keywords saboteur mole Content Score 93 Almost there... Top Contributors 73 Joost1991 e 30 exepti0n 20 Marr 🇳🇱 r 15 rbonneveld  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}