{"link": "https://www.themoviedb.org/tv/6460?language=en", "title": "The Busy World of Richard Scarry", "resume": "The Busy World of Richard Scarry is a Canadian/French animated children's television series, produced by CINAR Animation and France Animation in association with Paramount Television, which aired from 1994 to 1997, first on Showtime, later on Nickelodeon, and ran for 65 episodes. The television series was based on the books drawn and written by Richard Scarry. Reruns of the show formerly aired in syndication as part of the Cookie Jar Kids Network block, but the show now continues to air on the Cookie Jar Toons block on ThisTV.", "rate": 73, "genre": ["Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6460   Expand The Busy World of Richard Scarry User Score Overview The Busy World of Richard Scarry is a Canadian/French animated children's television series, produced by CINAR Animation and France Animation in association with Paramount Television, which aired from 1994 to 1997, first on Showtime, later on Nickelodeon, and ran for 65 episodes. The television series was based on the books drawn and written by Richard Scarry. Reruns of the show formerly aired in syndication as part of the Cookie Jar Kids Network block, but the show now continues to air on the Cookie Jar Toons block on ThisTV. Featured Crew Richard Scarry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Facts Status  Ended Networks Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  30m, 20m, 25m Homepage  - Genres Animation Kids Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 13 TheOneManBoxOffice 2 Banana 2 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}