{"link": "https://www.themoviedb.org/tv/17558?language=en", "title": "Go Girls", "resume": "Amy, Britta and Cody are three young women suffering their quarter century crisis: 25 and what have they achieved? They make a vow that in one year they’ll each fulfill their ambition. Their mate-since-childhood Kevin, admires their pluck but, to be honest, since Amy, Britta and Cody are currently Tragically Poor; Tragically Unknown; and Tragically Single, he reckons it’s going to be a bit of an ask.", "rate": 10, "genre": ["Comedy", "Drama"], "cast": ["J.J. Fong", "Leon Wadham", "George Mason", "Tai Berdinner-Blades", "Shara Connolly"], "character": ["Alice Lee", "Levi Hirsh", "Ted Keegan", "Bennie Keegan", "Candy McMann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17558   Expand Go Girls   (2009) User Score Overview Amy, Britta and Cody are three young women suffering their quarter century crisis: 25 and what have they achieved? They make a vow that in one year they’ll each fulfill their ambition. Their mate-since-childhood Kevin, admires their pluck but, to be honest, since Amy, Britta and Cody are currently Tragically Poor; Tragically Unknown; and Tragically Single, he reckons it’s going to be a bit of an ask. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast J.J. Fong Alice Lee Leon Wadham Levi Hirsh George Mason Ted Keegan Tai Berdinner-Blades Bennie Keegan Shara Connolly Candy McMann Full Cast & Crew Last Season Season 5 2013 | 13 Episodes Season 5 of Go Girls premiered on April 30, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Go Girls. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.southpacificpictures.com/index.php?option=com_production&id=81 Genres Comedy Drama Keywords new zealand group of friends twenty something Content Score 86 Almost there... Top Contributors 60 Banana s 3 speedycars 2 Sean Tu 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}