{"link": "https://www.themoviedb.org/tv/40043?language=en", "title": "Protect the Boss", "resume": "Protect the Boss is a 2011 South Korean workplace romantic comedy television series starring Choi Kang-hee, Ji Sung, Kim Jaejoong, Wang Ji-hye, and Park Yeong-gyu. It aired on SBS from August 3 to September 29, 2011 on Wednesdays and Thursdays at 21:55.\nAmong its early working titles were The Boss Has Changed and The Last Secretary.", "rate": 90, "genre": ["Comedy"], "cast": ["Choi Kang-hee", "Ji Sung", "Kim Jae-joong", "Kim Ha-kyoon", "Wang Ji-hye"], "character": ["Noh Eun-seol", "Cha Ji-heon", "Cha Moo-won", "Assistant Jang", "Seo Na-yoon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40043   Expand Protect the Boss   (2011) User Score Overview Protect the Boss is a 2011 South Korean workplace romantic comedy television series starring Choi Kang-hee, Ji Sung, Kim Jaejoong, Wang Ji-hye, and Park Yeong-gyu. It aired on SBS from August 3 to September 29, 2011 on Wednesdays and Thursdays at 21:55. Among its early working titles were The Boss Has Changed and The Last Secretary. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  19 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Kang-hee Noh Eun-seol Ji Sung Cha Ji-heon Kim Jae-joong Cha Moo-won Kim Ha-kyoon Assistant Jang Wang Ji-hye Seo Na-yoon Full Cast & Crew Last Season Season 1 2011 | 18 Episodes Season 1 of Protect the Boss premiered on August  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  19 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Protect the Boss. You can help by rating TV shows you've seen. Facts Original Name  보스를 지켜라 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://tv.sbs.co.kr/boss/ Genres Comedy Keywords korea Content Score 86 Almost there... Top Contributors M 38 Maria180493 N 13 Nightowl.Kr z 6 zurman1 CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}