{"link": "https://www.themoviedb.org/tv/67103?language=en", "title": "3x3 Eyes: Legend of the Divine Demon", "resume": "Yakumo has trained and searched for 4 years, following Pai's mysterious dissapearance. However, when he finally finds her, not all is well as her memory seems to be gone. They attempt to return her memory by going to the Holy Land, birthplace of the immortal race of Sanjiyans.", "rate": 67, "genre": [], "cast": ["Kōji Tsujitani", "Megumi Hayashibara"], "character": ["Yakumo Fujii (voice)", "Pal Ayanokōji (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67103   Expand 3x3 Eyes: Legend of the Divine Demon   (1995) User Score Overview Yakumo has trained and searched for 4 years, following Pai's mysterious dissapearance. However, when he finally finds her, not all is well as her memory seems to be gone. They attempt to return her memory by going to the Holy Land, birthplace of the immortal race of Sanjiyans. Featured Crew Yuzo Takada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kōji Tsujitani Yakumo Fujii (voice) Megumi Hayashibara Pal Ayanokōji (voice) Full Cast & Crew Last Season 3x3 Eyes: Legend of the Divine Demon 1995 | 3 Episodes Season 1 of 3x3 Eyes: Legend of the Divine Demon premiered on July 25, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1991-07-25 3x3 Eyes 7.2  Facts Original Name  ３×３ＥＹＥＳ聖魔伝説 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors t 24 tmdb983464 j 7 joeyzhou 3 daredevid 3 zohctheman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}