{"link": "https://www.themoviedb.org/tv/45974?language=en", "title": "MTV Game One", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 90, "genre": ["Comedy"], "cast": ["Nils Bomhoff", "Ingo Meß", "Daniel Budiman", "Simon Krätschmer", "Etienne Gardé"], "character": ["Himself / Host", "Offvoice", "Himself / Host", "Himself / Host", "Himself / Host / Eduard Laser"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45974   Expand MTV Game One   (2006) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew Simon Krätschmer Creator Daniel Budiman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nils Bomhoff Himself / Host Ingo Meß Offvoice Daniel Budiman Himself / Host Simon Krätschmer Himself / Host Etienne Gardé Himself / Host / Eduard Laser Full Cast & Crew Last Season Season 13 2014 | 3 Episodes Season 13 of MTV Game One premiered on October  7, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on MTV Game One. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  20m, 15m, 30m Homepage   www.gameone.de Genres Comedy Keywords video game games role playing Content Score 86 Almost there... Top Contributors 37 tobim91 11 meister_knobi 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}