{"link": "https://www.themoviedb.org/tv/11321?language=en", "title": "A Town Called Panic", "resume": "A Town Called Panic is a 2000 puppetoon series distributed by Aardman Animations and produced in Belgium by Vincent Patar and Stéphane Aubier for La Parti & Pic Pic André. It follows the everyday events of Cowboy, Indian and Horse in a small rural town as they go about their lives. Each episode is roughly 5 minutes long and is crudely animated: the characters are meant to resemble cheap toy figurines. Some stations broadcast several episodes in a 15 or 30-minute block.\nA spinoff animated feature film called A Town Called Panic was completed in Spring 2009 and debuted at Cannes in May of the same year.\nA Town Called Panic is seen worldwide on channels such as ABC Rollercoaster in Australia, Nicktoons Network in the United States, EBS in South Korea, and Teletoon in Canada, and is available online at Atom Films.\nIn the UK, A Town called Panic played on Nickelodeon. Much of the characters and scenery were later recycled for the Cravendale Milk adverts using a Pirate, a Cow and a bicyclist as the characters.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Alexander Armstrong"], "character": ["Horse (2000)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11321   Expand A Town Called Panic User Score Overview A Town Called Panic is a 2000 puppetoon series distributed by Aardman Animations and produced in Belgium by Vincent Patar and Stéphane Aubier for La Parti & Pic Pic André. It follows the everyday events of Cowboy, Indian and Horse in a small rural town as they go about their lives. Each episode is roughly 5 minutes long and is crudely animated: the characters are meant to resemble cheap toy figurines. Some stations broadcast several episodes in a 15 or 30-minute block. A spinoff animated feature film called A Town Called Panic was completed in Spring 2009 and debuted at Cannes in May of the same year. A Town Called Panic is seen worldwide on channels such as ABC Rollercoaster in Australia, Nicktoons Network in the United States, EBS in South Korea, and Teletoon in Canada, and is available online at Atom Films. In the UK, A Town called Panic played on Nickelodeon. Much of the characters and scenery were later recycled for the Cravendale Milk adverts using a Pirate, a Cow and a bicyclist as the characters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexander Armstrong Horse (2000) Full Cast & Crew Last Season Season 1 — | 20 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors v 2 veboli s 1 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}