{"link": "https://www.themoviedb.org/tv/16097?language=en", "title": "Viewtiful Joe", "resume": "Viewtiful Joe is a Japanese anime series based on the video game series of the same name.\nThe series follows a similar plot of the games, but there are many differences. The series, comprising fifty-one episodes, was shown every Saturday on the Japanese television station TV Tokyo from October 2, 2004 until September 24, 2005. The show was licensed by anime distributor Geneon Entertainment, with its first twenty-six episodes airing in United States on Kids' WB. It was taken off the air when Kids' WB block transferred to The CW. Viewtiful Joe was later licensed for distribution in other parts of the world by MGM Television. The anime debuted in the United Kingdom on Jetix on July 2, 2007. Viewtiful Joe premiered on Cartoon Network Brazil on July 3, 2006 and reruned in country's RedeTV! on HD at November 27, 2006. It aired in Mexico starting on July 4, 2006. On June 23, 2008, the show began airing on Cartoon Network in other parts of Latin America. In 2009, Viewtiful Joe became available on Crunchyroll's streaming service for its users outside Asia.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Makoto Tsumura", "Mayumi Asano", "Natsuko Kuwatani", "Tomokazu Seki", "Banjou Ginga"], "character": ["Captain Blue Jr.", "Sprocket", "Sexy Silvia", "Viewtiful Joe", "Captain Blue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16097   Expand Viewtiful Joe   (2005) User Score Overview Viewtiful Joe is a Japanese anime series based on the video game series of the same name. The series follows a similar plot of the games, but there are many differences. The series, comprising fifty-one episodes, was shown every Saturday on the Japanese television station TV Tokyo from October 2, 2004 until September 24, 2005. The show was licensed by anime distributor Geneon Entertainment, with its first twenty-six episodes airing in United States on Kids' WB. It was taken off the air when Kids' WB block transferred to The CW. Viewtiful Joe was later licensed for distribution in other parts of the world by MGM Television. The anime debuted in the United Kingdom on Jetix on July 2, 2007. Viewtiful Joe premiered on Cartoon Network Brazil on July 3, 2006 and reruned in country's RedeTV! on HD at November 27, 2006. It aired in Mexico starting on July 4, 2006. On June 23, 2008, the show began airing on Cartoon Network in other parts of Latin America. In 2009, Viewtiful Joe became available on Crunchyroll's streaming service for its users outside Asia. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Makoto Tsumura Captain Blue Jr. Mayumi Asano Sprocket Natsuko Kuwatani Sexy Silvia Tomokazu Seki Viewtiful Joe Banjou Ginga Captain Blue Full Cast & Crew Last Season Season 1 2004 | 26 Episodes Season 1 of Viewtiful Joe premiered on October  2, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Viewtiful Joe. You can help by rating TV shows you've seen. Facts Original Name  ビューティフル ジョー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.tv-tokyo.co.jp/anime/vj/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 7 BrerFox m 3 magoozin 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}