{"link": "https://www.themoviedb.org/tv/43332?language=en", "title": "Our Little Clinic", "resume": "Naša mala klinika were a Slovenian, Croatian and Serbian comedy series broadcast by POP TV and NOVA TV respectively, between 2004 and 2007. Seven seasons were broadcast. The series was written by Marko Pokorn, Rok Vilčnik and Branko Đurić - Đuro, who also directed the series. The show won four viktors for best played TV series. In Slovenia, it was the most watched TV series in 2007 season and some seasons before.", "rate": 0, "genre": ["Family", "Comedy"], "cast": ["Goran Visnjic"], "character": ["Man on the telephone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43332   Expand Our Little Clinic   (2004) User Score Overview Naša mala klinika were a Slovenian, Croatian and Serbian comedy series broadcast by POP TV and NOVA TV respectively, between 2004 and 2007. Seven seasons were broadcast. The series was written by Marko Pokorn, Rok Vilčnik and Branko Đurić - Đuro, who also directed the series. The show won four viktors for best played TV series. In Slovenia, it was the most watched TV series in 2007 season and some seasons before. Featured Crew Branko Đurić Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Goran Visnjic Man on the telephone Full Cast & Crew Last Season Season 3 2015 | 14 Episodes Season 3 of Our Little Clinic premiered on September 12, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Our Little Clinic. You can help by rating TV shows you've seen. Facts Original Name  Naša mala klinika Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Family Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors g 12 grabnar 1 mark-remark  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}