{"link": "https://www.themoviedb.org/tv/1990?language=en", "title": "Ramayan", "resume": "Ramayan is a highly successful and phenomenally popular Indian epic television series created, written, and directed by Ramanand Sagar. The 78 episode series originally aired weekly on Doordarshan from 25 January 1987, to 31 July 1988, on Sundays at 9:30 a.m. IST.\nIt is a television adaptation of the ancient Indian Hindu religious epic of the same name and is primarily based on Valmiki's Ramayan and Tulsidas' Ramcharitmanas. It is also partly derived from portions of Kamban's Ramavataram and other works.", "rate": 70, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Arun Govil", "Dara Singh", "Lalita Pawar", "Sunil Lahri", "Arvind Trivedi"], "character": ["Ram", "Hanuman", "Laxman", "Ravan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1990   Expand Ramayan   (1987) User Score Overview Ramayan is a highly successful and phenomenally popular Indian epic television series created, written, and directed by Ramanand Sagar. The 78 episode series originally aired weekly on Doordarshan from 25 January 1987, to 31 July 1988, on Sundays at 9:30 a.m. IST. It is a television adaptation of the ancient Indian Hindu religious epic of the same name and is primarily based on Valmiki's Ramayan and Tulsidas' Ramcharitmanas. It is also partly derived from portions of Kamban's Ramavataram and other works. Featured Crew Ramanand Sagar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arun Govil Ram Dara Singh Hanuman Lalita Pawar Sunil Lahri Laxman Arvind Trivedi Ravan Full Cast & Crew Last Season Season 1 — | 79 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ramayan. You can help by rating TV shows you've seen. Facts Original Name  रामायण Status  Ended Network Certification  - Type  Scripted Original Language  Hindi Runtime  35m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors p 9 piyush.neo 4 Banana g 4 gismo33  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}