{"link": "https://www.themoviedb.org/tv/61335?language=en", "title": "Fortitude", "resume": "Fortitude is a place like nowhere else. Although surrounded by the savage beauty of the Arctic landscape, Fortitude is one of the safest towns on earth. There has never been a violent crime here. Until now. In such a close-knit community a murder touches everyone and the unsettling, mysterious horror of this crime threatens the future of the town itself.", "rate": 70, "genre": ["Crime", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Dennis Quaid", "Richard Dormer", "Sofie Gråbøl", "Verónica Echegui", "Sienna Guillory"], "character": ["Michael Lennox", "Dan Anderssen", "Governor Odegard", "Elena Ledesma", "Natalie Yelburton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61335   Expand Fortitude   (2015) User Score  Play Trailer Overview Fortitude is a place like nowhere else. Although surrounded by the savage beauty of the Arctic landscape, Fortitude is one of the safest towns on earth. There has never been a violent crime here. Until now. In such a close-knit community a murder touches everyone and the unsettling, mysterious horror of this crime threatens the future of the town itself. Featured Crew Simon Donald Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  7 Images Backdrops  7 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dennis Quaid Michael Lennox Richard Dormer Dan Anderssen Sofie Gråbøl Governor Odegard Verónica Echegui Elena Ledesma Sienna Guillory Natalie Yelburton Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of Fortitude premiered on January 26, 2017. View All Seasons Social Reviews  0 Discussions  15 Subject Status Replies Last Reply Ash vs The Evil Dead gets cancelled but this gets a 3rd season?!!! Open 0 by Gus Gorman\n      \n     U Why did the barman kill Bianca? Open 5 by  RoidDroidVoid Season 2 spoilers Open 8 by  Dali Parton Go to Discussions Media Most Popular Videos  2 Backdrops  7 Posters  3 Recommendations   2014-02-06 Bosch 7.9    2013-07-10 The Bridge 6.3    2014-07-27 Manhattan 7.3    2016-07-13 Minority Report 5.3    2016-06-03 Outcast 7.0    2015-06-14 Humans 7.5    2013-02-14 Zero Hour 4.9    2012-09-25 Vegas 7.4  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  42m Homepage   http://www.sky.com/tv/show/fortitude Genres Crime Drama Mystery Sci-Fi & Fantasy Keywords governor police arctic murder town science Content Score 100 Yes! Looking good! Top Contributors 63 Elizabeth Jennings 34 EveDemocracy 20 david8s95 11 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}