{"link": "https://www.themoviedb.org/tv/35211?language=en", "title": "The Sins", "resume": "The Sins is a BBC television series from 2000. It was directed by David Yates, Sallie Aprahamian and Simon Curtis and written by William Ivory. It centres on Len Green, a former bank robber and getaway driver, who has retired from the criminal life and joined the undertakers run by his uncle. However, his resolve to stay out of the criminal world is tested by temptations based on the seven deadly sins. Other cast included Geraldine James as Len's wife, Claire Rushbrook, Kaye Wragg, Laura Rogers, Caroline Hayes and Billie Cook as their daughters, Amanda Abbington, Philip Jackson, Neil Stuke, Nick Raggett and Kenneth Macdonald.", "rate": 5, "genre": ["Drama"], "cast": ["Neil Stuke", "Caroline Hayes", "Billie Cook", "Philip Jackson", "Frank Finlay"], "character": ["Carl Rogers", "Charity Green", "Dolores Green", "Mickey Thomas", "Uncle Irwin Green"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35211   Expand The Sins   (2000) User Score Overview The Sins is a BBC television series from 2000. It was directed by David Yates, Sallie Aprahamian and Simon Curtis and written by William Ivory. It centres on Len Green, a former bank robber and getaway driver, who has retired from the criminal life and joined the undertakers run by his uncle. However, his resolve to stay out of the criminal world is tested by temptations based on the seven deadly sins. Other cast included Geraldine James as Len's wife, Claire Rushbrook, Kaye Wragg, Laura Rogers, Caroline Hayes and Billie Cook as their daughters, Amanda Abbington, Philip Jackson, Neil Stuke, Nick Raggett and Kenneth Macdonald. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Stuke Carl Rogers Caroline Hayes Charity Green Billie Cook Dolores Green Philip Jackson Mickey Thomas Frank Finlay Uncle Irwin Green Full Cast & Crew Last Season Season 1 2000 | 7 Episodes Season 1 of The Sins premiered on October 24, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Sins. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  420m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 Markxist 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}