{"link": "https://www.themoviedb.org/tv/63646?language=en", "title": "Counterpart", "resume": "Howard Silk is a lowly cog in a bureaucratic UN agency who is turning the last corner of a life filled with regret when he discovers the agency he works for is guarding a secret: a crossing to a parallel dimension.", "rate": 72, "genre": ["Drama", "Science", "Fiction"], "cast": ["J.K. Simmons", "Olivia Williams", "Harry Lloyd", "Ulrich Thomsen", "Nazanin Boniadi"], "character": ["Howard Silk", "Emily Burton Silk", "Peter Quayle", "Aldrich", "Clare"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63646   Expand Counterpart   (2017) User Score  Play Trailer Overview Howard Silk is a lowly cog in a bureaucratic UN agency who is turning the last corner of a life filled with regret when he discovers the agency he works for is guarding a secret: a crossing to a parallel dimension. Featured Crew Justin Marks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  8 Posters  6 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast J.K. Simmons Howard Silk Olivia Williams Emily Burton Silk Harry Lloyd Peter Quayle Ulrich Thomsen Aldrich Nazanin Boniadi Clare Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Counterpart premiered on December 10, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Lost me by start of episode 3 Open 4 by  billr1953 A Why so dark? Open 0 by Aprilfool47\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  8 Posters  6 Recommendations   2018-01-22 The Alienist 7.1    2018-06-04 Dietland 8.0    2018-02-11 Here and Now 7.7    2016-09-16 High Maintenance 6.2    2016-10-13 Falling Water 6.6    2016-07-05 Cyberwar 7.4    2018-02-02 Altered Carbon 7.9    2017-12-06 HAPPY! 7.4  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  56m Homepage   https://www.starz.com/series/counterpart Genres Drama Science Fiction Keywords espionage spy united nations parallel world Content Score 100 Yes! Looking good! Top Contributors 90 Elizabeth Jennings 31 ggTheV m 19 misfit_noel AK 12 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}