{"link": "https://www.themoviedb.org/tv/5144?language=en", "title": "Zorro: La espada y la rosa", "resume": "Zorro: La Espada y la Rosa is a Spanish-language telenovela based on Johnston McCulley's characters. Telemundo aired it from February 12 to July 23, 2007. This limited-run serial shows the masked crusader as a hero torn between his fight for justice and his love for a beautiful woman. Telemundo president Don Browne called this show \"without doubt the best production offered on Hispanic television in the United States today.\"\nThis series was produced by Telemundo, Sony Pictures Television International and RTI Colombia. This series was filmed in Colombia.\nIt was the network's most successful series of 2007 and its biggest seller in international syndication. Sony Pictures Television International has asked Telemundo to produce a sequel.", "rate": 50, "genre": ["Western", "Drama"], "cast": ["Osvaldo Ríos", "Natasha Klauss", "Christian Meier", "Marlene Favela", "Andrea Montenegro"], "character": ["Alejandro de la Vega", "Sor Ana Camila Suplicios", "Diego de la Vega / El Zorro", "Esmeralda Sánchez de Moncada", "María Pía de la Vega"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5144   Expand Zorro: La espada y la rosa   (2007) User Score Overview Zorro: La Espada y la Rosa is a Spanish-language telenovela based on Johnston McCulley's characters. Telemundo aired it from February 12 to July 23, 2007. This limited-run serial shows the masked crusader as a hero torn between his fight for justice and his love for a beautiful woman. Telemundo president Don Browne called this show \"without doubt the best production offered on Hispanic television in the United States today.\" This series was produced by Telemundo, Sony Pictures Television International and RTI Colombia. This series was filmed in Colombia. It was the network's most successful series of 2007 and its biggest seller in international syndication. Sony Pictures Television International has asked Telemundo to produce a sequel. Featured Crew Johnston McCulley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Osvaldo Ríos Alejandro de la Vega Natasha Klauss Sor Ana Camila Suplicios Christian Meier Diego de la Vega / El Zorro Marlene Favela Esmeralda Sánchez de Moncada Andrea Montenegro María Pía de la Vega Full Cast & Crew Last Season Season 1 2007 | 1 Episode Season 1 of Zorro: La espada y la rosa premiered on February 12, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Zorro: La espada y la rosa. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  60m Homepage   http://www.tv.telemundo.yahoo.com/zorro/ Genres Western Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors N 24 NoemiTalavera s 3 speedycars t 2 tmdb62905833 a 1 adltata  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}