{"link": "https://www.themoviedb.org/tv/40477?language=en", "title": "Absolute Boyfriend", "resume": "When Xiao Fei orders a \"love figure\" she forgets to return him before her 3-day trial is over. Now stuck with a handsome, perfect android man, Xiao Fei must figure out how to pay off the payment and hide her embarrassingly beautiful secret.", "rate": 90, "genre": ["Comedy", "Drama"], "cast": ["Koo Hye-sun", "Jiro Wang", "Mario Ma", "Cherry Hsia"], "character": ["Guan Xiao Fei", "Wan Ni Te"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40477   Expand Absolute Boyfriend   (2012) User Score Overview When Xiao Fei orders a \"love figure\" she forgets to return him before her 3-day trial is over. Now stuck with a handsome, perfect android man, Xiao Fei must figure out how to pay off the payment and hide her embarrassingly beautiful secret. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Koo Hye-sun Guan Xiao Fei Jiro Wang Wan Ni Te Mario Ma Cherry Hsia Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Absolute Boyfriend premiered on April  8, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Absolute Boyfriend. You can help by rating TV shows you've seen. Facts Original Name  絕對達令 Status  Ended Networks Certification  - Type  Scripted Original Language  Chinese Runtime  80m Homepage   http://www.gtv.com.tw/Program/S051420120414U/ Genres Comedy Drama Keywords taiwanese Content Score 86 Almost there... Top Contributors M 26 Maria180493 CM 6 Cherche Moi z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}