{"link": "https://www.themoviedb.org/tv/7874?language=en", "title": "Time Belt", "resume": "Time Belt is a science fiction/comedy series created by Chris Tallman that ran from 2003-2004 on Channel 101. The series followed the adventures of Dr. Bloom, a nerdy scientist who, after his girlfriend is killed in a lunar shuttle explosion, creates a belt that allows the wearer to travel through time. With intentionally poor production values, the series served as one of Channel 101's many homages to low-budget science fiction films.", "rate": 0, "genre": ["Comedy"], "cast": ["Jack Black", "Paget Brewster"], "character": ["Computerman", "Colonel Jocelyn Anchor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7874   Expand Time Belt   (2003) User Score Overview Time Belt is a science fiction/comedy series created by Chris Tallman that ran from 2003-2004 on Channel 101. The series followed the adventures of Dr. Bloom, a nerdy scientist who, after his girlfriend is killed in a lunar shuttle explosion, creates a belt that allows the wearer to travel through time. With intentionally poor production values, the series served as one of Channel 101's many homages to low-budget science fiction films. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Black Computerman Paget Brewster Colonel Jocelyn Anchor Full Cast & Crew Last Season Season 1 — | 8 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Time Belt. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  5m Homepage   http://www.timebelt.net/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors K 1 Knossos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}