{"link": "https://www.themoviedb.org/tv/36002?language=en", "title": "A History of Horror", "resume": "Mark Gatiss examines the history of the horror film, from classic Hollywood monsters to Hammer's glory days and beyond.", "rate": 71, "genre": ["Documentary"], "cast": ["Mark Gatiss", "John Carpenter", "Roger Corman", "Tobe Hooper", "George A. Romero"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36002   Expand A History of Horror   (2010) User Score Overview Mark Gatiss examines the history of the horror film, from classic Hollywood monsters to Hammer's glory days and beyond. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Gatiss John Carpenter Roger Corman Tobe Hooper George A. Romero Full Cast & Crew Last Season Miniseries 2010 | 3 Episodes Season 1 of A History of Horror premiered on October 11, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2004-05-25 The Angry Video Game Nerd 7.8    2013-09-24 The Goldbergs 7.6    1995-04-21 Father Ted 7.9    1999-09-24 Spaced 8.1    1981-09-08 Only Fools and Horses 8.2    1975-09-19 Fawlty Towers 8.1    2005-07-21 Extras 7.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00vcwm7 Genres Documentary Keywords miniseries horror movie classic horror Content Score 86 Almost there... Top Contributors TB 24 TMDb Bot R 11 Rebecca t 2 tdf1970  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}