{"link": "https://www.themoviedb.org/tv/43971?language=en", "title": "Good God", "resume": "Good God is a Canadian television comedy-drama series which premiered in April 2012 on HBO Canada. The show follows the life of character George Findlay, a role that Ken Finkleman reprised from The Newsroom and subsequent television projects. The series was originally slated to be the second season of Finkleman's previous HBO Canada project Good Dog, but was retitled in accordance with a change in the show's setting.\nThe show was described in early media coverage as having been inspired in part by the launch of Sun News Network. In the show's first episode, for example, Findlay is forced to respond to allegations that his new venture is aspiring to be \"Fox News North\", an epithet which the real Sun News Network also faced both before and after its launch.\nThe series was nominated for several awards at the 2013 Canadian Screen Awards, including Best Comedy Series, Best Supporting Actor in a Comedy Series for Jason Weinberg and Best Supporting Actress in a Comedy Series nods for both Samantha Bee and Jud Tylor.", "rate": 80, "genre": ["Comedy"], "cast": ["Ken Finkleman", "Samantha Bee", "Lolita Davidovich"], "character": ["George Findlay", "Shandy Sommers", "Virginia Hailwood"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43971   Expand Good God   (2012) User Score Overview Good God is a Canadian television comedy-drama series which premiered in April 2012 on HBO Canada. The show follows the life of character George Findlay, a role that Ken Finkleman reprised from The Newsroom and subsequent television projects. The series was originally slated to be the second season of Finkleman's previous HBO Canada project Good Dog, but was retitled in accordance with a change in the show's setting. The show was described in early media coverage as having been inspired in part by the launch of Sun News Network. In the show's first episode, for example, Findlay is forced to respond to allegations that his new venture is aspiring to be \"Fox News North\", an epithet which the real Sun News Network also faced both before and after its launch. The series was nominated for several awards at the 2013 Canadian Screen Awards, including Best Comedy Series, Best Supporting Actor in a Comedy Series for Jason Weinberg and Best Supporting Actress in a Comedy Series nods for both Samantha Bee and Jud Tylor. Featured Crew Ken Finkleman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Finkleman George Findlay Samantha Bee Shandy Sommers Lolita Davidovich Virginia Hailwood Full Cast & Crew Last Season Season 1 2012 | 10 Episodes Season 1 of Good God premiered on April  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Good God. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords television producer tv news Content Score 64 We're so close, yet so far. Top Contributors 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}