{"link": "https://www.themoviedb.org/tv/7897?language=en", "title": "Cuéntame cómo pasó", "resume": "Cuéntame cómo pasó, also known as Cuéntame, is a Spanish television series which has been broadcast by the Spanish public TV channel TVE1 since 2001. Its original name had to be changed for copyright reasons.\nThe series recounts the experiences of a middle-class family, the Alcántaras, during the last years of the rule of Francisco Franco and the beginning of the Spanish Transition to democracy. Its name comes from a famous song by the Spanish 1960s pop group Fórmula V, titled Tell Me. The producer of the series is Miguel Ángel Bernardeau.\nThe series was created to celebrate the first 25 years since Spain's transition to democracy, and its didactic spirit is clearly evident in some of the episodes. It includes documentary interviews with historical figures of the era, such as people concerned with the assassination of then prime minister Carrero Blanco and the death of Franco.\nThe first episode was broadcast on September 13, 2001. The series begins in April 1968 with the victory in the Eurovision song contest of the singer Massiel. The story reflects changes in Spain beginning in that year.\nIn December 2008, TVE and Ganga Group announced that the series, in its 10th season, had achieved very good audience levels, and would be renewed for up to 3 more seasons, with the storyline moving firmly into the 1980s and the \"Movida madrileña\".", "rate": 60, "genre": ["Comedy", "Drama", "Family"], "cast": ["Imanol Arias", "Ana Duato", "Ricardo Gómez", "Pablo Rivero", "Juan Echanove"], "character": ["Antonio Alcántara Barbadillo", "Mercedes Fernández López", "Carlos Alcántara Fernández", "Toni Alcántara Fernández", "Miguel Alcántara Barbadillo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7897   Expand Cuéntame cómo pasó   (2001) User Score Overview Cuéntame cómo pasó, also known as Cuéntame, is a Spanish television series which has been broadcast by the Spanish public TV channel TVE1 since 2001. Its original name had to be changed for copyright reasons. The series recounts the experiences of a middle-class family, the Alcántaras, during the last years of the rule of Francisco Franco and the beginning of the Spanish Transition to democracy. Its name comes from a famous song by the Spanish 1960s pop group Fórmula V, titled Tell Me. The producer of the series is Miguel Ángel Bernardeau. The series was created to celebrate the first 25 years since Spain's transition to democracy, and its didactic spirit is clearly evident in some of the episodes. It includes documentary interviews with historical figures of the era, such as people concerned with the assassination of then prime minister Carrero Blanco and the death of Franco. The first episode was broadcast on September 13, 2001. The series begins in April 1968 with the victory in the Eurovision song contest of the singer Massiel. The story reflects changes in Spain beginning in that year. In December 2008, TVE and Ganga Group announced that the series, in its 10th season, had achieved very good audience levels, and would be renewed for up to 3 more seasons, with the storyline moving firmly into the 1980s and the \"Movida madrileña\". Featured Crew Miguel Ángel Bernardeau Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  12 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Imanol Arias Antonio Alcántara Barbadillo Ana Duato Mercedes Fernández López Ricardo Gómez Carlos Alcántara Fernández Pablo Rivero Toni Alcántara Fernández Juan Echanove Miguel Alcántara Barbadillo Full Cast & Crew Current Season Season 19 2018 | 9 Episodes Season 19 of Cuéntame cómo pasó premiered on January 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  12 Posters  1 Recommendations   2005-01-16 Aída 4.0    2003-04-22 Los Serrano 5.1    1999-01-17 7 vidas 5.9    2008-01-09 Sin Tetas No Hay Paraíso 2.7    2008-02-04 Física o Química 3.0    2003-09-07 Aquí no hay quien viva 7.1    1985-10-26 David the Gnome 7.3    2005-09-18 Camera Café 6.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  70m Homepage   http://www.rtve.es/television/cuentame/ Genres Comedy Drama Family Keywords spain madrid dictatorship family post civil war dictatorship aftermath Content Score 93 Almost there... Top Contributors 133 prm96 93 United600 38 stego77 18 ciberus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}