{"link": "https://www.themoviedb.org/tv/34134?language=en", "title": "Ginban Kaleidoscope", "resume": "Ginban Kaleidoscope is a series of light novels written by Rei Kaibara and illustrated by Hiro Suzuhira. A manga adaptation authored by Jun Hasegawa was serialized in Margaret from 2005 to 2006. An anime adaptation of the first arc of the novels aired on TV Tokyo from October 8, 2005 to December 24, 2005.\nThe series won the 2nd Super Dash Novel Rookie of the Year Award Grand Prize.", "rate": 70, "genre": ["Animation", "Drama"], "cast": ["Maya Okamoto", "Mamiko Noto", "Ayako Kawasumi", "Marina Inoue", "Isshin Chiba"], "character": ["Dominique Miller", "Ria Garnet Juiltyve", "Tazusa Sakurano", "Mika Honjō", "Kazuya Nitta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34134   Expand Ginban Kaleidoscope   (2005) User Score Overview Ginban Kaleidoscope is a series of light novels written by Rei Kaibara and illustrated by Hiro Suzuhira. A manga adaptation authored by Jun Hasegawa was serialized in Margaret from 2005 to 2006. An anime adaptation of the first arc of the novels aired on TV Tokyo from October 8, 2005 to December 24, 2005. The series won the 2nd Super Dash Novel Rookie of the Year Award Grand Prize. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maya Okamoto Dominique Miller Mamiko Noto Ria Garnet Juiltyve Ayako Kawasumi Tazusa Sakurano Marina Inoue Mika Honjō Isshin Chiba Kazuya Nitta Full Cast & Crew Last Season Season 1 2005 | 12 Episodes Season 1 of Ginban Kaleidoscope premiered on October  8, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ginban Kaleidoscope. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 yoshizuka m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}