{"link": "https://www.themoviedb.org/tv/15118?language=en", "title": "Da Kink in My Hair", "resume": "Follows the lives of a group of women who let their hair down in more ways than one at Letty's, a vibrant and bustling hair salon in Toronto's Caribbean community. Novelette, Letty's smart and capable owner, has the answers to her clients' dilemmas but can't always figure out how to tame the tangles in her own life surrounded as she is by her outspoken eccentric sister Joy, her fourteen-year-old born-and-raised in Jamaica son Dre and her family of stylists including the wide-eyed new girl Starr and the wicked-tongued bad boy Nigel.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Ordena Stephens", "Trey Anthony", "Daniyah Ysrayl", "Eli Goree", "Ngozi Paul"], "character": ["Novelette Campbell", "Joy Campbell", "Dre", "Malik", "Starr"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15118   Expand Da Kink in My Hair   (2007) User Score Overview Follows the lives of a group of women who let their hair down in more ways than one at Letty's, a vibrant and bustling hair salon in Toronto's Caribbean community. Novelette, Letty's smart and capable owner, has the answers to her clients' dilemmas but can't always figure out how to tame the tangles in her own life surrounded as she is by her outspoken eccentric sister Joy, her fourteen-year-old born-and-raised in Jamaica son Dre and her family of stylists including the wide-eyed new girl Starr and the wicked-tongued bad boy Nigel. Featured Crew Trey Anthony Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ordena Stephens Novelette Campbell Trey Anthony Joy Campbell Daniyah Ysrayl Dre Eli Goree Malik Ngozi Paul Starr Full Cast & Crew Last Season Season 2 2009 | 13 Episodes Season 2 of Da Kink in My Hair premiered on February 12, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Da Kink in My Hair. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.globaltv.com/globaltv/globalshows/dakink/index.html Genres Comedy Drama Keywords canada hairdresser toronto dark comedy based on play or musical Content Score 79 Pump it up! We're close now. Top Contributors 22 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}