{"link": "https://www.themoviedb.org/tv/72236?language=en", "title": "ZombieLars", "resume": "In the fictitious town of Bekkebakken, conformity is a virtue and all things otherwordly are frowned upon. Twelve year old Lars, half zombie, and his just as special friends with certain supernatural characteristics, have a series of strange adventures suppressing their true natures in order to fit in.", "rate": 0, "genre": [], "cast": ["Leonard Valestrand Eike", "Hannah Raanes Holm", "Dat Royale Hoang", "Helena Ødven", "VIne Marie Willmann"], "character": ["Lars", "Anna", "Robert", "Tess", "Erle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72236   Expand ZombieLars   (2017) User Score Overview In the fictitious town of Bekkebakken, conformity is a virtue and all things otherwordly are frowned upon. Twelve year old Lars, half zombie, and his just as special friends with certain supernatural characteristics, have a series of strange adventures suppressing their true natures in order to fit in. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leonard Valestrand Eike Lars Hannah Raanes Holm Anna Dat Royale Hoang Robert Helena Ødven Tess VIne Marie Willmann Erle Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of ZombieLars premiered on June 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on ZombieLars. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Norwegian Runtime  - Homepage   http://tv.nrksuper.no/serie/zombielars Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 21 Elizabeth Jennings 4 Zorro1 4 Angeee m 1 minhnv1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}