{"link": "https://www.themoviedb.org/tv/1750?language=en", "title": "Doogie Howser, M.D.", "resume": "Doogie Howser, M.D. is an American television comedy-drama starring Neil Patrick Harris as a teenage physician who also faces the problems of being a normal teenager. Creators Steven Bochco and David E. Kelley, partnering with ABC, aired the show from 1989 to 1993 for four seasons totaling 97 episodes.", "rate": 58, "genre": ["Drama", "Comedy"], "cast": ["Neil Patrick Harris", "Max Casella", "Belinda Montgomery", "Lawrence Pressman", "Kathryn Layng"], "character": ["Doogie Howser", "Vinnie Delpino", "Katherine Howser", "Benjamin Canfield"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1750   Expand Doogie Howser, M.D.   (1989) User Score Overview Doogie Howser, M.D. is an American television comedy-drama starring Neil Patrick Harris as a teenage physician who also faces the problems of being a normal teenager. Creators Steven Bochco and David E. Kelley, partnering with ABC, aired the show from 1989 to 1993 for four seasons totaling 97 episodes. Featured Crew David E. Kelley Creator Steven Bochco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Patrick Harris Doogie Howser Max Casella Vinnie Delpino Belinda Montgomery Katherine Howser Lawrence Pressman Benjamin Canfield Kathryn Layng Full Cast & Crew Last Season Season 4 1992 | 22 Episodes Season 4 of Doogie Howser, M.D. premiered on September 23, 1992. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Doogie: Happy Birthday Neil Patrick Harris! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   1986-03-25 Perfect Strangers 6.6    1982-09-26 Matt Houston 6.6    1978-11-10 Butterflies 6.9    1980-10-04 Thundarr the Barbarian 6.3    2005-02-21 Masterchef Goes Large 4.8    1973-09-25 Police Story 6.4    1983-09-22 Just Good Friends 6.4    1977-01-14 Fantasy Island 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Drama Comedy Keywords genius los angeles doctor teenager Content Score 93 Almost there... Top Contributors 9 Banana b 6 bugfix t 3 tmdb59661364 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}