{"link": "https://www.themoviedb.org/tv/29893?language=en", "title": "Floor Faber", "resume": "Floor Faber (27) lives with her cat in the center of Amsterdam. She has a boring job at an insurance company, but one day she'll have a successful career. And find true love, as she would make a great mom, some time later. But first she has to find out what to do with her life, and that is not as easy as it seems.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Georgina Verbaan", "Kees Boot", "Roeland Fernhout", "Joan Nederlof", "Hadewych Minis"], "character": ["Floor Faber", "Gerard", "Martijn", "Irene Faber", "Gina Faber"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29893   Expand Floor Faber   (2009) User Score Overview Floor Faber (27) lives with her cat in the center of Amsterdam. She has a boring job at an insurance company, but one day she'll have a successful career. And find true love, as she would make a great mom, some time later. But first she has to find out what to do with her life, and that is not as easy as it seems. Featured Crew Manon Spierenburg Creator Maartje Fleur Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Georgina Verbaan Floor Faber Kees Boot Gerard Roeland Fernhout Martijn Joan Nederlof Irene Faber Hadewych Minis Gina Faber Full Cast & Crew Last Season Season 1 2009 | 10 Episodes Season 1 of Floor Faber premiered on October 27, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Floor Faber. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  Dutch; Flemish Runtime  25m Homepage   www.net5.nl/programmas/floor-faber/ Genres Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 68 Marr 🇳🇱 TB 3 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}