{"link": "https://www.themoviedb.org/tv/20876?language=en", "title": "Tainy Sledstviya", "resume": "Tainy Sledstviya Russian: Тайны следствия​ is a Russian television series filmed from 2000 through 2008. Since April, 2011 the new ninth season will be broadcast. The format of the series features 2 to 4, 50 minute episodes split into story arks. The television series follows the work of a female Procurator known as Maria Shvetsova. The series contains 60 episodes.", "rate": 0, "genre": ["Mystery", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20876   Expand Tainy Sledstviya User Score Overview Tainy Sledstviya Russian: Тайны следствия​ is a Russian television series filmed from 2000 through 2008. Since April, 2011 the new ninth season will be broadcast. The format of the series features 2 to 4, 50 minute episodes split into story arks. The television series follows the work of a female Procurator known as Maria Shvetsova. The series contains 60 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Mystery Drama Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}