{"link": "https://www.themoviedb.org/tv/73467?language=en", "title": "Godless", "resume": "A ruthless outlaw terrorizes the West in search of a former member of his gang, who’s found a new life in a quiet town populated only by women.", "rate": 79, "genre": ["Western"], "cast": ["Jeff Daniels", "Michelle Dockery", "Jack O'Connell", "Scoot McNairy", "Thomas Brodie-Sangster"], "character": ["Frank Griffin", "Alice Fletcher", "Roy Goode", "Bill McNue", "Whitey Winn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73467   Expand Godless   (2017) User Score  Play Trailer Overview A ruthless outlaw terrorizes the West in search of a former member of his gang, who’s found a new life in a quiet town populated only by women. Featured Crew Steven Soderbergh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  17 Posters  10 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Daniels Frank Griffin Michelle Dockery Alice Fletcher Jack O'Connell Roy Goode Scoot McNairy Bill McNue Thomas Brodie-Sangster Whitey Winn Full Cast & Crew Current Season Season 1 2017 | 7 Episodes Season 1 of Godless premiered on November 22, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply W What a load of horse-poop Open 0 by Weedinator\n      \n     S1:E1, E7: You lost your shadow... Open 1 by  Daddie0 S1:E7 - Favorite moment/scene... (spoilers) Open 0 by Daddie0\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  17 Posters  10 Recommendations   2017-07-21 Ozark 8.0    2017-09-10 The Deuce 7.9    2017-08-01 Manhunt: Unabomber 7.8    2012-06-26 Line of Duty 8.0    2018-02-11 Here and Now 7.7    2017-08-02 The Sinner 7.3    2017-10-13 Mindhunter 7.4    2017-06-30 Gypsy 6.0  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  80m, 51m, 70m Homepage   https://www.netflix.com/title/80097141 Genres Western Keywords wanted poster mining accident outlaw gang miniseries violence mining town Content Score 100 Yes! Looking good! Top Contributors 80 Elizabeth Jennings TB 68 TMDb Bot O 16 OblateSphereDroid 13 Negan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}