{"link": "https://www.themoviedb.org/tv/74533?language=en", "title": "Dominion Creek", "resume": "The story of the Connolly Brothers; three Irish emigrants who travel from Montana to the Yukon during the Klondike gold rush of the 1890’s in the hope of striking it rich where they become embroiled in a deadly feud with the man who runs the town.", "rate": 0, "genre": ["Drama", "Western"], "cast": ["Bríd Ní Neachtain", "Chloe Ewart", "Owen McDonnell", "Dara Devaney", "Seán T. Ó Meallaigh"], "character": ["Belinda Mulrooney", "El Soo", "Tom Connolly", "Séamus Connolly", "Pádraig Connolly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74533   Expand Dominion Creek   (2015) User Score  Play Trailer Overview The story of the Connolly Brothers; three Irish emigrants who travel from Montana to the Yukon during the Klondike gold rush of the 1890’s in the hope of striking it rich where they become embroiled in a deadly feud with the man who runs the town. Featured Crew Dathaí Keane Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bríd Ní Neachtain Belinda Mulrooney Chloe Ewart El Soo Owen McDonnell Tom Connolly Dara Devaney Séamus Connolly Seán T. Ó Meallaigh Pádraig Connolly Full Cast & Crew Last Season Season 2 2017 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Dominion Creek. You can help by rating TV shows you've seen. Facts Original Name  An Klondike Status  Returning Series Network Certification  - Type  Scripted Original Language  Irish Runtime  - Homepage   http://anklondike.com Genres Drama Western Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 52 mostern 7 Elizabeth Jennings c 7 chenchu007 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}