{"link": "https://www.themoviedb.org/tv/61239?language=en", "title": "Aquarius", "resume": "In the late 1960s, a Los Angeles police sergeant with a complicated personal life starts tracking a small-time criminal and budding cult leader seeking out vulnerable women to join his “cause.” The name of that man is Charles Manson.", "rate": 68, "genre": ["Drama", "Crime"], "cast": ["David Duchovny", "Grey Damon", "Gethin Anthony", "Emma Dumont", "Claire Holt"], "character": ["Detective Sam Hodiak", "Brian Shafe", "Charles Manson", "Emma Karn", "Charmain Tully"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61239   Expand Aquarius   (2015) User Score  Play Trailer Overview In the late 1960s, a Los Angeles police sergeant with a complicated personal life starts tracking a small-time criminal and budding cult leader seeking out vulnerable women to join his “cause.” The name of that man is Charles Manson. Featured Crew John McNamara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Duchovny Detective Sam Hodiak Grey Damon Brian Shafe Gethin Anthony Charles Manson Emma Dumont Emma Karn Claire Holt Charmain Tully Full Cast & Crew Last Season Season 2 2016 | 13 Episodes Season 2 of Aquarius premiered on June 16, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Great show, a few random thoughts about Open 0 by write2topcat\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   2015-10-27 Wicked City 5.4    2017-01-03 Heavy Rescue: 401 7.5    2015-08-25 Fried 6.0    2013-10-18 Man Down 6.4    2015-03-16 Spotless 7.3    2012-10-11 Copper 6.0    2015-05-21 Between 5.4    2015-08-20 Documentary Now! 7.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/aquarius Genres Drama Crime Keywords cult based on a true story cop charles manson missing person 1960s Content Score 100 Yes! Looking good! Top Contributors 59 Elizabeth Jennings 39 Banana w 7 webmaster 6 cesar_n  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}