{"link": "https://www.themoviedb.org/tv/61150?language=en", "title": "Cunning Single Lady", "resume": "Ae-Ra is focused on her appearance as she believes it will lead her to a better life. She then meets Jung-Woo who studied engineering. They eventually get married, but they also get divorced. After their divorce, Ae-Ra goes through difficult times. Unlike Ae-Ra though, Jung-Woo becomes a successful IT developer and very wealthy. Now, Ae-Ra tries to seduce Jung-Woo to marry her again.", "rate": 65, "genre": ["Comedy", "Drama"], "cast": ["Lee Min-jung", "Joo Sang-wook", "Kim Gyu-ri", "Seo Kang-joon", "Lee Jeong-kil"], "character": ["Na Ae-ra", "Cha Jung-woo", "Gook Yeo-jin", "Gook Seung-hyun", "Gook Yong-geol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61150   Expand Cunning Single Lady   (2014) User Score Overview Ae-Ra is focused on her appearance as she believes it will lead her to a better life. She then meets Jung-Woo who studied engineering. They eventually get married, but they also get divorced. After their divorce, Ae-Ra goes through difficult times. Unlike Ae-Ra though, Jung-Woo becomes a successful IT developer and very wealthy. Now, Ae-Ra tries to seduce Jung-Woo to marry her again. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Min-jung Na Ae-ra Joo Sang-wook Cha Jung-woo Kim Gyu-ri Gook Yeo-jin Seo Kang-joon Gook Seung-hyun Lee Jeong-kil Gook Yong-geol Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Cunning Single Lady premiered on February 27, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cunning Single Lady. You can help by rating TV shows you've seen. Facts Original Name  앙큼한 돌싱녀 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/back/ Genres Comedy Drama Keywords korea Content Score 86 Almost there... Top Contributors M 58 Maria180493 CM 6 Cherche Moi z 5 zurman1 t 4 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}