{"link": "https://www.themoviedb.org/tv/20902?language=en", "title": "Lucky Feller", "resume": "Lucky Feller is a 1976 ITV sitcom written by Terence Frisby and produced by Humphrey Barclay.\nIt featured David Jason and ran for just one series of 13 episodes. It is reported that London Weekend Television later tried to revive it in the 1990s but Jason did not agree to this as he felt at the time he was being over-exposed.\nAbout two brothers in South-East London, the basic set-up can be seen as a dry run for Only Fools and Horses, except with David Jason playing the nerdy \"Rodders\" part, Shorty Mepstead. The other brother, Randolph Mepstead, was played by Peter Armitage. In the sitcom, Jason was in love with a girl, who was sexually infatuated with - and indeed pregnant by - Randolph Mepstead. Despite her feelings for Randolph, she was engaged to Shorty and had to bed him before the end of the series to make sure that he would think he was the father. But despite her best attempts, and Jason's feelings for her, the consummation never quite happened.\nGuest stars included such names as Pat Heywood, Prunella Scales and Mike Grady as well as international stars such as Bert Kwouk and Saeed Jaffrey. The show was directed by both Gerry Mill and Mike Vardy and was mainly filmed in and around South London. The show was offered a second series, however writer Terence Frisby didn't feel he had enough ideas for the series to continue and therefore the show was axed after the final episode.", "rate": 80, "genre": ["Comedy"], "cast": ["Pat Heywood", "David Jason", "Cheryl Hall"], "character": ["Shorty Mepstead"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20902   Expand Lucky Feller   (1976) User Score Overview Lucky Feller is a 1976 ITV sitcom written by Terence Frisby and produced by Humphrey Barclay. It featured David Jason and ran for just one series of 13 episodes. It is reported that London Weekend Television later tried to revive it in the 1990s but Jason did not agree to this as he felt at the time he was being over-exposed. About two brothers in South-East London, the basic set-up can be seen as a dry run for Only Fools and Horses, except with David Jason playing the nerdy \"Rodders\" part, Shorty Mepstead. The other brother, Randolph Mepstead, was played by Peter Armitage. In the sitcom, Jason was in love with a girl, who was sexually infatuated with - and indeed pregnant by - Randolph Mepstead. Despite her feelings for Randolph, she was engaged to Shorty and had to bed him before the end of the series to make sure that he would think he was the father. But despite her best attempts, and Jason's feelings for her, the consummation never quite happened. Guest stars included such names as Pat Heywood, Prunella Scales and Mike Grady as well as international stars such as Bert Kwouk and Saeed Jaffrey. The show was directed by both Gerry Mill and Mike Vardy and was mainly filmed in and around South London. The show was offered a second series, however writer Terence Frisby didn't feel he had enough ideas for the series to continue and therefore the show was axed after the final episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pat Heywood David Jason Shorty Mepstead Cheryl Hall Full Cast & Crew Last Season Season 1 1976 | 13 Episodes Season 1 of Lucky Feller premiered on September  4, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lucky Feller. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords mother brother family sitcom british humour londoners Content Score 43 There's no 'I' in team... Top Contributors O 10 Ozbourne 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}