{"link": "https://www.themoviedb.org/tv/61281?language=en", "title": "The Hotwives of Orlando", "resume": "A parody of one of the most popular franchises in reality television, “The Hotwives of Orlando,” takes you inside the uber-exclusive and glamorous world of six hot housewives livin’ large in Central Florida's sexiest city, Orlando. The show follows a cast of ladies as they fight over pretty much everything except for their love of shoes, plastic surgery, and the pursuit of spending all of their husbands’ money.", "rate": 47, "genre": ["Comedy"], "cast": ["Casey Wilson", "Danielle Schneider", "Tymberlee Hill", "Andrea Savage", "Angela Kinsey"], "character": ["Tawny St. John", "Shauna Maducci", "Phe Phe Reed", "Veronica Von Vandervon", "Crystal Simmons"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61281   Expand The Hotwives of Orlando   (2014) User Score  Play Trailer Overview A parody of one of the most popular franchises in reality television, “The Hotwives of Orlando,” takes you inside the uber-exclusive and glamorous world of six hot housewives livin’ large in Central Florida's sexiest city, Orlando. The show follows a cast of ladies as they fight over pretty much everything except for their love of shoes, plastic surgery, and the pursuit of spending all of their husbands’ money. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casey Wilson Tawny St. John Danielle Schneider Shauna Maducci Tymberlee Hill Phe Phe Reed Andrea Savage Veronica Von Vandervon Angela Kinsey Crystal Simmons Full Cast & Crew Last Season Season 1 2014 | 7 Episodes Season 1 of The Hotwives of Orlando premiered on July 15, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2013-08-05 Quick Draw 6.3    2015-08-05 Difficult People 7.4  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.hulu.com/the-hotwives-of-orlando Genres Comedy Keywords parody blonde sitcom Content Score 93 Almost there... Top Contributors 33 Elizabeth Jennings z 6 zurman1 3 Banana 3 Antalysfr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}