{"link": "https://www.themoviedb.org/tv/61917?language=en", "title": "The Dovekeepers", "resume": "Set in ancient Israel, The Dovekeepers is based on the true events at Masada in 70 C.E. After being forced out of their home in Jerusalem by the Romans, 900 Jews were ensconced in a fortress at Masada, a mountain in the Judean desert. Besieged at Masada, the Jews held out for months against the vast Roman armies. The events are recounted from the perspective of a few extraordinary women who arrive at Masada with unique backstories, but a common bond for survival. Additionally, these women, who work together daily as dovekeepers, are all concealing substantial secrets. This four-hour limited event series is based on Alice Hoffman's bestselling, critically acclaimed historical novel.", "rate": 53, "genre": ["Drama"], "cast": ["Cote de Pablo", "Rachel Brosnahan", "Kathryn Prescott", "Diego Boneta", "Andre Agius"], "character": ["Shirah", "Yael", "Aziza", "Amram", "Adir"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61917   Expand The Dovekeepers   (2015) User Score  Play Trailer Overview Set in ancient Israel, The Dovekeepers is based on the true events at Masada in 70 C.E. After being forced out of their home in Jerusalem by the Romans, 900 Jews were ensconced in a fortress at Masada, a mountain in the Judean desert. Besieged at Masada, the Jews held out for months against the vast Roman armies. The events are recounted from the perspective of a few extraordinary women who arrive at Masada with unique backstories, but a common bond for survival. Additionally, these women, who work together daily as dovekeepers, are all concealing substantial secrets. This four-hour limited event series is based on Alice Hoffman's bestselling, critically acclaimed historical novel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cote de Pablo Shirah Rachel Brosnahan Yael Kathryn Prescott Aziza Diego Boneta Amram Andre Agius Adir Full Cast & Crew Last Season Season 1 2015 | 2 Episodes Season 1 of The Dovekeepers premiered on March 31, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Dovekeepers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  84m, 120m Homepage   http://www.cbs.com/shows/the-dovekeepers/ Genres Drama Keywords based on novel or book jerusalem religion miniseries historical drama ancient israel Content Score 93 Almost there... Top Contributors 60 Elizabeth Jennings TB 30 TMDb Bot 16 Banana 7 seawolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}