{"link": "https://www.themoviedb.org/tv/69462?language=en", "title": "Medical Team: Lady Davinci's Diagnosis", "resume": "Shiho works as a neurosurgeon at Nishitokyo General Hospital. She decides to quit her profession after hallucinating during surgery. Her ex-teacher Masayuki Kitabatake is the director at Tokyo University Hospital and he persuades Shiho to work at his hospital in the diagnosis department which consists of all female doctors. Shiho, who is more stubborn in her will to save other patients, sometimes come in conflicts with the other doctors there, but she cooperates with them to reveal a mysterious malady.", "rate": 0, "genre": ["Mystery"], "cast": ["Yo Yoshida", "Saki Aibu", "Riho Yoshioka", "Kumiko Shiratori", "Saori Takizawa"], "character": ["Shiho Tachibana", "Yukino Nitta", "Ayaka Tamaru", "Ran Satomi", "Yui Uematsu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69462   Expand Medical Team: Lady Davinci's Diagnosis   (2016) User Score Overview Shiho works as a neurosurgeon at Nishitokyo General Hospital. She decides to quit her profession after hallucinating during surgery. Her ex-teacher Masayuki Kitabatake is the director at Tokyo University Hospital and he persuades Shiho to work at his hospital in the diagnosis department which consists of all female doctors. Shiho, who is more stubborn in her will to save other patients, sometimes come in conflicts with the other doctors there, but she cooperates with them to reveal a mysterious malady. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yo Yoshida Shiho Tachibana Saki Aibu Yukino Nitta Riho Yoshioka Ayaka Tamaru Kumiko Shiratori Ran Satomi Saori Takizawa Yui Uematsu Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Medical Team: Lady Davinci's Diagnosis premiered on October 11, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Medical Team: Lady Davinci's Diagnosis. You can help by rating TV shows you've seen. Facts Original Name  メディカルチーム レディ・ダ・ヴィンチの診断 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.ktv.jp/ladydavinci/ Genres Mystery Keywords japan medical drama Content Score 86 Almost there... Top Contributors M 38 Maria180493 4 MundoAsian TB 2 TMDb Bot c 1 ctchim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}