{"link": "https://www.themoviedb.org/tv/11780?language=en", "title": "Shannon's Deal", "resume": "Shannon's Deal is an American legal drama that aired on NBC from April 13, 1990 until May 21, 1991. The series was created by John Sayles and executive produced by Stan Rogow. The show centers on a successful Philadelphia corporate lawyer named Jack Shannon, who lost his family and his job to a compulsive gambling habit. The saga of Shannon, who leaves a prestigious law firm after years of becoming unhappy with the legal system and being forced to take his clients to court, and whom subsequently opens his own low-rent practice, was first explored in the high-rated two-hour movie pilot, which NBC aired on June 4, 1989.\nThe series was highly regarded in the industry for its level of writing, complex character development, and its witty dramedy elements, but is also remembered for the notable people who worked behind the scenes.", "rate": 100, "genre": ["Drama"], "cast": ["Jamey Sheridan", "Martin Ferrero", "Elizabeth Peña"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11780   Expand Shannon's Deal   (1990) User Score Overview Shannon's Deal is an American legal drama that aired on NBC from April 13, 1990 until May 21, 1991. The series was created by John Sayles and executive produced by Stan Rogow. The show centers on a successful Philadelphia corporate lawyer named Jack Shannon, who lost his family and his job to a compulsive gambling habit. The saga of Shannon, who leaves a prestigious law firm after years of becoming unhappy with the legal system and being forced to take his clients to court, and whom subsequently opens his own low-rent practice, was first explored in the high-rated two-hour movie pilot, which NBC aired on June 4, 1989. The series was highly regarded in the industry for its level of writing, complex character development, and its witty dramedy elements, but is also remembered for the notable people who worked behind the scenes. Featured Crew John Sayles Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamey Sheridan Martin Ferrero Elizabeth Peña Full Cast & Crew Last Season Season 2 1991 | 8 Episodes Season 2 of Shannon's Deal premiered on March 23, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shannon's Deal. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 48m Homepage  - Genres Drama Keywords philadelphia lawyer Content Score 50 Still needs a little work. Top Contributors 6 Banana TB 2 TMDb Bot 1 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}