{"link": "https://www.themoviedb.org/tv/65229?language=en", "title": "Circles", "resume": "High school doesn't really end after graduation. Whether you like it or not, it follows you around wherever you go. It may be in the back of your head, but it's there. Sometimes it comes out when you're around your old classmates, and you revert back to your 18 year old self, despite your best efforts. For Lucas, Noah, Jessie, Abby, April and Tyler, their upcoming 10 year high school reunion keeps inching closer and making them realize all of this. Each of them wants to separate themselves from their high school persona, for different reasons, but things keep happening to make them even closer to their former selves.", "rate": 100, "genre": ["Comedy"], "cast": ["Brandon Bautista", "Kathleen Bendall", "Paul DeGennaro", "Linsay Gould", "Anna MacKinnon"], "character": ["Lucas", "Abby", "Tyler", "April", "Jessie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65229   Expand Circles   (2008) User Score Overview High school doesn't really end after graduation. Whether you like it or not, it follows you around wherever you go. It may be in the back of your head, but it's there. Sometimes it comes out when you're around your old classmates, and you revert back to your 18 year old self, despite your best efforts. For Lucas, Noah, Jessie, Abby, April and Tyler, their upcoming 10 year high school reunion keeps inching closer and making them realize all of this. Each of them wants to separate themselves from their high school persona, for different reasons, but things keep happening to make them even closer to their former selves. Featured Crew Brandon Bautista Creator Joshua Ortman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brandon Bautista Lucas Kathleen Bendall Abby Paul DeGennaro Tyler Linsay Gould April Anna MacKinnon Jessie Full Cast & Crew Last Season Season 1 2008 | 7 Episodes Season 1 of Circles premiered on February 10, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Circles. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords high school high school reunion class reunion Content Score 93 Almost there... Top Contributors 24 bbautista  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}