{"link": "https://www.themoviedb.org/tv/24835?language=en", "title": "Clannad", "resume": "Tomoya Okazaki is a third year high school student resentful of his life. His mother passed away from a car accident when he was younger, causing his father to resort to alcohol and cigarettes. This results in fights between the two until Tomoya's shoulder is injured in a fight. Since then, Tomoya has had distant relationships with his father, causing him to become a delinquent over time. While on a walk to school, he meets a strange girl named Nagisa Furukawa who is a year older, but is repeating due to illness. Due to this, she is often alone as most of her friends have moved on. The two begin hanging out and slowly, as time goes by, Tomoya finds his life shifting in a new direction. Anime based on a popular visual novel game.", "rate": 76, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Ai Nonaka", "Ryou Hirohashi", "Daisuke Sakaguchi", "Satomi Kōrogi", "Tomoko Kawakami"], "character": ["Fuuko Ibuki", "Kyou Fujibayashi", "Youhei Sunohara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24835   Expand Clannad   (2007) User Score Overview Tomoya Okazaki is a third year high school student resentful of his life. His mother passed away from a car accident when he was younger, causing his father to resort to alcohol and cigarettes. This results in fights between the two until Tomoya's shoulder is injured in a fight. Since then, Tomoya has had distant relationships with his father, causing him to become a delinquent over time. While on a walk to school, he meets a strange girl named Nagisa Furukawa who is a year older, but is repeating due to illness. Due to this, she is often alone as most of her friends have moved on. The two begin hanging out and slowly, as time goes by, Tomoya finds his life shifting in a new direction. Anime based on a popular visual novel game. Featured Crew Tatsuya Ishihara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  10 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ai Nonaka Fuuko Ibuki Ryou Hirohashi Kyou Fujibayashi Daisuke Sakaguchi Youhei Sunohara Satomi Kōrogi Tomoko Kawakami Full Cast & Crew Last Season After Story 2008 | 25 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Clannad. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  11 Recommendations   2010-04-03 Angel Beats! 7.4    2006-10-05 Code Geass: Lelouch of the Rebellion 8.1    2012-01-10 Another 7.2    2007-04-08 Lucky Star 5.0    2010-07-05 Highschool of the Dead 7.0    2011-10-02 Fate/Zero 7.9    2008-04-07 Soul Eater 7.0    2012-12-03 Guilty Crown 7.4  Facts Original Name  クラナド Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/clannad/clannad1/ Genres Animation Comedy Drama Keywords teen drama anime based on visual novel Content Score 93 Almost there... Top Contributors 48 CrewMdk 20 WillofOwn 18 sp1ti 15 Axeshizzle  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}