{"link": "https://www.themoviedb.org/tv/33860?language=en", "title": "Mapp & Lucia", "resume": "Comedy, set during the 1930s, of social rivalry between two women in a small English town. New arrival Lucia (Geraldine McEwan, as Emmeline \"Lucia\" Lucas) creates challenges to the established local social dominance of Miss Elizabeth Mapp (Prunella Scales).", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["Geraldine McEwan", "Prunella Scales", "Nigel Hawthorne", "Denis Lill", "Mary MacLeod"], "character": ["Godiva 'Diva' Plaistow"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33860   Expand Mapp & Lucia   (1985) User Score Overview Comedy, set during the 1930s, of social rivalry between two women in a small English town. New arrival Lucia (Geraldine McEwan, as Emmeline \"Lucia\" Lucas) creates challenges to the established local social dominance of Miss Elizabeth Mapp (Prunella Scales). Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Geraldine McEwan Prunella Scales Nigel Hawthorne Denis Lill Mary MacLeod Godiva 'Diva' Plaistow Full Cast & Crew Last Season Season 2 1986 | 5 Episodes Season 2 of Mapp & Lucia premiered on May  3, 1986. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Anyone remember this hilarious mid-1980s British series? Open 0 by genplant29\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mapp & Lucia. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Comedy Keywords small town british humour 1930s Content Score 86 Almost there... Top Contributors w 3 webmaster 3 cineemcasaoficial O 3 Ozbourne 3 genplant29  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}