{"link": "https://www.themoviedb.org/tv/72638?language=en", "title": "Dream Star Button Nose", "resume": "Button Nose is a little girl who is home alone for a few days when a robot comes to gather strawberries. She is so excited by his spaceship she accidentally starts it, and goes on a voyage to his planet. When she lands she is brought before the king, who is a distant relative of hers and invites her to spend some time on the planet.", "rate": 0, "genre": ["Animation"], "cast": ["Sanae Miyuki", "Akira Kamiya", "Hiroshi Ohtake", "Jōji Yanami", "Kazue Komiya"], "character": ["Button nose (voice)", "Chikutakubon (voice)", "Grand Chamberlain (voice)", "Duke Fastener (voice)", "Clip (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72638   Expand Dream Star Button Nose   (1985) User Score Overview Button Nose is a little girl who is home alone for a few days when a robot comes to gather strawberries. She is so excited by his spaceship she accidentally starts it, and goes on a voyage to his planet. When she lands she is brought before the king, who is a distant relative of hers and invites her to spend some time on the planet. Featured Crew Atsushi Tomioka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  3 Top Billed Cast Sanae Miyuki Button nose (voice) Akira Kamiya Chikutakubon (voice) Hiroshi Ohtake Grand Chamberlain (voice) Jōji Yanami Duke Fastener (voice) Kazue Komiya Clip (voice) Full Cast & Crew Last Season Season 1 1985 | 26 Episodes Season 1 of Dream Star Button Nose premiered on October 19, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  4 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dream Star Button Nose. You can help by rating TV shows you've seen. Facts Original Name  夢の星のボタンノーズ Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  24m Homepage  - Genres Animation Keywords anime Content Score 86 Almost there... Top Contributors 76 minusha97 TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}