{"link": "https://www.themoviedb.org/tv/7077?language=en", "title": "The Millionaire Matchmaker", "resume": "Patti Stanger is the founder and CEO of the Millionaire's Club, an elite matchmaking that helps wealthy men find the women of their dreams. With a fierce passion for her work, Stanger is determined to find love for each and every one of her clients.", "rate": 25, "genre": ["Reality"], "cast": ["Patti Stanger"], "character": ["Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7077   Expand The Millionaire Matchmaker   (2008) User Score Overview Patti Stanger is the founder and CEO of the Millionaire's Club, an elite matchmaking that helps wealthy men find the women of their dreams. With a fierce passion for her work, Stanger is determined to find love for each and every one of her clients. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patti Stanger Herself Full Cast & Crew Last Season Season 8 2014 | 15 Episodes Season 8 of The Millionaire Matchmaker premiered on December  7, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Millionaire Matchmaker. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Millionaire Matchmaker. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  48m Homepage   http://www.bravotv.com/Millionaire_Matchmaker/ Genres Reality Keywords business woman matchmaking dating millionaire beverly hills Content Score 56 We're so close, yet so far. Top Contributors 33 Banana R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}