{"link": "https://www.themoviedb.org/tv/32231?language=en", "title": "The Qin Empire", "resume": "The Qin Empire is a 2009 Chinese television series based on Sun Haohui's novel of the same Chinese title. The 51 episodes long series chronicles the rise of the Qin state in the Warring States period during the reign of Duke Xiao of Qin. It was produced in 2006 and first aired on television channels in China in December 2009.", "rate": 83, "genre": ["Documentary", "Drama", "War", "Politics"], "cast": ["Zhang Bo", "Shen Jiani", "Zhao Longhao", "Wu Liansheng", "Wang Xiaoyi"], "character": ["King Zhaoxiang", "Zhao Man", "Wei Ran", "Fan Sui", "Su Qin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32231   Expand The Qin Empire   (2009) User Score Overview The Qin Empire is a 2009 Chinese television series based on Sun Haohui's novel of the same Chinese title. The 51 episodes long series chronicles the rise of the Qin state in the Warring States period during the reign of Duke Xiao of Qin. It was produced in 2006 and first aired on television channels in China in December 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zhang Bo King Zhaoxiang Shen Jiani Zhao Man Zhao Longhao Wei Ran Wu Liansheng Fan Sui Wang Xiaoyi Su Qin Full Cast & Crew Last Season Season 3 2017 | 34 Episodes Season 3 of The Qin Empire premiered on February  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2017-03-24 Youn's Kitchen 9.3  Facts Original Name  大秦帝国 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   https://movie.douban.com/subject/3114220/ Genres Documentary Drama War & Politics Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors k 46 ktoswang 28 Elizabeth Jennings 28 thirstyhippo 14 tcx4c70  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}