{"link": "https://www.themoviedb.org/tv/32613?language=en", "title": "Cantinflas Show", "resume": "Cantinflas Show is a Mexican animated television series produced by Televisa. The series was created by Mario Moreno 'Cantinflas' and animated by Spanish animator José Luis Moro, who animated the pilot episode in 1972.\nCantinflas, the main character, is present in popular stories like Samson and Delilah, and meets famous geniuses like Einstein and Edison. It can clearly be seen that the Mexican comedian improvised his script, which adds the comedy-relief, especially in his conversations with each episode's character.", "rate": 80, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32613   Expand Cantinflas Show User Score Overview Cantinflas Show is a Mexican animated television series produced by Televisa. The series was created by Mario Moreno 'Cantinflas' and animated by Spanish animator José Luis Moro, who animated the pilot episode in 1972. Cantinflas, the main character, is present in popular stories like Samson and Delilah, and meets famous geniuses like Einstein and Edison. It can clearly be seen that the Mexican comedian improvised his script, which adds the comedy-relief, especially in his conversations with each episode's character. Featured Crew Televisa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  5m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors y 7 yelito  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}