{"link": "https://www.themoviedb.org/tv/68177?language=en", "title": "Iris II", "resume": "IRIS II: New Generation explores the aftermath events of IRIS as well as Athena: Goddess of War. The story explores the origins of the former Director of the NSS and IRIS agent, Baek San, and the protagonist Jung Yoo-gun.", "rate": 0, "genre": ["Drama", "Action", "Adventure"], "cast": ["Jang Hyuk", "Lee Beom-soo", "Lee Jeong-kil", "Lee Da-hae", "Kim Yeong-cheol"], "character": ["Jung Yoo-gun", "Yoo Joong-won", "Ex-President Jo Myeong-ho", "Ji Soo-yeon", "Baek San"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68177   Expand Iris II   (2013) User Score Overview IRIS II: New Generation explores the aftermath events of IRIS as well as Athena: Goddess of War. The story explores the origins of the former Director of the NSS and IRIS agent, Baek San, and the protagonist Jung Yoo-gun. Featured Crew Jung Tae-Won Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jang Hyuk Jung Yoo-gun Lee Beom-soo Yoo Joong-won Lee Jeong-kil Ex-President Jo Myeong-ho Lee Da-hae Ji Soo-yeon Kim Yeong-cheol Baek San Full Cast & Crew Last Season Iris II 2013 | 20 Episodes Season 1 of Iris II premiered on February 13, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Iris II. You can help by rating TV shows you've seen. Facts Original Name  아이리스2 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/iris2 Genres Drama Action & Adventure Keywords spy Content Score 93 Almost there... Top Contributors t 47 tmdb983464 4 shadowfurious TB 1 TMDb Bot 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}