{"link": "https://www.themoviedb.org/tv/5294?language=en", "title": "Percy tårar", "resume": "Percy Tårar was a Swedish 6-part television show broadcast by SVT in 1996. It was Killinggänget's follow-up to the popular Nilecity 105,6. It was directed by Walter Söderlund and produced by Magdalena Jangard.\nThe loose plot of the series revolves around a number of mostly unrelated storylines which are told in segments in each episode. These segments are flanked by various stand-alone sketches that will sometimes elaborate on minor characters.", "rate": 70, "genre": ["Comedy"], "cast": ["Robert Gustafsson", "Jonas Inde", "Johan Rheborg"], "character": ["Kapten Klänning", "Tommy Bohlin", "Percy Nilegård"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5294   Expand Percy tårar   (1996) User Score Overview Percy Tårar was a Swedish 6-part television show broadcast by SVT in 1996. It was Killinggänget's follow-up to the popular Nilecity 105,6. It was directed by Walter Söderlund and produced by Magdalena Jangard. The loose plot of the series revolves around a number of mostly unrelated storylines which are told in segments in each episode. These segments are flanked by various stand-alone sketches that will sometimes elaborate on minor characters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Gustafsson Kapten Klänning Jonas Inde Tommy Bohlin Johan Rheborg Percy Nilegård Full Cast & Crew Last Season Season 1 1996 | 6 Episodes Season 1 of Percy tårar premiered on September 11, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Percy tårar. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors b 5 bonne1978 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}