{"link": "https://www.themoviedb.org/tv/46973?language=en", "title": "Plebs", "resume": "Sitcom about three desperate young men from the suburbs who try to get laid, hold down jobs and climb the social ladder in the big city - which just happens to be ancient Rome.", "rate": 76, "genre": ["Comedy"], "cast": ["Tom Rosenthal", "Ryan Sampson", "Tom Basden", "Karl Theobald", "Jonathan Pointing"], "character": ["Marcus", "Grumio", "Aurelius", "Landlord", "Jason"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46973   Expand Plebs   (2013) User Score  Play Trailer Overview Sitcom about three desperate young men from the suburbs who try to get laid, hold down jobs and climb the social ladder in the big city - which just happens to be ancient Rome. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Rosenthal Marcus Ryan Sampson Grumio Tom Basden Aurelius Karl Theobald Landlord Jonathan Pointing Jason Full Cast & Crew Current Season Season 4 2018 | 8 Episodes Season 4 of Plebs premiered on April  9, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Plebs. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2006-01-01 In Justice 6.8    2015-04-15 The Delivery Man 6.5    2016-06-08 Power Monkeys 7.0    2011-01-13 Kidnap and Ransom 7.6    2013-05-12 Family Tree 6.2    2011-06-06 Injustice 7.3    2011-09-14 Free Agents 4.8    2011-06-05 Case Histories 8.2  Facts Status  Returning Series Network Certification NR Meaning No rating information. Type  Scripted Original Language  English Runtime  30m Homepage   https://www.itv.com/itvplayer/plebs Genres Comedy Keywords ancient rome slave sitcom british humour period sitcom Content Score 93 Almost there... Top Contributors 36 Elizabeth Jennings 22 rudely_murray z 10 zurman1 S 7 Sp00nKilla  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}