{"link": "https://www.themoviedb.org/tv/24247?language=en", "title": "A Dance to the Music of Time", "resume": "A Dance to the Music of Time is a four-part adaptation of Anthony Powell's 12-volume novel sequence that aired on Channel 4 in 1997. The series is a sharp, comic portrait of upper-class and bohemian England, spanning almost a century, from the early 1920s to modern times.", "rate": 70, "genre": ["Comedy", "Drama"], "cast": ["James Fleet", "Claire Skinner", "James Purefoy", "James D'Arcy", "Jonathan Cake"], "character": ["Moreland", "Jean", "Nicholas Jenkins", "Nicholas Jenkins as a student", "Peter Templer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24247   Expand A Dance to the Music of Time   (1997) User Score Overview A Dance to the Music of Time is a four-part adaptation of Anthony Powell's 12-volume novel sequence that aired on Channel 4 in 1997. The series is a sharp, comic portrait of upper-class and bohemian England, spanning almost a century, from the early 1920s to modern times. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Fleet Moreland Claire Skinner Jean James Purefoy Nicholas Jenkins James D'Arcy Nicholas Jenkins as a student Jonathan Cake Peter Templer Full Cast & Crew Last Season Miniseries 1997 | 4 Episodes Season 1 of A Dance to the Music of Time premiered on October  9, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on A Dance to the Music of Time. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/a-dance-to-the-music-of-time Genres Comedy Drama Keywords england upper class world war ii miniseries lifetime Content Score 86 Almost there... Top Contributors TB 46 TMDb Bot 14 Banana R 2 Rebecca S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}