{"link": "https://www.themoviedb.org/tv/58887?language=en", "title": "Omar", "resume": "Omar or Farouk Omar is a historical Arab television drama series that was produced and broadcast by MBC1 and directed by Hatem Ali. Co-produced by Qatar TV, the series is based on the life of Omar, one of the Prophet Mohammad's best companions and the second Caliph of Islam. The series had to face large controversy due to its depiction of Omar, Abu Bakr, Osman and Ali, the four Rashidun Caliphs, along with other characters, who some Muslims believe should not be depicted much like the Prophet Mohammad. The series consisted of 30 episodes and was originally aired in the month of Ramadan since July 20, 2012. It was made at a cost of 200 million Saudi Riyals and filmed in Morocco, mostly in Marakesh, Tangiers, El Jadida, Casablanca and Mohammedia. After the series was broadcast on MBC, dubbed into several languages and subtitled in English on youtube, it received great support from many different scholarly bodies and people watching it. As the series depended solely on reliable historical established facts, the series did not face criticism in terms of its content, as past movies and films faced.", "rate": 0, "genre": ["Documentary", "Drama"], "cast": ["Hassan Al-Jundi", "Samer Mohamad Ismail", "Ghassan Massoud"], "character": ["Utbah ibn Rabi'ah", "Farouk Omar", "Abu Bakr"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58887   Expand Omar   (2012) User Score Overview Omar or Farouk Omar is a historical Arab television drama series that was produced and broadcast by MBC1 and directed by Hatem Ali. Co-produced by Qatar TV, the series is based on the life of Omar, one of the Prophet Mohammad's best companions and the second Caliph of Islam. The series had to face large controversy due to its depiction of Omar, Abu Bakr, Osman and Ali, the four Rashidun Caliphs, along with other characters, who some Muslims believe should not be depicted much like the Prophet Mohammad. The series consisted of 30 episodes and was originally aired in the month of Ramadan since July 20, 2012. It was made at a cost of 200 million Saudi Riyals and filmed in Morocco, mostly in Marakesh, Tangiers, El Jadida, Casablanca and Mohammedia. After the series was broadcast on MBC, dubbed into several languages and subtitled in English on youtube, it received great support from many different scholarly bodies and people watching it. As the series depended solely on reliable historical established facts, the series did not face criticism in terms of its content, as past movies and films faced. Featured Crew Samer Mohamad Ismail Creator Ghassan Massoud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hassan Al-Jundi Utbah ibn Rabi'ah Samer Mohamad Ismail Farouk Omar Ghassan Massoud Abu Bakr Full Cast & Crew Last Season Season 1 2012 | 31 Episodes Season 1 of Omar premiered on July 20, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Omar. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.serie-omar.fr/ Genres Documentary Drama Keywords islam Content Score 64 We're so close, yet so far. Top Contributors O 23 Omar76 18 cosmo12 TB 2 TMDb Bot 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}