{"link": "https://www.themoviedb.org/tv/20767?language=en", "title": "The Inspector Alleyn Mysteries", "resume": "The Inspector Alleyn Mysteries is a British detective television series adapted from nine of the Roderick Alleyn novels by Ngaio Marsh. It originally aired between 1990 and 1994.\nIn the pilot episode Detective Inspector Alleyn was played by Simon Williams. William Simons played Alleyn's righthand man and \"Watson\" figure, Detective Sergeant Fox, and Belinda Lang starred as the painter Agatha Troy, Alleyn's love interest.\nWilliams was unavailable when the first series was made, so whilst Simons and Lang reprised their original roles, the lead character was henceforth played by Patrick Malahide.\nThe BBC made nine episodes in all, each based on a separate novel. The eight episodes featuring Malahide are available on DVD in the USA and UK. An Australian set has all nine episodes.", "rate": 50, "genre": [], "cast": ["Simon Williams", "Patrick Malahide", "William Simons", "Belinda Lang", "Tom Wilkinson"], "character": ["Gerald Lacklander"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20767   Expand The Inspector Alleyn Mysteries   (1993) User Score Overview The Inspector Alleyn Mysteries is a British detective television series adapted from nine of the Roderick Alleyn novels by Ngaio Marsh. It originally aired between 1990 and 1994. In the pilot episode Detective Inspector Alleyn was played by Simon Williams. William Simons played Alleyn's righthand man and \"Watson\" figure, Detective Sergeant Fox, and Belinda Lang starred as the painter Agatha Troy, Alleyn's love interest. Williams was unavailable when the first series was made, so whilst Simons and Lang reprised their original roles, the lead character was henceforth played by Patrick Malahide. The BBC made nine episodes in all, each based on a separate novel. The eight episodes featuring Malahide are available on DVD in the USA and UK. An Australian set has all nine episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Williams Patrick Malahide William Simons Belinda Lang Tom Wilkinson Gerald Lacklander Full Cast & Crew Last Season Alleyn mysteries season 2 1994 | 3 Episodes Season 2 of The Inspector Alleyn Mysteries premiered on January 10, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Inspector Alleyn Mysteries. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  100m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors e 3 egbertbos JW 2 Jack Wright 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}