{"link": "https://www.themoviedb.org/tv/77248?language=en", "title": "Animals with Cameras", "resume": "Go where no human cameraman can go and witness a new perspective of the animal kingdom in Animals with Cameras, A Nature Miniseries. The new three-part series journeys into animals’ worlds using custom, state-of-the-art cameras worn by the animals themselves. Capturing never-before-seen behavior, these animal cinematographers help expand human understanding of their habitats and solve mysteries that have eluded scientists until now.\nWildlife cameraman Gordon Buchanan and a team of pioneering animal behaviorists join forces to explore stories of animal lives “told” by the animals themselves. The cameras are built custom by camera design expert Chris Watts to fit on the animals unobtrusively and to be easily removed at a later point. From this unique vantage point, experience the secret lives of nine different animal species. Sprint across the savanna with a cheetah, plunge into the ocean with a seal and swing through the trees with a chimpanzee.", "rate": 80, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77248   Expand Animals with Cameras   (2018) User Score Overview Go where no human cameraman can go and witness a new perspective of the animal kingdom in Animals with Cameras, A Nature Miniseries. The new three-part series journeys into animals’ worlds using custom, state-of-the-art cameras worn by the animals themselves. Capturing never-before-seen behavior, these animal cinematographers help expand human understanding of their habitats and solve mysteries that have eluded scientists until now. Wildlife cameraman Gordon Buchanan and a team of pioneering animal behaviorists join forces to explore stories of animal lives “told” by the animals themselves. The cameras are built custom by camera design expert Chris Watts to fit on the animals unobtrusively and to be easily removed at a later point. From this unique vantage point, experience the secret lives of nine different animal species. Sprint across the savanna with a cheetah, plunge into the ocean with a seal and swing through the trees with a chimpanzee. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 3 Episodes Season 1 of Animals with Cameras premiered on January 31, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Animals with Cameras. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.bbc.co.uk/programmes/b09qqmfz Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 9 Murfur  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}