{"link": "https://www.themoviedb.org/tv/9045?language=en", "title": "The Stand", "resume": "The Stand is a 1994 television miniseries based on the novel of the same name by Stephen King. King also wrote the teleplay, and has a cameo role in the series. It was directed by Mick Garris and stars Gary Sinise, Miguel Ferrer, Rob Lowe, Ossie Davis, Ruby Dee, Jamey Sheridan, Laura San Giacomo, Molly Ringwald, Corin Nemec, Adam Storke, Ray Walston and Matt Frewer. It originally aired on ABC starting on May 8, 1994.", "rate": 68, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Gary Sinise", "Molly Ringwald", "Laura San Giacomo", "Jamey Sheridan", "Rob Lowe"], "character": ["Stu Redman", "Frannie Goldsmith", "Nadine Cross", "Randall Flagg", "Nick Andros"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9045   Expand The Stand   (1994) User Score  Play Trailer Overview The Stand is a 1994 television miniseries based on the novel of the same name by Stephen King. King also wrote the teleplay, and has a cameo role in the series. It was directed by Mick Garris and stars Gary Sinise, Miguel Ferrer, Rob Lowe, Ossie Davis, Ruby Dee, Jamey Sheridan, Laura San Giacomo, Molly Ringwald, Corin Nemec, Adam Storke, Ray Walston and Matt Frewer. It originally aired on ABC starting on May 8, 1994. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  2 Images Backdrops  8 Posters  29 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Sinise Stu Redman Molly Ringwald Frannie Goldsmith Laura San Giacomo Nadine Cross Jamey Sheridan Randall Flagg Rob Lowe Nick Andros Full Cast & Crew Last Season Season 1 1994 | 4 Episodes Season 1 of The Stand premiered on May  8, 1994. View All Seasons Social Reviews  0 Discussions  10 Subject Status Replies Last Reply GO Did Stu 'Steal' Fran? Open 0 by Gary O.\n      \n     M M-O-O-N Open 2 by  Moonglum9 S Why was Nadine chosen? Open 3 by  Gary O. Go to Discussions Media Most Popular Videos  2 Backdrops  8 Posters  29 Recommendations   1995-05-14 The Langoliers 5.9    1993-05-09 The Tommyknockers 5.1    1999-02-14 Storm of the Century 6.8    2002-01-27 Rose Red 6.6    1979-11-17 Salem's Lot 6.4    1997-04-27 The Shining 6.0    1983-05-01 V 7.3    1984-05-06 V: The Final Battle 7.3  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Sci-Fi & Fantasy Keywords good vs evil post-apocalyptic survivor miniseries apocalypse virus pandemic influenza intellectual disability speech disorder Content Score 93 Almost there... Top Contributors TB 76 TMDb Bot z 25 zurman1 16 Banana m 13 min_2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}