{"link": "https://www.themoviedb.org/tv/72748?language=en", "title": "Strike", "resume": "A war veteran turned private detective operates out of a tiny office in London’s Denmark Street. Although wounded both physically and psychologically, his unique insight and background as a military police investigator prove crucial in solving complex crimes that have baffled the police. Based on the bestselling novels written by J.K. Rowling under the pseudonym Robert Galbraith.", "rate": 62, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Tom Burke", "Holliday Grainger", "Kerr Logan", "Caitlin Innes Edwards", "Ian Attard"], "character": ["Cormoran Strike", "Robin Ellacott", "Matthew Cunliffe", "Ilsa Herbert", "Nick Herbert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72748   Expand Strike   (2017) User Score  Play Trailer Overview A war veteran turned private detective operates out of a tiny office in London’s Denmark Street. Although wounded both physically and psychologically, his unique insight and background as a military police investigator prove crucial in solving complex crimes that have baffled the police. Based on the bestselling novels written by J.K. Rowling under the pseudonym Robert Galbraith. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Burke Cormoran Strike Holliday Grainger Robin Ellacott Kerr Logan Matthew Cunliffe Caitlin Innes Edwards Ilsa Herbert Ian Attard Nick Herbert Full Cast & Crew Current Season Career of Evil 2018 | 2 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Pretty much what I expected Open 2 by  Jana Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  7 Recommendations   2017-08-08 Trust Me 6.5    2018-04-05 Deep State 6.4    2016-10-13 Falling Water 6.6    2017-09-11 Liar 6.8    2018-05-30 Reverie 7.0    2017-03-02 Prime Suspect 1973 8.1    2012-06-26 Line of Duty 8.0    2017-01-25 Cardinal 6.9  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b093ypxy Genres Crime Drama Mystery Keywords based on novel or book private detective Content Score 93 Almost there... Top Contributors 95 Elizabeth Jennings t 50 tmdb42368388 12 mdbarker23 9 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}