{"link": "https://www.themoviedb.org/tv/11046?language=en", "title": "Mister T", "resume": "Mister T is an animated series that aired on NBC on Saturday morning from 1983 to 1986. A total of 30 episodes were produced during the first two seasons, with the final season consisting entirely of reruns. The series was produced by Ruby-Spears.\nReruns were later seen on the USA Cartoon Express in the late 1980s, and more recently as part of Cartoon Network's Adult Swim late-night programming block.", "rate": 78, "genre": ["Mystery", "Animation"], "cast": ["Mr. T", "Amy Linker", "Phil LaMarr", "Takayo Fischer", "Fran Ryan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11046   Expand Mister T   (1983) User Score Overview Mister T is an animated series that aired on NBC on Saturday morning from 1983 to 1986. A total of 30 episodes were produced during the first two seasons, with the final season consisting entirely of reruns. The series was produced by Ruby-Spears. Reruns were later seen on the USA Cartoon Express in the late 1980s, and more recently as part of Cartoon Network's Adult Swim late-night programming block. Featured Crew Steve Gerber Creator Martin Pasko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Mr. T Amy Linker Phil LaMarr Takayo Fischer Fran Ryan Full Cast & Crew Last Season Season 1 1983 | 30 Episodes Season 1 of Mister T premiered on September 17, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mister T. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Mystery Animation Keywords gymnastics fighting crime Content Score 100 Yes! Looking good! Top Contributors 11 Banana TB 1 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}