{"link": "https://www.themoviedb.org/tv/18464?language=en", "title": "Darna", "resume": "Darna is a Philippine drama/fantasy series adapted from Mars Ravelo's fictional superheroine of the same name; directed by Dominic Zapata and Don Michael Perez and developed by Jun Lana. It is the third series based on the Darna graphic novels by Mars Ravelo. It stars Marian Rivera as the title role and her alter-ego Narda, with Iwa Moto as her main nemesis Valentina, also starring Dennis Trillo as Pancho and Mark Anthony Fernandez as Eduardo.\nThe series had premiered on August 10, 2009 on GMA Network and ended on February 19, 2010, and also featured the return of the other four villains originally created by Ravelo himself. The first season consists of 70 episodes, as well as the second season, with 140 episodes all in all.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Drama", "Comedy"], "cast": ["Mark Anthony Fernandez", "Iwa Moto", "Dennis Trillo", "Wendell Ramos", "Christopher de Leon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18464   Expand Darna   (2009) User Score Overview Darna is a Philippine drama/fantasy series adapted from Mars Ravelo's fictional superheroine of the same name; directed by Dominic Zapata and Don Michael Perez and developed by Jun Lana. It is the third series based on the Darna graphic novels by Mars Ravelo. It stars Marian Rivera as the title role and her alter-ego Narda, with Iwa Moto as her main nemesis Valentina, also starring Dennis Trillo as Pancho and Mark Anthony Fernandez as Eduardo. The series had premiered on August 10, 2009 on GMA Network and ended on February 19, 2010, and also featured the return of the other four villains originally created by Ravelo himself. The first season consists of 70 episodes, as well as the second season, with 140 episodes all in all. Featured Crew Mars Ravelo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Anthony Fernandez Iwa Moto Dennis Trillo Wendell Ramos Christopher de Leon Full Cast & Crew Last Season Season 1 2009 | 1 Episode Season 1 of Darna premiered on August 10, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Darna. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 45m Homepage   http://www.igma.tv/shows/darna Genres Sci-Fi & Fantasy Action & Adventure Drama Comedy Keywords dual identity sex superheroine female protagonist Content Score 79 Pump it up! We're close now. Top Contributors W 16 Wakaku z 5 zurman1 3 Elizabeth Jennings p 1 pedrol1981  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}