{"link": "https://www.themoviedb.org/tv/39215?language=en", "title": "House of Harmony and Vengeance", "resume": "House of Harmony and Vengeance is a Hong Kong costume-comedy television drama produced by TVB under executive producer Nelson Cheung. The drama centers around a group of musicians and dancers from the Imperial Music Bureau during the prosperous Tang Dynasty of China.", "rate": 70, "genre": ["Drama", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39215   Expand House of Harmony and Vengeance   (2012) User Score  Play Trailer Overview House of Harmony and Vengeance is a Hong Kong costume-comedy television drama produced by TVB under executive producer Nelson Cheung. The drama centers around a group of musicians and dancers from the Imperial Music Bureau during the prosperous Tang Dynasty of China. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2012 | 30 Episodes Season 1 of House of Harmony and Vengeance premiered on April 30, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on House of Harmony and Vengeance. You can help by rating TV shows you've seen. Facts Original Name  耀舞長安 Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  Cantonese Runtime  45m Homepage  - Genres Drama Comedy Keywords hong kong Content Score 64 We're so close, yet so far. Top Contributors 11 Crip A 1 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}