{"link": "https://www.themoviedb.org/tv/63650?language=en", "title": "Born Again Virgin", "resume": "Jenna, a 34 year-old up-and-coming blogger, decides to become celibate when she finds her body count is starting to trump her age. Using her blog as encouragement for her newly adapted sex diet and also as a sounding board for her girlfriends' often amusing \"sexcapades,\" Jenna is determined to make the blog a success and transform her friends in the process.", "rate": 0, "genre": ["Comedy"], "cast": ["Danielle Nicolet", "Meagan Holder", "Eva Marcille", "Christopher Maleki"], "character": ["Jenna", "Kelly", "Tara", "Enrique"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63650   Expand Born Again Virgin   (2015) User Score Overview Jenna, a 34 year-old up-and-coming blogger, decides to become celibate when she finds her body count is starting to trump her age. Using her blog as encouragement for her newly adapted sex diet and also as a sounding board for her girlfriends' often amusing \"sexcapades,\" Jenna is determined to make the blog a success and transform her friends in the process. Featured Crew Ranada Shepard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danielle Nicolet Jenna Meagan Holder Kelly Eva Marcille Tara Christopher Maleki Enrique Full Cast & Crew Last Season Season 2 2015 | 12 Episodes Season 2 of Born Again Virgin premiered on December  8, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Born Again Virgin. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Born Again Virgin. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://tvone.tv/category/shows/born-again-virgin/ Genres Comedy Keywords celibacy blog relationship blogger vow of celibacy Content Score 93 Almost there... Top Contributors R 29 Rebecca s 4 smajasi 4 thwaller 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}