{"link": "https://www.themoviedb.org/tv/63181?language=en", "title": "Marvel's Guardians of the Galaxy", "resume": "Peter Quill is Star-Lord, the brash adventurer who, to save the universe from its greatest threats, joins forces with a quartet of disparate misfits — fan-favorite Rocket Raccoon, a tree-like humanoid named Groot, the enigmatic, expert fighter Gamora and the rough edged warrior Drax the Destroyer.", "rate": 69, "genre": ["Action", "Adventure", "Animation"], "cast": ["Will Friedle", "Trevor Devall", "Vanessa Marshall", "David Sobolov", "Kevin Michael Richardson"], "character": ["Peter Quill / Star-Lord (voice)", "Rocket Raccoon (voice)", "Gamora (voice)", "Drax the Destroyer (voice)", "Groot (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63181   Expand Marvel's Guardians of the Galaxy   (2015) User Score  Play Trailer Overview Peter Quill is Star-Lord, the brash adventurer who, to save the universe from its greatest threats, joins forces with a quartet of disparate misfits — fan-favorite Rocket Raccoon, a tree-like humanoid named Groot, the enigmatic, expert fighter Gamora and the rough edged warrior Drax the Destroyer. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will Friedle Peter Quill / Star-Lord (voice) Trevor Devall Rocket Raccoon (voice) Vanessa Marshall Gamora (voice) David Sobolov Drax the Destroyer (voice) Kevin Michael Richardson Groot (voice) Full Cast & Crew Current Season Season 3 2018 | 13 Episodes Season 3 of Marvel's Guardians of the Galaxy premiered on March 18, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply t Marvel Animated Open 0 by Halberstram\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   2012-04-01 Marvel's Ultimate Spider-Man 6.6    2011-11-11 Green Lantern: The Animated Series 7.2    2016-09-16 Hooten & The Lady 7.5    2004-08-13 Foster's Home for Imaginary Friends 6.8    2012-07-15 Black Dynamite 7.2    2013-11-09 Marvel's Avengers Assemble 6.5    2013-04-23 Teen Titans Go! 4.4    2008-11-14 Batman: The Brave and the Bold 7.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://disneynow.go.com/shows/marvels-guardians-of-the-galaxy Genres Action & Adventure Animation Keywords based on comic space Content Score 93 Almost there... Top Contributors 56 Elizabeth Jennings 8 Banana 5 Marco CM 5 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}