{"link": "https://www.themoviedb.org/tv/4207?language=en", "title": "The Shoe People", "resume": "The Shoe People was an animated television series which was first broadcast in the UK in April 1987 on TV-am. The Shoe People went on to be broadcast in 62 countries around the world.\nIt was the first series from the West to be shown in the former Soviet Union and became so popular there that they sold over 25 million Shoe People books.\nThe Shoe People was created by James Driscoll, who got the inspiration for the show from noticing that the style and appearance of peoples shoes told you about their owners personalities. He then wondered what stories these shoes could tell about themselves when they were new and when they had gradually worn out.\nThe theme song for The Shoe People was written and sung by Justin Hayward of The Moody Blues.\nA second series titled 'The New Adventures of The Shoe People' consisting of 26 episodes was commissioned using a number of new characters, however there is little known information as to how the episodes became in the public domain.", "rate": 80, "genre": ["Animation"], "cast": ["Philip Whitchurch"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4207   Expand The Shoe People User Score Overview The Shoe People was an animated television series which was first broadcast in the UK in April 1987 on TV-am. The Shoe People went on to be broadcast in 62 countries around the world. It was the first series from the West to be shown in the former Soviet Union and became so popular there that they sold over 25 million Shoe People books. The Shoe People was created by James Driscoll, who got the inspiration for the show from noticing that the style and appearance of peoples shoes told you about their owners personalities. He then wondered what stories these shoes could tell about themselves when they were new and when they had gradually worn out. The theme song for The Shoe People was written and sung by Justin Hayward of The Moody Blues. A second series titled 'The New Adventures of The Shoe People' consisting of 26 episodes was commissioned using a number of new characters, however there is little known information as to how the episodes became in the public domain. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philip Whitchurch Full Cast & Crew Last Season Season 1 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Facts Status  Ended Networks - Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  5m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors N 3 Notamymerrick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}