{"link": "https://www.themoviedb.org/tv/60640?language=en", "title": "The Stray Cat", "resume": "La Gata is an upcoming Mexican telenovela to be produced by Nathalie Lartilleux for Televisa. It is a remake of the Venezuelan telenovela La Gata, produced in 1968 and Mexican telenovela Rosa Salvaje produced in 1987.", "rate": 53, "genre": ["Drama"], "cast": ["Maite Perroni", "Daniel Arenas", "Laura Zapata", "Manuel Ojeda", "Jorge Poza"], "character": ["Esmeralda", "Pablo", "Lorenza", "El Silencioso", "Mariano Martínez Negrete"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60640   Expand The Stray Cat   (2014) User Score Overview La Gata is an upcoming Mexican telenovela to be produced by Nathalie Lartilleux for Televisa. It is a remake of the Venezuelan telenovela La Gata, produced in 1968 and Mexican telenovela Rosa Salvaje produced in 1987. Featured Crew Nathalie Lartilleux Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maite Perroni Esmeralda Daniel Arenas Pablo Laura Zapata Lorenza Manuel Ojeda El Silencioso Jorge Poza Mariano Martínez Negrete Full Cast & Crew Last Season Season 1 2014 | 5 Episodes Season 1 of The Stray Cat premiered on May  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Stray Cat. You can help by rating TV shows you've seen. Facts Original Name  La Gata Status  Ended Network Certification 10 Meaning Content suitable for viewers over the age of 10. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Drama Keywords telenovela Content Score 100 Yes! Looking good! Top Contributors s 17 shiff7 16 Alexandre Gomes V 11 Vaine B 5 Billys,Lo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}