{"link": "https://www.themoviedb.org/tv/9126?language=en", "title": "World War III", "resume": "When starving mobs begin rioting in the streets of Moscow, Soviet leaders believe they have no recourse but to seize the Alaskan pipeline to force the United States to end the grain embargo that has brought turmoil to the U.S.S.R.", "rate": 62, "genre": ["War", "Politics"], "cast": ["Cathy Lee Crosby", "Robert Prosky", "James Hampton", "Lee Wallace", "Harry Basch"], "character": ["Maj. Kate Breckenridge", "Gen. Aleksey Rudenski", "Richard Hickman", "Dr. Jules Farber", "Adm. Vernon Blanchard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9126   Expand World War III   (1982) User Score Overview When starving mobs begin rioting in the streets of Moscow, Soviet leaders believe they have no recourse but to seize the Alaskan pipeline to force the United States to end the grain embargo that has brought turmoil to the U.S.S.R. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cathy Lee Crosby Maj. Kate Breckenridge Robert Prosky Gen. Aleksey Rudenski James Hampton Richard Hickman Lee Wallace Dr. Jules Farber Harry Basch Adm. Vernon Blanchard Full Cast & Crew Last Season Season 1 1998 | 2 Episodes Season 1 of World War III premiered on December 22, 1998. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply n Remember When? Open 0 by northcoast\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on World War III. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres War & Politics Keywords miniseries nuclear warfare world war iii Content Score 86 Almost there... Top Contributors TB 30 TMDb Bot 20 Banana 13 Pieyre-Bernard Castelier  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}