{"link": "https://www.themoviedb.org/tv/15438?language=en", "title": "Wannabe", "resume": "Maxine never made it to the big time as part of girl group Variety, but is still desperately trying to cling on to her dream as the (failing) music manager for teenage pop group Sweet Gyal. However Maxine finds herself in crisis when, fed up of her trying to live vicariously through them and her embarrassing attempts to get them a record deal, Sweet Gyal threaten to drop her.\nBut Maxine has come up with a plan. A come back. This time bigger, bolder and, well... older. Who cares about a hip young girl group anyway?! What the world is really missing is Mum Pop.", "rate": 60, "genre": ["Comedy"], "cast": ["Jim Howick", "Imogen Gurney", "Karla Simone Spence", "Savannah Steyn", "Anthony Kaye"], "character": ["Mickey", "Kim", "Amanda", "Chantal", "J-Bounce"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15438   Expand Wannabe   (2018) User Score  Play Trailer Overview Maxine never made it to the big time as part of girl group Variety, but is still desperately trying to cling on to her dream as the (failing) music manager for teenage pop group Sweet Gyal. However Maxine finds herself in crisis when, fed up of her trying to live vicariously through them and her embarrassing attempts to get them a record deal, Sweet Gyal threaten to drop her. But Maxine has come up with a plan. A come back. This time bigger, bolder and, well... older. Who cares about a hip young girl group anyway?! What the world is really missing is Mum Pop. Featured Crew Claire McCarthy Creator Jack Whilding Newman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Howick Mickey Imogen Gurney Kim Karla Simone Spence Amanda Savannah Steyn Chantal Anthony Kaye J-Bounce Full Cast & Crew Current Season Season 1 2018 | 4 Episodes Season 1 of Wannabe premiered on March 29, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wannabe. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   https://www.bbc.co.uk/programmes/p060wc3v Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors E 21 Edytor 4 tigru89 r 4 ricostream  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}