{"link": "https://www.themoviedb.org/tv/13942?language=en", "title": "Life of Ryan", "resume": "Life of Ryan is an American Reality television series on MTV. The series debuted on August 27, 2007 with the second season premiering on January 8, 2008. The series follows the day-to-day life of professional skateboarder Ryan Sheckler as he mangages his personal life and his career. Most episodes take place at Sheckler's home in San Clemente, California. His friends, along with fellow professional skateboarders make various appearances in the series.", "rate": 10, "genre": ["Reality"], "cast": ["Ryan Sheckler"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13942   Expand Life of Ryan   (2007) User Score Overview Life of Ryan is an American Reality television series on MTV. The series debuted on August 27, 2007 with the second season premiering on January 8, 2008. The series follows the day-to-day life of professional skateboarder Ryan Sheckler as he mangages his personal life and his career. Most episodes take place at Sheckler's home in San Clemente, California. His friends, along with fellow professional skateboarders make various appearances in the series. Featured Crew Jason A. Carbone Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryan Sheckler Full Cast & Crew Last Season Season 3 2009 | 6 Episodes Season 3 of Life of Ryan premiered on April 18, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Life of Ryan. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  22m, 30m Homepage   http://www.ryansheckler.com/ Genres Reality Keywords california skateboarding skateboarder douchebag professional athlete Content Score 64 We're so close, yet so far. Top Contributors 11 Banana 5 Elizabeth Jennings m 1 mostafaskip  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}