{"link": "https://www.themoviedb.org/tv/61738?language=en", "title": "High School - Love On", "resume": "High school may be tough, but Woo Hyun (Nam Woo Hyun) has a guardian angel looking over him — literally. Disguised as a naive high schooler, Lee Seul Bi (Kim Sae Ron) descends from the heavens to protect Woo Hyun's life, but discovers she's got a thing or two to learn about life as a teenager, including the pains of falling in love. Can this cherubic guardian protect the apple of her eye and also manage to survive high school?", "rate": 55, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Kim Sae-ron", "Nam Woo-hyun", "Lee Sung-yeol", "Kim Min-seok", "Baek Seung-Heon"], "character": ["Lee Seul-bi", "Shin Woo-hyun", "Hwang Sung-yeol", "Park Byung-wook", "Tae-Ho"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61738   Expand High School - Love On   (2014) User Score Overview High school may be tough, but Woo Hyun (Nam Woo Hyun) has a guardian angel looking over him — literally. Disguised as a naive high schooler, Lee Seul Bi (Kim Sae Ron) descends from the heavens to protect Woo Hyun's life, but discovers she's got a thing or two to learn about life as a teenager, including the pains of falling in love. Can this cherubic guardian protect the apple of her eye and also manage to survive high school? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Sae-ron Lee Seul-bi Nam Woo-hyun Shin Woo-hyun Lee Sung-yeol Hwang Sung-yeol Kim Min-seok Park Byung-wook Baek Seung-Heon Tae-Ho Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of High School - Love On premiered on July 11, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on High School - Love On. You can help by rating TV shows you've seen. Facts Original Name  하이스쿨 - 러브온 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/hischool/ Genres Sci-Fi & Fantasy Keywords korea Content Score 86 Almost there... Top Contributors M 38 Maria180493 z 5 zurman1 d 5 daphie CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}