{"link": "https://www.themoviedb.org/tv/21500?language=en", "title": "Hot Wheels Battle Force 5", "resume": "Hot Wheels Battle Force 5 is an American/Canadian 3D CGI television series created by Mattel, Nelvana, and Nerd Corps Entertainment. A two-episode preview aired on the Cartoon Network in the United States on August 24, 2009. In Cartoon Network India it is starting from April 30, 2010 and in Cartoon Network Philippines on July 3, 2010. The series made its official debut on August 29. According to a HotWheels.com page as of July 14, 2010 describing \"BATTLE FORCE 5 Battle Action Assortment\" toys, Vehicles combine forces to create even more powerful combat machines. The second season began airing September 18, 2010.\nThe first trailer for the series was released on the official Hot Wheels Battle Force 5 website on June 25, 2009. The first two episodes aired on Monday, August 24.\nThis is the fourth production by Nerd Corps Entertainment, following Storm Hawks, League of Super Evil, and Dragon Booster.", "rate": 65, "genre": [], "cast": ["Gabe Khouth", "Mark Hildreth", "Michael Dobson", "Colin Murdock", "Kathleen Barr"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21500   Expand Hot Wheels Battle Force 5   (2009) User Score Overview Hot Wheels Battle Force 5 is an American/Canadian 3D CGI television series created by Mattel, Nelvana, and Nerd Corps Entertainment. A two-episode preview aired on the Cartoon Network in the United States on August 24, 2009. In Cartoon Network India it is starting from April 30, 2010 and in Cartoon Network Philippines on July 3, 2010. The series made its official debut on August 29. According to a HotWheels.com page as of July 14, 2010 describing \"BATTLE FORCE 5 Battle Action Assortment\" toys, Vehicles combine forces to create even more powerful combat machines. The second season began airing September 18, 2010. The first trailer for the series was released on the official Hot Wheels Battle Force 5 website on June 25, 2009. The first two episodes aired on Monday, August 24. This is the fourth production by Nerd Corps Entertainment, following Storm Hawks, League of Super Evil, and Dragon Booster. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabe Khouth Mark Hildreth Michael Dobson Colin Murdock Kathleen Barr Full Cast & Crew Last Season Season 2 2010 | 26 Episodes Season 2 of Hot Wheels Battle Force 5 premiered on September 18, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hot Wheels Battle Force 5. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.battleforce5.com/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}