{"link": "https://www.themoviedb.org/tv/6615?language=en", "title": "Sweden's Next Top Model", "resume": "Sweden's Next Top Model or Top Model Sverige was a Swedish reality television show based on America's Next Top Model. It was broadcast on TV3 in Sweden. In Top Model Sverige, the 9 contestants are competing for a top 3 spots to compete in Scandinavia's Next Top Model. These final 3 girls then join with Norway and Denmark's contestants. One winner came from Sweden over the 3 seasons of the show, Freja Kjellberg Borchies. For the first two cycles, Top Model Sverige was hosted by Mini Andén but she quit and Malin Persson replaced her. Persson left and was replaced by another Swedish model Vendela Kirsebom in Cycle 4 as a host when the show was aired for one Cycle on TV4 under the name Top Model Stockholm. After the first individual Cycle ended it took eight years until the show returned to TV3 in 2012 with Izabella Scorupco as host. However, she also lasted for one season only and was replaced by Caroline Winberg who hosted the show in 2013.", "rate": 0, "genre": ["Reality"], "cast": ["Mini Anden", "Malin Persson", "Vendela Kirsebom", "Hawa Ahmed", "Izabella Scorupco"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6615   Expand Sweden's Next Top Model User Score Overview Sweden's Next Top Model or Top Model Sverige was a Swedish reality television show based on America's Next Top Model. It was broadcast on TV3 in Sweden. In Top Model Sverige, the 9 contestants are competing for a top 3 spots to compete in Scandinavia's Next Top Model. These final 3 girls then join with Norway and Denmark's contestants. One winner came from Sweden over the 3 seasons of the show, Freja Kjellberg Borchies. For the first two cycles, Top Model Sverige was hosted by Mini Andén but she quit and Malin Persson replaced her. Persson left and was replaced by another Swedish model Vendela Kirsebom in Cycle 4 as a host when the show was aired for one Cycle on TV4 under the name Top Model Stockholm. After the first individual Cycle ended it took eight years until the show returned to TV3 in 2012 with Izabella Scorupco as host. However, she also lasted for one season only and was replaced by Caroline Winberg who hosted the show in 2013. Featured Crew Tyra Banks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mini Anden Malin Persson Vendela Kirsebom Hawa Ahmed Izabella Scorupco Full Cast & Crew Last Season Season 5 2012 | 10 Episodes Season 5 of Sweden's Next Top Model premiered on January 31, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.tv3.se/topmodel Genres Reality Keywords modeling Content Score 86 Almost there... Top Contributors 2 Banana h 1 hsnhsn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}