{"link": "https://www.themoviedb.org/tv/2473?language=en", "title": "The Avengers", "resume": "The Avengers is a British television series created in the 1960s. The Avengers initially focused on Dr. David Keel and his assistant John Steed. Hendry left after the first series and Steed became the main character, partnered with a succession of assistants. Steed's most famous assistants were intelligent, stylish and assertive women: Cathy Gale, Emma Peel, and later Tara King. Later episodes increasingly incorporated elements of science fiction and fantasy, parody and British eccentricity.", "rate": 78, "genre": ["Action", "Adventure", "Crime", "Sci-Fi", "Fantasy"], "cast": ["Patrick Macnee", "Diana Rigg", "Gareth Hunt", "Joanna Lumley", "Honor Blackman"], "character": ["John Steed", "Emma Peel", "Mike Gambit", "Purdey", "Cathy Gale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2473   Expand The Avengers   (1961) User Score  Play Trailer Overview The Avengers is a British television series created in the 1960s. The Avengers initially focused on Dr. David Keel and his assistant John Steed. Hendry left after the first series and Steed became the main character, partnered with a succession of assistants. Steed's most famous assistants were intelligent, stylish and assertive women: Cathy Gale, Emma Peel, and later Tara King. Later episodes increasingly incorporated elements of science fiction and fantasy, parody and British eccentricity. Featured Crew Sydney Newman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  10 Posters  5 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Macnee John Steed Diana Rigg Emma Peel Gareth Hunt Mike Gambit Joanna Lumley Purdey Honor Blackman Cathy Gale Full Cast & Crew Last Season Season 8 1977 | 13 Episodes Season 8 of The Avengers premiered on September  9, 1977. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply B Tara King was vulnerable Open 2 by  Benton12 Fantastic Show Open 14 by  lima-2 The writers lazily padded a lot of episodes Open 1 by  adamdurrance Go to Discussions Media Most Popular Videos  2 Backdrops  10 Posters  5 Recommendations   1976-10-22 The New Avengers 7.6    1970-09-16 McCloud 7.0    1964-09-22 The Man from U.N.C.L.E. 7.2    1961-01-05 Mister Ed 7.4    1962-10-11 McHale's Navy 6.1    1974-03-27 The Rockford Files 7.2    1971-08-01 The Sonny & Cher Comedy Hour 5.0    1964-09-24 Daniel Boone 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage  - Genres Action & Adventure Crime Sci-Fi & Fantasy Keywords great britain secret mission spy humor mi6 british spy english countryside mi5 Content Score 100 Yes! Looking good! Top Contributors a 24 al-b-other 22 Steve 19 Banana 13 Russ007  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}