{"link": "https://www.themoviedb.org/tv/67041?language=en", "title": "RG Veda", "resume": "At the dawn of time, the gods ruled the universe under the leadership of the mighty Tentei. But suddenly, the ferocious general, Taishakuten, appears, and destroys Tentei. Taishakuten declares that a new age has begun, and all who oppose him will die horribly. But legend says that a shimmering six-pointed star will rise into the heavens and restore the world to a golden age. The six points are six warriors, each with the power to move the stars and the hearts of all people...", "rate": 35, "genre": [], "cast": ["Arisa Andō", "Hideyuki Tanaka", "Kappei Yamaguchi", "Kazue Ikura", "Ken'yuu Horiuchi"], "character": ["Kendappa-ō (voice)", "Ashura-ō (voice)", "Ryū-ō (voice)", "Ashura (voice)", "Bishamon-ten (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67041   Expand RG Veda   (1991) User Score Overview At the dawn of time, the gods ruled the universe under the leadership of the mighty Tentei. But suddenly, the ferocious general, Taishakuten, appears, and destroys Tentei. Taishakuten declares that a new age has begun, and all who oppose him will die horribly. But legend says that a shimmering six-pointed star will rise into the heavens and restore the world to a golden age. The six points are six warriors, each with the power to move the stars and the hearts of all people... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arisa Andō Kendappa-ō (voice) Hideyuki Tanaka Ashura-ō (voice) Kappei Yamaguchi Ryū-ō (voice) Kazue Ikura Ashura (voice) Ken'yuu Horiuchi Bishamon-ten (voice) Full Cast & Crew Last Season RG Veda 1991 | 2 Episodes Season 1 of RG Veda premiered on June  1, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on RG Veda. You can help by rating TV shows you've seen. Facts Original Name  聖伝-RG VEDA Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors t 38 tmdb983464 z 4 zurman1 N 4 Nebil-k N 2 Nebil  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}