{"link": "https://www.themoviedb.org/tv/4439?language=en", "title": "The Honeymooners", "resume": "A bus driver and his sewer worker friend struggle to strike it rich while their wives look on with weary patience. One of the most influential situation comedy television series in American history.", "rate": 81, "genre": ["Comedy"], "cast": ["Joyce Randolph", "Art Carney", "Jackie Gleason", "Audrey Meadows"], "character": ["Trixie Norton", "Ed Norton", "Ralph Kramden", "Alice Kramden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4439   Expand The Honeymooners   (1955) User Score Overview A bus driver and his sewer worker friend struggle to strike it rich while their wives look on with weary patience. One of the most influential situation comedy television series in American history. Featured Crew Jackie Gleason Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joyce Randolph Trixie Norton Art Carney Ed Norton Jackie Gleason Ralph Kramden Audrey Meadows Alice Kramden Full Cast & Crew Last Season Season 11 1964 | 28 Episodes Season 11 of The Honeymooners premiered on January  4, 1964. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply \"Better Living Through TV\" episode Open 0 by Zürich Gnome\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1968-09-24 The Mod Squad 6.3    1965-01-24 Branded 8.3    1961-01-05 Mister Ed 7.4    1997-11-23 Liberty! 7.3    1967-09-07 The Flying Nun 5.0    1960-09-29 My Three Sons 6.0    1966-09-12 Family Affair 5.4    1963-09-29 My Favorite Martian 5.4  Facts Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords new york working class blue collar worker sitcom Content Score 93 Almost there... Top Contributors s 39 skavoovie 11 Banana 3 Elizabeth Jennings 2 mjcassel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}