{"link": "https://www.themoviedb.org/tv/42885?language=en", "title": "マイセルフ；ユアセルフ", "resume": "Hikada Sana returns to his home town after living away in Tokyo for five years. Although some time has passed the town has not changed much. On a detour to his apartment, he notices that a shrine maiden is watching him as he visits the shrine. The following day at school, Sana is surprised to find out that this girl is actually Yatsushiro Nanaka, a good childhood friend, whom he gave a bracelet before he left so many years ago. And even to this day, she is still wearing it...", "rate": 70, "genre": ["Animation", "Drama", "Comedy"], "cast": ["Shinnosuke Tachibana", "Megumi Toyoguchi", "Mai Nakahara", "Ayumi Murata", "Tomoko Kaneda"], "character": ["Hidaka Sana", "Fujimura Yuzuki", "Hoshino Asami", "Mochida Hinako", "Oribe Aoi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42885   Expand マイセルフ；ユアセルフ   (2007) User Score  Play Trailer Overview Hikada Sana returns to his home town after living away in Tokyo for five years. Although some time has passed the town has not changed much. On a detour to his apartment, he notices that a shrine maiden is watching him as he visits the shrine. The following day at school, Sana is surprised to find out that this girl is actually Yatsushiro Nanaka, a good childhood friend, whom he gave a bracelet before he left so many years ago. And even to this day, she is still wearing it... Featured Crew Regista Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shinnosuke Tachibana Hidaka Sana Megumi Toyoguchi Fujimura Yuzuki Mai Nakahara Hoshino Asami Ayumi Murata Mochida Hinako Tomoko Kaneda Oribe Aoi Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of マイセルフ；ユアセルフ premiered on October  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on マイセルフ；ユアセルフ. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.marv.jp/special/anime-myyour/ Genres Animation Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors C 21 Cr3ViL TB 9 TMDb Bot 5 seboseboss M 3 MGB89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}