{"link": "https://www.themoviedb.org/tv/59028?language=en", "title": "The Elegant Gentleman's Guide to Knife Fighting", "resume": "The Elegant Gentleman's Guide to Knife Fighting aspires to take sketch comedy in a different  direction. With longer-form scenes, less traditional material, and  surprising cast, it will be at times random, often ridiculous and  occasionally surreal.", "rate": 75, "genre": ["Comedy"], "cast": ["Patrick Brammall", "Phil Lloyd", "Robin McLeavy", "Craig Anderson", "Damon Herriman"], "character": ["Various Characters", "Various Characters", "Various Characters", "Various Characters", "Various Characters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59028   Expand The Elegant Gentleman's Guide to Knife Fighting   (2013) User Score Overview The Elegant Gentleman's Guide to Knife Fighting aspires to take sketch comedy in a different  direction. With longer-form scenes, less traditional material, and  surprising cast, it will be at times random, often ridiculous and  occasionally surreal. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Brammall Various Characters Phil Lloyd Various Characters Robin McLeavy Various Characters Craig Anderson Various Characters Damon Herriman Various Characters Full Cast & Crew Last Season Series 1 2013 | 6 Episodes Season 1 of The Elegant Gentleman's Guide to Knife Fighting premiered on April  3, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Elegant Gentleman's Guide to Knife Fighting. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  28m Homepage   http://www.abc.net.au/tv/programs/elegant-gentlemans-guide-to-knife-fighting/ Genres Comedy Keywords sketch comedy Content Score 86 Almost there... Top Contributors 31 United600 TB 4 TMDb Bot g 1 getrs  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}