{"link": "https://www.themoviedb.org/tv/70284?language=en", "title": "Mama June: From Not to Hot", "resume": "Mama June from Not to Hot is all about Mama June's dramatic transformation. \"I'm a mama, a grandmama, and a BIG reality star — and now I'm ready for a BIG change,\" Mama June narrates as we see her strike various poses. But she's not just talking about physical changes, she's revamping her entire life! \"It's time to say goodbye to bad men and junk food,\" Mama June says before adding that fans (and haters) can all \"[say] hello to a whole new me, because when they see what I look like now, they're not going to believe their eyes!\" At this point we see a string of text that I assume are all things that went into Mama June's dramatic makeover. Included in the list are weight loss surgery, physical therapy, liquid diet, tummy tuck, gastric sleeve, strength training, breast implants, high intensity training, and laser teeth whitening.", "rate": 55, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70284   Expand Mama June: From Not to Hot   (2017) User Score  Play Trailer Overview Mama June from Not to Hot is all about Mama June's dramatic transformation. \"I'm a mama, a grandmama, and a BIG reality star — and now I'm ready for a BIG change,\" Mama June narrates as we see her strike various poses. But she's not just talking about physical changes, she's revamping her entire life! \"It's time to say goodbye to bad men and junk food,\" Mama June says before adding that fans (and haters) can all \"[say] hello to a whole new me, because when they see what I look like now, they're not going to believe their eyes!\" At this point we see a string of text that I assume are all things that went into Mama June's dramatic makeover. Included in the list are weight loss surgery, physical therapy, liquid diet, tummy tuck, gastric sleeve, strength training, breast implants, high intensity training, and laser teeth whitening. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 3 2018 | 3 Episodes Season 3 of Mama June: From Not to Hot premiered on June 14, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply P The Wedding Open 2 by  Patty The finale Open 0 by autumnsquirrel\n      \n     P Has anyone watched this?  Opinions on Episodes 1-4 Open 4 by  Patty Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mama June: From Not to Hot. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.wetv.com/shows/mama-june-from-not-to-hot Genres Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 22 szab b 8 basher a 4 airrr H 3 Hilda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}