{"link": "https://www.themoviedb.org/tv/34789?language=en", "title": "Dragon Drive", "resume": "Oozora Reiji isn't a lazy boy, he's just terribly unmotivated; all the clubs and activities he's joined don't interest him for long. That is, of course, until his best friend Yukino takes him to a underground arcade where an unbelievable virtual reality game is played - Dragon Drive - in which players fight each other with virtual dragons. Reiji ends up throwing all he's got into training a dragon so rare that the Dragon Drive staff are baffled. But soon Reiji learns that Dragon Drive isn't all it seems, and he might be the only one who can save an entire world from evil.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Romi Park", "Chinami Nishimura", "Rica Matsumoto", "Akemi Okamura", "Emi Shinohara"], "character": ["Oozora Reiji", "Chibisuke", "Mukai", "Sally", "Agent L"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34789   Expand Dragon Drive   (2002) User Score Overview Oozora Reiji isn't a lazy boy, he's just terribly unmotivated; all the clubs and activities he's joined don't interest him for long. That is, of course, until his best friend Yukino takes him to a underground arcade where an unbelievable virtual reality game is played - Dragon Drive - in which players fight each other with virtual dragons. Reiji ends up throwing all he's got into training a dragon so rare that the Dragon Drive staff are baffled. But soon Reiji learns that Dragon Drive isn't all it seems, and he might be the only one who can save an entire world from evil. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Romi Park Oozora Reiji Chinami Nishimura Chibisuke Rica Matsumoto Mukai Akemi Okamura Sally Emi Shinohara Agent L Full Cast & Crew Last Season Season 2 — | 20 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dragon Drive. You can help by rating TV shows you've seen. Facts Original Name  ドラゴンドライブ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.madhouse.co.jp/works/2002-2001/works_tv_dragondrive.html Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 12 seboseboss 3 Elizabeth Jennings m 3 magoozin 2 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}