{"link": "https://www.themoviedb.org/tv/38300?language=en", "title": "Atom Man vs. Superman", "resume": "Atom Man vs. Superman, Columbia's 43rd serial and the second live-action Superman screen appearance, both featuring Kirk Alyn as Superman, finds Lex Luthor, secretly the Atom Man, blackmailing the city of Metropolis by threatening to destroy the entire community. Perry White, editor of the Daily Planet, assigns Lois Lane, Jimmy Olsen and Clark Kent to cover the story.", "rate": 45, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Kirk Alyn", "Noel Neill", "Lyle Talbot", "Tommy Bond"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38300   Expand Atom Man vs. Superman   (1950) User Score Overview Atom Man vs. Superman, Columbia's 43rd serial and the second live-action Superman screen appearance, both featuring Kirk Alyn as Superman, finds Lex Luthor, secretly the Atom Man, blackmailing the city of Metropolis by threatening to destroy the entire community. Perry White, editor of the Daily Planet, assigns Lois Lane, Jimmy Olsen and Clark Kent to cover the story. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kirk Alyn Noel Neill Lyle Talbot Tommy Bond Full Cast & Crew Last Season Season 1 1950 | 15 Episodes Season 1 of Atom Man vs. Superman premiered on July 20, 1950. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Atom Man vs. Superman. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  252m Homepage  - Genres Sci-Fi & Fantasy Keywords dc comics based on comic super power movie serial lex luthor Content Score 71 Just a little bit more... Top Contributors R 18 Rebecca p 1 pedrol1981  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}