{"link": "https://www.themoviedb.org/tv/31251?language=en", "title": "Victorious", "resume": "Aspiring singer Tori Vega navigates life while attending a performing arts high school called Hollywood Arts.", "rate": 71, "genre": ["Drama", "Comedy", "Family"], "cast": ["Victoria Justice", "Leon G. Thomas III", "Matt Bennett", "Ariana Grande", "Avan Jogia"], "character": ["Tori Vega", "Andre Harris", "Robbie Shapiro", "Cat Valentine", "Beck Oliver"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31251   Expand Victorious   (2010) User Score  Play Trailer Overview Aspiring singer Tori Vega navigates life while attending a performing arts high school called Hollywood Arts. Featured Crew Dan Schneider Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  20 Content Issues  0 Images Backdrops  9 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Victoria Justice Tori Vega Leon G. Thomas III Andre Harris Matt Bennett Robbie Shapiro Ariana Grande Cat Valentine Avan Jogia Beck Oliver Full Cast & Crew Last Season Season 4 2012 | 13 Episodes Season 4 of Victorious premiered on September 22, 2012. View All Seasons Social Reviews  0 Discussions  20 Subject Status Replies Last Reply w Trina: Happy Birthday Daniella Monet! :birthday: :relaxed: Open 0 by wonder2wonder\n      \n     w Tori: Happy Birthday Victoria Justice! Open 0 by wonder2wonder\n      \n     w Robbie: Happy Birthday Matt Bennett! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  6 Recommendations   2013-06-08 Sam & Cat 5.7    2008-09-26 The Suite Life on Deck 6.1    2007-09-08 iCarly 6.3    2004-01-11 Drake & Josh 7.1    2009-11-28 Big Time Rush 4.9    2007-01-12 Cory in the House 5.4    2011-09-30 Jessie 6.3    2010-04-04 Good Luck Charlie 5.8  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.nick.com/victorious/ Genres Drama Comedy Family Keywords aspiring singer teenager Content Score 100 Yes! Looking good! Top Contributors 7 Elizabeth Jennings DE 6 Dave Edwards 6 Banana 5 Trooper  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}