{"link": "https://www.themoviedb.org/tv/42593?language=en", "title": "The Duo", "resume": "The Duo is a 2011 South Korean historical drama series, starring Chun Jung-myung, Lee Sang-yoon, Han Ji-hye and Seo Hyun-jin. It aired on MBC from February 7 to May 24, 2011 on Mondays and Tuesdays at 21:55 for 32 episodes.\nIt examines how class determines fate during the Joseon era through two men who swap lives. Switched at birth, Chun-doong and Gwi-dong grow up living each other's lives. Nobleman's son Chun-doong endures great hardships in the lowest caste of society, and becomes a vigilante who steals from the rich. Beggar's son Gwi-dong grows up in a wealthy noble family, and becomes a police chief. Living on opposite sides of the law, their paths cross again when they both fall for the same woman; played by Chun, Lee and Han respectively.", "rate": 0, "genre": ["Comedy", "Drama", "History", "Romance"], "cast": ["Chun Jung-myung", "Noh Young-hak", "Lee Sang-yoon", "Choi Woo-shik", "Han Ji-hye"], "character": ["Chun-doong", "Chun-doong (young)", "Gwi-dong", "Gwi-dong (young)", "Dong-nyeo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42593   Expand The Duo   (2011) User Score Overview The Duo is a 2011 South Korean historical drama series, starring Chun Jung-myung, Lee Sang-yoon, Han Ji-hye and Seo Hyun-jin. It aired on MBC from February 7 to May 24, 2011 on Mondays and Tuesdays at 21:55 for 32 episodes. It examines how class determines fate during the Joseon era through two men who swap lives. Switched at birth, Chun-doong and Gwi-dong grow up living each other's lives. Nobleman's son Chun-doong endures great hardships in the lowest caste of society, and becomes a vigilante who steals from the rich. Beggar's son Gwi-dong grows up in a wealthy noble family, and becomes a police chief. Living on opposite sides of the law, their paths cross again when they both fall for the same woman; played by Chun, Lee and Han respectively. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chun Jung-myung Chun-doong Noh Young-hak Chun-doong (young) Lee Sang-yoon Gwi-dong Choi Woo-shik Gwi-dong (young) Han Ji-hye Dong-nyeo Full Cast & Crew Last Season Season 1 2011 | 32 Episodes Season 1 of The Duo premiered on February  7, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Duo. You can help by rating TV shows you've seen. Facts Original Name  짝패 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://imbc.com/broad/tv/drama/mate/ Genres Comedy Drama History Romance Keywords korea Content Score 86 Almost there... Top Contributors M 25 Maria180493 t 4 tmdb38202327 p 2 p.dio t 1 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}