{"link": "https://www.themoviedb.org/tv/34218?language=en", "title": "The Dream Merchants", "resume": "Fictionalized behind-the-scenes machinations of early Hollywood movie-making.", "rate": 0, "genre": [], "cast": ["Red Buttons", "Chris Robinson", "Carolyn Jones", "Vincent Gardenia", "Howard Duff"], "character": ["Bruce Benson", "Vera", "Peter Kessler", "Charles Slade"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34218   Expand The Dream Merchants   (1980) User Score Overview Fictionalized behind-the-scenes machinations of early Hollywood movie-making. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Red Buttons Bruce Benson Chris Robinson Carolyn Jones Vera Vincent Gardenia Peter Kessler Howard Duff Charles Slade Full Cast & Crew Last Season Season 1 1980 | 3 Episodes Season 1 of The Dream Merchants premiered on May 12, 1980. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Dream Merchants. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Dream Merchants. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  360m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors TB 23 TMDb Bot 6 lineker m 2 movienator S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}