{"link": "https://www.themoviedb.org/tv/32412?language=en", "title": "Minute to Win It", "resume": "Minute to Win It is an American primetime game show on GSN, hosted by Apolo Ohno, that formerly ran on NBC with host Guy Fieri. Contestants take part in a series of 60-second challenges that use objects that are commonly available around the house.\nThe show premiered on NBC on March 14, 2010, airing the first two episodes back-to-back at 7:00 pm Eastern and Pacific. On October 6, 2010, Minute to Win It was awarded the C21/Frapa Award for Best studio based game show format at the MIPCOM Television Festival in France. A card game, board game, and video game versions for the Wii, Kinect and Nintendo DS have been made for this show. The U.S. season two finale aired on September 7, 2011. On May 13, 2012, NBC announced that the English version of the show would not be renewed for a third season.\nMinute to Win It currently airs new episodes on GSN Tuesday nights at 8/7c with reruns of the NBC version at various time on the network. The first season of GSN shows began in June 2013 with a 40-episode run.\nA Spanish language nightly version of the game show, titled Minuto para Ganar, debuted on MundoFox on the network's formal launch date of August 13, 2012, hosted by Marco Antonio Regil.", "rate": 60, "genre": [], "cast": ["Guy Fieri", "Caroline Flack", "Joe Swash"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32412   Expand Minute to Win It   (2010) User Score Overview Minute to Win It is an American primetime game show on GSN, hosted by Apolo Ohno, that formerly ran on NBC with host Guy Fieri. Contestants take part in a series of 60-second challenges that use objects that are commonly available around the house. The show premiered on NBC on March 14, 2010, airing the first two episodes back-to-back at 7:00 pm Eastern and Pacific. On October 6, 2010, Minute to Win It was awarded the C21/Frapa Award for Best studio based game show format at the MIPCOM Television Festival in France. A card game, board game, and video game versions for the Wii, Kinect and Nintendo DS have been made for this show. The U.S. season two finale aired on September 7, 2011. On May 13, 2012, NBC announced that the English version of the show would not be renewed for a third season. Minute to Win It currently airs new episodes on GSN Tuesday nights at 8/7c with reruns of the NBC version at various time on the network. The first season of GSN shows began in June 2013 with a 40-episode run. A Spanish language nightly version of the game show, titled Minuto para Ganar, debuted on MundoFox on the network's formal launch date of August 13, 2012, hosted by Marco Antonio Regil. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guy Fieri Caroline Flack Joe Swash Full Cast & Crew Last Season Season 2 2010 | 41 Episodes Season 2 of Minute to Win It premiered on December  7, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Minute to Win It. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/minute-to-win-it/ (US) Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 3 wufatmio 1 Elizabeth Jennings 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}