{"link": "https://www.themoviedb.org/tv/52969?language=en", "title": "Two Worlds", "resume": "Tawee Pope is famous. It is many people’s favorite lakorn. Every ‘older’ avid lakorn watcher knows of it. A present-day modernist nang’ek time-travels via a mirror to the past to meet old-fashy pra’ek. I myself have watched a bit of the 1994 original but do not recall anything of it aside from what I summarized in the sentence before. Therefore, I am unable to review Tawee Pope in comparison to its predecessor. When news came out of its remake, I was thrilled at the general storyline of “two worlds” bringing together two soul mates [more because of Om!], then disappointed that Pancake was the nang’ek, and as I watched it, I clearly became disappointed. Fans bashed the remake calling it an epic failure. I agree. Godninja boldy rates Tawee Pope with 2 stars.\nSince Tawee Pope lacked in the goodness department, I must mention my top five scenes: 1. [Scenes in this case] Whenever Khun Luang managed to crack smile or roll his eyes. If not for you, I would have been long gone. 2. Khun Luang (or was it Manee?) meekly confessed he likes her and they held hands. Such a little thing, but it was so cute. At this point, I was just begging for any hint of romance! 3. Khun Laung hugged Manee back when the mirror called her to return. After the first time, he was a selfish bastard. 4. Om Akapan took off this shirt for me! This was when Khun Luang had a brawl showdown with Arnus [don't recall this character name] as a diversion to get the letter. 5. The morning after ending of course! Pixs on top. So freaking jealous!\nI think that is all the nice stuff I can say about Tawee Pope, so there comes the hating. Number one thing that this lakorn killed was…it’s whole purpose. And if you don’t have a purpose, then you automatically fail. Simple as that. There was no significance to the time-traveling. There was no focus on the historical events which I thought was the point of Tawee Pope. The idea of Manee as a weapon of trickery to coax intelligence from the foreigners had so many possibility of epic plotline. Even though she manged to extract the ‘valuable’ info, they never showed how it was significant. Perhaps how it was used to counteract the imperialism or anything, really!\nFew more notable things to diss: Though according to character, Pancake over-acted, and even my Om bored me. You can’t be handsome forever, baby; I need some facial expressions. I wanted to rip off my laptop screen at the immense stupidity of Manee and the mirror. Mirror mirror on the wall, why can you let Manee bring in electric shavers but not a book. You want her to changed history, but you also limit her. This is the paradigm of time-traveling. And Manee, if you couldn’t bring the one important book, why the heck didn’t you just read it and remember it. I thought you were smart? Oh, I can’t forget the lack of romance. You made me angry too many times.\nEnough, I will only complain on one more point-the ending. Apparently in the original, the mom and the friends were able to come to the past. Okay, in this one, the mom appeared in the past, but she did nothing. Where’s the logic in that? What I would have loved was a little family tree or something at the end to know how their life went. How many kids they had, going to grandkids and so on the to present…then [I'm really am wishing too hard] goes to a single great great (whatever how many great) granddaughter. And then flash, we see Kul, Tron, and Raiwat meeting a descendent of Manee and Khun Luang. And because I felt so bad for Raiwat at the ending, he should get their descendent. Now this would have made up for all of the disappointments.", "rate": 65, "genre": ["Soap", "Drama"], "cast": ["Khemanit Jamikorn", "Akkaphan Namart", "Karnklao Duaysienklao", "Arnus Rapanich", "Thephasadin Na Ayutthaya"], "character": ["Maneejan/Manee", "Khunluang Akarathep Warakorn", "Kul", "Tron"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52969   Expand Two Worlds   (2011) User Score  Play Trailer Overview Tawee Pope is famous. It is many people’s favorite lakorn. Every ‘older’ avid lakorn watcher knows of it. A present-day modernist nang’ek time-travels via a mirror to the past to meet old-fashy pra’ek. I myself have watched a bit of the 1994 original but do not recall anything of it aside from what I summarized in the sentence before. Therefore, I am unable to review Tawee Pope in comparison to its predecessor. When news came out of its remake, I was thrilled at the general storyline of “two worlds” bringing together two soul mates [more because of Om!], then disappointed that Pancake was the nang’ek, and as I watched it, I clearly became disappointed. Fans bashed the remake calling it an epic failure. I agree. Godninja boldy rates Tawee Pope with 2 stars. Since Tawee Pope lacked in the goodness department, I must mention my top five scenes: 1. [Scenes in this case] Whenever Khun Luang managed to crack smile or roll his eyes. If not for you, I would have been long gone. 2. Khun Luang (or was it Manee?) meekly confessed he likes her and they held hands. Such a little thing, but it was so cute. At this point, I was just begging for any hint of romance! 3. Khun Laung hugged Manee back when the mirror called her to return. After the first time, he was a selfish bastard. 4. Om Akapan took off this shirt for me! This was when Khun Luang had a brawl showdown with Arnus [don't recall this character name] as a diversion to get the letter. 5. The morning after ending of course! Pixs on top. So freaking jealous! I think that is all the nice stuff I can say about Tawee Pope, so there comes the hating. Number one thing that this lakorn killed was…it’s whole purpose. And if you don’t have a purpose, then you automatically fail. Simple as that. There was no significance to the time-traveling. There was no focus on the historical events which I thought was the point of Tawee Pope. The idea of Manee as a weapon of trickery to coax intelligence from the foreigners had so many possibility of epic plotline. Even though she manged to extract the ‘valuable’ info, they never showed how it was significant. Perhaps how it was used to counteract the imperialism or anything, really! Few more notable things to diss: Though according to character, Pancake over-acted, and even my Om bored me. You can’t be handsome forever, baby; I need some facial expressions. I wanted to rip off my laptop screen at the immense stupidity of Manee and the mirror. Mirror mirror on the wall, why can you let Manee bring in electric shavers but not a book. You want her to changed history, but you also limit her. This is the paradigm of time-traveling. And Manee, if you couldn’t bring the one important book, why the heck didn’t you just read it and remember it. I thought you were smart? Oh, I can’t forget the lack of romance. You made me angry too many times. Enough, I will only complain on one more point-the ending. Apparently in the original, the mom and the friends were able to come to the past. Okay, in this one, the mom appeared in the past, but she did nothing. Where’s the logic in that? What I would have loved was a little family tree or something at the end to know how their life went. How many kids they had, going to grandkids and so on the to present…then [I'm really am wishing too hard] goes to a single great great (whatever how many great) granddaughter. And then flash, we see Kul, Tron, and Raiwat meeting a descendent of Manee and Khun Luang. And because I felt so bad for Raiwat at the ending, he should get their descendent. Now this would have made up for all of the disappointments.  Featured Crew DaraVDO Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Khemanit Jamikorn Maneejan/Manee Akkaphan Namart Khunluang Akarathep Warakorn Karnklao Duaysienklao Kul Arnus Rapanich Thephasadin Na Ayutthaya Tron Full Cast & Crew Last Season Season 1 2011 | 17 Episodes Season 1 of Two Worlds premiered on August  1, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Two Worlds. You can help by rating TV shows you've seen. Facts Original Name  Tawee Pope Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 40 Crip z 8 zurman1 5 mariilakorn21 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}