{"link": "https://www.themoviedb.org/tv/12134?language=en", "title": "Faith in the Future", "resume": "Faith in the Future is a British comedy television show running from 17 November 1995 to 27 February 1998. A sequel to the show Second Thoughts, it aired on ITV for 22 episodes.\nThe show continues the story of Faith Greyshott, newly single after splitting from her long-term partner, Bill, at the end of Second Thoughts. With her daughter Hannah away travelling and her son Joe now in a shared flat, Faith decides it's time to stop being a wife and mother and live her life for herself; however, her plans are scuppered when Hannah returns and expects to move back home.", "rate": 60, "genre": ["Comedy"], "cast": ["Julia Sawalha", "Simon Pegg", "Lynda Bellingham", "Jeff Rawle", "Charlie Creed-Miles"], "character": ["Hannah Grayshot", "Jools"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12134   Expand Faith in the Future   (1995) User Score Overview Faith in the Future is a British comedy television show running from 17 November 1995 to 27 February 1998. A sequel to the show Second Thoughts, it aired on ITV for 22 episodes. The show continues the story of Faith Greyshott, newly single after splitting from her long-term partner, Bill, at the end of Second Thoughts. With her daughter Hannah away travelling and her son Joe now in a shared flat, Faith decides it's time to stop being a wife and mother and live her life for herself; however, her plans are scuppered when Hannah returns and expects to move back home. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julia Sawalha Hannah Grayshot Simon Pegg Jools Lynda Bellingham Jeff Rawle Charlie Creed-Miles Full Cast & Crew Last Season Season 3 1998 | 7 Episodes Season 3 of Faith in the Future premiered on January  9, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Faith in the Future. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords spin off teenage daughter sitcom mum british humour Content Score 71 Just a little bit more... Top Contributors O 14 Ozbourne TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}