{"link": "https://www.themoviedb.org/tv/33655?language=en", "title": "Campus PD", "resume": "Campus PD is an American television show on G4. Campus PD is produced by Cineflix Productions. The show is similar in style and tone to the show COPS.\nUnlike COPS, Campus PD focuses specifically on college and university campuses and towns and the authorities who patrol them. Filming takes place at various locations across the country. The first season consisted of 10 episodes. Campus PD is produced by the UK-based production company Cineflix Productions, the group that produces American Pickers as well as Canadian Pickers. The theme song for the show is The Clash song Police on My Back. Season 2 Premiered Wednesday, September 1 at 8PM ET. New episodes aired Wednesday nights at 8PM ET/PT on G4. It is unknown if further seasons of this show will be produced as G4 was slated be renamed as the Esquire Network on September 23, 2013. Though it is assumed that production of the show has been canceled as there are no further announcements of a new season.\nAs of 2012, the episodes of the first 2 seasons are edited where the main theme song \"Police On My Back\" by The Clash in the intros have been replaced by production music for unknown reasons.", "rate": 0, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33655   Expand Campus PD   (2009) User Score Overview Campus PD is an American television show on G4. Campus PD is produced by Cineflix Productions. The show is similar in style and tone to the show COPS. Unlike COPS, Campus PD focuses specifically on college and university campuses and towns and the authorities who patrol them. Filming takes place at various locations across the country. The first season consisted of 10 episodes. Campus PD is produced by the UK-based production company Cineflix Productions, the group that produces American Pickers as well as Canadian Pickers. The theme song for the show is The Clash song Police on My Back. Season 2 Premiered Wednesday, September 1 at 8PM ET. New episodes aired Wednesday nights at 8PM ET/PT on G4. It is unknown if further seasons of this show will be produced as G4 was slated be renamed as the Esquire Network on September 23, 2013. Though it is assumed that production of the show has been canceled as there are no further announcements of a new season. As of 2012, the episodes of the first 2 seasons are edited where the main theme song \"Police On My Back\" by The Clash in the intros have been replaced by production music for unknown reasons. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2012 | 10 Episodes Season 4 of Campus PD premiered on January  3, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Campus PD. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.g4tv.com/CampusPD Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}