{"link": "https://www.themoviedb.org/tv/1678?language=en", "title": "The Golden Girls", "resume": "The Golden Girls is an American sitcom, created by Susan Harris, that originally aired on NBC from September 14, 1985, to May 9, 1992. Starring Bea Arthur, Betty White, Rue McClanahan and Estelle Getty, the show centers on four older women sharing a home in Miami, Florida.", "rate": 74, "genre": ["Comedy"], "cast": ["Bea Arthur", "Herb Edelman", "Bea Arthur", "Betty White", "Rue McClanahan"], "character": ["Dorothy Zbornak", "Stanley Zbornak", "Dorothy Petrillo Zbornak", "Rose Nylund", "Blanche Devereaux"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1678   Expand The Golden Girls   (1985) User Score  Play Trailer Overview The Golden Girls is an American sitcom, created by Susan Harris, that originally aired on NBC from September 14, 1985, to May 9, 1992. Starring Bea Arthur, Betty White, Rue McClanahan and Estelle Getty, the show centers on four older women sharing a home in Miami, Florida. Featured Crew Susan Harris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  7 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Bea Arthur Dorothy Zbornak Herb Edelman Stanley Zbornak Bea Arthur Dorothy Petrillo Zbornak Betty White Rose Nylund Rue McClanahan Blanche Devereaux Full Cast & Crew Last Season Season 7 1991 | 26 Episodes View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply PE \"Thank You For Being a Friend\" Extended version. Open 0 by Patrick E. Abe\n      \n     S Phil's funeral Open 3 by  Milo_Jeeder w Favorite Character? Open 3 by  Strannger18 Go to Discussions Media Most Popular Videos  3 Backdrops  4 Posters  3 Recommendations   1988-10-18 Roseanne 6.7    1984-09-20 The Cosby Show 6.8    1964-09-17 Bewitched 7.1    1991-09-17 Home Improvement 7.0    1989-09-22 Family Matters 6.2    1990-10-29 Keeping Up Appearances 7.4    1998-09-21 Will & Grace 6.5    1988-11-14 Murphy Brown 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords miami female friendship elderly sitcom Content Score 100 Yes! Looking good! Top Contributors w 11 wheelpoint 10 Banana m 8 mccalimero62 R 7 Rebafan23  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}