{"link": "https://www.themoviedb.org/tv/16998?language=en", "title": "Super League Show", "resume": "The Super League Show is the BBC's rugby league highlights programme, shown on BBC One in the North of England, repeated nationally on BBC Two a few hours later, and also on the BBC website and BBC iPlayer. The programme, produced by PDI Media at BBC Yorkshire's studio in Leeds, is presented by Tanya Arnold with match commentary from Dave Woods & Andy Giddings and analysis from a variety of studio guests from Super League.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16998   Expand Super League Show User Score Overview The Super League Show is the BBC's rugby league highlights programme, shown on BBC One in the North of England, repeated nationally on BBC Two a few hours later, and also on the BBC website and BBC iPlayer. The programme, produced by PDI Media at BBC Yorkshire's studio in Leeds, is presented by Tanya Arnold with match commentary from Dave Woods & Andy Giddings and analysis from a variety of studio guests from Super League. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season 2017 Season 2017 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Facts Status  Returning Series Networks Certification  - Type  Talk Show Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b0071mmc Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 17 Elizabeth Jennings m 16 morley82  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}