{"link": "https://www.themoviedb.org/tv/57778?language=en", "title": "Red Data Girl", "resume": "Izumiko Suzuhara (15)  was born and raised at Tamakura Shrine, and always destroys any electrical device she touches. She decides to try living in the city, and enrolls in Houjou High School in Tokyo. With her are her guardians son and Izumiko's childhood friend Miyuki Sagara. While she's there, an  entity called \"Himegami\" appears. She learns she is something called a  \"kami\" a vessel for a shinto spirit, while Miyuki is a \"yamabushi\", a  warrior meant to protect the \"kami.\"", "rate": 50, "genre": ["Drama", "Drama", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57778   Expand Red Data Girl   (2013) User Score Overview Izumiko Suzuhara (15)  was born and raised at Tamakura Shrine, and always destroys any electrical device she touches. She decides to try living in the city, and enrolls in Houjou High School in Tokyo. With her are her guardians son and Izumiko's childhood friend Miyuki Sagara. While she's there, an  entity called \"Himegami\" appears. She learns she is something called a  \"kami\" a vessel for a shinto spirit, while Miyuki is a \"yamabushi\", a  warrior meant to protect the \"kami.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Red Data Girl premiered on April  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Red Data Girl. You can help by rating TV shows you've seen. Facts Original Name  RDG レッドデータガール Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://rdg-anime.jp/ Genres Drama Drama Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 9 Dreamtaker 4 TheDerpMan 3 yoshizuka 3 eduardonek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}