{"link": "https://www.themoviedb.org/tv/954?language=en", "title": "The Rockford Files", "resume": "The Rockford Files is an American television drama series starring James Garner that aired on the NBC network between September 13, 1974 and January 10, 1980, and has remained in syndication to the present day. Garner portrays Los Angeles-based private investigator Jim Rockford with Noah Beery, Jr. in the supporting role of his father, a retired truck driver nicknamed \"Rocky.\"\nThe show was created by Roy Huggins and Stephen J. Cannell. Huggins created the television show Maverick, which starred Garner, and he wanted to recapture that magic in a \"modern day\" detective setting. He teamed with Cannell, who had written for Jack Webb productions such as Adam-12 and Chase, to create The Rockford Files.\nThe show was credited as \"A Public Arts/Roy Huggins Production\" along with Universal Studios and in association with Cherokee Productions. Cherokee was owned by Garner, with partners Meta Rosenberg and Juanita Bartlett, who doubled as story editor during most of The Rockford Files' run.\nThe series theme by composers Mike Post and Pete Carpenter was released as a single and went to #10 on the Billboard Hot 100, remaining on the chart for 16 weeks. and won a Grammy Award for Best Instrumental Arrangement for 1975.", "rate": 78, "genre": ["Crime", "Action", "Adventure"], "cast": ["James Garner", "Noah Beery, Jr.", "Joe Santos"], "character": ["Jim Rockford", "Joseph 'Rocky' Rockford", "Sgt. Dennis Becker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 954   Expand The Rockford Files   (1974) User Score  Play Trailer Overview The Rockford Files is an American television drama series starring James Garner that aired on the NBC network between September 13, 1974 and January 10, 1980, and has remained in syndication to the present day. Garner portrays Los Angeles-based private investigator Jim Rockford with Noah Beery, Jr. in the supporting role of his father, a retired truck driver nicknamed \"Rocky.\" The show was created by Roy Huggins and Stephen J. Cannell. Huggins created the television show Maverick, which starred Garner, and he wanted to recapture that magic in a \"modern day\" detective setting. He teamed with Cannell, who had written for Jack Webb productions such as Adam-12 and Chase, to create The Rockford Files. The show was credited as \"A Public Arts/Roy Huggins Production\" along with Universal Studios and in association with Cherokee Productions. Cherokee was owned by Garner, with partners Meta Rosenberg and Juanita Bartlett, who doubled as story editor during most of The Rockford Files' run. The series theme by composers Mike Post and Pete Carpenter was released as a single and went to #10 on the Billboard Hot 100, remaining on the chart for 16 weeks. and won a Grammy Award for Best Instrumental Arrangement for 1975. Featured Crew Stephen J. Cannell Creator Roy Huggins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  7 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast James Garner Jim Rockford Noah Beery, Jr. Joseph 'Rocky' Rockford Joe Santos Sgt. Dennis Becker Full Cast & Crew Last Season Season 7 1996 | 8 Episodes Season 7 of The Rockford Files premiered on February  2, 1996. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply blast from the past Open 1 by  Patrick E. Abe K Jim and Dennis Open 0 by Knixon\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  7 Posters  9 Recommendations   1976-10-03 Quincy, M.E. 7.0    1970-09-16 McCloud 7.0    1964-09-22 The Man from U.N.C.L.E. 7.2    1970-09-24 The Odd Couple 7.1    1971-01-05 Alias Smith and Jones 6.2    1957-09-18 Wagon Train 6.3    1963-09-17 The Fugitive 7.9    1981-11-24 Simon & Simon 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Action & Adventure Keywords private investigator los angeles private detective ex-con Content Score 71 Just a little bit more... Top Contributors 57 Steve S 23 Samara 19 Banana C 16 CaptainBarnius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}