{"link": "https://www.themoviedb.org/tv/69577?language=en", "title": "Be With You", "resume": "This is about the gratitude and grudges of the rich and powerful, their love-hate entanglement. This is a love game, with lingering desire and pain. They first met while they were young, their feelings were filled with undercurrents. When they meet again, everything is no longer pure. He is a businessman, so is accustomed to using strategy to get everything he wants. Facing her who had returned with hatred, will everything be destined to reverse and start all over again? One step is wrong, every step is wrong. Looking back, perhaps there is still love. But this love is related to hate and this affair is related to self-interest. Perhaps they themselves are also unclear how much is actually sincere. Who has the courage to admit: In fact, happiness is not far away from them. ~~ Adapted from the novel \"Every Step Is Wrong\" by author Lan Bai Se.", "rate": 70, "genre": [], "cast": ["Wilber Pan", "Zhang Johnny", "Lulu Xu", "Denny Huang", "Mao Xiao Tong"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69577   Expand Be With You   (2017) User Score Overview This is about the gratitude and grudges of the rich and powerful, their love-hate entanglement. This is a love game, with lingering desire and pain. They first met while they were young, their feelings were filled with undercurrents. When they meet again, everything is no longer pure. He is a businessman, so is accustomed to using strategy to get everything he wants. Facing her who had returned with hatred, will everything be destined to reverse and start all over again? One step is wrong, every step is wrong. Looking back, perhaps there is still love. But this love is related to hate and this affair is related to self-interest. Perhaps they themselves are also unclear how much is actually sincere. Who has the courage to admit: In fact, happiness is not far away from them. ~~ Adapted from the novel \"Every Step Is Wrong\" by author Lan Bai Se. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wilber Pan Zhang Johnny Lulu Xu Denny Huang Mao Xiao Tong Full Cast & Crew Last Season Season 1 2017 | 22 Episodes Season 1 of Be With You premiered on January  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Be With You. You can help by rating TV shows you've seen. Facts Original Name  不得不爱 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 11 MundoAsian A 6 Aka75 1 xukemin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}