{"link": "https://www.themoviedb.org/tv/50634?language=en", "title": "Tears of Pearl", "resume": "A struggling performer, working as a stunt woman finds her taking up another person’s identity and being married off to a playboy hotel heir.\nKaimook's mother needs money so she went to borrow money from this lady's who has a daughter. The daughter was supposed to marry Keerin but she already had a boyfriend and did not want to marry him. After that the Lady wants Kaimook to work at the house as a servant. one day Kaimook was working at the house, both the mother and daughter were out, Kaimook tried on a dress and Keerin was there to see his wife-to-be. He mistook Kaimook for his fiance and he liked her. After that, he is ok with marrying and the Lady asks Kaimook to marry Keerin in her daughter's place. Kaimook did, married life was hard because Keerin's mother really hate her. She is trying her best but Keerin is starting to fall in love with Kaimook.\nKaimook's real mother is Joojin, a Korean famous actress, and her father is a Thai musician.\nWhat will happen, can Kaimook win over Keerin's mum, and what will she do when her parents are not her real parents?", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Veraparb Suparbpaiboon", "Sinitha Boonyasak", "Atsadaporn Siriwattanakul", "Arisa Will", "Apiradee Pawaputanon"], "character": ["Keerin", "Joojin", "Kaimook"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50634   Expand Tears of Pearl   (2013) User Score Overview A struggling performer, working as a stunt woman finds her taking up another person’s identity and being married off to a playboy hotel heir. Kaimook's mother needs money so she went to borrow money from this lady's who has a daughter. The daughter was supposed to marry Keerin but she already had a boyfriend and did not want to marry him. After that the Lady wants Kaimook to work at the house as a servant. one day Kaimook was working at the house, both the mother and daughter were out, Kaimook tried on a dress and Keerin was there to see his wife-to-be. He mistook Kaimook for his fiance and he liked her. After that, he is ok with marrying and the Lady asks Kaimook to marry Keerin in her daughter's place. Kaimook did, married life was hard because Keerin's mother really hate her. She is trying her best but Keerin is starting to fall in love with Kaimook. Kaimook's real mother is Joojin, a Korean famous actress, and her father is a Thai musician. What will happen, can Kaimook win over Keerin's mum, and what will she do when her parents are not her real parents?  Featured Crew Kantana Group Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Veraparb Suparbpaiboon Keerin Sinitha Boonyasak Joojin Atsadaporn Siriwattanakul Kaimook Arisa Will Apiradee Pawaputanon Full Cast & Crew Last Season Season 1 2013 | 23 Episodes Season 1 of Tears of Pearl premiered on March 29, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tears of Pearl. You can help by rating TV shows you've seen. Facts Original Name  Maya See Muk Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  85m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 93 Almost there... Top Contributors 35 Crip z 10 zurman1 4 mariilakorn21 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}