{"link": "https://www.themoviedb.org/tv/915?language=en", "title": "The Secret Adventures of Jules Verne", "resume": "The Secret Adventures of Jules Verne is a 22-episode science fiction television series in the steampunk genre that first aired in June 2000 on CBC Television in Canada and in syndication in the United States.\nThe plot concept is predicated on a vast fictional conspiracy beginning with the revelation that Jules Verne did not merely write the stories behind his famous science fiction classic books Twenty Thousand Leagues Under the Sea, Journey to the Center of the Earth or Around the World in Eighty Days — but actually experienced these adventures personally.\nA television technological historic footnote, this work was the first hour-long series filmed entirely in HDTV format.", "rate": 70, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Chris Demetral", "Michael Praed", "Michel Courtemanche"], "character": ["Jules Verne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 915   Expand The Secret Adventures of Jules Verne   (2000) User Score Overview The Secret Adventures of Jules Verne is a 22-episode science fiction television series in the steampunk genre that first aired in June 2000 on CBC Television in Canada and in syndication in the United States. The plot concept is predicated on a vast fictional conspiracy beginning with the revelation that Jules Verne did not merely write the stories behind his famous science fiction classic books Twenty Thousand Leagues Under the Sea, Journey to the Center of the Earth or Around the World in Eighty Days — but actually experienced these adventures personally. A television technological historic footnote, this work was the first hour-long series filmed entirely in HDTV format. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Demetral Jules Verne Michael Praed Michel Courtemanche Full Cast & Crew Last Season Season 1 2000 | 22 Episodes Season 1 of The Secret Adventures of Jules Verne premiered on June 18, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Secret Adventures of Jules Verne. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors TB 2 TMDb Bot 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}