{"link": "https://www.themoviedb.org/tv/5031?language=en", "title": "The Fall Guy", "resume": "The Fall Guy is an American action/adventure television program produced for ABC and originally broadcast from November 4, 1981 to May 2, 1986. It stars Lee Majors, Douglas Barr, and Heather Thomas. Majors and Barr are the only two actors to appear in all 112 episodes of the series. Thomas appeared in every episode of the show except for one in the first season.", "rate": 70, "genre": ["Action", "Adventure"], "cast": ["Lee Majors", "Douglas Barr", "Heather Thomas", "Markie Post", "Jo Ann Pflug"], "character": ["Colt Seavers", "Howie Munson", "Jody Banks", "Terri Michaels", "Samantha 'Big Jack' Jack"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5031   Expand The Fall Guy   (1983) User Score Overview The Fall Guy is an American action/adventure television program produced for ABC and originally broadcast from November 4, 1981 to May 2, 1986. It stars Lee Majors, Douglas Barr, and Heather Thomas. Majors and Barr are the only two actors to appear in all 112 episodes of the series. Thomas appeared in every episode of the show except for one in the first season. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Majors Colt Seavers Douglas Barr Howie Munson Heather Thomas Jody Banks Markie Post Terri Michaels Jo Ann Pflug Samantha 'Big Jack' Jack Full Cast & Crew Last Season Season 1 1983 | 23 Episodes Season 1 of The Fall Guy premiered on March  8, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  11 Recommendations   1979-09-20 Buck Rogers in the 25th Century 6.9    1984-01-29 Ever Decreasing Circles 6.5    1984-01-03 Riptide 6.1    1977-09-22 Man from Atlantis 5.6    1986-09-01 Brush Strokes 7.8    1998-05-08 Invasion: Earth 5.8    1980-01-27 Tenspeed and Brown Shoe 7.7    1976-03-21 Charlie's Angels 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors F 27 Fiedl 27 Steve 14 kiroukou330 7 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}