{"link": "https://www.themoviedb.org/tv/7679?language=en", "title": "Nuclear Secrets", "resume": "A series of spy thrillers exploring the key turning-points in the race for nuclear supremacy. From the development of the A-bomb, via the Cuban missile crisis, to the spread of nuclear weapons to the Middle East and beyond, each story is told through the eyes of the men who risked everything to proliferate their nuclear secrets and those who tried to stop them. Nuclear weapons and the actions of these men have transformed the face of war - and now the world could pay the price.", "rate": 0, "genre": ["Documentary", "Drama"], "cast": ["René Zagger", "Shannon Whirry", "Mark Bonnar", "Dalip Tahil"], "character": ["Kitty Oppenheimer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7679   Expand Nuclear Secrets   (2007) User Score Overview A series of spy thrillers exploring the key turning-points in the race for nuclear supremacy. From the development of the A-bomb, via the Cuban missile crisis, to the spread of nuclear weapons to the Middle East and beyond, each story is told through the eyes of the men who risked everything to proliferate their nuclear secrets and those who tried to stop them. Nuclear weapons and the actions of these men have transformed the face of war - and now the world could pay the price. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast René Zagger Shannon Whirry Kitty Oppenheimer Mark Bonnar Dalip Tahil Full Cast & Crew Last Season Season 1 2007 | 5 Episodes Season 1 of Nuclear Secrets premiered on January 15, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nuclear Secrets. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage  - Genres Documentary Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 4 Rebecca V 1 VintageSmoke  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}