{"link": "https://www.themoviedb.org/tv/43982?language=en", "title": "Line of Duty", "resume": "Steve Arnott is a young officer who’s fallen foul of his superiors for refusing to help in the cover-up of an operation that ended in the shooting of an innocent father. He seems ideal to join AC-12, an anti-corruption police unit, just as it starts to investigate Detective Chief Inspector Tony Gates, the regional force’s Officer of the Year.", "rate": 80, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Thandie Newton", "Martin Compston", "Vicky McClure", "Adrian Dunbar", "Jason Watkins"], "character": ["DCI Roz Huntley", "DS Steve Arnott", "DC Kate Fleming", "SI Ted Hastings", "Tim Ifield"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43982   Expand Line of Duty   (2012) User Score  Play Trailer Overview Steve Arnott is a young officer who’s fallen foul of his superiors for refusing to help in the cover-up of an operation that ended in the shooting of an innocent father. He seems ideal to join AC-12, an anti-corruption police unit, just as it starts to investigate Detective Chief Inspector Tony Gates, the regional force’s Officer of the Year. Featured Crew Jed Mercurio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thandie Newton DCI Roz Huntley Martin Compston DS Steve Arnott Vicky McClure DC Kate Fleming Adrian Dunbar SI Ted Hastings Jason Watkins Tim Ifield Full Cast & Crew Last Season Series 4 2017 | 6 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply LINE OF DUTY Seasons 1-4 Open 0 by NETFLOWERS\n      \n     j othing o season 4 ? Open 4 by  jerry6 Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2007-04-08 Inspector George Gently 8.3    2011-05-29 Scott & Bailey 7.5    2016-04-04 Marcella 7.3    2012-09-06 The Bletchley Circle 7.8    2012-12-30 Ripper Street 7.3    1997-05-09 Jonathan Creek 7.7    2011-05-05 The Shadow Line 8.1    2014-04-29 Happy Valley 7.7  Facts Status  Returning Series Networks Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p00yzlr0 Genres Crime Drama Mystery Keywords dirty cop anti-corruption Content Score 100 Yes! Looking good! Top Contributors 51 Bendik 40 Markxist 34 Elizabeth Jennings 23 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}