{"link": "https://www.themoviedb.org/tv/42066?language=en", "title": "A Shelter for Love", "resume": "Un refugio para el amor is a Mexican Spanish-language telenovela produced by Ignacio Sada Madero for Televisa. It is a remake of the Venezuelan telenovela La Zulianita, written by Delia Fiallo and adapted by Nora Alemán and Georgina Tinoco. Zuria Vega and Gabriel Soto star as the main protagonists, while Jessica Coch, Humberto Elizondo, Laura Flores and Frances Ondiviela star as the main antagonists.", "rate": 0, "genre": [], "cast": ["Zuria Vega", "Jessica Coch", "Gabriel Soto", "Roberto Blandon", "Brandon Peniche"], "character": ["Luciana Jacinto Flores", "Gala Villavicencio", "Rodrigo Torreslanda Fuentes Gil", "Maximino Torreslanda", "Patricio Torreslanda Fuentes Gil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42066   Expand A Shelter for Love   (2012) User Score Overview Un refugio para el amor is a Mexican Spanish-language telenovela produced by Ignacio Sada Madero for Televisa. It is a remake of the Venezuelan telenovela La Zulianita, written by Delia Fiallo and adapted by Nora Alemán and Georgina Tinoco. Zuria Vega and Gabriel Soto star as the main protagonists, while Jessica Coch, Humberto Elizondo, Laura Flores and Frances Ondiviela star as the main antagonists. Featured Crew Delia Fiallo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zuria Vega Luciana Jacinto Flores Jessica Coch Gala Villavicencio Gabriel Soto Rodrigo Torreslanda Fuentes Gil Roberto Blandon Maximino Torreslanda Brandon Peniche Patricio Torreslanda Fuentes Gil Full Cast & Crew Last Season Season 1 2012 | 1 Episode Season 1 of A Shelter for Love premiered on February  6, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Shelter for Love. You can help by rating TV shows you've seen. Facts Original Name  Un Refugio para el Amor Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors s 14 shiff7 a 5 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}