{"link": "https://www.themoviedb.org/tv/6220?language=en", "title": "The Piglet Files", "resume": "The Piglet files is a British sitcom produced by LWT. The show consisted of three series totalling 21 episodes that ran between 7 September 1990 and 10 May 1992.\nThe programme follows the life of reluctant MI5 agent Peter “Piglet” Chapman as he tries to instruct his fellow agents on the finer points of spy gadgetry while keeping his wife Sarah in the dark about his new career.", "rate": 90, "genre": ["Comedy"], "cast": ["Nicholas Lyndhurst", "Clive Francis", "John Ringham", "Michael Percival", "Steven Law"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6220   Expand The Piglet Files   (1990) User Score Overview The Piglet files is a British sitcom produced by LWT. The show consisted of three series totalling 21 episodes that ran between 7 September 1990 and 10 May 1992. The programme follows the life of reluctant MI5 agent Peter “Piglet” Chapman as he tries to instruct his fellow agents on the finer points of spy gadgetry while keeping his wife Sarah in the dark about his new career. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Lyndhurst Clive Francis John Ringham Michael Percival Steven Law Full Cast & Crew Last Season Season 3 1992 | 7 Episodes Season 3 of The Piglet Files premiered on March 29, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Piglet Files. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords secret agent spoof sitcom british humour Content Score 71 Just a little bit more... Top Contributors O 9 Ozbourne R 2 Rebecca 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}