{"link": "https://www.themoviedb.org/tv/43988?language=en", "title": "Feast of the Gods", "resume": "Feast of the Gods is a 2012 South Korean television series, starring Sung Yu-ri, Seo Hyun-jin, Joo Sang-wook and Lee Sang-woo. The series follows the fate of two girls whose identities were switched and later become rivaling chefs of traditional royal cuisine. It aired on MBC from February 4 to May 20, 2012 on Saturdays and Sundays at 21:50 for 32 episodes.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Sung Yu-ri", "Seo Hyun-Jin", "Joo Sang-wook", "Lee Sang-woo", "Kim Bo-Yeon"], "character": ["Go Joon-young", "Ha In-joo / Song Yeon-woo", "Choi Jae-ha", "Kim Do-yoon", "Baek Seol-hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43988   Expand Feast of the Gods   (2012) User Score Overview Feast of the Gods is a 2012 South Korean television series, starring Sung Yu-ri, Seo Hyun-jin, Joo Sang-wook and Lee Sang-woo. The series follows the fate of two girls whose identities were switched and later become rivaling chefs of traditional royal cuisine. It aired on MBC from February 4 to May 20, 2012 on Saturdays and Sundays at 21:50 for 32 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sung Yu-ri Go Joon-young Seo Hyun-Jin Ha In-joo / Song Yeon-woo Joo Sang-wook Choi Jae-ha Lee Sang-woo Kim Do-yoon Kim Bo-Yeon Baek Seol-hee Full Cast & Crew Last Season Season 1 2012 | 32 Episodes Season 1 of Feast of the Gods premiered on February  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Feast of the Gods. You can help by rating TV shows you've seen. Facts Original Name  신들의 만찬 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/dinner/ Genres Comedy Drama Keywords korea Content Score 86 Almost there... Top Contributors M 38 Maria180493 N 11 Nightowl.Kr CM 6 Cherche Moi z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}