{"link": "https://www.themoviedb.org/tv/10729?language=en", "title": "Parco P.I.", "resume": "Parco P.I. was a reality television program that airs on Court TV. The series was about the cases of New York City-based private investigator Vincent \"Vinny\" Parco, his family, his daughter Dani Parco, his twin sons Chris Parco and Vincent Parco Jr., Ro and a number of the female investigators who work for the firm.", "rate": 68, "genre": [], "cast": ["Vinny Parco", "Vinny Parco Jr.", "Chris Parco", "Danielle Parco", "Carol Parco"], "character": ["Himself", "Himself", "Himself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10729   Expand Parco P.I.   (2005) User Score Overview Parco P.I. was a reality television program that airs on Court TV. The series was about the cases of New York City-based private investigator Vincent \"Vinny\" Parco, his family, his daughter Dani Parco, his twin sons Chris Parco and Vincent Parco Jr., Ro and a number of the female investigators who work for the firm. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vinny Parco Himself Vinny Parco Jr. Himself Chris Parco Himself Danielle Parco Herself Carol Parco Herself Full Cast & Crew Last Season Season 2 2006 | 14 Episodes Season 2 of Parco P.I. premiered on August 15, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Parco P.I.. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.courttv.com/onair/shows/parco/ Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors DD 20 Debbie D'Amico 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}