{"link": "https://www.themoviedb.org/tv/2637?language=en", "title": "Come Dine with Me", "resume": "Amateur chefs compete against each other by hosting a dinner party for the other contestants. Each competitor then rates the host's performance with the winner winning a £1,000 cash prize. An element of comedy is added to the show through comedian Dave Lamb, who provides a dry and \"bitingly sarcastic\" narration.", "rate": 42, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2637   Expand Come Dine with Me   (2005) User Score Overview Amateur chefs compete against each other by hosting a dinner party for the other contestants. Each competitor then rates the host's performance with the winner winning a £1,000 cash prize. An element of comedy is added to the show through comedian Dave Lamb, who provides a dry and \"bitingly sarcastic\" narration. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 30 2013 | 138 Episodes Season 30 of Come Dine with Me premiered on March  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2008-09-24 Celebrity Juice 7.3    1987-03-09 French & Saunders 7.4    1984-02-26 Spitting Image 7.8    1994-07-04 Room 101 5.9    1965-07-22 Till Death Us Do Part 7.2    1993-12-27 Shooting Stars 6.7    1996-11-12 Never Mind the Buzzcocks 7.5    1987-01-07 Filthy Rich & Catflap 6.7  Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  30m, 60m Homepage   http://www.channel4.com/dine Genres Reality Keywords cooking food Content Score 56 We're so close, yet so far. Top Contributors 8 Elizabeth Jennings jp 3 juan perez 2 Banana 2 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}