{"link": "https://www.themoviedb.org/tv/34647?language=en", "title": "The Nativity", "resume": "«The Nativity» is a 2010 British four-part drama television series. The series is a re-telling of the nativity and was broadcast on BBC One and BBC HD across four days, starting on 20 December 2010. It was rebroadcast in two hour-long parts on the mornings of 24 and 25 December 2011.\nThe series stars Tatiana Maslany as Mary; Andrew Buchan as Joseph; Neil Dudgeon as Joachim; Claudie Blakley as Anna; Peter Capaldi as Balthasar and John Lynch as Gabriel.", "rate": 90, "genre": ["Drama", "Family"], "cast": ["Andrew Buchan", "Tatiana Maslany", "Peter Capaldi", "Vincent Regan", "Al Weaver"], "character": ["Joseph", "Mary", "Balthazar", "Herod", "Thomas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34647   Expand The Nativity   (2010) User Score Overview «The Nativity» is a 2010 British four-part drama television series. The series is a re-telling of the nativity and was broadcast on BBC One and BBC HD across four days, starting on 20 December 2010. It was rebroadcast in two hour-long parts on the mornings of 24 and 25 December 2011. The series stars Tatiana Maslany as Mary; Andrew Buchan as Joseph; Neil Dudgeon as Joachim; Claudie Blakley as Anna; Peter Capaldi as Balthasar and John Lynch as Gabriel. Featured Crew Tony Jordan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Buchan Joseph Tatiana Maslany Mary Peter Capaldi Balthazar Vincent Regan Herod Al Weaver Thomas Full Cast & Crew Last Season Miniseries 2010 | 4 Episodes Season 1 of The Nativity premiered on December 20, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Nativity. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Nativity. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00x15ny Genres Drama Family Keywords jesus christ bible miniseries nativity christmas Content Score 79 Pump it up! We're close now. Top Contributors TB 21 TMDb Bot 15 midnightmark R 5 Rebecca 2 hayfield  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}