{"link": "https://www.themoviedb.org/tv/60871?language=en", "title": "Soul Eater Not!", "resume": "Ding-dong! Dead-dong! Class is about to begin, and you don't want to be late on your first day of school! Join Tsugumi Harudori in the \"NOT\" class at Death Weapon Meister Academy, a school dedicated to training transforming weapons like Tsugumi and the meisters who will wield them. Many \"NOT\" (Normally Overcome Target) students aspire to join the elite \"EAT\" (Especially Advantaged Talent) class. But it may take Tsugumi some time to find her confidence-- and a partner -- at this crazy school!", "rate": 73, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Haruka Chisuga", "Aoi Yuki", "Saori Hayami", "Mamoru Miyano"], "character": ["Harudori Tsugumi", "Tatane Meme", "Anya Hepburn", "Death the Kid"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60871   Expand Soul Eater Not!   (2014) User Score  Play Trailer Overview Ding-dong! Dead-dong! Class is about to begin, and you don't want to be late on your first day of school! Join Tsugumi Harudori in the \"NOT\" class at Death Weapon Meister Academy, a school dedicated to training transforming weapons like Tsugumi and the meisters who will wield them. Many \"NOT\" (Normally Overcome Target) students aspire to join the elite \"EAT\" (Especially Advantaged Talent) class. But it may take Tsugumi some time to find her confidence-- and a partner -- at this crazy school! Featured Crew Masakazu Hashimoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Haruka Chisuga Harudori Tsugumi Aoi Yuki Tatane Meme Saori Hayami Anya Hepburn Mamoru Miyano Death the Kid Full Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Soul Eater Not! premiered on April  8, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  7 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Soul Eater Not!. You can help by rating TV shows you've seen. Facts Original Name  ソウルイーターノット！ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://souleaternot.tv/ Genres Action & Adventure Animation Comedy Keywords based on manga spin off shounen anime Content Score 100 Yes! Looking good! Top Contributors 31 benf45 21 Elizabeth Jennings 16 sp1ti TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}