{"link": "https://www.themoviedb.org/tv/7212?language=en", "title": "Headcases", "resume": "Headcases was an ITV satirical animation show based on current affairs. It employed the same satirical style as Spitting Image, 2DTV and Bo' Selecta! but using 3D animation created by UK Visual Effects and animation house Red Vision. Red Vision evolved a series of unique production techniques and a sophisticated animation pipeline to deliver the weekly topical elements of the series to hitherto impossible deadlines.\nThe programme's first series began on 6 April 2008, with weekly episodes until 11 May 2008, airing on Sundays at 10 pm. A seventh episode was televised on Friday, 30 May at 10:30 pm, and an eighth at 10 pm on Sunday, 15 June.\nThe show included celebrities, politicians and members of the British Royal Family in their animated form, taking a role in sketches including scenarios from their own topical issues. The show's name comes from the fact that all the subjects' caricatured faces are out of scale with the rest of their bodies.", "rate": 55, "genre": ["Animation", "Comedy"], "cast": ["Phil Cornwell", "Omid Djalili", "Jess Robinson", "Kayvan Novak", "Jon Culshaw"], "character": ["Various"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7212   Expand Headcases   (2008) User Score Overview Headcases was an ITV satirical animation show based on current affairs. It employed the same satirical style as Spitting Image, 2DTV and Bo' Selecta! but using 3D animation created by UK Visual Effects and animation house Red Vision. Red Vision evolved a series of unique production techniques and a sophisticated animation pipeline to deliver the weekly topical elements of the series to hitherto impossible deadlines. The programme's first series began on 6 April 2008, with weekly episodes until 11 May 2008, airing on Sundays at 10 pm. A seventh episode was televised on Friday, 30 May at 10:30 pm, and an eighth at 10 pm on Sunday, 15 June. The show included celebrities, politicians and members of the British Royal Family in their animated form, taking a role in sketches including scenarios from their own topical issues. The show's name comes from the fact that all the subjects' caricatured faces are out of scale with the rest of their bodies. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil Cornwell Omid Djalili Jess Robinson Kayvan Novak Various Jon Culshaw Full Cast & Crew Last Season Season 1 2008 | 8 Episodes Season 1 of Headcases premiered on April  6, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Headcases. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.itv.com/headcases Genres Animation Comedy Keywords satire political humour british humour Content Score 86 Almost there... Top Contributors O 6 Ozbourne 2 kcdh 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}