{"link": "https://www.themoviedb.org/tv/2491?language=en", "title": "Max and Paddy's Road to Nowhere", "resume": "Max And Paddy's Road To Nowhere is the much-loved sequel to Peter Kay's critically-acclaimed comedy series, \"Phoenix Nights\". Written by and starring Peter Kay and Patrick McGuinness, this six-part comedy/drama series is the story of clueless Phoenix Club bouncers Max (Kay) and Paddy (McGuinness), as they escape clubland in their prized motor-home and take to the open highway.", "rate": 82, "genre": ["Comedy"], "cast": ["Peter Kay", "Paddy McGuinness", "Craig Cheetham"], "character": ["Max Bygraves"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2491   Expand Max and Paddy's Road to Nowhere   (2004) User Score Overview Max And Paddy's Road To Nowhere is the much-loved sequel to Peter Kay's critically-acclaimed comedy series, \"Phoenix Nights\". Written by and starring Peter Kay and Patrick McGuinness, this six-part comedy/drama series is the story of clueless Phoenix Club bouncers Max (Kay) and Paddy (McGuinness), as they escape clubland in their prized motor-home and take to the open highway. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Kay Max Bygraves Paddy McGuinness Craig Cheetham Full Cast & Crew Last Season Series 1 2004 | 6 Episodes Season 1 of Max and Paddy's Road to Nowhere premiered on November 12, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2001-01-14 Phoenix Nights 8.2    2000-01-12 That Peter Kay Thing 6.4    2001-02-26 Two Pints of Lager and a Packet of Crisps 7.0    2002-11-14 Harry Hill's TV Burp 7.2    1998-11-12 Dinnerladies 6.4    2008-09-24 Celebrity Juice 7.3    1999-01-08 Gimme Gimme Gimme 7.0    1998-09-14 The Royle Family 7.9  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.channel4.com/programmes/max-and-paddys-road-to-nowhere Genres Comedy Keywords england recreational vehicle sitcom traveller british humour Content Score 56 We're so close, yet so far. Top Contributors 10 Banana 3 -BioHaZard- O 3 Ozbourne 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}