{"link": "https://www.themoviedb.org/tv/19890?language=en", "title": "Die Deutschen", "resume": "Die Deutschen is a German television documentary produced for ZDF that first aired from October to November 2008. Each episode recounts a selected epoch of German history, beginning with the reign of Otto the Great and ending with the collapse of the German Empire at the end of the First World War. In November 2010 the second season of Die Deutschen was published in German television, beginning with Charlemagne, the Frankish King, and ending with Gustav Stresemann, the Chancellor and Foreign Minister during the Weimar Republic.\nHistorical events are recreated through a combination of live action scenes and computer generated animations. The series was filmed at over 200 different locations in Germany, Malta, and Romania at a cost of approximately €500,000 per episode.", "rate": 73, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19890   Expand Die Deutschen   (2008) User Score Overview Die Deutschen is a German television documentary produced for ZDF that first aired from October to November 2008. Each episode recounts a selected epoch of German history, beginning with the reign of Otto the Great and ending with the collapse of the German Empire at the end of the First World War. In November 2010 the second season of Die Deutschen was published in German television, beginning with Charlemagne, the Frankish King, and ending with Gustav Stresemann, the Chancellor and Foreign Minister during the Weimar Republic. Historical events are recreated through a combination of live action scenes and computer generated animations. The series was filmed at over 200 different locations in Germany, Malta, and Romania at a cost of approximately €500,000 per episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2010 | 10 Episodes Season 2 of Die Deutschen premiered on November 14, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Die Deutschen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  43m Homepage   http://www.diedeutschen.zdf.de/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors S 10 Samara TB 2 TMDb Bot SM 1 Surry Mether  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}