{"link": "https://www.themoviedb.org/tv/890?language=en", "title": "Neon Genesis Evangelion", "resume": "At the turn of the century, the Angels returned to Earth, seeking to wipe out humanity in an apocalyptic fury. Devastated, mankind's last remnants moved underground to wait for the day when the Angels would come back to finish the job. Fifteen years later, that day has come... but this time, humanity is ready to fight back with terrifying bio-mechanical weapons known as the Evangelions. Watch as Shinji, Rei, Asuka and the rest of the mysterious shadow agency Nerv battle to save earth from total annihilation.", "rate": 80, "genre": ["Sci-Fi", "Fantasy", "Animation", "Drama"], "cast": ["Megumi Ogata", "Kotono Mitsuishi", "Megumi Hayashibara", "Yuko Miyamura", "Yuriko Yamaguchi"], "character": ["Shinji Ikari (voice)", "Misato Katsuragi (voice)", "Rei Ayanami (voice)", "Asuka Langley Souryuu (voice)", "Dr. Ritsuko Akagi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 890   Expand Neon Genesis Evangelion   (1995) User Score Overview At the turn of the century, the Angels returned to Earth, seeking to wipe out humanity in an apocalyptic fury. Devastated, mankind's last remnants moved underground to wait for the day when the Angels would come back to finish the job. Fifteen years later, that day has come... but this time, humanity is ready to fight back with terrifying bio-mechanical weapons known as the Evangelions. Watch as Shinji, Rei, Asuka and the rest of the mysterious shadow agency Nerv battle to save earth from total annihilation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  8 Images Backdrops  33 Posters  18 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megumi Ogata Shinji Ikari (voice) Kotono Mitsuishi Misato Katsuragi (voice) Megumi Hayashibara Rei Ayanami (voice) Yuko Miyamura Asuka Langley Souryuu (voice) Yuriko Yamaguchi Dr. Ritsuko Akagi (voice) Full Cast & Crew Last Season Season 1 1995 | 26 Episodes Season 1 of Neon Genesis Evangelion premiered on October  4, 1995. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply There are no discussions for Neon Genesis Evangelion. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  33 Posters  18 Recommendations   2011-04-06 Steins;Gate 8.2    1998-04-03 Cowboy Bebop 8.2    1998-07-06 Serial Experiments Lain 8.2    2006-10-04 Death Note 8.2    2007-04-01 Gurren Lagann 7.9    1998-04-02 TRIGUN 7.7    2001-10-10 Hellsing 7.2    2006-10-05 Code Geass: Lelouch of the Rebellion 8.1  Facts Original Name  新世紀エヴァンゲリオン Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://evangelion.co.jp Genres Sci-Fi & Fantasy Animation Drama Keywords depression loss love mecha piloted robot psychological anime Content Score 86 Almost there... Top Contributors 88 Marr 🇳🇱 30 sp1ti m 26 movie28 17 kappa-papa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}