{"link": "https://www.themoviedb.org/tv/57757?language=en", "title": "Brothers Conflict", "resume": "Imagine being the only child your whole life, and then suddenly finding yourself gaining 13 step-brothers!\nEma Hinata's lonely life takes a new and exciting turn when her single father Rintarou Hinata, a famous adventurer, falls in love and marries Miwa Asahina, an apparel maker. In order to give the newly-wed couple space, Ema starts living with her new step-brothers in a mansion called Sunrise Residence and for the first time, experiences being part of a lively and big family. She finally feels safe and content.\nEach brother has his own unique personality, and Ema soon realizes that it is not only family love that grows between them, but romance as well. Which brother will be the one to steal her heart in the end?", "rate": 70, "genre": ["Animation"], "cast": ["Kenichi Suzumura", "Ken Takeuchi", "Daisuke Ono", "Namikawa Daisuke", "Tomoaki Maeno"], "character": ["Asahina, Tsubaki (voice)", "Asahina, Louis (voice)", "Asahina, Subaru (voice)", "Asahina, Iori (voice)", "Asahina, Natsume (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57757   Expand Brothers Conflict   (2013) User Score Overview Imagine being the only child your whole life, and then suddenly finding yourself gaining 13 step-brothers! Ema Hinata's lonely life takes a new and exciting turn when her single father Rintarou Hinata, a famous adventurer, falls in love and marries Miwa Asahina, an apparel maker. In order to give the newly-wed couple space, Ema starts living with her new step-brothers in a mansion called Sunrise Residence and for the first time, experiences being part of a lively and big family. She finally feels safe and content. Each brother has his own unique personality, and Ema soon realizes that it is not only family love that grows between them, but romance as well. Which brother will be the one to steal her heart in the end? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenichi Suzumura Asahina, Tsubaki (voice) Ken Takeuchi Asahina, Louis (voice) Daisuke Ono Asahina, Subaru (voice) Namikawa Daisuke Asahina, Iori (voice) Tomoaki Maeno Asahina, Natsume (voice) Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Brothers Conflict premiered on July  2, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2013-09-16 Diabolik Lovers 3.0    2005-12-26 My Gym Partner's a Monkey 5.0  Facts Original Name  ブラザーズ コンフリクト Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Keywords romance anime Content Score 86 Almost there... Top Contributors 18 CrewMdk 13 Sekhmet_03 9 Jaime Neto 3 enams90  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}