{"link": "https://www.themoviedb.org/tv/12697?language=en", "title": "Dragon Ball GT", "resume": "Ten years have passed since Goku left his friends and family to hone his skills. But Goku soon finds himself helpless against the mystical power of the Dragon Balls and an accidental wish made by the devious Emperor Pilaf. His desire; that Goku once again become a child! Not daunted by this small setback, Goku, together with Trunks, and his own granddaughter Pan, blast off into the outer reaches of space in search of the mysterious Blackstar Dragon Balls. But these Dragon Balls have a fatal secret: if not collected within one year Earth will be destroyed.", "rate": 57, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Masako Nozawa", "Bin Shimada", "Takeshi Kusao", "Atsushi Kisaichi", "Ryou Horikawa"], "character": ["Son Gohan/Son Gokū/Son Goten (voices)", "Son Para/Sūgorō (voices)", "Trunks (voice)", "Oob (voice)", "Vegeta (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12697   Expand Dragon Ball GT   (1996) User Score Overview Ten years have passed since Goku left his friends and family to hone his skills. But Goku soon finds himself helpless against the mystical power of the Dragon Balls and an accidental wish made by the devious Emperor Pilaf. His desire; that Goku once again become a child! Not daunted by this small setback, Goku, together with Trunks, and his own granddaughter Pan, blast off into the outer reaches of space in search of the mysterious Blackstar Dragon Balls. But these Dragon Balls have a fatal secret: if not collected within one year Earth will be destroyed. Featured Crew Osamu Kasai Creator Aya Matsui Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  8 Images Backdrops  3 Posters  7 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Masako Nozawa Son Gohan/Son Gokū/Son Goten (voices) Bin Shimada Son Para/Sūgorō (voices) Takeshi Kusao Trunks (voice) Atsushi Kisaichi Oob (voice) Ryou Horikawa Vegeta (voice) Full Cast & Crew Last Season Original Air Date Original Air Date Original Funimation Release (Absolute) Individual DVDs (DVD) DVDs (DVD) Japanese Volumes (DVD) German DVDs (DVD) Sagas (Story Arc) German TV (TV) Season 1 1996 | 64 Episodes Season 1 of Dragon Ball GT premiered on February  6, 1996. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply There are no discussions for Dragon Ball GT. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  7 Recommendations   1986-02-26 Dragon Ball 8.1    1989-04-26 Dragon Ball Z 8.1    2009-04-05 Dragon Ball Z Kai 5.3    2002-03-01 Digimon Tamers 5.9    Digimon Adventure 02 5.6    1999-03-07 Digimon 6.8    2015-07-05 Dragon Ball Super 6.9    1997-09-16 Cow and Chicken 6.4  Facts Original Name  ドラゴンボールGT Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.toei-anim.co.jp/tv/dragongt/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords martial arts super power shounen anime Content Score 100 Yes! Looking good! Top Contributors 111 Banana t 75 tmdb983464 19 Elizabeth Jennings AK 11 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}