{"link": "https://www.themoviedb.org/tv/8063?language=en", "title": "The World of Lee Evans", "resume": "The World of Lee Evans was a BAFTA nominated TV show written by and starring Lee Evans and a range of actors, it followed Lee around getting stuck in tight situations and originally aired on Channel 4. The series was released on Channel 4 DVD in 2006 and features all episodes.\nThe humour, which differs greatly from Evans' later stand-up humour, contains many elements of slapstick, and the show is similar in style to Mr. Bean. The series was a Granada Production in 1995 for Channel 4, and as Granada had adopted a new endboard cap at the end of their programmes at this time, The World of Lee Evans was amongst the first ever shows to use the endboard\nThe series was quite popular though has had a very mixed reception in retrospect, some critics and Lee Evans fans saying the series is not as good as his other work.\nThe series' slogan is If Lee Evans \"needs to get from A to B, he starts at Z...\".", "rate": 60, "genre": ["Comedy"], "cast": ["Lee Evans", "Sean Lock"], "character": ["Lee", "Mitchell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8063   Expand The World of Lee Evans   (1995) User Score Overview The World of Lee Evans was a BAFTA nominated TV show written by and starring Lee Evans and a range of actors, it followed Lee around getting stuck in tight situations and originally aired on Channel 4. The series was released on Channel 4 DVD in 2006 and features all episodes. The humour, which differs greatly from Evans' later stand-up humour, contains many elements of slapstick, and the show is similar in style to Mr. Bean. The series was a Granada Production in 1995 for Channel 4, and as Granada had adopted a new endboard cap at the end of their programmes at this time, The World of Lee Evans was amongst the first ever shows to use the endboard The series was quite popular though has had a very mixed reception in retrospect, some critics and Lee Evans fans saying the series is not as good as his other work. The series' slogan is If Lee Evans \"needs to get from A to B, he starts at Z...\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Evans Lee Sean Lock Mitchell Full Cast & Crew Last Season Season 1 1995 | 4 Episodes Season 1 of The World of Lee Evans premiered on June  2, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The World of Lee Evans. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords farce british humour Content Score 56 We're so close, yet so far. Top Contributors O 4 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}