{"link": "https://www.themoviedb.org/tv/75846?language=en", "title": "Viso d'angelo", "resume": "TV miniseries in four parts. A serial killer mysteriously leaves a signature species, a rosary in the hands of his victims. Inspector Roberto Parisi, a specialist in this type of crime, but that hides a dark past, will be responsible for conducting investigations.", "rate": 48, "genre": ["Drama"], "cast": ["Mambaye Diop", "Gabriel Garko", "Cosima Coppola", "Alessandra Costanzo"], "character": ["Roberto Parise"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75846   Expand Viso d'angelo   (2011) User Score Overview TV miniseries in four parts. A serial killer mysteriously leaves a signature species, a rosary in the hands of his victims. Inspector Roberto Parisi, a specialist in this type of crime, but that hides a dark past, will be responsible for conducting investigations. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mambaye Diop Gabriel Garko Roberto Parise Cosima Coppola Alessandra Costanzo Full Cast & Crew Last Season Miniseries 2011 | 4 Episodes Season 1 of Viso d'angelo premiered on October 28, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Viso d'angelo. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  Italian Runtime  117m, 97m Homepage   http://www.video.mediaset.it/programma/viso_d_angelo/viso-d-angelo.html Genres Drama Keywords thriller serial killer miniseries Content Score 86 Almost there... Top Contributors 24 Banana TB 15 TMDb Bot 5 nyke  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}