{"link": "https://www.themoviedb.org/tv/60734?language=en", "title": "Riot", "resume": "The show's concept places two teams of celebrities and comedians in a series of competitions that have the teams sing, dance and create comedy sketches while overcoming multiple mental and physical obstacles. Instructed by guest team captains, two teams of comedians are instructed to create and participate in a set of unscripted improv skits, some of which take place on a set tilted at 22-1/2 degrees or some of which take place in complete darkness with the audience able to observe through night-vision cameras while the contestants blunder about.", "rate": 10, "genre": ["Comedy"], "cast": ["Rove McManus", "Brian Palermo", "John Ross Bowie", "Jamie Denbo", "Jordan Black"], "character": ["Host", "Himself", "Himself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60734   Expand Riot   (2014) User Score Overview The show's concept places two teams of celebrities and comedians in a series of competitions that have the teams sing, dance and create comedy sketches while overcoming multiple mental and physical obstacles. Instructed by guest team captains, two teams of comedians are instructed to create and participate in a set of unscripted improv skits, some of which take place on a set tilted at 22-1/2 degrees or some of which take place in complete darkness with the audience able to observe through night-vision cameras while the contestants blunder about. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rove McManus Host Brian Palermo Himself John Ross Bowie Himself Jamie Denbo Herself Jordan Black Himself Full Cast & Crew Last Season Season 1 2014 | 4 Episodes Season 1 of Riot premiered on May 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Riot. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords improvisation Content Score 86 Almost there... Top Contributors 26 Travis Bell 4 the_ash D 1 DrakulL k 1 kikikikou  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}