{"link": "https://www.themoviedb.org/tv/74021?language=en", "title": "Andante", "resume": "High school student Lee Shi Kyung suddenly moves out to the countryside and transfers to a mysterious high school. Getting through unfamiliar experiences, he realizes the meaning of life and love.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Lee Ye Hyun", "Kai"], "character": ["Lee Shi Young", "Lee Shi Kyung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74021   Expand Andante   (2017) User Score Overview High school student Lee Shi Kyung suddenly moves out to the countryside and transfers to a mysterious high school. Getting through unfamiliar experiences, he realizes the meaning of life and love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Ye Hyun Lee Shi Young Kai Lee Shi Kyung Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Andante premiered on September 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Andante. You can help by rating TV shows you've seen. Facts Original Name  안단테 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.kbs.co.kr/drama/andante/about/program/index.html Genres Comedy Drama Keywords romance Content Score 64 We're so close, yet so far. Top Contributors 21 Charles M 19 Maria180493 5 Elizabeth Jennings 3 kangtahu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}