{"link": "https://www.themoviedb.org/tv/46943?language=en", "title": "Punar Vivah - Zindagi Milegi Dobara", "resume": "Punar Vivah is an Indian soap opera that airs on Zee TV. It premiered on 20 February 2012 and replaced Bhagonwali-Baante Apni Taqdeer. It aired every Monday-Friday at 10:30 pm. The show completed one year of run on 20 February 2013 and 300 episodes on 12 April 2013 And Also Had A good Fan Following of the Yash and Aarti couple in the show which made had gave them fame and Luckily, receive two Awards for the Couple. This season ended 17 May 2013 and Punar Vivah - Ek Nayi Umeed replaced Punar Vivah from 20 May 2013.", "rate": 100, "genre": [], "cast": ["Gurmeet Choudhary", "Kratika Sengar", "Chetan Pandit", "Zahida Parveen", "Amit Singh Thakur"], "character": ["Yash Suraj Pratap Sindhya", "Aarti Prashant Dubey", "Suraj Pratap Sindhya", "Gayatri SP Sindhya", "Satyendra Dubey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46943   Expand Punar Vivah - Zindagi Milegi Dobara User Score  Play Trailer Overview Punar Vivah is an Indian soap opera that airs on Zee TV. It premiered on 20 February 2012 and replaced Bhagonwali-Baante Apni Taqdeer. It aired every Monday-Friday at 10:30 pm. The show completed one year of run on 20 February 2013 and 300 episodes on 12 April 2013 And Also Had A good Fan Following of the Yash and Aarti couple in the show which made had gave them fame and Luckily, receive two Awards for the Couple. This season ended 17 May 2013 and Punar Vivah - Ek Nayi Umeed replaced Punar Vivah from 20 May 2013. Featured Crew Sashi Sumeet Production Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  6 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gurmeet Choudhary Yash Suraj Pratap Sindhya Kratika Sengar Aarti Prashant Dubey Chetan Pandit Suraj Pratap Sindhya Zahida Parveen Gayatri SP Sindhya Amit Singh Thakur Satyendra Dubey Full Cast & Crew Last Season Zindagi Milegi Dobara — | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  6 Backdrops  1 Posters  2 Facts Status  Ended Network Zee TV Certification  - Type  Scripted Original Language  Hindi Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors P 30 PoisonLace  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}