{"link": "https://www.themoviedb.org/tv/59273?language=en", "title": "Call of the Wildman", "resume": "Call of the Wildman is an American reality television series that airs on the Animal Planet network. The third season of the series is currently airing. The show follows the exploits of Kentucky woodsman Ernie Brown, Jr., nicknamed \"The Turtleman\". Aided by his friend, Neal James, and his dog, Lolly, Brown operates a nuisance animal removal business, catching the animals without harming them and releasing them back into the wild. The series is primarily filmed near Brown's Lebanon, Kentucky, home.\nBrown began catching snapping turtles from ponds near his home at the age of 7. He came to the attention of Animal Planet producers in part after an episode of Kentucky Educational Television's Kentucky Afield series that featured his bare-handed turtle-catching techniques was posted on YouTube and went viral. After personally visiting Brown and doing some initial filming, network executives decided to produce a 12-episode season of the series with the working title The Turtleman of Wild Kentucky. The title was soon changed to Call of the Wildman, a reference to Brown's distinctive yell that punctuates his actions throughout the series. The series was Animal Planet's most watched program in the fourth quarter of 2011 and was renewed for a second, 16-episode series that began airing in June 2012. On October 2012, Animal Planet has re-released the series with bonus features and trivia information known as Call of the Wildman: More Live Action.", "rate": 70, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59273   Expand Call of the Wildman   (2011) User Score Overview Call of the Wildman is an American reality television series that airs on the Animal Planet network. The third season of the series is currently airing. The show follows the exploits of Kentucky woodsman Ernie Brown, Jr., nicknamed \"The Turtleman\". Aided by his friend, Neal James, and his dog, Lolly, Brown operates a nuisance animal removal business, catching the animals without harming them and releasing them back into the wild. The series is primarily filmed near Brown's Lebanon, Kentucky, home. Brown began catching snapping turtles from ponds near his home at the age of 7. He came to the attention of Animal Planet producers in part after an episode of Kentucky Educational Television's Kentucky Afield series that featured his bare-handed turtle-catching techniques was posted on YouTube and went viral. After personally visiting Brown and doing some initial filming, network executives decided to produce a 12-episode season of the series with the working title The Turtleman of Wild Kentucky. The title was soon changed to Call of the Wildman, a reference to Brown's distinctive yell that punctuates his actions throughout the series. The series was Animal Planet's most watched program in the fourth quarter of 2011 and was renewed for a second, 16-episode series that began airing in June 2012. On October 2012, Animal Planet has re-released the series with bonus features and trivia information known as Call of the Wildman: More Live Action. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2014 | 10 Episodes Season 4 of Call of the Wildman premiered on June  8, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Call of the Wildman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.animalplanet.com/tv-shows/call-of-the-wildman Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 13 Elizabeth Jennings w 3 webmaster 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}