{"link": "https://www.themoviedb.org/tv/45475?language=en", "title": "On Wings Of Eagles", "resume": "On Wings of Eagles is a NBC TV mini-series, starring Burt Lancaster - Richard Crenna and directed by Andrew V. McLaglen. The TV series was adapted from Ken Follet's novel of the same name.\nThe plot is set during the Iranian revolution. During the takeover of Iran, the king is overthrown, and two executives of Electronic Data Systems are imprisoned on false charges. The head of the company, Mr. Perot, travels to Tehran to negotiate for their release. Meanwhile, a retired US Army Special Forces Colonel, Arthur Simons, is hired to develop a rescue plan at any cost.", "rate": 60, "genre": ["War", "Politics", "Drama"], "cast": ["Burt Lancaster", "Paul Le Mat", "Louis Giambalvo", "Jim Metzler", "Lawrence Pressman"], "character": ["Lieutenant Colonel Arthur E. 'Bull' Simons", "Jay Coburn", "Paul Chiapparone", "Bill Gaylord", "Bill Gayden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45475   Expand On Wings Of Eagles   (1986) User Score Overview On Wings of Eagles is a NBC TV mini-series, starring Burt Lancaster - Richard Crenna and directed by Andrew V. McLaglen. The TV series was adapted from Ken Follet's novel of the same name. The plot is set during the Iranian revolution. During the takeover of Iran, the king is overthrown, and two executives of Electronic Data Systems are imprisoned on false charges. The head of the company, Mr. Perot, travels to Tehran to negotiate for their release. Meanwhile, a retired US Army Special Forces Colonel, Arthur Simons, is hired to develop a rescue plan at any cost. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Burt Lancaster Lieutenant Colonel Arthur E. 'Bull' Simons Paul Le Mat Jay Coburn Louis Giambalvo Paul Chiapparone Jim Metzler Bill Gaylord Lawrence Pressman Bill Gayden Full Cast & Crew Last Season Miniseries 1986 | 2 Episodes Season 1 of On Wings Of Eagles premiered on May 18, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on On Wings Of Eagles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres War & Politics Drama Keywords rescue middle east 1970s miniseries wrongful imprisonment iran Content Score 79 Pump it up! We're close now. Top Contributors TB 31 TMDb Bot 18 Banana R 6 Rebecca 4 KingDavid  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}