{"link": "https://www.themoviedb.org/tv/2755?language=en", "title": "Rules of Engagement", "resume": "Rules of Engagement is a comedy about the different phases of male/female relationships, as seen through the eyes of a newly engaged couple, Adam and Jennifer, a long-time married pair, Jeff and Audrey, and a single guy on the prowl, Russell. As they find out, the often confusing stages of a relationship can seem like being on a roller coaster. People can describe the ride to you, but to really know what it's like you have to experience it for yourself.", "rate": 72, "genre": ["Comedy"], "cast": ["Patrick Warburton", "Megyn Price", "Oliver Hudson", "Bianca Kajlich", "Adhir Kalyan"], "character": ["Jeff Bingham", "Audrey Bingham", "Adam Rhodes", "Jennifer Morgan", "Timmy Patel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2755   Expand Rules of Engagement   (2007) User Score Overview Rules of Engagement is a comedy about the different phases of male/female relationships, as seen through the eyes of a newly engaged couple, Adam and Jennifer, a long-time married pair, Jeff and Audrey, and a single guy on the prowl, Russell. As they find out, the often confusing stages of a relationship can seem like being on a roller coaster. People can describe the ride to you, but to really know what it's like you have to experience it for yourself. Featured Crew Tom Hertz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Warburton Jeff Bingham Megyn Price Audrey Bingham Oliver Hudson Adam Rhodes Bianca Kajlich Jennifer Morgan Adhir Kalyan Timmy Patel Full Cast & Crew Last Season Season 7 2013 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Russell Dunbar: Happy Birthday David Spade! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  3 Recommendations   2011-02-14 Mad Love 5.3    2010-09-21 Raising Hope 6.9    2009-10-04 Autumn's Concerto 7.8    2009-02-25 Burnistoun 7.8    2009-09-23 Cougar Town 5.8    2008-01-31 Eli Stone 6.7    1996-09-17 Spin City 7.0    2014-01-06 Some Assembly Required 4.7  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m, 21m Homepage   http://www.cbs.com/primetime/rules_of_engagement/ Genres Comedy Keywords dating group of friends sitcom Content Score 93 Almost there... Top Contributors 58 United600 M 12 Marco 10 NEOhidra R 7 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}