{"link": "https://www.themoviedb.org/tv/73913?language=en", "title": "Magic School", "resume": "Na-Ra is a university student and he has never had a girlfriend in his life. He wants to become a public servant. Jay is a popular magician mired in deep sadness. Joon is an intern at a hospital. He is poor, but he a has warm heart. These people gather at a magic school led by Master Han. Master Han has a daughter, Yi-Seul, who wants to become a dancer and not a magician.", "rate": 80, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Kang Yoon-Je", "Park Jinyoung", "Nichkhun", "Yoon Park", "Ryu Seung-su"], "character": ["Lee-Sung", "Lee Na-Ra", "Joon", "Jay", "Master Han"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73913   Expand Magic School   (2017) User Score Overview Na-Ra is a university student and he has never had a girlfriend in his life. He wants to become a public servant. Jay is a popular magician mired in deep sadness. Joon is an intern at a hospital. He is poor, but he a has warm heart. These people gather at a magic school led by Master Han. Master Han has a daughter, Yi-Seul, who wants to become a dancer and not a magician. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kang Yoon-Je Lee-Sung Park Jinyoung Lee Na-Ra Nichkhun Joon Yoon Park Jay Ryu Seung-su Master Han Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Magic School premiered on September 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Magic School. You can help by rating TV shows you've seen. Facts Original Name  마술학교 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  15m Homepage   http://tv.jtbc.joins.com/magicschool Genres Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors n 13 nubie 11 Elizabeth Jennings 7 Lumina_B m 6 mary2017  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}