{"link": "https://www.themoviedb.org/tv/14146?language=en", "title": "Looking After Jo Jo", "resume": "John Joseph McCann has been a habitual criminal since childhood, when he pilfered cash boxes for his dad. He's been in and out of prison ever since. He lives in a high rise council flat with his mother and sister. It is set in and around the North Sighthill housing estate. Looking After JoJo traces the career of a petty thief turned drug dealer in 1980's Edinburgh. The title character is a pleasant if misguided young man surviving in a bleak housing estate and aspiring to the trappings of a successful criminal. Unfortunately for him, and for most of the other characters in the mini-series, it is a time of heroin addiction and AIDS. We watch JoJo become ensnared in the drugs scene and his deterioration is both painful to watch and very moving. Robert Carlyle's performance is extraordinarily complex and textured. He is ably supported by Jenny McCrindle, Ewan Stewart and Trainspotting's Kevin McKidd. This isn't the fast-moving MTV drug scene of Trainspotting but a more character-oriented, leisurely look at the human cost of drug addiction.", "rate": 100, "genre": ["Drama"], "cast": ["Robert Carlyle", "Aline Mowat", "Jenny McCrindle", "Kevin McKidd", "Patricia Brake"], "character": ["John Joe 'Jo Jo' McCann", "Christine", "Lorraine", "Basil", "Doro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14146   Expand Looking After Jo Jo   (1998) User Score Overview John Joseph McCann has been a habitual criminal since childhood, when he pilfered cash boxes for his dad. He's been in and out of prison ever since. He lives in a high rise council flat with his mother and sister. It is set in and around the North Sighthill housing estate. Looking After JoJo traces the career of a petty thief turned drug dealer in 1980's Edinburgh. The title character is a pleasant if misguided young man surviving in a bleak housing estate and aspiring to the trappings of a successful criminal. Unfortunately for him, and for most of the other characters in the mini-series, it is a time of heroin addiction and AIDS. We watch JoJo become ensnared in the drugs scene and his deterioration is both painful to watch and very moving. Robert Carlyle's performance is extraordinarily complex and textured. He is ably supported by Jenny McCrindle, Ewan Stewart and Trainspotting's Kevin McKidd. This isn't the fast-moving MTV drug scene of Trainspotting but a more character-oriented, leisurely look at the human cost of drug addiction. Featured Crew Frank Deasy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Carlyle John Joe 'Jo Jo' McCann Aline Mowat Christine Jenny McCrindle Lorraine Kevin McKidd Basil Patricia Brake Doro Full Cast & Crew Last Season Mini-series 1998 | 4 Episodes Season 1 of Looking After Jo Jo premiered on January 12, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Looking After Jo Jo. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords drug dealer scotland Content Score 93 Almost there... Top Contributors 30 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}