{"link": "https://www.themoviedb.org/tv/20731?language=en", "title": "Magic Grandad", "resume": "Magic Grandad was an educational programme which originally aired on BBC Two under the title 'Switch On, Switch Off' during Schools section of 1993. The show saw 'Magic' Grandad take his young grandchildren back in time, many of the adventures are about comparing the past and the present and seeing how evidence of what happened in the olden days still survives.  \nThe show was said to make learning about history \"fun for youngsters\" and was aimed at children aged 5-7 years. The series was introduced to support the History National Curriculum at Key Stage 1. New seasons have been made periodically to support new areas of the infant history curriculum such as seaside holidays and toys. \nThe early season have a companion booklet of teacher's notes with descriptions of the episodes, various suggestions for follow-up work and photocopiable worksheets.", "rate": 60, "genre": ["Kids"], "cast": ["Sam Kelly"], "character": ["Grandad"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20731   Expand Magic Grandad   (1993) User Score Overview Magic Grandad was an educational programme which originally aired on BBC Two under the title 'Switch On, Switch Off' during Schools section of 1993. The show saw 'Magic' Grandad take his young grandchildren back in time, many of the adventures are about comparing the past and the present and seeing how evidence of what happened in the olden days still survives.   The show was said to make learning about history \"fun for youngsters\" and was aimed at children aged 5-7 years. The series was introduced to support the History National Curriculum at Key Stage 1. New seasons have been made periodically to support new areas of the infant history curriculum such as seaside holidays and toys.  The early season have a companion booklet of teacher's notes with descriptions of the episodes, various suggestions for follow-up work and photocopiable worksheets. Featured Crew Margaret Simpson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Kelly Grandad Full Cast & Crew Last Season More Famous People 2009 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Magic Grandad. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Kids Keywords history educational Content Score 50 Still needs a little work. Top Contributors N 78 Notamymerrick 2 janar 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}