{"link": "https://www.themoviedb.org/tv/8012?language=en", "title": "Beethoven Virus", "resume": "Two musicians who retired from their musical careers for different reasons join together with a demanding and difficult genius conductor to form an orchestra against all odds. Although it requires a lot of hard work to form their orchestra, they keep chasing their dreams of doing what they love the most in the world and this gives them great satisfaction. Three young and old people with different personalities and life experiences gather together under a common dream and they find love and the room to forgive each other as they eventually earn each other’s respect.", "rate": 75, "genre": ["Drama"], "cast": ["Lee Ji-ah", "Nicole Uysiuseng", "Jang Keun-suk", "Kim Myung-min", "Park Cheol-min"], "character": ["Du Ru-mi", "Gun-woo Kwan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8012   Expand Beethoven Virus   (2008) User Score Overview Two musicians who retired from their musical careers for different reasons join together with a demanding and difficult genius conductor to form an orchestra against all odds. Although it requires a lot of hard work to form their orchestra, they keep chasing their dreams of doing what they love the most in the world and this gives them great satisfaction. Three young and old people with different personalities and life experiences gather together under a common dream and they find love and the room to forgive each other as they eventually earn each other’s respect. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Ji-ah Du Ru-mi Nicole Uysiuseng Jang Keun-suk Gun-woo Kwan Kim Myung-min Park Cheol-min Full Cast & Crew Last Season Season 1 2008 | 19 Episodes Season 1 of Beethoven Virus premiered on September 10, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Beethoven Virus. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Beethoven Virus. You can help by rating TV shows you've seen. Facts Original Name  베토벤 바이러스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.imbc.com/broad/tv/drama/thoven/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 18 Elizabeth Jennings LS 5 Lee Seung-Su t 5 tmdb38202327 N 3 Nosirus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}