{"link": "https://www.themoviedb.org/tv/4756?language=en", "title": "The Cape", "resume": "The Cape is an American dramatic TV series, with elements of science fiction, action/adventure, and drama, that was produced for syndication during the 1996–1997 television season. The Cape told the story of select members of the NASA Astronaut Corps at the Kennedy Space Center in Florida with a focus on their personal lives as they train for, and execute, Space Shuttle missions. The series stars Corbin Bernsen as USAF Colonel Henry J. \"Bull\" Eckert, an experienced astronaut who, early in the series, was the Director of Astronaut Training but later in the series was also tasked with the responsibility of Chief of the Astronaut Office.\nThe series focused on authenticity and was filmed in and around Cape Canaveral, Florida. Former astronaut Buzz Aldrin also served as technical consultant.", "rate": 0, "genre": ["Drama"], "cast": ["Whitman Mayo", "Adam Baldwin", "Corbin Bernsen", "Bobbie Phillips", "Cameron Bancroft"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4756   Expand The Cape   (1996) User Score Overview The Cape is an American dramatic TV series, with elements of science fiction, action/adventure, and drama, that was produced for syndication during the 1996–1997 television season. The Cape told the story of select members of the NASA Astronaut Corps at the Kennedy Space Center in Florida with a focus on their personal lives as they train for, and execute, Space Shuttle missions. The series stars Corbin Bernsen as USAF Colonel Henry J. \"Bull\" Eckert, an experienced astronaut who, early in the series, was the Director of Astronaut Training but later in the series was also tasked with the responsibility of Chief of the Astronaut Office. The series focused on authenticity and was filmed in and around Cape Canaveral, Florida. Former astronaut Buzz Aldrin also served as technical consultant. Featured Crew Kary Antholis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Whitman Mayo Adam Baldwin Corbin Bernsen Bobbie Phillips Cameron Bancroft Full Cast & Crew Last Season Season 1 1996 | 22 Episodes Season 1 of The Cape premiered on September  9, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Cape. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  60m, 42m Homepage  - Genres Drama Keywords nasa space astronaut space shuttle space centre Content Score 79 Pump it up! We're close now. Top Contributors 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}