{"link": "https://www.themoviedb.org/tv/3133?language=en", "title": "Doctor Snuggles", "resume": "Doctor Snuggles is an animated television series created by Jeffrey O'Kelly based on original artwork by Nick Price, about a friendly and optimistic inventor named Doctor Snuggles who has unusual adventures with his friends. The show featured fantastical scenarios which usually involved Doctor Snuggles inventing something outlandish such as a robot helper or diamond-making machine, and had a variety of supporting characters who were mostly anthropomorphic animals.", "rate": 66, "genre": ["Animation", "Family", "Kids", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3133   Expand Doctor Snuggles   (1981) User Score Overview Doctor Snuggles is an animated television series created by Jeffrey O'Kelly based on original artwork by Nick Price, about a friendly and optimistic inventor named Doctor Snuggles who has unusual adventures with his friends. The show featured fantastical scenarios which usually involved Doctor Snuggles inventing something outlandish such as a robot helper or diamond-making machine, and had a variety of supporting characters who were mostly anthropomorphic animals. Featured Crew Jeffrey O'Kelly Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1981 | 13 Episodes Season 1 of Doctor Snuggles premiered on June 24, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Doctor Snuggles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  25m, 22m Homepage   http://www.doctorsnuggles.co.uk/ Genres Animation Family Kids Sci-Fi & Fantasy Keywords inventor adventure doctor kids Content Score 64 We're so close, yet so far. Top Contributors V 22 Vivo h 22 hangst S 20 Samara 15 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}