{"link": "https://www.themoviedb.org/tv/9281?language=en", "title": "Chelmsford 123", "resume": "Chelmsford 123 is a British television situation comedy produced for Channel 4 by Hat Trick Productions. It ran for two series, of six and seven episodes, in 1988 and 1990.\nThe series was set in the British town of Chelmsford in the year AD 123, and concerned the power struggle between Roman governor Aulus Paulinus and the British chieftain, Badvoc. Britain is a miserable place, cold and wet – just the place to exile Aulus for accidentally insulting the Emperor's horse, but also give him something useful to do. Aulus, probably a play on Aulus Platorius Nepos, the governor of Roman Britain between 122 and 125, was a rather delicate Roman, who was usually outwitted by the scheming Badvoc, who hadn't had a haircut for twenty-five years. Many of the other regular \"Hat Trick\" actors, previously seen in shows such as Who Dares Wins, also appeared.\nBoth series are now available on 4 on Demand and SeeSaw.\nSeries 1 and 2 was released on DVD by Acorn Media UK on 15 September 2011.", "rate": 80, "genre": ["Comedy"], "cast": ["Neil Pearson", "Jimmy Mulville", "Rory McGrath", "Geoffrey McGivern", "Howard Lew Lewis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9281   Expand Chelmsford 123   (1988) User Score Overview Chelmsford 123 is a British television situation comedy produced for Channel 4 by Hat Trick Productions. It ran for two series, of six and seven episodes, in 1988 and 1990. The series was set in the British town of Chelmsford in the year AD 123, and concerned the power struggle between Roman governor Aulus Paulinus and the British chieftain, Badvoc. Britain is a miserable place, cold and wet – just the place to exile Aulus for accidentally insulting the Emperor's horse, but also give him something useful to do. Aulus, probably a play on Aulus Platorius Nepos, the governor of Roman Britain between 122 and 125, was a rather delicate Roman, who was usually outwitted by the scheming Badvoc, who hadn't had a haircut for twenty-five years. Many of the other regular \"Hat Trick\" actors, previously seen in shows such as Who Dares Wins, also appeared. Both series are now available on 4 on Demand and SeeSaw. Series 1 and 2 was released on DVD by Acorn Media UK on 15 September 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Pearson Jimmy Mulville Rory McGrath Geoffrey McGivern Howard Lew Lewis Full Cast & Crew Last Season Season 2 1990 | 7 Episodes Season 2 of Chelmsford 123 premiered on January  9, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Chelmsford 123. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Comedy Keywords roman empire england sitcom british humour period sitcom roman britain Content Score 86 Almost there... Top Contributors 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}