{"link": "https://www.themoviedb.org/tv/46999?language=en", "title": "The Lost World", "resume": "The Lost World is a 2001 adaptation of the novel by Sir Arthur Conan Doyle, directed by Stuart Orme and adapted by Adrian Hodges. It was filmed at various locations on the West Coast of New Zealand. The film was produced by the BBC and broadcast on BBC1 in the United Kingdom and A&E in the United States. It consisted of two 75 minute episodes which were first aired in the UK on 25 and 26 December 2001, and in the USA on 6 and 7 October 2002. In the DVD version, these two episodes are merged into one full length film. Bob Hoskins played Professor Challenger and was supported by James Fox, Peter Falk, Matthew Rhys, Tom Ward and Elaine Cassidy.", "rate": 74, "genre": ["Drama"], "cast": ["Bob Hoskins", "James Fox", "Tom Ward", "Matthew Rhys", "Elaine Cassidy"], "character": ["Professor Challenger", "Professor Summerlee", "Lord Roxton", "Edward Malone", "Agnes Cluny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46999   Expand The Lost World   (2002) User Score Overview The Lost World is a 2001 adaptation of the novel by Sir Arthur Conan Doyle, directed by Stuart Orme and adapted by Adrian Hodges. It was filmed at various locations on the West Coast of New Zealand. The film was produced by the BBC and broadcast on BBC1 in the United Kingdom and A&E in the United States. It consisted of two 75 minute episodes which were first aired in the UK on 25 and 26 December 2001, and in the USA on 6 and 7 October 2002. In the DVD version, these two episodes are merged into one full length film. Bob Hoskins played Professor Challenger and was supported by James Fox, Peter Falk, Matthew Rhys, Tom Ward and Elaine Cassidy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Hoskins Professor Challenger James Fox Professor Summerlee Tom Ward Lord Roxton Matthew Rhys Edward Malone Elaine Cassidy Agnes Cluny Full Cast & Crew Last Season Season 1 2002 | 2 Episodes Season 1 of The Lost World premiered on January  1, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   Little Lord Fauntleroy 6.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  75m Homepage   http://www.bbc.co.uk/drama/lostworld/ Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors e 29 elbows_selbo R 7 Rebecca k 3 karina_petrova e 3 egbertbos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}