{"link": "https://www.themoviedb.org/tv/35524?language=en", "title": "Charlemagne", "resume": "Charlemagne, le prince à cheval is a 1993 television miniseries about the life of Charlemagne. It consists of five episodes and covers the period from the death of his father, Pepin the Short in AD 768 until Charlemagne's corronation as the first Holy Roman Emperor on Christmas Day, AD 800. However, there is a minor chronological anachronism: in an earlier episode, we see Widukind, the king of the Saxons surrender and convert to Christianity, which didn't happen until AD 803.\nThis program was directed by Clive Donner and based primarily on the contemporary biography of Charlemagne written by Einhard, who knew Charlemagne personally.", "rate": 90, "genre": ["Action", "Adventure", "Drama"], "cast": ["Christian Brendel", "Anny Duperey", "Pierre Anais", "Xavier Deluc", "Vanni Corbellini"], "character": ["Charlemagne", "Bertha", "Turpin", "Roland", "Ganelon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35524   Expand Charlemagne   (1993) User Score Overview Charlemagne, le prince à cheval is a 1993 television miniseries about the life of Charlemagne. It consists of five episodes and covers the period from the death of his father, Pepin the Short in AD 768 until Charlemagne's corronation as the first Holy Roman Emperor on Christmas Day, AD 800. However, there is a minor chronological anachronism: in an earlier episode, we see Widukind, the king of the Saxons surrender and convert to Christianity, which didn't happen until AD 803. This program was directed by Clive Donner and based primarily on the contemporary biography of Charlemagne written by Einhard, who knew Charlemagne personally. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christian Brendel Charlemagne Anny Duperey Bertha Pierre Anais Turpin Xavier Deluc Roland Vanni Corbellini Ganelon Full Cast & Crew Last Season Season 1 1993 | 3 Episodes Season 1 of Charlemagne premiered on February 27, 1993. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Charlemagne. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Charlemagne. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Action & Adventure Drama Keywords loss of loved one pope medieval times Content Score 71 Just a little bit more... Top Contributors L 30 Lemmy_6 22 Banana TB 19 TMDb Bot V 5 VintageSmoke  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}