{"link": "https://www.themoviedb.org/tv/2382?language=en", "title": "Freaks and Geeks", "resume": "High school mathlete Lindsay Weir rebels and begins hanging out with a crowd of burnouts (the \"freaks\"), while her brother Sam Weir navigates a different part of the social universe with his nerdy friends (the \"geeks\").", "rate": 83, "genre": ["Comedy", "Drama"], "cast": ["Linda Cardellini", "John Francis Daley", "James Franco", "Samm Levine", "Seth Rogen"], "character": ["Lindsay Weir", "Sam Weir", "Daniel Desario", "Neal Schweiber", "Ken Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2382   Expand Freaks and Geeks   (1999) User Score  Play Trailer Overview High school mathlete Lindsay Weir rebels and begins hanging out with a crowd of burnouts (the \"freaks\"), while her brother Sam Weir navigates a different part of the social universe with his nerdy friends (the \"geeks\"). Featured Crew Paul Feig Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  14 Content Issues  3 Images Backdrops  9 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Linda Cardellini Lindsay Weir John Francis Daley Sam Weir James Franco Daniel Desario Samm Levine Neal Schweiber Seth Rogen Ken Miller Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 1 1999 | 18 Episodes Season 1 of Freaks and Geeks premiered on September 24, 1999. View All Seasons Social Reviews  1 Discussions  17 f A review by fcsuper  9.0 Written by  fcsuper  on June 11, 2017 Great ensemble cast and stories that captured high school life for the outcasts.  Though the setting was supposed to be 1980-ish, the writing never quiet pulls that off.  Believe it or not, something set in 1980 should feel more like the 1970's rather than stereotypical 80's.  However, in the case of this show, it actually feels more like early 1990's high school experience.  Even still, it's a great show that hits both the funny and the feels very well. Read All Reviews Media Most Popular Videos  1 Backdrops  9 Posters  5 Recommendations   2001-09-25 Undeclared 7.2    2003-11-02 Arrested Development 8.2    2009-04-09 Parks and Recreation 7.9    2001-07-09 The Office 8.1    2009-09-17 Community 7.9    1998-08-23 That '70s Show 7.4    1999-09-24 Spaced 8.1    2000-10-15 Curb Your Enthusiasm 8.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 44m Homepage  - Genres Comedy Drama Keywords high school retro teen drama 1980s Content Score 100 Yes! Looking good! Top Contributors 14 Banana 13 isavedtheday 6 Elizabeth Jennings m 6 movie28  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}