{"link": "https://www.themoviedb.org/tv/2597?language=en", "title": "You've Been Framed!", "resume": "You've Been Framed! is a British television comedy show, produced by ITV Studios for ITV where viewers send in humorous home videos. It is currently narrated by the comedian Harry Hill.\nDuring the show, the video clips are played and the people who sent them in receive £250. Before the advert break, a \"What happens next?\" competition, where the viewers have to guess what happens after a clip is frozen, or \"Framed Gold Records\" competition, where viewers have to guess how many times something can happen before something else happens, or \"Are You A Cry Baby? Maybe\" competition, where viewers guess if there will be tears before bedtime, is played. The answer is revealed after the break.", "rate": 90, "genre": ["Comedy"], "cast": ["Lisa Riley", "Jeremy Beadle", "Harry Hill", "Jonathan Wilkes"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2597   Expand You've Been Framed!   (1990) User Score Overview You've Been Framed! is a British television comedy show, produced by ITV Studios for ITV where viewers send in humorous home videos. It is currently narrated by the comedian Harry Hill. During the show, the video clips are played and the people who sent them in receive £250. Before the advert break, a \"What happens next?\" competition, where the viewers have to guess what happens after a clip is frozen, or \"Framed Gold Records\" competition, where viewers have to guess how many times something can happen before something else happens, or \"Are You A Cry Baby? Maybe\" competition, where viewers guess if there will be tears before bedtime, is played. The answer is revealed after the break. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Riley Jeremy Beadle Harry Hill Jonathan Wilkes Full Cast & Crew Last Season You've been framed season 19 — | 29 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on You've Been Framed!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.itv.com/framed/ Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}