{"link": "https://www.themoviedb.org/tv/73610?language=en", "title": "Mike Judge Presents: Tales From the Tour Bus", "resume": "The raucous adventures of some of music’s most legendary artists, as told by those who knew them best. Featuring animated interviews with former bandmates, friends and other erstwhile associates, who share uncensored anecdotes about these artists, brought to life with animated reenactments and woven together with live-action archival performance footage and photos.", "rate": 70, "genre": ["Comedy", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73610   Expand Mike Judge Presents: Tales From the Tour Bus   (2017) User Score  Play Trailer Overview The raucous adventures of some of music’s most legendary artists, as told by those who knew them best. Featuring animated interviews with former bandmates, friends and other erstwhile associates, who share uncensored anecdotes about these artists, brought to life with animated reenactments and woven together with live-action archival performance footage and photos. Featured Crew Mike Judge Creator Richard Mullins Creator Dub Cornett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mike Judge Presents: Tales From the Tour Bus. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  27m Homepage   https://www.cinemax.com/mike-judge-presents-tales-from-the-tour-bus Genres Comedy Animation Keywords country music tour bus Content Score 71 Just a little bit more... Top Contributors 52 Elizabeth Jennings s 3 speedycars a 3 arcaida TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}