{"link": "https://www.themoviedb.org/tv/67245?language=en", "title": "Gravitation: Lyrics of Love", "resume": "Bad Luck's lead singer and lyricist, Shuichi Shindo, is a total wreck. With deadlines for the band's next album looming, the pressure is on, but the normally energetic Shuichi has become listless and fallen into a writing slump. It's all because Yuki - the great love of his life - has suddenly become cold and distant. Depressed and anxious, Shuichi doesn't want to think about lyrics, he just wants to know how to get Yuki to talk to him!\nNow, thanks to Shuichi's big mouth bragging to the press about how talented he is, the band can't even hire someone else to write the lyrics for them. If they don't manage to break Shuichi out of his slump soon, it could mean the end of Bad Luck for good!", "rate": 60, "genre": ["Animation"], "cast": ["Tomokazu Seki", "Kazuhiko Inoue", "Fujiko Takimoto", "Yasunori Matsumoto", "Kappei Yamaguchi"], "character": ["Shuichi Shindo (voice)", "Eiri Yuki (voice)", "Suguru Fujisaki (voice)", "Hiroshi Nagano (voice)", "Ryuichi Sakuma (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67245   Expand Gravitation: Lyrics of Love   (1999) User Score Overview Bad Luck's lead singer and lyricist, Shuichi Shindo, is a total wreck. With deadlines for the band's next album looming, the pressure is on, but the normally energetic Shuichi has become listless and fallen into a writing slump. It's all because Yuki - the great love of his life - has suddenly become cold and distant. Depressed and anxious, Shuichi doesn't want to think about lyrics, he just wants to know how to get Yuki to talk to him! Now, thanks to Shuichi's big mouth bragging to the press about how talented he is, the band can't even hire someone else to write the lyrics for them. If they don't manage to break Shuichi out of his slump soon, it could mean the end of Bad Luck for good! Featured Crew Maki Murakami Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomokazu Seki Shuichi Shindo (voice) Kazuhiko Inoue Eiri Yuki (voice) Fujiko Takimoto Suguru Fujisaki (voice) Yasunori Matsumoto Hiroshi Nagano (voice) Kappei Yamaguchi Ryuichi Sakuma (voice) Full Cast & Crew Last Season Gravitation: Lyrics of Love 1999 | 2 Episodes Season 1 of Gravitation: Lyrics of Love premiered on July 23, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gravitation: Lyrics of Love. You can help by rating TV shows you've seen. Facts Original Name  グラビテーション Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  1m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors t 38 tmdb983464 t 4 themeesh13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}