{"link": "https://www.themoviedb.org/tv/71694?language=en", "title": "Snowfall", "resume": "Los Angeles. 1983. A storm is coming and it's name is crack. Set against the infancy of the crack cocaine epidemic and its ultimate radical impact on the culture as we know it, the story follows numerous characters on a violent collision course.", "rate": 75, "genre": ["Crime", "Drama"], "cast": ["Damson Idris", "Carter Hudson", "Isaiah John", "Emily Rios", "Sergio Peris-Mencheta"], "character": ["Franklin Saint", "Teddy McDonald", "Leon Simmons", "Lucia Villanueva", "Gustavo Zapata"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71694   Expand Snowfall   (2017) User Score  Play Trailer Overview Los Angeles. 1983. A storm is coming and it's name is crack. Set against the infancy of the crack cocaine epidemic and its ultimate radical impact on the culture as we know it, the story follows numerous characters on a violent collision course. Featured Crew John Singleton Creator Eric Amadio Creator Dave Andron Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  14 Posters  7 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Damson Idris Franklin Saint Carter Hudson Teddy McDonald Isaiah John Leon Simmons Emily Rios Lucia Villanueva Sergio Peris-Mencheta Gustavo Zapata Full Cast & Crew Next Season Season 2 2018 | 1 Episode Season 2 of Snowfall is set to premiere on July 19, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply t Oh so it was a BLACK man that started the crack epidemic Open 2 by  JD Season 1, Episode 3 Open 1 by  JD Go to Discussions Media Most Popular Videos  2 Backdrops  14 Posters  7 Recommendations   2018-02-11 Here and Now 7.7    2017-04-05 Brockmire 7.2    2017-11-05 SMILF 6.7    2017-09-10 The Deuce 7.9    2017-10-01 Ten Days in the Valley 6.0    2017-10-09 Valor 6.3    2017-09-27 SEAL Team 6.6    2017-11-07 Damnation 7.2  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  42m Homepage   http://www.fxnetworks.com/shows/snowfall Genres Crime Drama Keywords crack cocaine crime drugs Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings p 23 plumpro 10 Monstaki TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}