{"link": "https://www.themoviedb.org/tv/56629?language=en", "title": "The Dust Bowl", "resume": "Chronicles the worst man-made ecological disaster in American history, in which the frenzied wheat boom of the Great Plow-Up, followed by a decade-long drought during the 1930s nearly swept away the breadbasket of the nation.", "rate": 80, "genre": ["Documentary"], "cast": ["Patricia Clarkson", "Peter Coyote", "Carolyn McCormick"], "character": ["Hazel Lucas Shaw", "Peter Coyote", "Caroline Henderson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56629   Expand The Dust Bowl   (2012) User Score Overview Chronicles the worst man-made ecological disaster in American history, in which the frenzied wheat boom of the Great Plow-Up, followed by a decade-long drought during the 1930s nearly swept away the breadbasket of the nation. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patricia Clarkson Hazel Lucas Shaw Peter Coyote Peter Coyote Carolyn McCormick Caroline Henderson Full Cast & Crew Last Season Season 1 2012 | 2 Episodes Season 1 of The Dust Bowl premiered on November 18, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1983-01-17 Frontline 8.1    1984-09-20 The Cosby Show 6.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   http://pbs.org/show/dust-bowl/ Genres Documentary Keywords great depression dust storm 1930s Content Score 56 We're so close, yet so far. Top Contributors 14 Banana TB 8 TMDb Bot L 5 LightItUp40  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}