{"link": "https://www.themoviedb.org/tv/35369?language=en", "title": "Working Class", "resume": "Working Class is an American television sitcom created by Jill Cargerman, which premiered on CMT on January 28, 2011. The network ordered twelve episodes for the comedy, which is the first scripted series for the network.\nOn April 11, 2011, CMT cancelled Working Class after only one season due to low ratings.", "rate": 50, "genre": ["Comedy"], "cast": ["Melissa Peterman", "Ed Asner", "Lachlan Buchanan", "Patrick Fabian", "Ryan Stiles"], "character": ["Carli Mitchell", "Hank Greziak", "Scott Mitchell", "Rob Parker", "Dr. Edwin Gould DDS"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35369   Expand Working Class   (2011) User Score Overview Working Class is an American television sitcom created by Jill Cargerman, which premiered on CMT on January 28, 2011. The network ordered twelve episodes for the comedy, which is the first scripted series for the network. On April 11, 2011, CMT cancelled Working Class after only one season due to low ratings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melissa Peterman Carli Mitchell Ed Asner Hank Greziak Lachlan Buchanan Scott Mitchell Patrick Fabian Rob Parker Ryan Stiles Dr. Edwin Gould DDS Full Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of Working Class premiered on January 28, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Working Class. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 20m Homepage   http://www.cmt.com/show/working_class/series.jhtml Genres Comedy Keywords single mother sitcom Content Score 86 Almost there... Top Contributors 12 Banana 3 Zlogorek 1 Elizabeth Jennings s 1 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}