{"link": "https://www.themoviedb.org/tv/80210?language=en", "title": "Rig 45", "resume": "When Andrea, a damage regulator from Benthos Oil, is sent out to Rig 45 two days before Christmas to investigate a fatal accident, the rig is hit by a hurricane and all communications lost. Soon, the crew realize that the accident is in fact a murder, and they now know that they are in real danger.", "rate": 0, "genre": [], "cast": ["Catherine Walker", "Gary Lewis", "David Dencik", "Jakob Oftebro", "Björn Bengtsson"], "character": ["Andrea"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80210   Expand Rig 45   (2018) User Score Overview When Andrea, a damage regulator from Benthos Oil, is sent out to Rig 45 two days before Christmas to investigate a fatal accident, the rig is hit by a hurricane and all communications lost. Soon, the crew realize that the accident is in fact a murder, and they now know that they are in real danger. Featured Crew Per Hanefjord Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Catherine Walker Andrea Gary Lewis David Dencik Jakob Oftebro Björn Bengtsson Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Rig 45 premiered on June  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rig 45. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   https://viaplay.se/serier/rig-45 Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors C 34 CyberScream 15 Elizabeth Jennings 3 vacdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}