{"link": "https://www.themoviedb.org/tv/39303?language=en", "title": "Expedition Impossible", "resume": "Expedition Impossible is a 2011 American reality television series. The series follows thirteen teams of three competitors as they \"solve problems while racing across deserts, over mountains and through rivers\" across the nation of Morocco. The first team to cross the finish line after completing the ten stages of the competition will receive US$150,000. In addition, each team member will win a new Ford Explorer.\nCreated by producer Mark Burnett and hosted by wildlife expert Dave Salmoni, the series premiered on ABC on June 23, 2011, to mild critical response.", "rate": 60, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39303   Expand Expedition Impossible   (2011) User Score Overview Expedition Impossible is a 2011 American reality television series. The series follows thirteen teams of three competitors as they \"solve problems while racing across deserts, over mountains and through rivers\" across the nation of Morocco. The first team to cross the finish line after completing the ten stages of the competition will receive US$150,000. In addition, each team member will win a new Ford Explorer. Created by producer Mark Burnett and hosted by wildlife expert Dave Salmoni, the series premiered on ABC on June 23, 2011, to mild critical response. Featured Crew Mark Burnett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of Expedition Impossible premiered on June 23, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Expedition Impossible. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.abc.go.com/shows/expedition-impossible/index Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 4 zurman1 1 Michael 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}