{"link": "https://www.themoviedb.org/tv/7502?language=en", "title": "The Dome", "resume": "The Dome is a German television program and music event, produced and broadcast by RTL 2. Roughly every three months, a new show is recorded in an event hall in different cities in Germany and Austria. In each episode, several national, but also international bands and musicians perform their recent songs in front of a crowd of 5,000 to 15,000 people. Additionally, a compilation album is published when a new episode of The Dome is broadcast.", "rate": 0, "genre": ["Talk"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7502   Expand The Dome   (1997) User Score Overview The Dome is a German television program and music event, produced and broadcast by RTL 2. Roughly every three months, a new show is recorded in an event hall in different cities in Germany and Austria. In each episode, several national, but also international bands and musicians perform their recent songs in front of a crowd of 5,000 to 15,000 people. Additionally, a compilation album is published when a new episode of The Dome is broadcast. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 12 2009 | 2 Episodes Season 12 of The Dome premiered on March  7, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Dome. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Dome. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  German Runtime  180m Homepage   http://www.thedome.de/ Genres Talk Keywords music live performance entertainment Content Score 50 Still needs a little work. Top Contributors 15 tobim91 N 8 NoemiTalavera 5 lineker TB 3 Tinto Brass  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}