{"link": "https://www.themoviedb.org/tv/74731?language=en", "title": "Or time is now", "resume": "Stockholm, the day of peace in Europe 1945. A spontaneous kiss between two strangers, during the celebration at Kungsgatan, will have major consequences.", "rate": 80, "genre": ["Drama"], "cast": ["Hedda Stiernstedt", "Charlie Gustafsson", "Suzanne Reuter", "Mattias Nordkvist", "Adam Lundgren"], "character": ["Nina", "Calle", "Helga", "Gustaf", "Peter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74731   Expand Or time is now   (2017) User Score Overview Stockholm, the day of peace in Europe 1945. A spontaneous kiss between two strangers, during the celebration at Kungsgatan, will have major consequences. Featured Crew Ulf Kvensler Creator Malin Nevander Creator Johan Rosenlind Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hedda Stiernstedt Nina Charlie Gustafsson Calle Suzanne Reuter Helga Mattias Nordkvist Gustaf Adam Lundgren Peter Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Or time is now premiered on October 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Or time is now. You can help by rating TV shows you've seen. Facts Original Name  Vår tid är nu Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Swedish Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors C 14 CyberScream jp 13 juan perez 11 Elizabeth Jennings z 5 zelenya  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}