{"link": "https://www.themoviedb.org/tv/6076?language=en", "title": "Marion and Geoff", "resume": "Marion and Geoff is a BBC television mockumentary, produced by Baby Cow Productions and screened on BBC Two in 2000, with a second series following in 2003. The series starred Rob Brydon as Keith Barret, a naïve taxicab driver going through a messy divorce from his wife, Marion, who, though he fails to realise it, has had a long-standing affair with her work colleague, Geoff. Each episode is presented as a monologue, filmed by a fixed camera in the confines of his cab.\nThe series were written by Brydon and Hugo Blick, and produced and directed by Blick. The associate producer was Steve Coogan.\nThe script is written in such a way that the viewer can pick up on clues that Keith has not himself deciphered. Numerous references are made to one of \"his\" children not resembling him very strongly, an obvious hint that one of the children he loves so dearly is not his own, but in fact Geoff's. Keith also gives clues in the first series about his wife's activities—the viewer knows about Marion's affair long before he works it out himself.\nKeith's character is affectionately portrayed as a harmless simpleton and draws a great deal of sympathy as the series progresses. He is in denial about his divorce, and somehow always manages to look on the positive side of even the most depressing situation. Although he doesn't realise it, his life revolves around Marion and her new partner Geoff, and his love for his \"little smashers\". Despite his faults, Keith is an honest and kind man.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["Rob Brydon"], "character": ["Keith Barret"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6076   Expand Marion and Geoff   (2000) User Score Overview Marion and Geoff is a BBC television mockumentary, produced by Baby Cow Productions and screened on BBC Two in 2000, with a second series following in 2003. The series starred Rob Brydon as Keith Barret, a naïve taxicab driver going through a messy divorce from his wife, Marion, who, though he fails to realise it, has had a long-standing affair with her work colleague, Geoff. Each episode is presented as a monologue, filmed by a fixed camera in the confines of his cab. The series were written by Brydon and Hugo Blick, and produced and directed by Blick. The associate producer was Steve Coogan. The script is written in such a way that the viewer can pick up on clues that Keith has not himself deciphered. Numerous references are made to one of \"his\" children not resembling him very strongly, an obvious hint that one of the children he loves so dearly is not his own, but in fact Geoff's. Keith also gives clues in the first series about his wife's activities—the viewer knows about Marion's affair long before he works it out himself. Keith's character is affectionately portrayed as a harmless simpleton and draws a great deal of sympathy as the series progresses. He is in denial about his divorce, and somehow always manages to look on the positive side of even the most depressing situation. Although he doesn't realise it, his life revolves around Marion and her new partner Geoff, and his love for his \"little smashers\". Despite his faults, Keith is an honest and kind man. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Brydon Keith Barret Full Cast & Crew Last Season Season 2 2003 | 6 Episodes Season 2 of Marion and Geoff premiered on January 29, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Marion and Geoff. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m, 10m Homepage  - Genres Comedy Drama Keywords mockumentary cab driver british humour affair Content Score 56 We're so close, yet so far. Top Contributors O 8 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}