{"link": "https://www.themoviedb.org/tv/2618?language=en", "title": "Ivor the Engine", "resume": "Ivor the Engine is a British children's animation by Oliver Postgate and Peter Firmin's Smallfilms company. It is a children's television series relating the adventures of a small green locomotive who lived in the \"top left-hand corner of Wales\" and worked for The Merioneth and Llantisilly Railway Traction Company Limited. His friends included Jones the Steam, Evans the Song and Dai Station, among many other characters.", "rate": 0, "genre": ["Animation"], "cast": ["Oliver Postgate", "Anthony Jackson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2618   Expand Ivor the Engine User Score Overview Ivor the Engine is a British children's animation by Oliver Postgate and Peter Firmin's Smallfilms company. It is a children's television series relating the adventures of a small green locomotive who lived in the \"top left-hand corner of Wales\" and worked for The Merioneth and Llantisilly Railway Traction Company Limited. His friends included Jones the Steam, Evans the Song and Dai Station, among many other characters. Featured Crew Oliver Postgate Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oliver Postgate Anthony Jackson Full Cast & Crew Last Season (1958) season 4 1975 | 20 Episodes Season 4 of Ivor the Engine premiered on June 26, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}