{"link": "https://www.themoviedb.org/tv/74689?language=en", "title": "OCTB", "resume": "Undercover detective Chen Feng Xiang in a crack after a large group of cadres transferred to civilian, but in eight years after being an anti-black group to recapture. As the current rivers and lakes on the most troublesome triad leader are Chen Feng Xiang then younger brother Zhang Zhi Qiang, Feng Xiang re-out of the \"rivers and lakes.\" He joined Zhang Shaojun led by the anti-black team and the new villain tostart dealing with the hands of the old friends and enemies, which makes Feng Xiang once dilemma. There are three years since the return of Hong Kong, gangs intend to take advantage of a big ticket. Feng Xiang in the investigation of a case of the disappearance of the leader, but found a century of Hong Kong triad history of the shaking big conspiracy.", "rate": 75, "genre": ["Crime", "Action", "Adventure"], "cast": ["Jordan Chan", "Danny Chan Kwok-Kwan", "Sam Lee", "Ken Wong", "Samuel Pang"], "character": ["陳鳳翔", "張少鈞", "黃志安", "老鬼", "劉振鵬"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74689   Expand OCTB   (2017) User Score Overview Undercover detective Chen Feng Xiang in a crack after a large group of cadres transferred to civilian, but in eight years after being an anti-black group to recapture. As the current rivers and lakes on the most troublesome triad leader are Chen Feng Xiang then younger brother Zhang Zhi Qiang, Feng Xiang re-out of the \"rivers and lakes.\" He joined Zhang Shaojun led by the anti-black team and the new villain tostart dealing with the hands of the old friends and enemies, which makes Feng Xiang once dilemma. There are three years since the return of Hong Kong, gangs intend to take advantage of a big ticket. Feng Xiang in the investigation of a case of the disappearance of the leader, but found a century of Hong Kong triad history of the shaking big conspiracy. Featured Crew Sung Boon-Chung Creator Paul Chung Shing-Yuen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jordan Chan 陳鳳翔 Danny Chan Kwok-Kwan 張少鈞 Sam Lee 黃志安 Ken Wong 老鬼 Samuel Pang 劉振鵬 Full Cast & Crew Last Season Season 1 2017 | 30 Episodes Season 1 of OCTB premiered on September 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on OCTB. You can help by rating TV shows you've seen. Facts Original Name  反黑 Status  Ended Network Certification  - Type  Scripted Original Language  Cantonese Runtime  45m Homepage  - Genres Crime Action & Adventure Keywords police cop suspense crime Content Score 93 Almost there... Top Contributors B 80 BarryLin 5 friend-series.com j 1 jolypip  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}