{"link": "https://www.themoviedb.org/tv/67037?language=en", "title": "Final Fantasy: Legend of the Crystals", "resume": "A continuation of the events from Final Fantasy V. 200 years after Batz and his friends saved two worlds from the threat of ExDeath, a threat arises and seeks to take the Crystals for itself. Linaly, a descendant of Batz, and her friend/protector Pretz journey to the Temple Of Wind to seek the source of this new danger.", "rate": 100, "genre": ["Animation"], "cast": ["Kenichi Ogata", "Etsuko Kozakura", "Fumi Hirano", "Hiroaki Ishikawa", "Hiroko Kasahara"], "character": ["Ra Devil (voice)", "Mid (voice)", "Rouge (voice)", "Cid (voice)", "Queen Lena (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67037   Expand Final Fantasy: Legend of the Crystals   (1994) User Score  Play Trailer Overview A continuation of the events from Final Fantasy V. 200 years after Batz and his friends saved two worlds from the threat of ExDeath, a threat arises and seeks to take the Crystals for itself. Linaly, a descendant of Batz, and her friend/protector Pretz journey to the Temple Of Wind to seek the source of this new danger. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenichi Ogata Ra Devil (voice) Etsuko Kozakura Mid (voice) Fumi Hirano Rouge (voice) Hiroaki Ishikawa Cid (voice) Hiroko Kasahara Queen Lena (voice) Full Cast & Crew Last Season Final Fantasy: Legend of the Crystals 1994 | 4 Episodes Season 1 of Final Fantasy: Legend of the Crystals premiered on March 21, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  8 Recommendations We don't have enough data to suggest any TV shows based on Final Fantasy: Legend of the Crystals. You can help by rating TV shows you've seen. Facts Original Name  ファイナルファンタジー Status  Ended Networks - Certification  - Type  Miniseries Original Language  Japanese Runtime  30m Homepage   http://www.madhouse.co.jp/ Genres Animation Keywords video game based on video game anime style anime Content Score 93 Almost there... Top Contributors TB 32 TMDb Bot t 32 tmdb983464 N 7 NecroC R 6 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}