{"link": "https://www.themoviedb.org/tv/42093?language=en", "title": "The Diamond Hunters", "resume": "Johnny, Benedict and Tracy grew up on the coast of South Africa, where their father, Jacob van der Byl, owns a diamond mine. While Johnny and Tracy are very close, Benedict and Johnny—who is not Jacob's biological son—are engaged in a continual rivalry. When Jacob dies, Benedict and Tracy inherit the entire fortune, while Johnny gets one third of the family firm.", "rate": 45, "genre": [], "cast": ["Alyssa Milano", "Roy Scheider", "Sean Patrick Flanery", "Jolene Blalock", "Armin Rohde"], "character": ["Tracey Van der Byl", "Jacobus Van der Byl", "Johnny Lance", "Ruby Grange"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42093   Expand The Diamond Hunters   (2001) User Score Overview Johnny, Benedict and Tracy grew up on the coast of South Africa, where their father, Jacob van der Byl, owns a diamond mine. While Johnny and Tracy are very close, Benedict and Johnny—who is not Jacob's biological son—are engaged in a continual rivalry. When Jacob dies, Benedict and Tracy inherit the entire fortune, while Johnny gets one third of the family firm. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alyssa Milano Tracey Van der Byl Roy Scheider Jacobus Van der Byl Sean Patrick Flanery Johnny Lance Jolene Blalock Ruby Grange Armin Rohde Full Cast & Crew Last Season Miniseries 2001 | 2 Episodes Season 1 of The Diamond Hunters premiered on January  1, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on The Diamond Hunters. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  120m Homepage   http://betafilm.com/en/product/d/the-diamond-hunters.html Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 18 TMDb Bot 13 Banana d 6 denis w 4 waterhorse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}