{"link": "https://www.themoviedb.org/tv/66237?language=en", "title": "Ready for Start", "resume": "Based on writer Lee Hyeon-min's original web-toon which had more than 1 million views a day when it was published on Naver, this black comedy is about the daily lives of employees in an advertisement agency and their competitive working environment.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Baek Sung-hyun", "Lee Dae-yeon", "Lee Hyang-sook"], "character": ["Kim Byung Chul", "Han Duk Bae", "Deputy Lee Il-soon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66237   Expand Ready for Start   (2016) User Score Overview Based on writer Lee Hyeon-min's original web-toon which had more than 1 million views a day when it was published on Naver, this black comedy is about the daily lives of employees in an advertisement agency and their competitive working environment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Baek Sung-hyun Kim Byung Chul Lee Dae-yeon Han Duk Bae Lee Hyang-sook Deputy Lee Il-soon Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Ready for Start premiered on January 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ready for Start. You can help by rating TV shows you've seen. Facts Original Name  질풍기획 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  15m Homepage   http://tvcast.naver.com/jilpoong/ Genres Comedy Drama Keywords korea Content Score 56 We're so close, yet so far. Top Contributors t 32 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}