{"link": "https://www.themoviedb.org/tv/61017?language=en", "title": "Bodyguard Girl", "resume": "Bodyguard girls from Opus is the story of \"Isra\" son of the Nawab family. He is faced with malice form the surrounding environment due to his families wealth and status. No one will trust him at all. As things move through various dangers he meets a girl named \"Prairie Stone\", which she has served before as a bodyguard swears to protect him, to protect the hunted to help them survive. Will they love amidst the dangerous city.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Kantapong Bamrungrak", "Puntitha Puwijarn Cowell", "Arnas Lapanich", "Paule Sittinawawit", "Kanya Rattapetch"], "character": ["Det", "Bodyguard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61017   Expand Bodyguard Girl   (2013) User Score  Play Trailer Overview Bodyguard girls from Opus is the story of \"Isra\" son of the Nawab family. He is faced with malice form the surrounding environment due to his families wealth and status. No one will trust him at all. As things move through various dangers he meets a girl named \"Prairie Stone\", which she has served before as a bodyguard swears to protect him, to protect the hunted to help them survive. Will they love amidst the dangerous city. Featured Crew Sophee Punnarai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kantapong Bamrungrak Det Puntitha Puwijarn Cowell Bodyguard Arnas Lapanich Paule Sittinawawit Kanya Rattapetch Full Cast & Crew Last Season Season 1 2013 | 15 Episodes Season 1 of Bodyguard Girl premiered on January  1, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bodyguard Girl. You can help by rating TV shows you've seen. Facts Original Name  บอดี้การ์ดสาว Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  99m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 42 Crip 6 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}