{"link": "https://www.themoviedb.org/tv/43856?language=en", "title": "Mistresses", "resume": "Meet Savi, a successful career woman working toward the next phase in her life -- both professional and personal -- simultaneously bucking for partner at her law firm while she and her husband, Harry, try to start a family of their own. Savi's free-spirited and capricious baby sister, Josselyn, couldn't be more different - living single, serial dating and partying, and regularly leaning on her big sister along the way. Their common best friend, April, a recent widow and mother of two, is rebuilding her life after tragedy and learning to move forward, with the support and guidance of her closest girlfriends. And friend Karen, a successful therapist with her own practice, reconnects with the girls after her involvement in a complicated relationship with a patient goes far too deep.", "rate": 48, "genre": ["Mystery", "Drama"], "cast": ["Alyssa Milano", "Yunjin Kim", "Rochelle Aytes", "Brett Tucker", "Jason George"], "character": ["Savannah 'Savi' Davis", "Karen Kim", "April Malloy", "Harry Davis", "Dominic Taylor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43856   Expand Mistresses   (2013) User Score Overview Meet Savi, a successful career woman working toward the next phase in her life -- both professional and personal -- simultaneously bucking for partner at her law firm while she and her husband, Harry, try to start a family of their own. Savi's free-spirited and capricious baby sister, Josselyn, couldn't be more different - living single, serial dating and partying, and regularly leaning on her big sister along the way. Their common best friend, April, a recent widow and mother of two, is rebuilding her life after tragedy and learning to move forward, with the support and guidance of her closest girlfriends. And friend Karen, a successful therapist with her own practice, reconnects with the girls after her involvement in a complicated relationship with a patient goes far too deep. Featured Crew K.J. Steinberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alyssa Milano Savannah 'Savi' Davis Yunjin Kim Karen Kim Rochelle Aytes April Malloy Brett Tucker Harry Davis Jason George Dominic Taylor Full Cast & Crew Last Season Season 4 2016 | 13 Episodes Season 4 of Mistresses premiered on May 30, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  5 Recommendations   2014-09-30 Happyland 3.3    2014-07-08 Finding Carter 5.6    2014-07-17 Satisfaction 5.0    2012-03-04 GCB 5.3    2013-06-23 Devious Maids 5.8    2015-09-29 The Grinder 6.6    2014-06-29 Reckless 5.5    2014-04-14 Taxi Brooklyn 4.6  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/mistresses Genres Mystery Drama Keywords secret cheating relationship problems extramarital affair Content Score 93 Almost there... Top Contributors 47 Elizabeth Jennings 21 lineker 15 Banana j 8 jnylen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}