{"link": "https://www.themoviedb.org/tv/39504?language=en", "title": "In with the Flynns", "resume": "In with the Flynns is a British sitcom created by Caryn Mandabach, produced by Caryn Mandabach Productions, and broadcast by the BBC. The first series began broadcast on 8 June 2011 for six episodes on BBC One and in high definition on BBC One HD in the United Kingdom. It is an adaptation of the American series Grounded for Life.\nSet in Manchester in northern England, the series stars Will Mellor as Liam Flynn, Niky Wardley as his wife Caroline, and Nadine Rose Mulkerrin, Daniel Rogers, and Lorenzo Rodriguez as their children, Chloe, Steve, and Mikey. Other characters include Liam's brother Tommy and Liam and Tommy's father Jim.\nOriginally given the working title of Meet the Doyles, this was changed during production. The theme song is \"For Anyone\" by the band Beady Eye.\nOn 22 December 2011, Will Mellor confirmed in an interview that the show had been given a second series, which was filmed and broadcast in 2012. Taping took place at the new MediaCityUK in Salford and the second series, of six episodes, began on BBC One on 17 August 2012.\nOn 30 October 2012, it was reported that BBC One had cancelled In With The Flynns.", "rate": 0, "genre": ["Comedy"], "cast": ["Will Mellor", "Niky Wardley", "Warren Clarke", "Annabelle Apsion", "Orla Poole"], "character": ["Liam Flynn", "Caroline Flynn,", "Jim Flynn", "Chloe Flynn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39504   Expand In with the Flynns   (2011) User Score Overview In with the Flynns is a British sitcom created by Caryn Mandabach, produced by Caryn Mandabach Productions, and broadcast by the BBC. The first series began broadcast on 8 June 2011 for six episodes on BBC One and in high definition on BBC One HD in the United Kingdom. It is an adaptation of the American series Grounded for Life. Set in Manchester in northern England, the series stars Will Mellor as Liam Flynn, Niky Wardley as his wife Caroline, and Nadine Rose Mulkerrin, Daniel Rogers, and Lorenzo Rodriguez as their children, Chloe, Steve, and Mikey. Other characters include Liam's brother Tommy and Liam and Tommy's father Jim. Originally given the working title of Meet the Doyles, this was changed during production. The theme song is \"For Anyone\" by the band Beady Eye. On 22 December 2011, Will Mellor confirmed in an interview that the show had been given a second series, which was filmed and broadcast in 2012. Taping took place at the new MediaCityUK in Salford and the second series, of six episodes, began on BBC One on 17 August 2012. On 30 October 2012, it was reported that BBC One had cancelled In With The Flynns. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will Mellor Liam Flynn Niky Wardley Caroline Flynn, Warren Clarke Jim Flynn Annabelle Apsion Orla Poole Chloe Flynn Full Cast & Crew Last Season Season 2 2012 | 6 Episodes Season 2 of In with the Flynns premiered on August 17, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on In with the Flynns. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b011r14f Genres Comedy Keywords family sitcom manchester british humour Content Score 86 Almost there... Top Contributors 8 Banana TB 1 TMDb Bot 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}