{"link": "https://www.themoviedb.org/tv/31682?language=en", "title": "El Cazador de la Bruja", "resume": "El Cazador de la Bruja, is an anime television series directed by Kōichi Mashimo and animated by Bee Train studio. It is a spiritual successor of Noir and Madlax and the final installment of Bee Train's \"girls-with-guns\" trilogy. The series was aired on TV Tokyo from April to September in 2007. A manga adaptation was serialized in the Champion RED Magazine beginning in March 2007, and the chapters were collected into one volume.\nThe series was announced for international release by FUNimation Entertainment on February 19, 2009. It was released in two complete season sets in early December 2009 and re-released as a complete set in March 2011. The series made its North American television debut on March 22, 2010, when it started airing on the FUNimation Channel.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Western"], "cast": ["Shin'ichirou Miki", "Mamoru Miyano", "Kenta Miyake", "Aya Hisakawa", "Marina Inoue"], "character": ["Dr. Heinrich \"Heinz\" Schneider", "L.A.", "Douglas Rosenberg", "Jody Hayward", "Lirio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31682   Expand El Cazador de la Bruja   (2007) User Score Overview El Cazador de la Bruja, is an anime television series directed by Kōichi Mashimo and animated by Bee Train studio. It is a spiritual successor of Noir and Madlax and the final installment of Bee Train's \"girls-with-guns\" trilogy. The series was aired on TV Tokyo from April to September in 2007. A manga adaptation was serialized in the Champion RED Magazine beginning in March 2007, and the chapters were collected into one volume. The series was announced for international release by FUNimation Entertainment on February 19, 2009. It was released in two complete season sets in early December 2009 and re-released as a complete set in March 2011. The series made its North American television debut on March 22, 2010, when it started airing on the FUNimation Channel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin'ichirou Miki Dr. Heinrich \"Heinz\" Schneider Mamoru Miyano L.A. Kenta Miyake Douglas Rosenberg Aya Hisakawa Jody Hayward Marina Inoue Lirio Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of El Cazador de la Bruja premiered on April  2, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on El Cazador de la Bruja. You can help by rating TV shows you've seen. Facts Original Name  エル・カザド Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Action & Adventure Western Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors f 4 franfac 3 Zlogorek m 3 magoozin 3 Oriknox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}