{"link": "https://www.themoviedb.org/tv/53568?language=en", "title": "Pelotas", "resume": "Pelotas is a Spanish tragicomedy television series created by José Corbacho and Juan Cruz, set in Hospitalet de Llobregat, a suburb of Barcelona. It was broadcast on La 1, the primary channel of Televisión Española, between 23 February 2009 and 7 June 2010. The series is based around the lives of local Unión Fútbol Club supporters.", "rate": 70, "genre": ["Comedy"], "cast": ["Ángel de Andrés López", "Javier Albalá", "Belén López", "Celia Freijeiro", "Alberto Jo Lee"], "character": ["Florencio 'Flo' Sáez", "Chechu Nieto", "Bea", "Nieves Sáez", "Kim Ki Yong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53568   Expand Pelotas   (2009) User Score Overview Pelotas is a Spanish tragicomedy television series created by José Corbacho and Juan Cruz, set in Hospitalet de Llobregat, a suburb of Barcelona. It was broadcast on La 1, the primary channel of Televisión Española, between 23 February 2009 and 7 June 2010. The series is based around the lives of local Unión Fútbol Club supporters. Featured Crew José Corbacho Creator Juan Cruz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ángel de Andrés López Florencio 'Flo' Sáez Javier Albalá Chechu Nieto Belén López Bea Celia Freijeiro Nieves Sáez Alberto Jo Lee Kim Ki Yong Full Cast & Crew Last Season Season 2 2010 | 13 Episodes Season 2 of Pelotas premiered on March 15, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pelotas. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage   http://www.rtve.es/television/pelotas Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors t 247 teddymeksavanh 219 United600 z 4 zurman1 a 3 aballester  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}