{"link": "https://www.themoviedb.org/tv/40113?language=en", "title": "We the People With Gloria Allred", "resume": "We the People with Gloria Allred is an American nontraditional/dramatized court show that debuted in first-run syndication on September 12, 2011. The series is presented by famed celebrity lawyer/attorney Gloria Allred, who also serves as co-producer with series creator Byron Allen through his production company Entertainment Studios, LLC. John Cramer does the narration of the judge's final verdict. We the People with Gloria Allred was renewed for a second and third season.", "rate": 90, "genre": ["Reality", "Talk", "Crime"], "cast": ["Brian Isom", "Gloria Allred"], "character": ["Himself/Bailiff", "Herself/Judge Gloria Allred"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40113   Expand We the People With Gloria Allred   (2011) User Score Overview We the People with Gloria Allred is an American nontraditional/dramatized court show that debuted in first-run syndication on September 12, 2011. The series is presented by famed celebrity lawyer/attorney Gloria Allred, who also serves as co-producer with series creator Byron Allen through his production company Entertainment Studios, LLC. John Cramer does the narration of the judge's final verdict. We the People with Gloria Allred was renewed for a second and third season. Featured Crew Byron Allen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Isom Himself/Bailiff Gloria Allred Herself/Judge Gloria Allred Full Cast & Crew Last Season Season 1 2011 | 60 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on We the People With Gloria Allred. You can help by rating TV shows you've seen. Facts Status  Ended Network Justice Central Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   http://justicecentral.tv/we-the-people-with-gloria-allred/ Genres Reality Talk Crime Keywords court case court judge trial courtroom court trial female judge courtroom drama television court Content Score 50 Still needs a little work. Top Contributors 31 Ibuddy66  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}