{"link": "https://www.themoviedb.org/tv/80522?language=en", "title": "Knights of Ramune & 40 Fire", "resume": "Baba Lamunade is followed home by two strange peddler girls who give him a CD-rom game. After he beats \"The Legend of Lamuness\", the girls come out of his computer and bring him to DokiDoki Space. He is the third descendant of the hero Lamuness who must stop Don Genosai from resurrecting the great evil Abraham. Accompanied by PQ, his advisor robot, and Parfait and Cacao, he must pilot the Kaizer Fire mecha. However, he needs another pilot, and Da Cider is chosen as the second pilot.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Comedy", "Animation"], "cast": ["Takeshi Kusao", "Kazuki Yao", "Kyoko Hikami", "Yuko Miyamura", "Satomi Kōrogi"], "character": ["Baba Lemonade", "Da Cider", "Cacao", "Parfait", "BQ & PQ"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80522   Expand Knights of Ramune & 40 Fire   (1996) User Score Overview Baba Lamunade is followed home by two strange peddler girls who give him a CD-rom game. After he beats \"The Legend of Lamuness\", the girls come out of his computer and bring him to DokiDoki Space. He is the third descendant of the hero Lamuness who must stop Don Genosai from resurrecting the great evil Abraham. Accompanied by PQ, his advisor robot, and Parfait and Cacao, he must pilot the Kaizer Fire mecha. However, he needs another pilot, and Da Cider is chosen as the second pilot. Featured Crew Satoru Akahori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Takeshi Kusao Baba Lemonade Kazuki Yao Da Cider Kyoko Hikami Cacao Yuko Miyamura Parfait Satomi Kōrogi BQ & PQ Full Cast & Crew Last Season Knights of Ramune & 40 Fire 1996 | 26 Episodes Season 1 of Knights of Ramune & 40 Fire premiered on April  3, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Knights of Ramune & 40 Fire. You can help by rating TV shows you've seen. Facts Original Name  VS騎士ラムネ&40炎 Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.pro-reed.com/works/tv_series/w030.html Genres Sci-Fi & Fantasy Action & Adventure Comedy Animation Keywords mecha Content Score 100 Yes! Looking good! Top Contributors G 43 G_90  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}