{"link": "https://www.themoviedb.org/tv/3051?language=en", "title": "Lost in Space", "resume": "Lost in Space is a science fiction TV series created and produced by Irwin Allen, filmed by 20th Century Fox Television, and broadcast on CBS. The show ran for three seasons, with 83 episodes airing between September 15, 1965, and March 6, 1968. The first TV season was filmed in black and white, but the remainder were filmed in color. In 1998, a Lost in Space movie, based on the TV series, was released.\nThough the original TV series concept centered on the Robinson family, many later story lines focused primarily on Dr. Zachary Smith, played by Jonathan Harris. Originally written as an utterly evil but extremely competent would-be saboteur, Smith gradually becomes the troublesome, self-centered, incompetent foil who provides the comic relief for the show and causes most of the episodic conflict and misadventures. Smith was not in the un-aired pilot and neither was the robot. A meteor storm in the un-aired pilot put them off course. In the first aired episode, Smith's sabotage and unintended presence caused them to go off course so that they encountered the meteors. In the un-aired version, they were going at such a relatively slow speed that they wondered if they were on Mars, while in the first aired episode, just seconds of hyper-drive and they were lost, unknown light years from Earth.", "rate": 72, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Guy Williams", "June Lockhart", "Mark Goddard", "Marta Kristen", "Angela Cartwright"], "character": ["Dr. John Robinson", "Dr. Maureen Robinson", "Major Don West", "Judy Robinson", "Penny Robinson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3051   Expand Lost in Space   (1965) User Score  Play Trailer Overview Lost in Space is a science fiction TV series created and produced by Irwin Allen, filmed by 20th Century Fox Television, and broadcast on CBS. The show ran for three seasons, with 83 episodes airing between September 15, 1965, and March 6, 1968. The first TV season was filmed in black and white, but the remainder were filmed in color. In 1998, a Lost in Space movie, based on the TV series, was released. Though the original TV series concept centered on the Robinson family, many later story lines focused primarily on Dr. Zachary Smith, played by Jonathan Harris. Originally written as an utterly evil but extremely competent would-be saboteur, Smith gradually becomes the troublesome, self-centered, incompetent foil who provides the comic relief for the show and causes most of the episodic conflict and misadventures. Smith was not in the un-aired pilot and neither was the robot. A meteor storm in the un-aired pilot put them off course. In the first aired episode, Smith's sabotage and unintended presence caused them to go off course so that they encountered the meteors. In the un-aired version, they were going at such a relatively slow speed that they wondered if they were on Mars, while in the first aired episode, just seconds of hyper-drive and they were lost, unknown light years from Earth. Featured Crew Irwin Allen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  1 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Guy Williams Dr. John Robinson June Lockhart Dr. Maureen Robinson Mark Goddard Major Don West Marta Kristen Judy Robinson Angela Cartwright Penny Robinson Full Cast & Crew Last Season Season 3 1967 | 24 Episodes Season 3 of Lost in Space premiered on September  6, 1967. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Lost in Space ABC's Open 42 by  wonder2wonder better writers Open 0 by manfromatlantis\n      \n     Jetfire's Non Star Trek Spaceship List. Open 0 by Jetfire59\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   1964-09-22 The Man from U.N.C.L.E. 7.2    1966-09-12 Family Affair 5.4    1979-09-22 Hart to Hart 6.5    1964-09-14 Voyage to the Bottom of the Sea 7.4    1967-09-10 Gentle Ben 5.0    1969-09-26 The Brady Bunch 6.5    1962-10-04 The Saint 7.2    1964-09-17 Bewitched 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Sci-Fi & Fantasy Keywords future spaceship space alien planet Content Score 100 Yes! Looking good! Top Contributors 15 Banana 9 Joe Carson R 6 Rebecca j 5 joachimgr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}