{"link": "https://www.themoviedb.org/tv/71959?language=en", "title": "I Can See Your Voice", "resume": "The music show filled with mysteries and shocking moments is back! Guest celebrities must correctly guess a real singer, based on appearance and a few hints only, among the group of people who are pretending to be a singer. A fake singer who last till the end gets 5000 dollars whereas a real singer who survives gets a precious opportunity to have their own album released.", "rate": 65, "genre": [], "cast": ["Lee-teuk", "Yoo Se-Yoon", "Kim Jong-kook"], "character": ["MC", "MC", "MC"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71959   Expand I Can See Your Voice User Score Overview The music show filled with mysteries and shocking moments is back! Guest celebrities must correctly guess a real singer, based on appearance and a few hints only, among the group of people who are pretending to be a singer. A fake singer who last till the end gets 5000 dollars whereas a real singer who survives gets a precious opportunity to have their own album released. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee-teuk MC Yoo Se-Yoon MC Kim Jong-kook MC Full Cast & Crew Current Season Season 5 2018 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Facts Original Name  너의 목소리가 보여 Status  Returning Series Networks Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  - Homepage   http://onair.mnet.com/yourvoice/ Genres No genres have been added. Keywords No keywords have been added. Content Score 28 Rome wasn't built in a day... Top Contributors 15 barto k 11 keyboard e 2 eMo318 a 2 afofrancis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}