{"link": "https://www.themoviedb.org/tv/34503?language=en", "title": "The Indian Doctor", "resume": "The Indian Doctor is a British television drama set in the summer of 1963. Produced by Rondo Media and Avatar Productions, it was first broadcast on BBC One in 2010. The most recent series began on 27 February 2012 and concluded on 2 March. It is a period comedy drama starring Sanjeev Bhaskar as an Indian doctor who finds work in a South Wales mining village.", "rate": 68, "genre": ["Drama", "Comedy"], "cast": ["Ayesha Dharker", "Sanjeev Bhaskar", "Mali Harries", "Mark Heap", "Mark Williams"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34503   Expand The Indian Doctor   (2010) User Score  Play Trailer Overview The Indian Doctor is a British television drama set in the summer of 1963. Produced by Rondo Media and Avatar Productions, it was first broadcast on BBC One in 2010. The most recent series began on 27 February 2012 and concluded on 2 March. It is a period comedy drama starring Sanjeev Bhaskar as an Indian doctor who finds work in a South Wales mining village. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ayesha Dharker Sanjeev Bhaskar Mali Harries Mark Heap Mark Williams Full Cast & Crew Last Season Season 3 2013 | 5 Episodes Season 3 of The Indian Doctor premiered on September 19, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Indian Doctor. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors TB 2 TMDb Bot 1 bigyellowbird 1 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}