{"link": "https://www.themoviedb.org/tv/74106?language=en", "title": "The Big Boss", "resume": "Ye Mu Qi (Li Kai Xin) has good brains and thus manages to get first place in the whole school. Just because of that, she gets elected as the class president. But what nobody knows is that Mu Qi is actually the “Big Boss” of the street. When fate brings her once again together with her childhood friend Liao Dan Yi (Huang Jun Jie), an odd love story begins...", "rate": 0, "genre": ["Comedy"], "cast": ["Huang Jun Jie"], "character": ["Liao Dan Yi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74106   Expand The Big Boss   (2017) User Score Overview Ye Mu Qi (Li Kai Xin) has good brains and thus manages to get first place in the whole school. Just because of that, she gets elected as the class president. But what nobody knows is that Mu Qi is actually the “Big Boss” of the street. When fate brings her once again together with her childhood friend Liao Dan Yi (Huang Jun Jie), an odd love story begins... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Huang Jun Jie Liao Dan Yi Full Cast & Crew Last Season Season 1 2017 | 0 Episodes Season 1 of The Big Boss premiered on September  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Big Boss. You can help by rating TV shows you've seen. Facts Original Name  班长大人 Status  Returning Series Network Certification  - Type  Scripted Original Language  Chinese Runtime  60m Homepage  - Genres Comedy Keywords china school youth Content Score 56 We're so close, yet so far. Top Contributors 13 sansalayne n 9 nubie 1 ernalz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}