{"link": "https://www.themoviedb.org/tv/52086?language=en", "title": "Decree Love", "resume": "Nit's father passed away so she left school and looked for work. She was then referred to a job by an old friend. The job just happened to be working for Phu's farmland. At the beginning, they started out arguing, but later ended up having feelings for each other. But his sister always tries to make trouble with Nit because she believes that every girl around Phu only wants him because he's rich. Later on Phu's ex-girlfriend shows up and confronts Nit. She tells Nit that Phu only liked her because she looked like her, which made Nit very confused about Phu's feelings from her because he never once told her he loved her.", "rate": 80, "genre": ["Soap", "Drama"], "cast": ["Nattawut Skidjai", "Taksaorn Paksukcharern", "Sorawit Suboon", "Napapa Thantrakul", "Sakaojai Poonsawatd"], "character": ["Por Liang Puchit", "'Nit' Narissara", "Niphon", "Khun Lek", "'Na' Lukana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52086   Expand Decree Love    (2012) User Score  Play Trailer Overview Nit's father passed away so she left school and looked for work. She was then referred to a job by an old friend. The job just happened to be working for Phu's farmland. At the beginning, they started out arguing, but later ended up having feelings for each other. But his sister always tries to make trouble with Nit because she believes that every girl around Phu only wants him because he's rich. Later on Phu's ex-girlfriend shows up and confronts Nit. She tells Nit that Phu only liked her because she looked like her, which made Nit very confused about Phu's feelings from her because he never once told her he loved her. Featured Crew Paa Jaew Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nattawut Skidjai Por Liang Puchit Taksaorn Paksukcharern 'Nit' Narissara Sorawit Suboon Niphon Napapa Thantrakul Khun Lek Sakaojai Poonsawatd 'Na' Lukana Full Cast & Crew Last Season Season 1 2012 | 14 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Decree Love . You can help by rating TV shows you've seen. Facts Original Name  รักประกาศิต Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  98m Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 47 Crip 5 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}