{"link": "https://www.themoviedb.org/tv/38974?language=en", "title": "Jessie", "resume": "An idealistic teen from rural Texas embarks on the adventure of a lifetime when she decides to leave behind starry nights for big city lights. Thrilled to be on her own and determined not to be intimidated by New York City, she accepts a job as nanny for a high-profile couple with four kids. Helping to keep her moral compass in check are Bertram, the family's butler, and Tony, the building's 20-year-old doorman.", "rate": 67, "genre": ["Comedy"], "cast": ["Chris Galya", "Debby Ryan", "Cameron Boyce", "Karan Brar", "Skai Jackson"], "character": ["Tony Chiccolini", "Jessie Prescott", "Luke Ross", "Ravi Ross", "Zuri Ross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38974   Expand Jessie   (2011) User Score Overview An idealistic teen from rural Texas embarks on the adventure of a lifetime when she decides to leave behind starry nights for big city lights. Thrilled to be on her own and determined not to be intimidated by New York City, she accepts a job as nanny for a high-profile couple with four kids. Helping to keep her moral compass in check are Bertram, the family's butler, and Tony, the building's 20-year-old doorman. Featured Crew Pamela Eells Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Galya Tony Chiccolini Debby Ryan Jessie Prescott Cameron Boyce Luke Ross Karan Brar Ravi Ross Skai Jackson Zuri Ross Full Cast & Crew Last Season Season 4 2015 | 20 Episodes Season 4 of Jessie premiered on January  8, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Emma: Happy Birthday Peyton List! Open 0 by wonder2wonder\n      \n     w Ravi: Happy Birthday Karan Brar! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   2012-10-12 Dog With a Blog 5.3    2011-12-02 Austin & Ally 5.8    2010-04-04 Good Luck Charlie 5.8    2010-11-07 Shake It Up 2.8    2011-06-13 Kickin' It 6.5    2008-09-26 The Suite Life on Deck 6.1    2004-06-18 Phil of the Future 7.0    2013-07-19 Liv and Maddie 6.1  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  23m Homepage   http://disneychannel.disney.com/jessie Genres Comedy Keywords hotel new york nanny babysitter adopted child rich kids Content Score 93 Almost there... Top Contributors 68 Marr 🇳🇱 22 Elizabeth Jennings 14 Banana 14 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}