{"link": "https://www.themoviedb.org/tv/10083?language=en", "title": "The Fugitive", "resume": "The Fugitive is an American drama series created by Roy Huggins and produced by QM Productions and United Artists Television that aired on ABC from 1963 to 1967. David Janssen stars as Richard Kimble, a doctor who is falsely convicted of his wife's murder and given the death penalty. En route to death row, Kimble's train derails and crashes, allowing him to escape and begin a cross-country search for the real killer, a \"one-armed man\". At the same time, Dr. Kimble is hounded by the authorities, most notably dogged by Police Lieutenant Philip Gerard.\nThe Fugitive aired for four seasons, and a total of 120 51-minute episodes were produced. The first three seasons were filmed in black and white; the final season was in color. As of October 2012, The Fugitive is broadcast weekly on Me-TV.\nIn 2002, The Fugitive was ranked No. 36 on TV Guide's 50 Greatest TV Shows of All Time. TV Guide named the one-armed man #5 in their 2013 list of The 60 Nastiest Villains of All Time.", "rate": 77, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["David Janssen", "Barry Morse", "William Conrad"], "character": ["Richard Kimble", "Lieutenant Gerard", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10083   Expand The Fugitive   (1963) User Score Overview The Fugitive is an American drama series created by Roy Huggins and produced by QM Productions and United Artists Television that aired on ABC from 1963 to 1967. David Janssen stars as Richard Kimble, a doctor who is falsely convicted of his wife's murder and given the death penalty. En route to death row, Kimble's train derails and crashes, allowing him to escape and begin a cross-country search for the real killer, a \"one-armed man\". At the same time, Dr. Kimble is hounded by the authorities, most notably dogged by Police Lieutenant Philip Gerard. The Fugitive aired for four seasons, and a total of 120 51-minute episodes were produced. The first three seasons were filmed in black and white; the final season was in color. As of October 2012, The Fugitive is broadcast weekly on Me-TV. In 2002, The Fugitive was ranked No. 36 on TV Guide's 50 Greatest TV Shows of All Time. TV Guide named the one-armed man #5 in their 2013 list of The 60 Nastiest Villains of All Time. Featured Crew Roy Huggins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Janssen Richard Kimble Barry Morse Lieutenant Gerard William Conrad Narrator Full Cast & Crew Last Season Season 4 1966 | 30 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply one arm man Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1957-09-22 Maverick 8.3    1969-09-24 Medical Center 6.3    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1958-09-24 The Donna Reed Show 6.7    1969-09-17 The Courtship of Eddie's Father 6.2    1962-09-19 The Virginian 6.7    1962-10-11 McHale's Navy 6.1    1974-03-27 The Rockford Files 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 51m Homepage  - Genres Action & Adventure Drama Mystery Keywords escape pursuit integrity Content Score 64 We're so close, yet so far. Top Contributors 13 Steve PE 9 Patrick E. Abe 6 Elizabeth Jennings z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}