{"link": "https://www.themoviedb.org/tv/2513?language=en", "title": "Dr. Katz, Professional Therapist", "resume": "Dr. Katz, Professional Therapist is an American animated series that originally ran on Comedy Central from May 28, 1995 to December 24, 1999—with a final set of three shelved episodes airing in 2002—starring Jonathan Katz, Jon Benjamin, and Laura Silverman. The show was created by a Burbank, California production company Popular Arts Entertainment, with Jonathan Katz and Tom Snyder, developed and first made by Popular Arts for HBO Downtown Productions. Boston-based Tom Snyder Productions became the hands-on production company, and the episodes were usually produced by Katz and Loren Bouchard.\nThe show was computer animated in a crude, easily recognizable style produced with the software Squigglevision in which all persons and animate objects are colored and have constantly squiggling outlines, while most other inanimate objects are static and usually gray in color. The original challenge Popular Arts faced was how to repurpose recorded stand-up comedy material. To do so they based Dr. Katz's patients on stand-up comics for the first several episodes, simply having them recite their stand-up acts. The secondary challenge was how to affordably animate on cable TV at the time. Snyder had Squigglevision, an inexpensive means of getting animation on cable, which could not afford traditional animation processes. A partnership between Popular Arts, Tom Snyder Productions and Jonathan Katz was formed and Dr. Katz: Professional Therapist was born.", "rate": 78, "genre": ["Animation", "Comedy"], "cast": ["H. Jon Benjamin", "Jonathan Katz", "Laura Silverman"], "character": ["Ben Katz (voice)", "Dr. Katz (voice)", "Laura the Receptionist (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2513   Expand Dr. Katz, Professional Therapist   (1995) User Score Overview Dr. Katz, Professional Therapist is an American animated series that originally ran on Comedy Central from May 28, 1995 to December 24, 1999—with a final set of three shelved episodes airing in 2002—starring Jonathan Katz, Jon Benjamin, and Laura Silverman. The show was created by a Burbank, California production company Popular Arts Entertainment, with Jonathan Katz and Tom Snyder, developed and first made by Popular Arts for HBO Downtown Productions. Boston-based Tom Snyder Productions became the hands-on production company, and the episodes were usually produced by Katz and Loren Bouchard. The show was computer animated in a crude, easily recognizable style produced with the software Squigglevision in which all persons and animate objects are colored and have constantly squiggling outlines, while most other inanimate objects are static and usually gray in color. The original challenge Popular Arts faced was how to repurpose recorded stand-up comedy material. To do so they based Dr. Katz's patients on stand-up comics for the first several episodes, simply having them recite their stand-up acts. The secondary challenge was how to affordably animate on cable TV at the time. Snyder had Squigglevision, an inexpensive means of getting animation on cable, which could not afford traditional animation processes. A partnership between Popular Arts, Tom Snyder Productions and Jonathan Katz was formed and Dr. Katz: Professional Therapist was born. Featured Crew Jonathan Katz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast H. Jon Benjamin Ben Katz (voice) Jonathan Katz Dr. Katz (voice) Laura Silverman Laura the Receptionist (voice) Full Cast & Crew Last Season Season 6 1999 | 18 Episodes Season 6 of Dr. Katz, Professional Therapist premiered on June 15, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   2000-12-21 The Brak Show 7.0    2005-10-30 Lucy, the Daughter of the Devil 7.0    2000-12-21 Sealab 2021 7.8    1994-01-26 The Critic 7.7    1999-04-26 Home Movies 6.6    1998-08-19 Upright Citizens Brigade 8.0    1968-09-14 The Adventures of Batman 7.4    1999-09-24 Mission Hill 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.comedycentral.com/shows/dr_katz/index.jhtml Genres Animation Comedy Keywords therapy psychotherapist mental health professional Content Score 64 We're so close, yet so far. Top Contributors 18 Banana z 4 zurman1 m 3 morrison D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}