{"link": "https://www.themoviedb.org/tv/64099?language=en", "title": "War and Peace", "resume": "A story that revolves around five aristocratic families, set during the reign of Alexander I, and centered on the love triangle between Natasha Rostova, Pierre Bezukhov, and Andrei Bolkonsky.", "rate": 77, "genre": ["Drama", "History", "Romance"], "cast": ["Lily James", "James Norton", "Paul Dano", "Gillian Anderson", "Aneurin Barnard"], "character": ["Natasha Rostova", "Prince Andrei Bolkonsky", "Pierre Bezukhov", "Anna Pavlovna Scherer", "Boris Drubetskoy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64099   Expand War and Peace   (2016) User Score  Play Trailer Overview A story that revolves around five aristocratic families, set during the reign of Alexander I, and centered on the love triangle between Natasha Rostova, Pierre Bezukhov, and Andrei Bolkonsky. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  14 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lily James Natasha Rostova James Norton Prince Andrei Bolkonsky Paul Dano Pierre Bezukhov Gillian Anderson Anna Pavlovna Scherer Aneurin Barnard Boris Drubetskoy Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of War and Peace premiered on January  3, 2016. View All Seasons Social Reviews  1 Discussions  3 Featured Review A review by Reno Written by  Reno  on February  4, 2018 All's fair in love and war! SEASON 01: The war and wealth, the romance and deceives, the fictional Russia of the 1800s. First of all I've never seen the series or film adapted from theis book. This is my first version of any format. So it's high excitement time, since I like Leo Tolstoy works. It did not disappoint me. The BBC had done it again. Yep, another wonderful adaptation. Great casting and shot in location, or to say the graphic works were done wonderfully. Nice costumes show as well, in the original Russian classic style. It starts with war and ends with the same....  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  14 Posters  7 Recommendations   2013-06-16 The White Queen 6.5    2015-07-19 Tut 7.0    2011-06-24 The Borgias 7.5    2016-08-28 Victoria 6.5    2014-07-03 The Honourable Woman 7.8    2012-08-24 Parade's End 6.7    2016-02-14 Vinyl 7.2    2007-04-01 The Tudors 7.5  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  360m Homepage   http://www.bbc.co.uk/programmes/p039wcdk Genres Drama History Romance Keywords war peace russia napoleon family historical drama costume drama aristocratic Content Score 93 Almost there... Top Contributors 72 Elizabeth Jennings 16 EveDemocracy 15 Nuno Filipe de Vilhena Santos 9 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}