{"link": "https://www.themoviedb.org/tv/14258?language=en", "title": "No, Honestly", "resume": "No, Honestly is a British sitcom that was originally produced in 1974. No, Honestly featured the real-life married couple of Pauline Collins and John Alderton respectively as Clara and Charles Danby, a newlywed couple living in London.\nThe character of Clara was a ditzy dreamer who hoped to write books for children. Charles Danby by contrast was a struggling actor with a more serious streak.\nAt the start of each episode, the couple appeared in front of an audience telling stories about their first meeting, courtship and life as newlyweds. The entire programme, therefore, was a series of flashbacks as the couple recounted the earlier days of their romance.\nFilled with witty and sparkling banter, the episodes featured comic situations ranging from problems with mistaken identity to decorating and makeover mishaps.\nIn homage to George Burns and Gracie Allen, CD would end each episode with the phrase \"Say goodnight, Clara.\"\nThe series is based on the novels Coronet Among the Weeds and Coronet Among the Grass written by Charlotte Bingham, who was co-creator of the TV series with her husband Terence Brady.\nThe theme song for No, Honestly was written and performed by Lynsey De Paul. It peaked on the UK charts at number 7.", "rate": 0, "genre": ["Comedy"], "cast": ["Pauline Collins", "John Alderton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14258   Expand No, Honestly   (1974) User Score Overview No, Honestly is a British sitcom that was originally produced in 1974. No, Honestly featured the real-life married couple of Pauline Collins and John Alderton respectively as Clara and Charles Danby, a newlywed couple living in London. The character of Clara was a ditzy dreamer who hoped to write books for children. Charles Danby by contrast was a struggling actor with a more serious streak. At the start of each episode, the couple appeared in front of an audience telling stories about their first meeting, courtship and life as newlyweds. The entire programme, therefore, was a series of flashbacks as the couple recounted the earlier days of their romance. Filled with witty and sparkling banter, the episodes featured comic situations ranging from problems with mistaken identity to decorating and makeover mishaps. In homage to George Burns and Gracie Allen, CD would end each episode with the phrase \"Say goodnight, Clara.\" The series is based on the novels Coronet Among the Weeds and Coronet Among the Grass written by Charlotte Bingham, who was co-creator of the TV series with her husband Terence Brady. The theme song for No, Honestly was written and performed by Lynsey De Paul. It peaked on the UK charts at number 7. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pauline Collins John Alderton Full Cast & Crew Last Season No honestly season 1 1974 | 13 Episodes Season 1 of No, Honestly premiered on October  4, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on No, Honestly. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords married couple marriage flashback british humour Content Score 43 There's no 'I' in team... Top Contributors O 5 Ozbourne TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}