{"link": "https://www.themoviedb.org/tv/9523?language=en", "title": "Raven", "resume": "Raven is released on probation to live with Professor Young, an archaeologist immersed in research into Arthurian legend. He is compelled to fight a plan to build a nuclear plant on the research site, which holds many mysteries.", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Michael Aldridge", "Patsy Rowlands", "Phil Daniels", "Shirley Cheriton", "Tenniel Evans"], "character": ["Raven"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9523   Expand Raven   (1977) User Score Overview Raven is released on probation to live with Professor Young, an archaeologist immersed in research into Arthurian legend. He is compelled to fight a plan to build a nuclear plant on the research site, which holds many mysteries. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Aldridge Patsy Rowlands Phil Daniels Raven Shirley Cheriton Tenniel Evans Full Cast & Crew Last Season Miniseries 1977 | 6 Episodes Season 1 of Raven premiered on September 19, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Raven. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Keywords miniseries Content Score 86 Almost there... Top Contributors TB 40 TMDb Bot R 11 Rebecca 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}