{"link": "https://www.themoviedb.org/tv/62335?language=en", "title": "UnREAL", "resume": "Set against the backdrop of a hit dating competition show, \"UnREAL\" is led by Rachel, a young staffer whose sole job is to manipulate her relationships with and among the contestants to get the vital dramatic and outrageous footage the program's dispassionate executive producer demands. What ensues is a humorous, yet vexing, look at what happens in the world of unscripted television, where being a contestant can be vicious and producing it is a whole other reality.", "rate": 62, "genre": ["Drama", "Comedy"], "cast": ["Shiri Appleby", "Constance Zimmer", "Craig Bierko", "Jeffrey Bowyer-Chapman", "Genevieve Buechner"], "character": ["Rachel Goldberg", "Quinn King", "Chet Wilton", "Jay", "Madison"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62335   Expand UnREAL   (2015) User Score  Play Trailer Overview Set against the backdrop of a hit dating competition show, \"UnREAL\" is led by Rachel, a young staffer whose sole job is to manipulate her relationships with and among the contestants to get the vital dramatic and outrageous footage the program's dispassionate executive producer demands. What ensues is a humorous, yet vexing, look at what happens in the world of unscripted television, where being a contestant can be vicious and producing it is a whole other reality. Featured Crew Sarah Gertrude Shapiro Creator Marti Noxon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shiri Appleby Rachel Goldberg Constance Zimmer Quinn King Craig Bierko Chet Wilton Jeffrey Bowyer-Chapman Jay Genevieve Buechner Madison Full Cast & Crew Current Season Season 3 2018 | 10 Episodes Season 3 of UnREAL premiered on February 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  13 Posters  6 Recommendations   2014-09-26 Transparent 6.7    2015-03-25 Big Time in Hollywood, Fl 5.7    2016-03-15 Crowded 6.4    2010-06-28 Huge 5.5    2011-10-17 Threesome 6.3    2014-03-21 Welcome to Sweden 6.3    2015-09-22 Scream Queens 6.3    2015-01-19 Catastrophe 7.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.mylifetime.com/shows/unreal Genres Drama Comedy Keywords manipulation television reality tv moral conflict behind the scenes Content Score 100 Yes! Looking good! Top Contributors 98 Banana 86 Elizabeth Jennings b 10 bugfix t 6 taces2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}