{"link": "https://www.themoviedb.org/tv/1950?language=en", "title": "Everwood", "resume": "After the death of his wife, world-class neurosurgeon Dr. Andrew Brown leaves Manhattan and moves his family to the small town of Everwood, Colorado. There he becomes a small-town doctor and learns parenting on the fly as he raises his talented but resentful 15-year-old son Ephram and his 9-year-old daughter Delia.", "rate": 71, "genre": ["Drama"], "cast": ["Gregory Smith", "Treat Williams", "Emily VanCamp", "Tom Amandes", "Vivien Cardone"], "character": ["Ephram Brown", "Dr. Andrew Brown", "Amy Abbott", "Dr. Harold Abbott", "Delia Brown"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1950   Expand Everwood   (2002) User Score  Play Trailer Overview After the death of his wife, world-class neurosurgeon Dr. Andrew Brown leaves Manhattan and moves his family to the small town of Everwood, Colorado. There he becomes a small-town doctor and learns parenting on the fly as he raises his talented but resentful 15-year-old son Ephram and his 9-year-old daughter Delia. Featured Crew Greg Berlanti Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gregory Smith Ephram Brown Treat Williams Dr. Andrew Brown Emily VanCamp Amy Abbott Tom Amandes Dr. Harold Abbott Vivien Cardone Delia Brown Full Cast & Crew Last Season Season 4 2005 | 22 Episodes Season 4 of Everwood premiered on September 29, 2005. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Hannah: Happy Birthday Sarah Drew! Open 0 by wonder2wonder\n      \n     Were you happy with the way it ended? Open 0 by MirrorMask\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  1 Recommendations   2002-09-20 What I Like About You 5.3    2016-06-08 Power Monkeys 7.0    1992-07-08 Melrose Place 4.9    2006-01-01 In Justice 6.8    2002-09-17 8 Simple Rules 6.3    2005-06-13 The Closer 7.0    1984-01-06 Blue Thunder 6.3    1992-09-23 Mad About You 6.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Drama Keywords small town doctor single father best friends in love general practitioner (gp) simpler life Content Score 100 Yes! Looking good! Top Contributors 19 Banana j 6 junix.ch g 5 golow 5 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}