{"link": "https://www.themoviedb.org/tv/56442?language=en", "title": "Akko's Secret", "resume": "Himitsu no Akko-chan is a pioneering magical girl manga and anime that ran in Japan during the 1960s.\nThe manga was drawn and written by Fujio Akatsuka, and was published in Ribon from 1962 to 1965. It predates the Mahōtsukai Sunny manga, printed in 1966. However, that title is the first magical girl anime as Himitsu no Akko-chan was not broadcast until 1969.\nThe original anime ran for 94 episodes from 1969 to 1970. It was animated by Toei Animation and broadcast by TV Asahi. It has been remade twice, in 1988 and in 1998. Two Akko-chan movies were made in 1989 and five were created between 1969 and 1973. It also adapted into a live action film released in September 1, 2012.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56442   Expand Akko's Secret   (1969) User Score Overview Himitsu no Akko-chan is a pioneering magical girl manga and anime that ran in Japan during the 1960s. The manga was drawn and written by Fujio Akatsuka, and was published in Ribon from 1962 to 1965. It predates the Mahōtsukai Sunny manga, printed in 1966. However, that title is the first magical girl anime as Himitsu no Akko-chan was not broadcast until 1969. The original anime ran for 94 episodes from 1969 to 1970. It was animated by Toei Animation and broadcast by TV Asahi. It has been remade twice, in 1988 and in 1998. Two Akko-chan movies were made in 1989 and five were created between 1969 and 1973. It also adapted into a live action film released in September 1, 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1969 | 2 Episodes Season 1 of Akko's Secret premiered on January  6, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Akko's Secret. You can help by rating TV shows you've seen. Facts Original Name  ひみつのアッコちゃん Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 15 BrerFox 5 BigMad 5 Kijung Kim L 1 Leah  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}