{"link": "https://www.themoviedb.org/tv/13999?language=en", "title": "The X Factor", "resume": "The X Factor is a British television music competition to find new singing talent, contested by aspiring singers drawn from public auditions. Created by Simon Cowell, the show began in September 2004 and has since aired annually from August/September through to December. The show is produced by FremantleMedia's Thames and Cowell's production company SYCOtv. It is broadcast on the ITV network in the United Kingdom and TV3 in Ireland, with spin-off behind-the-scenes show The Xtra Factor screened on ITV2. It is the originator of the international The X Factor franchise. The X Factor was devised as a replacement for the highly successful Pop Idol, which was put on indefinite hiatus after its second series, largely because Cowell, who was a judge on Pop Idol, wished to launch a show to which he owned the television rights. The perceived similarity between the two shows later became the subject of a legal dispute. The \"X Factor\" of the title refers to the undefinable \"something\" that makes for star quality.\nThe original judging panel was Cowell, Sharon Osbourne and Louis Walsh. Dannii Minogue joined the panel in series 4, and Cheryl Cole replaced Osbourne in series 5 after her departure. After series 7, Cowell and Cole both left to judge the American version of the show whilst Minogue left the show due to commitments on Australia's Got Talent. Kelly Rowland, Tulisa Contostavlos and Gary Barlow then joined Walsh on the judging panel for series 8, though Rowland announced she would not return for series 9 and was replaced by Nicole Scherzinger. Osbourne later returned in 2013, replacing Contostavlos. Since 2007, the show has been presented by Dermot O'Leary, who replaced original host Kate Thornton. The show is split into a series of phases, following the contestants from auditions through to the grand finale. In the original televised audition phase of the show, contestants sang in an audition room in front of just the judges. From series 6 onwards, auditionees sing on a stage in front of the judges and a live audience. Successful auditionees go through to \"bootcamp\" and then to \"judges' houses\", where judges narrow down the acts in their category down to three or four acts to mentor for the live shows, where the public vote for their favourite acts following weekly live performances by the contestants.", "rate": 44, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13999   Expand The X Factor   (2004) User Score  Play Trailer Overview The X Factor is a British television music competition to find new singing talent, contested by aspiring singers drawn from public auditions. Created by Simon Cowell, the show began in September 2004 and has since aired annually from August/September through to December. The show is produced by FremantleMedia's Thames and Cowell's production company SYCOtv. It is broadcast on the ITV network in the United Kingdom and TV3 in Ireland, with spin-off behind-the-scenes show The Xtra Factor screened on ITV2. It is the originator of the international The X Factor franchise. The X Factor was devised as a replacement for the highly successful Pop Idol, which was put on indefinite hiatus after its second series, largely because Cowell, who was a judge on Pop Idol, wished to launch a show to which he owned the television rights. The perceived similarity between the two shows later became the subject of a legal dispute. The \"X Factor\" of the title refers to the undefinable \"something\" that makes for star quality. The original judging panel was Cowell, Sharon Osbourne and Louis Walsh. Dannii Minogue joined the panel in series 4, and Cheryl Cole replaced Osbourne in series 5 after her departure. After series 7, Cowell and Cole both left to judge the American version of the show whilst Minogue left the show due to commitments on Australia's Got Talent. Kelly Rowland, Tulisa Contostavlos and Gary Barlow then joined Walsh on the judging panel for series 8, though Rowland announced she would not return for series 9 and was replaced by Nicole Scherzinger. Osbourne later returned in 2013, replacing Contostavlos. Since 2007, the show has been presented by Dermot O'Leary, who replaced original host Kate Thornton. The show is split into a series of phases, following the contestants from auditions through to the grand finale. In the original televised audition phase of the show, contestants sang in an audition room in front of just the judges. From series 6 onwards, auditionees sing on a stage in front of the judges and a live audience. Successful auditionees go through to \"bootcamp\" and then to \"judges' houses\", where judges narrow down the acts in their category down to three or four acts to mentor for the live shows, where the public vote for their favourite acts following weekly live performances by the contestants. Featured Crew Simon Cowell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 14 2017 | 26 Episodes Season 14 of The X Factor premiered on September  2, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   2007-06-09 Britain's Got Talent 4.2    2009-08-24 Pointless 6.9    2011-09-21 The X Factor 4.4    2009-06-29 The Chase 5.5    1973-02-15 Some Mothers Do 'Ave 'Em 7.8    1995-08-12 Soccer AM 5.0    1982-11-02 Countdown 5.4    1982-11-01 SuperTed 6.8  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.itv.com/xfactor Genres Reality Keywords singing competition Content Score 71 Just a little bit more... Top Contributors 91 Banana b 13 basher 5 Elizabeth Jennings 5 AbrarAAwan3  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}