{"link": "https://www.themoviedb.org/tv/39510?language=en", "title": "Touch", "resume": "Martin Bohm, a widower and single father, is haunted by an inability to connect to his autistic, mute 11-year-old son, Jake. Their relationship and their lives take an extraordinary turn when he discovers his gifted son has the ability to see things that no one else can and the patterns that connect seemingly unrelated events.", "rate": 67, "genre": ["Science", "Fiction", "Drama", "Mystery"], "cast": ["Kiefer Sutherland", "David Mazouz", "Maria Bello", "Saxon Sharbino", "Lukas Haas"], "character": ["Martin Bohm", "Jacob Bohm", "Lucy Robbins", "Amelia Robbins", "Calvin Norburg"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39510   Expand Touch   (2012) User Score  Play Trailer Overview Martin Bohm, a widower and single father, is haunted by an inability to connect to his autistic, mute 11-year-old son, Jake. Their relationship and their lives take an extraordinary turn when he discovers his gifted son has the ability to see things that no one else can and the patterns that connect seemingly unrelated events. Featured Crew Tim Kring Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  14 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kiefer Sutherland Martin Bohm David Mazouz Jacob Bohm Maria Bello Lucy Robbins Saxon Sharbino Amelia Robbins Lukas Haas Calvin Norburg Full Cast & Crew Last Season Season 2 2013 | 13 Episodes Season 2 of Touch premiered on February  8, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply This was one of my favourite shows. Open 0 by Justin Sane\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  6 Recommendations   2012-01-16 Alcatraz 5.9    2012-03-01 Awake 7.3    2010-09-28 No Ordinary Family 6.1    2011-09-23 A Gifted Man 6.2    2011-09-26 Terra Nova 6.3    2012-09-27 Last Resort 6.8    2013-11-17 Almost Human 7.0    2009-01-21 Lie to Me 7.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Science Fiction Drama Mystery Keywords autism psychic power single father Content Score 100 Yes! Looking good! Top Contributors f 36 furkan-guven0115 25 Banana 20 Travis Bell 5 Julien Lefebvre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}