{"link": "https://www.themoviedb.org/tv/63401?language=en", "title": "We Bare Bears", "resume": "Three brother bears awkwardly attempt to find their place in civilized  society, whether they're looking for food, trying to make human friends,  or scheming to become famous on the internet. Grizzly, Panda and Ice  Bear stack atop one another when they leave their cave and explore the  hipster environs of the San Francisco Bay Area, and it's clear the  siblings have a lot to learn about a technologically driven world. By  their side on many adventures are best friend Chloe (the only human  character in the cast), fame-obsessed panda Nom Nom, and Charlie, aka  Bigfoot.", "rate": 74, "genre": ["Family", "Comedy", "Animation"], "cast": ["Eric Edelstein", "Jason Lee", "Demetri Martin", "Bobby Moynihan", "Patton Oswalt"], "character": ["Grizzly (voice)", "Charlie (voice)", "Ice Bear (voice)", "Panda (voice)", "Nom Nom (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63401   Expand We Bare Bears   (2015) User Score  Play Trailer Overview Three brother bears awkwardly attempt to find their place in civilized  society, whether they're looking for food, trying to make human friends,  or scheming to become famous on the internet. Grizzly, Panda and Ice  Bear stack atop one another when they leave their cave and explore the  hipster environs of the San Francisco Bay Area, and it's clear the  siblings have a lot to learn about a technologically driven world. By  their side on many adventures are best friend Chloe (the only human  character in the cast), fame-obsessed panda Nom Nom, and Charlie, aka  Bigfoot. Featured Crew Daniel Chong Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  8 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Edelstein Grizzly (voice) Jason Lee Charlie (voice) Demetri Martin Ice Bear (voice) Bobby Moynihan Panda (voice) Patton Oswalt Nom Nom (voice) Full Cast & Crew Last Season Season 3 2017 | 44 Episodes Season 3 of We Bare Bears premiered on April  4, 2017. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply There are no discussions for We Bare Bears. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2014-08-18 Clarence 7.4    2000-10-03 Vandread 7.5    2005-03-25 Krypto the Superdog 1.3    2013-08-05 Quick Draw 6.3    2016-03-01 Loosely Exactly Nicole 5.8    2015-03-25 Big Time in Hollywood, Fl 5.7    2014-04-02 TripTank 4.6    2015-01-18 Star vs. the Forces of Evil 8.4  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.cartoonnetwork.com/video/we-bare-bears/index.html Genres Family Comedy Animation Keywords anthropomorphism cartoon bear Content Score 100 Yes! Looking good! Top Contributors 35 Elizabeth Jennings 29 Seriestoon 20 Kyuhwan Kim 18 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}