{"link": "https://www.themoviedb.org/tv/4349?language=en", "title": "Melrose Place", "resume": "Melrose Place is an American primetime soap opera that aired on Fox from July 8, 1992, to May 24, 1999 for seven seasons. It follows the lives of a group of young adults living in a brownstone apartment complex on Melrose Place, in Los Angeles, California. The show was created by Darren Star for Fox and executive produced by Aaron Spelling for his company, Spelling Television. It is the second series in the Beverly Hills, 90210 franchise. Season one and season two were broadcast on Wednesday at 9pm, after Beverly Hills, 90210. In 1994, for its third season premiere, the show moved to Monday at 8pm.\nThe show had many cast changes during the run. Thomas Calabro was the only original cast member to remain on the series throughout its entire run.\nThe show earned several Golden Globe nominations and placed #51 on Entertainment Weekly's \"New TV Classics\" list.", "rate": 51, "genre": ["Drama", "Soap"], "cast": ["Thomas Calabro", "Heather Locklear", "Josie Bissett", "Rob Estes", "Kelly Rutherford"], "character": ["Michael Mancini", "Amanda Woodward", "Jane Mancini", "Kyle McBride", "Megan Lewis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4349   Expand Melrose Place   (1992) User Score  Play Trailer Overview Melrose Place is an American primetime soap opera that aired on Fox from July 8, 1992, to May 24, 1999 for seven seasons. It follows the lives of a group of young adults living in a brownstone apartment complex on Melrose Place, in Los Angeles, California. The show was created by Darren Star for Fox and executive produced by Aaron Spelling for his company, Spelling Television. It is the second series in the Beverly Hills, 90210 franchise. Season one and season two were broadcast on Wednesday at 9pm, after Beverly Hills, 90210. In 1994, for its third season premiere, the show moved to Monday at 8pm. The show had many cast changes during the run. Thomas Calabro was the only original cast member to remain on the series throughout its entire run. The show earned several Golden Globe nominations and placed #51 on Entertainment Weekly's \"New TV Classics\" list. Featured Crew Darren Star Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thomas Calabro Michael Mancini Heather Locklear Amanda Woodward Josie Bissett Jane Mancini Rob Estes Kyle McBride Kelly Rutherford Megan Lewis Full Cast & Crew Last Season Season 7 1998 | 35 Episodes Season 7 of Melrose Place premiered on July 27, 1998. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Couples That Should Have Ended Up Together Open 1 by  TheTenth Top 5 Favorite Actresses from this Show? Open 1 by  TheTenth w Amanda: Happy Birthday Heather Locklear! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  1 Recommendations   1997-09-08 Ally McBeal 5.9    1987-04-12 21 Jump Street 6.1    1982-10-03 Voyagers! 7.5    1990-10-04 Beverly Hills, 90210 5.8    1993-01-01 Dr. Quinn, Medicine Woman 6.2    1991-05-11 Sisters 6.7    1980-10-04 Thundarr the Barbarian 6.3    1998-09-29 Felicity 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m, 60m Homepage  - Genres Drama Soap Keywords california neighbor beverly hills Content Score 100 Yes! Looking good! Top Contributors 108 Banana m 8 mode2 e 4 eladme w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}