{"link": "https://www.themoviedb.org/tv/52992?language=en", "title": "Victor Borge Classic Collection", "resume": "Do you love serious classical music?  Well, you've come to the wrong place!  This is classically funny music as only legendary international entertainer Victor Borge, \"the comedian of the keyboard,\" can perform it.  Borge has made generations laugh with his timeless routines and dazzling musicianship.  Here, authorized by Borge's family, are six of \"The Great Dane's\" greatest programs available for the first time in one box set.", "rate": 0, "genre": ["Comedy"], "cast": ["Victor Borge"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52992   Expand Victor Borge Classic Collection   (2008) User Score Overview Do you love serious classical music?  Well, you've come to the wrong place!  This is classically funny music as only legendary international entertainer Victor Borge, \"the comedian of the keyboard,\" can perform it.  Borge has made generations laugh with his timeless routines and dazzling musicianship.  Here, authorized by Borge's family, are six of \"The Great Dane's\" greatest programs available for the first time in one box set. Featured Crew Victor Borge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Victor Borge Himself Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Victor Borge Classic Collection. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  6m Homepage  - Genres Comedy Keywords music variety piano Content Score 50 Still needs a little work. Top Contributors m 22 murphyodea  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}