{"link": "https://www.themoviedb.org/tv/44470?language=en", "title": "Bar Rescue", "resume": "Bar Rescue is an American reality series that premiered on Spike TV on July 17, 2011. It stars Jon Taffer, who offers his professional expertise—at no charge—to desperately failing bars in order to save them from closing.", "rate": 81, "genre": ["Reality"], "cast": ["Jon Taffer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44470   Expand Bar Rescue   (2011) User Score Overview Bar Rescue is an American reality series that premiered on Spike TV on July 17, 2011. It stars Jon Taffer, who offers his professional expertise—at no charge—to desperately failing bars in order to save them from closing. Featured Crew Darrin Reed Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Taffer Full Cast & Crew Current Season Season 6 2018 | 16 Episodes Season 6 of Bar Rescue premiered on March 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   2000-06-17 Even Stevens 7.6    1991-03-01 Clarissa Explains It All 6.2    2012-08-08 Here Comes Honey Boo Boo 1.9    1993-09-10 Bill Nye The Science Guy 7.3    2010-12-01 Storage Wars 5.3    1991-08-11 Doug 7.0    1993-09-18 Rocko's Modern Life 7.7    1997-07-07 Johnny Bravo 6.6  Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://www.paramountnetwork.com/shows/bar-rescue Genres Reality Keywords bar renovation Content Score 64 We're so close, yet so far. Top Contributors b 16 basher 10 Elizabeth Jennings 7 oldboy3 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}