{"link": "https://www.themoviedb.org/tv/73157?language=en", "title": "Future Man", "resume": "Josh Futturman, a janitor by day/world-ranked gamer by night, is tasked with preventing the extinction of humanity after mysterious visitors from the future proclaim him the key to defeating the imminent super-race invasion.", "rate": 75, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Josh Hutcherson", "Eliza Coupe", "Derek Wilson", "Ed Begley Jr.", "Glenne Headly"], "character": ["Josh Futterman", "Tiger", "Wolf", "Gabe Futterman", "Diane Futterman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73157   Expand Future Man   (2017) User Score  Play Trailer Overview Josh Futturman, a janitor by day/world-ranked gamer by night, is tasked with preventing the extinction of humanity after mysterious visitors from the future proclaim him the key to defeating the imminent super-race invasion. Featured Crew Seth Rogen Creator Evan Goldberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  1 Clips  1 Featurettes  3 Opening Credits  0 Top Billed Cast Josh Hutcherson Josh Futterman Eliza Coupe Tiger Derek Wilson Wolf Ed Begley Jr. Gabe Futterman Glenne Headly Diane Futterman Full Cast & Crew Current Season Season 1 2017 | 13 Episodes Season 1 of Future Man premiered on November 14, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply This was hillarious! Open 0 by Innovator\n      \n     Cast Interview From New York Comic Con Open 0 by garethmb\n      \n     Go to Discussions Media Most Popular Videos  6 Backdrops  3 Posters  3 Recommendations   2017-08-13 Get Shorty 6.2    2017-10-01 Ten Days in the Valley 6.0    2018-03-18 Instinct 5.9    2017-02-07 Imposters 7.6    2017-10-02 The Gifted 7.0    2017-12-06 HAPPY! 7.4    2017-10-03 Kevin (Probably) Saves the World 7.3    2018-03-29 Siren 7.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   https://www.hulu.com/future-man Genres Comedy Sci-Fi & Fantasy Keywords time travel coming of age dystopian future genetic engineering unintended consequences Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings 20 Bogdan Mateescu 11 1stShepherd L 10 Law  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}