{"link": "https://www.themoviedb.org/tv/994?language=en", "title": "Kommissar Rex", "resume": "Kommissar Rex is a police procedural drama originally made in Austria and aired from 1994 to 2004. In 2008 the series was revived under Austrian-Italian production, and has since 2009 been made fully in Italy, with occasional episodes set in Austria.\nThe show follows the German Shepherd police dog Rex, his partners and the rest of the team at the Vienna Kriminalpolizei homicide unit, as they work together to solve crimes. Since 2008, the show has been set in Rome.", "rate": 49, "genre": ["Drama", "Comedy"], "cast": ["Gerhard Zemann", "Heinz Weixelbraun", "Martin Weinek", "Gedeon Burkhard", "Elke Winkens"], "character": ["Dr. Leo Graf", "Christian Böck", "Fritz Kunz", "Alexander Brandtner", "Niki Herzog"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 994   Expand Kommissar Rex   (1994) User Score Overview Kommissar Rex is a police procedural drama originally made in Austria and aired from 1994 to 2004. In 2008 the series was revived under Austrian-Italian production, and has since 2009 been made fully in Italy, with occasional episodes set in Austria. The show follows the German Shepherd police dog Rex, his partners and the rest of the team at the Vienna Kriminalpolizei homicide unit, as they work together to solve crimes. Since 2008, the show has been set in Rome. Featured Crew Peter Hajek Creator Peter Moser Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gerhard Zemann Dr. Leo Graf Heinz Weixelbraun Christian Böck Martin Weinek Fritz Kunz Gedeon Burkhard Alexander Brandtner Elke Winkens Niki Herzog Full Cast & Crew Last Season Kommissar rex season 10 2004 | 4 Episodes Season 10 of Kommissar Rex premiered on September 28, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Kommissar Rex. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations   1996-02-24 The Spooktacular New Adventures of Casper 4.4    1983-08-01 Around the World with Willy Fog 7.8    2013-09-26 The Michael J. Fox Show 5.6    1982-10-08 Once upon a time… Space 5.9    1994-09-01 Street Sharks 4.7    1998-09-26 V.I.P. 4.5    1969-11-10 Sesame Street 7.4    1993-09-29 Grace Under Fire 5.3  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  German Runtime  45m Homepage  - Genres Drama Comedy Keywords police police dog Content Score 93 Almost there... Top Contributors S 161 Samara 10 niqo19 h 7 herlock60 N 5 Nomel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}