{"link": "https://www.themoviedb.org/tv/34602?language=en", "title": "Home Troopers", "resume": "Home Troopers is a 2010–11 Hong Kong television serial drama starring Liza Wang, Ha Yu, Kevin Cheng and Bernice Liu. Produced by Lam Chi-wah, the series is a TVB production. The drama follow the lives of the middle class Chukot family, who helps organize a housekeeping business in Hong Kong. The family works through domestic struggles and family changes after eldest son Joseph is left with unpaid company debts handed down by his business partner Fred, who mysteriously disappears with the money not long after they started the Master Home Services Company. Joseph is also left in care for Fred's struggling girlfriend Kam and her 4-year-old son, Sing. Joseph's family, led by his mother Ka-ka, decides to help the business by attending the housekeeping work themselves.\nThe drama's original run premiered on 27 December 2010 on Hong Kong's TVB Jade and TVB HD Jade channels.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34602   Expand Home Troopers User Score Overview Home Troopers is a 2010–11 Hong Kong television serial drama starring Liza Wang, Ha Yu, Kevin Cheng and Bernice Liu. Produced by Lam Chi-wah, the series is a TVB production. The drama follow the lives of the middle class Chukot family, who helps organize a housekeeping business in Hong Kong. The family works through domestic struggles and family changes after eldest son Joseph is left with unpaid company debts handed down by his business partner Fred, who mysteriously disappears with the money not long after they started the Master Home Services Company. Joseph is also left in care for Fred's struggling girlfriend Kam and her 4-year-old son, Sing. Joseph's family, led by his mother Ka-ka, decides to help the business by attending the housekeeping work themselves. The drama's original run premiered on 27 December 2010 on Hong Kong's TVB Jade and TVB HD Jade channels. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.programme.tvb.com/drama/hometroopers Genres Drama Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}