{"link": "https://www.themoviedb.org/tv/72613?language=en", "title": "Cathedral of the Sea", "resume": "Based upon Idelfoso Falcones novel. In the 14th century, Barcelona is experiencing one of its most prosperous moments. The city has grown to La Ribera, a fishing district in which the largest Marian temple ever known is built: Santa María del Mar. But the construction runs parallel to Arnau Estanyol, a serf of the land who, fleeing the abuses of The feudal lords of the countryside take refuge in Barcelona.", "rate": 70, "genre": ["Drama"], "cast": ["Aitor Luna", "Pablo Derqui", "Michelle Jenner"], "character": ["Arnau Estanyol", "Joan", "Mar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72613   Expand Cathedral of the Sea   (2018) User Score Overview Based upon Idelfoso Falcones novel. In the 14th century, Barcelona is experiencing one of its most prosperous moments. The city has grown to La Ribera, a fishing district in which the largest Marian temple ever known is built: Santa María del Mar. But the construction runs parallel to Arnau Estanyol, a serf of the land who, fleeing the abuses of The feudal lords of the countryside take refuge in Barcelona. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aitor Luna Arnau Estanyol Pablo Derqui Joan Michelle Jenner Mar Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Cathedral of the Sea premiered on May 23, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Cathedral of the Sea. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Cathedral of the Sea. You can help by rating TV shows you've seen. Facts Original Name  La catedral del mar Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  50m Homepage   http://www.antena3.com/series/la-catedral-del-mar/ Genres Drama Keywords based on novel or book barcelona 14th century Content Score 64 We're so close, yet so far. Top Contributors 11 tupelihd 10 Elizabeth Jennings R 10 Rebecca 8 dhanny  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}