{"link": "https://www.themoviedb.org/tv/79723?language=en", "title": "The Cool Kids", "resume": "Three guy friends in a retirement community are the top dogs until they’re blown out of the water by the newest member of the community, a female rebel who’s ready to challenge their place – it’s high school with 70 somethings.", "rate": 0, "genre": ["Comedy"], "cast": ["David Alan Grier", "Martin Mull", "Leslie Jordan", "Vicki Lawrence"], "character": ["Hank", "Charlie", "Sid", "Margaret"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79723   Expand The Cool Kids User Score  Play Trailer Overview Three guy friends in a retirement community are the top dogs until they’re blown out of the water by the newest member of the community, a female rebel who’s ready to challenge their place – it’s high school with 70 somethings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Alan Grier Hank Martin Mull Charlie Leslie Jordan Sid Vicki Lawrence Margaret Full Cast & Crew Last Season Season 1 — | 0 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   https://www.fox.com/the-cool-kids/ Genres Comedy Keywords retirement home Content Score 86 Almost there... Top Contributors 25 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}