{"link": "https://www.themoviedb.org/tv/1712?language=en", "title": "The Munsters", "resume": "The Munsters is an American television sitcom depicting the home life of a family of benign monsters. It stars Fred Gwynne as Herman Munster and Yvonne De Carlo as his wife, Lily Munster. The series was a satire of both traditional monster movies and the wholesome family fare of the era, and was produced by the creators of Leave It to Beaver. It ran concurrently with The Addams Family.\nThe series original aired on CBS from September 24, 1964 to May 12, 1966; 70 episodes were produced. It was broadcast weekly on BBC1 in the UK. It was canceled after ratings dropped to a low due to the premiere of ABC's Batman, which was in color. Though ratings were low during its initial two-year run, The Munsters found a large audience in syndication. This popularity warranted a spin-off series, as well as several films, including one with a theatrical release. On October 26, 2012, NBC aired a modern reimagining of The Munsters called Mockingbird Lane.", "rate": 74, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Fred Gwynne", "Yvonne De Carlo", "Butch Patrick", "Al Lewis", "Beverly Owen"], "character": ["Herman Munster", "Lily Munster", "Eddie Munster", "Grandpa", "Marilyn Munster (1-13)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1712   Expand The Munsters   (1964) User Score Overview The Munsters is an American television sitcom depicting the home life of a family of benign monsters. It stars Fred Gwynne as Herman Munster and Yvonne De Carlo as his wife, Lily Munster. The series was a satire of both traditional monster movies and the wholesome family fare of the era, and was produced by the creators of Leave It to Beaver. It ran concurrently with The Addams Family. The series original aired on CBS from September 24, 1964 to May 12, 1966; 70 episodes were produced. It was broadcast weekly on BBC1 in the UK. It was canceled after ratings dropped to a low due to the premiere of ABC's Batman, which was in color. Though ratings were low during its initial two-year run, The Munsters found a large audience in syndication. This popularity warranted a spin-off series, as well as several films, including one with a theatrical release. On October 26, 2012, NBC aired a modern reimagining of The Munsters called Mockingbird Lane. Featured Crew Allan Burns Creator Chris Hayward Creator Bob Mosher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  10 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Fred Gwynne Herman Munster Yvonne De Carlo Lily Munster Butch Patrick Eddie Munster Al Lewis Grandpa Beverly Owen Marilyn Munster (1-13) Full Cast & Crew Last Season Season 2 1965 | 32 Episodes Season 2 of The Munsters premiered on September 16, 1965. View All Seasons Social Reviews  0 Discussions  10 Subject Status Replies Last Reply S If it had continued they would've gotten ridden of Marilyn Open 0 by Strannger18\n      \n     S Season one vs season 2 credits Open 0 by Strannger18\n      \n     S Happy valley Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  4 Recommendations   1965-09-18 I Dream of Jeannie 7.1    1964-09-18 The Addams Family 7.5    1964-09-17 Bewitched 7.1    1964-09-26 Gilligan's Island 6.6    1960-10-03 The Andy Griffith Show 7.4    1966-01-12 Batman 7.0    1978-09-12 Taxi 7.2    1978-03-10 The Incredible Hulk 6.4  Facts Status  Ended Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  30m, 24m Homepage   http://www.munsters.com/ Genres Comedy Drama Sci-Fi & Fantasy Keywords monster vampire werewolf sitcom frankenstein's monster Content Score 100 Yes! Looking good! Top Contributors 16 Banana 15 SuperMario 11 rpeters 9 Abe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}