{"link": "https://www.themoviedb.org/tv/42930?language=en", "title": "Prétear", "resume": "Prétear, also called Prétear - The New Legend of Snow White, is a manga series written by Junichi Sato and illustrated by Kaori Naruse. Spanning four volumes, the manga series was originally published in Japan by Kadokawa Shoten from May 2000 through July 2001. It was published in English in North America by ADV Manga.\nThe series was adapted into a thirteen episode anime series by Hal Film Maker, Kadokawa Shoten, and Rondo Robe. It aired in Japan on WOWOW from April 4, 2001 until June 27, 2001. Geneon released the series episodes across four volumes in Japan in both VHS video and DVD forms. ADV Films had licensed and released the anime series.", "rate": 100, "genre": ["Animation"], "cast": ["Kohsuke Toriumi", "Sayuri Yoshida", "Akemi Kanda", "Akiko Yajima", "Makoto Naruse"], "character": ["Hayate (voice)", "Himeno Awayuki (voice)", "Mawata Awayuki (voice)", "Mannen (voice)", "Kei (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42930   Expand Prétear   (2001) User Score Overview Prétear, also called Prétear - The New Legend of Snow White, is a manga series written by Junichi Sato and illustrated by Kaori Naruse. Spanning four volumes, the manga series was originally published in Japan by Kadokawa Shoten from May 2000 through July 2001. It was published in English in North America by ADV Manga. The series was adapted into a thirteen episode anime series by Hal Film Maker, Kadokawa Shoten, and Rondo Robe. It aired in Japan on WOWOW from April 4, 2001 until June 27, 2001. Geneon released the series episodes across four volumes in Japan in both VHS video and DVD forms. ADV Films had licensed and released the anime series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kohsuke Toriumi Hayate (voice) Sayuri Yoshida Himeno Awayuki (voice) Akemi Kanda Mawata Awayuki (voice) Akiko Yajima Mannen (voice) Makoto Naruse Kei (voice) Full Cast & Crew Last Season Prétear 2001 | 13 Episodes Season 1 of Prétear premiered on April  4, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Prétear. You can help by rating TV shows you've seen. Facts Original Name  新白雪姫伝説プリーティア Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 30 tmdb983464 m 4 magoozin R 3 Rebecca f 2 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}