{"link": "https://www.themoviedb.org/tv/66823?language=en", "title": "Catching Milat", "resume": "A psychological thriller based on the investigation into the 1990s backpacker murders leading to the arrest and conviction of serial killer Ivan Milat. NSW police are on the search for a murderer after the bodies of backpackers are found in Belanglo State Forest. Catching Milat is the story of the men who brought the killer to justice.", "rate": 87, "genre": ["Crime"], "cast": ["Luke Ford", "Craig Hall", "Fletcher Humphrys", "Alex Williams", "Richard Cawthorne"], "character": ["Inspector Bob Godden", "Detective Paul Gordon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66823   Expand Catching Milat   (2015) User Score  Play Trailer Overview A psychological thriller based on the investigation into the 1990s backpacker murders leading to the arrest and conviction of serial killer Ivan Milat. NSW police are on the search for a murderer after the bodies of backpackers are found in Belanglo State Forest. Catching Milat is the story of the men who brought the killer to justice. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Ford Inspector Bob Godden Craig Hall Fletcher Humphrys Alex Williams Richard Cawthorne Detective Paul Gordon Full Cast & Crew Last Season Miniseries 2015 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2010-06-09 Through the Wormhole 7.6    2013-05-01 Wentworth 7.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   https://au.tv.yahoo.com/plus7/catching-milat/ Genres Crime Keywords australia based on a true story murder crime ivan milat Content Score 93 Almost there... Top Contributors TB 24 TMDb Bot 22 OzDrDj 6 Banana S 5 Sud0  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}