{"link": "https://www.themoviedb.org/tv/11197?language=en", "title": "Victoria Wood", "resume": "Victoria Wood was a series of six one-off situation comedies written by and starring Victoria Wood in 1989, who took a break from sketches, two years after her very successful and award winning series Victoria Wood As Seen on TV. Wood appeared as \"Victoria\", a fictionalised version of herself, in all six episodes - in The Library it was said that she \"worked in TV\" and in Over To Pam characters appeared to recognise her celebrity and in the final episode, Staying In, she was taken to a party to perform as a comedienne and was expected to go through her stand-up 'routine'. Her character often broke the 'fourth wall' of TV and spoke directly to the camera, but not in every episode.\nBored with the sketch format and with a yearning to recapture previous success as a playwright, Wood came up with six individual sitcoms as a compromise. She admitted to finding the writing difficult. Though Wood was written as the central character, other lead parts were written with specific actresses in mind, like Julie Walters and Una Stubbs. \"I want people to like me and the people who play my friends, and not everybody else\" she said. Screenonline says of the shows \"Modest in ambition and scale but rich in wit and acuity, the six playlets showcase Wood's eye for human foibles and her distinctively eccentric characters.\".", "rate": 0, "genre": ["Comedy"], "cast": ["Jane Horrocks", "Joan Sims", "Una Stubbs", "Anne Reid", "Liza Tarbuck"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11197   Expand Victoria Wood   (1989) User Score Overview Victoria Wood was a series of six one-off situation comedies written by and starring Victoria Wood in 1989, who took a break from sketches, two years after her very successful and award winning series Victoria Wood As Seen on TV. Wood appeared as \"Victoria\", a fictionalised version of herself, in all six episodes - in The Library it was said that she \"worked in TV\" and in Over To Pam characters appeared to recognise her celebrity and in the final episode, Staying In, she was taken to a party to perform as a comedienne and was expected to go through her stand-up 'routine'. Her character often broke the 'fourth wall' of TV and spoke directly to the camera, but not in every episode. Bored with the sketch format and with a yearning to recapture previous success as a playwright, Wood came up with six individual sitcoms as a compromise. She admitted to finding the writing difficult. Though Wood was written as the central character, other lead parts were written with specific actresses in mind, like Julie Walters and Una Stubbs. \"I want people to like me and the people who play my friends, and not everybody else\" she said. Screenonline says of the shows \"Modest in ambition and scale but rich in wit and acuity, the six playlets showcase Wood's eye for human foibles and her distinctively eccentric characters.\". Featured Crew Victoria Wood Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jane Horrocks Joan Sims Una Stubbs Anne Reid Liza Tarbuck Full Cast & Crew Last Season Season 1 1989 | 6 Episodes Season 1 of Victoria Wood premiered on November 16, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Victoria Wood. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors g 2 guffman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}