{"link": "https://www.themoviedb.org/tv/67439?language=en", "title": "Aftermath", "resume": "The Copeland family battle for survival when civilization comes to an apocalyptic end, triggered by massive storms, meteor strikes, earthquakes, a plague - and the rise of supernatural creatures.", "rate": 60, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Anne Heche", "James Tupper", "Julia Sarah Stone", "Taylor Hickson", "Levi Meaden"], "character": ["Karen Copeland", "Joshua Copeland", "Dana Copeland", "Brianna Copeland", "Matt Copeland"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67439   Expand Aftermath   (2016) User Score  Play Trailer Overview The Copeland family battle for survival when civilization comes to an apocalyptic end, triggered by massive storms, meteor strikes, earthquakes, a plague - and the rise of supernatural creatures. Featured Crew Glenn Davis Creator William Laurin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne Heche Karen Copeland James Tupper Joshua Copeland Julia Sarah Stone Dana Copeland Taylor Hickson Brianna Copeland Levi Meaden Matt Copeland Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Aftermath premiered on September 27, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Matt: Happy Birthday Levi Meaden! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2016-04-01 Wynonna Earp 6.3    2016-10-03 Timeless 7.0    2016-09-23 Van Helsing 5.6    2016-11-30 Incorporated 6.1    2016-10-11 Channel Zero 6.6    1955-09-20 Cheyenne 7.1    2015-11-27 South of Hell 5.9    2015-11-11 The Frankenstein Chronicles 6.9  Facts Status  Cancelled Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.syfy.com/aftermath Genres Sci-Fi & Fantasy Keywords post-apocalyptic survival family Content Score 100 Yes! Looking good! Top Contributors 35 Elizabeth Jennings 13 Mitsarinho w 10 webmaster b 7 bugfix  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}