{"link": "https://www.themoviedb.org/tv/66346?language=en", "title": "After the Thrones", "resume": "Weekly show that takes a lively, humorous and sophisticated look at Game of Thrones. Each week, the show will recap the latest episode, explaining the different events, exploring the complicated politics and history, and offering absurd and not-so-absurd theories about future episodes.", "rate": 46, "genre": ["Talk"], "cast": ["Andy Greenwald"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66346   Expand After the Thrones   (2016) User Score Overview Weekly show that takes a lively, humorous and sophisticated look at Game of Thrones. Each week, the show will recap the latest episode, explaining the different events, exploring the complicated politics and history, and offering absurd and not-so-absurd theories about future episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andy Greenwald Himself - Host Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of After the Thrones premiered on April 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2002-10-31 Värsta språket 6.0    2013-11-07 Folkets främsta företrädare 5.0    1987-09-05 På spåret 5.0    1999-01-18 Parlamentet 3.0    2011-01-06 The Reckoning 3.7    2004-08-30 John Safran vs God 7.3    2001-01-17 Uppdrag granskning 6.8    2015-12-01 1000 Years until Christmas Eve 7.0  Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  - Homepage   http://www.hbo.com/after-the-thrones Genres Talk Keywords after show Content Score 56 We're so close, yet so far. Top Contributors 19 Elizabeth Jennings P 3 PERTIWI 3 Banana l 2 lampard22  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}