{"link": "https://www.themoviedb.org/tv/13591?language=en", "title": "Scientific American Frontiers", "resume": "Scientific American Frontiers was an American television program primarily focused on informing the public about new technologies and discoveries in science and medicine. It was a companion program to the Scientific American magazine. The show was produced for PBS in the U.S. by The Chedd-Angier Production Company, Watertown, Massachusetts, and typically aired once every two to four weeks. To this day, the shows can be viewed on-line at their website, and continue to air regularly on the national digital channel World.\nThe show first aired in 1990 with MIT professor Woodie Flowers who served as the original host from 1990 to the spring of 1993. Actor Alan Alda became the permanent host starting in the fall season of 1993 and continued until the show ended in 2005. Alda's tenure has been notable for his humble and often humorous approach: in one memorable segment, he became car sick while driving an experimental, virtual reality vehicle. In 2005, Alda published his first round of memoirs, Never Have Your Dog Stuffed: and Other Things I've Learned, published by Random House; in the book, he recalls his intestines becoming strangulated while on location in Chile for the show, an incident that nearly cost him his life since he was in a remote region and it was difficult to get to a doctor. Finally he found one, who turned out to be a MAS*H fan. Further, the treatment was familiar to Alda; the historical development of techniques for vascular anastomosis during the Korean war had featured in the show's scripts.", "rate": 0, "genre": ["Documentary"], "cast": ["Woodie Flowers", "Alan Alda"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13591   Expand Scientific American Frontiers   (1990) User Score Overview Scientific American Frontiers was an American television program primarily focused on informing the public about new technologies and discoveries in science and medicine. It was a companion program to the Scientific American magazine. The show was produced for PBS in the U.S. by The Chedd-Angier Production Company, Watertown, Massachusetts, and typically aired once every two to four weeks. To this day, the shows can be viewed on-line at their website, and continue to air regularly on the national digital channel World. The show first aired in 1990 with MIT professor Woodie Flowers who served as the original host from 1990 to the spring of 1993. Actor Alan Alda became the permanent host starting in the fall season of 1993 and continued until the show ended in 2005. Alda's tenure has been notable for his humble and often humorous approach: in one memorable segment, he became car sick while driving an experimental, virtual reality vehicle. In 2005, Alda published his first round of memoirs, Never Have Your Dog Stuffed: and Other Things I've Learned, published by Random House; in the book, he recalls his intestines becoming strangulated while on location in Chile for the show, an incident that nearly cost him his life since he was in a remote region and it was difficult to get to a doctor. Finally he found one, who turned out to be a M A S*H fan. Further, the treatment was familiar to Alda; the historical development of techniques for vascular anastomosis during the Korean war had featured in the show's scripts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Woodie Flowers Alan Alda Full Cast & Crew Last Season Season 15 2005 | 10 Episodes Season 15 of Scientific American Frontiers premiered on January 19, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Scientific American Frontiers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.pbs.org/saf/ Genres Documentary Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}