{"link": "https://www.themoviedb.org/tv/77476?language=en", "title": "Creaking Heroes", "resume": "The program shows ordinary people without special talents transform into “heroes” through various missions and training, under the slogan “everyone can be a hero.”", "rate": 70, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Hoshi", "Din Din", "Nam Woo-hyun", "Sam Hammington", "Yoo Byung Jae"], "character": ["Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77476   Expand Creaking Heroes   (2018) User Score Overview The program shows ordinary people without special talents transform into “heroes” through various missions and training, under the slogan “everyone can be a hero.” Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  1 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Hoshi Himself Din Din Nam Woo-hyun Himself Sam Hammington Himself Yoo Byung Jae Himself Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Creaking Heroes premiered on February 26, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Creaking Heroes. You can help by rating TV shows you've seen. Facts Original Name  삐그덕 히어로즈 Status  Returning Series Network Certification 12 Meaning This rating is for programs that may deemed inappropriate for those younger than 12, and parental discretion should be used. Usually used for animations that have stronger themes or violence then those designed for children, or for reality shows that have mild violence, themes, or language. Type  Scripted Original Language  Korean Runtime  75m Homepage  - Genres Action & Adventure Comedy Keywords variety Content Score 79 Pump it up! We're close now. Top Contributors 34 Lumina_B TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}