{"link": "https://www.themoviedb.org/tv/11385?language=en", "title": "Dad", "resume": "Dad is a BBC1 sitcom that ran for 13 episodes over two series and a Christmas special. Described by the BBC as a 'generation-gap comedy', it starred George Cole as Brian Hook, Kevin McNally as his son Alan Hook, and Toby Ross-Bryant as his son Vincent Hook and Julia Hills as his wife Beryl Hook. Written by Andrew Marshall, the title of each episode was a pun on the word 'Dad'.\nMost of the episodes involved Alan Hook getting frustrated by situations brought upon him by his father and son. For example, in 'Dadmestic', Vincent's mother allows him to host a house party, leaving Alan with no alternative but to spend the evening at his father's house. In the episode 'Habadadery', Brian comes down with a bout of illness, meaning that Alan has to look after him. Brian then takes Alan to 'Mr Nigel's shop', where Alan's middle-aged style crisis goes from bad to worse as he purchases an extremely bold Hawaiian shirt.\nThe theme tune for the first series was the 1965 hit 'Tijuana Taxi' performed by Herb Alpert & the Tijuana Brass. For the second series this was replaced with the song 'Go Daddy-O' by Californian swing revival band Big Bad Voodoo Daddy.", "rate": 60, "genre": ["Comedy"], "cast": ["George Cole", "Kevin McNally", "Julia Hills"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11385   Expand Dad   (1997) User Score Overview Dad is a BBC1 sitcom that ran for 13 episodes over two series and a Christmas special. Described by the BBC as a 'generation-gap comedy', it starred George Cole as Brian Hook, Kevin McNally as his son Alan Hook, and Toby Ross-Bryant as his son Vincent Hook and Julia Hills as his wife Beryl Hook. Written by Andrew Marshall, the title of each episode was a pun on the word 'Dad'. Most of the episodes involved Alan Hook getting frustrated by situations brought upon him by his father and son. For example, in 'Dadmestic', Vincent's mother allows him to host a house party, leaving Alan with no alternative but to spend the evening at his father's house. In the episode 'Habadadery', Brian comes down with a bout of illness, meaning that Alan has to look after him. Brian then takes Alan to 'Mr Nigel's shop', where Alan's middle-aged style crisis goes from bad to worse as he purchases an extremely bold Hawaiian shirt. The theme tune for the first series was the 1965 hit 'Tijuana Taxi' performed by Herb Alpert & the Tijuana Brass. For the second series this was replaced with the song 'Go Daddy-O' by Californian swing revival band Big Bad Voodoo Daddy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Cole Kevin McNally Julia Hills Full Cast & Crew Last Season (1997) season 2 1999 | 7 Episodes Season 2 of Dad premiered on January 11, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dad. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords frustration family sitcom british humour Content Score 56 We're so close, yet so far. Top Contributors O 8 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}