{"link": "https://www.themoviedb.org/tv/8392?language=en", "title": "Popeye the Sailor", "resume": "Popeye the Sailor is an animated TV series produced for ABC through King Features Syndicate that ran from 1960 to 1962 for 220 episodes. Episodes were animated by various production studios: Larry Harmon Pictures, Rembrandt Films/Halas and Batchelor, Gerald Ray Studios, Jack Kinney Productions and Paramount Cartoon Studios. The executive producer of the series was Al Brodax.", "rate": 63, "genre": ["Action", "Adventure", "Animation", "Comedy", "Kids"], "cast": ["Mae Questel", "Jackson Beck", "Jack Mercer"], "character": ["Olive Oyl / Swee'pea / The Sea Hag / Cheese People / Medusa / Children", "Brutus / Professor / Narrator / King Blozo / Rough House / Geezil", "Popeye / Wimpy / Poopdeck Pappy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8392   Expand Popeye the Sailor   (1960) User Score Overview Popeye the Sailor is an animated TV series produced for ABC through King Features Syndicate that ran from 1960 to 1962 for 220 episodes. Episodes were animated by various production studios: Larry Harmon Pictures, Rembrandt Films/Halas and Batchelor, Gerald Ray Studios, Jack Kinney Productions and Paramount Cartoon Studios. The executive producer of the series was Al Brodax. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mae Questel Olive Oyl / Swee'pea / The Sea Hag / Cheese People / Medusa / Children Jackson Beck Brutus / Professor / Narrator / King Blozo / Rough House / Geezil Jack Mercer Popeye / Wimpy / Poopdeck Pappy Full Cast & Crew Last Season Season 1 1960 | 169 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply T Why does he love Olive Oyl so much? Open 0 by Thekingisnotdead\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1968-09-14 Wacky Races 7.1    1964-12-18 The Pink Panther Show 7.0    1940-11-25 The Woody Woodpecker Show 7.1    1986-09-22 Dennis the Menace 5.6    1983-09-10 Inspector Gadget 6.6    1961-09-27 Top Cat 6.9    1962-09-23 The Jetsons 6.6    1960-10-11 The Bugs Bunny Show 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  5m Homepage  - Genres Action & Adventure Animation Comedy Kids Keywords witch adventure cartoon old man sailor popeye Content Score 56 We're so close, yet so far. Top Contributors N 33 Notamymerrick D 4 DracoAn 3 niqo19 w 2 webmachine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}