{"link": "https://www.themoviedb.org/tv/46342?language=en", "title": "Okamikakushi - Masque of the Wolf", "resume": "Kuzumi Hiroshi moves with his crippled sister and his father to  the remote city of Jouga, which is famous for its hassaku citrus and the  rumors that a species of enormous wolves once lived in the area. While  some of the residents are more than friendly, when people begin to  vanish suddenly, it becomes apparent that something sinister is afoot...", "rate": 80, "genre": ["Animation"], "cast": ["Yu Kobayashi", "Keiji Fujiwara", "Mai Fuchigami", "Tamio Ohki", "Yuko Goto"], "character": ["Hiroshi Kuzumi", "Masaaki Kuzumi", "Kaname Asagiri", "Juuzou Kushinada", "Kaori Mana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46342   Expand Okamikakushi - Masque of the Wolf    (2010) User Score Overview Kuzumi Hiroshi moves with his crippled sister and his father to  the remote city of Jouga, which is famous for its hassaku citrus and the  rumors that a species of enormous wolves once lived in the area. While  some of the residents are more than friendly, when people begin to  vanish suddenly, it becomes apparent that something sinister is afoot... Featured Crew Touko Machida Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yu Kobayashi Hiroshi Kuzumi Keiji Fujiwara Masaaki Kuzumi Mai Fuchigami Kaname Asagiri Tamio Ohki Juuzou Kushinada Yuko Goto Kaori Mana Full Cast & Crew Last Season Ookami kakushi season 1 2010 | 12 Episodes Season 1 of Okamikakushi - Masque of the Wolf  premiered on January  7, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Okamikakushi - Masque of the Wolf . You can help by rating TV shows you've seen. Facts Original Name  おおかみかくし Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 23 BrerFox t 7 tmdb983464 x 3 xoINARIox m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}