{"link": "https://www.themoviedb.org/tv/47301?language=en", "title": "Jewels", "resume": "Sarah Thompson, an American visiting England, meets and marries William Whitfield, the Duke of Whitfield. They settle in a chateau in France and begin a family. World War II interrupts their happiness and alters their future. After the war, the family helps war survivors by buying their jewelry and eventually opens a jewelry store, which rapidly becomes a success. But conflicts abound as new generations arise and forces from both outside and within threaten the store and the family.", "rate": 35, "genre": ["Drama"], "cast": ["Simon Oates", "Ursula Howells", "Geoffrey Whitehead", "Arthur Cox", "Robert Wagner"], "character": ["Edward Thompson", "The Duchess", "King George", "Sir Harcourt Griffiths", "Charles Davenport"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47301   Expand Jewels   (1992) User Score Overview Sarah Thompson, an American visiting England, meets and marries William Whitfield, the Duke of Whitfield. They settle in a chateau in France and begin a family. World War II interrupts their happiness and alters their future. After the war, the family helps war survivors by buying their jewelry and eventually opens a jewelry store, which rapidly becomes a success. But conflicts abound as new generations arise and forces from both outside and within threaten the store and the family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Oates Edward Thompson Ursula Howells The Duchess Geoffrey Whitehead King George Arthur Cox Sir Harcourt Griffiths Robert Wagner Charles Davenport Full Cast & Crew Last Season Miniseries 1992 | 5 Episodes Season 1 of Jewels premiered on October 18, 1992. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Jewels. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Jewels. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  114m Homepage  - Genres Drama Keywords based on novel or book jewelry family relationships miniseries Content Score 86 Almost there... Top Contributors R 26 Rebecca TB 19 TMDb Bot h 6 hanyny  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}