{"link": "https://www.themoviedb.org/tv/44230?language=en", "title": "1+2=Paradise", "resume": "A strange relationship develops between college-boy Yusuke and the  beautiful twins, Yuika and Rika, he saves from a wild dog. The girls  falls for their dauntless hero, but Yusuke is pathologically scared of  women", "rate": 45, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44230   Expand 1+2=Paradise   (1990) User Score Overview A strange relationship develops between college-boy Yusuke and the  beautiful twins, Yuika and Rika, he saves from a wild dog. The girls  falls for their dauntless hero, but Yusuke is pathologically scared of  women Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season 1+2=Paradise 1990 | 2 Episodes Season 1 of 1+2=Paradise premiered on February 23, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on 1+2=Paradise. You can help by rating TV shows you've seen. Facts Original Name  １＋２＝パラダイス Status  Ended Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Comedy Keywords sex harem phobia teenager twins gynecologist flirting Content Score 43 There's no 'I' in team... Top Contributors 21 minusha97 t 9 tmdb983464 1 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}