{"link": "https://www.themoviedb.org/tv/68151?language=en", "title": "Hunting Season", "resume": "Hunting Season is an American LGBT-themed comedy-drama web series created by Jon Marcus. Following the romantic and sexual exploits of Alex (Ben Baur) and his small group of friends in New York City, the story was inspired by and largely based on the 2005–08 blog The Great Cock Hunt and the 2008 novel of the same name published by Kensington Books.", "rate": 70, "genre": ["Comedy"], "cast": ["Ben Baur", "Walker Hare", "Jack Ferver", "Marc Sinoway", "Jake Manabat"], "character": ["Alex", "Lenny", "Nick", "Tommy", "TJ"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68151   Expand Hunting Season   (2012) User Score Overview Hunting Season is an American LGBT-themed comedy-drama web series created by Jon Marcus. Following the romantic and sexual exploits of Alex (Ben Baur) and his small group of friends in New York City, the story was inspired by and largely based on the 2005–08 blog The Great Cock Hunt and the 2008 novel of the same name published by Kensington Books. Featured Crew Jon Marcus Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Baur Alex Walker Hare Lenny Jack Ferver Nick Marc Sinoway Tommy Jake Manabat TJ Full Cast & Crew Last Season Season 2 2015 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Hunting Season. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  12m Homepage   http://huntingseason.tv/ Genres Comedy Keywords new york gay writer lgbt blogger queer Content Score 100 Yes! Looking good! Top Contributors 29 gayso 18 lekoshu e 10 error666 A 10 Asterix_cz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}