{"link": "https://www.themoviedb.org/tv/59097?language=en", "title": "Highway Thru Hell", "resume": "Follow the operations of Jamie Davis Motor Truck, a heavy vehicle rescue and recovery towing company based in Hope, British Columbia focusing on the hardships of operating along the highways of the BC Interior, especially the Coquihalla Highway, which is notorious for rapidly changing weather.", "rate": 70, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59097   Expand Highway Thru Hell   (2012) User Score  Play Trailer Overview Follow the operations of Jamie Davis Motor Truck, a heavy vehicle rescue and recovery towing company based in Hope, British Columbia focusing on the hardships of operating along the highways of the BC Interior, especially the Coquihalla Highway, which is notorious for rapidly changing weather. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 6 2017 | 14 Episodes Season 6 of Highway Thru Hell premiered on September  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   Scam City 7.0    2017-11-17 Shot in the Dark 7.4    2006-03-13 Canada's Worst Handyman 5.0    2014-04-20 Filthy Riches 6.7    2007-05-17 Embarrassing Bodies 6.8    2014-01-14 Friday Night Tykes 6.8    1997-11-24 Breaking the Magician's Code: Magic's Biggest Secrets Finally Revealed 7.6  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://www.discovery.ca/Shows/Highway-Thru-Hell Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 19 United600 8 Elizabeth Jennings b 7 basher n 7 nnccll  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}