{"link": "https://www.themoviedb.org/tv/72700?language=en", "title": "Earth's Greatest Spectacles", "resume": "Set in three of the most seasonally changeable landscapes on earth - Svalbard, Okavango and New England - this series showcases the stunning transformations that occur each year, revealing the unique processes behind them and showing how wildlife has adapted to cope with the changes.", "rate": 100, "genre": ["Documentary"], "cast": ["Domhnall Gleeson"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72700   Expand Earth's Greatest Spectacles   (2016) User Score Overview Set in three of the most seasonally changeable landscapes on earth - Svalbard, Okavango and New England - this series showcases the stunning transformations that occur each year, revealing the unique processes behind them and showing how wildlife has adapted to cope with the changes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Domhnall Gleeson Himself - Narrator Full Cast & Crew Last Season Season 1 2016 | 3 Episodes Season 1 of Earth's Greatest Spectacles premiered on February  5, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Earth's Greatest Spectacles. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Earth's Greatest Spectacles. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  59m Homepage   http://www.bbc.co.uk/programmes/b0702s77 Genres Documentary Keywords miniseries nature nature documentary Content Score 56 We're so close, yet so far. Top Contributors s 23 simonzhb 18 Elizabeth Jennings TB 18 TMDb Bot 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}