{"link": "https://www.themoviedb.org/tv/24856?language=en", "title": "Jinki: Extend", "resume": "Jinki: Extend is a 13-episode mecha anime series that aired on TV Asahi in 2005 as well as a currently running manga series. It takes place in two parts, in Venezuela during 1988, and in Tokyo, Japan in 1991 The story revolves around two girls who end up piloting giant humanoid robots called \"Jinki\" and the manipulation behind the scenes that drew them inexorably together in a final battle. The 13th episode was never aired, and is included only in the DVD release. This title was picked up in North America by ADV Films for $91,000, who released the series in three volumes and box set. However, in 2008, the title along with over thirty other ADV titles were transferred to Funimation Entertainment.\nIn the beginning of 2007, Tunashima Shirou didn't agree with his chief-editor about changing the story's focus on mechas to focus more on the characters, and Jinki: EXTEND's former publisher monthly shōnen manga magazine Comic Blade dropped the series from its pages. The series will continue running on the bimonthly seinen manga magazine Dengeki Moeoh.\nIt is also notable for being the only anime series to date whose story takes place in Venezuela.", "rate": 75, "genre": ["Animation"], "cast": ["Fumiko Orikasa", "Takuma Takewaka", "Yūna Inamura", "Satsuki Yukino", "Rokuro Naya"], "character": ["Aoba Tsuzaki", "Ryouhei Ogawara", "Akao Hiiragi", "Shizuka Tsuzaki", "Genta Ogawara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24856   Expand Jinki: Extend   (2007) User Score Overview Jinki: Extend is a 13-episode mecha anime series that aired on TV Asahi in 2005 as well as a currently running manga series. It takes place in two parts, in Venezuela during 1988, and in Tokyo, Japan in 1991 The story revolves around two girls who end up piloting giant humanoid robots called \"Jinki\" and the manipulation behind the scenes that drew them inexorably together in a final battle. The 13th episode was never aired, and is included only in the DVD release. This title was picked up in North America by ADV Films for $91,000, who released the series in three volumes and box set. However, in 2008, the title along with over thirty other ADV titles were transferred to Funimation Entertainment. In the beginning of 2007, Tunashima Shirou didn't agree with his chief-editor about changing the story's focus on mechas to focus more on the characters, and Jinki: EXTEND's former publisher monthly shōnen manga magazine Comic Blade dropped the series from its pages. The series will continue running on the bimonthly seinen manga magazine Dengeki Moeoh. It is also notable for being the only anime series to date whose story takes place in Venezuela. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fumiko Orikasa Aoba Tsuzaki Takuma Takewaka Ryouhei Ogawara Yūna Inamura Akao Hiiragi Satsuki Yukino Shizuka Tsuzaki Rokuro Naya Genta Ogawara Full Cast & Crew Last Season Season 1 2005 | 13 Episodes Season 1 of Jinki: Extend premiered on January  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jinki: Extend. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.jinki.info/ Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin e 3 elibiva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}