{"link": "https://www.themoviedb.org/tv/37704?language=en", "title": "Bucket & Skinner's Epic Adventures", "resume": "Bucket & Skinner's Epic Adventures is an American teen sitcom that premiered on Nickelodeon on July 1, 2011. The first half of the first season ended on October 7, 2011. After a five-month hiatus, the second half premiered March 17, 2012. Ashley Argota confirmed on July 5, 2012 that Nickelodeon has cancelled the show. According to Argota, it is unknown if the rest of the episodes will air in the US, however all episodes were broadcast in other countries. On December 22, 2012 TeenNick aired the previous never before seen in the US, Christmas episode. Starting March 27, 2013, the previous 7 never before aired in the US episodes aired on TeenNick in the US.", "rate": 0, "genre": ["Comedy"], "cast": ["Ashley Argota", "Tiffany Espensen", "Jennette McCurdy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37704   Expand Bucket & Skinner's Epic Adventures   (2011) User Score Overview Bucket & Skinner's Epic Adventures is an American teen sitcom that premiered on Nickelodeon on July 1, 2011. The first half of the first season ended on October 7, 2011. After a five-month hiatus, the second half premiered March 17, 2012. Ashley Argota confirmed on July 5, 2012 that Nickelodeon has cancelled the show. According to Argota, it is unknown if the rest of the episodes will air in the US, however all episodes were broadcast in other countries. On December 22, 2012 TeenNick aired the previous never before seen in the US, Christmas episode. Starting March 27, 2013, the previous 7 never before aired in the US episodes aired on TeenNick in the US. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashley Argota Tiffany Espensen Jennette McCurdy Full Cast & Crew Last Season Season 1 2011 | 32 Episodes Season 1 of Bucket & Skinner's Epic Adventures premiered on July  1, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Bucket & Skinner's Epic Adventures. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.nick.com/shows/the-epic-adventures-of-bucket-and-skinner/about Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors s 3 speedycars 2 Alexandre Oliveira 2 DarkMan S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}