{"link": "https://www.themoviedb.org/tv/3315?language=en", "title": "Surgical Spirit", "resume": "Surgical spirit is a British situation-comedy television series starring Nichola McAuliffe and Duncan Preston that was broadcast from 14 April 1989 through to 7 July 1995. It was written by Annie Bruce, Raymond Dixon, Graeme Garden, Peter Learmouth, Paul McKenzie and Annie Wood. It was made for the ITV network by Humphrey Barclay Productions for Granada Television.", "rate": 80, "genre": ["Comedy"], "cast": ["Duncan Preston", "Nichola McAuliffe", "Marji Campi", "Suzette Llewellyn"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3315   Expand Surgical Spirit   (1989) User Score Overview Surgical spirit is a British situation-comedy television series starring Nichola McAuliffe and Duncan Preston that was broadcast from 14 April 1989 through to 7 July 1995. It was written by Annie Bruce, Raymond Dixon, Graeme Garden, Peter Learmouth, Paul McKenzie and Annie Wood. It was made for the ITV network by Humphrey Barclay Productions for Granada Television. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Duncan Preston Nichola McAuliffe Marji Campi Suzette Llewellyn Full Cast & Crew Last Season Season 7 1995 | 7 Episodes Season 7 of Surgical Spirit premiered on May 26, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Surgical Spirit. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords surgeon workplace hospital sitcom british humour workplace comedy Content Score 86 Almost there... Top Contributors O 9 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}