{"link": "https://www.themoviedb.org/tv/1341?language=en", "title": "Lola...Érase una vez", "resume": "Lola... Érase Una Vez is a teen targeted Mexican melodrama telenovela produced by Televisa that is an adaptation of the Argentine global phenomenon and teenage telenovela Floricienta. The show tells the story of a modern Cinderella, Lola, a 20 year old girl, who works as a nanny and sings in a rock band and meets her so call Prince Charming. It debuted in Mexico on February 26, 2007, starring Aarón Díaz and Eiza González. The show had gained popularity among teens and children not only in Mexico but also internationally including Venezuela, Spain and the in United States. With concert performances filling major auditoriums and songs by the protagonist become radio hits. It debuted in the United States on Univision in March 2008 and ended on January 26, 2009. The series consisted of 224 episodes which aried Monday through Friday at 3 P.M, intentionally for teenagers to watch after school, as is typical for most teenage & children telenovelas in Spanish networks. The U.S. DVD release date was on January 6, 2009 nationwide.\nThe series, produced by Pedro Damián and associate producer Luis Luisillo Miguel and originally created by Cris Morena, portrays the life of a modern-day Cinderella named Lola Valente, who resides in Mexico City, as a part-time worker on the Von Ferdinand mansion. Lola...Érase Una Vez includes the songs as \"Si Me Besas\" & \"Masoquismo\", Espiral, Princesa and Sapo Azul, among others. In March 2009, González won New Artist/Revelation of the Year at the Premio Lo Nuestro Awards. González was nominated for Best New Artist at the Premios Oye!, alongside Jesse & Joy and María José. Gonzalez also performed in 2008 in los premios juventude. The show didn't reach the success of its predecessor, Rebelde and was moved from Canal de las Estrellas to Canal 5. It still spawned a series of licensed products, a sold out tour, a magazine and an album which received Golden certification.", "rate": 70, "genre": ["Drama", "Soap"], "cast": ["Aarón Díaz"], "character": ["Alexander Von Ferdinand"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1341   Expand Lola...Érase una vez   (2007) User Score Overview Lola... Érase Una Vez is a teen targeted Mexican melodrama telenovela produced by Televisa that is an adaptation of the Argentine global phenomenon and teenage telenovela Floricienta. The show tells the story of a modern Cinderella, Lola, a 20 year old girl, who works as a nanny and sings in a rock band and meets her so call Prince Charming. It debuted in Mexico on February 26, 2007, starring Aarón Díaz and Eiza González. The show had gained popularity among teens and children not only in Mexico but also internationally including Venezuela, Spain and the in United States. With concert performances filling major auditoriums and songs by the protagonist become radio hits. It debuted in the United States on Univision in March 2008 and ended on January 26, 2009. The series consisted of 224 episodes which aried Monday through Friday at 3 P.M, intentionally for teenagers to watch after school, as is typical for most teenage & children telenovelas in Spanish networks. The U.S. DVD release date was on January 6, 2009 nationwide. The series, produced by Pedro Damián and associate producer Luis Luisillo Miguel and originally created by Cris Morena, portrays the life of a modern-day Cinderella named Lola Valente, who resides in Mexico City, as a part-time worker on the Von Ferdinand mansion. Lola...Érase Una Vez includes the songs as \"Si Me Besas\" & \"Masoquismo\", Espiral, Princesa and Sapo Azul, among others. In March 2009, González won New Artist/Revelation of the Year at the Premio Lo Nuestro Awards. González was nominated for Best New Artist at the Premios Oye!, alongside Jesse & Joy and María José. Gonzalez also performed in 2008 in los premios juventude. The show didn't reach the success of its predecessor, Rebelde and was moved from Canal de las Estrellas to Canal 5. It still spawned a series of licensed products, a sold out tour, a magazine and an album which received Golden certification. Featured Crew Cris Morena Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aarón Díaz Alexander Von Ferdinand Full Cast & Crew Last Season Season 1 2007 | 8 Episodes Season 1 of Lola...Érase una vez premiered on February 26, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lola...Érase una vez. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage   http://www.esmas.com/lolaeraseunavez Genres Drama Soap Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 67 Amanda TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}