{"link": "https://www.themoviedb.org/tv/67458?language=en", "title": "The Interestings", "resume": "Based on the Meg Wolitzer's novel about a group of friends who meet at an arts camp when they're 15 in 1974. The series chronicles their relationships throughout the next three decades dealing with the great expectations of youth juxtaposed with the realities life hands you as you get older.", "rate": 70, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67458   Expand The Interestings   (2016) User Score Overview Based on the Meg Wolitzer's novel about a group of friends who meet at an arts camp when they're 15 in 1974. The series chronicles their relationships throughout the next three decades dealing with the great expectations of youth juxtaposed with the realities life hands you as you get older. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 1 Episode Season 1 of The Interestings premiered on June 16, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Interestings. You can help by rating TV shows you've seen. Facts Status  Pilot Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://amzn.com/B01G9CH0AK Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 11 Elizabeth Jennings 6 ChurchChill s 2 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}