{"link": "https://www.themoviedb.org/tv/15886?language=en", "title": "Minuscule: The Private Life of Insects", "resume": "Minuscule—the private life of insects is a French-made series of short video animations giving \"a bird's eye view of insects' day to day existence, distorted through a burlesque, yet poetic lens\". The characters are computer-modelled in 3D and set against natural scenery. Each animation has a self-contained and usually humorous storyline. The audio is a combination of genuine insect and ambient recordings with artificial sound effects. The various protagonist insects often perform anthropomorphic activities, displaying ironically portrayed intelligence, enjoyment and, sometimes, pathos. The background settings are generally of rural France, and include farm houses, fences, cars, road surfaces, drains, gutters and garbage bins. In Season 1 episodes, humans appeared only peripherally and large farm animals were the main reluctant witnesses to the variety of insect, spider and mollusc activities. Some Season 2 episodes depict more explicit interaction with humans. Production of a feature film was commenced in March 2012. The feature film titled Minuscule: Valley of the Lost Ants, was released on January 29, 2014.", "rate": 89, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15886   Expand Minuscule: The Private Life of Insects   (2006) User Score Overview Minuscule—the private life of insects is a French-made series of short video animations giving \"a bird's eye view of insects' day to day existence, distorted through a burlesque, yet poetic lens\". The characters are computer-modelled in 3D and set against natural scenery. Each animation has a self-contained and usually humorous storyline. The audio is a combination of genuine insect and ambient recordings with artificial sound effects. The various protagonist insects often perform anthropomorphic activities, displaying ironically portrayed intelligence, enjoyment and, sometimes, pathos. The background settings are generally of rural France, and include farm houses, fences, cars, road surfaces, drains, gutters and garbage bins. In Season 1 episodes, humans appeared only peripherally and large farm animals were the main reluctant witnesses to the variety of insect, spider and mollusc activities. Some Season 2 episodes depict more explicit interaction with humans. Production of a feature film was commenced in March 2012. The feature film titled Minuscule: Valley of the Lost Ants, was released on January 29, 2014. Featured Crew Thomas Szabo Creator Hélène Giraud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2012 | 102 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1990-01-01 Mr. Bean 7.8    1989-06-10 Tales from the Crypt 7.7  Facts Original Name  Minuscule Status  Ended Network Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  6m Homepage   http://minuscule.tv/ Genres Animation Keywords insect animation Content Score 64 We're so close, yet so far. Top Contributors 28 SWFT Ls 9 LeDan stam m 7 miroslav.kakas@gmail.com TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}