{"link": "https://www.themoviedb.org/tv/11089?language=en", "title": "Mock the Week", "resume": "Mock the Week is a British topical celebrity panel game hosted by Dara Ó Briain. The game is influenced by improvised topical stand-up comedy, with several rounds requiring players to deliver answers on unexpected subjects on the spur of the moment.", "rate": 74, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11089   Expand Mock the Week   (2005) User Score  Play Trailer Overview Mock the Week is a British topical celebrity panel game hosted by Dara Ó Briain. The game is influenced by improvised topical stand-up comedy, with several rounds requiring players to deliver answers on unexpected subjects on the spur of the moment. Featured Crew Dan Patterson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Series 17 2018 | 3 Episodes Season 17 of Mock the Week premiered on June  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations   1996-11-12 Never Mind the Buzzcocks 7.5    1994-07-04 Room 101 5.9    1990-09-28 Have I Got News for You 7.6    1965-07-22 Till Death Us Do Part 7.2    1984-02-26 Spitting Image 7.8    1976-02-20 Open All Hours 7.7    2008-09-24 Celebrity Juice 7.3    1987-01-07 Filthy Rich & Catflap 6.7  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  24m, 29m, 30m Homepage   http://www.bbc.co.uk/programmes/b006t6vf Genres Comedy Keywords satire political humour british humour Content Score 71 Just a little bit more... Top Contributors 36 Elizabeth Jennings 14 Ash 7 Jack Moorhouse O 5 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}