{"link": "https://www.themoviedb.org/tv/47652?language=en", "title": "Young MacGyver", "resume": "Know the enemy. See the enemy. Fight the enemy, with the enemy.\nThe Nephew of original MacGyver leaves school and for fun joins the Phoenix Foundation (The guy organisation his uncle belonged to). As expected the \"Young MacGyver\" finds his talents closely match his uncles. Only the unaired Pilot episode is known to exist.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Alan Loayza", "Jared Padalecki", "Lee Burns", "Ron Canada", "Tracey McCall"], "character": ["Young MacGyver", "Firefighter", "The General", "Tracy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47652   Expand Young MacGyver User Score Overview Know the enemy. See the enemy. Fight the enemy, with the enemy. The Nephew of original MacGyver leaves school and for fun joins the Phoenix Foundation (The guy organisation his uncle belonged to). As expected the \"Young MacGyver\" finds his talents closely match his uncles. Only the unaired Pilot episode is known to exist. Featured Crew Henry Winkler Creator John Rich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Loayza Jared Padalecki Young MacGyver Lee Burns Firefighter Ron Canada The General Tracey McCall Tracy Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Action & Adventure Keywords spin off macgyver unaired Content Score 71 Just a little bit more... Top Contributors B 26 Bob  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}