{"link": "https://www.themoviedb.org/tv/20237?language=en", "title": "Wandering Sun", "resume": "Wandering Sun is a Japanese manga and anime television series created by Keisuke Fujikawa and Mayumi Suzuki, and which ran for 26 episodes in 1971. Both Yoshiyuki Tomino and Yasuhiko Yoshikazu were involved in the production of Wandering Sun, and would later again collaborate on the ground-breaking and genre defining series Space Battleship Yamato and Mobile Suit Gundam.\nWandering Sun tells the story of two girls switched at birth, who compete to become successful singers after meeting at high-school.\nThe TV series was also released in Italy under the title Jane e Micci and in France as Nathalie et ses Amis.\nThis series was itself a ground-breaker in that it was perhaps the first anime series to depict the entertainment industry - specifically popular music, which would be a major plot point in many anime to come from Creamy Mami to Perfect Blue. The voice actress for Nozomi, Junko Fujiyama, was an actual singer who used the series as a launching pad for her own real-life singing career, releasing several singles while the series was still on the air. The anime, however, toned down some of the more intense and mature elements of the manga for a prime-time TV audience.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Junko Fujiyama", "Michiko Hirai", "Kousei Tomita", "Makio Inoue", "Masaaki Yajima"], "character": ["Nozomi", "Miki", "Kumagoro", "Fani", "narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20237   Expand Wandering Sun   (1971) User Score Overview Wandering Sun is a Japanese manga and anime television series created by Keisuke Fujikawa and Mayumi Suzuki, and which ran for 26 episodes in 1971. Both Yoshiyuki Tomino and Yasuhiko Yoshikazu were involved in the production of Wandering Sun, and would later again collaborate on the ground-breaking and genre defining series Space Battleship Yamato and Mobile Suit Gundam. Wandering Sun tells the story of two girls switched at birth, who compete to become successful singers after meeting at high-school. The TV series was also released in Italy under the title Jane e Micci and in France as Nathalie et ses Amis. This series was itself a ground-breaker in that it was perhaps the first anime series to depict the entertainment industry - specifically popular music, which would be a major plot point in many anime to come from Creamy Mami to Perfect Blue. The voice actress for Nozomi, Junko Fujiyama, was an actual singer who used the series as a launching pad for her own real-life singing career, releasing several singles while the series was still on the air. The anime, however, toned down some of the more intense and mature elements of the manga for a prime-time TV audience. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Junko Fujiyama Nozomi Michiko Hirai Miki Kousei Tomita Kumagoro Makio Inoue Fani Masaaki Yajima narrator Full Cast & Crew Last Season Season 1 1971 | 2 Episodes Season 1 of Wandering Sun premiered on April  8, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wandering Sun. You can help by rating TV shows you've seen. Facts Original Name  さすらいの太陽 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 28 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}