{"link": "https://www.themoviedb.org/tv/4068?language=en", "title": "Hogan's Heroes", "resume": "Hogan's Heroes is an American television sitcom that ran for 168 episodes from September 17, 1965, to July 4, 1971, on the CBS network. The show was set in a German prisoner of war camp during World War II. Bob Crane starred as Colonel Robert E. Hogan, coordinating an international crew of Allied prisoners running a Special Operations group from the camp. Werner Klemperer played Colonel Wilhelm Klink, the commandant of the camp, and John Banner was the inept sergeant-of-the-guard, Hans Schultz.\nThe series was popular during its six-season run. In 2013, creators Bernard Fein through his estate and Albert S. Ruddy acquired the sequel and other separate rights to Hogan's Heroes from Mark Cuban through arbitration and a movie based on the show has been planned.", "rate": 75, "genre": ["War", "Politics", "Comedy"], "cast": ["Bob Crane", "Richard Dawson", "Robert Clary", "Larry Hovis", "Kenneth Washington"], "character": ["Colonel Robert E. Hogan", "Corporal Peter Newkirk", "Corporal Louis LeBeau", "Sergeant First Class Andrew J. Carter", "Sergeant Richard Baker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4068   Expand Hogan's Heroes   (1965) User Score Overview Hogan's Heroes is an American television sitcom that ran for 168 episodes from September 17, 1965, to July 4, 1971, on the CBS network. The show was set in a German prisoner of war camp during World War II. Bob Crane starred as Colonel Robert E. Hogan, coordinating an international crew of Allied prisoners running a Special Operations group from the camp. Werner Klemperer played Colonel Wilhelm Klink, the commandant of the camp, and John Banner was the inept sergeant-of-the-guard, Hans Schultz. The series was popular during its six-season run. In 2013, creators Bernard Fein through his estate and Albert S. Ruddy acquired the sequel and other separate rights to Hogan's Heroes from Mark Cuban through arbitration and a movie based on the show has been planned. Featured Crew Albert S. Ruddy Creator Bernard Fein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  51 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Crane Colonel Robert E. Hogan Richard Dawson Corporal Peter Newkirk Robert Clary Corporal Louis LeBeau Larry Hovis Sergeant First Class Andrew J. Carter Kenneth Washington Sergeant Richard Baker Full Cast & Crew Last Season Season 6 1970 | 24 Episodes Season 6 of Hogan's Heroes premiered on September 20, 1970. View All Seasons Social Reviews  0 Discussions  51 Subject Status Replies Last Reply MrRadical, tell me how you do it Open 1 by  LastLion proof, i'm not MrRadical! Open 0 by  MrRadical :o Open 0 by  MrRadical Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   1976-03-21 Charlie's Angels 5.9    1984-01-04 Night Court 6.9    1965-09-17 The Wild Wild West 7.5    1978-11-03 Diff'rent Strokes 5.7    1983-09-18 Hardcastle and McCormick 6.1    1989-09-19 Doogie Howser, M.D. 5.7    1990-04-19 Wings 6.7    1981-11-24 Simon & Simon 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres War & Politics Comedy Keywords germany world war ii prisoner of war military sitcom Content Score 100 Yes! Looking good! Top Contributors m 23 meisterwirbel 12 Banana d 11 denis 9 SuperMario  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}