{"link": "https://www.themoviedb.org/tv/34855?language=en", "title": "Ristorante Paradiso", "resume": "Ristorante Paradiso, also known as Rispara, is a manga series by Natsume Ono, detailing the daily lives of the staff of a Rome restaurant. The first iteration of the series was serialized in Ōtashuppan's Manga Erotics F manga magazine between May 2005 and March 2006; it spanned one volume. A continuation, Gente ~Ristorante no Hitobito~, is currently being serialized in the same magazine, with three volumes published. An anime adaptation, produced by David Production, aired on Fuji TV's late night Noise programming block from April 5, 2009, the anime was also officially streamed with English subtitles by Crunchyroll. Both manga, Ristorante Paradiso and Gente, have been licensed by Viz Media for an English North American release.", "rate": 80, "genre": ["Animation", "Drama"], "cast": ["Kenji Nomura", "Haruhi Terada", "Fumiko Orikasa", "Jin Yamanoi", "Kazuhiko Nishimatsu"], "character": ["Lorenzo", "Olga", "Nicoletta", "Claudio", "Furio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34855   Expand Ristorante Paradiso   (2009) User Score Overview Ristorante Paradiso, also known as Rispara, is a manga series by Natsume Ono, detailing the daily lives of the staff of a Rome restaurant. The first iteration of the series was serialized in Ōtashuppan's Manga Erotics F manga magazine between May 2005 and March 2006; it spanned one volume. A continuation, Gente ~Ristorante no Hitobito~, is currently being serialized in the same magazine, with three volumes published. An anime adaptation, produced by David Production, aired on Fuji TV's late night Noise programming block from April 5, 2009, the anime was also officially streamed with English subtitles by Crunchyroll. Both manga, Ristorante Paradiso and Gente, have been licensed by Viz Media for an English North American release. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenji Nomura Lorenzo Haruhi Terada Olga Fumiko Orikasa Nicoletta Jin Yamanoi Claudio Kazuhiko Nishimatsu Furio Full Cast & Crew Last Season Season 1 2009 | 11 Episodes Season 1 of Ristorante Paradiso premiered on April  8, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ristorante Paradiso. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 Mikedeth5 m 3 magoozin 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}