{"link": "https://www.themoviedb.org/tv/61475?language=en", "title": "Tony's Revenge", "resume": "Tony Roucas, a long-term convicted criminal, escapes from prison with Kenz, a small-town big shot. Their run reveals a generational conflict of a new genre. Tony’s quest for truth and desire for vengeance take you to the heart of great French organized crime, from the 50s to today.", "rate": 0, "genre": ["Romance", "Drama", "Crime"], "cast": ["Simon Abkarian", "Soufiane Guerrab", "Olivier Rabourdin", "Dimitri Storoge", "Philippe Nahon"], "character": ["Tony Roucas", "Kenz", "Guido", "Nils Karlssen", "Janvier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61475   Expand Tony's Revenge   (2011) User Score Overview Tony Roucas, a long-term convicted criminal, escapes from prison with Kenz, a small-town big shot. Their run reveals a generational conflict of a new genre. Tony’s quest for truth and desire for vengeance take you to the heart of great French organized crime, from the 50s to today. Featured Crew Virginie Brac Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Abkarian Tony Roucas Soufiane Guerrab Kenz Olivier Rabourdin Guido Dimitri Storoge Nils Karlssen Philippe Nahon Janvier Full Cast & Crew Last Season Season 1 2011 | 8 Episodes Season 1 of Tony's Revenge premiered on March 16, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tony's Revenge. You can help by rating TV shows you've seen. Facts Original Name  Les beaux mecs Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  52m Homepage  - Genres Romance Drama Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 23 EveDemocracy M 21 Manu 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}