{"link": "https://www.themoviedb.org/tv/930?language=en", "title": "Hollywood Squares", "resume": "Hollywood Squares is an American panel game show, in which two contestants play tic-tac-toe to win cash and prizes. The \"board\" for the game is a 3 × 3 vertical stack of open-faced cubes, each occupied by a celebrity seated at a desk and facing the contestants. The stars are asked questions by the host, or \"Square-Master\", and the contestants judge the veracity of their answers in order to win the game.\nAlthough Hollywood Squares was a legitimate game show, the game largely acted as the background for the show's comedy in the form of joke answers, often given by the stars prior to their \"real\" answer. The show's writers usually supplied the jokes. In addition, the stars were given question subjects and plausible incorrect answers prior to the show. The show was scripted in this sense, but the gameplay was not. In any case, as host Peter Marshall, the best-known \"Square-Master\" and the man in whose honor the show's first announcer, Kenny Williams, actually \"coined\" the term, would explain at the beginning of the Secret Square game, the celebrities were briefed prior to show to help them with bluff answers, but they otherwise heard the actual questions for the first time as they were asked on air.", "rate": 80, "genre": ["Comedy"], "cast": ["Peter Marshall"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 930   Expand Hollywood Squares   (1966) User Score Overview Hollywood Squares is an American panel game show, in which two contestants play tic-tac-toe to win cash and prizes. The \"board\" for the game is a 3 × 3 vertical stack of open-faced cubes, each occupied by a celebrity seated at a desk and facing the contestants. The stars are asked questions by the host, or \"Square-Master\", and the contestants judge the veracity of their answers in order to win the game. Although Hollywood Squares was a legitimate game show, the game largely acted as the background for the show's comedy in the form of joke answers, often given by the stars prior to their \"real\" answer. The show's writers usually supplied the jokes. In addition, the stars were given question subjects and plausible incorrect answers prior to the show. The show was scripted in this sense, but the gameplay was not. In any case, as host Peter Marshall, the best-known \"Square-Master\" and the man in whose honor the show's first announcer, Kenny Williams, actually \"coined\" the term, would explain at the beginning of the Secret Square game, the celebrities were briefed prior to show to help them with bluff answers, but they otherwise heard the actual questions for the first time as they were asked on air. Featured Crew Merrill Heatter Creator Bob Quigley Creator Paul Alter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Marshall Host Full Cast & Crew Last Season Season 1 1966 | 1 Episode Season 1 of Hollywood Squares premiered on October 17, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hollywood Squares. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords game show celebrity panel show hollywood squares Content Score 50 Still needs a little work. Top Contributors 19 Banana TB 2 TMDb Bot 2 remark  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}