{"link": "https://www.themoviedb.org/tv/2267?language=en", "title": "headLand", "resume": "Headland is an Australian drama television series produced by the Seven Network which ran from 15 November 2005 to 21 January 2006. The Seven Network filmed 52 episodes in the first series. Production on the second series had begun before any episodes were aired.\nSet in a university, Headland premiered in Australia on Tuesday, 15 November 2005 at 7.30pm. On 23 January 2006, the Seven Network officially announced that the series has been cancelled. The show aired on weekdays at 7.30pm in the United Kingdom on E4, re-formatted as half-hour episodes. E4 eventually dropped the show but episodes continued to be broadcast on Channel 4 at 12:30pm, this time in the original hour-long format.", "rate": 80, "genre": ["Drama", "Soap"], "cast": ["Rachael Taylor", "Adrienne Pickering", "Josh Quong Tart", "Brooke Harman", "Libby Tanner"], "character": ["Sasha Forbes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2267   Expand headLand   (2005) User Score Overview Headland is an Australian drama television series produced by the Seven Network which ran from 15 November 2005 to 21 January 2006. The Seven Network filmed 52 episodes in the first series. Production on the second series had begun before any episodes were aired. Set in a university, Headland premiered in Australia on Tuesday, 15 November 2005 at 7.30pm. On 23 January 2006, the Seven Network officially announced that the series has been cancelled. The show aired on weekdays at 7.30pm in the United Kingdom on E4, re-formatted as half-hour episodes. E4 eventually dropped the show but episodes continued to be broadcast on Channel 4 at 12:30pm, this time in the original hour-long format. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachael Taylor Sasha Forbes Adrienne Pickering Josh Quong Tart Brooke Harman Libby Tanner Full Cast & Crew Last Season Season 1 2005 | 58 Episodes Season 1 of headLand premiered on November 15, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on headLand. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Soap Keywords college Content Score 71 Just a little bit more... Top Contributors 6 Banana 5 Elizabeth Jennings BA 5 Barbara Ann O'Leary  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}