{"link": "https://www.themoviedb.org/tv/61986?language=en", "title": "Bloodline", "resume": "A dramatic thriller that explores the demons lurking beneath the surface of a contemporary American family. The Rayburns are hard-working pillars of their Florida Keys community. But when the black sheep son comes home for the 45th anniversary of his parents' hotel, he threatens to expose the Rayburns' dark secrets and shameful past, pushing his siblings to the limits of family loyalty.", "rate": 75, "genre": ["Drama"], "cast": ["Kyle Chandler", "Linda Cardellini", "Norbert Leo Butz", "Jamie McShane", "Sissy Spacek"], "character": ["John Rayburn", "Meg Rayburn", "Kevin Rayburn", "Eric O'Bannon", "Sally Rayburn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61986   Expand Bloodline   (2015) User Score  Play Trailer Overview A dramatic thriller that explores the demons lurking beneath the surface of a contemporary American family. The Rayburns are hard-working pillars of their Florida Keys community. But when the black sheep son comes home for the 45th anniversary of his parents' hotel, he threatens to expose the Rayburns' dark secrets and shameful past, pushing his siblings to the limits of family loyalty. Featured Crew Glenn Kessler Creator Todd A. Kessler Creator Daniel Zelman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  8 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kyle Chandler John Rayburn Linda Cardellini Meg Rayburn Norbert Leo Butz Kevin Rayburn Jamie McShane Eric O'Bannon Sissy Spacek Sally Rayburn Full Cast & Crew Last Season Season  3 2017 | 10 Episodes Season 3 of Bloodline premiered on May 26, 2017. View All Seasons Social Reviews  1 Discussions  5 A review by Baz  9.0 Written by  Baz  on April 12, 2018 Bloodline had a marvelous first season and had so much promise. I loved the first season. If I would recommend to someone how to watch this series, is to just watch the first season and don’t bother about the next two seasons. \nIt could’ve been left after the first season and it would’ve been remembered as a better show than it ended up being. The next two seasons just unraveled with huge holes in the plot and introducing new characters that were really irrelevant.\nThe series was scheduled to be a 7 season show but expenses with shooting in the Keys was too costly. \nHence the series was k...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  8 Posters  15 Recommendations   2013-04-22 Rectify 7.6    2016-10-16 Bordertown 7.5    2012-06-03 Longmire 7.6    2015-08-07 Sneaky Pete 7.9    2012-06-26 Line of Duty 8.0    2007-05-07 Durham County 5.3    2016-09-25 Nobel 8.5    2011-05-05 The Shadow Line 8.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.netflix.com/Bloodline Genres Drama Keywords florida secret sibling relationship florida keys dysfunctional family psychological thriller family disharmony Content Score 100 Yes! Looking good! Top Contributors 32 Elizabeth Jennings D 20 Dee 19 Banana 13 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}