{"link": "https://www.themoviedb.org/tv/76231?language=en", "title": "Mayans MC", "resume": "Set in the aftermath of Sons of Anarchy, Mayans MC focuses on the struggles of Ezekiel “EZ” Reyes, a prospect in the Mayan MC charter on the California/Mexico border. EZ is the gifted son of a proud Latino family, whose American dream was snuffed out by cartel violence. Now, his need for vengeance drives him toward a life he never intended and can never escape.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["J. D. Pardo", "Emilio Rivera"], "character": ["Ezekiel Reyes", "Marcus Alvarez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76231   Expand Mayans MC   (2018) User Score Overview Set in the aftermath of Sons of Anarchy, Mayans MC focuses on the struggles of Ezekiel “EZ” Reyes, a prospect in the Mayan MC charter on the California/Mexico border. EZ is the gifted son of a proud Latino family, whose American dream was snuffed out by cartel violence. Now, his need for vengeance drives him toward a life he never intended and can never escape. Featured Crew Kurt Sutter Creator Elgin James Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  3 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast J. D. Pardo Ezekiel Reyes Emilio Rivera Marcus Alvarez Full Cast & Crew Next Season Season 1 2018 | 1 Episode Season 1 of Mayans MC is set to premiere on September  4, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  1 Posters  1 Facts Status  In Production Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  - Homepage   http://www.fxnetworks.com/shows/mayans-mc Genres Crime Drama Keywords organized crime motorcycle gang spin off Content Score 71 Just a little bit more... Top Contributors 21 Hevinalle 14 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}