{"link": "https://www.themoviedb.org/tv/58775?language=en", "title": "Kingdom of Plants", "resume": "David discovers a microscopic world that’s invisible to the naked eye, where insects feed and breed, where flowers fluoresce and where plants communicate with each other and with animals using scent and sound.", "rate": 93, "genre": ["Documentary"], "cast": ["David Attenborough"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58775   Expand Kingdom of Plants   (2012) User Score  Play Trailer Overview David discovers a microscopic world that’s invisible to the naked eye, where insects feed and breed, where flowers fluoresce and where plants communicate with each other and with animals using scent and sound. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Attenborough Host Full Cast & Crew Last Season Season 1 2012 | 3 Episodes Season 1 of Kingdom of Plants premiered on May 26, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Kingdom of Plants. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  50m Homepage   http://skyatlantic.sky.com/kingdom-of-plants Genres Documentary Keywords biology flower plant natural history evolution science natural selection seed botanical garden botany nature documentary Content Score 64 We're so close, yet so far. Top Contributors 25 Banana TB 16 TMDb Bot f 7 fly9902 3 du17  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}