{"link": "https://www.themoviedb.org/tv/365?language=en", "title": "Jericho", "resume": "Jericho is an American action/drama series that centers on the residents of the fictional town of Jericho, Kansas, in the aftermath of nuclear attacks on 23 major cities in the contiguous United States.", "rate": 75, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["Lennie James", "Skeet Ulrich", "Gerald McRaney", "Ashley Scott", "Brad Beyer"], "character": ["Robert Hawkins", "Jake Green", "Johnston Green", "Emily Sullivan", "Stanley Richmond"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 365   Expand Jericho   (2006) User Score  Play Trailer Overview Jericho is an American action/drama series that centers on the residents of the fictional town of Jericho, Kansas, in the aftermath of nuclear attacks on 23 major cities in the contiguous United States. Featured Crew Jon Turteltaub Creator Stephen Chbosky Creator Jonathan E. Steinberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  15 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lennie James Robert Hawkins Skeet Ulrich Jake Green Gerald McRaney Johnston Green Ashley Scott Emily Sullivan Brad Beyer Stanley Richmond Full Cast & Crew Last Season Season 2 2008 | 8 Episodes Season 2 of Jericho premiered on February 12, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply [spoilers for first 3 eps] Generic post-apo soap opera Open 0 by perelachaise\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  5 Recommendations   2004-07-11 The 4400 6.9    2009-09-24 FlashForward 6.9    2005-09-19 Invasion 6.9    2010-09-20 The Event 6.2    2011-06-19 Falling Skies 6.4    2011-09-26 Terra Nova 6.3    2009-11-03 V 6.2    2006-09-25 Heroes 6.9  Facts Status  Cancelled Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.cbs.com/primetime/jericho/ Genres Action & Adventure Drama Mystery Keywords small town post-apocalyptic kansas survival conspiracy post nuclear no electricity jericho Content Score 100 Yes! Looking good! Top Contributors 11 Banana I 9 ILiviu M 9 MLCHome 7 Mitsarinho2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}