{"link": "https://www.themoviedb.org/tv/39172?language=en", "title": "The Scarlet and the Black", "resume": "An ambitious young man seduces women of high social standing in order to improve his prospects.", "rate": 80, "genre": ["Drama"], "cast": ["Ewan McGregor", "Christopher Fulford", "Alice Krige", "T. P. McKenna", "Rachel Weisz"], "character": ["Julien Sorel", "Napoleon", "Madame de Renal", "Marquis de la Mole", "Mathilde de la Mole"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39172   Expand The Scarlet and the Black   (1993) User Score Overview An ambitious young man seduces women of high social standing in order to improve his prospects. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ewan McGregor Julien Sorel Christopher Fulford Napoleon Alice Krige Madame de Renal T. P. McKenna Marquis de la Mole Rachel Weisz Mathilde de la Mole Full Cast & Crew Last Season Miniseries 1993 | 3 Episodes Season 1 of The Scarlet and the Black premiered on October 30, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Scarlet and the Black. You can help by rating TV shows you've seen. Facts Original Name  Scarlet and Black Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords france based on novel or book miniseries 19th century Content Score 71 Just a little bit more... Top Contributors TB 20 TMDb Bot R 17 Rebecca r 8 ricostream 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}