{"link": "https://www.themoviedb.org/tv/9873?language=en", "title": "The Sky at Night", "resume": "The Sky at Night is a monthly documentary television programme on astronomy produced by the BBC. The show had the same permanent presenter, Patrick Moore, from its first airing on 24 April 1957 until 7 January 2013, Moore having died on 9 December 2012. This made it the longest-running programme with the same presenter in television history. Many early episodes are missing, either because the tapes were wiped or thrown out, or because the episode was broadcast live.\nBeginning with the 3 February 2013 episode, the show has been co-presented by Lucie Green and Chris Lintott.\nThe programme's opening and closing theme music is \"At the Castle Gate\", from the incidental music to Pelléas et Mélisande by Jean Sibelius, performed by the Royal Philharmonic Orchestra and conducted by Sir Thomas Beecham.", "rate": 90, "genre": ["Documentary", "News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9873   Expand The Sky at Night   (1957) User Score  Play Trailer Overview The Sky at Night is a monthly documentary television programme on astronomy produced by the BBC. The show had the same permanent presenter, Patrick Moore, from its first airing on 24 April 1957 until 7 January 2013, Moore having died on 9 December 2012. This made it the longest-running programme with the same presenter in television history. Many early episodes are missing, either because the tapes were wiped or thrown out, or because the episode was broadcast live. Beginning with the 3 February 2013 episode, the show has been co-presented by Lucie Green and Chris Lintott. The programme's opening and closing theme music is \"At the Castle Gate\", from the incidental music to Pelléas et Mélisande by Jean Sibelius, performed by the Royal Philharmonic Orchestra and conducted by Sir Thomas Beecham. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2017 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Sir Patrick Moore was an absolute gentleman who held this show together in ways nobody else could have. Open 0 by Remington Steele\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Sky at Night. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  30m, 45m Homepage   http://www.bbc.co.uk/science/space/spaceguide/skyatnight/ Genres Documentary News Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors n 4 newatoru 2 Remington Steele 2 Moviebase s 1 sindirahardian  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}