{"link": "https://www.themoviedb.org/tv/76707?language=en", "title": "Neko ga Kureta Marui Shiawase", "resume": "Mari Hirakura is a 30 year old career woman who designs the packaging for a cosmetics company. She does her best every day but still wonders if she is okay the way she is.", "rate": 0, "genre": ["Comedy", "Animation"], "cast": ["Maaya Uchida", "Takahiro Sakurai", "Tomokazu Sugita"], "character": ["Mari Hirakura (voice)", "Oi-san the Cat (voice)", "Shingo Takeda (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76707   Expand Neko ga Kureta Marui Shiawase   (2017) User Score Overview Mari Hirakura is a 30 year old career woman who designs the packaging for a cosmetics company. She does her best every day but still wonders if she is okay the way she is. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maaya Uchida Mari Hirakura (voice) Takahiro Sakurai Oi-san the Cat (voice) Tomokazu Sugita Shingo Takeda (voice) Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of Neko ga Kureta Marui Shiawase premiered on May 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Neko ga Kureta Marui Shiawase. You can help by rating TV shows you've seen. Facts Original Name  猫がくれたまぁるいしあわせ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  1m Homepage   https://www.0101.co.jp/marui-shiawase Genres Comedy Animation Keywords anime working life short episodes Content Score 56 We're so close, yet so far. Top Contributors 40 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}