{"link": "https://www.themoviedb.org/tv/32820?language=en", "title": "Outlaw", "resume": "Outlaw is an American television series that was aired on the NBC network. The one-hour courtroom drama stars Jimmy Smits as a Supreme Court Justice who resigns from the bench and returns to private practice in an elite law firm where Claire Sax, love interest to Garza, is a powerful senior partner. As part of the deal the firm has an Ex-Supreme Court Justice on their staff of lawyers and Garza is allowed to pick his team and the cases he works. The series premiered on Wednesday, September 15, 2010, and began airing on Fridays beginning September 24. On October 11 Outlaw was announced as canceled by NBC and the remaining four episodes were moved to a Saturday time slot. The series finale aired on November 13, 2010.", "rate": 0, "genre": ["Drama"], "cast": ["Jimmy Smits", "Jesse Bradford", "Carly Pope", "Ellen Woglom", "Richard Portnow"], "character": ["Cyrus Garza", "Eddie Franks", "Lucinda Pearl", "Mereta Sprows", "Sen. Sidney Vidalin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32820   Expand Outlaw   (2010) User Score Overview Outlaw is an American television series that was aired on the NBC network. The one-hour courtroom drama stars Jimmy Smits as a Supreme Court Justice who resigns from the bench and returns to private practice in an elite law firm where Claire Sax, love interest to Garza, is a powerful senior partner. As part of the deal the firm has an Ex-Supreme Court Justice on their staff of lawyers and Garza is allowed to pick his team and the cases he works. The series premiered on Wednesday, September 15, 2010, and began airing on Fridays beginning September 24. On October 11 Outlaw was announced as canceled by NBC and the remaining four episodes were moved to a Saturday time slot. The series finale aired on November 13, 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jimmy Smits Cyrus Garza Jesse Bradford Eddie Franks Carly Pope Lucinda Pearl Ellen Woglom Mereta Sprows Richard Portnow Sen. Sidney Vidalin Full Cast & Crew Last Season Season 1 2010 | 8 Episodes Season 1 of Outlaw premiered on September 15, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Outlaw. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.nbc.com/outlaw/ Genres Drama Keywords lawyer courtroom law firm courtroom drama Content Score 86 Almost there... Top Contributors 20 Banana z 4 zurman1 w 3 webmaster p 2 pepecine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}