{"link": "https://www.themoviedb.org/tv/13915?language=en", "title": "Shingetsutan Tsukihime", "resume": "Shiki Tohno sustained a life threatening injury as a child, and due to that incident he was sent away from the Tohno household and was given to a relative to be raised. Years later, when Shiki is in high school, the head of the Tohno household—his father—dies, and he is ordered to move back in by his sister Akiha, who is the new head of the household. However, Shiki holds a huge secret. Ever since that injury, he has been seeing lines on objects, and only with a special pair of glasses is he able to stop seeing them. Also he is unable to remember anything well from the time before his accident. The day he moves back to the Tohno household is the day he stumbles upon a woman named Arcueid Brunestud and decapitates her with one stab of his knife in a temporary fit of insanity. When she suddenly showed up beside him later alive and well, and ask him to be her bodyguard, Shiki's journey to unravel the mysteries of his past begins.", "rate": 0, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Kenta Miyake", "Akiko Kimura", "Takahiro Sakurai", "Kana Ueda", "Kenichi Suzumura"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13915   Expand Shingetsutan Tsukihime   (2003) User Score Overview Shiki Tohno sustained a life threatening injury as a child, and due to that incident he was sent away from the Tohno household and was given to a relative to be raised. Years later, when Shiki is in high school, the head of the Tohno household—his father—dies, and he is ordered to move back in by his sister Akiha, who is the new head of the household. However, Shiki holds a huge secret. Ever since that injury, he has been seeing lines on objects, and only with a special pair of glasses is he able to stop seeing them. Also he is unable to remember anything well from the time before his accident. The day he moves back to the Tohno household is the day he stumbles upon a woman named Arcueid Brunestud and decapitates her with one stab of his knife in a temporary fit of insanity. When she suddenly showed up beside him later alive and well, and ask him to be her bodyguard, Shiki's journey to unravel the mysteries of his past begins. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenta Miyake Akiko Kimura Takahiro Sakurai Kana Ueda Kenichi Suzumura Full Cast & Crew Last Season Season 1 2003 | 12 Episodes Season 1 of Shingetsutan Tsukihime premiered on October  9, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Shingetsutan Tsukihime. You can help by rating TV shows you've seen. Facts Original Name  真月譚 月姫 Status  Ended Networks - Certification 19 Meaning This rating is for programs that are intended for adults only. 19-rated programming cannot air during the hours of 7:00AM to 9:00AM, and 1:00PM to 10:00PM. Programmes that receive this rating will almost certainly have adult themes, sexual situations, frequent use of strong language and disturbing scenes of violence. Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.nbcuni.co.jp/rondorobe/anime/tsukihime/ Genres Animation Drama Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 18 Banana 7 AlphaFactory J 6 JeremyRogers 4 Mar2ck  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}