{"link": "https://www.themoviedb.org/tv/61328?language=en", "title": "Pleng Ruk Pa Bpeun Taek", "resume": "If you thought MASH was good, wait until you see this lakorn. Set during the war, we will see the love, drama, trials and tributes of those who work in the Thai armed forces.", "rate": 100, "genre": ["Soap", "Drama"], "cast": ["Saran Sirilak", "Puntitha Puwijarn Cowell", "Rungsiroj Phanpeng", "Gavintra Pohjak", "Nattawat Plengsiriwat"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61328   Expand Pleng Ruk Pa Bpeun Taek   (2014) User Score Overview If you thought MASH was good, wait until you see this lakorn. Set during the war, we will see the love, drama, trials and tributes of those who work in the Thai armed forces. Featured Crew Pordeecam Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saran Sirilak Puntitha Puwijarn Cowell Rungsiroj Phanpeng Gavintra Pohjak Nattawat Plengsiriwat Full Cast & Crew Last Season Season 1 2014 | 1 Episode Season 1 of Pleng Ruk Pa Bpeun Taek premiered on June  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Pleng Ruk Pa Bpeun Taek. You can help by rating TV shows you've seen. Facts Original Name  เพลงรักผาปืนแตก Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  85m Homepage   http://drama.ch7.com/detail/75361/%E0%B9%80%E0%B8%9E%E0%B8%A5%E0%B8%87%E0%B8%A3%E0%B8%B1%E0%B8%81%E0%B8%9C%E0%B8%B2%E0%B8%9B%E0%B8%B7%E0%B8%99%E0%B9%81%E0%B8%95%E0%B8%81.html Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 48 Crip 21 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}