{"link": "https://www.themoviedb.org/tv/8310?language=en", "title": "Wired", "resume": "Louise Evans is a single mother who works as a customer advisor for big bucks investors at a slick, pin-striped bank. On a night out with her best friend Anna she's introduced to Anna's slippery new boyfriend Phillip. Phillip makes Louise an indecent proposal: accept a briefcase full of money in return for helping him to defraud one of the bank’s richest clients.", "rate": 70, "genre": ["Drama"], "cast": ["Laurence Fox", "Toby Stephens", "Jodie Whittaker", "Charlie Brooks", "Ramon Tikaram"], "character": ["Phillip Manningham", "Crawford Hill", "Louise Evans", "Anna", "Mr. Ralindi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8310   Expand Wired   (2008) User Score Overview Louise Evans is a single mother who works as a customer advisor for big bucks investors at a slick, pin-striped bank. On a night out with her best friend Anna she's introduced to Anna's slippery new boyfriend Phillip. Phillip makes Louise an indecent proposal: accept a briefcase full of money in return for helping him to defraud one of the bank’s richest clients. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laurence Fox Phillip Manningham Toby Stephens Crawford Hill Jodie Whittaker Louise Evans Charlie Brooks Anna Ramon Tikaram Mr. Ralindi Full Cast & Crew Last Season Miniseries 2008 | 3 Episodes Season 1 of Wired premiered on October 13, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Wired. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 7 TMDb Bot 4 kcdh w 3 webmaster R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}