{"link": "https://www.themoviedb.org/tv/2764?language=en", "title": "A Scare at Bedtime", "resume": "A Scare at Bedtime was an Irish television show, produced by Double Z Enterprises and broadcast by RTÉ, featuring the two puppets Podge and Rodge as the hosts of a spooky tales and urban myths comedy show. It ran from 1997 until January 2006.\nA Scare at Bedtime was originally commissioned by RTÉ to fill a ten minute gap that was left before the 23:00 News due to the short running times of American shows that preceded it. This show took its name from the nightly RTÉ 1 show called A Prayer at Bedtime, which overlaid the text of a Roman Catholic prayer over serene images with choral music playing. A Scare at Bedtime, first aired in 1997, is close to being the polar opposite of this, with extremely adult content, lewd jokes and slightly obscene anecdotes being related by the two puppets and 'Tales of Caution' acted out in live action segments. Podge's origins on The Den is ignored, as the backstory gradually established on A Scare at Bedtime, presents Podge and his identical twin brother Rodge to be both in their sixties, and living in Ballydung Manor, a converted insane asylum for most of that time, with a lunatic nurse that they call \"Granny\" who practices the dark arts . They were also then given full names also: Padraig Judas O'Leprocy and Rodraig Spartacus O'Leprocy.", "rate": 60, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2764   Expand A Scare at Bedtime   (1997) User Score Overview A Scare at Bedtime was an Irish television show, produced by Double Z Enterprises and broadcast by RTÉ, featuring the two puppets Podge and Rodge as the hosts of a spooky tales and urban myths comedy show. It ran from 1997 until January 2006. A Scare at Bedtime was originally commissioned by RTÉ to fill a ten minute gap that was left before the 23:00 News due to the short running times of American shows that preceded it. This show took its name from the nightly RTÉ 1 show called A Prayer at Bedtime, which overlaid the text of a Roman Catholic prayer over serene images with choral music playing. A Scare at Bedtime, first aired in 1997, is close to being the polar opposite of this, with extremely adult content, lewd jokes and slightly obscene anecdotes being related by the two puppets and 'Tales of Caution' acted out in live action segments. Podge's origins on The Den is ignored, as the backstory gradually established on A Scare at Bedtime, presents Podge and his identical twin brother Rodge to be both in their sixties, and living in Ballydung Manor, a converted insane asylum for most of that time, with a lunatic nurse that they call \"Granny\" who practices the dark arts . They were also then given full names also: Padraig Judas O'Leprocy and Rodraig Spartacus O'Leprocy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 8 2005 | 15 Episodes Season 8 of A Scare at Bedtime premiered on September  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Scare at Bedtime. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://www.dze.ie Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 3 maelor 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}