{"link": "https://www.themoviedb.org/tv/68371?language=en", "title": "Taagad", "resume": "A series taking place in an army medical center located in a remote military base and following the bizarre characters and occurrences in the center.", "rate": 70, "genre": ["Action", "Adventure", "Drama"], "cast": ["Tomer Kapon", "Daniel Gal", "Shira Naor", "Dean Miroshnikov", "Or Edri"], "character": ["Daniel Amarilio", "Rotem Polak", "Lia Karni", "Noam Polchak", "Idan Ben-Lulu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68371   Expand Taagad   (2016) User Score Overview A series taking place in an army medical center located in a remote military base and following the bizarre characters and occurrences in the center. Featured Crew Zion Rubin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomer Kapon Daniel Amarilio Daniel Gal Rotem Polak Shira Naor Lia Karni Dean Miroshnikov Noam Polchak Or Edri Idan Ben-Lulu Full Cast & Crew Last Season Season 1 2016 | 40 Episodes Season 1 of Taagad premiered on September 19, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Taagad. You can help by rating TV shows you've seen. Facts Original Name  תאג''ד Status  Returning Series Network Certification  - Type  Scripted Original Language  Hebrew Runtime  30m Homepage   https://www.facebook.com/Taagadyes/ Genres Action & Adventure Drama Keywords israel israeli defense force military military hospital medical drama Content Score 93 Almost there... Top Contributors m 71 moviedbmailinator 43 KH 21 yuvalg72 12 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}