{"link": "https://www.themoviedb.org/tv/76571?language=en", "title": "Jim Button and Luke the Engine Driver", "resume": "Eine Insel mit zwei Bergen, genannt Lummerland, ist die Heimat von Lukas, dem Lokomotivführer. Regiert wir Lummerland von König Alfons, dem Viertelvorzwölften. Eines Tages bringt der Briefträger ein Paket nach Lummerland. Darin befindet sich Jim Knopf. Der Junge wird bald der beste Freund von Lukas. Als auf Lummerland akuter Platzmangel ausbricht, machen sie sich gemeinsam auf die Reise, erleben spannende Abenteuer, treffen so merkwürdige Wesen wie den Scheinriesen Tur-Tur und retten schließlich die chinesische Prinzessin Li-Si aus dem Drachenland.", "rate": 90, "genre": ["Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76571   Expand Jim Button and Luke the Engine Driver   (1977) User Score Overview Eine Insel mit zwei Bergen, genannt Lummerland, ist die Heimat von Lukas, dem Lokomotivführer. Regiert wir Lummerland von König Alfons, dem Viertelvorzwölften. Eines Tages bringt der Briefträger ein Paket nach Lummerland. Darin befindet sich Jim Knopf. Der Junge wird bald der beste Freund von Lukas. Als auf Lummerland akuter Platzmangel ausbricht, machen sie sich gemeinsam auf die Reise, erleben spannende Abenteuer, treffen so merkwürdige Wesen wie den Scheinriesen Tur-Tur und retten schließlich die chinesische Prinzessin Li-Si aus dem Drachenland. Featured Crew Michael Ende Creator Augsburger Puppenkiste Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1977 | 4 Episodes Season 1 of Jim Button and Luke the Engine Driver premiered on February  6, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jim Button and Luke the Engine Driver. You can help by rating TV shows you've seen. Facts Original Name  Jim Knopf und Lukas der Lokomotivführer Status  Ended Network Certification 0 Meaning Can be aired at any time. Type  Miniseries Original Language  German Runtime  30m Homepage  - Genres Kids Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors t 27 thyron t 8 tmdb76585339 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}