{"link": "https://www.themoviedb.org/tv/37101?language=en", "title": "Star Driver", "resume": "Star Driver also known as Star Driver: Kagayaki no Takuto is a 2010 Japanese anime television series created and animated by Bones. The series is directed by Takuya Igarashi, with character designs by Yoshiyuki Ito and Hiroka and Misa Mizuya. The anime premiered on October 3, 2010, on MBS-TBS's prime Sunday 5pm timeslot, replacing Sengoku Basara II. Aniplex of America premiered the first episode at the 2010 New York Comic Con/New York Anime Festival on October 9, 2010. Bandai Entertainment formerly licensed the series, but due to February when Bandai stopped selling DVDs and Blu-ray discs, they also cancelled licensing with other anime. Star Driver was one of them. The series has been licensed by Aniplex of America and was streamed with English subtitles on Hulu, Crackle, and on Crunchyroll starting on August 17, 2011. A film based in the series was released on February 9, 2013 in Japan by Shochiku.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Mamoru Miyano", "Saori Hayami", "Jun Fukuyama"], "character": ["Shindō Sugata"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37101   Expand Star Driver   (2010) User Score Overview Star Driver also known as Star Driver: Kagayaki no Takuto is a 2010 Japanese anime television series created and animated by Bones. The series is directed by Takuya Igarashi, with character designs by Yoshiyuki Ito and Hiroka and Misa Mizuya. The anime premiered on October 3, 2010, on MBS-TBS's prime Sunday 5pm timeslot, replacing Sengoku Basara II. Aniplex of America premiered the first episode at the 2010 New York Comic Con/New York Anime Festival on October 9, 2010. Bandai Entertainment formerly licensed the series, but due to February when Bandai stopped selling DVDs and Blu-ray discs, they also cancelled licensing with other anime. Star Driver was one of them. The series has been licensed by Aniplex of America and was streamed with English subtitles on Hulu, Crackle, and on Crunchyroll starting on August 17, 2011. A film based in the series was released on February 9, 2013 in Japan by Shochiku. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamoru Miyano Saori Hayami Jun Fukuyama Shindō Sugata Full Cast & Crew Last Season kagayaki no takuto season 1 2010 | 25 Episodes Season 1 of Star Driver premiered on October  3, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Star Driver. You can help by rating TV shows you've seen. Facts Original Name  STAR DRIVER 輝きのタクト Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.star-driver.net/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 6 sp1ti m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}