{"link": "https://www.themoviedb.org/tv/69992?language=en", "title": "The Edge of Righteousness", "resume": "LUI MAN FUNG (MAN TSE LEUNG) is a top neurological surgeon, a very earnest and resolute type who will try to achieve his goals by hook or by crook. Because of his character defects, he has been on bad terms with his family. Even his girlfriend YIP MAN (HSUAN JESSICA HESTER) is worried about his raging temper. The relationship between the pair therefore involves frequent quarrels and arguments. Eight-year-old NG SIU TUNG (CHENG PAK LAM) has been suffering from brain cancer. Wishing for a medical cure, he follows his uncle LUK AH CHOI (CHEUNG WAI KIN) to the United States to seek consultation treatment. By chance LIU comes across NG's letter to Santa Claus. He feels for the child and offers to help him realize LUI decides to operate on NG regardless of the hospital's policies and procedures, for which he is disqualified from practicing as a doctor. LUI returns to Hong Kong and is put up at LUK's home. On LUK's recommendation, he gets a job with Chang's Pharmacy Company, which leads him to a shocking discovery later on. LUI suspects that the owner of the pharmacy CHANG TANG (CHENG JUT SI) may have something to do with a murder that happened ten years ago. To find out the truth, he has set off a wave of disturbances.....", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Alex Man Chi-Leung", "Dicky Cheung Wai-Kin", "Athena Chu", "Monica Chan", "Kent Cheng"], "character": ["雷文鳳", "陸亞彩", "孫皓皓", "林凱棉", "鄭登"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69992   Expand The Edge of Righteousness   (1993) User Score Overview LUI MAN FUNG (MAN TSE LEUNG) is a top neurological surgeon, a very earnest and resolute type who will try to achieve his goals by hook or by crook. Because of his character defects, he has been on bad terms with his family. Even his girlfriend YIP MAN (HSUAN JESSICA HESTER) is worried about his raging temper. The relationship between the pair therefore involves frequent quarrels and arguments. Eight-year-old NG SIU TUNG (CHENG PAK LAM) has been suffering from brain cancer. Wishing for a medical cure, he follows his uncle LUK AH CHOI (CHEUNG WAI KIN) to the United States to seek consultation treatment. By chance LIU comes across NG's letter to Santa Claus. He feels for the child and offers to help him realize LUI decides to operate on NG regardless of the hospital's policies and procedures, for which he is disqualified from practicing as a doctor. LUI returns to Hong Kong and is put up at LUK's home. On LUK's recommendation, he gets a job with Chang's Pharmacy Company, which leads him to a shocking discovery later on. LUI suspects that the owner of the pharmacy CHANG TANG (CHENG JUT SI) may have something to do with a murder that happened ten years ago. To find out the truth, he has set off a wave of disturbances..... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alex Man Chi-Leung 雷文鳳 Dicky Cheung Wai-Kin 陸亞彩 Athena Chu 孫皓皓 Monica Chan 林凱棉 Kent Cheng 鄭登 Full Cast & Crew Last Season Season 1 1993 | 30 Episodes Season 1 of The Edge of Righteousness premiered on December  6, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Edge of Righteousness. You can help by rating TV shows you've seen. Facts Original Name  龍兄鼠弟 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Crime Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors c 32 ctchim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}