{"link": "https://www.themoviedb.org/tv/3612?language=en", "title": "Any Dream Will Do", "resume": "Any Dream Will Do, was a 2007 talent show-themed television series produced by the BBC in the United Kingdom. It searched for a new, unknown lead to play Joseph in a West End revival of the Andrew Lloyd Webber musical Joseph and the Amazing Technicolor Dreamcoat.\nThe show was hosted by Graham Norton, who announced Lee Mead as the winner of the final public telephone vote on 9 June 2007.\nIt was the second West-End talent show to be produced by the BBC/Andrew Lloyd Webber, after How Do You Solve A Problem Like Maria?. Further Talent shows in the series have aired, with I'd Do Anything completing in 2008 and Over the Rainbow which ran in April/May 2010.\nA similar format has been used as well in The Netherlands in 2008, with the show Op zoek naar Joseph taking an unknown singer and placing the winner in the lead role for the 2009 performances in The Netherlands. On 26 October 2008, Freek Bartels was announced the winner of this show.", "rate": 50, "genre": [], "cast": ["Denise van Outen", "Lewis Bradley", "Andrew Lloyd Webber", "Ben James-Ellis", "Zoë Tyler"], "character": ["Judge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3612   Expand Any Dream Will Do   (2007) User Score Overview Any Dream Will Do, was a 2007 talent show-themed television series produced by the BBC in the United Kingdom. It searched for a new, unknown lead to play Joseph in a West End revival of the Andrew Lloyd Webber musical Joseph and the Amazing Technicolor Dreamcoat. The show was hosted by Graham Norton, who announced Lee Mead as the winner of the final public telephone vote on 9 June 2007. It was the second West-End talent show to be produced by the BBC/Andrew Lloyd Webber, after How Do You Solve A Problem Like Maria?. Further Talent shows in the series have aired, with I'd Do Anything completing in 2008 and Over the Rainbow which ran in April/May 2010. A similar format has been used as well in The Netherlands in 2008, with the show Op zoek naar Joseph taking an unknown singer and placing the winner in the lead role for the 2009 performances in The Netherlands. On 26 October 2008, Freek Bartels was announced the winner of this show. Featured Crew Andrew Lloyd Webber Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Denise van Outen Judge Lewis Bradley Andrew Lloyd Webber Ben James-Ellis Zoë Tyler Full Cast & Crew Last Season Season 1 2007 | 19 Episodes Season 1 of Any Dream Will Do premiered on March 31, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Any Dream Will Do. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/joseph Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}