{"link": "https://www.themoviedb.org/tv/46399?language=en", "title": "Devil's Dust", "resume": "An intensely personal drama based on one of Australia's most shocking corporate scandals, Devil's Dust tells the story of ordinary Australians caught in a web of deception in the James Hardie asbestos saga.\nSpanning four decades, Devil's Dust shows how industrial manufacturer James Hardie first covered up its knowledge of the dangers of its asbestos mining and products and then threaten compensation plans by moving the company overseas.", "rate": 80, "genre": ["Documentary", "Drama"], "cast": ["Anthony Hayes", "Don Hany", "Ewen Leslie", "Alexandra Schepisi"], "character": ["Bernie Banton", "Adam Bourke", "Matt Peacock", "Karen Banton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46399   Expand Devil's Dust   (2012) User Score  Play Trailer Overview An intensely personal drama based on one of Australia's most shocking corporate scandals, Devil's Dust tells the story of ordinary Australians caught in a web of deception in the James Hardie asbestos saga. Spanning four decades, Devil's Dust shows how industrial manufacturer James Hardie first covered up its knowledge of the dangers of its asbestos mining and products and then threaten compensation plans by moving the company overseas. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anthony Hayes Bernie Banton Don Hany Adam Bourke Ewen Leslie Matt Peacock Alexandra Schepisi Karen Banton Full Cast & Crew Last Season Season 1 2012 | 2 Episodes Season 1 of Devil's Dust premiered on November 11, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Devil's Dust. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Miniseries Original Language  English Runtime  86m Homepage  - Genres Documentary Drama Keywords mining asbestos Content Score 79 Pump it up! We're close now. Top Contributors 34 United600 6 Banana TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}