{"link": "https://www.themoviedb.org/tv/52804?language=en", "title": "One Hundred Tricks of Love", "resume": "Tarn (Cherry) is a pretty lady who is a swindler. She and her mother are in a lot of debts because of her mother’s gambling, so she decides to drug a man and steal a ring from him.The ring is an heirloom, it belongs to Phubadee (Great), a playboy and heir to a great fortune. Because of Tarn, Phubadee was attacked and loses his memory. Tarn then lies to him that she is his wife because she wants to swindle 10 million from him in order to repay her creditors.\nWhen Tarn moves in with Phu, she meets with his grandfather as well as his distant relative Naek. Neak is not pleased with Tarn because he wants Phu to marry May (Selina), his daughter. Both Naek and his son Ae are eying Phu’s inheritance. Napha, also a distant relative of Phu’s grandfather, doesn’t like Tarn either. But Parami, Napha’s daughter, seems to be the only one who is friendly to Tarn. Tarn especially dislikes Bunthan (Ace) who’s the gardener that was hired around the same time as when Phu and Tarn moved in. She doesn’t like him because he keeps trying to approach and get close to Phu, as if they knew each other before.\nThe thing is, Phubadee doesn’t remember Bunthan because of his memory loss. The two of them are friends and Bunthan is actually the real Phubadee while Phu, the one with memory loss, is Thawin. Bunthan has asked Thawin to act as Phubadee in order to investigate and find out the people who murdered his uncle and who had threatened to kill him. He is very worried that Thawin doesn’t remember him. All the more so as there had been several murder attempts on Thawin and Tarn, and as people in the house keep dying one after another. Inspector Somyut is investigating those murders but it turns out that he’s an accomplice working with the murderers.", "rate": 70, "genre": ["Soap", "Drama"], "cast": ["Warintorn Panhakarn", "Khemapsorn Sirisukha", "Vorarit Vaijairanai", "Selina Pearce", "Pornthip Wongkitjanon"], "character": ["Thawin (fake Phubadee)", "Tarn", "Bunthan (real Phubadee)", "May", "Parami"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52804   Expand One Hundred Tricks of Love   (2012) User Score  Play Trailer Overview Tarn (Cherry) is a pretty lady who is a swindler. She and her mother are in a lot of debts because of her mother’s gambling, so she decides to drug a man and steal a ring from him.The ring is an heirloom, it belongs to Phubadee (Great), a playboy and heir to a great fortune. Because of Tarn, Phubadee was attacked and loses his memory. Tarn then lies to him that she is his wife because she wants to swindle 10 million from him in order to repay her creditors. When Tarn moves in with Phu, she meets with his grandfather as well as his distant relative Naek. Neak is not pleased with Tarn because he wants Phu to marry May (Selina), his daughter. Both Naek and his son Ae are eying Phu’s inheritance. Napha, also a distant relative of Phu’s grandfather, doesn’t like Tarn either. But Parami, Napha’s daughter, seems to be the only one who is friendly to Tarn. Tarn especially dislikes Bunthan (Ace) who’s the gardener that was hired around the same time as when Phu and Tarn moved in. She doesn’t like him because he keeps trying to approach and get close to Phu, as if they knew each other before. The thing is, Phubadee doesn’t remember Bunthan because of his memory loss. The two of them are friends and Bunthan is actually the real Phubadee while Phu, the one with memory loss, is Thawin. Bunthan has asked Thawin to act as Phubadee in order to investigate and find out the people who murdered his uncle and who had threatened to kill him. He is very worried that Thawin doesn’t remember him. All the more so as there had been several murder attempts on Thawin and Tarn, and as people in the house keep dying one after another. Inspector Somyut is investigating those murders but it turns out that he’s an accomplice working with the murderers.  Featured Crew Uma 99 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Warintorn Panhakarn Thawin (fake Phubadee) Khemapsorn Sirisukha Tarn Vorarit Vaijairanai Bunthan (real Phubadee) Selina Pearce May Pornthip Wongkitjanon Parami Full Cast & Crew Last Season Season 1 2012 | 14 Episodes Season 1 of One Hundred Tricks of Love premiered on June 26, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on One Hundred Tricks of Love. You can help by rating TV shows you've seen. Facts Original Name  เล่ห์ร้อยรัก Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 34 Crip TB 2 TMDb Bot g 1 georgetsakonitis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}