{"link": "https://www.themoviedb.org/tv/32900?language=en", "title": "Through the Wormhole", "resume": "Hosted by Morgan Freeman, Through the Wormhole explores the deepest mysteries of existence - the questions that have puzzled mankind for eternity. What are we made of? What was there before the beginning? Are we really alone? Is there a creator? These questions have been pondered by the most exquisite minds of the human race. Now, science has evolved to the point where hard facts and evidence may be able to provide us with answers instead of philosophical theories. Through the Wormhole brings together the brightest minds and best ideas from the very edges of science - Astrophysics, Astrobiology, Quantum Mechanics, String Theory, and more - to reveal the extraordinary truth of our Universe.", "rate": 78, "genre": ["Documentary"], "cast": ["Morgan Freeman"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32900   Expand Through the Wormhole   (2010) User Score  Play Trailer Overview Hosted by Morgan Freeman, Through the Wormhole explores the deepest mysteries of existence - the questions that have puzzled mankind for eternity. What are we made of? What was there before the beginning? Are we really alone? Is there a creator? These questions have been pondered by the most exquisite minds of the human race. Now, science has evolved to the point where hard facts and evidence may be able to provide us with answers instead of philosophical theories. Through the Wormhole brings together the brightest minds and best ideas from the very edges of science - Astrophysics, Astrobiology, Quantum Mechanics, String Theory, and more - to reveal the extraordinary truth of our Universe. Featured Crew Geoffrey Sharp Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  13 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morgan Freeman Himself - Host Full Cast & Crew Last Season Season 8 2017 | 4 Episodes Season 8 of Through the Wormhole premiered on April 25, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Cheating Death Open 0 by Asharah\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  13 Posters  8 Recommendations   2010-04-25 How the Universe Works 8.0    2004-06-07 The Gadget Show 6.0    2014-03-09 Cosmos: A Spacetime Odyssey 8.2    1963-09-29 My Favorite Martian 5.4    2012-03-04 Orbit: Earth's Extraordinary Journey 8.7    2003-01-24 Penn & Teller: Bullshit! 8.0    1980-09-28 Cosmos: A Personal Voyage 8.2    2010-03-07 Wonders of the Solar System 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.sciencechannel.com/tv-shows/through-the-wormhole/ Genres Documentary Keywords wormhole universe Content Score 71 Just a little bit more... Top Contributors 27 Elizabeth Jennings 13 Goffred0 8 Banana 8 wallacesilva09  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}