{"link": "https://www.themoviedb.org/tv/514?language=en", "title": "Brides of Christ", "resume": "Diane, a young woman growing up in Australia in the mid 1960s, walks away from her fiancé to join a convent after being sure she has a calling to the faith. The Catholic Church and its followers are struggling with huge changes. The Pope has died, there is war in Vietnam and mandatory conscription, there is the Vatican controversy on abortion and contraception, and the changing face of the Church as a whole. Told in six parts, Diane faces her own demons and has to finally decide if she can teach what the Church preaches, or if it's simply impossible for her to reconcile all the contradictions of the faith and uphold her vow of obedience.", "rate": 65, "genre": ["Drama"], "cast": ["Naomi Watts", "Russell Crowe", "Kym Wilson"], "character": ["Frances Heffernan", "Dominic Maloney", "Rosemary Fitzgerald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 514   Expand Brides of Christ   (1991) User Score Overview Diane, a young woman growing up in Australia in the mid 1960s, walks away from her fiancé to join a convent after being sure she has a calling to the faith. The Catholic Church and its followers are struggling with huge changes. The Pope has died, there is war in Vietnam and mandatory conscription, there is the Vatican controversy on abortion and contraception, and the changing face of the Church as a whole. Told in six parts, Diane faces her own demons and has to finally decide if she can teach what the Church preaches, or if it's simply impossible for her to reconcile all the contradictions of the faith and uphold her vow of obedience. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Naomi Watts Frances Heffernan Russell Crowe Dominic Maloney Kym Wilson Rosemary Fitzgerald Full Cast & Crew Last Season Season 1 1991 | 6 Episodes Season 1 of Brides of Christ premiered on September  4, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Brides of Christ. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m, 55m Homepage  - Genres Drama Keywords australia miniseries catholic church 1960s Content Score 56 We're so close, yet so far. Top Contributors 13 Marr 🇳🇱 R 10 Rebecca TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}