{"link": "https://www.themoviedb.org/tv/14853?language=en", "title": "The Clone", "resume": "O Clone is a Brazilian TV Series/Telenovela that ran on the Rede Globo Network from October 1, 2001 to June 15, 2002, airing 221 episodes.", "rate": 70, "genre": [], "cast": ["Giovanna Antonelli", "Murilo Benício", "Murilo Benício", "Murilo Benício", "Juca de Oliveira"], "character": ["Jade Rachid", "Lucas Ferraz", "Diogo Ferraz", "Edvaldo Leandro \"Léo\" Moura da Silva", "Augusto Albieri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14853   Expand The Clone User Score Overview O Clone is a Brazilian TV Series/Telenovela that ran on the Rede Globo Network from October 1, 2001 to June 15, 2002, airing 221 episodes. Featured Crew Glória Perez Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Giovanna Antonelli Jade Rachid Murilo Benício Lucas Ferraz Murilo Benício Diogo Ferraz Murilo Benício Edvaldo Leandro \"Léo\" Moura da Silva Juca de Oliveira Augusto Albieri Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Original Name  O Clone Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  50m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors b 14 bluwy 4 macawlu s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}