{"link": "https://www.themoviedb.org/tv/45058?language=en", "title": "Shippū! Iron Leaguer", "resume": "Shippū! Iron Leaguer is an anime television series produced by Sunrise. Directed by Tetsurō Amino and featuring mecha designs by Kunio Okawara, it premiered on TV Tokyo on April 6, 1993 and ended its run on March 29, 1994, spanning a total of 52 episodes.", "rate": 0, "genre": ["Animation"], "cast": ["Chafurin", "Chisa Yokoyama", "Fumihiko Tachiki", "Jūrōta Kosugi", "Ryotaro Okiayu"], "character": ["Bull Armor", "Ruly Ginjou", "Gold Foot", "Topjoy", "Mach Windy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45058   Expand Shippū! Iron Leaguer   (1993) User Score Overview Shippū! Iron Leaguer is an anime television series produced by Sunrise. Directed by Tetsurō Amino and featuring mecha designs by Kunio Okawara, it premiered on TV Tokyo on April 6, 1993 and ended its run on March 29, 1994, spanning a total of 52 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chafurin Bull Armor Chisa Yokoyama Ruly Ginjou Fumihiko Tachiki Gold Foot Jūrōta Kosugi Topjoy Ryotaro Okiayu Mach Windy Full Cast & Crew Last Season Whirlwind! iron leaguer season 1 1993 | 11 Episodes Season 1 of Shippū! Iron Leaguer premiered on April  6, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shippū! Iron Leaguer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}