{"link": "https://www.themoviedb.org/tv/15305?language=en", "title": "Antikrundan", "resume": "Antikrundan is the Swedish version of the original BBC format Antiques Roadshow. The show visits different locations in Sweden and lets people bring their antiques to be valued by experts. It remains popular and often has more than 2 million viewers. The 19th season was shown in 2009. Most of the experts have been with the programme since the start. Jesper Aspegren was the original host. He left in 1999 and was succeeded by Anne Lundberg.\nAntikrundan started out as a coproduction between SVT Malmö and the BBC where the Antiques Roadshow would visit Scandinavia for two programmes. Antikrundan premiered in August 1989 on TV2 and has since been shown on SVT every year. Antiques Roadshow is shown on BBC Lifestyle and TV8 in Sweden.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15305   Expand Antikrundan   (1989) User Score Overview Antikrundan is the Swedish version of the original BBC format Antiques Roadshow. The show visits different locations in Sweden and lets people bring their antiques to be valued by experts. It remains popular and often has more than 2 million viewers. The 19th season was shown in 2009. Most of the experts have been with the programme since the start. Jesper Aspegren was the original host. He left in 1999 and was succeeded by Anne Lundberg. Antikrundan started out as a coproduction between SVT Malmö and the BBC where the Antiques Roadshow would visit Scandinavia for two programmes. Antikrundan premiered in August 1989 on TV2 and has since been shown on SVT every year. Antiques Roadshow is shown on BBC Lifestyle and TV8 in Sweden. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 28 2017 | 1 Episode Season 28 of Antikrundan premiered on January 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Antikrundan. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Swedish Runtime  - Homepage   http://www.svt.se/antikrundan Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 9 Kris Ekman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}