{"link": "https://www.themoviedb.org/tv/21592?language=en", "title": "Rescue: Special Ops", "resume": "Rescue: Special Ops is an Australian television drama series that first screened on the Nine Network in 2009. Filmed in and around Sydney, the program is produced by Southern Star Group with the assistance of Screen Australia and the New South Wales Government.\nThis drama series focuses on a team of experienced professional paramedics who specialise in rescue operations. It premiered on Sunday 2 August 2009, and the season finale of the first season aired on Sunday 25 October. A second season screened from 28 June 2010. The third and final season consisting of 22 episodes screened from 30 May 2011. The Nine Network has confirmed it will not be renewing Rescue Special Ops for a fourth season.", "rate": 80, "genre": ["Drama"], "cast": ["Gigi Edgley", "Peter Phelps", "Libby Tanner", "Daniel Amalm", "Les Hill"], "character": ["Lara Knight", "Vince Marchello", "Michelle LeTourneau", "Jordan Zwitkowski", "Dean Gallagher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21592   Expand Rescue: Special Ops   (2009) User Score Overview Rescue: Special Ops is an Australian television drama series that first screened on the Nine Network in 2009. Filmed in and around Sydney, the program is produced by Southern Star Group with the assistance of Screen Australia and the New South Wales Government. This drama series focuses on a team of experienced professional paramedics who specialise in rescue operations. It premiered on Sunday 2 August 2009, and the season finale of the first season aired on Sunday 25 October. A second season screened from 28 June 2010. The third and final season consisting of 22 episodes screened from 30 May 2011. The Nine Network has confirmed it will not be renewing Rescue Special Ops for a fourth season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gigi Edgley Lara Knight Peter Phelps Vince Marchello Libby Tanner Michelle LeTourneau Daniel Amalm Jordan Zwitkowski Les Hill Dean Gallagher Full Cast & Crew Last Season Season 3 2011 | 22 Episodes Season 3 of Rescue: Special Ops premiered on May 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rescue: Special Ops. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://channelnine.ninemsn.com.au/rescuespecialops/ Genres Drama Keywords australia sibling relationship rescue team paramedic medical drama Content Score 86 Almost there... Top Contributors 16 Banana 3 8 38956 2 t0by 1 The Hydracubus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}