{"link": "https://www.themoviedb.org/tv/45956?language=en", "title": "Celebrity Big Brother", "resume": "Celebrity Big Brother is a British reality television game show in which a number of celebrity contestants live in an isolated house trying to avoid being evicted by the public with the aim of winning a large cash prize being donated to the winner's nominated charity at the end of the run. The programme aired annually between 2001 and 2011, until 2012 when, for the first time, two series aired in the same year. This process has since continued.\nThe show is a spin-off of the original series Big Brother. There are a number of differences between Big Brother and Celebrity Big Brother. For example, Celebrity Big Brother lasts for a much shorter time than Big Brother and the celebrities – so long as they are not ejected or quit the programme – are paid for their participation.\nFrom its inception in 2001, Celebrity Big Brother was broadcast on Channel 4 and its sister channel E4, until Big Brother was cancelled by Channel 4 in 2010 due to falling ratings. Celebrity Big Brother has been broadcast on Channel 5 and its sister channel 5* since Channel 5 acquired the rights in 2011. During its run on Channel 4, Celebrity Big Brother was presented by Davina McCall, who also presented the original show.", "rate": 38, "genre": ["Reality"], "cast": ["Marcus Bentley"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45956   Expand Celebrity Big Brother   (2001) User Score Overview Celebrity Big Brother is a British reality television game show in which a number of celebrity contestants live in an isolated house trying to avoid being evicted by the public with the aim of winning a large cash prize being donated to the winner's nominated charity at the end of the run. The programme aired annually between 2001 and 2011, until 2012 when, for the first time, two series aired in the same year. This process has since continued. The show is a spin-off of the original series Big Brother. There are a number of differences between Big Brother and Celebrity Big Brother. For example, Celebrity Big Brother lasts for a much shorter time than Big Brother and the celebrities – so long as they are not ejected or quit the programme – are paid for their participation. From its inception in 2001, Celebrity Big Brother was broadcast on Channel 4 and its sister channel E4, until Big Brother was cancelled by Channel 4 in 2010 due to falling ratings. Celebrity Big Brother has been broadcast on Channel 5 and its sister channel 5* since Channel 5 acquired the rights in 2011. During its run on Channel 4, Celebrity Big Brother was presented by Davina McCall, who also presented the original show. Featured Crew John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marcus Bentley Narrator Full Cast & Crew Current Season Season 21 2018 | 37 Episodes Season 21 of Celebrity Big Brother premiered on January  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  15 Posters  5 Recommendations   2007-02-01 Benidorm 7.4  Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://bigbrother.channel5.com Genres Reality Keywords celebrity housemates Content Score 64 We're so close, yet so far. Top Contributors 728 Banana c 116 courtneysmith86 g 76 gallagher b 34 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}