{"link": "https://www.themoviedb.org/tv/1063?language=en", "title": "Samurai Champloo", "resume": "Mugen is a ferocious, animalistic warrior  with a fighting style inspired by break-dancing. Jin is a ronin samurai  who wanders the countryside  alone. They may not be friends, but their paths continually cross. And  when ditzy waitress Fuu gets them out of hot water with the local  magistrate, they agree to join her search for the \"samurai who smells of sunflowers.\"", "rate": 81, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama"], "cast": ["Ayako Kawasumi", "Kazuya Nakai", "Ginpei Sato", "Akio Otsuka", "Eiji Maruyama"], "character": ["Fuu", "Mugen", "Jin", "Okuru", "Biwa Minstrel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1063   Expand Samurai Champloo   (2004) User Score  Play Trailer Overview Mugen is a ferocious, animalistic warrior  with a fighting style inspired by break-dancing. Jin is a ronin samurai  who wanders the countryside  alone. They may not be friends, but their paths continually cross. And  when ditzy waitress Fuu gets them out of hot water with the local  magistrate, they agree to join her search for the \"samurai who smells of sunflowers.\" Featured Crew Shinichiro Watanabe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  13 Posters  13 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Ayako Kawasumi Fuu Kazuya Nakai Mugen Ginpei Sato Jin Akio Otsuka Okuru Eiji Maruyama Biwa Minstrel Full Cast & Crew Last Season Season 1 2004 | 26 Episodes Season 1 of Samurai Champloo premiered on May 20, 2004. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Samurai Champloo. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  13 Posters  13 Recommendations   1998-04-02 TRIGUN 7.7    1998-04-03 Cowboy Bebop 8.2    2006-04-08 Black Lagoon 7.9    2007-04-01 Gurren Lagann 7.9    2003-10-04 Fullmetal Alchemist 8.0    2006-02-10 Hellsing Ultimate 7.7    1996-01-10 Rurouni Kenshin 7.6    2004-07-25 Elfen Lied 7.6  Facts Original Name  サムライチャンプルー Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.samuraichamploo.com/ Genres Action & Adventure Animation Comedy Drama Keywords hip-hop obsessive quest shounen changing era Content Score 100 Yes! Looking good! Top Contributors R 48 RapsodiaVerde m 19 movie28 10 United600 z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}