{"link": "https://www.themoviedb.org/tv/32429?language=en", "title": "Horrible Histories", "resume": "Horrible Histories is an animated children's television series based on the Terry Deary book series of the same name. The series ran for 26 episodes between January 1, 2001 and March 25, 2002. The show features the characters Stitch Fleischer, Mo Burrows and Darren Dongle. The show is produced by Mike Young Productions and Scholastic Productions. It is directed by Andrew Young and Gordon Langley. It is produced By Martha Atwater, Tamar Simon Hoffs, Michelle Conway, Paul Cummings, Deborah Forte, Mike Young, Mark Young, Beth Richman and Charlie Stickney, among others. It is animated by Glenn Jason Hanna.It is written by Martha Atwater, Terry Deary, Charlie Stickney, Andrew Young, Gordon Langley, William Forrest Cluverius. It has a running time of 25 minutes. The series was released as a 3-disc DVD box set in 2005.", "rate": 100, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32429   Expand Horrible Histories   (2001) User Score Overview Horrible Histories is an animated children's television series based on the Terry Deary book series of the same name. The series ran for 26 episodes between January 1, 2001 and March 25, 2002. The show features the characters Stitch Fleischer, Mo Burrows and Darren Dongle. The show is produced by Mike Young Productions and Scholastic Productions. It is directed by Andrew Young and Gordon Langley. It is produced By Martha Atwater, Tamar Simon Hoffs, Michelle Conway, Paul Cummings, Deborah Forte, Mike Young, Mark Young, Beth Richman and Charlie Stickney, among others. It is animated by Glenn Jason Hanna.It is written by Martha Atwater, Terry Deary, Charlie Stickney, Andrew Young, Gordon Langley, William Forrest Cluverius. It has a running time of 25 minutes. The series was released as a 3-disc DVD box set in 2005. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2002 | 13 Episodes Season 2 of Horrible Histories premiered on January  1, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Horrible Histories. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.abc.net.au/abckids/shows/prog83.htm Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}