{"link": "https://www.themoviedb.org/tv/63528?language=en", "title": "Siberian Cut", "resume": "Sean Vann is an American Logger with a plan -- a big plan. He's  worked in the Russian forestry industry for the last seventeen  years...but he's always been working for a boss. Now Sean is putting everything on the line for the opportunity  of a lifetime in deepest Siberia. He has a 3-month contract to cut  wood, set up his own operation and become master of his own destiny.", "rate": 0, "genre": ["Reality"], "cast": ["Jason Watt", "Sean Vann", "Zack Sheets", "Jared Fitchett", "Yuri Panchuk"], "character": ["Narrator", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63528   Expand Siberian Cut   (2014) User Score Overview Sean Vann is an American Logger with a plan -- a big plan. He's  worked in the Russian forestry industry for the last seventeen  years...but he's always been working for a boss. Now Sean is putting everything on the line for the opportunity  of a lifetime in deepest Siberia. He has a 3-month contract to cut  wood, set up his own operation and become master of his own destiny. Featured Crew Ben Allen Creator Tom Cross Creator Tom Hutchings Creator James Levelle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Watt Narrator Sean Vann Himself Zack Sheets Himself Jared Fitchett Himself Yuri Panchuk Himself Full Cast & Crew Last Season Season 1 2014 | 9 Episodes Season 1 of Siberian Cut premiered on June  3, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Siberian Cut. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Reality Original Language  Russian Runtime  45m Homepage   http://www.discovery.com/tv-shows/siberian-cut/ Genres Reality Keywords siberia loggers Content Score 93 Almost there... Top Contributors 71 Apollo 6 Elizabeth Jennings 4 Banana 3 vacdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}