{"link": "https://www.themoviedb.org/tv/42460?language=en", "title": "Vampire Princess Miyu", "resume": "Miyu, a vampire girl, acts as a guardian, sending stray demons known as Shinma back to the darkness while publicly posing as a high school student.", "rate": 80, "genre": ["Animation", "Drama"], "cast": ["Miki Nagasawa", "Shin'ichirou Miki", "Megumi Ogata", "Megumi Ogata", "Asa Shirakura"], "character": ["Miyu Yamano", "Larva", "Reiha", "Matsukaze", "Chisato Inoue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42460   Expand Vampire Princess Miyu   (1997) User Score Overview Miyu, a vampire girl, acts as a guardian, sending stray demons known as Shinma back to the darkness while publicly posing as a high school student. Featured Crew Narumi Kakinouchi Creator Toshiki Hirano Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miki Nagasawa Miyu Yamano Shin'ichirou Miki Larva Megumi Ogata Reiha Megumi Ogata Matsukaze Asa Shirakura Chisato Inoue Full Cast & Crew Last Season Season 1 1997 | 26 Episodes Season 1 of Vampire Princess Miyu premiered on October  7, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Vampire Princess Miyu. You can help by rating TV shows you've seen. Facts Original Name  吸血姫美夕 Status  Ended Network Certification NR Meaning No rating information Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors K 14 Kuroneko45 9 BrerFox 7 seboseboss 7 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}