{"link": "https://www.themoviedb.org/tv/10682?language=en", "title": "Little Men", "resume": "Little Men is a Canadian television show that first aired on November 7, 1998 on the PAX TV network and was shown in Canada on CTV beginning January 1, 1999. The show is set as a continuation from the Louisa May Alcott novel Little Men as a follow-up to Little Women. Due to low ratings, the show was cancelled after 2 seasons, with the final episode aired on December 17, 1999.", "rate": 80, "genre": ["Drama"], "cast": ["Michelle Burke", "Spencer Rochfort", "Robin Dunne", "Trevor Blumas", "Rachel Skarsten"], "character": ["Josephine (Jo) Bhaer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10682   Expand Little Men   (1998) User Score Overview Little Men is a Canadian television show that first aired on November 7, 1998 on the PAX TV network and was shown in Canada on CTV beginning January 1, 1999. The show is set as a continuation from the Louisa May Alcott novel Little Men as a follow-up to Little Women. Due to low ratings, the show was cancelled after 2 seasons, with the final episode aired on December 17, 1999. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michelle Burke Josephine (Jo) Bhaer Spencer Rochfort Robin Dunne Trevor Blumas Rachel Skarsten Full Cast & Crew Last Season Season 2 1999 | 13 Episodes Season 2 of Little Men premiered on August 27, 1999. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply cute Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Little Men. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors a 11 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}