{"link": "https://www.themoviedb.org/tv/21762?language=en", "title": "Parenthood", "resume": "Parenthood is an American comedy-drama television series developed by Jason Katims. Loosely based on the 1989 film of the same title, Parenthood tells of the Braverman clan which consists of an older couple, their four children and their families.", "rate": 73, "genre": ["Drama"], "cast": ["Peter Krause", "Craig T. Nelson", "Monica Potter", "Erika Christensen", "Bonnie Bedelia"], "character": ["Adam Braverman", "Zeek Braverman", "Kristina Braverman", "Julia Braverman-Graham", "Camille Braverman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21762   Expand Parenthood   (2010) User Score  Play Trailer Overview Parenthood is an American comedy-drama television series developed by Jason Katims. Loosely based on the 1989 film of the same title, Parenthood tells of the Braverman clan which consists of an older couple, their four children and their families. Featured Crew Jason Katims Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  12 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Krause Adam Braverman Craig T. Nelson Zeek Braverman Monica Potter Kristina Braverman Erika Christensen Julia Braverman-Graham Bonnie Bedelia Camille Braverman Full Cast & Crew Last Season Season 6 2014 | 13 Episodes Season 6 of Parenthood premiered on September 25, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply The Bravermans.. Open 0 by Stormy86\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  3 Recommendations   2011-08-05 Friends with Benefits 6.1    2013-10-18 The Birthday Boys 7.1    2014-06-21 Almost Royal 6.5    2006-08-07 Gene Simmons Family Jewels 4.4    2014-02-23 Growing Up Fisher 5.9    2014-09-30 Happyland 3.3    2010-09-21 Raising Hope 6.9    2009-09-23 Cougar Town 5.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m, 60m Homepage   http://www.nbc.com/parenthood Genres Drama Keywords big family family drama Content Score 100 Yes! Looking good! Top Contributors 50 Banana 9 Elizabeth Jennings TB 8 TMDb Bot S 8 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}