{"link": "https://www.themoviedb.org/tv/64570?language=en", "title": "Chica Vampiro", "resume": "Daisy O'Brian is a normal girl who dreams of a singing career in musical comedy. Her parents are vampires, and per her family tradition, she must decide to become a vampire or not on her 16th birthday. On that day, Daisy decides to stay human to live next to her love, Max, who is her neighbor and classmate.\nHowever, that same day, a fatal accident changes her life forever. The doctor says to her parents that she is not going to make it. So, her parents decide to bite Daisy, to save her, turning her into a vampire. This makes Vicente (her younger brother) the only mortal in the family. From that moment, Daisy leads a double life full of risks, where she must attend a human school, hiding her nature, and also go to vampire school and take classes for newly bitten vampires.", "rate": 100, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Greeicy Rendón", "Santiago Talledo", "Eduardo Pérez", "Lorena García"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64570   Expand Chica Vampiro   (2013) User Score Overview Daisy O'Brian is a normal girl who dreams of a singing career in musical comedy. Her parents are vampires, and per her family tradition, she must decide to become a vampire or not on her 16th birthday. On that day, Daisy decides to stay human to live next to her love, Max, who is her neighbor and classmate. However, that same day, a fatal accident changes her life forever. The doctor says to her parents that she is not going to make it. So, her parents decide to bite Daisy, to save her, turning her into a vampire. This makes Vicente (her younger brother) the only mortal in the family. From that moment, Daisy leads a double life full of risks, where she must attend a human school, hiding her nature, and also go to vampire school and take classes for newly bitten vampires. Featured Crew Marcela Citterio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Greeicy Rendón Santiago Talledo Eduardo Pérez Lorena García Full Cast & Crew Last Season Season 1 2013 | 120 Episodes Season 1 of Chica Vampiro premiered on May 14, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Chica Vampiro. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors r 23 roya38 12 Elizabeth Jennings 2 radocity CM 2 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}