{"link": "https://www.themoviedb.org/tv/7409?language=en", "title": "Black Gold", "resume": "Black Gold is a reality-documentary television series that chronicles three oil drilling rigs in Andrews County, Texas, 30 miles northwest of Odessa. It is partly produced by Thom Beers, creator of Deadliest Catch and Ice Road Truckers. The Black Gold theme song is sung by country music star Trace Adkins. The title \"Black Gold\" comes from a slang term for oil.\nBlack Gold airs Wednesday nights on truTV at 10pm. It is also shown as a special presentation on TNT in high definition. The show also airs in the United Kingdom on Five, under the title Oil Riggers.", "rate": 90, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7409   Expand Black Gold   (2008) User Score Overview Black Gold is a reality-documentary television series that chronicles three oil drilling rigs in Andrews County, Texas, 30 miles northwest of Odessa. It is partly produced by Thom Beers, creator of Deadliest Catch and Ice Road Truckers. The Black Gold theme song is sung by country music star Trace Adkins. The title \"Black Gold\" comes from a slang term for oil. Black Gold airs Wednesday nights on truTV at 10pm. It is also shown as a special presentation on TNT in high definition. The show also airs in the United Kingdom on Five, under the title Oil Riggers. Featured Crew Thom Beers Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2012 | 10 Episodes Season 5 of Black Gold premiered on December 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Black Gold. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 1 Michael 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}