{"link": "https://www.themoviedb.org/tv/43911?language=en", "title": "¡Ay, Señor, Señor!", "resume": "¡Ay, Señor, Señor! was a 26-episode Spanish television sitcom transmitted by Antena 3 between 1994 and 1995. It tells of the adventures of a modern, open-minded priest, portrayed by the actor Andrés Pajares. The series kick-started several acting careers, including those of Javier Cámara and Neus Asensi.\nThe singer Massiel starred in four episodes and Paloma Cela in nine, with many other actors and actresses making regular or guest appearances.", "rate": 0, "genre": ["Comedy"], "cast": ["Andrés Pajares", "Javier Cámara", "Lola Lemos", "Xesc Forteza", "Massiel"], "character": ["Don Luis Lagos", "Padre Ángel Murillo", "Doña Angustias", "Padre Claudio", "Rosa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43911   Expand ¡Ay, Señor, Señor!   (1994) User Score Overview ¡Ay, Señor, Señor! was a 26-episode Spanish television sitcom transmitted by Antena 3 between 1994 and 1995. It tells of the adventures of a modern, open-minded priest, portrayed by the actor Andrés Pajares. The series kick-started several acting careers, including those of Javier Cámara and Neus Asensi. The singer Massiel starred in four episodes and Paloma Cela in nine, with many other actors and actresses making regular or guest appearances. Featured Crew Julio Sánchez Valdés Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrés Pajares Don Luis Lagos Javier Cámara Padre Ángel Murillo Lola Lemos Doña Angustias Xesc Forteza Padre Claudio Massiel Rosa Full Cast & Crew Last Season Season 2 1994 | 15 Episodes Season 2 of ¡Ay, Señor, Señor! premiered on November  7, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on ¡Ay, Señor, Señor!. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors m 14 medax7 1 radocity M 1 MrVicenmart  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}