{"link": "https://www.themoviedb.org/tv/15166?language=en", "title": "Os Normais", "resume": "Os Normais is a Brazilian sitcom directed by José Alvarenga Jr. and written by Jorge Furtado, Alexandre Machado, and Fernanda Young. It aired from 2001 to 2003 on Rede Globo. It features a lot of nonsensical situations, unpredictable stories and wild, often explicit humour. The sitcom was adapted in 2003 into a film titled Os Normais, O Filme, which received the sequel Os Normais 2 - A Noite Mais Maluca de Todas in 2009.", "rate": 76, "genre": ["Comedy"], "cast": ["Fernanda Torres", "Luiz Fernando Guimarães", "Diogo Vilela", "Selton Mello", "Graziella Moretto"], "character": ["Vani", "Rui", "Aldo", "Bernardo", "Maristela"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15166   Expand Os Normais   (2001) User Score Overview Os Normais is a Brazilian sitcom directed by José Alvarenga Jr. and written by Jorge Furtado, Alexandre Machado, and Fernanda Young. It aired from 2001 to 2003 on Rede Globo. It features a lot of nonsensical situations, unpredictable stories and wild, often explicit humour. The sitcom was adapted in 2003 into a film titled Os Normais, O Filme, which received the sequel Os Normais 2 - A Noite Mais Maluca de Todas in 2009. Featured Crew Jorge Furtado Creator Alexandre Machado Creator Fernanda Young Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fernanda Torres Vani Luiz Fernando Guimarães Rui Diogo Vilela Aldo Selton Mello Bernardo Graziella Moretto Maristela Full Cast & Crew Last Season Season 3 2003 | 17 Episodes Season 3 of Os Normais premiered on April 11, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Os Normais. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 28 tgoprince 3 lzbrgs O 1 OtavioAngeli  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}