{"link": "https://www.themoviedb.org/tv/4733?language=en", "title": "Food Network Star", "resume": "Cooking competition following upcoming chefs, and the winner gets to host their own show!", "rate": 62, "genre": ["Reality"], "cast": ["Bobby Flay", "Giada De Laurentiis"], "character": ["Himself - Mentor", "Herself - Mentor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4733   Expand Food Network Star   (2005) User Score Overview Cooking competition following upcoming chefs, and the winner gets to host their own show! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bobby Flay Himself - Mentor Giada De Laurentiis Herself - Mentor Full Cast & Crew Current Season Season 14 2018 | 4 Episodes Season 14 of Food Network Star premiered on June 10, 2018. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply b Giada Open 4 by  Mrs. Y b Matthew Open 5 by  lmao7 Rated super low here?? It's a fun job to apply lol Open 2 by  lmao7 Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Food Network Star. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Reality Original Language  English Runtime  60m, 90m Homepage   http://www.foodnetwork.com/the-next-food-network-star/index.html Genres Reality Keywords competition cooking cooking competition Content Score 56 We're so close, yet so far. Top Contributors 29 Elizabeth Jennings b 6 basher TB 3 TMDb Bot a 2 anisamawarni  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}