{"link": "https://www.themoviedb.org/tv/61808?language=en", "title": "Damn the Consequences", "resume": "This show is located in the picturesque Oštrovac, a village on the edge of the national park. Katarina, Tomislav and Krešo will get a million euros from his grandfather - but only if they spend a year in his ruined house in Oštrovac. Otherwise, the money belongs to the locals.", "rate": 100, "genre": ["Comedy", "Drama"], "cast": ["Mirna Medaković", "Momčilo Otašević", "Milan Štrljić", "Janko Popović Volarić", "Stjepan Perić"], "character": ["Katarina Došen", "Damir Gavran", "Mile Gavran", "Krešo Kolarić", "Ljubo Žulj"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61808   Expand Damn the Consequences   (2014) User Score Overview This show is located in the picturesque Oštrovac, a village on the edge of the national park. Katarina, Tomislav and Krešo will get a million euros from his grandfather - but only if they spend a year in his ruined house in Oštrovac. Otherwise, the money belongs to the locals. Featured Crew Vlado Bulić Creator Mirna Miličić Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mirna Medaković Katarina Došen Momčilo Otašević Damir Gavran Milan Štrljić Mile Gavran Janko Popović Volarić Krešo Kolarić Stjepan Perić Ljubo Žulj Full Cast & Crew Last Season Season 1 2014 | 80 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Damn the Consequences. You can help by rating TV shows you've seen. Facts Original Name  Kud puklo da puklo Status  Returning Series Network Certification  - Type  Scripted Original Language  Croatian Runtime  60m Homepage   http://novatv.dnevnik.hr/kud-puklo-da-puklo/ Genres Comedy Drama Keywords inheritance Content Score 93 Almost there... Top Contributors 29 Adriancija M 20 Mario_Gaborović 5 Banana 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}