{"link": "https://www.themoviedb.org/tv/38222?language=en", "title": "Maria la del Barrio", "resume": "Maria La Del Barrio is a Philippine remake of the Mexican drama María la del Barrio airing on ABS-CBN. It stars Erich Gonzales and Enchong Dee.", "rate": 0, "genre": ["Drama"], "cast": ["Erich Gonzales", "Enchong Dee", "Angel Aquino", "Ian Veneracion", "Assunta de Rossi"], "character": ["María Hernandez", "Luis Fernando Dela Vega", "Victoria Montenegro-Dela Vega", "Fernando Dela Vega", "Sandra Hernandez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38222   Expand Maria la del Barrio   (2011) User Score Overview Maria La Del Barrio is a Philippine remake of the Mexican drama María la del Barrio airing on ABS-CBN. It stars Erich Gonzales and Enchong Dee. Featured Crew Inés Rodena Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erich Gonzales María Hernandez Enchong Dee Luis Fernando Dela Vega Angel Aquino Victoria Montenegro-Dela Vega Ian Veneracion Fernando Dela Vega Assunta de Rossi Sandra Hernandez Full Cast & Crew Last Season Season 2 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Maria la del Barrio. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Tagalog Runtime  - Homepage   http://www.abs-cbn.com/Weekdays/article/10125/maria/Maria-La-Del-Barrio.aspx Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors L 35 Leah W 1 Wakaku  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}