{"link": "https://www.themoviedb.org/tv/3764?language=en", "title": "Hustle", "resume": "A motley group of London con artists pull of a series of daring and intricate stings.", "rate": 78, "genre": ["Comedy", "Crime", "Drama", "Mystery"], "cast": ["Adrian Lester", "Robert Glenister", "Matt Di Angelo", "Kelly Adams", "Robert Vaughn"], "character": ["Michael Stone", "Ashley Morgan", "Sean Kennedy", "Emma Kennedy", "Albert Stroller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3764   Expand Hustle   (2004) User Score  Play Trailer Overview A motley group of London con artists pull of a series of daring and intricate stings. Featured Crew Tony Jordan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adrian Lester Michael Stone Robert Glenister Ashley Morgan Matt Di Angelo Sean Kennedy Kelly Adams Emma Kennedy Robert Vaughn Albert Stroller Full Cast & Crew Last Season Season 8 2012 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  14 Posters  7 Recommendations   1996-11-12 Never Mind the Buzzcocks 7.5    2000-03-30 Da Ali G Show 6.8    2002-05-13 Spooks 7.5    1993-12-27 Shooting Stars 6.7    2008-12-07 Leverage 7.2    2007-06-28 Burn Notice 7.3    2006-09-21 Shark 6.8    2002-11-14 Harry Hill's TV Burp 7.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b007gf9k Genres Comedy Crime Drama Mystery Keywords con artist thief inside man grifter coworker relationship fake identity british humour fixer Content Score 100 Yes! Looking good! Top Contributors 48 spaceship broken r 14 rolob 12 Banana j 11 jafichan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}