{"link": "https://www.themoviedb.org/tv/32709?language=en", "title": "Mike & Molly", "resume": "A comedy about a working class Chicago couple who find love at an Overeaters Anonymous meeting.", "rate": 58, "genre": ["Comedy"], "cast": ["Billy Gardell", "Melissa McCarthy", "Reno Wilson", "Swoosie Kurtz", "Louis Mustillo"], "character": ["Mike Biggs", "Molly Flynn", "Carl McMillan", "Joyce Flynn", "Vince"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32709   Expand Mike & Molly   (2010) User Score  Play Trailer Overview A comedy about a working class Chicago couple who find love at an Overeaters Anonymous meeting. Featured Crew Chuck Lorre Creator James Burrows Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  5 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy Gardell Mike Biggs Melissa McCarthy Molly Flynn Reno Wilson Carl McMillan Swoosie Kurtz Joyce Flynn Louis Mustillo Vince Full Cast & Crew Last Season Season 6 2016 | 13 Episodes Season 6 of Mike & Molly premiered on January  6, 2016. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Joyce: Happy Birthday Swoosie Kurtz!! Open 0 by wonder2wonder\n      \n     w Molly: Happy Birthday Melissa McCarthy! Open 0 by wonder2wonder\n      \n     One thing I wonder about. Open 0 by Bob Peters 61\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  12 Recommendations   1988-11-14 Murphy Brown 6.5    1990-04-19 Wings 6.7    2001-09-30 Law & Order: Criminal Intent 7.1    1998-09-21 Will & Grace 6.5    2011-09-19 2 Broke Girls 5.6    1996-01-09 3rd Rock from the Sun 7.3    2001-10-03 According to Jim 5.8    2002-03-27 George Lopez 4.9  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.cbs.com/shows/mike_and_molly/ Genres Comedy Keywords chicago overweight dating sitcom straight relationship Content Score 100 Yes! Looking good! Top Contributors 20 Elizabeth Jennings 12 lineker TB 10 TMDb Bot a 10 alexander.meyer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}