{"link": "https://www.themoviedb.org/tv/40521?language=en", "title": "家有儿女", "resume": "Home with Kids, is a sitcom/drama from Mainland China. There are four series of Home with Kids, i.e. Home with Kids 1, Home with Kids 2, Home with Kids 3 and Home with Kids 4, which were released respectively in 2004, 2005, 2006 and 2007. It is considered to be an equivalent to Growing Pains, a US sitcom. Unlike most Chinese multi-camera sitcoms, Home With Kids prominently uses child actors as main roles. The series also reunites Song Dandan and Wen Xingyu, who both starred in China's first multi-camera sitcom, I Love My Family.\nThe series has ended with 365 half-hour episodes.", "rate": 100, "genre": ["Kids", "Comedy", "Family"], "cast": ["Hao-ran You", "Zhang Yishan", "Gao Yalin", "Song Dandan", "Ning DanLin"], "character": ["Xia Yu", "Liu Xing", "Xia Donghai", "Liu Mei", "Xia Xue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40521   Expand 家有儿女   (2005) User Score Overview Home with Kids, is a sitcom/drama from Mainland China. There are four series of Home with Kids, i.e. Home with Kids 1, Home with Kids 2, Home with Kids 3 and Home with Kids 4, which were released respectively in 2004, 2005, 2006 and 2007. It is considered to be an equivalent to Growing Pains, a US sitcom. Unlike most Chinese multi-camera sitcoms, Home With Kids prominently uses child actors as main roles. The series also reunites Song Dandan and Wen Xingyu, who both starred in China's first multi-camera sitcom, I Love My Family. The series has ended with 365 half-hour episodes. Featured Crew Cong Lin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hao-ran You Xia Yu Zhang Yishan Liu Xing Gao Yalin Xia Donghai Song Dandan Liu Mei Ning DanLin Xia Xue Full Cast & Crew Last Season Season 1 2005 | 100 Episodes Season 1 of 家有儿女 premiered on February 12, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 家有儿女. You can help by rating TV shows you've seen. Facts Status  Ended Network Beijing Television Certification  - Type  Scripted Original Language  Chinese Runtime  20m Homepage  - Genres Kids Comedy Family Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors w 32 woogoldsgreat 2 chaylun l 1 lovest  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}