{"link": "https://www.themoviedb.org/tv/20996?language=en", "title": "Happy Monster Band", "resume": "Happy Monster Band is an interstitial program that airs on Playhouse Disney, and is produced by Kickstart Productions. The series was created by Don Carter. The show is about a group of monsters that performs songs about friendship, love, exercising, chores, and other preschool related themes. Season 2 follows the Happy Monsters on their tour around the world. On March 23, 2012, when Disney Junior started its own channel, the show returned to airing with only reruns.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20996   Expand Happy Monster Band   (2007) User Score Overview Happy Monster Band is an interstitial program that airs on Playhouse Disney, and is produced by Kickstart Productions. The series was created by Don Carter. The show is about a group of monsters that performs songs about friendship, love, exercising, chores, and other preschool related themes. Season 2 follows the Happy Monsters on their tour around the world. On March 23, 2012, when Disney Junior started its own channel, the show returned to airing with only reruns. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2014 | 4 Episodes Season 3 of Happy Monster Band premiered on June 14, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Happy Monster Band. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://atv.disney.go.com/playhouse/happymonsterband/ Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 2 tboy197189 1 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}