{"link": "https://www.themoviedb.org/tv/1460?language=en", "title": "Andy Richter Controls the Universe", "resume": "Andy Richter Controls the Universe was a sitcom which aired from 2002–2003 on the Fox network. The series was Andy Richter's first starring role after leaving NBC's Late Night with Conan O'Brien in 2000.\nIt ran for two seasons, totaling nineteen episodes, and was canceled due in part to poor ratings. The show was a joint production of 20th Century Fox Television and Paramount Network Television. Paramount's successor CBS Television Distribution has distribution rights to the series in the United States while Fox retains global distribution rights.\nTV Guide included the series in their 2013 list of 60 shows that were \"Cancelled Too Soon\".", "rate": 83, "genre": ["Comedy"], "cast": ["Andy Richter", "Paget Brewster", "Irene Molloy", "Jonathan Slavin", "James Patrick Stuart"], "character": ["Jessica Green"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1460   Expand Andy Richter Controls the Universe   (2002) User Score Overview Andy Richter Controls the Universe was a sitcom which aired from 2002–2003 on the Fox network. The series was Andy Richter's first starring role after leaving NBC's Late Night with Conan O'Brien in 2000. It ran for two seasons, totaling nineteen episodes, and was canceled due in part to poor ratings. The show was a joint production of 20th Century Fox Television and Paramount Network Television. Paramount's successor CBS Television Distribution has distribution rights to the series in the United States while Fox retains global distribution rights. TV Guide included the series in their 2013 list of 60 shows that were \"Cancelled Too Soon\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andy Richter Paget Brewster Jessica Green Irene Molloy Jonathan Slavin James Patrick Stuart Full Cast & Crew Last Season Season 2 2002 | 13 Episodes Season 2 of Andy Richter Controls the Universe premiered on December  1, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  2 Recommendations   2013-09-26 The Michael J. Fox Show 5.6    2004-03-04 Pimp My Ride 5.2    2009-06-28 Hung 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords chicago aspiring writer workplace comedy Content Score 86 Almost there... Top Contributors 6 Banana 3 Zlogorek w 3 webmaster S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}