{"link": "https://www.themoviedb.org/tv/4330?language=en", "title": "Millennium", "resume": "A retired FBI serial-profiler joins the mysterious Millennium Group, a team of underground ex-law enforcement experts dedicated to fighting against the ever-growing forces of evil and darkness in the world.", "rate": 73, "genre": ["Action", "Adventure", "Drama"], "cast": ["Lance Henriksen", "Megan Gallagher", "Terry O'Quinn", "Brittany Tiplady"], "character": ["Frank Black", "Catherine Black", "Peter Watts", "Jordan Black"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4330   Expand Millennium   (1996) User Score  Play Trailer Overview A retired FBI serial-profiler joins the mysterious Millennium Group, a team of underground ex-law enforcement experts dedicated to fighting against the ever-growing forces of evil and darkness in the world. Featured Crew Chris Carter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lance Henriksen Frank Black Megan Gallagher Catherine Black Terry O'Quinn Peter Watts Brittany Tiplady Jordan Black Full Cast & Crew Last Season Season 3 1998 | 22 Episodes Season 3 of Millennium premiered on October  2, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  4 Recommendations   1996-09-21 Profiler 6.5    2005-09-16 Threshold 6.9    2004-07-11 The 4400 6.9    1993-09-21 NYPD Blue 6.5    1996-09-19 The Pretender 7.3    2005-09-19 Invasion 6.9    1989-09-19 Doogie Howser, M.D. 5.7    2005-01-03 Medium 6.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Action & Adventure Drama Keywords good vs evil fbi seattle cult surrealism millenium serial killer religion murder investigation 1990s criminal consultant fighting supernatural criminal profiler Content Score 100 Yes! Looking good! Top Contributors 17 Steve 13 Negan 8 Travis Bell d 8 denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}