{"link": "https://www.themoviedb.org/tv/34547?language=en", "title": "Coppers", "resume": "Coppers is a British fly-on-the-wall documentary television series broadcast on Channel 4, about policing in the United Kingdom. First broadcast on 1 November 2010, the series followed the day to day lives of police officers from four territorial police forces around the country, covering various activities: custody suite operations, road unit policing, 999 response, night time policing and riot control.\nA second series began on 9 January 2012 at 9pm and ran for 8 episodes.", "rate": 5, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34547   Expand Coppers   (2010) User Score Overview Coppers is a British fly-on-the-wall documentary television series broadcast on Channel 4, about policing in the United Kingdom. First broadcast on 1 November 2010, the series followed the day to day lives of police officers from four territorial police forces around the country, covering various activities: custody suite operations, road unit policing, 999 response, night time policing and riot control. A second series began on 9 January 2012 at 9pm and ran for 8 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2012 | 8 Episodes Season 2 of Coppers premiered on January  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Coppers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/coppers Genres Documentary Keywords documentary Content Score 56 We're so close, yet so far. Top Contributors 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}