{"link": "https://www.themoviedb.org/tv/37885?language=en", "title": "Kottan Ermittelt", "resume": "Kottan ermittelt is an Austrian television series that was aired by Austrian television ORF between 1976 and 1984. The satirical 19-episode series about a policeman from Vienna now sports cult status. Police major Adolf Kottan was played by three actors who each gave the character a distinct 'flavor'.", "rate": 100, "genre": ["Comedy", "Crime"], "cast": ["Chris Lohner", "Lukas Resetarits", "Walter Davy", "Curt A. Tichy", "Bibiana Zeller"], "character": ["TV-Sprecherin", "Kottan", "Paul Schremser", "Alfred Schrammel", "Frau Ilse Kottan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37885   Expand Kottan Ermittelt   (1976) User Score Overview Kottan ermittelt is an Austrian television series that was aired by Austrian television ORF between 1976 and 1984. The satirical 19-episode series about a policeman from Vienna now sports cult status. Police major Adolf Kottan was played by three actors who each gave the character a distinct 'flavor'. Featured Crew Helmut Zenker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Lohner TV-Sprecherin Lukas Resetarits Kottan Walter Davy Paul Schremser Curt A. Tichy Alfred Schrammel Bibiana Zeller Frau Ilse Kottan Full Cast & Crew Last Season Season 6 1985 | 3 Episodes Season 6 of Kottan Ermittelt premiered on January 20, 1985. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Kottan Ermittelt. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kottan Ermittelt. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  German Runtime  90m Homepage   http://www.kottan.info Genres Comedy Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 85 SuperMario S 44 Samara m 9 moviexela 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}