{"link": "https://www.themoviedb.org/tv/45273?language=en", "title": "ROOKIES", "resume": "Koichi Kawato is the new Japanese Literature teacher at the ill-famed Futakotamagawa high school, whose baseball club is composed of thugs and bullies who have been suspended for a year from all school competitions, for causing a brawl during an official match. The newly appointed teacher finds that the club members left are only interested in women, smoking and doing nothing until, under Kawato's guidance, they discover their dream of going to the Koshien high school baseball tournament. However, the road to Koshien is far from easy as many obstacles await them.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Ryuta Sato", "Hayato Ichihara", "Keisuke Koide", "Yu Shirota", "Akiyoshi Nakao"], "character": ["Koichi Kawato", "Keiichi Aniya", "Toru Mikoshiba", "Kei Shinjo", "Shuta Sekikawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45273   Expand ROOKIES   (2008) User Score Overview Koichi Kawato is the new Japanese Literature teacher at the ill-famed Futakotamagawa high school, whose baseball club is composed of thugs and bullies who have been suspended for a year from all school competitions, for causing a brawl during an official match. The newly appointed teacher finds that the club members left are only interested in women, smoking and doing nothing until, under Kawato's guidance, they discover their dream of going to the Koshien high school baseball tournament. However, the road to Koshien is far from easy as many obstacles await them. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryuta Sato Koichi Kawato Hayato Ichihara Keiichi Aniya Keisuke Koide Toru Mikoshiba Yu Shirota Kei Shinjo Akiyoshi Nakao Shuta Sekikawa Full Cast & Crew Last Season Season 1 2008 | 11 Episodes Season 1 of ROOKIES premiered on April 19, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on ROOKIES. You can help by rating TV shows you've seen. Facts Original Name  ルーキーズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  50m Homepage  - Genres Drama Comedy Keywords baseball baseball player Content Score 86 Almost there... Top Contributors 28 Wendy s 5 speedycars L 4 Liuby A 1 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}