{"link": "https://www.themoviedb.org/tv/37068?language=en", "title": "The 7 Deadly Sins", "resume": "Over the course of eight episodes, the famed Norwegian musician and performer Kristopher Schau sets out to commit all the Seven Deadly Sins: Pride, Greed, Lust, Envy, Gluttony, Wrath, and Sloth. By using himself as his chief researcher’s tool, Schau holds a mirror to modern society and asks: What does the concept of religious dogma and the Seven Deadly Sins mean in a largely secularized world?", "rate": 0, "genre": ["Comedy", "Documentary"], "cast": ["Kristopher Schau", "Øystein Karlsen", "Morten Ståle Nilsen"], "character": ["Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37068   Expand The 7 Deadly Sins   (2007) User Score Overview Over the course of eight episodes, the famed Norwegian musician and performer Kristopher Schau sets out to commit all the Seven Deadly Sins: Pride, Greed, Lust, Envy, Gluttony, Wrath, and Sloth. By using himself as his chief researcher’s tool, Schau holds a mirror to modern society and asks: What does the concept of religious dogma and the Seven Deadly Sins mean in a largely secularized world? Featured Crew Kristopher Schau Creator Øystein Karlsen Creator Morten Ståle Nilsen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kristopher Schau Himself Øystein Karlsen Himself Morten Ståle Nilsen Himself Full Cast & Crew Last Season Season 1 2007 | 8 Episodes Season 1 of The 7 Deadly Sins premiered on November  1, 2007. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The 7 Deadly Sins. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The 7 Deadly Sins. You can help by rating TV shows you've seen. Facts Original Name  De 7 dødssyndene Status  Ended Network Certification  - Type  Documentary Original Language  Norwegian Runtime  45m Homepage  - Genres Comedy Documentary Keywords seven deadly sins Content Score 64 We're so close, yet so far. Top Contributors 26 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}