{"link": "https://www.themoviedb.org/tv/34116?language=en", "title": "Genji Monogatari Sennenki", "resume": "Genji Monogatari Sennenki: Genji is a Japanese anime adaptation of The Tale of Genji. Originally, it was meant to be an anime adaptation of Waki Yamato's The Tale of Genji manga, but the director decided to make it a direct adaptation of the original tale. The anime is directed by Osamu Dezaki. The series premiered on Fuji TV on January 15, 2009.", "rate": 60, "genre": ["Animation", "Drama"], "cast": ["Toshiko Fujita", "Hiromi Tsuru", "Takahiro Sakurai", "Sakiko Tamagawa", "Aya Endo"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34116   Expand Genji Monogatari Sennenki   (2009) User Score Overview Genji Monogatari Sennenki: Genji is a Japanese anime adaptation of The Tale of Genji. Originally, it was meant to be an anime adaptation of Waki Yamato's The Tale of Genji manga, but the director decided to make it a direct adaptation of the original tale. The anime is directed by Osamu Dezaki. The series premiered on Fuji TV on January 15, 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshiko Fujita Hiromi Tsuru Takahiro Sakurai Sakiko Tamagawa Aya Endo Full Cast & Crew Last Season Season 1 2009 | 11 Episodes Season 1 of Genji Monogatari Sennenki premiered on January 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Genji Monogatari Sennenki. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://genji-anime.com/ Genres Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 shizuku e 1 elektrosmoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}