{"link": "https://www.themoviedb.org/tv/41481?language=en", "title": "Hidden", "resume": "Hidden is a 2011 British television drama starring Philip Glenister, Thekla Reuten, Anna Chancellor, Michael Winder, Andrew Scarborough and David Suchet which debuted on BBC One on 6 October 2011. The four part series was directed by Niall MacCormick, produced by Christopher Hall and written by Ronan Bennett.", "rate": 72, "genre": ["Crime", "Drama"], "cast": ["David Suchet", "Thekla Reuten", "Philip Glenister", "Anna Chancellor", "Christopher Webster"], "character": ["Young Harry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41481   Expand Hidden   (2011) User Score Overview Hidden is a 2011 British television drama starring Philip Glenister, Thekla Reuten, Anna Chancellor, Michael Winder, Andrew Scarborough and David Suchet which debuted on BBC One on 6 October 2011. The four part series was directed by Niall MacCormick, produced by Christopher Hall and written by Ronan Bennett. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Suchet Thekla Reuten Philip Glenister Anna Chancellor Christopher Webster Young Harry Full Cast & Crew Last Season Season 1 2011 | 4 Episodes Season 1 of Hidden premiered on October  6, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hidden. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  57m Homepage  - Genres Crime Drama Keywords conspiracy lawyer ex-con Content Score 86 Almost there... Top Contributors 8 kcdh 6 Steve CM 6 Cherche Moi w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}