{"link": "https://www.themoviedb.org/tv/19676?language=en", "title": "America at a Crossroads", "resume": "America at a Crossroads is a documentary miniseries concerning the issues facing the United States of America as related to the War on Terrorism. It aired originally on PBS television.\nThe miniseries initially consisted of 11 independently produced aired episodes, and premiered April 15–20, 2007 on PBS. Its executive producers are Jeff Bieber and Dalton Delan; series producer is Leo Eaton and it is presented by Robert MacNeil. Its music score is composed by Canadian musician Mark Korven.", "rate": 100, "genre": ["Documentary"], "cast": ["Robert MacNeil"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19676   Expand America at a Crossroads   (2007) User Score Overview America at a Crossroads is a documentary miniseries concerning the issues facing the United States of America as related to the War on Terrorism. It aired originally on PBS television. The miniseries initially consisted of 11 independently produced aired episodes, and premiered April 15–20, 2007 on PBS. Its executive producers are Jeff Bieber and Dalton Delan; series producer is Leo Eaton and it is presented by Robert MacNeil. Its music score is composed by Canadian musician Mark Korven. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert MacNeil Full Cast & Crew Last Season Season 1 2007 | 20 Episodes Season 1 of America at a Crossroads premiered on April 15, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on America at a Crossroads. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.pbs.org/weta/crossroads/?campaign=pbshomefeatures_1_americaatacrossroads_2007-04-19 Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}