{"link": "https://www.themoviedb.org/tv/6991?language=en", "title": "The Drinky Crow Show", "resume": "The Drinky Crow Show is an American animated television series created by Eric Kaplan and Tony Millionaire, based on the latter's comic strip Maakies. The pilot episode aired on Cartoon Network's late night programing block, Adult Swim on May 13, 2007. The series premiered on November 23, 2008 and ended January 25, 2009. The cancellation of the show was confirmed by a Maakies comic.\nDino Stamatopoulos provided the voice of the titular character and David Herman the voices of Uncle Gabby and Captain Maak. Millionaire's wife Becky Thyre co-starred as the voice of the Captain's Daughter and Phoebe Bird. Pamela Adlon provided the voice of Mademoiselle DeBoursay, as well as many of the other female characters. Creators Tony Millionaire and Eric Kaplan also provided additional voices. They Might Be Giants perform the show's theme song.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["David Herman", "Dino Stamatopoulos", "Pamela Adlon", "George Lowe", "Jemaine Clement"], "character": ["Alien"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6991   Expand The Drinky Crow Show   (2008) User Score Overview The Drinky Crow Show is an American animated television series created by Eric Kaplan and Tony Millionaire, based on the latter's comic strip Maakies. The pilot episode aired on Cartoon Network's late night programing block, Adult Swim on May 13, 2007. The series premiered on November 23, 2008 and ended January 25, 2009. The cancellation of the show was confirmed by a Maakies comic. Dino Stamatopoulos provided the voice of the titular character and David Herman the voices of Uncle Gabby and Captain Maak. Millionaire's wife Becky Thyre co-starred as the voice of the Captain's Daughter and Phoebe Bird. Pamela Adlon provided the voice of Mademoiselle DeBoursay, as well as many of the other female characters. Creators Tony Millionaire and Eric Kaplan also provided additional voices. They Might Be Giants perform the show's theme song. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Herman Dino Stamatopoulos Pamela Adlon George Lowe Jemaine Clement Alien Full Cast & Crew Last Season Season 1 2008 | 11 Episodes Season 1 of The Drinky Crow Show premiered on November 23, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Drinky Crow Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  15m, 11m Homepage   http://www.adultswim.com/shows/drinkycrow/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 5 movie28 A 2 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}