{"link": "https://www.themoviedb.org/tv/44883?language=en", "title": "Holy Knight", "resume": "Holy Knight is a Japanese manga by Maya Miyazaki. It was adapted into an OVA.", "rate": 55, "genre": ["Action", "Adventure", "Drama", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Wilhelm-Rafael Garth", "Victoria Frenz", "Maaya Uchida", "Hiro Shimono"], "character": ["Shinta Mizumura (German Voice)", "Lilith Kishimoto (German Voice)", "Lilith Kishimoto (Voice)", "Shinta Mizumura (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44883   Expand Holy Knight   (2012) User Score Overview Holy Knight is a Japanese manga by Maya Miyazaki. It was adapted into an OVA. Featured Crew Maya Miyazaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wilhelm-Rafael Garth Shinta Mizumura (German Voice) Victoria Frenz Lilith Kishimoto (German Voice) Maaya Uchida Lilith Kishimoto (Voice) Hiro Shimono Shinta Mizumura (Voice) Full Cast & Crew Last Season Season 1 2012 | 2 Episodes Season 1 of Holy Knight premiered on March 21, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Holy Knight. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Action & Adventure Drama Animation Sci-Fi & Fantasy Keywords fantasy vampire romance school ecchi anime Content Score 93 Almost there... Top Contributors S 25 Starfinder S 9 Suedschwede C 9 Chasil 7 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}