{"link": "https://www.themoviedb.org/tv/66008?language=en", "title": "You Me Her", "resume": "An unusual, real-world romance involving relatable people, with one catch - there are three of them! You Me Her infuses the sensibilities of a smart, grounded indie rom-com with a distinctive twist: one of the two parties just happens to be a suburban married couple.", "rate": 56, "genre": ["Comedy"], "cast": ["Greg Poehler", "Rachel Blanchard", "Priscilla Faia", "Jennifer Spence", "Ennis Esmer"], "character": ["Jack Trakarsky", "Emma Trakarsky", "Izzy Silva", "Carmen Amari", "Dave Amari"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66008   Expand You Me Her   (2016) User Score  Play Trailer Overview An unusual, real-world romance involving relatable people, with one catch - there are three of them! You Me Her infuses the sensibilities of a smart, grounded indie rom-com with a distinctive twist: one of the two parties just happens to be a suburban married couple. Featured Crew John Scott Shepherd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Greg Poehler Jack Trakarsky Rachel Blanchard Emma Trakarsky Priscilla Faia Izzy Silva Jennifer Spence Carmen Amari Ennis Esmer Dave Amari Full Cast & Crew Current Season Season 3 2018 | 10 Episodes Season 3 of You Me Her premiered on March 20, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  2 Posters  5 Recommendations   2015-03-25 Big Time in Hollywood, Fl 5.7    2016-05-20 Love, Nina 5.2    2013-09-23 Trophy Wife 5.7    2014-03-31 Friends with Better Lives 5.4    2012-05-24 Men at Work 6.6    2016-05-09 Upstart Crow 7.4    2015-01-11 Togetherness 6.0    2014-05-29 Undateable 6.2  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://youmeher.directv.com/ Genres Comedy Keywords sex bisexual threesome polyamory Content Score 100 Yes! Looking good! Top Contributors 26 joeynotjoe Y 11 YJ 10 Matheus F. 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}