{"link": "https://www.themoviedb.org/tv/2787?language=en", "title": "CNN Presents", "resume": "CNN Presents is an American documentary program on CNN weekends. The program used to be replaced with CNN Special Investigations Unit, which features the same documentary format, but differs from it in a number of ways and is shorter in length.\nThe program was originally a regular weekly series that looks in-depth in the important news stories of the times. More recently, it became a \"special event\" documentary that airs every time a larger, more long-term special report went into making. Notably, the program has been a winner of a number of different awards, including the International Documentary Association Best Documentary Series award.\nPrevious to his departure from CNN, Presents was hosted and narrated by Aaron Brown. While CNN Presents was broadcast on the network, a specialized CNN Presents logo was shown in the corner without the news ticker on the screen.\nCNN Presents has been revived since its presentation of God's Warriors by Christiane Amanpour in August 2007, and later with Planet in Peril, Black in America, and Latino in America, all of which have received follow-up documentaries later on.\nIn July 2011, the format of CNN Presents changed to a series of three investigative reports aired together in a one hour documentary, instead of a documentary about a single topic.", "rate": 80, "genre": ["Documentary"], "cast": ["Anderson Cooper"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2787   Expand CNN Presents User Score Overview CNN Presents is an American documentary program on CNN weekends. The program used to be replaced with CNN Special Investigations Unit, which features the same documentary format, but differs from it in a number of ways and is shorter in length. The program was originally a regular weekly series that looks in-depth in the important news stories of the times. More recently, it became a \"special event\" documentary that airs every time a larger, more long-term special report went into making. Notably, the program has been a winner of a number of different awards, including the International Documentary Association Best Documentary Series award. Previous to his departure from CNN, Presents was hosted and narrated by Aaron Brown. While CNN Presents was broadcast on the network, a specialized CNN Presents logo was shown in the corner without the news ticker on the screen. CNN Presents has been revived since its presentation of God's Warriors by Christiane Amanpour in August 2007, and later with Planet in Peril, Black in America, and Latino in America, all of which have received follow-up documentaries later on. In July 2011, the format of CNN Presents changed to a series of three investigative reports aired together in a one hour documentary, instead of a documentary about a single topic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anderson Cooper Full Cast & Crew Last Season Season 2011 2011 | 16 Episodes Season 2011 of CNN Presents premiered on January 30, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}