{"link": "https://www.themoviedb.org/tv/34717?language=en", "title": "ながされて藍蘭島", "resume": "Nagasarete Airantou is a Japanese manga series created by Japanese author Takeshi Fujishiro. It was first serialized in the manga magazine Monthly Shōnen Gangan in January 2002, published by Square Enix. Eighteen volumes have been released in Japan as of March 2011. A few years later, a couple of drama CDs were released based on the manga version. An anime adaptation by the animation studio Feel aired in Japan between April 4 and September 26, 2007, containing twenty-six episodes.", "rate": 90, "genre": ["Animation", "Comedy"], "cast": ["Ryoko Shiraishi", "Shizuka Hasegawa", "Saeko Chiba", "Yui Horie", "Hiro Shimono"], "character": ["Rin", "Yukino", "Ayane", "Suzu", "Ikuto Touhouin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34717   Expand ながされて藍蘭島   (2007) User Score Overview Nagasarete Airantou is a Japanese manga series created by Japanese author Takeshi Fujishiro. It was first serialized in the manga magazine Monthly Shōnen Gangan in January 2002, published by Square Enix. Eighteen volumes have been released in Japan as of March 2011. A few years later, a couple of drama CDs were released based on the manga version. An anime adaptation by the animation studio Feel aired in Japan between April 4 and September 26, 2007, containing twenty-six episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryoko Shiraishi Rin Shizuka Hasegawa Yukino Saeko Chiba Ayane Yui Horie Suzu Hiro Shimono Ikuto Touhouin Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of ながされて藍蘭島 premiered on April  4, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on ながされて藍蘭島. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.starchild.co.jp/special/airantou/ Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 6 maruino m 3 magoozin 3 seboseboss B 2 Burnd33  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}