{"link": "https://www.themoviedb.org/tv/15590?language=en", "title": "Too Rich: The Secret Life of Doris Duke", "resume": "Too Rich: The Secret Life of Doris Duke is a four-part miniseries that was first broadcast on CBS in 1999 starring Lauren Bacall and Richard Chamberlain. It was based primarily on the book The Richest Girl In The World: by Stephanie Mansfield as well as Bob Colacello's two in-depth articles about Ms Duke in Vanity Fair. Colacello was the magazine's authority on Doris Duke.\nThe title of the series was derived from the book Too Rich: The Family Secrets of Doris Duke by Pony Duke and Jason Thomas. Manfield's book was the first to be obtained by CBS, which optioned it for a planned miniseries in early 1995. The Duke-Thomas book, which was \"being peddled as a miniseries\" by the authors months before publication, was originally optioned earlier that year by the producer Doris Keating, who planned a miniseries of her own.\nToo Rich: The Secret Life of Doris Duke presents a dramatized account of the life of the heiress, philanthropist, and once richest woman in the world, Doris Duke. It has since been re-broadcast on The Hallmark Channel, and on Lifetime combined together and presented as a 192 minute movie. The film stars Hayden Panettiere as young Doris Duke, Lindsay Frost as 20 to 50 year old Doris Duke, and Lauren Bacall as an elderly Doris Duke. Bacall, who had met Doris Duke a few times, was pleased to have been able to appear in a TV miniseries, devoting a few paragraphs to the experience in her autobiography.", "rate": 20, "genre": ["Drama"], "cast": ["Richard Chamberlain", "Mare Winningham", "Kathleen Quinlan", "Michael Nouri", "Joe Don Baker"], "character": ["Bernard Lafferty", "Chandi Heffner", "Nanaline Duke", "Porfirio Rubirosa", "Buck Duke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15590   Expand Too Rich: The Secret Life of Doris Duke   (1999) User Score Overview Too Rich: The Secret Life of Doris Duke is a four-part miniseries that was first broadcast on CBS in 1999 starring Lauren Bacall and Richard Chamberlain. It was based primarily on the book The Richest Girl In The World: by Stephanie Mansfield as well as Bob Colacello's two in-depth articles about Ms Duke in Vanity Fair. Colacello was the magazine's authority on Doris Duke. The title of the series was derived from the book Too Rich: The Family Secrets of Doris Duke by Pony Duke and Jason Thomas. Manfield's book was the first to be obtained by CBS, which optioned it for a planned miniseries in early 1995. The Duke-Thomas book, which was \"being peddled as a miniseries\" by the authors months before publication, was originally optioned earlier that year by the producer Doris Keating, who planned a miniseries of her own. Too Rich: The Secret Life of Doris Duke presents a dramatized account of the life of the heiress, philanthropist, and once richest woman in the world, Doris Duke. It has since been re-broadcast on The Hallmark Channel, and on Lifetime combined together and presented as a 192 minute movie. The film stars Hayden Panettiere as young Doris Duke, Lindsay Frost as 20 to 50 year old Doris Duke, and Lauren Bacall as an elderly Doris Duke. Bacall, who had met Doris Duke a few times, was pleased to have been able to appear in a TV miniseries, devoting a few paragraphs to the experience in her autobiography. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Chamberlain Bernard Lafferty Mare Winningham Chandi Heffner Kathleen Quinlan Nanaline Duke Michael Nouri Porfirio Rubirosa Joe Don Baker Buck Duke Full Cast & Crew Last Season Season 1 1999 | 4 Episodes Season 1 of Too Rich: The Secret Life of Doris Duke premiered on February 21, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Too Rich: The Secret Life of Doris Duke. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  48m Homepage  - Genres Drama Keywords wealthy miniseries doris duke lifetime Content Score 71 Just a little bit more... Top Contributors TB 40 TMDb Bot 15 Banana R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}