{"link": "https://www.themoviedb.org/tv/68619?language=en", "title": "Haas Das's News Box", "resume": "Children’s series in which rabbit Haas Das brings the daily news from the animal kingdom. He is assisted (or hampered) by Piet Muis, the rather neurotic mouse who brings in the late bulletins and reads the weather. Haas Das was known for his sense of style: every week he sported a new tie, and as the series became more popular, viewers would send him ties to wear. (His name translates to \"Hare Tie\"). The newsworthy characters from Diereland (\"animal land\") included Koning Leeu, king of Diereland; Skillie Skilpad, chairman of the sportsclub; Stinkie Muishond; the meddling, bellyaching Moeder Raaf; wrestling champ Die Gemaskerde Wonder; Grootoom Flapoor, the old elephant in charge of the crèche; and Dokter Karools Krap, the golf-loving, pill-peddling local doctor. Haas Das and Piet Muis were puppet characters, and the news stories were presented in animation.\nHaas Das se Nuuskas was the first series to be shown on the opening night of SABC TV on 5 January 1976. Soon it became one of South Africa’s most popular programmes, not just among its intended audience, but especially with adults, due to the humour and social and political satire. Indeed, newspaper cartoons often commented on the series' popularity and how even church and political leaders had become engrossed. Haas Das se Nuuskas was created by Louise Smit, who was behind many of South Africa's most beloved children's series such as Wielie Walie, Pieriewierepark, Mina Moo en Kie, Pumpkin Patch and Kideo.", "rate": 0, "genre": ["Kids"], "cast": ["Monica Breed", "Riaan Cruywagen"], "character": ["Piet Muis", "Haas Das"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68619   Expand Haas Das's News Box   (1976) User Score  Play Trailer Overview Children’s series in which rabbit Haas Das brings the daily news from the animal kingdom. He is assisted (or hampered) by Piet Muis, the rather neurotic mouse who brings in the late bulletins and reads the weather. Haas Das was known for his sense of style: every week he sported a new tie, and as the series became more popular, viewers would send him ties to wear. (His name translates to \"Hare Tie\"). The newsworthy characters from Diereland (\"animal land\") included Koning Leeu, king of Diereland; Skillie Skilpad, chairman of the sportsclub; Stinkie Muishond; the meddling, bellyaching Moeder Raaf; wrestling champ Die Gemaskerde Wonder; Grootoom Flapoor, the old elephant in charge of the crèche; and Dokter Karools Krap, the golf-loving, pill-peddling local doctor. Haas Das and Piet Muis were puppet characters, and the news stories were presented in animation. Haas Das se Nuuskas was the first series to be shown on the opening night of SABC TV on 5 January 1976. Soon it became one of South Africa’s most popular programmes, not just among its intended audience, but especially with adults, due to the humour and social and political satire. Indeed, newspaper cartoons often commented on the series' popularity and how even church and political leaders had become engrossed. Haas Das se Nuuskas was created by Louise Smit, who was behind many of South Africa's most beloved children's series such as Wielie Walie, Pieriewierepark, Mina Moo en Kie, Pumpkin Patch and Kideo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Monica Breed Piet Muis Riaan Cruywagen Haas Das Full Cast & Crew Last Season Season 1 1976 | 13 Episodes Season 1 of Haas Das's News Box premiered on January  1, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Haas Das's News Box. You can help by rating TV shows you've seen. Facts Original Name  Haas Das se Nuuskas Status  Returning Series Networks - Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Kids Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 32 gaffelj@gmail.com TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}