{"link": "https://www.themoviedb.org/tv/76757?language=en", "title": "Golden Kamuy", "resume": "In Hokkaido, the far northern lands of Japan, Sugimoto survived the Russo-Japanese war of the Meiji era. Nicknamed \"Sugimoto the Immortal\" during the war, he now seeks the riches promised by the gold rush in hopes of saving the widowed wife of his now deceased comrade from the war. During his hunt of gold, he finds hints of a hidden stash of gold by corrupt criminals. Partnering with an Ainu girl that saves his life from the harsh climates of the north, they venture into a survival adventure to race against the criminals that seek the hidden stash.", "rate": 70, "genre": [], "cast": ["Kobayashi Chikahiro", "Haruka Shiraishi", "Toshihiko Seki", "Jouji Nakata", "Takayuki Sugo"], "character": ["Saichi Sugimoto (Voice)", "Asirpa (Voice)", "Kazuo Henmi (Voice)", "Toshizou Hijikata (Voice)", "Nagakura Shinpachi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76757   Expand Golden Kamuy   (2018) User Score Overview In Hokkaido, the far northern lands of Japan, Sugimoto survived the Russo-Japanese war of the Meiji era. Nicknamed \"Sugimoto the Immortal\" during the war, he now seeks the riches promised by the gold rush in hopes of saving the widowed wife of his now deceased comrade from the war. During his hunt of gold, he finds hints of a hidden stash of gold by corrupt criminals. Partnering with an Ainu girl that saves his life from the harsh climates of the north, they venture into a survival adventure to race against the criminals that seek the hidden stash. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kobayashi Chikahiro Saichi Sugimoto (Voice) Haruka Shiraishi Asirpa (Voice) Toshihiko Seki Kazuo Henmi (Voice) Jouji Nakata Toshizou Hijikata (Voice) Takayuki Sugo Nagakura Shinpachi Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Golden Kamuy premiered on April  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Golden Kamuy. You can help by rating TV shows you've seen. Facts Original Name  ゴールデンカムイ Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://kamuy-anime.com Genres No genres have been added. Keywords based on manga historical seinen Content Score 79 Pump it up! We're close now. Top Contributors 28 neonime 18 sp1ti J 6 JeremyRogers d 5 dbplay  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}