{"link": "https://www.themoviedb.org/tv/6048?language=en", "title": "Miś Uszatek", "resume": "Miś Uszatek is a Polish character from the stop motion-animated TV series of the same name. He was created jointly by Polish writer Czesław Janczarski and cartoonist Zbigniew Rychlicki.\nMiś Uszatek's first appearance was in a Polish comic magazine for children, \"Miś\", on 6 March 1957. Later, he was the main character of several children's books, which were translated into many languages. However, it became very popular in 1975, when Łódź' Animated Forms Studio, Se-ma-for, created a series of cartoons for the Polish TV network, featuring actor Mieczysław Czechowicz, who voiced the characters. In all-time Polish ranks of animated programs, it usually comes second only to Bolek i Lolek.\nMiś Uszatek and his friends - Prosiaczek, Króliczki and Zajączek, as well as Kruczek the Puppy - were loved by pre-teen kids. At the same time, Uszatek, a teddy bear, played the role of a friend from kindergarten. He was also liked by parents, as he would always go to bed at appropriate hour, singing the goodnight song:\nAltogether, Se-ma-for created 104 episodes of the cartoon; the last one was made in 1987. In the 1960s, two theatrical movies about the friendly bear were made. Also, in the fall of 2007, the Se-ma-for studio announced that it was planning to make more episodes, but later these plans changed in favor of a possible full-length movie, to be created with help from the Japanese company Eden Entertainment. As of 2008, Mis Uszatek airs on Polish TV every Thursday.", "rate": 0, "genre": ["Family", "Animation"], "cast": ["Mieczysław Czechowicz"], "character": ["narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6048   Expand Miś Uszatek   (1975) User Score Overview Miś Uszatek is a Polish character from the stop motion-animated TV series of the same name. He was created jointly by Polish writer Czesław Janczarski and cartoonist Zbigniew Rychlicki. Miś Uszatek's first appearance was in a Polish comic magazine for children, \"Miś\", on 6 March 1957. Later, he was the main character of several children's books, which were translated into many languages. However, it became very popular in 1975, when Łódź' Animated Forms Studio, Se-ma-for, created a series of cartoons for the Polish TV network, featuring actor Mieczysław Czechowicz, who voiced the characters. In all-time Polish ranks of animated programs, it usually comes second only to Bolek i Lolek. Miś Uszatek and his friends - Prosiaczek, Króliczki and Zajączek, as well as Kruczek the Puppy - were loved by pre-teen kids. At the same time, Uszatek, a teddy bear, played the role of a friend from kindergarten. He was also liked by parents, as he would always go to bed at appropriate hour, singing the goodnight song: Altogether, Se-ma-for created 104 episodes of the cartoon; the last one was made in 1987. In the 1960s, two theatrical movies about the friendly bear were made. Also, in the fall of 2007, the Se-ma-for studio announced that it was planning to make more episodes, but later these plans changed in favor of a possible full-length movie, to be created with help from the Japanese company Eden Entertainment. As of 2008, Mis Uszatek airs on Polish TV every Thursday. Featured Crew Marian Kiełbaszczak Creator Lucjan Dembiński Creator Zbigniew Rychlicki Creator Janusz Galewicz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mieczysław Czechowicz narrator Full Cast & Crew Last Season Season 9 1987 | 5 Episodes Season 9 of Miś Uszatek premiered on January  1, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Miś Uszatek. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Polish Runtime  8m Homepage  - Genres Family Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors M 36 Marud M 2 Michal TB 2 TMDb Bot 1 gkaczmarczyk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}