{"link": "https://www.themoviedb.org/tv/2275?language=en", "title": "The Bionic Woman", "resume": "After fully recovering from her near fatal bout of bionic rejection, Jaime Sommers, the first female cyborg, is assigned to spy missions of her own.", "rate": 66, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Drama"], "cast": ["Lindsay Wagner", "Richard Anderson", "Martin E. Brooks"], "character": ["Jaime Sommers", "Oscar Goldman", "Dr. Rudy Wells"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2275   Expand The Bionic Woman   (1976) User Score Overview After fully recovering from her near fatal bout of bionic rejection, Jaime Sommers, the first female cyborg, is assigned to spy missions of her own. Featured Crew Martin Caidin Creator Kenneth Johnson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lindsay Wagner Jaime Sommers Richard Anderson Oscar Goldman Martin E. Brooks Dr. Rudy Wells Full Cast & Crew Last Season Season 3 1977 | 22 Episodes Season 3 of The Bionic Woman premiered on September 10, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  4 Recommendations   1974-01-18 The Six Million Dollar Man 6.6    1977-01-14 Fantasy Island 6.5    1979-09-20 Buck Rogers in the 25th Century 6.9    1981-11-24 Simon & Simon 6.6    1979-09-22 Hart to Hart 6.5    1977-09-15 CHiPs 6.1    1982-03-13 T. J. Hooker 6.1    1979-09-22 The World's Greatest Super Friends 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  48m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Drama Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors d 8 denis o 4 olgenia C 4 Chris D 4 Decaliax  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}