{"link": "https://www.themoviedb.org/tv/39068?language=en", "title": "You Are My Destiny", "resume": "You Are My Destiny is a South Korean high rated television drama broadcast on KBS1 from May 5, 2008 to January 9, 2009 for 178 episodes. It stars Im Yoona, a member of Girls' Generation, in her first leading role. Her performance was praised by critics and netizens which lead to her winning numerous important recognitions in acting. This drama peaked the rating of 41% in its final episode.", "rate": 0, "genre": ["Drama", "Family", "Romance"], "cast": ["Im Yoona", "Park Jae-jung", "Gong Hyun-joo", "Lee Pil-mo", "Lee Ji-hoon"], "character": ["Jang Sae-byuk", "Kang Ho-sae", "Kim Su-bin", "Kim Tae-young", "Kim Tae-poong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39068   Expand You Are My Destiny   (2008) User Score Overview You Are My Destiny is a South Korean high rated television drama broadcast on KBS1 from May 5, 2008 to January 9, 2009 for 178 episodes. It stars Im Yoona, a member of Girls' Generation, in her first leading role. Her performance was praised by critics and netizens which lead to her winning numerous important recognitions in acting. This drama peaked the rating of 41% in its final episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Im Yoona Jang Sae-byuk Park Jae-jung Kang Ho-sae Gong Hyun-joo Kim Su-bin Lee Pil-mo Kim Tae-young Lee Ji-hoon Kim Tae-poong Full Cast & Crew Last Season Season 1 2008 | 2 Episodes Season 1 of You Are My Destiny premiered on May  5, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on You Are My Destiny. You can help by rating TV shows you've seen. Facts Original Name  너는 내 운명 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://www.kbs.co.kr/drama/unmyung/ Genres Drama Family Romance Keywords korea Content Score 71 Just a little bit more... Top Contributors t 29 tmdb38202327 g 7 g6man d 4 daphie 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}