{"link": "https://www.themoviedb.org/tv/34045?language=en", "title": "Sister Wives", "resume": "Husband Kody Brown, along with his four wives (only one of which is legally married to Kody) and their combined 18 children, attempts to navigate life as a \"normal\" family in a society that shuns their lifestyle.", "rate": 51, "genre": ["Reality", "Drama"], "cast": ["Kody Brown", "Meri Brown", "Janelle Brown", "Christine Brown", "Robyn Brown"], "character": ["Himself", "Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34045   Expand Sister Wives   (2010) User Score  Play Trailer Overview Husband Kody Brown, along with his four wives (only one of which is legally married to Kody) and their combined 18 children, attempts to navigate life as a \"normal\" family in a society that shuns their lifestyle. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  69 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kody Brown Himself Meri Brown Herself Janelle Brown Herself Christine Brown Herself Robyn Brown Herself Full Cast & Crew Current Season Original Air Date Original Air Date Current Order (Digital) Season 9 2018 | 22 Episodes View All Seasons Social Reviews  0 Discussions  69 Subject Status Replies Last Reply Aspyn & Mitch got married Open 2 by  cinles Mykelti is huge Open 0 by cinles\n      \n     Mariah's graduate school plans Open 0 by cinles\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2011-01-06 Nightmare Next Door 4.0    2008-08-07 Wicked Attraction 5.5    2005-02-08 Deadly Women 6.7    1999-01-01 Cold Case Files 5.9    1978-06-02 20/20 7.0    1992-03-31 Dateline NBC 4.3    2012-03-21 Duck Dynasty 4.1  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m, 60m, 42m Homepage   https://tlc.com/tv-shows/sister-wives/ Genres Reality Drama Keywords polygamy family Content Score 93 Almost there... Top Contributors 68 Banana a 16 appleaddct 11 towngeek b 10 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}