{"link": "https://www.themoviedb.org/tv/14616?language=en", "title": "My Parents Are Aliens", "resume": "My Parents Are Aliens is a British children's television sitcom that was produced for eight series by Yorkshire Television and aired on ITV from 8 November 1999 to 18 December 2006.", "rate": 65, "genre": ["Family", "Comedy"], "cast": ["Tony Gardner", "Carla Mendonça"], "character": ["Brian Johnson", "Sophie Johnson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14616   Expand My Parents Are Aliens   (1999) User Score Overview My Parents Are Aliens is a British children's television sitcom that was produced for eight series by Yorkshire Television and aired on ITV from 8 November 1999 to 18 December 2006. Featured Crew Andy Watts Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tony Gardner Brian Johnson Carla Mendonça Sophie Johnson Full Cast & Crew Last Season Season 7 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Brian: Happy Birthday Tony Gardner! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    2009-11-28 Big Time Rush 4.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m, 30m Homepage  - Genres Family Comedy Keywords alien fish out of water foster child Content Score 64 We're so close, yet so far. Top Contributors 30 rudely_murray L 13 Leah 11 Banana 3 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}