{"link": "https://www.themoviedb.org/tv/14452?language=en", "title": "Goong S", "resume": "Goong S is a 2007 South Korean romantic comedy television series, starring Se7en, Huh E-jae, Park Shin-hye and Kang Doo. It is a spin-off of 2006 series Goong, and both were directed by Hwang In-roi of the production company Group Eight. Goong S aired on MBC from January 10 to March 15, 2007 on Wednesdays and Thursdays at 21:55 for 20 episodes.", "rate": 60, "genre": ["Drama", "Comedy"], "cast": ["Huh E-jae", "Se7en", "Kang Doo", "Myung Se-bin", "Park Shin-hye"], "character": ["Yang Sun Ae", "Lee Hu / Kang Hu", "Lee Jun", "La Reine", "Shin Sae Ryung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14452   Expand Goong S   (2007) User Score Overview Goong S is a 2007 South Korean romantic comedy television series, starring Se7en, Huh E-jae, Park Shin-hye and Kang Doo. It is a spin-off of 2006 series Goong, and both were directed by Hwang In-roi of the production company Group Eight. Goong S aired on MBC from January 10 to March 15, 2007 on Wednesdays and Thursdays at 21:55 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Huh E-jae Yang Sun Ae Se7en Lee Hu / Kang Hu Kang Doo Lee Jun Myung Se-bin La Reine Park Shin-hye Shin Sae Ryung Full Cast & Crew Last Season Season 1 2007 | 20 Episodes Season 1 of Goong S premiered on January 10, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Goong S. You can help by rating TV shows you've seen. Facts Original Name  궁 S Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/gungs/ Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 7 Nosirus t 4 tmdb983464 A 2 Aka75 M 1 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}