{"link": "https://www.themoviedb.org/tv/73097?language=en", "title": "Single Wife", "resume": "A woman prepares for her remarriage to the perfect man, a second generation chaebol, but in the midst of those proceedings, she realizes that her divorce from her ex was never legally finalized. She has to lead a double life, leading both men on until things are settled. However, her ex-husband-to be is involved in an accident and develops amnesia, completely forgetting that they're no longer a married couple.", "rate": 39, "genre": ["Comedy", "Drama"], "cast": ["Uhm Hyun-kyung", "Sung Hyuk", "Kwak Hee-Sung", "Yuna"], "character": ["Lee Ra Hee", "Lee Min-Hong", "Hwang Jae Min"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73097   Expand Single Wife   (2017) User Score Overview A woman prepares for her remarriage to the perfect man, a second generation chaebol, but in the midst of those proceedings, she realizes that her divorce from her ex was never legally finalized. She has to lead a double life, leading both men on until things are settled. However, her ex-husband-to be is involved in an accident and develops amnesia, completely forgetting that they're no longer a married couple. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Uhm Hyun-kyung Lee Ra Hee Sung Hyuk Lee Min-Hong Kwak Hee-Sung Hwang Jae Min Yuna Full Cast & Crew Last Season Season 1 2017 | 1 Episode Season 1 of Single Wife premiered on August 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Single Wife. You can help by rating TV shows you've seen. Facts Original Name  싱글 와이프 Status  Ended Networks Dramax UMAX Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://dramax.ihq.co.kr/singlewife/ Genres Comedy Drama Keywords romance Content Score 79 Pump it up! We're close now. Top Contributors a 24 afofrancis a 8 alexchoisb 6 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}