{"link": "https://www.themoviedb.org/tv/69809?language=en", "title": "A Life", "resume": "When Okita Kazuaki was starting out as a doctor, he was forced to resign from the hospital. He left his girlfriend Danjo Mifuyu behind and went to the US alone. 10 years go by and he comes back as a surgeon with outstanding skills to save his former teacher from illness. His teacher is none other than his ex-girlfriend’s father. In the time that Okita was away, Mifuyu had married his own good friend Masao, who is now the deputy director and the heir of the hospital. To make matters worse, this friend was the one who plotted to drive him out form the hospital 10 years ago. Okita has to face all sorts of ordeals to save his teacher. But he never gives up amid the swirl of love, desire, friendship, jealousy and pride. Okita may be awkward but deals with patients with all his heart. His way of life gets the people working at the hospital to start asking themselves what real healthcare is.", "rate": 63, "genre": ["Drama"], "cast": ["Takuya Kimura", "Yuko Takeuchi", "Kenichi Matsuyama", "Fumino Kimura", "Nanao"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69809   Expand A Life   (2017) User Score Overview When Okita Kazuaki was starting out as a doctor, he was forced to resign from the hospital. He left his girlfriend Danjo Mifuyu behind and went to the US alone. 10 years go by and he comes back as a surgeon with outstanding skills to save his former teacher from illness. His teacher is none other than his ex-girlfriend’s father. In the time that Okita was away, Mifuyu had married his own good friend Masao, who is now the deputy director and the heir of the hospital. To make matters worse, this friend was the one who plotted to drive him out form the hospital 10 years ago. Okita has to face all sorts of ordeals to save his teacher. But he never gives up amid the swirl of love, desire, friendship, jealousy and pride. Okita may be awkward but deals with patients with all his heart. His way of life gets the people working at the hospital to start asking themselves what real healthcare is. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Kimura Yuko Takeuchi Kenichi Matsuyama Fumino Kimura Nanao Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of A Life premiered on January 15, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Life. You can help by rating TV shows you've seen. Facts Original Name  A LIFE～愛しき人～ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.tbs.co.jp/ALIFE/ Genres Drama Keywords romance medical profession Content Score 86 Almost there... Top Contributors 20 thirstyhippo 13 MundoAsian 4 Banana 3 friend-series.com  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}