{"link": "https://www.themoviedb.org/tv/1794?language=en", "title": "Defenders of the Earth", "resume": "Defenders of the Earth is an American animated television series produced in 1986, featuring characters from three comic strips distributed by King Features Syndicate—Flash Gordon, The Phantom, and Mandrake the Magician—opposing Ming the Merciless in the year 2015. Supporting characters include their children Rick Gordon, Jedda Walker, Kshin, Mandrake's assistant Lothar, and Lothar's son L.J. The show lasted for 65 episodes; there was also a short-lived comic book series published by Star Comics, created by Gerry Conway, Ross Andru and John Romita, Sr.. The closing credits credit Rob Walsh and Tony Pastor for the main title music, and Stan Lee for the lyrics. The series was later shown in reruns on the Sci Fi Channel as part of Sci Fi Cartoon Quest.", "rate": 72, "genre": ["Animation", "Action", "Adventure"], "cast": ["Buster Jones", "Peter Mark Richman", "Loren Lester", "Peter Renaday", "Sarah Partridge"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1794   Expand Defenders of the Earth   (1986) User Score Overview Defenders of the Earth is an American animated television series produced in 1986, featuring characters from three comic strips distributed by King Features Syndicate—Flash Gordon, The Phantom, and Mandrake the Magician—opposing Ming the Merciless in the year 2015. Supporting characters include their children Rick Gordon, Jedda Walker, Kshin, Mandrake's assistant Lothar, and Lothar's son L.J. The show lasted for 65 episodes; there was also a short-lived comic book series published by Star Comics, created by Gerry Conway, Ross Andru and John Romita, Sr.. The closing credits credit Rob Walsh and Tony Pastor for the main title music, and Stan Lee for the lyrics. The series was later shown in reruns on the Sci Fi Channel as part of Sci Fi Cartoon Quest. Featured Crew Lee Falk Creator Alex Raymond Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Buster Jones Peter Mark Richman Loren Lester Peter Renaday Sarah Partridge Full Cast & Crew Last Season Season 1 1986 | 65 Episodes Season 1 of Defenders of the Earth premiered on September  8, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1980-10-04 Thundarr the Barbarian 6.3    1986-09-08 SilverHawks 7.1    1986-09-15 Rambo 5.7    1985-09-09 She-Ra: Princess of Power 6.2  Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hearstent.com/defendersofearth.html Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 5 zurman1 D 2 Daniel 2 Maikkoum H 1 HeadSwitch  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}