{"link": "https://www.themoviedb.org/tv/1720?language=en", "title": "Foster's Home for Imaginary Friends", "resume": "Foster's Home for Imaginary Friends is an animated television series that aired from August 2004 to May 2009 for a total of 79 episodes in six seasons. The premise is based on a simple question: In a world... where imaginary friends are living, tangible beings, what happens to those friends when the kids grow up? Are they abandoned, or do they live on?\nAccording to Craig McCracken, they come to Foster's, of course! A home for imaginary friends whose kids have outgrown them, Foster's is a place where friends can live together until they are adopted by a child who needs them. The show follows Mac, a shy and creative 8 year old boy, whose imaginary friend Bloo is thrown out of his home by his mother and forced to come live at Foster's. Mac doesn't want Bloo to be adopted by another kid, so it's agreed that Bloo will not be put up for adoption, provided that Mac comes to visit him every day. Bloo's egotistical, mischievous nature is the complete opposite of Mac's, and together the two cause all manner of chaos throughout the house.", "rate": 70, "genre": ["Family", "Animation", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["Tom Kenny", "Keith Ferguson", "Candi Milo", "Tom Kane", "Sean Marquette"], "character": ["Eduardo (voice)", "Blooregard (voice)", "Coco (voice)", "Mr. Herriman (voice)", "Mac (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1720   Expand Foster's Home for Imaginary Friends   (2004) User Score Overview Foster's Home for Imaginary Friends is an animated television series that aired from August 2004 to May 2009 for a total of 79 episodes in six seasons. The premise is based on a simple question: In a world... where imaginary friends are living, tangible beings, what happens to those friends when the kids grow up? Are they abandoned, or do they live on? According to Craig McCracken, they come to Foster's, of course! A home for imaginary friends whose kids have outgrown them, Foster's is a place where friends can live together until they are adopted by a child who needs them. The show follows Mac, a shy and creative 8 year old boy, whose imaginary friend Bloo is thrown out of his home by his mother and forced to come live at Foster's. Mac doesn't want Bloo to be adopted by another kid, so it's agreed that Bloo will not be put up for adoption, provided that Mac comes to visit him every day. Bloo's egotistical, mischievous nature is the complete opposite of Mac's, and together the two cause all manner of chaos throughout the house. Featured Crew Craig McCracken Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Kenny Eduardo (voice) Keith Ferguson Blooregard (voice) Candi Milo Coco (voice) Tom Kane Mr. Herriman (voice) Sean Marquette Mac (voice) Full Cast & Crew Last Season Season 6 2008 | 12 Episodes Season 6 of Foster's Home for Imaginary Friends premiered on March 13, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2001-08-24 The Grim Adventures of Billy and Mandy 7.3    2002-12-06 Codename: Kids Next Door 6.5    2008-06-05 The Marvelous Misadventures of Flapjack 5.9    1998-11-18 The Powerpuff Girls 7.0    2005-12-26 My Gym Partner's a Monkey 5.0    1999-01-04 Ed, Edd n Eddy 7.0    2004-04-03 Danny Phantom 6.5    1997-09-16 Cow and Chicken 6.4  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://cartoonnetwork.com/tv_shows/fosters/index.html Genres Family Animation Sci-Fi & Fantasy Comedy Keywords fantasy imaginary friend foster home Content Score 93 Almost there... Top Contributors 24 Banana V 24 VartaniX m 23 movie28 9 CrewMdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}