{"link": "https://www.themoviedb.org/tv/2862?language=en", "title": "First Love of a Royal Prince", "resume": "First Love of a Royal Prince is a 2004 South Korean television series starring Sung Yu-ri, Cha Tae-hyun, Kim Nam-jin and Jin Jae-young. It aired on MBC from June 23 to August 26, 2004 on Wednesdays and Thursdays at 21:55 for 18 episodes.", "rate": 75, "genre": ["Drama"], "cast": ["Cha Tae-hyun", "Sung Yu-ri", "Lee Deok-hwa ", "Yoo Chae-yeong", "Lee Ki-young"], "character": ["Choi Gun-hee", "Kim Yu-bin", "President Choi Eun-chul", "Han Sarah", "Kang Ji-hoon/Kevin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2862   Expand First Love of a Royal Prince   (2004) User Score Overview First Love of a Royal Prince is a 2004 South Korean television series starring Sung Yu-ri, Cha Tae-hyun, Kim Nam-jin and Jin Jae-young. It aired on MBC from June 23 to August 26, 2004 on Wednesdays and Thursdays at 21:55 for 18 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cha Tae-hyun Choi Gun-hee Sung Yu-ri Kim Yu-bin Lee Deok-hwa  President Choi Eun-chul Yoo Chae-yeong Han Sarah Lee Ki-young Kang Ji-hoon/Kevin Full Cast & Crew Last Season Prince's first love season 1 2004 | 18 Episodes Season 1 of First Love of a Royal Prince premiered on June 23, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on First Love of a Royal Prince. You can help by rating TV shows you've seen. Facts Original Name  황태자의 첫사랑 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/p_firstlove/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 14 tmdb38202327 N 12 Nightowl.Kr 3 Elizabeth Jennings t 2 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}