{"link": "https://www.themoviedb.org/tv/76560?language=en", "title": "Mrs. Fazilet and Her Daughters", "resume": "The story of Fazilet, mother of Hazan and Ece, eager to make money using the modeling skills of her younger daughter, Ece. While Hazan pursues a career as a coach in sports, far from her mother's wishes and falls in love with a rich spoiled man.", "rate": 100, "genre": ["Drama"], "cast": ["Çağlar Ertuğrul", "Deniz Baysal", "Nazan Kesal", "Afra Saraçoğlu", "Mahir Günşiray"], "character": ["Yağız Egemen", "Hazan Çamkıran", "Fazilet Çamkıran", "Ece Çamkıran", "Hazım Egemen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76560   Expand Mrs. Fazilet and Her Daughters   (2017) User Score Overview The story of Fazilet, mother of Hazan and Ece, eager to make money using the modeling skills of her younger daughter, Ece. While Hazan pursues a career as a coach in sports, far from her mother's wishes and falls in love with a rich spoiled man. Featured Crew Günay Günaydın Creator Gökçen Usta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Çağlar Ertuğrul Yağız Egemen Deniz Baysal Hazan Çamkıran Nazan Kesal Fazilet Çamkıran Afra Saraçoğlu Ece Çamkıran Mahir Günşiray Hazım Egemen Full Cast & Crew Last Season Season 2 2017 | 25 Episodes Season 2 of Mrs. Fazilet and Her Daughters premiered on September 16, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Mrs. Fazilet and Her Daughters. You can help by rating TV shows you've seen. Facts Original Name  Fazilet Hanım ve Kızları Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  155m Homepage   https://www.startv.com.tr/dizi/fazilet-hanim-ve-kizlari Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 22 Elizabeth Jennings 19 moviefars 16 Gorke07 10 tago1987  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}