{"link": "https://www.themoviedb.org/tv/72449?language=en", "title": "Crash Course Computer Science", "resume": "In this series, we trace the origins of our modern computers, take a closer look at the ideas that gave us our current hardware and software, discuss how and why our smart devices just keep getting smarter, and even look towards the future!", "rate": 0, "genre": [], "cast": ["Carrie Anne Philbin"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72449   Expand Crash Course Computer Science   (2017) User Score Overview In this series, we trace the origins of our modern computers, take a closer look at the ideas that gave us our current hardware and software, discuss how and why our smart devices just keep getting smarter, and even look towards the future! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carrie Anne Philbin Host Full Cast & Crew Last Season Season 1 2017 | 2 Episodes Season 1 of Crash Course Computer Science premiered on February 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Crash Course Computer Science. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Documentary Original Language  English Runtime  10m Homepage   http://www.pbs.org/show/crash-course-computer-science/ Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 19 Gabriel W. Almeida 9 Elizabeth Jennings 1 hassaneliefifi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}