{"link": "https://www.themoviedb.org/tv/1707?language=en", "title": "Happy Hour", "resume": "Happy Hour is a sitcom that debuted on Fox in the United States and on CTV in Canada on September 7, 2006. The show starred John Sloan as Henry Beckman, a young man rebuilding his life after losing his girlfriend, his job, and his apartment. The series was produced by married duo Jackie and Jeff Filgo of That '70s Show.\nFox put the show on hiatus in September 2006, and officially canceled it the following May. Thirteen episodes of Happy Hour were made, of which four have aired and nine remain unaired.", "rate": 75, "genre": ["Comedy"], "cast": ["Lex Medlin", "Jamie Denbo", "Brooke D'Orsay", "Nat Faxon", "John Sloan"], "character": ["Heather Hanson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1707   Expand Happy Hour   (2006) User Score Overview Happy Hour is a sitcom that debuted on Fox in the United States and on CTV in Canada on September 7, 2006. The show starred John Sloan as Henry Beckman, a young man rebuilding his life after losing his girlfriend, his job, and his apartment. The series was produced by married duo Jackie and Jeff Filgo of That '70s Show. Fox put the show on hiatus in September 2006, and officially canceled it the following May. Thirteen episodes of Happy Hour were made, of which four have aired and nine remain unaired. Featured Crew Jackie Filgo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lex Medlin Jamie Denbo Brooke D'Orsay Heather Hanson Nat Faxon John Sloan Full Cast & Crew Last Season Season 1 2006 | 13 Episodes Season 1 of Happy Hour premiered on September  7, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Happy Hour. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords chicago roommate Content Score 93 Almost there... Top Contributors 4 Banana w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}