{"link": "https://www.themoviedb.org/tv/20794?language=en", "title": "Bayside Shakedown", "resume": "Aoshima is a rookie detective who has come to take a post at the Wangan Police Station in Odaiba. But what awaited this ex-salesman looking for stimulation was petty work and a rigid hierarchical control. Big cases are being handled at the main headquarters and the local police station is treated as if it were a nuisance. He is disillusioned by the fact that policemen are not superheroes and belong to a top-down organization. Living by his motto, “Cases don’t happen in the conference room, but at the scene,” Aoshima steadily influences his colleagues through his cheerfulness and strength.", "rate": 0, "genre": ["Drama", "Action", "Adventure"], "cast": ["Yuji Oda", "Toshirō Yanagiba", "Eri Fukatsu", "Miki Mizuno", "Chosuke Ikariya"], "character": ["Shunsaku Aoshima", "Shinji Muroi", "Sumire Onda", "Yukino Kashiwagi", "Heihachiro Waku"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20794   Expand Bayside Shakedown   (1997) User Score Overview Aoshima is a rookie detective who has come to take a post at the Wangan Police Station in Odaiba. But what awaited this ex-salesman looking for stimulation was petty work and a rigid hierarchical control. Big cases are being handled at the main headquarters and the local police station is treated as if it were a nuisance. He is disillusioned by the fact that policemen are not superheroes and belong to a top-down organization. Living by his motto, “Cases don’t happen in the conference room, but at the scene,” Aoshima steadily influences his colleagues through his cheerfulness and strength. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuji Oda Shunsaku Aoshima Toshirō Yanagiba Shinji Muroi Eri Fukatsu Sumire Onda Miki Mizuno Yukino Kashiwagi Chosuke Ikariya Heihachiro Waku Full Cast & Crew Last Season Season 1 1997 | 11 Episodes Season 1 of Bayside Shakedown premiered on January  7, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bayside Shakedown. You can help by rating TV shows you've seen. Facts Original Name  踊る大捜査線 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  55m Homepage  - Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors R 19 Rebecca n 3 naka 2 chaarusu A 1 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}