{"link": "https://www.themoviedb.org/tv/2271?language=en", "title": "Fred and Barney Meet The Thing", "resume": "Fred and Barney Meet The Thing is a 60-minute Saturday morning animated package show produced by Hanna-Barbera Productions from September 8, 1979 to December 1, 1979 on NBC. It contained the following segments:\n⁕The New Fred and Barney Show\n⁕The Thing\nDespite the title, the two segments remained separate and did not crossover with one another. Fred, Barney and the Thing were only featured together during the show's opening title sequence and in brief bumpers between segments. The unusual combination of a Marvel superhero and The Flintstones was possible because, at this time, Marvel Comics owned the rights to several Hanna-Barbera franchises and were, in fact, publishing comic books based upon them; The Flintstones was one of these.\nFor the 1979-80 season, the series was expanded to ninety-minutes with the addition of The New Shmoo episodes and retitled Fred and Barney Meet the Shmoo.", "rate": 10, "genre": ["Family", "Animation"], "cast": ["Mel Blanc", "Henry Corden", "Marilyn Schreffler", "Art Metrano"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2271   Expand Fred and Barney Meet The Thing   (1979) User Score Overview Fred and Barney Meet The Thing is a 60-minute Saturday morning animated package show produced by Hanna-Barbera Productions from September 8, 1979 to December 1, 1979 on NBC. It contained the following segments: ⁕The New Fred and Barney Show ⁕The Thing Despite the title, the two segments remained separate and did not crossover with one another. Fred, Barney and the Thing were only featured together during the show's opening title sequence and in brief bumpers between segments. The unusual combination of a Marvel superhero and The Flintstones was possible because, at this time, Marvel Comics owned the rights to several Hanna-Barbera franchises and were, in fact, publishing comic books based upon them; The Flintstones was one of these. For the 1979-80 season, the series was expanded to ninety-minutes with the addition of The New Shmoo episodes and retitled Fred and Barney Meet the Shmoo. Featured Crew Jack Kirby Creator Stan Lee Creator Joseph Barbera Creator William Hanna Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mel Blanc Henry Corden Marilyn Schreffler Art Metrano Full Cast & Crew Last Season Season 1 1979 | 13 Episodes Season 1 of Fred and Barney Meet The Thing premiered on September  8, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fred and Barney Meet The Thing. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Family Animation Keywords superhero based on comic prehistoric flintstones package show Content Score 79 Pump it up! We're close now. Top Contributors 11 Banana 3 Robson Guedes Vieira 3 minhus 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}