{"link": "https://www.themoviedb.org/tv/29289?language=en", "title": "Blind Faith", "resume": "Successful insurance salesman Rob Marshall, his bright and devoted wife Maria, and their three sons are the perfect American family. Then the nightmare begins. One night, Rob is attacked and Maria is shot dead. At first, Rob seems the a grieving widower. But, as incriminating secrets come out, he must prove his innocence before the judicial system-- and the horrified suspicions of his sons.", "rate": 40, "genre": ["Drama", "Crime"], "cast": ["Joanna Kerns", "David Barry Gray", "Jay Underwood", "Johnny Galecki", "Dennis Farina"], "character": ["Maria Marshall", "Roby Marshall", "Chris Marshall", "John Marshall", "Prosecutor Kelly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29289   Expand Blind Faith   (1990) User Score Overview Successful insurance salesman Rob Marshall, his bright and devoted wife Maria, and their three sons are the perfect American family. Then the nightmare begins. One night, Rob is attacked and Maria is shot dead. At first, Rob seems the a grieving widower. But, as incriminating secrets come out, he must prove his innocence before the judicial system-- and the horrified suspicions of his sons. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joanna Kerns Maria Marshall David Barry Gray Roby Marshall Jay Underwood Chris Marshall Johnny Galecki John Marshall Dennis Farina Prosecutor Kelly Full Cast & Crew Last Season Miniseries 1990 | 2 Episodes Season 1 of Blind Faith premiered on February 11, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Blind Faith. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  240m Homepage  - Genres Drama Crime Keywords murder thriller miniseries true crime Content Score 71 Just a little bit more... Top Contributors 15 Banana TB 12 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}