{"link": "https://www.themoviedb.org/tv/47217?language=en", "title": "Murder in the Heartland", "resume": "Murder in the Heartland tells the grotesque true story of Charlie Starkweather, 19, who killed 11 people in Nebraska in 1957-58, and his 14-year-old girlfriend,", "rate": 40, "genre": ["Crime", "Drama"], "cast": ["Kate Reid", "Brian Dennehy", "Randy Quaid", "Tim Roth", "Fairuza Balk"], "character": ["Pansy Street", "John McArthur", "Elmer Scheele", "Charles Starkweather", "Caril Ann Fugate"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47217   Expand Murder in the Heartland   (1993) User Score Overview Murder in the Heartland tells the grotesque true story of Charlie Starkweather, 19, who killed 11 people in Nebraska in 1957-58, and his 14-year-old girlfriend, Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Reid Pansy Street Brian Dennehy John McArthur Randy Quaid Elmer Scheele Tim Roth Charles Starkweather Fairuza Balk Caril Ann Fugate Full Cast & Crew Last Season Season 1 1993 | 2 Episodes Season 1 of Murder in the Heartland premiered on May  3, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Murder in the Heartland. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Miniseries Original Language  English Runtime  88m Homepage  - Genres Crime Drama Keywords murder miniseries murderer based on true events Content Score 71 Just a little bit more... Top Contributors 26 Marr 🇳🇱 15 Banana TB 6 TMDb Bot m 2 moviefan91  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}