{"link": "https://www.themoviedb.org/tv/13049?language=en", "title": "Lucas Tanner", "resume": "Lucas Tanner is an NBC television drama that aired during the 1974-75 season. The title character, played by David Hartman, was a former baseball player and sportswriter who becomes an English teacher at the fictional Harry S Truman High School in Webster Groves, Missouri, a suburb of St. Louis. Episodes often deal with the resistance of traditional teachers to Tanner's unorthodox teaching style.\nRegular co-stars included Rosemary Murphy, Kimberly Beck, and ten-year-old Robbie Rist. Unusually, the show was actually filmed in Webster Groves, rather than on a Hollywood backlot. That gave it a somewhat unusual \"look\" for a prime-time TV series.\nA 90-minute pilot film of the series aired on NBC the week of May 4, 1974; the pilot also starred Kathleen Quinlan and Joe Garagiola.\nThis series was Hartman's last television series as an actor—in November 1975, he began a long-running stint as co-host of ABC's Good Morning America.", "rate": 70, "genre": ["Drama"], "cast": ["Robbie Rist", "Rosemary Murphy", "David Hartman", "Kimberly Beck", "John Randolph"], "character": ["Glendon", "Margaret Blumenthal", "Lucas Tanner", "Terry Klitsner", "John Hamilton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13049   Expand Lucas Tanner   (1974) User Score Overview Lucas Tanner is an NBC television drama that aired during the 1974-75 season. The title character, played by David Hartman, was a former baseball player and sportswriter who becomes an English teacher at the fictional Harry S Truman High School in Webster Groves, Missouri, a suburb of St. Louis. Episodes often deal with the resistance of traditional teachers to Tanner's unorthodox teaching style. Regular co-stars included Rosemary Murphy, Kimberly Beck, and ten-year-old Robbie Rist. Unusually, the show was actually filmed in Webster Groves, rather than on a Hollywood backlot. That gave it a somewhat unusual \"look\" for a prime-time TV series. A 90-minute pilot film of the series aired on NBC the week of May 4, 1974; the pilot also starred Kathleen Quinlan and Joe Garagiola. This series was Hartman's last television series as an actor—in November 1975, he began a long-running stint as co-host of ABC's Good Morning America. Featured Crew Jerry McNeely Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robbie Rist Glendon Rosemary Murphy Margaret Blumenthal David Hartman Lucas Tanner Kimberly Beck Terry Klitsner John Randolph John Hamilton Full Cast & Crew Last Season Season 1 1974 | 21 Episodes Season 1 of Lucas Tanner premiered on September 11, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lucas Tanner. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords high school teacher high school teacher Content Score 93 Almost there... Top Contributors 21 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}