{"link": "https://www.themoviedb.org/tv/14697?language=en", "title": "Biker Mice from Mars", "resume": "Biker Mice from Mars is an animated series, a remake of the show with the same name which aired from 1993–1996. Unlike past remakes of old shows, this one continues the plot of the original series with new added characters. The 2006 version of the show has previews of the show on YouTube. Jim Ward won a 2009 voice-actor Daytime Emmy for his performance as Eyemore in the episode \"Manchurian Charley\" and as the Crusher in the episode \"Here Come The Judge\". The series was slated as a mid-season replacement in the 4Kids block on the CW network in fall 2009, but the series did not air. In the UK it was picked up for a second window by CSC Media Group, who scheduled it from April 2, 2010 on the Kix channel. The series features as a show on YouTube. An episode has been launched each Saturday on YouTube since November 2010.", "rate": 53, "genre": ["Animation", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14697   Expand Biker Mice from Mars User Score Overview Biker Mice from Mars is an animated series, a remake of the show with the same name which aired from 1993–1996. Unlike past remakes of old shows, this one continues the plot of the original series with new added characters. The 2006 version of the show has previews of the show on YouTube. Jim Ward won a 2009 voice-actor Daytime Emmy for his performance as Eyemore in the episode \"Manchurian Charley\" and as the Crusher in the episode \"Here Come The Judge\". The series was slated as a mid-season replacement in the 4Kids block on the CW network in fall 2009, but the series did not air. In the UK it was picked up for a second window by CSC Media Group, who scheduled it from April 2, 2010 on the Kix channel. The series features as a show on YouTube. An episode has been launched each Saturday on YouTube since November 2010. Featured Crew Rick Ungar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bikermice.tv/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors C 5 CroCop 1 minhus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}