{"link": "https://www.themoviedb.org/tv/3382?language=en", "title": "Charlie's Angels", "resume": "Charlie's Angels is an American crime drama television series that aired on ABC from September 1976 to June 1981, producing five seasons and 110 episodes. The series was created by Ivan Goff and Ben Roberts and was produced by Aaron Spelling.\nIt plotted the adventures of three females working in a private detective agency in Los Angeles, California, and initially starred Kate Jackson, Farrah Fawcett-Majors, and Jaclyn Smith in the leading roles. David Doyle co-starred as a sidekick to the three women and John Forsythe played the voice of their boss. Later additions to the cast included Cheryl Ladd, who entered the series in season two, Shelley Hack, in season four, and Tanya Roberts, in season five.\nDespite mixed reviews from critics and a reputation for merely being \"Jiggle TV,\" the show enjoyed an astonishing popularity with audiences, and was a top ten hit for its first few seasons. Because later cast changes were not well-received and the public's taste changed, the show concluded a five-year run in the spring of 1981. The series continues to have a cult and pop culture following through syndication, DVD releases, and subsequent film remakes.", "rate": 62, "genre": ["Action", "Adventure"], "cast": ["Jaclyn Smith", "David Doyle", "John Forsythe", "Cheryl Ladd", "Tanya Roberts"], "character": ["Kelly Garrett", "John Bosley", "Charles Townsend", "Kris Munroe", "Julie Rogers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3382   Expand Charlie's Angels   (1976) User Score  Play Trailer Overview Charlie's Angels is an American crime drama television series that aired on ABC from September 1976 to June 1981, producing five seasons and 110 episodes. The series was created by Ivan Goff and Ben Roberts and was produced by Aaron Spelling. It plotted the adventures of three females working in a private detective agency in Los Angeles, California, and initially starred Kate Jackson, Farrah Fawcett-Majors, and Jaclyn Smith in the leading roles. David Doyle co-starred as a sidekick to the three women and John Forsythe played the voice of their boss. Later additions to the cast included Cheryl Ladd, who entered the series in season two, Shelley Hack, in season four, and Tanya Roberts, in season five. Despite mixed reviews from critics and a reputation for merely being \"Jiggle TV,\" the show enjoyed an astonishing popularity with audiences, and was a top ten hit for its first few seasons. Because later cast changes were not well-received and the public's taste changed, the show concluded a five-year run in the spring of 1981. The series continues to have a cult and pop culture following through syndication, DVD releases, and subsequent film remakes. Featured Crew Ben Roberts Creator Ivan Goff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  44 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jaclyn Smith Kelly Garrett David Doyle John Bosley John Forsythe Charles Townsend Cheryl Ladd Kris Munroe Tanya Roberts Julie Rogers Full Cast & Crew Last Season Season 5 1980 | 17 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Kelly: Happy Birthday Jaclyn Smith! Open 0 by wonder2wonder\n      \n     w Kris: Happy Birthday Cheryl Ladd! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  44 Posters  11 Recommendations   1974-01-18 The Six Million Dollar Man 6.6    1973-10-24 Kojak 7.4    1975-09-10 Starsky & Hutch 6.5    1977-09-24 The Love Boat 5.8    1978-03-10 The Incredible Hulk 6.4    1972-09-16 The Streets of San Francisco 7.1    1978-11-03 Diff'rent Strokes 5.7    1980-12-11 Magnum, P.I. 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 21 Joe Carson d 18 denis 6 hpcodecraft P 5 PDubois5978  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}