{"link": "https://www.themoviedb.org/tv/46926?language=en", "title": "The Lady from Vendaval", "resume": "La Mujer Del Vendaval is a 2012 Mexican telenovela produced by Mapat L. de Zatarain for Televisa. It is a remake of the Venezuelan telenovela Un Esposo para Estela.\nAriadne Díaz and José Ron star as the main protagonists, while Chantal Andere, Marco Muñoz, Manuel Flaco Ibañez and Florencia del Saracho as the main antagonists.", "rate": 100, "genre": ["Soap", "Drama"], "cast": ["Ariadne Díaz", "José Ron", "Florencia de Saracho", "Thelma Madrigal", "María Marcela"], "character": ["Marcela Morales", "Alessandro Castelo", "María Laura Morales", "Nisa Casteló", "Silvana Berrocal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46926   Expand The Lady from Vendaval   (2012) User Score Overview La Mujer Del Vendaval is a 2012 Mexican telenovela produced by Mapat L. de Zatarain for Televisa. It is a remake of the Venezuelan telenovela Un Esposo para Estela. Ariadne Díaz and José Ron star as the main protagonists, while Chantal Andere, Marco Muñoz, Manuel Flaco Ibañez and Florencia del Saracho as the main antagonists. Featured Crew Camilo Hernandez Creator Gabriela Ortigosa Creator Carlos Daniel González Creator Antonio Abascal Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ariadne Díaz Marcela Morales José Ron Alessandro Castelo Florencia de Saracho María Laura Morales Thelma Madrigal Nisa Casteló María Marcela Silvana Berrocal Full Cast & Crew Last Season Season 1 2012 | 1 Episode Season 1 of The Lady from Vendaval premiered on November 12, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Lady from Vendaval. You can help by rating TV shows you've seen. Facts Original Name  La Mujer del Vendaval Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Soap Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 40 Amanda s 10 shiff7 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}