{"link": "https://www.themoviedb.org/tv/62137?language=en", "title": "The Royals", "resume": "Drama about a fictional British Royal family set in modern day London, who inhabit a world of opulence and regal tradition that caters to any and every desire, but one that also comes with a price tag of duty, destiny and intense public scrutiny.", "rate": 70, "genre": ["Drama"], "cast": ["Elizabeth Hurley", "William Moseley", "Alexandra Park", "Tom Austen", "Victoria Ekanoye"], "character": ["Queen Helena", "Prince Liam", "Princess Eleanor", "Jasper", "Rachel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62137   Expand The Royals   (2015) User Score  Play Trailer Overview Drama about a fictional British Royal family set in modern day London, who inhabit a world of opulence and regal tradition that caters to any and every desire, but one that also comes with a price tag of duty, destiny and intense public scrutiny. Featured Crew Mark Schwahn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  12 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elizabeth Hurley Queen Helena William Moseley Prince Liam Alexandra Park Princess Eleanor Tom Austen Jasper Victoria Ekanoye Rachel Full Cast & Crew Current Season Season 4 2018 | 10 Episodes Season 4 of The Royals premiered on March 11, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply c Robert is a bastard!!!!!! #kingLiam Open 1 by dchamerly\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  4 Recommendations   2012-08-12 Animal Practice 4.7    2013-06-03 Mistresses 4.6    2015-01-11 Togetherness 6.0    2014-02-17 Star-Crossed 5.6    2014-01-19 Looking 7.3    2015-06-01 The Whispers 5.7    2011-06-24 The Borgias 7.5    2015-03-01 Secrets and Lies 7.1  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.eonline.com/shows/the_royals Genres Drama Keywords monarchy royal family scandal anarchy crown prince palace intrigue family affairs Content Score 100 Yes! Looking good! Top Contributors 42 prm96 34 Elizabeth Jennings 24 Banana LC 20 Legit Corporation  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}