{"link": "https://www.themoviedb.org/tv/39185?language=en", "title": "Vera", "resume": "A sharp detective with a messy life, DCI Vera Stanhope patrols her “patch” of northeast England, pursuing the truth in cases of murder, kidnapping, and blackmail. Vera is obsessive about her work and faces the world with caustic wit, guile and courage.", "rate": 70, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Brenda Blethyn", "Jon Morrison"], "character": ["DCI Vera Stanhope", "Kenny Lockhart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39185   Expand Vera   (2011) User Score  Play Trailer Overview A sharp detective with a messy life, DCI Vera Stanhope patrols her “patch” of northeast England, pursuing the truth in cases of murder, kidnapping, and blackmail. Vera is obsessive about her work and faces the world with caustic wit, guile and courage. Featured Crew Ann Cleeves Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brenda Blethyn DCI Vera Stanhope Jon Morrison Kenny Lockhart Full Cast & Crew Current Season Season 8 2018 | 4 Episodes Season 8 of Vera premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  5 Recommendations   2007-04-08 Inspector George Gently 8.3    1987-01-06 Inspector Morse 7.7    2007-02-18 Inspector Lewis 7.6    2013-03-10 Shetland 7.5    2011-09-16 DCI Banks 7.9    2012-01-02 Endeavour 8.1    2015-02-15 Indian Summers 7.2    2011-06-05 Case Histories 8.2  Facts Status  Returning Series Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  90m Homepage   https://www.itv.com/itvplayer/vera Genres Crime Drama Mystery Keywords northern england england kidnapping murder criminal police detective forensic science female detective crime investigation crime solving Content Score 71 Just a little bit more... Top Contributors 46 genplant29 44 Elizabeth Jennings t 34 tmdb18595655 15 Giorgy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}