{"link": "https://www.themoviedb.org/tv/37087?language=en", "title": "A Traveler's Guide to the Planets", "resume": "A Traveler’s Guide To The Planets takes viewers on a breathtaking journey through the planets in our solar system. In each episode, see stunning images of each planet including highly detailed images captured by today’s ultra high-tech telescopes. Advanced animation takes you up close and personal with these distant worlds, as we plunge through space to get a better look at the neighbors. \nThen, travel with NASA experts to extreme environments on our own planet like Chile’s Atacama Desert or Hawaii’s volcanoes that are providing scientists with valuable insights into what a trip to one of our planetary neighbors might be like. And see the next generation of space probes as they are prepared for upcoming missions that may bring the dream of interplanetary travel even closer than ever.", "rate": 60, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37087   Expand A Traveler's Guide to the Planets   (2010) User Score Overview A Traveler’s Guide To The Planets takes viewers on a breathtaking journey through the planets in our solar system. In each episode, see stunning images of each planet including highly detailed images captured by today’s ultra high-tech telescopes. Advanced animation takes you up close and personal with these distant worlds, as we plunge through space to get a better look at the neighbors.  Then, travel with NASA experts to extreme environments on our own planet like Chile’s Atacama Desert or Hawaii’s volcanoes that are providing scientists with valuable insights into what a trip to one of our planetary neighbors might be like. And see the next generation of space probes as they are prepared for upcoming missions that may bring the dream of interplanetary travel even closer than ever.  Featured Crew Кристофер Торберн Creator Ричард Смит Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2010 | 6 Episodes Season 1 of A Traveler's Guide to the Planets premiered on February 14, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Traveler's Guide to the Planets. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords planetary configuration solar system Content Score 64 We're so close, yet so far. Top Contributors H 13 Hard 8 zlobniy2kx z 6 zurman1 a 4 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}