{"link": "https://www.themoviedb.org/tv/76709?language=en", "title": "Dear Heirs", "resume": "\"Dear Heirs\" tells the story of one big, disconnected family forced to love together under one roof in Beli Vit village in order to get their inheritance of 1.2 million euros. Children and grandchildren should live under the roof of the family patriarch for one year without leaving the village for more than 12 hours. Those events will change the characters, their desires and principles. Traditions and moderns trends meets business ideas, and the values of patriarchal family meets with the modern family.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Phillip Avramov", "Georgi Kadurin", "Orlin Pavlov", "Koyna Ruseva", "Lorina Kamburova"], "character": ["Ленин", "Косьо", "Борис Йотов", "Милица", "Ана"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76709   Expand Dear Heirs   (2018) User Score Overview \"Dear Heirs\" tells the story of one big, disconnected family forced to love together under one roof in Beli Vit village in order to get their inheritance of 1.2 million euros. Children and grandchildren should live under the roof of the family patriarch for one year without leaving the village for more than 12 hours. Those events will change the characters, their desires and principles. Traditions and moderns trends meets business ideas, and the values of patriarchal family meets with the modern family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phillip Avramov Ленин Georgi Kadurin Косьо Orlin Pavlov Борис Йотов Koyna Ruseva Милица Lorina Kamburova Ана Full Cast & Crew Current Season Season 1 2018 | 20 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dear Heirs. You can help by rating TV shows you've seen. Facts Original Name  Skapi Naslednici Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Bulgarian Runtime  45m Homepage  - Genres Drama Comedy Keywords heir Content Score 93 Almost there... Top Contributors C 47 CkuHeP d 13 deniw1 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}