{"link": "https://www.themoviedb.org/tv/60791?language=en", "title": "American Crime", "resume": "An anthology drama focusing on all aspects of the U.S. criminal justice system dealing with crimes committed in America.", "rate": 66, "genre": ["Drama", "Crime", "Mystery"], "cast": ["Timothy Hutton", "W. Earl Brown", "Richard Cabral", "Caitlin Gerard", "Benito Martinez"], "character": ["Russ Skokie", "Tom Carlin", "Hector Tontz", "Aubry Taylor", "Alonzo Gutiérrez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60791   Expand American Crime   (2015) User Score  Play Trailer Overview An anthology drama focusing on all aspects of the U.S. criminal justice system dealing with crimes committed in America. Featured Crew John Ridley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  12 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Timothy Hutton Russ Skokie W. Earl Brown Tom Carlin Richard Cabral Hector Tontz Caitlin Gerard Aubry Taylor Benito Martinez Alonzo Gutiérrez Full Cast & Crew Last Season Season 3 2017 | 8 Episodes Season 3 of American Crime premiered on March 12, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply How did you feel about the Season 3 finale and season overall? Open 6 by  genplant29 Season 3, Ep. 3 question, about the teenage girl and the phone Open 7 by  genplant29 Anyone watching? Open 16 by  genplant29 Go to Discussions Media Most Popular Videos  1 Backdrops  12 Posters  5 Recommendations   2014-08-06 Skin Wars 6.8    2015-01-10 My Sunshine 7.4    2015-09-12 Goldie & Bear 5.4    2015-09-29 The Grinder 6.6    2013-07-20 Cedar Cove 6.7    2015-10-27 Wicked City 5.4    2016-06-02 Hibana: Spark 7.8    2015-08-25 Public Morals 7.5  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://abc.go.com/shows/american-crime Genres Drama Crime Mystery Keywords trial racism crime murder trial Content Score 100 Yes! Looking good! Top Contributors 69 Elizabeth Jennings AK 27 Avshalom Kor 10 Banana S 9 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}