{"link": "https://www.themoviedb.org/tv/726?language=en", "title": "Lidsville", "resume": "Lidsville is Sid and Marty Krofft's third television show following H.R. Pufnstuf and The Bugaloos. As did its predecessors, the series combined two types of characters: conventional actors in makeup filmed alongside performers in full mascot costumes, whose voices were dubbed in post-production. Seventeen episodes aired on Saturday mornings for two seasons, 1971–1973. The opening was shot at Six Flags Over Texas.", "rate": 0, "genre": [], "cast": ["Butch Patrick", "Jerry Maren", "Billie Hayes", "Sharon Baird", "Charles Nelson Reilly"], "character": ["Horatio J. Hoodoo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 726   Expand Lidsville   (1971) User Score Overview Lidsville is Sid and Marty Krofft's third television show following H.R. Pufnstuf and The Bugaloos. As did its predecessors, the series combined two types of characters: conventional actors in makeup filmed alongside performers in full mascot costumes, whose voices were dubbed in post-production. Seventeen episodes aired on Saturday mornings for two seasons, 1971–1973. The opening was shot at Six Flags Over Texas. Featured Crew Marty Krofft Creator Sid Krofft Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Butch Patrick Jerry Maren Billie Hayes Sharon Baird Charles Nelson Reilly Horatio J. Hoodoo Full Cast & Crew Last Season season 1 — | 17 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lidsville. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}