{"link": "https://www.themoviedb.org/tv/5866?language=en", "title": "The Life and Adventures of Nicholas Nickleby", "resume": "Young Nicholas Nickleby sets out to make his fortune in order to prevent his mother and sister from depending upon his uncle, Ralph Nicklby. But he finds his first job as master at a Yorkshire school to be cruel, and runs away with one of the students. Meanwhile, Kate is subjected to the unwanted attentions of Sir Mulberry Hawk, aided by her uncle. Nicholas and his new friend, Smike, begin their adventures and eventually set out to rescue Kate, with the usual Dickensian twists, turns and asides.", "rate": 90, "genre": ["Drama"], "cast": ["Roger Rees", "Alun Armstrong", "John Woodvine", "David Threlfall", "Ian McNeice"], "character": ["Nicholas Nickleby"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5866   Expand The Life and Adventures of Nicholas Nickleby   (1982) User Score Overview Young Nicholas Nickleby sets out to make his fortune in order to prevent his mother and sister from depending upon his uncle, Ralph Nicklby. But he finds his first job as master at a Yorkshire school to be cruel, and runs away with one of the students. Meanwhile, Kate is subjected to the unwanted attentions of Sir Mulberry Hawk, aided by her uncle. Nicholas and his new friend, Smike, begin their adventures and eventually set out to rescue Kate, with the usual Dickensian twists, turns and asides. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roger Rees Nicholas Nickleby Alun Armstrong John Woodvine David Threlfall Ian McNeice Full Cast & Crew Last Season Season 1 1982 | 10 Episodes Season 1 of The Life and Adventures of Nicholas Nickleby premiered on November  7, 1982. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Life and Adventures of Nicholas Nickleby. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  55m Homepage  - Genres Drama Keywords england miniseries charles dickens Content Score 86 Almost there... Top Contributors TB 37 TMDb Bot 5 Banana R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}