{"link": "https://www.themoviedb.org/tv/15114?language=en", "title": "John Adams", "resume": "John Adams is a 2008 American television miniseries chronicling most of U.S. President John Adams' political life and his role in the founding of the United States. Paul Giamatti portrays John Adams. The miniseries was directed by Tom Hooper. Kirk Ellis wrote the screenplay based on the book John Adams by David McCullough. The biopic of John Adams and the story of the first fifty years of the United States was broadcast in seven parts by HBO between March 16 and April 20, 2008. John Adams received widespread critical acclaim, and many prestigious awards. The show won four Golden Globe awards and thirteen Emmy awards, which is more than any other miniseries in history.", "rate": 79, "genre": ["Drama"], "cast": ["Paul Giamatti", "Laura Linney", "Mamie Gummer", "David Morse", "Rufus Sewell"], "character": ["John Adams", "Abigail Adams", "Sally Adams", "George Washington", "Alexander Hamilton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15114   Expand John Adams   (2008) User Score  Play Trailer Overview John Adams is a 2008 American television miniseries chronicling most of U.S. President John Adams' political life and his role in the founding of the United States. Paul Giamatti portrays John Adams. The miniseries was directed by Tom Hooper. Kirk Ellis wrote the screenplay based on the book John Adams by David McCullough. The biopic of John Adams and the story of the first fifty years of the United States was broadcast in seven parts by HBO between March 16 and April 20, 2008. John Adams received widespread critical acclaim, and many prestigious awards. The show won four Golden Globe awards and thirteen Emmy awards, which is more than any other miniseries in history. Featured Crew Kirk Ellis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Giamatti John Adams Laura Linney Abigail Adams Mamie Gummer Sally Adams David Morse George Washington Rufus Sewell Alexander Hamilton Full Cast & Crew Last Season Season 1 2008 | 7 Episodes Season 1 of John Adams premiered on March 16, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply N What Happened to the Custom Official from episode 1 Open 0 by Nephlim14\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  9 Recommendations   2008-07-13 Generation Kill 8.1    2004-03-21 Deadwood 8.1    2005-08-28 Rome 8.2    1990-09-23 The Civil War 8.9    1979-09-10 Tinker Tailor Soldier Spy 7.7    1998-09-22 Sports Night 7.1    2006-03-28 Thief 7.8    1988-11-13 War and Remembrance 7.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  60m, 70m Homepage   http://www.hbo.com/films/johnadams/ Genres Drama Keywords usa independence president miniseries american history Content Score 100 Yes! Looking good! Top Contributors 19 thedarer TB 14 TMDb Bot s 7 speedycars 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}