{"link": "https://www.themoviedb.org/tv/12212?language=en", "title": "Special Branch", "resume": "Special Branch is a British television series made by Thames Television for ITV and shown between 1969 and 1974. A police drama series, the action was centred on members of the Special Branch anti-espionage and anti-terrorist department of the London Metropolitan Police.\nThe first two series were shot mainly in a studio on videotape with filmed location inserts; a standard method of the time but one which suffered from jarring differences in picture quality between interior and exterior scenes. The location scenes of some episodes were shot on outside broadcast cameras, leading to smoother transitions between location and studio work for those episodes. Series 1 and 2 starred Derren Nesbitt as Det Insp Jordan, working to Det Supt Eden and subsequently Det Supt Inman. The episodes featuring Eden were recorded in black and white, while all subsequent episodes were recorded on colour videotape.\nThe show was revamped in 1973 after Thames Television's Euston Films subsidiary took over production using film which allowed for a less studio-based series. Euston Films had pioneered the technique of shooting action and adventure series entirely on location using 16mm film, for a more gritty and realistic look. These episodes starred George Sewell as Chief Inspector Alan Craven and Roger Rowland as Bill North. The show was slow to take off so the producers introduced Patrick Mower as Detective Chief Inspector Tom Haggerty, and by the 1974 series Bill North had been axed, having had a nervous breakdown, though he returned for one episode later in the run.", "rate": 20, "genre": ["Drama"], "cast": ["Paul Eddington", "Patrick Mower", "George Sewell", "Derren Nesbitt", "Frederick Jaeger"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12212   Expand Special Branch   (1969) User Score Overview Special Branch is a British television series made by Thames Television for ITV and shown between 1969 and 1974. A police drama series, the action was centred on members of the Special Branch anti-espionage and anti-terrorist department of the London Metropolitan Police. The first two series were shot mainly in a studio on videotape with filmed location inserts; a standard method of the time but one which suffered from jarring differences in picture quality between interior and exterior scenes. The location scenes of some episodes were shot on outside broadcast cameras, leading to smoother transitions between location and studio work for those episodes. Series 1 and 2 starred Derren Nesbitt as Det Insp Jordan, working to Det Supt Eden and subsequently Det Supt Inman. The episodes featuring Eden were recorded in black and white, while all subsequent episodes were recorded on colour videotape. The show was revamped in 1973 after Thames Television's Euston Films subsidiary took over production using film which allowed for a less studio-based series. Euston Films had pioneered the technique of shooting action and adventure series entirely on location using 16mm film, for a more gritty and realistic look. These episodes starred George Sewell as Chief Inspector Alan Craven and Roger Rowland as Bill North. The show was slow to take off so the producers introduced Patrick Mower as Detective Chief Inspector Tom Haggerty, and by the 1974 series Bill North had been axed, having had a nervous breakdown, though he returned for one episode later in the run. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Eddington Patrick Mower George Sewell Derren Nesbitt Frederick Jaeger Full Cast & Crew Last Season Season 4 1974 | 13 Episodes Season 4 of Special Branch premiered on February 14, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Special Branch. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors O 6 Outofbounds7 2 Daemon TB 2 TMDb Bot F 1 Felixwerewolf  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}