{"link": "https://www.themoviedb.org/tv/3020?language=en", "title": "The Little Flying Bears", "resume": "The series focuses on a rare species of little bears with wings that live in the magical forest in a utopian cooperative community. The little flying bears together with their friends, took on themselves the task to defend their forest from pollution. However, their efforts, very often, are disturbed by two weasels, Skulk and Sammy, which strive to pollute the forest. Every so often the weasels receive help from Slink the snake. The three always strive to find new ways to disturb the harmony of the forest but their plans are destroyed always by the bears. The bears are always attentive to the advices of the old bear, Plato (who is too old to fly) and his friend Ozzy the owl.\nThis cartoon helps children realize the importance of protecting the environment. The series shows the harmful effects of pollution and fires as well as the important role of the ecosystem.", "rate": 70, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3020   Expand The Little Flying Bears User Score Overview The series focuses on a rare species of little bears with wings that live in the magical forest in a utopian cooperative community. The little flying bears together with their friends, took on themselves the task to defend their forest from pollution. However, their efforts, very often, are disturbed by two weasels, Skulk and Sammy, which strive to pollute the forest. Every so often the weasels receive help from Slink the snake. The three always strive to find new ways to disturb the harmony of the forest but their plans are destroyed always by the bears. The bears are always attentive to the advices of the old bear, Plato (who is too old to fly) and his friend Ozzy the owl. This cartoon helps children realize the importance of protecting the environment. The series shows the harmful effects of pollution and fires as well as the important role of the ecosystem. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords anthropomorphism cartoon bear Content Score 36 There's no 'I' in team... Top Contributors 16 Elizabeth Jennings M 5 Mario_Gaborović 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}