{"link": "https://www.themoviedb.org/tv/62598?language=en", "title": "Wicked Tuna", "resume": "Fishing is a hard life, and harder with bluefin stocks depleted. In Gloucester, Massachusetts, there's a special breed of fishermen. For generations they've used rod and reel to catch the elusive bluefin tuna. They depend on these fish for their livelihood, and the competition is brutal. Over the next 10 weeks, the most skilled fishermen will set out in the frigid waters of the North Atlantic in hopes of catching the valuable bluefin tuna. When one bluefin can bring in as much as $20,000—they'll do whatever it takes to hook up.", "rate": 73, "genre": ["Action", "Adventure", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62598   Expand Wicked Tuna   (2012) User Score  Play Trailer Overview Fishing is a hard life, and harder with bluefin stocks depleted. In Gloucester, Massachusetts, there's a special breed of fishermen. For generations they've used rod and reel to catch the elusive bluefin tuna. They depend on these fish for their livelihood, and the competition is brutal. Over the next 10 weeks, the most skilled fishermen will set out in the frigid waters of the North Atlantic in hopes of catching the valuable bluefin tuna. When one bluefin can bring in as much as $20,000—they'll do whatever it takes to hook up. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 7 2018 | 16 Episodes Season 7 of Wicked Tuna premiered on March 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Wicked Tuna. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://channel.nationalgeographic.com/wicked-tuna/ Genres Action & Adventure Reality Keywords north carolina rivalry making money grand banks Content Score 64 We're so close, yet so far. Top Contributors 25 Elizabeth Jennings 11 szab b 8 basher PE 7 Patrick E. Abe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}