{"link": "https://www.themoviedb.org/tv/31690?language=en", "title": "Shorties Watchin' Shorties", "resume": "Shorties Watchin' Shorties was a television show broadcast on Comedy Central that is now on DVD. The show is made up of various short animated clips with audio from comedians' stand up routines. It also features two \"shorties,\" a pair of babies voiced by Nick DiPaolo and Patrice O'Neal who watch and comment upon the routines on TV. For many of the episodes, the babies only stayed in the house, but in later episodes, they were shown walking around the city.\nThe show featured comedians such as Dane Cook, Bill Burr, Brian Regan, Brian Posehn, Chris Hardwick, Mitch Hedberg, Mike Birbiglia, Jim Gaffigan and Lewis Black.\nThe animation was scripted and produced at World Famous Pictures and Augenblick Studios. The show was not renewed but full episodes are available on DVD. Clips from the show are posted on the Comedy Central website as well as on Hulu and Netflix. 14 episodes were produced and 13 aired.", "rate": 100, "genre": ["Animation", "Comedy"], "cast": ["Nick Di Paolo", "Patrice O'Neal", "Brian Regan"], "character": ["Baby Patrice"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31690   Expand Shorties Watchin' Shorties   (2004) User Score Overview Shorties Watchin' Shorties was a television show broadcast on Comedy Central that is now on DVD. The show is made up of various short animated clips with audio from comedians' stand up routines. It also features two \"shorties,\" a pair of babies voiced by Nick DiPaolo and Patrice O'Neal who watch and comment upon the routines on TV. For many of the episodes, the babies only stayed in the house, but in later episodes, they were shown walking around the city. The show featured comedians such as Dane Cook, Bill Burr, Brian Regan, Brian Posehn, Chris Hardwick, Mitch Hedberg, Mike Birbiglia, Jim Gaffigan and Lewis Black. The animation was scripted and produced at World Famous Pictures and Augenblick Studios. The show was not renewed but full episodes are available on DVD. Clips from the show are posted on the Comedy Central website as well as on Hulu and Netflix. 14 episodes were produced and 13 aired. Featured Crew Jim Serpico Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nick Di Paolo Patrice O'Neal Baby Patrice Brian Regan Full Cast & Crew Last Season Season 1 2004 | 13 Episodes Season 1 of Shorties Watchin' Shorties premiered on April 28, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Shorties Watchin' Shorties. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}