{"link": "https://www.themoviedb.org/tv/46616?language=en", "title": "The Returned", "resume": "In the shadow of an enormous hydraulic dam, the lives of the residents of a small French town are changed to their core when hundreds of previously dead relatives all return home on the same day.", "rate": 73, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Anne Consigny", "Frédéric Pierrot", "Clotilde Hesme", "Céline Sallette", "Samir Guesmi"], "character": ["Claire", "Jérôme", "Adèle", "Julie", "Thomas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46616   Expand The Returned   (2012) User Score  Play Trailer Overview In the shadow of an enormous hydraulic dam, the lives of the residents of a small French town are changed to their core when hundreds of previously dead relatives all return home on the same day. Featured Crew Fabrice Gobert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  17 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne Consigny Claire Frédéric Pierrot Jérôme Clotilde Hesme Adèle Céline Sallette Julie Samir Guesmi Thomas Full Cast & Crew Last Season Season 2 2015 | 8 Episodes Season 2 of The Returned premiered on September 28, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  17 Posters  10 Recommendations   2015-03-09 The Returned 7.1    2016-09-25 Nobel 8.5    2007-06-16 Jekyll 8.1    2009-02-02 Whitechapel 7.5    2003-09-14 Carnivàle 8.1    2010-06-20 The Gates 6.8    2012-10-11 Copper 6.0    2006-09-20 Jericho 7.5  Facts Original Name  Les Revenants Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  French Runtime  52m Homepage   http://lesrevenants.canalplus.fr/ Genres Drama Mystery Sci-Fi & Fantasy Keywords small town france loss of loved one europe resurrection teacher children fate family based on movie outdoor accident 21st century Content Score 100 Yes! Looking good! Top Contributors 29 Ryan McCloskey 19 david8s95 14 Elizabeth Jennings CM 11 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}