{"link": "https://www.themoviedb.org/tv/38464?language=en", "title": "Blue Exorcist", "resume": "Humans live in the world of Assiah, demons in Gehenna. The two dimensions are not meant to interfere with each other, but demons still possess creatures in Assiah in spite of this. The humans who can fight these demons are known as exorcists. Rin Okumura is a boy who bears the curse of being Satan's illegitimate son. His foster father sacrificed himself to save him from demons. To avenge his foster father's death as well as to prove himself, Rin decides to follow the path of an exorcist.", "rate": 76, "genre": ["Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Jun Fukuyama", "Akeno Watanabe", "Keiji Fujiwara", "Hiroshi Kamiya"], "character": ["Okumura Yukio", "Okumura Rin", "Fujimoto Shirou", "Mephisto Pheles"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38464   Expand Blue Exorcist   (2011) User Score  Play Trailer Overview Humans live in the world of Assiah, demons in Gehenna. The two dimensions are not meant to interfere with each other, but demons still possess creatures in Assiah in spite of this. The humans who can fight these demons are known as exorcists. Rin Okumura is a boy who bears the curse of being Satan's illegitimate son. His foster father sacrificed himself to save him from demons. To avenge his foster father's death as well as to prove himself, Rin decides to follow the path of an exorcist. Featured Crew Kazue Kato Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Fukuyama Okumura Yukio Akeno Watanabe Okumura Rin Keiji Fujiwara Fujimoto Shirou Hiroshi Kamiya Mephisto Pheles Full Cast & Crew Last Season Kyoto Saga 2017 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  10 Recommendations   2014-01-05 Noragami 7.4    2010-01-08 Durarara!! 7.4    2013-04-07 Gargantia on the Verdurous Planet 6.8    2008-04-07 Soul Eater 7.0    2006-04-08 Black Lagoon 7.9    2014-10-05 The Seven Deadly Sins 7.9    2013-04-04 The Devil Is a Part-Timer! 7.1    2014-05-16 Magi: Adventure of Sinbad 6.7  Facts Original Name  青の祓魔師 Status  Returning Series Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.ao-ex.com/ Genres Animation Comedy Drama Sci-Fi & Fantasy Keywords supernatural exorcism animation demon exorcist seinen anime Content Score 100 Yes! Looking good! Top Contributors T 24 Tinobe 17 Ailurus Fulgens 16 Ronnie Borgquist Z 12 Zayrus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}