{"link": "https://www.themoviedb.org/tv/69810?language=en", "title": "下剋上受験", "resume": "Shinichi Sakurai (Sadao Abe) is married to Kanako (Kyoko Fukada) and they have a daughter named Kaori (Mikuu Yamada). Both, Shinichi and Kanako received only a middle school level education. Even though they don't have much money, they are a happy family. At work though, Shinichi experiences effects of only having a middle school education.\nOne day, Shinichi sees Kaori’s poor score for a national test. He freaks out and decides to improve Kaori's education. Thus, 41-year-old Shinichi begins studying with Kaori and instructs her for the upcoming middle school entrance exam.", "rate": 0, "genre": [], "cast": ["Yamada Mikuu", "Wakadanna", "Kawamura Yousuke", "Sadao Abe", "Kyoko Fukada"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69810   Expand 下剋上受験   (2017) User Score Overview Shinichi Sakurai (Sadao Abe) is married to Kanako (Kyoko Fukada) and they have a daughter named Kaori (Mikuu Yamada). Both, Shinichi and Kanako received only a middle school level education. Even though they don't have much money, they are a happy family. At work though, Shinichi experiences effects of only having a middle school education. One day, Shinichi sees Kaori’s poor score for a national test. He freaks out and decides to improve Kaori's education. Thus, 41-year-old Shinichi begins studying with Kaori and instructs her for the upcoming middle school entrance exam. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yamada Mikuu Wakadanna Kawamura Yousuke Sadao Abe Kyoko Fukada Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of 下剋上受験 premiered on January 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 下剋上受験. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 14 MundoAsian S 9 Solitudesfly  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}