{"link": "https://www.themoviedb.org/tv/6186?language=en", "title": "Seven Wonders of the Industrial World", "resume": "Seven Wonders of the Industrial World is a 7-part British documentary/docudrama television miniseries that originally aired from 4 September 2003 to 16 October 2003 on BBC. The programme examines seven engineering feats that occurred during the Industrial Revolution.", "rate": 75, "genre": ["Documentary"], "cast": ["Robert Lindsay"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6186   Expand Seven Wonders of the Industrial World   (2003) User Score Overview Seven Wonders of the Industrial World is a 7-part British documentary/docudrama television miniseries that originally aired from 4 September 2003 to 16 October 2003 on BBC. The programme examines seven engineering feats that occurred during the Industrial Revolution. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Lindsay Full Cast & Crew Last Season Season 1 2003 | 7 Episodes Season 1 of Seven Wonders of the Industrial World premiered on September  4, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Seven Wonders of the Industrial World. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/history/british/victorians/seven_wonders_01.shtml Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 7 aiman j 4 jzvc 1 rudely_murray 1 -BioHaZard-  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}