{"link": "https://www.themoviedb.org/tv/59960?language=en", "title": "Big Brother Canada", "resume": "Big Brother is a Canadian reality television show in which a group of contestants, known as \"HouseGuests\", are sequestered in the Big Brother House, under the surveillance of cameras and microphones, for the chance to win a grand prize of $100,000 by being the last remaining HouseGuest. Each week, the HouseGuests vote to evict one of their own until two HouseGuests remain on finale night. The winner is decided by the last seven evicted HouseGuests, known as the Big Brother Jury.\nThe program is based on the original Dutch television series, Big Brother, created in 1997 by John de Mol. The Canadian series is produced by Endemol USA and Insight Productions. Insight Productions has previously produced local Canadian versions of the popular reality television series, Canadian Idol and Canada's Got Talent.\nIn January 2013, Arisa Cox was named as the show's host.\nThe first season premiered on February 27, 2013. On June 5, 2013, it was confirmed that the show will return for a second season. The winner of the first season was Jillian MacLaughlin.", "rate": 53, "genre": ["Reality"], "cast": ["Arisa Cox"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59960   Expand Big Brother Canada   (2013) User Score Overview Big Brother is a Canadian reality television show in which a group of contestants, known as \"HouseGuests\", are sequestered in the Big Brother House, under the surveillance of cameras and microphones, for the chance to win a grand prize of $100,000 by being the last remaining HouseGuest. Each week, the HouseGuests vote to evict one of their own until two HouseGuests remain on finale night. The winner is decided by the last seven evicted HouseGuests, known as the Big Brother Jury. The program is based on the original Dutch television series, Big Brother, created in 1997 by John de Mol. The Canadian series is produced by Endemol USA and Insight Productions. Insight Productions has previously produced local Canadian versions of the popular reality television series, Canadian Idol and Canada's Got Talent. In January 2013, Arisa Cox was named as the show's host. The first season premiered on February 27, 2013. On June 5, 2013, it was confirmed that the show will return for a second season. The winner of the first season was Jillian MacLaughlin. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arisa Cox Full Cast & Crew Current Season Season 6 2018 | 29 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   2004-12-01 Project Runway 5.0    2000-05-31 Survivor 6.3  Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  45m Homepage   http://bigbrothercanada.globaltv.com/ Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors g 46 gallagher 20 oldboy3 MD 17 Mistah Darcy 10 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}