{"link": "https://www.themoviedb.org/tv/46025?language=en", "title": "Infinite Stratos", "resume": "In the near future, a Japanese scientist engineers a powered exoskeleton called \"Infinite Stratos\" (IS). Possessing technology and combat capabilities surpassing those of any other arms system, the IS threatens to destabilize the world. Faced with such an overpowered weapon, the nations of the world enact the \"Alaska Treaty\", which states that IS shall never be used for militant combat, and that existing IS technology must be equally distributed to all nations, to prevent any one nation from dominating the others. The introduction of the IS does, however, have a major effect on society. As IS can only be operated by women, there is a shift in the power balance between men and women, where women now dominate society over men.\nTen years after the IS was initially introduced, the world has entered a new age of peace. The peace is shattered, however, by Ichika Orimura, a 15-year-old Japanese boy. In a coincidental run-in with a (hibernating) IS suit, it is revealed that he possesses the innate ability to operate an IS. Realizing the potential, the Japanese government forces the bewildered young man to attend the prestigious Infinite Stratos Academy, a multicultural academy where IS pilots from all over the world are trained. Thus, he starts a busy high school life surrounded by girls training to pilot IS.", "rate": 67, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46025   Expand Infinite Stratos   (2011) User Score Overview In the near future, a Japanese scientist engineers a powered exoskeleton called \"Infinite Stratos\" (IS). Possessing technology and combat capabilities surpassing those of any other arms system, the IS threatens to destabilize the world. Faced with such an overpowered weapon, the nations of the world enact the \"Alaska Treaty\", which states that IS shall never be used for militant combat, and that existing IS technology must be equally distributed to all nations, to prevent any one nation from dominating the others. The introduction of the IS does, however, have a major effect on society. As IS can only be operated by women, there is a shift in the power balance between men and women, where women now dominate society over men. Ten years after the IS was initially introduced, the world has entered a new age of peace. The peace is shattered, however, by Ichika Orimura, a 15-year-old Japanese boy. In a coincidental run-in with a (hibernating) IS suit, it is revealed that he possesses the innate ability to operate an IS. Realizing the potential, the Japanese government forces the bewildered young man to attend the prestigious Infinite Stratos Academy, a multicultural academy where IS pilots from all over the world are trained. Thus, he starts a busy high school life surrounded by girls training to pilot IS. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season IS: Infinite Stratos 2 2013 | 12 Episodes Season 2 of Infinite Stratos premiered on October  3, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2013-10-04 Kill la Kill 7.7    2010-07-05 Highschool of the Dead 7.0  Facts Original Name  IS〈インフィニット・ストラトス〉 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 15 Romain 11 kazuza t 8 theusedversion 3 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}