{"link": "https://www.themoviedb.org/tv/9132?language=en", "title": "Carrie and Barry", "resume": "Carrie and Barry is a sitcom, shown 2004 - 2005 on BBC One, starring Neil Morrissey, Claire Rushbrook, Mark Williams and Michelle Gomez.\nProduced by Hartswood Films, it reunited Morrissey with personnel from Men Behaving Badly: specifically writer Simon Nye, executive producer Beryl Vertue and director Martin Dennis. It was produced by Sue Vertue.\nNeil Morrissey plays part-time taxi driver Barry and Claire Rushbrook is his beautician wife Carrie. The couple find themselves with the daily challenges of keeping the spice in their marriage and the fun in their day jobs — as well as having to deal with Barry's teenage daughter Sinéad from his disastrous first marriage.\nMark Williams plays Barry's mate Kirk, who co-owns his black cab whilst Michelle Gomez is Carrie's acid-tongued best friend and fellow beautician Michelle.", "rate": 0, "genre": ["Comedy"], "cast": ["Neil Morrissey", "Claire Rushbrook", "Mark Williams", "Michelle Gomez"], "character": ["Barry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9132   Expand Carrie and Barry   (2004) User Score Overview Carrie and Barry is a sitcom, shown 2004 - 2005 on BBC One, starring Neil Morrissey, Claire Rushbrook, Mark Williams and Michelle Gomez. Produced by Hartswood Films, it reunited Morrissey with personnel from Men Behaving Badly: specifically writer Simon Nye, executive producer Beryl Vertue and director Martin Dennis. It was produced by Sue Vertue. Neil Morrissey plays part-time taxi driver Barry and Claire Rushbrook is his beautician wife Carrie. The couple find themselves with the daily challenges of keeping the spice in their marriage and the fun in their day jobs — as well as having to deal with Barry's teenage daughter Sinéad from his disastrous first marriage. Mark Williams plays Barry's mate Kirk, who co-owns his black cab whilst Michelle Gomez is Carrie's acid-tongued best friend and fellow beautician Michelle. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil Morrissey Barry Claire Rushbrook Mark Williams Michelle Gomez Full Cast & Crew Last Season Carrie & barry season 2 2005 | 6 Episodes Season 2 of Carrie and Barry premiered on June 17, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Carrie and Barry. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  29m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}