{"link": "https://www.themoviedb.org/tv/34627?language=en", "title": "The Little Fairy", "resume": "When Goddess Xiao Qi commits a major crime, she is stripped of her powers and banished to the mortal realm where she meets a mortal who helps her accomplish 100 charitable acts so she can regain her goddess status. The two fall in love, but when their forbidden love affair is discovered, heaven guards descend upon the mortal realm to separate the two lovers.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["Hu Ge", "Ariel Lin", "Bobby Dou", "TAE", "Florence Tan"], "character": ["Dong Yong", "Seventh Fairy Maiden", "Shangguan Haoqi", "Fu Yuanbao", "Cuiniang"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34627   Expand The Little Fairy   (2006) User Score Overview When Goddess Xiao Qi commits a major crime, she is stripped of her powers and banished to the mortal realm where she meets a mortal who helps her accomplish 100 charitable acts so she can regain her goddess status. The two fall in love, but when their forbidden love affair is discovered, heaven guards descend upon the mortal realm to separate the two lovers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hu Ge Dong Yong Ariel Lin Seventh Fairy Maiden Bobby Dou Shangguan Haoqi TAE Fu Yuanbao Florence Tan Cuiniang Full Cast & Crew Last Season Season 1 2006 | 38 Episodes Season 1 of The Little Fairy premiered on August  4, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Little Fairy. You can help by rating TV shows you've seen. Facts Original Name  天外飞仙 Status  Ended Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  47m Homepage  - Genres Sci-Fi & Fantasy Drama Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 26 tcx4c70 13 Elizabeth Jennings k 3 khyungil  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}