{"link": "https://www.themoviedb.org/tv/3137?language=en", "title": "Babylon 5", "resume": "Babylon 5 is a five-mile long space station located in neutral space. Built by the Earth Alliance in the 2250s, it's goal is to maintain peace among the various alien races by providing a sanctuary where grievances and negotiations can be worked out among duly appointed ambassadors. A council made up of representatives from the five major space-faring civilizations - the Earth Alliance, Minbari Federation, Centauri Republic, Narn Regime, and Vorlon Empire - work with the League of Non-Aligned Worlds to keep interstellar relations under control. Aside from its diplomatic function, Babylon 5 also serves as a military post for Earth and a port of call for travelers, traders, businessmen, criminals, and Rangers.", "rate": 82, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Bruce Boxleitner", "Jerry Doyle", "Mira Furlan", "Richard Biggs", "Andreas Katsulas"], "character": ["John Sheridan", "Michael Garibaldi", "Delenn", "Stephen Franklin", "G’Kar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3137   Expand Babylon 5   (1994) User Score  Play Trailer Overview Babylon 5 is a five-mile long space station located in neutral space. Built by the Earth Alliance in the 2250s, it's goal is to maintain peace among the various alien races by providing a sanctuary where grievances and negotiations can be worked out among duly appointed ambassadors. A council made up of representatives from the five major space-faring civilizations - the Earth Alliance, Minbari Federation, Centauri Republic, Narn Regime, and Vorlon Empire - work with the League of Non-Aligned Worlds to keep interstellar relations under control. Aside from its diplomatic function, Babylon 5 also serves as a military post for Earth and a port of call for travelers, traders, businessmen, criminals, and Rangers. Featured Crew J. Michael Straczynski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  38 Posters  19 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Bruce Boxleitner John Sheridan Jerry Doyle Michael Garibaldi Mira Furlan Delenn Richard Biggs Stephen Franklin Andreas Katsulas G’Kar Full Cast & Crew Last Season Wheel of Fire 1998 | 22 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply K The Earth War Open 0 by Knixon\n      \n     M Anyone else miss this show? Open 3 by  Invidia T As far as I am concerned, the best science fiction series I have ever seen. Open 4 by  Invidia Go to Discussions Media Most Popular Videos  2 Backdrops  38 Posters  19 Recommendations   2000-10-02 Andromeda 7.1    1993-01-03 Star Trek: Deep Space Nine 7.8    1995-01-16 Star Trek: Voyager 7.8    2001-09-26 Star Trek: Enterprise 7.4    1999-06-09 Crusade 6.6    1987-09-28 Star Trek: The Next Generation 8.2    2004-07-15 Stargate Atlantis 7.8    1997-07-27 Stargate SG-1 8.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://babylon5.warnerbros.com/ Genres Drama Sci-Fi & Fantasy Keywords telepathy transformation time travel space station space opera saga Content Score 100 Yes! Looking good! Top Contributors 82 TonAngel 51 Elizabeth Jennings 27 United600 G 22 Gamefaq  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}