{"link": "https://www.themoviedb.org/tv/76219?language=en", "title": "Miss Monochrome - The Animation", "resume": "Miss Monochrome is an android who decides to try and become a top idol singer in the ever growing competitive market.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": ["Yui Horie", "Keiji Fujiwara"], "character": ["Miss Monochrome (voice)", "Manager (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76219   Expand Miss Monochrome - The Animation   (2013) User Score Overview Miss Monochrome is an android who decides to try and become a top idol singer in the ever growing competitive market. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yui Horie Miss Monochrome (voice) Keiji Fujiwara Manager (voice) Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Miss Monochrome - The Animation premiered on October  2, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Miss Monochrome - The Animation. You can help by rating TV shows you've seen. Facts Original Name  ミス・モノクローム -The Animation- Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  4m Homepage   http://king-cr.jp/special/miss_monochrome_anime Genres Animation Comedy Keywords android music idol science fiction slice of life short episodes Content Score 43 There's no 'I' in team... Top Contributors 47 Marr 🇳🇱 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}