{"link": "https://www.themoviedb.org/tv/65884?language=en", "title": "MTV Suspect", "resume": "Across America, people are hiding deep secrets from their friends or loved ones. These lies can seriously damage a relationship and can wreak havoc on the lives of everyone involved. MTV Suspect is the show that tackles these deceptions head on. Every episode, Nev Schulman (Catfish) and his co-host, iO Tillett Wright will work to untangle a new web of lies in the hopes of bringing resolution to our concerned truth-seekers who have nowhere else to turn. Nev and iO will examine the facts, seek out answers and push to uncover what's really going on, delving into everything from secret identities, hidden addictions, to a host of other lies that could have hugely damaging consequences. Through this process they hope to help bring the truth to the surface in order for these groups to move into a better and more honest relationship.", "rate": 0, "genre": ["Reality"], "cast": ["Io Tillett Wright", "Nev Schulman"], "character": ["Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65884   Expand MTV Suspect   (2016) User Score Overview Across America, people are hiding deep secrets from their friends or loved ones. These lies can seriously damage a relationship and can wreak havoc on the lives of everyone involved. MTV Suspect is the show that tackles these deceptions head on. Every episode, Nev Schulman (Catfish) and his co-host, iO Tillett Wright will work to untangle a new web of lies in the hopes of bringing resolution to our concerned truth-seekers who have nowhere else to turn. Nev and iO will examine the facts, seek out answers and push to uncover what's really going on, delving into everything from secret identities, hidden addictions, to a host of other lies that could have hugely damaging consequences. Through this process they hope to help bring the truth to the surface in order for these groups to move into a better and more honest relationship. Featured Crew Nev Schulman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Io Tillett Wright Herself Nev Schulman Himself Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of MTV Suspect premiered on February 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on MTV Suspect. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  41m Homepage   http://www.mtv.com/shows/mtv-suspect Genres Reality Keywords friends family uncover truth Content Score 64 We're so close, yet so far. Top Contributors 30 Rug 4 Banana 3 Elizabeth Jennings 2 Ly  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}