{"link": "https://www.themoviedb.org/tv/12396?language=en", "title": "Goober and the Ghost Chasers", "resume": "Goober and the Ghost Chasers is a Saturday morning cartoon produced by Hanna-Barbera and animated by the Eric Porter Studios in Australia, which aired on ABC from September 8, 1973 to August 30, 1975. A total of 16 half-hour episodes of Goober and the Ghost Chasers were produced. The show's episodes were later serialized as part of the syndicated weekday series Fred Flintstone and Friends in 1977. On cable, it was shown as part of USA Cartoon Express and later on Boomerang.", "rate": 50, "genre": ["Animation"], "cast": ["Jerry Dexter", "Paul Winchell", "Ronnie Schell", "Jo Ann Harris", "Danny Bonaduce"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12396   Expand Goober and the Ghost Chasers   (1973) User Score  Play Trailer Overview Goober and the Ghost Chasers is a Saturday morning cartoon produced by Hanna-Barbera and animated by the Eric Porter Studios in Australia, which aired on ABC from September 8, 1973 to August 30, 1975. A total of 16 half-hour episodes of Goober and the Ghost Chasers were produced. The show's episodes were later serialized as part of the syndicated weekday series Fred Flintstone and Friends in 1977. On cable, it was shown as part of USA Cartoon Express and later on Boomerang. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Dexter Paul Winchell Ronnie Schell Jo Ann Harris Danny Bonaduce Full Cast & Crew Last Season Goober and the ghost-chasers season 1 1973 | 16 Episodes Season 1 of Goober and the Ghost Chasers premiered on September  8, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Goober and the Ghost Chasers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors TB 1 TMDb Bot 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}