{"link": "https://www.themoviedb.org/tv/64568?language=en", "title": "Ready For This", "resume": "Six teens arrive at Arcadia House to pursue their dreams. For some it's the opportunity of a lifetime, for others it's a last chance. All are strangers and the last thing they expect to find is family.", "rate": 0, "genre": ["Drama"], "cast": ["Majeda Beatty", "Christian Byers", "Madeleine Madden", "Aaron L. McGrath", "Liam Talty"], "character": ["Ava Ban", "Reece Scott", "Zoe Preston", "Levi Mackay", "Dylan Brockman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64568   Expand Ready For This   (2015) User Score  Play Trailer Overview Six teens arrive at Arcadia House to pursue their dreams. For some it's the opportunity of a lifetime, for others it's a last chance. All are strangers and the last thing they expect to find is family. Featured Crew Darren Dale Creator Miranda Dear Creator Liz Doran Creator Joanna Werner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Majeda Beatty Ava Ban Christian Byers Reece Scott Madeleine Madden Zoe Preston Aaron L. McGrath Levi Mackay Liam Talty Dylan Brockman Full Cast & Crew Last Season Series 1 2015 | 13 Episodes Season 1 of Ready For This premiered on October  5, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ready For This. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/programs/ready-for-this/ Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 45 United600 10 Elizabeth Jennings BA 3 Barbara Ann O'Leary TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}