{"link": "https://www.themoviedb.org/tv/71837?language=en", "title": "Unknown Woman", "resume": "Hong Ji Won grew up at an orphanage. To escape from her poor background, she studied hard and graduated from a prestigious university. She then worked as a secretary at a large company. Finally, Hong Ji Won married the owner of the company and gave birth to a son. Now, Hong Ji Won learns that her son has a disease. She decides that she will do anything for her son.\nSon YeoRi was raised by wealthy foster parents, but she is abandoned by foster parents and her boyfriend. To protect her child, Son Yeo Ri goes to prison.", "rate": 80, "genre": ["Drama", "Family"], "cast": ["Oh Ji-eun", "Bae Jong-ok", "Park Yoon-jae", "Seo Ji-Seok", "Choi Yoon-so"], "character": ["Son Yeo Ri", "Hong Ji Won", "Goo Do Chi", "Kim Moo Yul", "Goo Hae Joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71837   Expand Unknown Woman   (2017) User Score Overview Hong Ji Won grew up at an orphanage. To escape from her poor background, she studied hard and graduated from a prestigious university. She then worked as a secretary at a large company. Finally, Hong Ji Won married the owner of the company and gave birth to a son. Now, Hong Ji Won learns that her son has a disease. She decides that she will do anything for her son. Son YeoRi was raised by wealthy foster parents, but she is abandoned by foster parents and her boyfriend. To protect her child, Son Yeo Ri goes to prison. Featured Crew Kim Myung Wook Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oh Ji-eun Son Yeo Ri Bae Jong-ok Hong Ji Won Park Yoon-jae Goo Do Chi Seo Ji-Seok Kim Moo Yul Choi Yoon-so Goo Hae Joo Full Cast & Crew Last Season Season 1 2017 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Unknown Woman. You can help by rating TV shows you've seen. Facts Original Name  이름 없는 여자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage  - Genres Drama Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 27 friend-series.com a 13 allison2015 d 9 daphie 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}