{"link": "https://www.themoviedb.org/tv/40488?language=en", "title": "A Day in the Life", "resume": "Morgan Spurlock (Academy Award Nominated Director of \"Supersize Me\") has spent the majority of his career turning the camera on himself, inviting the audience to be a part of his own life experiences. This time, he's refocusing his lens on the most innovative and intriguing individuals in our pop culture landscape, allowing the audience to experience what it's like to be at the pinnacle of an exciting and extraordinary career by being \"a fly on the wall\" during the course of a typical day. Each episode goes behind the scenes with today's leading figures - celebrities, musicians, comedians, dancers, entrepreneurs - literally chronicling one day in their lives in a half-hour documentary film.", "rate": 60, "genre": ["Documentary"], "cast": ["Morgan Spurlock"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40488   Expand A Day in the Life   (2011) User Score Overview Morgan Spurlock (Academy Award Nominated Director of \"Supersize Me\") has spent the majority of his career turning the camera on himself, inviting the audience to be a part of his own life experiences. This time, he's refocusing his lens on the most innovative and intriguing individuals in our pop culture landscape, allowing the audience to experience what it's like to be at the pinnacle of an exciting and extraordinary career by being \"a fly on the wall\" during the course of a typical day. Each episode goes behind the scenes with today's leading figures - celebrities, musicians, comedians, dancers, entrepreneurs - literally chronicling one day in their lives in a half-hour documentary film. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Morgan Spurlock Full Cast & Crew Last Season Season 2 2012 | 10 Episodes Season 2 of A Day in the Life premiered on March 12, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on A Day in the Life. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.hulu.com/a-day-in-the-life Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 4 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}