{"link": "https://www.themoviedb.org/tv/4415?language=en", "title": "In Living Color", "resume": "In Living Color is an American sketch comedy television series that originally ran on the Fox Network from April 15, 1990, to May 19, 1994. Brothers Keenen and Damon Wayans created, wrote and starred in the program. The show was produced by Ivory Way Productions in association with 20th Century Fox Television and was taped before a live studio audience at stage 7 at the Fox Television Center on Sunset Boulevard in Hollywood, California. The title of the series was inspired by the NBC announcement of broadcasts being presented \"in living color\" during the 1950s and 1960s, prior to mainstream color television. It also refers to the fact that most of the show's cast were black, unlike other sketch comedy shows such as Saturday Night Live whose casts are usually mostly white.\nOther members of the Wayans family—Kim, Shawn and Marlon—had regular roles, while brother Dwayne frequently appeared as an extra. The show also starred the previously unknown actor/comedians Jim Carrey, Jamie Foxx, and David Alan Grier. Additionally, actress Rosie Perez, Dancing with the Stars judge and choreographer Carrie Ann Inaba and dancer Jennifer Lopez were members of the show's dance troupe The Fly Girls. The series won the Emmy for Outstanding Variety, Music or Comedy Series in 1990.", "rate": 75, "genre": ["Comedy"], "cast": ["David Alan Grier", "Jennifer Lopez", "Jim Carrey", "Alexandra Wentworth", "Keenen Ivory Wayans"], "character": ["Calhoun Tubbs", "Fly Girl", "Jay Leno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4415   Expand In Living Color   (1990) User Score Overview In Living Color is an American sketch comedy television series that originally ran on the Fox Network from April 15, 1990, to May 19, 1994. Brothers Keenen and Damon Wayans created, wrote and starred in the program. The show was produced by Ivory Way Productions in association with 20th Century Fox Television and was taped before a live studio audience at stage 7 at the Fox Television Center on Sunset Boulevard in Hollywood, California. The title of the series was inspired by the NBC announcement of broadcasts being presented \"in living color\" during the 1950s and 1960s, prior to mainstream color television. It also refers to the fact that most of the show's cast were black, unlike other sketch comedy shows such as Saturday Night Live whose casts are usually mostly white. Other members of the Wayans family—Kim, Shawn and Marlon—had regular roles, while brother Dwayne frequently appeared as an extra. The show also starred the previously unknown actor/comedians Jim Carrey, Jamie Foxx, and David Alan Grier. Additionally, actress Rosie Perez, Dancing with the Stars judge and choreographer Carrie Ann Inaba and dancer Jennifer Lopez were members of the show's dance troupe The Fly Girls. The series won the Emmy for Outstanding Variety, Music or Comedy Series in 1990. Featured Crew Keenen Ivory Wayans Creator Damon Wayans Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Alan Grier Calhoun Tubbs Jennifer Lopez Fly Girl Jim Carrey Jay Leno Alexandra Wentworth Keenen Ivory Wayans Full Cast & Crew Last Season Season 5 1993 | 26 Episodes Season 5 of In Living Color premiered on September 16, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   1988-11-14 Murphy Brown 6.5    1983-09-16 Webster 4.9    1973-01-06 Schoolhouse Rock 8.2    1994-03-05 Duckman 8.1    1986-03-25 Perfect Strangers 6.6    1984-01-04 Night Court 6.9    1995-10-14 MADtv 5.7    1982-09-25 Silver Spoons 5.1  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sketch comedy Content Score 93 Almost there... Top Contributors 7 Banana 6 TheOneManBoxOffice 4 lineker 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}