{"link": "https://www.themoviedb.org/tv/21678?language=en", "title": "The Colony", "resume": "The Colony is a reality television series that is produced by the Discovery Channel. The program follows a group of people who must survive in a simulated post-apocalyptic environment.\nCasting was done by Metal Flowers Media. The first season had 10 main cast members as well as almost 100 actors who did additional scripted and improvisational work for the show.", "rate": 79, "genre": [], "cast": ["Thom Beers"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21678   Expand The Colony   (2009) User Score Overview The Colony is a reality television series that is produced by the Discovery Channel. The program follows a group of people who must survive in a simulated post-apocalyptic environment. Casting was done by Metal Flowers Media. The first season had 10 main cast members as well as almost 100 actors who did additional scripted and improvisational work for the show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thom Beers Full Cast & Crew Last Season (us) season 2 2010 | 10 Episodes Season 2 of The Colony premiered on July 27, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2001-10-06 The Mitchell and Webb Situation 8.0    1998-11-09 Big Train 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage   http://dsc.discovery.com/tv/colony/colony.html Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 1 Michael 1 Grandbonobo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}