{"link": "https://www.themoviedb.org/tv/76048?language=en", "title": "Ellen's Game of Games", "resume": "An hour of supersized versions of the most popular and hilariously fun games from The Ellen DeGeneres Show. Contestants, pulled right from the audience, will have to maneuver massive obstacles, answer questions under immense pressure and face a gigantic plunge into the unknown.", "rate": 70, "genre": ["Talk"], "cast": ["Ellen DeGeneres"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76048   Expand Ellen's Game of Games   (2017) User Score  Play Trailer Overview An hour of supersized versions of the most popular and hilariously fun games from The Ellen DeGeneres Show. Contestants, pulled right from the audience, will have to maneuver massive obstacles, answer questions under immense pressure and face a gigantic plunge into the unknown. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ellen DeGeneres Host Full Cast & Crew Current Season Season 1 2017 | 8 Episodes Season 1 of Ellen's Game of Games premiered on December 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations   2015-09-21 Blindspot 6.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   https://www.nbc.com/ellens-game-of-games Genres Talk Keywords game show Content Score 64 We're so close, yet so far. Top Contributors 10 Elizabeth Jennings HS 9 Hugo S. t 8 toddmoody 3 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}