{"link": "https://www.themoviedb.org/tv/10212?language=en", "title": "Baby Bob", "resume": "Baby Bob is an American sitcom that aired on CBS as a midseason replacement in March 2002. The Baby Bob character had previously been on television since February 2000, appearing in commercials for FreeInternet.com. While actual infants played Bob, the effect to make him look like he was talking was achieved through computer editing.", "rate": 0, "genre": ["Comedy"], "cast": ["Elliott Gould", "Adam Arkin", "Joely Fisher", "Holland Taylor", "Marissa Tait"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10212   Expand Baby Bob   (2002) User Score Overview Baby Bob is an American sitcom that aired on CBS as a midseason replacement in March 2002. The Baby Bob character had previously been on television since February 2000, appearing in commercials for FreeInternet.com. While actual infants played Bob, the effect to make him look like he was talking was achieved through computer editing. Featured Crew Michael Saltzman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elliott Gould Adam Arkin Joely Fisher Holland Taylor Marissa Tait Full Cast & Crew Last Season Season 2 2003 | 8 Episodes Season 2 of Baby Bob premiered on June  6, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Baby Bob. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords baby parenthood sitcom talking baby Content Score 79 Pump it up! We're close now. Top Contributors 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}