{"link": "https://www.themoviedb.org/tv/53352?language=en", "title": "House of Five Leaves", "resume": "Rônin Akitsu Masanosuke is a skilled swordsman, but his personality often causes him to be let go from his job. One day he encounters Yaichi, the leader of a group calling itself \"Five Leaves\" and takes a job from him as a bodyguard. Though he is worried about their intentions, he feels there is something more to the group and agrees to work with them.", "rate": 70, "genre": ["Drama", "Animation", "Mystery"], "cast": ["Namikawa Daisuke", "Takahiro Sakurai", "Yûya Uchida", "Masaya Takatsuka", "Fuyuka Oura"], "character": ["Masanosuke Akitsu (voice)", "Yaichi (voice)", "Matsukichi (voice)", "Umezô (voice)", "Otake (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53352   Expand House of Five Leaves   (2010) User Score Overview Rônin Akitsu Masanosuke is a skilled swordsman, but his personality often causes him to be let go from his job. One day he encounters Yaichi, the leader of a group calling itself \"Five Leaves\" and takes a job from him as a bodyguard. Though he is worried about their intentions, he feels there is something more to the group and agrees to work with them. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Namikawa Daisuke Masanosuke Akitsu (voice) Takahiro Sakurai Yaichi (voice) Yûya Uchida Matsukichi (voice) Masaya Takatsuka Umezô (voice) Fuyuka Oura Otake (voice) Full Cast & Crew Last Season Season 1 2010 | 12 Episodes Season 1 of House of Five Leaves premiered on April 16, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2007-07-27 Baccano! 8.4  Facts Original Name  さらい屋 五葉 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.goyou-anime.jp/ Genres Drama Animation Mystery Keywords historical samurai era Content Score 86 Almost there... Top Contributors 19 Shadofu s 11 sheva_vitali s 7 suitepee m 4 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}