{"link": "https://www.themoviedb.org/tv/14844?language=en", "title": "Oliver's Travels", "resume": "Oliver's Travels is a five-part television serial written by Alan Plater and starring Alan Bates, Sinéad Cusack, Bill Paterson, and Miles Anderson. It first aired in the UK in 1995.\nBates plays the titular Oliver, a keen word-game enthusiast and lecturer in comparative religion. After his teaching post is made redundant, he resolves to make use of his new wealth of free time by going to visit his favourite crossword compiler, 'Aristotle', with whom he has corresponded but whom he has never met. When he arrives, however, he finds Aristotle's house has been ransacked and its occupant has departed for parts unknown, and he sets out to discover why.", "rate": 60, "genre": ["Comedy", "Drama"], "cast": ["Sinéad Cusack", "Alan Bates", "Bill Paterson", "Morgan Jones", "Miles Anderson"], "character": ["WPC Diane Priest", "Oliver", "Baxter", "Michael Priest", "Baron Kite"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14844   Expand Oliver's Travels   (1995) User Score Overview Oliver's Travels is a five-part television serial written by Alan Plater and starring Alan Bates, Sinéad Cusack, Bill Paterson, and Miles Anderson. It first aired in the UK in 1995. Bates plays the titular Oliver, a keen word-game enthusiast and lecturer in comparative religion. After his teaching post is made redundant, he resolves to make use of his new wealth of free time by going to visit his favourite crossword compiler, 'Aristotle', with whom he has corresponded but whom he has never met. When he arrives, however, he finds Aristotle's house has been ransacked and its occupant has departed for parts unknown, and he sets out to discover why. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sinéad Cusack WPC Diane Priest Alan Bates Oliver Bill Paterson Baxter Morgan Jones Michael Priest Miles Anderson Baron Kite Full Cast & Crew Last Season Season 1 1995 | 5 Episodes Season 1 of Oliver's Travels premiered on June 11, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Oliver's Travels. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Comedy Drama Keywords england miniseries missing person Content Score 86 Almost there... Top Contributors TB 10 TMDb Bot 8 Banana e 2 egbertbos 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}