{"link": "https://www.themoviedb.org/tv/15749?language=en", "title": "Chanakya", "resume": "Chanakya is a 47-part epic Indian television historical drama written and directed by Dr. Chandraprakash Dwivedi that was originally telecast on DD National from 8 September 1991 to 9 August 1992. Produced by Prakash Dwivedi, the series is a fictionalized account of the life and times of 4th century BCE Indian economist, strategist and political theorist Chanakya and is based on events occurring between 340 BCE and 321/20 BCE, starting with Chanakya's boyhood and culminating in the coronation of Chandragupta Maurya. Chandraprakash Dwivedi played the title role of Chanakya.\nThe series is divided into three major parts:\n⁕The early life of Vishnugupta in the kingdom of Magadha and the circumstances leading to his self-imposed exile, particularly the persecution of his father at the hands of Dhanananda, King of Magadha.\n⁕The invasion of northwestern India by Alexander, his death and the rebellion led by native Indian kingdoms under the leadership of Chandragupta Maurya against Alexander's successors in India. The Greek invaders are defeated.\n⁕The attack on and overthrow of the Nanda rule in Magadha and the crowning of Chandragupta as the King of Magadha.", "rate": 0, "genre": ["Documentary"], "cast": ["Surendra Pal"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15749   Expand Chanakya   (1991) User Score Overview Chanakya is a 47-part epic Indian television historical drama written and directed by Dr. Chandraprakash Dwivedi that was originally telecast on DD National from 8 September 1991 to 9 August 1992. Produced by Prakash Dwivedi, the series is a fictionalized account of the life and times of 4th century BCE Indian economist, strategist and political theorist Chanakya and is based on events occurring between 340 BCE and 321/20 BCE, starting with Chanakya's boyhood and culminating in the coronation of Chandragupta Maurya. Chandraprakash Dwivedi played the title role of Chanakya. The series is divided into three major parts: ⁕The early life of Vishnugupta in the kingdom of Magadha and the circumstances leading to his self-imposed exile, particularly the persecution of his father at the hands of Dhanananda, King of Magadha. ⁕The invasion of northwestern India by Alexander, his death and the rebellion led by native Indian kingdoms under the leadership of Chandragupta Maurya against Alexander's successors in India. The Greek invaders are defeated. ⁕The attack on and overthrow of the Nanda rule in Magadha and the crowning of Chandragupta as the King of Magadha. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Surendra Pal Full Cast & Crew Last Season Season 1 1991 | 47 Episodes Season 1 of Chanakya premiered on September  8, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Chanakya. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}