{"link": "https://www.themoviedb.org/tv/70114?language=en", "title": "Egypt's Golden Empire", "resume": "In 1560 BC, when Rome was still a marsh and the Acropolis was an empty rock, Egypt was already 1,000 years old. Although the period of the pyramid-builders was long over, Egypt lay on the threshold of its greatest age. The New Kingdom would be an empire forged by conquest, maintained by intimidation and diplomacy, and remembered long after its demise.", "rate": 0, "genre": ["Documentary"], "cast": ["Keith David"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70114   Expand Egypt's Golden Empire   (2002) User Score Overview In 1560 BC, when Rome was still a marsh and the Acropolis was an empty rock, Egypt was already 1,000 years old. Although the period of the pyramid-builders was long over, Egypt lay on the threshold of its greatest age. The New Kingdom would be an empire forged by conquest, maintained by intimidation and diplomacy, and remembered long after its demise. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keith David Himself - Narrator Full Cast & Crew Last Season Miniseries 2002 | 3 Episodes Season 1 of Egypt's Golden Empire premiered on February  4, 2002. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Egypt's Golden Empire. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Egypt's Golden Empire. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  52m Homepage   http://www.pbs.org/empires/egypt/ Genres Documentary Keywords egypt civilization history ancient egypt egyptology Content Score 56 We're so close, yet so far. Top Contributors 38 waaw 27 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}