{"link": "https://www.themoviedb.org/tv/36871?language=en", "title": "Starke Man", "resume": "Starke man is a 2010 Swedish comedy series broadcast on SVT. The series focuses on local politics in Svinarp, a fictitious small municipality in the south of Sweden, which the press has branded the second-most boring municipality of Scania in the pilot episode. Much of the series revolves around Lars-Göran Bengtsson, the less-than competent social democrat mayor of Svinarp, who is usually saved from disaster by his disillusioned staff. Starke man was written by Wiktor Ericsson and Anders Jansson with Anders Jansson, Magnus Mark and Anna Blomberg in the main roles.\nThe first episode was broadcast on 26 September 2010. The second season was broadcast in 2011.\nThe series was filmed in Kävlinge, Sweden.", "rate": 0, "genre": ["Comedy"], "cast": ["Anders Jansson", "Anna Blomberg"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36871   Expand Starke Man   (2010) User Score Overview Starke man is a 2010 Swedish comedy series broadcast on SVT. The series focuses on local politics in Svinarp, a fictitious small municipality in the south of Sweden, which the press has branded the second-most boring municipality of Scania in the pilot episode. Much of the series revolves around Lars-Göran Bengtsson, the less-than competent social democrat mayor of Svinarp, who is usually saved from disaster by his disillusioned staff. Starke man was written by Wiktor Ericsson and Anders Jansson with Anders Jansson, Magnus Mark and Anna Blomberg in the main roles. The first episode was broadcast on 26 September 2010. The second season was broadcast in 2011. The series was filmed in Kävlinge, Sweden. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anders Jansson Anna Blomberg Full Cast & Crew Last Season Season 2 2011 | 13 Episodes Season 2 of Starke Man premiered on September 26, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Starke Man. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors TH 3 Thomas Hellström  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}