{"link": "https://www.themoviedb.org/tv/11982?language=en", "title": "Max and Ruby", "resume": "Meet two funny bunny siblings, the energetic and mischievous Max, and the patient, smart and goal-oriented Ruby. The show models empowering messages by showing Max and Ruby playing together and resolving their differences respectfully and supportively.", "rate": 57, "genre": ["Kids", "Animation"], "cast": ["Katie Griffin", "Samantha Morton", "Joan Cusack", "Billy Rosemberg"], "character": ["Ruby"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11982   Expand Max and Ruby   (2002) User Score Overview Meet two funny bunny siblings, the energetic and mischievous Max, and the patient, smart and goal-oriented Ruby. The show models empowering messages by showing Max and Ruby playing together and resolving their differences respectfully and supportively. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katie Griffin Samantha Morton Ruby Joan Cusack Billy Rosemberg Full Cast & Crew Last Season Season 6 2016 | 16 Episodes Season 6 of Max and Ruby premiered on September 18, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2000-08-13 Dora the Explorer 4.2  Facts Status  Ended Networks Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  30m, 24m Homepage   http://nickjr.com/max-and-ruby/ Genres Kids Animation Keywords children based on children's book educational cartoon rabbit Content Score 86 Almost there... Top Contributors w 11 wil001 10 Banana 5 sreknob z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}