{"link": "https://www.themoviedb.org/tv/14433?language=en", "title": "Mansfield Park", "resume": "Drama series based on the novel by Jane Austen. Mansfield Park is the magnificient country residence of Sir Thomas Bertram and his family. It is here that their poor relation Fanny Price is brought up. Never allowed to forget her good fortune, Fanny is ignored by her cousins, with the exception of Edmund, who alone treats her with care and affection. But will she ever be able to win a valued place in the household and the heart of the man of her dreams?", "rate": 60, "genre": ["Drama"], "cast": ["Jackie Smith-Wood", "Christopher Villiers", "Bernard Hepton", "Nicholas Farrell", "Angela Pleasence"], "character": ["Mary Crawford", "Thomas Bertram", "Sir Thomas Bertram", "Edmund Bertram", "Lady Bertram"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14433   Expand Mansfield Park   (1983) User Score Overview Drama series based on the novel by Jane Austen. Mansfield Park is the magnificient country residence of Sir Thomas Bertram and his family. It is here that their poor relation Fanny Price is brought up. Never allowed to forget her good fortune, Fanny is ignored by her cousins, with the exception of Edmund, who alone treats her with care and affection. But will she ever be able to win a valued place in the household and the heart of the man of her dreams? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jackie Smith-Wood Mary Crawford Christopher Villiers Thomas Bertram Bernard Hepton Sir Thomas Bertram Nicholas Farrell Edmund Bertram Angela Pleasence Lady Bertram Full Cast & Crew Last Season Season 1 1983 | 6 Episodes Season 1 of Mansfield Park premiered on November  6, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mansfield Park. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Drama Keywords miniseries Content Score 86 Almost there... Top Contributors TB 9 TMDb Bot R 5 Rebecca 2 Joe Carson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}