{"link": "https://www.themoviedb.org/tv/2720?language=en", "title": "TaleSpin", "resume": "Baloo the Bear stars in an adventurous comedy of love and conflict with his friend Kit Cloudkicker. Rebecca Cunningham and her daughter Molly purchase Baloo's failing company and Baloo must fly transport runs to clear his debt while dodging Don Karnage and his sky pirates.", "rate": 73, "genre": ["Family", "Animation"], "cast": ["Ed Gilbert", "Sally Struthers", "Jim Cummings", "Susan Silo", "Janna Michaels"], "character": ["Baloo (voice)", "Rebecca Cunningham (voice)", "King Louie (voice)", "Airplane Jane (voice)", "Molly Cunningham (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2720   Expand TaleSpin   (1992) User Score Overview Baloo the Bear stars in an adventurous comedy of love and conflict with his friend Kit Cloudkicker. Rebecca Cunningham and her daughter Molly purchase Baloo's failing company and Baloo must fly transport runs to clear his debt while dodging Don Karnage and his sky pirates. Featured Crew Jymn Magon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ed Gilbert Baloo (voice) Sally Struthers Rebecca Cunningham (voice) Jim Cummings King Louie (voice) Susan Silo Airplane Jane (voice) Janna Michaels Molly Cunningham (voice) Full Cast & Crew Last Season Season 1 1992 | 65 Episodes Season 1 of TaleSpin premiered on July 25, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   1985-09-14 Disney's Adventures of the Gummi Bears 7.6    1989-03-05 Chip 'n Dale Rescue Rangers 7.1    1991-09-08 Darkwing Duck 7.3    1992-09-05 Goof Troop 6.5    1990-09-10 Captain Planet and the Planeteers 5.9    1987-09-18 DuckTales 7.6    1991-09-07 Taz-Mania 6.3    1983-06-06 Reading Rainbow 9.1  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Animation Keywords pilot cartoon bear Content Score 93 Almost there... Top Contributors 15 Banana 14 Marr 🇳🇱 P 10 Pogodak FI 4 Fagyal István  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}