{"link": "https://www.themoviedb.org/tv/56333?language=en", "title": "Love, Lies and Murder", "resume": "Love, Lies, and Murder is a 1991 American miniseries starring Clancy Brown, Sheryl Lee, Moira Kelly, Tom Bower, John Ashton, and Cynthia Nixon. It is based on the 1985 murder of Linda Bailey Brown. The names were not changed for the film. The miniseries is four hours long and aired on NBC in two parts, the first on February 16, 1991 and the second on February 18, 1991. Lifetime airs the miniseries.", "rate": 60, "genre": ["Crime", "Drama"], "cast": ["Clancy Brown", "Sheryl Lee", "Moira Kelly", "Cathryn de Prume", "Tom Bower"], "character": ["David Brown", "Patti Bailey", "Cinnamon Brown", "Linda Bailey Brown", "Leverette"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56333   Expand Love, Lies and Murder   (1991) User Score Overview Love, Lies, and Murder is a 1991 American miniseries starring Clancy Brown, Sheryl Lee, Moira Kelly, Tom Bower, John Ashton, and Cynthia Nixon. It is based on the 1985 murder of Linda Bailey Brown. The names were not changed for the film. The miniseries is four hours long and aired on NBC in two parts, the first on February 16, 1991 and the second on February 18, 1991. Lifetime airs the miniseries. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clancy Brown David Brown Sheryl Lee Patti Bailey Moira Kelly Cinnamon Brown Cathryn de Prume Linda Bailey Brown Tom Bower Leverette Full Cast & Crew Last Season Season 1 1991 | 2 Episodes Season 1 of Love, Lies and Murder premiered on February 16, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Love, Lies and Murder. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Crime Drama Keywords based on a true story murder miniseries older man younger woman relationship murder mystery Content Score 71 Just a little bit more... Top Contributors 22 Banana CM 6 Cherche Moi TB 5 TMDb Bot R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}