{"link": "https://www.themoviedb.org/tv/67674?language=en", "title": "Danganronpa 3- The End of Hope's Peak Academy Side- Despair", "resume": "Hope's Peak Academy is a special school, recognized by the government, that was established in order to gather and nurture top-class students who excel in various fields. This school has two courses: The main course, and the preparatory course. Anyone with the money can enter the preparatory course, even if they don't have any special skills. The 77th class of the main course is filled with students who not only have unique abilities, but unique personalities as well. However, the students learned that \"Talent isn't the most important thing in life; it's to involve yourself with people and make yourself a better person while making memories.\" However, little did they know that a mysterious project and discrimination of the courses were happening right under their noses. Hajime Hinata, a boy from the preparatory class who craves for an ability. The fateful meeting he has drives the future of the school into an unimaginable direction. This is the story of what happened up until the \"The Biggest, Most Awful, Most Tragic Event in Human History.\" This is a story of hope that ends in despair.", "rate": 90, "genre": ["Action", "Adventure", "Animation", "Crime", "Mystery"], "cast": ["Megumi Ogata", "Megumi Toyoguchi", "Kana Hanazawa", "Minami Takayama"], "character": ["Nagito Komaeda (狛枝 凪斗)", "Junko Enoshima (江ノ島 盾子)", "Chiaki Nanami (七海 千秋)", "Hajime Hinata (日向 創)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67674   Expand Danganronpa 3- The End of Hope's Peak Academy Side- Despair   (2016) User Score  Play Trailer Overview Hope's Peak Academy is a special school, recognized by the government, that was established in order to gather and nurture top-class students who excel in various fields. This school has two courses: The main course, and the preparatory course. Anyone with the money can enter the preparatory course, even if they don't have any special skills. The 77th class of the main course is filled with students who not only have unique abilities, but unique personalities as well. However, the students learned that \"Talent isn't the most important thing in life; it's to involve yourself with people and make yourself a better person while making memories.\" However, little did they know that a mysterious project and discrimination of the courses were happening right under their noses. Hajime Hinata, a boy from the preparatory class who craves for an ability. The fateful meeting he has drives the future of the school into an unimaginable direction. This is the story of what happened up until the \"The Biggest, Most Awful, Most Tragic Event in Human History.\" This is a story of hope that ends in despair. Featured Crew Seiji Kishi Creator Fukuoka Motoo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megumi Ogata Nagito Komaeda (狛枝 凪斗) Megumi Toyoguchi Junko Enoshima (江ノ島 盾子) Kana Hanazawa Chiaki Nanami (七海 千秋) Minami Takayama Hajime Hinata (日向 創) Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Danganronpa 3- The End of Hope's Peak Academy Side- Despair premiered on July 14, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Danganronpa 3- The End of Hope's Peak Academy Side- Despair. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Crime Mystery Keywords animation Content Score 100 Yes! Looking good! Top Contributors 21 iliass guendouz 15 Jenazad 7 ioneakatzuki 6 theramyz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}