{"link": "https://www.themoviedb.org/tv/57790?language=en", "title": "Passionate Love", "resume": "Passionate Love is an upcoming South Korean weekend television drama series starring Sung Hoon and Choi Yoon-young. It is set to premiere on SBS on September 28, 2013, airing every Saturday and Sunday at 20:45 for 50 episodes.", "rate": 0, "genre": ["Drama", "Romance"], "cast": ["Sung Hoon", "Lee Won-keun", "Choi Yoon-young", "Jun Kwang-ryul", "Lee Han-wi"], "character": ["Kang Moo-yeol", "Kang Moo-yeol (young)", "Han Yoo-jung", "Kang Moon-do", "Ban Soo-bong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57790   Expand Passionate Love   (2013) User Score Overview Passionate Love is an upcoming South Korean weekend television drama series starring Sung Hoon and Choi Yoon-young. It is set to premiere on SBS on September 28, 2013, airing every Saturday and Sunday at 20:45 for 50 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sung Hoon Kang Moo-yeol Lee Won-keun Kang Moo-yeol (young) Choi Yoon-young Han Yoo-jung Jun Kwang-ryul Kang Moon-do Lee Han-wi Ban Soo-bong Full Cast & Crew Last Season Season 1 2013 | 47 Episodes Season 1 of Passionate Love premiered on September 28, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Passionate Love. You can help by rating TV shows you've seen. Facts Original Name  열애 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://tv.sbs.co.kr/hotlove/ Genres Drama Romance Keywords korea Content Score 71 Just a little bit more... Top Contributors t 25 tmdb38202327 M 9 Maria180493 S 1 Siyra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}