{"link": "https://www.themoviedb.org/tv/1059?language=en", "title": "T. J. Hooker", "resume": "T. J. Hooker is an American police drama television program starring William Shatner in the title role as a 15-year veteran police sergeant. The series premiered as a mid-season replacement on March 13, 1982, on ABC and ran on the network until May 4, 1985. The show was then picked up for a further single season by CBS.\nThe supporting cast includes Adrian Zmed as rookie Officer Vince Romano, Heather Locklear as rookie Officer Stacy Sheridan, and Richard Herd as Captain Dennis Sheridan as personnel in the fictional \"LCPD\" Police Department Academy Precinct. Towards the end of the show's second season, James Darren became a regular cast member as Officer Jim Corrigan.\nThe series was created by Rick Husky, who later went on to serve as executive producer of Walker Texas Ranger, and produced by Aaron Spelling and Leonard Goldberg.", "rate": 64, "genre": ["Drama"], "cast": ["William Shatner", "Adrian Zmed", "Heather Locklear", "James Darren", "April Clough"], "character": ["Sgt TJ Hooker", "Officer Vince Romano", "Officer Stacy Sheridan", "Officer Jim Corrigan", "Officer Vicki Taylor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1059   Expand T. J. Hooker   (1982) User Score Overview T. J. Hooker is an American police drama television program starring William Shatner in the title role as a 15-year veteran police sergeant. The series premiered as a mid-season replacement on March 13, 1982, on ABC and ran on the network until May 4, 1985. The show was then picked up for a further single season by CBS. The supporting cast includes Adrian Zmed as rookie Officer Vince Romano, Heather Locklear as rookie Officer Stacy Sheridan, and Richard Herd as Captain Dennis Sheridan as personnel in the fictional \"LCPD\" Police Department Academy Precinct. Towards the end of the show's second season, James Darren became a regular cast member as Officer Jim Corrigan. The series was created by Rick Husky, who later went on to serve as executive producer of Walker Texas Ranger, and produced by Aaron Spelling and Leonard Goldberg. Featured Crew Aaron Spelling Creator Rick Husky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast William Shatner Sgt TJ Hooker Adrian Zmed Officer Vince Romano Heather Locklear Officer Stacy Sheridan James Darren Officer Jim Corrigan April Clough Officer Vicki Taylor Full Cast & Crew Last Season Season 5 1985 | 19 Episodes Season 5 of T. J. Hooker premiered on September 25, 1985. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply shatner Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1983-09-18 Hardcastle and McCormick 6.1    1984-09-18 Hunter 7.1    1979-09-20 Buck Rogers in the 25th Century 6.9    1981-11-24 Simon & Simon 6.6    1982-09-26 Matt Houston 6.6    1976-09-21 Baa Baa Black Sheep 7.3    1978-11-03 Diff'rent Strokes 5.7    1973-09-25 Police Story 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords police rookie cop police precinct cop drama Content Score 93 Almost there... Top Contributors d 17 denis 16 Banana 6 Stan Smith 6 October Rust  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}