{"link": "https://www.themoviedb.org/tv/46560?language=en", "title": "The Lucifer", "resume": "A string of murders brings together a conflicted detective, a psychic librarian, and a mysterious prosecutor with dubious motives in this action thriller starring Uhm Tae Woong, Joo Ji Hoon, and Shin Min Ah. Detective Kang Oh Soo is assigned to two seemingly unrelated murder cases, where the only clues left behind are tarot cards. He is lead to Seo Hae In, a quiet librarian who has the ability to make a psychic connection to an object to discover its history. She reveals to him that the victims were connected to the death of a high school boy years ago. The one common link between the suspects is their defense attorney, Oh Seung Ha, a young lawyer with questionable motives. Find out how everything is more connected than you think in this suspenseful thriller.\nThe series is the second installment of the revenge trilogy by director Park Chan-hong and writer Kim Ji-woo, after Resurrection in 2005 and followed by Shark in 2013.", "rate": 80, "genre": ["Drama", "Mystery", "Romance"], "cast": ["Uhm Tae-woong", "Ju Ji-hoon", "Shin Min-A", "Kwak Jung-wook", "Seo Jun-young"], "character": ["Kang Oh-soo", "Oh Seung-ha", "Seo Hae-in", "Tae-seung (young)", "Kang Oh-soo (young)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46560   Expand The Lucifer   (2007) User Score  Play Trailer Overview A string of murders brings together a conflicted detective, a psychic librarian, and a mysterious prosecutor with dubious motives in this action thriller starring Uhm Tae Woong, Joo Ji Hoon, and Shin Min Ah. Detective Kang Oh Soo is assigned to two seemingly unrelated murder cases, where the only clues left behind are tarot cards. He is lead to Seo Hae In, a quiet librarian who has the ability to make a psychic connection to an object to discover its history. She reveals to him that the victims were connected to the death of a high school boy years ago. The one common link between the suspects is their defense attorney, Oh Seung Ha, a young lawyer with questionable motives. Find out how everything is more connected than you think in this suspenseful thriller. The series is the second installment of the revenge trilogy by director Park Chan-hong and writer Kim Ji-woo, after Resurrection in 2005 and followed by Shark in 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Uhm Tae-woong Kang Oh-soo Ju Ji-hoon Oh Seung-ha Shin Min-A Seo Hae-in Kwak Jung-wook Tae-seung (young) Seo Jun-young Kang Oh-soo (young) Full Cast & Crew Last Season Season 1 2007 | 20 Episodes Season 1 of The Lucifer premiered on March 21, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Lucifer. You can help by rating TV shows you've seen. Facts Original Name  마왕 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/devil/ Genres Drama Mystery Romance Keywords korea Content Score 93 Almost there... Top Contributors M 40 Maria180493 t 6 tmdb38202327 N 3 Nosirus TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}