{"link": "https://www.themoviedb.org/tv/57290?language=en", "title": "This is it", "resume": "This Is It was a planned series of fifty concerts by Michael Jackson to be held at The O2 Arena in London. They were scheduled to begin in July 2009 and continue through to March 2010. However, with all concerts sold out, Jackson died less than three weeks before the first concert date. Jackson officially announced the concerts at a press conference held inside The O2 Arena stated that This Is It was going to be his final series of concerts. AEG Live, the concert promoters, released a promotional video that took up an entire commercial break, setting a record for ITV. The shows were to be Jackson's first major series of concerts since the HIStory World Tour finished in 1997, and had been cited as one of the year's most important musical events. Randy Phillips, president and chief executive of AEG Live, stated that the first 10 dates alone would have earned the singer approximately £50 million.\nOriginally only 10 concerts were announced, but the tickets were sold out in less than an hour and the public demand for tickets resulted in 40 more concerts being added, making 50 in total. Ticket sales broke several records and AEG Live stated that Jackson could have sold more dates. Jackson's album sales increased following the announcement. In preparation for the concert series, the pop singer had been collaborating with numerous high profile figures, such as fashion designer Christian Audigier, choreographer Kenny Ortega and bodybuilder Lou Ferrigno. Prior to Jackson's death, Allgood Entertainment sued the entertainer for $40 million, claiming that he had breached an exclusivity agreement with them by agreeing to the This Is It concerts. The case was later dismissed.\nIn light of Jackson's death, AEG Live offered either full refunds to all ticket holders or a special souvenir ticket designed by the entertainer. The cancelled shows, the record-breaking ticket sales [1][2][3] and the potential for a world tour,[4][5] made Jackson's shows \"the greatest concert[s] that never happened.\"[6][7] Columbia Pictures acquired the footage of the show rehearsals and made a concert film titled Michael Jackson's This Is It. The Jackson estate received 90% of the profit made while the remaining 10% went to AEG Live. Columbia Pictures guaranteed at least $60 million for the rights. To coincide with the release of the concert footage, an accompanying album was released.", "rate": 80, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57290   Expand This is it User Score Overview This Is It was a planned series of fifty concerts by Michael Jackson to be held at The O2 Arena in London. They were scheduled to begin in July 2009 and continue through to March 2010. However, with all concerts sold out, Jackson died less than three weeks before the first concert date. Jackson officially announced the concerts at a press conference held inside The O2 Arena stated that This Is It was going to be his final series of concerts. AEG Live, the concert promoters, released a promotional video that took up an entire commercial break, setting a record for ITV. The shows were to be Jackson's first major series of concerts since the HIStory World Tour finished in 1997, and had been cited as one of the year's most important musical events. Randy Phillips, president and chief executive of AEG Live, stated that the first 10 dates alone would have earned the singer approximately £50 million. Originally only 10 concerts were announced, but the tickets were sold out in less than an hour and the public demand for tickets resulted in 40 more concerts being added, making 50 in total. Ticket sales broke several records and AEG Live stated that Jackson could have sold more dates. Jackson's album sales increased following the announcement. In preparation for the concert series, the pop singer had been collaborating with numerous high profile figures, such as fashion designer Christian Audigier, choreographer Kenny Ortega and bodybuilder Lou Ferrigno. Prior to Jackson's death, Allgood Entertainment sued the entertainer for $40 million, claiming that he had breached an exclusivity agreement with them by agreeing to the This Is It concerts. The case was later dismissed. In light of Jackson's death, AEG Live offered either full refunds to all ticket holders or a special souvenir ticket designed by the entertainer. The cancelled shows, the record-breaking ticket sales [1][2][3] and the potential for a world tour,[4][5] made Jackson's shows \"the greatest concert[s] that never happened.\"[6][7] Columbia Pictures acquired the footage of the show rehearsals and made a concert film titled Michael Jackson's This Is It. The Jackson estate received 90% of the profit made while the remaining 10% went to AEG Live. Columbia Pictures guaranteed at least $60 million for the rights. To coincide with the release of the concert footage, an accompanying album was released. Featured Crew Michael Jackson Creator Kenny Ortega Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Networks - Certification  - Type  Documentary Original Language  English Runtime  - Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors d 8 daltimor j 2 jinko k 2 kyrsos 1 elmark80  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}