{"link": "https://www.themoviedb.org/tv/10518?language=en", "title": "Clue Club", "resume": "Clue Club is a 30-minute Saturday morning animated series produced by Hanna-Barbera Productions from August 14, 1976 to September 3, 1977 on CBS.\nClue Club only had one season’s worth of first-run episodes produced, which were shown on Saturday mornings on CBS.\nIn the fall of 1977, cut-down versions of the half-hour episodes of Clue Club appeared under the new title Woofer & Wimper, Dog Detectives to showcase the show's basset and bloodhound which aired as a segment on the CBS Saturday morning package program The Skatebirds from September 10, 1977 to January 28, 1978.\nWhen The Skatebirds was cancelled in early 1978, Woofer & Wimper, Dog Detectives re-appeared as a segment alongside The Robonic Stooges on their half-hour show, also on CBS. The full-length versions of Clue Club returned to CBS on Sunday mornings from September 1978 to September 1979, concluding the show’s original network run.\nAfter a mid-1980s revival on USA Cartoon Express, it has since resurfaced on Cartoon Network and Boomerang.", "rate": 30, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Bob Hastings", "Paul Winchell", "John Stephenson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10518   Expand Clue Club   (1976) User Score Overview Clue Club is a 30-minute Saturday morning animated series produced by Hanna-Barbera Productions from August 14, 1976 to September 3, 1977 on CBS. Clue Club only had one season’s worth of first-run episodes produced, which were shown on Saturday mornings on CBS. In the fall of 1977, cut-down versions of the half-hour episodes of Clue Club appeared under the new title Woofer & Wimper, Dog Detectives to showcase the show's basset and bloodhound which aired as a segment on the CBS Saturday morning package program The Skatebirds from September 10, 1977 to January 28, 1978. When The Skatebirds was cancelled in early 1978, Woofer & Wimper, Dog Detectives re-appeared as a segment alongside The Robonic Stooges on their half-hour show, also on CBS. The full-length versions of Clue Club returned to CBS on Sunday mornings from September 1978 to September 1979, concluding the show’s original network run. After a mid-1980s revival on USA Cartoon Express, it has since resurfaced on Cartoon Network and Boomerang. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Hastings Paul Winchell John Stephenson Full Cast & Crew Last Season Season 1 1976 | 16 Episodes Season 1 of Clue Club premiered on August 13, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Clue Club. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 10m Homepage  - Genres Animation Action & Adventure Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors r 9 rinaldovianna 1 Elizabeth Jennings 1 Banana 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}