{"link": "https://www.themoviedb.org/tv/57287?language=en", "title": "Code:Breaker", "resume": "Sakurakouji Sakura is a girl who appears modest and graceful but in reality is skilled in martial arts. After witnessing a boy burning people with his blue flame, she is startled to see that the same boy is a transfer student, Oogami Rei. Oogami is a Code Breaker, one who does not exist. He is a seemingly cold-blooded killer who follows the principle of an eye for an eye, to use evil against evil. Convinced that killing is not right, Sakurakouji sets out to stop him and penetrate his icy heart.", "rate": 68, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Youko Hikasa", "Nobuhiko Okamoto", "Kenichi Suzumura", "Shin'ichirou Miki", "Toshiyuki Toyonaga"], "character": ["Sakura Sakurakoji (voice)", "Rei Ogami (voice)", "Toki Fujiwara (voice)", "Hitomi (voice)", "Yuuki Tenpouin (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57287   Expand Code:Breaker   (2012) User Score Overview Sakurakouji Sakura is a girl who appears modest and graceful but in reality is skilled in martial arts. After witnessing a boy burning people with his blue flame, she is startled to see that the same boy is a transfer student, Oogami Rei. Oogami is a Code Breaker, one who does not exist. He is a seemingly cold-blooded killer who follows the principle of an eye for an eye, to use evil against evil. Convinced that killing is not right, Sakurakouji sets out to stop him and penetrate his icy heart. Featured Crew Irie Yasuhiro Creator Akimine Kamijyo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Youko Hikasa Sakura Sakurakoji (voice) Nobuhiko Okamoto Rei Ogami (voice) Kenichi Suzumura Toki Fujiwara (voice) Shin'ichirou Miki Hitomi (voice) Toshiyuki Toyonaga Yuuki Tenpouin (voice) Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Code:Breaker premiered on October  7, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   2014-04-08 Black Bullet 6.8    2012-10-04 BTOOOM! 6.3    2013-04-05 My Teen Romantic Comedy SNAFU 7.4    2015-07-05 Charlotte 6.8    2007-07-05 Higurashi When They Cry 7.6    2014-07-06 Akame ga Kill! 7.0    2015-04-04 Is It Wrong to Try to Pick Up Girls in a Dungeon? 6.9    2007-04-06 Darker than Black 7.7  Facts Original Name  コード: ブレイカー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.code-breaker.jp/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords crime anime Content Score 93 Almost there... Top Contributors 36 CrewMdk 17 TheDerpMan w 7 whitetigerx8 4 kazuza  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}