{"link": "https://www.themoviedb.org/tv/73590?language=en", "title": "The Poison Tree", "resume": "Karen Clarke was an ordinary girl thrown into an extraordinary world, as she first meets the glamorous Biba and her brother Rex in one long summer of love, but quickly becomes tangled up in their tragic family history with the romantic idyll turning into a nightmare – one that haunts her to the present day. She will go to extraordinary lengths to protect her family and the secrets that she keeps from them.", "rate": 70, "genre": [], "cast": ["Hebe Johnson", "Neil McKinven", "Lex Shrapnel", "Patrick Baladi", "Naomi Bentley"], "character": ["Alice Clarke", "Sean Hennessy", "Lenny", "Francis", "Dawn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73590   Expand The Poison Tree   (2012) User Score  Play Trailer Overview Karen Clarke was an ordinary girl thrown into an extraordinary world, as she first meets the glamorous Biba and her brother Rex in one long summer of love, but quickly becomes tangled up in their tragic family history with the romantic idyll turning into a nightmare – one that haunts her to the present day. She will go to extraordinary lengths to protect her family and the secrets that she keeps from them. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hebe Johnson Alice Clarke Neil McKinven Sean Hennessy Lex Shrapnel Lenny Patrick Baladi Francis Naomi Bentley Dawn Full Cast & Crew Last Season Season 1 2012 | 2 Episodes Season 1 of The Poison Tree premiered on December 10, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Poison Tree. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.itv.com/itvplayer/the-poison-tree Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 19 TMDb Bot 19 Banana l 8 lucybenson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}