{"link": "https://www.themoviedb.org/tv/38122?language=en", "title": "Mysteries at the Museum", "resume": "Museums are where America displays its wondrous treasures of the past -- often strange and curious remnants of the momentous events that have shaped our history. Behind each artifact is yet another story to be told and secrets to be revealed -- tales brimming with scandal, mystery, murder and intrigue. Whether a diary from an Arctic exploration, a stone giant thought to be the remnant of a race of enormous people or a futuristic house that almost changed the world, iconic museum artifacts help us uncover who we are and what we've become. Each hour of this series will take viewers on a captivating, revealing and at times shocking tour of America's past, revisiting its most crucial events by reexamining what has been left behind. The series casts its net wide, exploring the corners and backrooms of institutions dedicated to a variety of popular and entertaining subjects -- invisible spies, cold-blooded assassins, dinosaurs, the paranormal, the Old West, the Cold War and more. We'll tackle some of history's most enduring mysteries -- both familiar tales and little-known episodes that have never been told before on television.", "rate": 88, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38122   Expand Mysteries at the Museum   (2010) User Score Overview Museums are where America displays its wondrous treasures of the past -- often strange and curious remnants of the momentous events that have shaped our history. Behind each artifact is yet another story to be told and secrets to be revealed -- tales brimming with scandal, mystery, murder and intrigue. Whether a diary from an Arctic exploration, a stone giant thought to be the remnant of a race of enormous people or a futuristic house that almost changed the world, iconic museum artifacts help us uncover who we are and what we've become. Each hour of this series will take viewers on a captivating, revealing and at times shocking tour of America's past, revisiting its most crucial events by reexamining what has been left behind. The series casts its net wide, exploring the corners and backrooms of institutions dedicated to a variety of popular and entertaining subjects -- invisible spies, cold-blooded assassins, dinosaurs, the paranormal, the Old West, the Cold War and more. We'll tackle some of history's most enduring mysteries -- both familiar tales and little-known episodes that have never been told before on television. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 18 2018 | 13 Episodes Season 18 of Mysteries at the Museum premiered on February  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2015-01-08 Expedition Unknown 7.8  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.travelchannel.com/shows/mysteries-at-the-museum Genres Documentary Keywords museum mystery Content Score 56 We're so close, yet so far. Top Contributors 29 Elizabeth Jennings 15 AAA - Tripple A PE 10 Patrick E. Abe TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}