{"link": "https://www.themoviedb.org/tv/56499?language=en", "title": "Attention Please", "resume": "Yoko, a sort of modern tomboy, almost by chance gets her sights set stubbornly on becoming a Cabin Attendant (CA), a type of woman the men are all fond of, but a role which is completely out of character for her. (This is a drama about young people including a girl who wishes to work on the stage of big sky) The headstrong Yoko Misaki (Aya Ueto) is a boyish girl who loves rock’n roll but hates dishonesty and has never once worn high heels. A chance comment by one of her friends causes her to aim for the job of a cabin attendant on an airline, which is completely out of character. Although she also feels the work is not up her alley, Yoko starts to prepare for the entrance examination with vigor, exhibiting her inborn never-say-die spirit and miraculously passing the examination. Naively assuming that she would immediately become a cabin attendant upon passing the test, Yoko of course has stiff training awaiting her.", "rate": 85, "genre": ["Comedy", "Drama"], "cast": ["Aya Ueto", "Miki Maya", "Saki Aibu", "Chihiro Otsuka", "Misa Uehara"], "character": ["Yoko Misaki", "Tamaki Mikami", "Wakamura Yayoi", "Yuki Sekiyama", "Saori Hirota"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56499   Expand Attention Please   (2006) User Score Overview Yoko, a sort of modern tomboy, almost by chance gets her sights set stubbornly on becoming a Cabin Attendant (CA), a type of woman the men are all fond of, but a role which is completely out of character for her. (This is a drama about young people including a girl who wishes to work on the stage of big sky) The headstrong Yoko Misaki (Aya Ueto) is a boyish girl who loves rock’n roll but hates dishonesty and has never once worn high heels. A chance comment by one of her friends causes her to aim for the job of a cabin attendant on an airline, which is completely out of character. Although she also feels the work is not up her alley, Yoko starts to prepare for the entrance examination with vigor, exhibiting her inborn never-say-die spirit and miraculously passing the examination. Naively assuming that she would immediately become a cabin attendant upon passing the test, Yoko of course has stiff training awaiting her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aya Ueto Yoko Misaki Miki Maya Tamaki Mikami Saki Aibu Wakamura Yayoi Chihiro Otsuka Yuki Sekiyama Misa Uehara Saori Hirota Full Cast & Crew Last Season Season 1 2006 | 11 Episodes Season 1 of Attention Please premiered on April 18, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Attention Please. You can help by rating TV shows you've seen. Facts Original Name  アテンションプリーズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 29 Aka75 11 CrewMdk s 4 ssdrtran k 2 kiki78  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}