{"link": "https://www.themoviedb.org/tv/3707?language=en", "title": "Dr. Zitbag's Transylvania Pet Shop", "resume": "Dr. Zitbag's Transylvania Pet Shop was an animated television series created by Tony Barnes and produced by PMMP. The show originally aired on TF1 and it was later dubbed for English audiences as well; even the show's title got a name change. It aired in the United Kingdom on ITV; starting June 16, 1994 and finishing August 27, 1998, the show ran for five seasons. The show also aired on Bulgarian National Television from 1997 until 2000, and became very popular.\nA comic strip version of the show was included in Buster magazine from September 1994 to November 1996. The series was later repeated on Nickelodeon in the early 2000s until 2004, and had sporadic reruns on ordinary TV from 1999 until 2001.", "rate": 70, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3707   Expand Dr. Zitbag's Transylvania Pet Shop User Score Overview Dr. Zitbag's Transylvania Pet Shop was an animated television series created by Tony Barnes and produced by PMMP. The show originally aired on TF1 and it was later dubbed for English audiences as well; even the show's title got a name change. It aired in the United Kingdom on ITV; starting June 16, 1994 and finishing August 27, 1998, the show ran for five seasons. The show also aired on Bulgarian National Television from 1997 until 2000, and became very popular. A comic strip version of the show was included in Buster magazine from September 1994 to November 1996. The series was later repeated on Nickelodeon in the early 2000s until 2004, and had sporadic reruns on ordinary TV from 1999 until 2001. Featured Crew Tony Barnes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Original Name  Dr. Globule Status  Ended Networks - Certification  - Type  Scripted Original Language  French Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 7 Elizabeth Jennings 7 Sergiojamon 5 Rocketeer Raccoon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}