{"link": "https://www.themoviedb.org/tv/16814?language=en", "title": "Cadillacs and Dinosaurs", "resume": "Cadillacs and Dinosaurs is an American Saturday morning animated television series which aired on CBS Kids in the United States from 1993 to 1994. Based on the comic book of the same name by Mark Schultz, the show was created by screenwriter Steven E. de Souza, who acquired the TV rights after producing the video game Cadillacs and Dinosaurs, which was also based on Schultz's comic.\nThe show dealt with many strong ecologicial and political issues that were central to the plot development. One major focus was the question of how the dinosaurs managed to re-emerge after they were thought to be extinct.\nIn total, Cadillacs and Dinosaurs lasted for one season of 13 episodes and was never considered for renewal.\nAll 13 episodes currently air on HBO Family in Latin America, and have continually done so for many years. They can be viewed dubbed in Spanish or in their original English. The show is also available in the US through the online retailer Amazon by their direct download service.", "rate": 50, "genre": ["Family", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Susan Roman", "Colin O'Meara", "David Fox", "Dawn Greenhalgh", "Don Dickinson"], "character": ["Hannah Dundee (voice)", "Wrench (voice)", "Kirgo (voice)", "Scharnhorst (voice)", "Noe (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16814   Expand Cadillacs and Dinosaurs   (1993) User Score Overview Cadillacs and Dinosaurs is an American Saturday morning animated television series which aired on CBS Kids in the United States from 1993 to 1994. Based on the comic book of the same name by Mark Schultz, the show was created by screenwriter Steven E. de Souza, who acquired the TV rights after producing the video game Cadillacs and Dinosaurs, which was also based on Schultz's comic. The show dealt with many strong ecologicial and political issues that were central to the plot development. One major focus was the question of how the dinosaurs managed to re-emerge after they were thought to be extinct. In total, Cadillacs and Dinosaurs lasted for one season of 13 episodes and was never considered for renewal. All 13 episodes currently air on HBO Family in Latin America, and have continually done so for many years. They can be viewed dubbed in Spanish or in their original English. The show is also available in the US through the online retailer Amazon by their direct download service. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Susan Roman Hannah Dundee (voice) Colin O'Meara Wrench (voice) David Fox Kirgo (voice) Dawn Greenhalgh Scharnhorst (voice) Don Dickinson Noe (voice) Full Cast & Crew Last Season Season 1 1993 | 13 Episodes Season 1 of Cadillacs and Dinosaurs premiered on September 18, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cadillacs and Dinosaurs. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Animation Sci-Fi & Fantasy Keywords future post-apocalyptic based on comic dinosaur Content Score 86 Almost there... Top Contributors 22 Banana NS 4 Norte Serra U 2 Uilio  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}