{"link": "https://www.themoviedb.org/tv/32954?language=en", "title": "Sci Fi Science: Physics of the Impossible", "resume": "Sci Fi Science: Physics of the Impossible is an American documentary television series on Science which first aired in the United States on December 1, 2009. The series is hosted by theoretical physicist Michio Kaku and is based on his book Physics of the Impossible. In each episode, Dr. Kaku addresses a technological concept from science fiction and designs his own theoretical version of the technology using currently-known science. He also visits scientists developing technology related to the episode's concept.", "rate": 80, "genre": ["Documentary"], "cast": ["Michio Kaku"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32954   Expand Sci Fi Science: Physics of the Impossible   (2009) User Score Overview Sci Fi Science: Physics of the Impossible is an American documentary television series on Science which first aired in the United States on December 1, 2009. The series is hosted by theoretical physicist Michio Kaku and is based on his book Physics of the Impossible. In each episode, Dr. Kaku addresses a technological concept from science fiction and designs his own theoretical version of the technology using currently-known science. He also visits scientists developing technology related to the episode's concept. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michio Kaku Full Cast & Crew Last Season Sci-fi science: physics of the impossible season 3 2013 | 1 Episode Season 3 of Sci Fi Science: Physics of the Impossible premiered on July 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sci Fi Science: Physics of the Impossible. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.science.discovery.com/videos/sci-fi-science-videos/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors a 4 alexcel R 3 Rabbit TB 3 TMDb Bot 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}