{"link": "https://www.themoviedb.org/tv/79371?language=en", "title": "The Adventures of Rocky and Bullwinkle", "resume": "The world-famous talking moose and flying squirrel are back in The Adventures of Rocky and Bullwinkle, a comedy about two goofball friends who end up in harrowing situations but end up saving the day time and again. As their silly ambitions dovetail with Fearless Leader's sinister plans to take over the world, they are set on a collision course with his notorious super spies Boris and Natasha.", "rate": 0, "genre": ["Animation", "Comedy", "Family"], "cast": ["Tara Strong", "Brad Norman", "Rachel Butera", "Ben Diskin"], "character": ["Rocky (voice)", "Bullwinkle (voice)", "Natasha (voice)", "Boris (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79371   Expand The Adventures of Rocky and Bullwinkle   (2018) User Score  Play Trailer Overview The world-famous talking moose and flying squirrel are back in The Adventures of Rocky and Bullwinkle, a comedy about two goofball friends who end up in harrowing situations but end up saving the day time and again. As their silly ambitions dovetail with Fearless Leader's sinister plans to take over the world, they are set on a collision course with his notorious super spies Boris and Natasha. Featured Crew Marco Schnabel Creator Scott Fellows Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tara Strong Rocky (voice) Brad Norman Bullwinkle (voice) Rachel Butera Natasha (voice) Ben Diskin Boris (voice) Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of The Adventures of Rocky and Bullwinkle premiered on May 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of Rocky and Bullwinkle. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  30m Homepage   https://www.amazon.com/dp/B07C572F39 Genres Animation Comedy Family Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 32 Elizabeth Jennings 13 TopKek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}