{"link": "https://www.themoviedb.org/tv/56242?language=en", "title": "Ring of Fire", "resume": "When an oil rig causes an eruption in a small town, it's just the first in a series that could affect the dangerous Ring of Fire that contains most of the world's volcanoes. If these cataclysmic eruptions cannot be stopped, the Earth could be headed for an extinction level event.", "rate": 59, "genre": [], "cast": ["Ian Tracey", "Brian Markinson", "Michael Vartan", "Lauren Lee Smith", "Terry O'Quinn"], "character": ["Hector Janen", "Harry Stromwell", "Dr Matthew Cooper", "Emily Booth", "Oliver Booth"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56242   Expand Ring of Fire   (2012) User Score  Play Trailer Overview When an oil rig causes an eruption in a small town, it's just the first in a series that could affect the dangerous Ring of Fire that contains most of the world's volcanoes. If these cataclysmic eruptions cannot be stopped, the Earth could be headed for an extinction level event. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian Tracey Hector Janen Brian Markinson Harry Stromwell Michael Vartan Dr Matthew Cooper Lauren Lee Smith Emily Booth Terry O'Quinn Oliver Booth Full Cast & Crew Last Season Miniseries 2012 | 2 Episodes Season 1 of Ring of Fire premiered on December 21, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  5 Recommendations   2013-04-15 Eve of Destruction 4.5    2007-01-10 Killer Wave 5.7    2004-05-02 10.5 6.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://reelz.com/ringoffire Genres No genres have been added. Keywords miniseries Content Score 86 Almost there... Top Contributors TB 33 TMDb Bot 12 Banana t 9 tmdb45070722 R 7 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}