{"link": "https://www.themoviedb.org/tv/51968?language=en", "title": "Great Bear Stakeout", "resume": "Deep in Alaska an expert team of film-makers follow the astonishing lives of grizzly bears.", "rate": 0, "genre": ["Documentary"], "cast": ["Billy Connolly"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51968   Expand Great Bear Stakeout   (2013) User Score Overview Deep in Alaska an expert team of film-makers follow the astonishing lives of grizzly bears. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy Connolly Narrator Full Cast & Crew Last Season Season 1 2013 | 2 Episodes Season 1 of Great Bear Stakeout premiered on April 24, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Great Bear Stakeout. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p0176qj5 Genres Documentary Keywords nature bears Content Score 56 We're so close, yet so far. Top Contributors 35 Elizabeth Jennings q 6 qubes TB 2 TMDb Bot g 1 ghost195  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}