{"link": "https://www.themoviedb.org/tv/74764?language=en", "title": "Tabula Rasa", "resume": "A psychological thriller about Mie, a young woman with amnesia who is locked up in a secure psychiatric hospital. Mie is visited by Detective Inspector Wolkers who claims she was the last person seen with the vanished Thomas Spectre. As a witness and prime suspect, she appears to be the sole key to this mysterious disappearance. In order to solve the puzzle and find Thomas, Mie has to reconstruct her lost memories and find her way back through the dark labyrinth of her recent past.", "rate": 78, "genre": ["Drama"], "cast": ["Gène Bervoets", "Veerle Baetens", "Stijn Van Opstal", "Hilde Van Mieghem", "François Beukelaers"], "character": ["Inspecteur Wolkers", "Annemie D'Haeze", "Benoit", "Rita", "Walter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74764   Expand Tabula Rasa   (2017) User Score  Play Trailer Overview A psychological thriller about Mie, a young woman with amnesia who is locked up in a secure psychiatric hospital. Mie is visited by Detective Inspector Wolkers who claims she was the last person seen with the vanished Thomas Spectre. As a witness and prime suspect, she appears to be the sole key to this mysterious disappearance. In order to solve the puzzle and find Thomas, Mie has to reconstruct her lost memories and find her way back through the dark labyrinth of her recent past. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gène Bervoets Inspecteur Wolkers Veerle Baetens Annemie D'Haeze Stijn Van Opstal Benoit Hilde Van Mieghem Rita François Beukelaers Walter Full Cast & Crew Current Season Season 1 2017 | 9 Episodes Season 1 of Tabula Rasa premiered on October 29, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  13 Posters  5 Recommendations   2017-11-02 Borderliner 6.7    2018-03-26 The Chalet 7.3    2018-05-10 Safe 7.1    2018-02-23 Seven Seconds 8.2    2018-02-02 Requiem 6.4    2018-05-04 The Rain 6.1    2018-01-22 The Alienist 7.1    2015-12-27 Trapped 7.6  Facts Status  Ended Networks Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Spanish; Castilian Runtime  50m Homepage   https://www.een.be/tabula-rasa Genres Drama Keywords psychological thriller Content Score 93 Almost there... Top Contributors 58 Maretoh 13 mojodo TB 7 TMDb Bot d 6 djgueto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}