{"link": "https://www.themoviedb.org/tv/9680?language=en", "title": "Heavy: The Story of Metal", "resume": "Heavy: The Story of Metal is a four-part documentary special that aired on VH1 in 2006.\nThe series focuses on the origins, subgenres, and the bands of heavy metal music, paying close attention to influential bands like Black Sabbath, Led Zeppelin, Judas Priest, and Iron Maiden, who helped to define heavy metal in its early years. Other bands on the program include, Alice Cooper, Kiss, AC/DC, Van Halen, Def Leppard, Quiet Riot, Mötley Crüe, Megadeth, Metallica, Anthrax, Guns N' Roses, and Marilyn Manson. However, the documentary notably passes over lower profile metal sub-genres such as death metal, black metal, doom metal, progressive metal, power metal and many others considered core elements of today's metal pantheon, focusing mostly on hard rock & traditional heavy metal. In Canada, the documentary aired on MuchMoreMusic and on C4 in New Zealand. It is not available on DVD or video.", "rate": 0, "genre": ["Documentary"], "cast": ["Glenn V. Hughes III", "Sebastian Bach", "Frankie Banali", "Geezer Butler", "Malcolm Dome"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9680   Expand Heavy: The Story of Metal   (2006) User Score Overview Heavy: The Story of Metal is a four-part documentary special that aired on VH1 in 2006. The series focuses on the origins, subgenres, and the bands of heavy metal music, paying close attention to influential bands like Black Sabbath, Led Zeppelin, Judas Priest, and Iron Maiden, who helped to define heavy metal in its early years. Other bands on the program include, Alice Cooper, Kiss, AC/DC, Van Halen, Def Leppard, Quiet Riot, Mötley Crüe, Megadeth, Metallica, Anthrax, Guns N' Roses, and Marilyn Manson. However, the documentary notably passes over lower profile metal sub-genres such as death metal, black metal, doom metal, progressive metal, power metal and many others considered core elements of today's metal pantheon, focusing mostly on hard rock & traditional heavy metal. In Canada, the documentary aired on MuchMoreMusic and on C4 in New Zealand. It is not available on DVD or video. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Glenn V. Hughes III Himself Sebastian Bach Himself Frankie Banali Himself Geezer Butler Himself Malcolm Dome Himself Full Cast & Crew Last Season Season 1 2006 | 4 Episodes Season 1 of Heavy: The Story of Metal premiered on May 22, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Heavy: The Story of Metal. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Heavy: The Story of Metal. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords heavy metal Content Score 86 Almost there... Top Contributors F 35 FartDetective z 20 zurman1 4 Banana h 1 huntwarlock  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}