{"link": "https://www.themoviedb.org/tv/63530?language=en", "title": "Mama", "resume": "Han Seung-hee is a successful painter and a happy single mother to her son, Geu-roo. But when she gets diagnosed with a terminal illness, Seung-hee becomes determined that Geu-roo will be adopted by a nice family after she's gone. So she seeks out her ex-boyfriend Moon Tae-joo, and ends up befriending Tae-joo's wife, Seo Ji-eun. Meanwhile, a much younger photographer Gu Ji-sub falls for Seung-hee.", "rate": 0, "genre": ["Drama", "Family", "Romance"], "cast": ["Song Yun-ah", "Hong Jong-hyun", "Jung Joon-ho", "Moon Jeong-hee", "Yoon Chan-young"], "character": ["Han Seung-hee", "Gu Ji-sub", "Moon Tae-joo", "Seo Ji-eun", "Han Geu-roo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63530   Expand Mama    (2014) User Score Overview Han Seung-hee is a successful painter and a happy single mother to her son, Geu-roo. But when she gets diagnosed with a terminal illness, Seung-hee becomes determined that Geu-roo will be adopted by a nice family after she's gone. So she seeks out her ex-boyfriend Moon Tae-joo, and ends up befriending Tae-joo's wife, Seo Ji-eun. Meanwhile, a much younger photographer Gu Ji-sub falls for Seung-hee. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Song Yun-ah Han Seung-hee Hong Jong-hyun Gu Ji-sub Jung Joon-ho Moon Tae-joo Moon Jeong-hee Seo Ji-eun Yoon Chan-young Han Geu-roo Full Cast & Crew Last Season Season 1 2014 | 24 Episodes Season 1 of Mama  premiered on August  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mama . You can help by rating TV shows you've seen. Facts Original Name  마마 - 세상 무서울 게 없는 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.imbc.com/broad/tv/drama/mama/ Genres Drama Family Romance Keywords korea Content Score 93 Almost there... Top Contributors t 38 tmdb38202327 M 2 Maria180493 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}