{"link": "https://www.themoviedb.org/tv/76627?language=en", "title": "The Super Slow Show", "resume": "YouTube stars The Slow Mo Guys test the latest in technology to reinvent the way we look at celebrities, music, pranks, comedy sketches and more, giving a one-of-a-kind glimpse into what the world looks like in slow motion.", "rate": 0, "genre": ["Comedy"], "cast": ["Gavin Free", "Dan Gruchy"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76627   Expand The Super Slow Show   (2018) User Score  Play Trailer Overview YouTube stars The Slow Mo Guys test the latest in technology to reinvent the way we look at celebrities, music, pranks, comedy sketches and more, giving a one-of-a-kind glimpse into what the world looks like in slow motion. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gavin Free Himself Dan Gruchy Himself Full Cast & Crew Current Season Season 1 2018 | 18 Episodes Season 1 of The Super Slow Show premiered on January 24, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Super Slow Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  5m Homepage   https://www.youtube.com/playlist?list=PLbIZ6k-SE9ShGEZ_wuvG3hatiC6jWJgVm Genres Comedy Keywords slow motion Content Score 64 We're so close, yet so far. Top Contributors 23 Mads 4 zhadow900 3 Elizabeth Jennings 1 Maretoh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}