{"link": "https://www.themoviedb.org/tv/45348?language=en", "title": "Appleseed XIII", "resume": "Appleseed XIII is a 2011 Japanese CGI anime adaptation of Masamune Shirow's science fiction manga series Appleseed. Composed of 13 episodes, the series retold the exploits of ES.W.A.T. member Deunan and her cyborg partner Briareos. The series was produced by Jinni's Animation Studios in association with Production I.G and under the direction of Takayuki Hamana with Junichi Fujisaku as script supervisor. All 13 episodes were compiled into two feature-length films. The first feature film titled Appleseed XIII: Tartaros was announced by Shochiku and released on June 13, 2011. The second film, Appleseed XIII: Ouranos was released on October 24, 2011.\nA North American release of the TV series will be out in June 2013.", "rate": 50, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Maaya Sakamoto", "Kouichi Yamadera", "Mikako Takahashi", "Sakiko Tamagawa", "Naomi Shindo"], "character": ["Deunan", "Briareos", "Hitomi", "Athena", "Deia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45348   Expand Appleseed XIII   (2011) User Score  Play Trailer Overview Appleseed XIII is a 2011 Japanese CGI anime adaptation of Masamune Shirow's science fiction manga series Appleseed. Composed of 13 episodes, the series retold the exploits of ES.W.A.T. member Deunan and her cyborg partner Briareos. The series was produced by Jinni's Animation Studios in association with Production I.G and under the direction of Takayuki Hamana with Junichi Fujisaku as script supervisor. All 13 episodes were compiled into two feature-length films. The first feature film titled Appleseed XIII: Tartaros was announced by Shochiku and released on June 13, 2011. The second film, Appleseed XIII: Ouranos was released on October 24, 2011. A North American release of the TV series will be out in June 2013. Featured Crew Masamune Shirow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maaya Sakamoto Deunan Kouichi Yamadera Briareos Mikako Takahashi Hitomi Sakiko Tamagawa Athena Naomi Shindo Deia Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Appleseed XIII premiered on July  6, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on Appleseed XIII. You can help by rating TV shows you've seen. Facts Original Name  アップルシードXIII Status  Ended Networks - Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Japanese Runtime  22m, 25m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 27 kappa-papa CM 16 Cherche Moi L 10 Loopioh D 6 Doramius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}