{"link": "https://www.themoviedb.org/tv/6188?language=en", "title": "A Family at War", "resume": "The Ashton family struggles to deal with the harsh realities of the Second World War as their sons are sent away to fight. Those who remain at home in Liverpool live in constant fear of a knock on the door with a telegram from the War Office or the Luftwaffe bombs overhead as they sleep at night.", "rate": 80, "genre": ["War", "Politics", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6188   Expand A Family at War   (1970) User Score Overview The Ashton family struggles to deal with the harsh realities of the Second World War as their sons are sent away to fight. Those who remain at home in Liverpool live in constant fear of a knock on the door with a telegram from the War Office or the Luftwaffe bombs overhead as they sleep at night. Featured Crew John Finch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 1971 | 20 Episodes Season 3 of A Family at War premiered on October  6, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Family at War. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres War & Politics Drama Keywords war world war ii Content Score 50 Still needs a little work. Top Contributors 13 Banana t 5 tmdb15589237 L 2 Leah  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}