{"link": "https://www.themoviedb.org/tv/2132?language=en", "title": "The Dick Van Dyke Show", "resume": "The Dick Van Dyke Show is an American television sitcom that initially aired on CBS from October 3, 1961, until June 1, 1966. The show was created by Carl Reiner and starred Dick Van Dyke, Rose Marie, Morey Amsterdam and Mary Tyler Moore. It centered around the work and home life of television comedy writer Rob Petrie. The show was produced by Reiner with Bill Persky and Sam Denoff. The music for the show's theme song was written by Earle Hagen.\nThe series won 15 Emmy Awards. In 1997, the episodes \"Coast-to-Coast Big Mouth\" and \"It May Look Like a Walnut\" were ranked at 8 and 15 respectively on TV Guide's 100 Greatest Episodes of All Time. In 2002, it was ranked at 13 on TV Guide's 50 Greatest TV Shows of All Time.", "rate": 84, "genre": ["Comedy"], "cast": ["Dick Van Dyke", "Mary Tyler Moore", "Rose Marie", "Morey Amsterdam", "Richard Deacon"], "character": ["Rob Petrie", "Laura Petrie", "Sally Rogers", "Buddy Sorrell", "Mel Cooley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2132   Expand The Dick Van Dyke Show   (1961) User Score  Play Trailer Overview The Dick Van Dyke Show is an American television sitcom that initially aired on CBS from October 3, 1961, until June 1, 1966. The show was created by Carl Reiner and starred Dick Van Dyke, Rose Marie, Morey Amsterdam and Mary Tyler Moore. It centered around the work and home life of television comedy writer Rob Petrie. The show was produced by Reiner with Bill Persky and Sam Denoff. The music for the show's theme song was written by Earle Hagen. The series won 15 Emmy Awards. In 1997, the episodes \"Coast-to-Coast Big Mouth\" and \"It May Look Like a Walnut\" were ranked at 8 and 15 respectively on TV Guide's 100 Greatest Episodes of All Time. In 2002, it was ranked at 13 on TV Guide's 50 Greatest TV Shows of All Time. Featured Crew Carl Reiner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dick Van Dyke Rob Petrie Mary Tyler Moore Laura Petrie Rose Marie Sally Rogers Morey Amsterdam Buddy Sorrell Richard Deacon Mel Cooley Full Cast & Crew Last Season Season 5 1965 | 32 Episodes Season 5 of The Dick Van Dyke Show premiered on September 15, 1965. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply The Lady and the Tiger and the Lawyer Open 0 by The Midi-chlorian Count\n      \n     w Mary Tyler Moore R.I.P. Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   1960-10-03 The Andy Griffith Show 7.4    1957-10-04 Leave It to Beaver 7.1    1960-09-29 My Three Sons 6.0    1967-09-11 The Carol Burnett Show 7.8    1965-09-15 Green Acres 6.9    1969-09-26 The Brady Bunch 6.5    1965-09-14 F Troop 6.4    1962-10-01 The Lucy Show 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords television writer sitcom Content Score 100 Yes! Looking good! Top Contributors 20 The Midi-chlorian Count 10 Banana 5 dzero 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}