{"link": "https://www.themoviedb.org/tv/651?language=en", "title": "60 Minutes", "resume": "America's popular television News magazine in which an ever changing team of CBS News correspondents contribute segments ranging from hard news coverage to politics to lifestyle and pop culture.", "rate": 77, "genre": ["News"], "cast": ["Byron Pitts", "Morley Safer", "Steve Kroft", "Lesley Stahl", "Andrew Rooney"], "character": ["Himself", "Himself", "Himself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 651   Expand 60 Minutes User Score  Play Trailer Overview America's popular television News magazine in which an ever changing team of CBS News correspondents contribute segments ranging from hard news coverage to politics to lifestyle and pop culture. Featured Crew Don Hewitt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Byron Pitts Himself Morley Safer Himself Steve Kroft Himself Lesley Stahl Herself Andrew Rooney Himself Full Cast & Crew Last Season Season 50 — | 2 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There is a cure for most Alzheimer's. Open 3 by  Banana Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Facts Status  Returning Series Network Certification  - Type  News Original Language  English Runtime  60m Homepage   http://www.cbsnews.com/60-minutes/ Genres News Keywords based on interviews magazine show Content Score 93 Almost there... Top Contributors 20 Wong T 17 Tanamur 9 Elizabeth Jennings 2 mgn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}