{"link": "https://www.themoviedb.org/tv/11986?language=en", "title": "Union Square", "resume": "Union Square is a 1997 television sitcom that was broadcast on NBC for one season. It follows the story of a lawyer-turned-playwright in New York City, who attempts to gain inspiration from a host of characters populating the fictitious Union Square cafe in Manhattan, obviously inspired by the New York area of the same name.\nThe show was originally supposed to be a vehicle for Cuban-American actress Mel Gorham. But after poor test screenings for the pilot, the producers decided to retool the show and replace Gorham with Constance Marie.\nThe program replaced Fired Up on NBC's \"Must See TV\" night of programming; it was given an 8:30pm timeslot on Thursday evenings, a highly coveted spot due to its location between popular sitcoms Friends and Seinfeld. Like The Single Guy, Union Square attempted to capitalize on attractive singles in their 20s and 30s enjoying New York City life, which both Seinfeld and Friends had turned into successes. The show also featured guest appearances from actor David Krumholtz, who appeared on two episodes, as did actress Rhea Perlman.", "rate": 0, "genre": ["Comedy"], "cast": ["Michael Landes", "Harriet Sansom Harris", "Jeffrey Anderson-Gunter", "Jim Pirri", "Constance Marie"], "character": ["Gabriella Diaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11986   Expand Union Square   (1997) User Score Overview Union Square is a 1997 television sitcom that was broadcast on NBC for one season. It follows the story of a lawyer-turned-playwright in New York City, who attempts to gain inspiration from a host of characters populating the fictitious Union Square cafe in Manhattan, obviously inspired by the New York area of the same name. The show was originally supposed to be a vehicle for Cuban-American actress Mel Gorham. But after poor test screenings for the pilot, the producers decided to retool the show and replace Gorham with Constance Marie. The program replaced Fired Up on NBC's \"Must See TV\" night of programming; it was given an 8:30pm timeslot on Thursday evenings, a highly coveted spot due to its location between popular sitcoms Friends and Seinfeld. Like The Single Guy, Union Square attempted to capitalize on attractive singles in their 20s and 30s enjoying New York City life, which both Seinfeld and Friends had turned into successes. The show also featured guest appearances from actor David Krumholtz, who appeared on two episodes, as did actress Rhea Perlman. Featured Crew Fred Barron Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Landes Harriet Sansom Harris Jeffrey Anderson-Gunter Jim Pirri Constance Marie Gabriella Diaz Full Cast & Crew Last Season Season 1 1997 | 14 Episodes Season 1 of Union Square premiered on September 25, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Union Square. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords restaurant writer manhattan, new york city sitcom Content Score 79 Pump it up! We're close now. Top Contributors 11 Banana C 1 CherryJones RB 1 Rookie B.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}