{"link": "https://www.themoviedb.org/tv/35258?language=en", "title": "Rastamouse", "resume": "Rastamouse is a British animated stop motion children's TV series created by Genevieve Webster and Michael De Souza and produced by Three Stones Media/The Rastamouse Company for CBeebies. The show follows crime-busting mouse reggae band Da Easy Crew, who split their time between making music and solving mysteries for Da President of Mouseland. The first 52 episodes of the initial series were shown in the afternoon beginning 31 January 2011 on CBeebies. From 7 March 2011, the programme was repeated in the early mornings, on BBC Two. The second series, comprising a further 26 episodes, started on 20 August 2012, on CBeebies.", "rate": 0, "genre": ["Kids", "Animation"], "cast": ["Sharon Duncan-Brewster", "Reggie Yates", "William Vanderpuye"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35258   Expand Rastamouse   (2011) User Score Overview Rastamouse is a British animated stop motion children's TV series created by Genevieve Webster and Michael De Souza and produced by Three Stones Media/The Rastamouse Company for CBeebies. The show follows crime-busting mouse reggae band Da Easy Crew, who split their time between making music and solving mysteries for Da President of Mouseland. The first 52 episodes of the initial series were shown in the afternoon beginning 31 January 2011 on CBeebies. From 7 March 2011, the programme was repeated in the early mornings, on BBC Two. The second series, comprising a further 26 episodes, started on 20 August 2012, on CBeebies. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sharon Duncan-Brewster Reggie Yates William Vanderpuye Full Cast & Crew Last Season Season 3 2012 | 26 Episodes Season 3 of Rastamouse premiered on August 20, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rastamouse. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  10m, 11m Homepage  - Genres Kids Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors R 3 Rebecca n 3 nicbrown  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}