{"link": "https://www.themoviedb.org/tv/3741?language=en", "title": "True Stories", "resume": "True Stories was an Australian biographical documentary series which explored the personal journeys of ordinary, and sometimes extraordinary Australians. It is based on the ABC's Australian Story.\nThe 4-episode first season of the program rated extremely well, attracting an average of over 1.7 million viewers per episode. As a result, Channel Seven announced a second season, consisting of over 20 episodes which aired from mid-2006. Original host Anna Coren did not front the entire second season as mid-way through production Coren was posted as U.S. Correspondent for Seven. Because of this, several episodes were presented by Chris Bath.", "rate": 0, "genre": ["Documentary"], "cast": ["Anna Coren"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3741   Expand True Stories User Score Overview True Stories was an Australian biographical documentary series which explored the personal journeys of ordinary, and sometimes extraordinary Australians. It is based on the ABC's Australian Story. The 4-episode first season of the program rated extremely well, attracting an average of over 1.7 million viewers per episode. As a result, Channel Seven announced a second season, consisting of over 20 episodes which aired from mid-2006. Original host Anna Coren did not front the entire second season as mid-way through production Coren was posted as U.S. Correspondent for Seven. Because of this, several episodes were presented by Chris Bath. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anna Coren Full Cast & Crew Last Season Season 2012 2012 | 6 Episodes Season 2012 of True Stories premiered on January 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}