{"link": "https://www.themoviedb.org/tv/722?language=en", "title": "The Uninvited", "resume": "The Uninvited is an ITV science fiction television mini-series first shown in 1997 as four fifty minute episodes. The series was made by Anglia Television. It was created by Leslie Grantham, who also features as a police officer with a secret.\nSteve Blake is a photographer who sees the head of British Nuclear Power killed in a horrific car crash, but then turning up alive and well. The village of Sweet Hope contains a mystery: it collapsed into the sea and the population was apparently saved by two police officers. Blake tries to investigate what has happened to the survivors who have all gone on to obtain positions of power within the British establishment. When Blake visits the submerged village he discovers a chilling secret...", "rate": 0, "genre": [], "cast": ["Oliver Ford Davies", "Douglas Hodge", "Leslie Grantham", "Michael Cochrane", "Jean Anderson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 722   Expand The Uninvited   (1997) User Score Overview The Uninvited is an ITV science fiction television mini-series first shown in 1997 as four fifty minute episodes. The series was made by Anglia Television. It was created by Leslie Grantham, who also features as a police officer with a secret. Steve Blake is a photographer who sees the head of British Nuclear Power killed in a horrific car crash, but then turning up alive and well. The village of Sweet Hope contains a mystery: it collapsed into the sea and the population was apparently saved by two police officers. Blake tries to investigate what has happened to the survivors who have all gone on to obtain positions of power within the British establishment. When Blake visits the submerged village he discovers a chilling secret... Featured Crew Leslie Grantham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Oliver Ford Davies Douglas Hodge Leslie Grantham Michael Cochrane Jean Anderson Full Cast & Crew Last Season Season 1 1997 | 4 Episodes Season 1 of The Uninvited premiered on September 25, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Uninvited. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  200m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 2 Joe Carson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}