{"link": "https://www.themoviedb.org/tv/63737?language=en", "title": "Into the Flames", "resume": "Based on the life of Park Tae-joon, founder and honorary chairman of multinational steel-making company POSCO, this is the story of the people who battled poverty and despair after the colonial era and the Korean War with a relentless pursuit of economic innovation, and the choices they made in the name of love, loyalty and sacrifice. Park worked tirelessly to build a mill that produced steel, which became pivotal to Korea's modernization.", "rate": 0, "genre": ["Drama", "History", "Romance"], "cast": ["Lee In-hye", "Choi Soo-jong", "Kim Kwon", "Choi Cheol-ho", "Ryu Jin"], "character": ["Jang Ok-seon", "Park Tae-hyeong", "young Tae-hyeong", "Choi Jong-ho", "Shin Dae-cheol"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63737   Expand Into the Flames   (2014) User Score Overview Based on the life of Park Tae-joon, founder and honorary chairman of multinational steel-making company POSCO, this is the story of the people who battled poverty and despair after the colonial era and the Korean War with a relentless pursuit of economic innovation, and the choices they made in the name of love, loyalty and sacrifice. Park worked tirelessly to build a mill that produced steel, which became pivotal to Korea's modernization. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee In-hye Jang Ok-seon Choi Soo-jong Park Tae-hyeong Kim Kwon young Tae-hyeong Choi Cheol-ho Choi Jong-ho Ryu Jin Shin Dae-cheol Full Cast & Crew Last Season Season 1 2014 | 20 Episodes Season 1 of Into the Flames premiered on April 25, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Into the Flames. You can help by rating TV shows you've seen. Facts Original Name  불꽃 속으로 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.tvchosun.com/drama/flame/ Genres Drama History Romance Keywords korea period drama Content Score 86 Almost there... Top Contributors t 58 tmdb38202327 t 4 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}