{"link": "https://www.themoviedb.org/tv/35100?language=en", "title": "7 Days in Life", "resume": "7 Days in Life is a Hong Kong television comedy drama produced by Television Broadcasts Limited. The drama's broadcast was on TVB's television channels Jade and HD Jade from 24 January to 18 February 2011, consisting of 20 episodes. The two final episodes were aired back to back on 18 February 2011. 7 Days in Life is produced by Leung Choi-yuen and stars Steven Ma, Sonija Kwok, Bosco Wong, Patrick Tang, Yuen Wah, Mimi Lo, Joyce Cheng, and Koni Lui. The drama is a fictional telling of a group of different people residing in a hotel during a true event that occurred in May 2009, when the first reported case of a person carrying the H1N1 virus in Hong Kong stayed in a hotel in Wanchai, resulting in the hotel to be sealed off for 7 days.", "rate": 0, "genre": ["Drama"], "cast": ["Sonija Kwok", "Mimi Lo", "Patrick Tang", "Steven Ma"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35100   Expand 7 Days in Life   (2011) User Score Overview 7 Days in Life is a Hong Kong television comedy drama produced by Television Broadcasts Limited. The drama's broadcast was on TVB's television channels Jade and HD Jade from 24 January to 18 February 2011, consisting of 20 episodes. The two final episodes were aired back to back on 18 February 2011. 7 Days in Life is produced by Leung Choi-yuen and stars Steven Ma, Sonija Kwok, Bosco Wong, Patrick Tang, Yuen Wah, Mimi Lo, Joyce Cheng, and Koni Lui. The drama is a fictional telling of a group of different people residing in a hotel during a true event that occurred in May 2009, when the first reported case of a person carrying the H1N1 virus in Hong Kong stayed in a hotel in Wanchai, resulting in the hotel to be sealed off for 7 days. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sonija Kwok Mimi Lo Patrick Tang Steven Ma Full Cast & Crew Last Season Season 1 2011 | 19 Episodes Season 1 of 7 Days in Life premiered on January 24, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 7 Days in Life. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.programme.tvb.com/drama/7daysinlife/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}