{"link": "https://www.themoviedb.org/tv/4035?language=en", "title": "Inspector Gadget", "resume": "Inspector Gadget is an animated television series that revolves around the adventures of a clumsy, dim-witted cyborg detective named lnspector Gadget – a human being with various bionic gadgets built into his body. Gadget's arch-nemesis is Dr. Claw, the leader of an evil organization, known as \"M.A.D.\"\nThis is the first syndicated cartoon show from DIC Entertainment. lt originally ran from 1983 to 1986 and remained in syndication into the late 1990s. It continues to air successfully in reruns around the world.\nThe series was produced by companies in France, Canada, the United States, Taiwan, and Japan. It was a co-production between DIC Entertainment in France and Nelvana in Canada; the animation work was outsourced to foreign studios such as Tokyo Movie Shinsha in Japan and Cuckoo's Nest Studio in Taiwan. It was the first animated television series to be presented in stereo.", "rate": 66, "genre": ["Animation", "Comedy"], "cast": ["Don Adams", "Don Francks", "Cree Summer", "Maurice LaMarche"], "character": ["Penny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4035   Expand Inspector Gadget   (1983) User Score Overview Inspector Gadget is an animated television series that revolves around the adventures of a clumsy, dim-witted cyborg detective named lnspector Gadget – a human being with various bionic gadgets built into his body. Gadget's arch-nemesis is Dr. Claw, the leader of an evil organization, known as \"M.A.D.\" This is the first syndicated cartoon show from DIC Entertainment. lt originally ran from 1983 to 1986 and remained in syndication into the late 1990s. It continues to air successfully in reruns around the world. The series was produced by companies in France, Canada, the United States, Taiwan, and Japan. It was a co-production between DIC Entertainment in France and Nelvana in Canada; the animation work was outsourced to foreign studios such as Tokyo Movie Shinsha in Japan and Cuckoo's Nest Studio in Taiwan. It was the first animated television series to be presented in stereo. Featured Crew Andy Heyward Creator Jean Chalopin Creator Bruno Bianchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Adams Don Francks Cree Summer Penny Maurice LaMarche Full Cast & Crew Last Season Season 2 1985 | 21 Episodes Season 2 of Inspector Gadget premiered on September 14, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   1960-09-30 The Flintstones 7.0    1987-09-10 Teenage Mutant Ninja Turtles 7.3    1995-09-09 Pinky and the Brain 7.7    1993-09-13 Animaniacs 7.6    1962-09-23 The Jetsons 6.6    1987-09-18 DuckTales 7.6    1991-09-07 Taz-Mania 6.3    1960-11-14 Popeye the Sailor 5.8  Facts Status  Ended Networks Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Comedy Keywords cyborg police inspector Content Score 100 Yes! Looking good! Top Contributors CN 10 Carmelo Nicolosi 10 Banana 6 Maikkoum 6 d00ziie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}