{"link": "https://www.themoviedb.org/tv/77054?language=en", "title": "Novela Apocalipse", "resume": "“Prepare-se para o início do fim”, diz a chamada que anuncia a estreia de “Apocalipse”, a nova novela da Record TV. A trama que estreia nesta terça (21) às 20h30 irá misturar relatos bíblicos e ficção para alertar o mundo, entre outras coisas, sobre volta de Jesus. Recheada de efeitos especiais, fazendo um paralelo com a revelação de João no primeiro século e os dias atuais, o folhetim deverá gerar debates. Mas esse é um dos seus objetivos declarados. “Vamos trazer polêmica. Já vivemos os sinais do apocalipse hoje e é incrível ver que isso foi previsto há mais de dois mil anos”, destaca a autora Vivian de Oliveira, que fez sucesso quando escreveu “Os Dez Mandamentos” (2015)..", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77054   Expand Novela Apocalipse   (2017) User Score Overview “Prepare-se para o início do fim”, diz a chamada que anuncia a estreia de “Apocalipse”, a nova novela da Record TV. A trama que estreia nesta terça (21) às 20h30 irá misturar relatos bíblicos e ficção para alertar o mundo, entre outras coisas, sobre volta de Jesus. Recheada de efeitos especiais, fazendo um paralelo com a revelação de João no primeiro século e os dias atuais, o folhetim deverá gerar debates. Mas esse é um dos seus objetivos declarados. “Vamos trazer polêmica. Já vivemos os sinais do apocalipse hoje e é incrível ver que isso foi previsto há mais de dois mil anos”, destaca a autora Vivian de Oliveira, que fez sucesso quando escreveu “Os Dez Mandamentos” (2015).. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2017 | 59 Episodes Season 1 of Novela Apocalipse premiered on November 21, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Novela Apocalipse. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Portuguese Runtime  - Homepage   http://entretenimento.r7.com/apocalipse Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors m 14 macjun87  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}