{"link": "https://www.themoviedb.org/tv/15373?language=en", "title": "Newstopia", "resume": "Newstopia is an Australian half-hour satirical comedy programme hosted by Shaun Micallef. The first series premiered at 10:00 pm on SBS TV on 10 October 2007 and concluded on 3 December 2007. A second season began on 27 February 2008 and concluded on 30 April 2008. A third season of the show screened from 1 October to 3 December 2008. The show was developed by Micallef, Gary McCaffrie, Michael Ward and Jason Stephens, with McCaffrie and Ward working as writers on the programme. A fourth series in 2009 was planned, but cancelled due to production clashes with Talkin' 'Bout Your Generation.\nThe show's contributors include Matt Cameron, Doug MacLeod, Dave O'Neil, Tony Moclair and Richard Marsland.", "rate": 0, "genre": ["Comedy"], "cast": ["Nicholas Bell", "Julie Eckersley", "Kat Stewart", "Shaun Micallef"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15373   Expand Newstopia   (2009) User Score Overview Newstopia is an Australian half-hour satirical comedy programme hosted by Shaun Micallef. The first series premiered at 10:00 pm on SBS TV on 10 October 2007 and concluded on 3 December 2007. A second season began on 27 February 2008 and concluded on 30 April 2008. A third season of the show screened from 1 October to 3 December 2008. The show was developed by Micallef, Gary McCaffrie, Michael Ward and Jason Stephens, with McCaffrie and Ward working as writers on the programme. A fourth series in 2009 was planned, but cancelled due to production clashes with Talkin' 'Bout Your Generation. The show's contributors include Matt Cameron, Doug MacLeod, Dave O'Neil, Tony Moclair and Richard Marsland. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Bell Julie Eckersley Kat Stewart Shaun Micallef Full Cast & Crew Last Season Season 3 2008 | 10 Episodes Season 3 of Newstopia premiered on October  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Newstopia. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://programs.sbs.com.au/newstopia/ Genres Comedy Keywords satire tv news tv news anchor Content Score 86 Almost there... Top Contributors 7 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}