{"link": "https://www.themoviedb.org/tv/54511?language=en", "title": "Being Mary Jane", "resume": "Mary Jane Paul is a one-woman-show: a successful TV news anchor, and an entirely self-sufficient powerhouse who remains devoted to a family that doesn't share her motivation. Intense drama and unforgettable moments unfold as Mary Jane juggles her life, her relationships, her work, and commitments to her family.", "rate": 78, "genre": ["Drama"], "cast": ["Gabrielle Union", "Aaron D. Spears", "Stephen Bishop", "Lisa Vidal", "Richard Roundtree"], "character": ["Mary Jane Paul", "Mark Bradley", "David Paulk", "Kara Lynch", "Paul Patterson, Sr."], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54511   Expand Being Mary Jane   (2014) User Score  Play Trailer Overview Mary Jane Paul is a one-woman-show: a successful TV news anchor, and an entirely self-sufficient powerhouse who remains devoted to a family that doesn't share her motivation. Intense drama and unforgettable moments unfold as Mary Jane juggles her life, her relationships, her work, and commitments to her family. Featured Crew Mara Brock Akil Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gabrielle Union Mary Jane Paul Aaron D. Spears Mark Bradley Stephen Bishop David Paulk Lisa Vidal Kara Lynch Richard Roundtree Paul Patterson, Sr. Full Cast & Crew Last Season Season 4 2017 | 20 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2008-10-12 Stephen Fry in America 8.0    2011-08-05 Friends with Benefits 6.1    2014-12-02 Girlfriends' Guide to Divorce 5.1    2013-07-20 Cedar Cove 6.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bet.com/shows/being-mary-jane.html Genres Drama Keywords television tv news black woman tv news anchor Content Score 100 Yes! Looking good! Top Contributors t 34 tmdb98495582 22 Elizabeth Jennings TB 9 TMDb Bot 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}