{"link": "https://www.themoviedb.org/tv/6472?language=en", "title": "Chad Vader: Day Shift Manager", "resume": "Chad Vader: Day Shift Manager is an American comedy fan web series created by Aaron Yonda and Matt Sloan, who write, direct and appear in the series, which parodies Star Wars. The show's central character is Chad Vader, the day-shift manager at the fictional supermarket Empire Market, who clashes with his customers and employees. Initially produced for Channel 101, the project was canceled after only two episodes were released. However, Yonda and Sloan decided to continue the story and the project achieved significant popularity following its airing on YouTube. It is largely filmed in Madison, Wisconsin at Willy Street Cooperative. The show has received several awards, including an Official Star Wars Fan Film Award.", "rate": 68, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6472   Expand Chad Vader: Day Shift Manager   (2006) User Score Overview Chad Vader: Day Shift Manager is an American comedy fan web series created by Aaron Yonda and Matt Sloan, who write, direct and appear in the series, which parodies Star Wars. The show's central character is Chad Vader, the day-shift manager at the fictional supermarket Empire Market, who clashes with his customers and employees. Initially produced for Channel 101, the project was canceled after only two episodes were released. However, Yonda and Sloan decided to continue the story and the project achieved significant popularity following its airing on YouTube. It is largely filmed in Madison, Wisconsin at Willy Street Cooperative. The show has received several awards, including an Official Star Wars Fan Film Award. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2012 | 10 Episodes Season 4 of Chad Vader: Day Shift Manager premiered on June 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2007-06-16 Jekyll 8.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.blamesociety.net/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}