{"link": "https://www.themoviedb.org/tv/64374?language=en", "title": "The Invisibles", "resume": "A businessman discovers he has a hidden gene that enables him to breathe water, threatening the existence of the secret Aquarian race, in this charming, comedic fantasy drama from the Czech Republic.", "rate": 0, "genre": [], "cast": ["Jiří Langmajer", "Jiří Bartoška", "Ivana Chýlková", "Luděk Sobota", "Barbora Poláková"], "character": ["Ivan Laušman", "Hubert Vydra", "Nora Vydrová", "Eduard Baretti", "Monika"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64374   Expand The Invisibles   (2014) User Score Overview A businessman discovers he has a hidden gene that enables him to breathe water, threatening the existence of the secret Aquarian race, in this charming, comedic fantasy drama from the Czech Republic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jiří Langmajer Ivan Laušman Jiří Bartoška Hubert Vydra Ivana Chýlková Nora Vydrová Luděk Sobota Eduard Baretti Barbora Poláková Monika Full Cast & Crew Last Season Season 1 2014 | 13 Episodes Season 1 of The Invisibles premiered on September  5, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Invisibles. You can help by rating TV shows you've seen. Facts Original Name  Neviditelní Status  Returning Series Network Certification  - Type  Scripted Original Language  Czech Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 26 EveDemocracy M 6 Michal.f 5 4 5lucina5 3 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}