{"link": "https://www.themoviedb.org/tv/42549?language=en", "title": "Buster Keaton: A Hard Act to Follow", "resume": "A series about the life, career and works of the movie comedy genius.", "rate": 75, "genre": [], "cast": ["Buster Keaton", "Lindsay Anderson", "Eleanor Keaton", "James Karen", "William Collier Jr."], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42549   Expand Buster Keaton: A Hard Act to Follow   (1987) User Score Overview A series about the life, career and works of the movie comedy genius. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Buster Keaton Lindsay Anderson Narrator Eleanor Keaton James Karen William Collier Jr. Full Cast & Crew Last Season Miniseries 1987 | 3 Episodes Season 1 of Buster Keaton: A Hard Act to Follow premiered on September 30, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Buster Keaton: A Hard Act to Follow. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Buster Keaton: A Hard Act to Follow. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords movie business comedian biography silent film Content Score 79 Pump it up! We're close now. Top Contributors TB 36 TMDb Bot 6 Banana G 2 Goomba13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}