{"link": "https://www.themoviedb.org/tv/32591?language=en", "title": "Hard to Say I Love You", "resume": "Nakajima looks up to his father, who was a war photographer, but can only get a job as an assistant for gravure magazines. Mizuno is a provisional high school teacher, currently on probation. Nishimura is Mizuno's best friend, whose boyfriend has been avoiding her since she discovered she was pregnant. Ichihara works at a magazine where he is being blackmailed into sexual favours by his chief editor. Park, on Twitter, takes on the persona of a doctor, when he is actually working at a company that sells medical equipment to disinterested doctors, and at the same time, trying to take care of his younger sister.\nThis is a story about the blossoming friendship of five young people who were brought together by Twitter, and their journey to finding honesty with each other and with themselves.", "rate": 100, "genre": ["Drama"], "cast": ["Eita", "Juri Ueno", "Tetsuji Tamayama", "Kim Jae-joong", "Megumi Seki"], "character": ["Nakajima Keisuke / \"Nakaji\"", "Mizuno Tsukiko / \"Haru\"", "Ichihara Kaoru / \"Linda\"", "Park Seonsu / \"Doctor\"", "Nishimura Hikari / \"Peach\""], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32591   Expand Hard to Say I Love You   (2010) User Score Overview Nakajima looks up to his father, who was a war photographer, but can only get a job as an assistant for gravure magazines. Mizuno is a provisional high school teacher, currently on probation. Nishimura is Mizuno's best friend, whose boyfriend has been avoiding her since she discovered she was pregnant. Ichihara works at a magazine where he is being blackmailed into sexual favours by his chief editor. Park, on Twitter, takes on the persona of a doctor, when he is actually working at a company that sells medical equipment to disinterested doctors, and at the same time, trying to take care of his younger sister. This is a story about the blossoming friendship of five young people who were brought together by Twitter, and their journey to finding honesty with each other and with themselves. Featured Crew Michio Mitsuno Creator Mizuki Nishisaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eita Nakajima Keisuke / \"Nakaji\" Juri Ueno Mizuno Tsukiko / \"Haru\" Tetsuji Tamayama Ichihara Kaoru / \"Linda\" Kim Jae-joong Park Seonsu / \"Doctor\" Megumi Seki Nishimura Hikari / \"Peach\" Full Cast & Crew Last Season Season 1 2010 | 11 Episodes Season 1 of Hard to Say I Love You premiered on April 15, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hard to Say I Love You. You can help by rating TV shows you've seen. Facts Original Name  素直になれなくて Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.fujitv.co.jp/sunao/index.html Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors A 15 Aka75 14 Wendy 12 Sergiojamon B 5 Bonsai  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}