{"link": "https://www.themoviedb.org/tv/62888?language=en", "title": "Redesign My Brain", "resume": "See Australian television personality Todd Sampson put brain training to the test as he undergoes a radical brain makeover on the revolutionary new science of brain plasticity.\nThe cutting edge science has found that anyone can become smarter, improve their memory and reverse mental ageing with the right brain training. It can turn an ordinary brain into a super brain in just three months.", "rate": 0, "genre": ["Documentary"], "cast": ["Todd Sampson"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62888   Expand Redesign My Brain   (2013) User Score  Play Trailer Overview See Australian television personality Todd Sampson put brain training to the test as he undergoes a radical brain makeover on the revolutionary new science of brain plasticity. The cutting edge science has found that anyone can become smarter, improve their memory and reverse mental ageing with the right brain training. It can turn an ordinary brain into a super brain in just three months. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Todd Sampson Himself - Presenter Full Cast & Crew Last Season Series 2 2015 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Redesign My Brain. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Documentary Original Language  English Runtime  57m Homepage   http://www.abc.net.au/tv/programs/redesign-my-brain-with-todd-sampson/ Genres Documentary Keywords brain training Content Score 64 We're so close, yet so far. Top Contributors 21 United600 SW 16 Shane Whitehead 6 isavedtheday 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}