{"link": "https://www.themoviedb.org/tv/11629?language=en", "title": "Mr. Rhodes", "resume": "Mr. Rhodes is an American television situation comedy which was aired by NBC as part of its 1996-97 lineup.\nMr. Rhodes starred comedian Tom Rhodes as an eponymous character who taught at a small-town preparatory school after having failed as a novelist. He found that his high school fantasy girl, Nikki was on the staff as a guidance counselor, and began a relationship with her.\nLike the title character's writing career, Mr. Rhodes' appearance on network television was a brief one; the program was not picked up for another season and last broadcast in March 1997.", "rate": 0, "genre": ["Comedy"], "cast": ["Tom Rhodes", "Stephen Tobolowsky", "Ron Glass"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11629   Expand Mr. Rhodes   (1996) User Score Overview Mr. Rhodes is an American television situation comedy which was aired by NBC as part of its 1996-97 lineup. Mr. Rhodes starred comedian Tom Rhodes as an eponymous character who taught at a small-town preparatory school after having failed as a novelist. He found that his high school fantasy girl, Nikki was on the staff as a guidance counselor, and began a relationship with her. Like the title character's writing career, Mr. Rhodes' appearance on network television was a brief one; the program was not picked up for another season and last broadcast in March 1997. Featured Crew Peter Noah Creator Jennifer Heath Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Rhodes Stephen Tobolowsky Ron Glass Full Cast & Crew Last Season Season 1 1996 | 19 Episodes Season 1 of Mr. Rhodes premiered on September 23, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mr. Rhodes. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords high school teacher high school teacher sitcom Content Score 50 Still needs a little work. Top Contributors 9 Banana 1 Medianoche  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}