{"link": "https://www.themoviedb.org/tv/78646?language=en", "title": "May December Love", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 100, "genre": ["Family", "Drama"], "cast": ["杨玏", "许娣", "Wang Zhi-Wen", "Li Xiaoran", "俞飞鸿"], "character": ["赵康", "王慧娟", "欧阳剑", "顾晓珺", "顾晓岩"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78646   Expand May December Love   (2014) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Featured Crew 姚晓峰 Creator 李潇 Creator 于淼 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast 杨玏 赵康 许娣 王慧娟 Wang Zhi-Wen 欧阳剑 Li Xiaoran 顾晓珺 俞飞鸿 顾晓岩 Full Cast & Crew Last Season Season 1 2014 | 48 Episodes Season 1 of May December Love premiered on February 16, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on May December Love. You can help by rating TV shows you've seen. Facts Status  Ended Network Sohu Certification  - Type  Scripted Original Language  Chinese Runtime  42m Homepage   http://tv.sohu.com/s2014/dzfwsb/ Genres Family Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 47 magicyangx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}