{"link": "https://www.themoviedb.org/tv/2818?language=en", "title": "The Crystal Maze", "resume": "The Crystal Maze was a British game show, produced by Chatsworth Television and shown on Channel 4 in the United Kingdom between 15 February 1990 and 10 August 1995. There was one series per year, with the first four series presented by Richard O'Brien and the final two by Ed Tudor-Pole. Each show was one hour long, including adverts.\nThe show was originally intended to be a British remake of the French programme Fort Boyard, devised by Jacques Antoine. However, the unavailability of the French show's set led British producer Malcolm Heyworth to reinvent the show, using themed zones as a means to keep the show visually fresh.\nThe series is set in \"The Crystal Maze\", which features four different \"zones\" set in various periods of time and space. A team of six contestants take part in a series of challenges in order to win \"time crystals\". Each crystal gives the team five seconds of time inside \"The Crystal Dome\", the centrepiece of the maze where the contestants take part in their final challenge.\nThe maze cost £250,000 to build and was the size of two football pitches. At its height the show was the most watched on Channel 4, regularly attracting between 4 and 6 million viewers. In 2006 and again in 2010, the show was voted \"greatest UK game show of all time\" by readers of UKGameshows.com. This site describes the programme as \"a highly-ambitious, high-risk show that paid off handsomely.\"", "rate": 75, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2818   Expand The Crystal Maze   (1990) User Score Overview The Crystal Maze was a British game show, produced by Chatsworth Television and shown on Channel 4 in the United Kingdom between 15 February 1990 and 10 August 1995. There was one series per year, with the first four series presented by Richard O'Brien and the final two by Ed Tudor-Pole. Each show was one hour long, including adverts. The show was originally intended to be a British remake of the French programme Fort Boyard, devised by Jacques Antoine. However, the unavailability of the French show's set led British producer Malcolm Heyworth to reinvent the show, using themed zones as a means to keep the show visually fresh. The series is set in \"The Crystal Maze\", which features four different \"zones\" set in various periods of time and space. A team of six contestants take part in a series of challenges in order to win \"time crystals\". Each crystal gives the team five seconds of time inside \"The Crystal Dome\", the centrepiece of the maze where the contestants take part in their final challenge. The maze cost £250,000 to build and was the size of two football pitches. At its height the show was the most watched on Channel 4, regularly attracting between 4 and 6 million viewers. In 2006 and again in 2010, the show was voted \"greatest UK game show of all time\" by readers of UKGameshows.com. This site describes the programme as \"a highly-ambitious, high-risk show that paid off handsomely.\" Featured Crew Jacques Antoine Creator Adam Howarth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 — | 14 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply N Industrial vs Ocean Open 0 by Notamymerrick\n      \n     N It's been confirmed the 2017 series will have a new set.... Open 0 by Notamymerrick\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations   1955-01-16 The Sooty Show 6.5    1993-09-06 Sooty & Co. 6.8    1972-10-16 Rainbow 7.0    1982-11-01 SuperTed 6.8    1991-01-03 The Brittas Empire 7.1    1993-11-18 Goodnight Sweetheart 8.2  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m, 45m Homepage  - Genres No genres have been added. Keywords game show Content Score 56 We're so close, yet so far. Top Contributors b 4 blinkingwelsh 4 Banana 3 emrabt 2 BagronkeN  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}