{"link": "https://www.themoviedb.org/tv/4333?language=en", "title": "The Saint", "resume": "The Saint was an ITC mystery spy thriller television series that aired in the UK on ITV between 1962 and 1969. It centred on the Leslie Charteris literary character Simon Templar, played by Roger Moore as a suave and sophisticated Robin Hood-like adventurer. The character may be nicknamed The Saint because the initial letters of his name are also an abbreviation for the word saint. When taking on an American persona, he would often use the name Sebastian Tombs.\nAs a result of the strong performance in the US of the first two black-and-white series in first-run syndication, NBC picked up the show as a summer replacement in its evening schedule in 1966. The programme therefore ended its run with both trans-Atlantic prime time scheduling and colour episodes. It also proved popular beyond the UK and US, eventually airing in over 60 countries, and made a profit in excess of £350m for ITC. With almost 120 episodes, the programme is exceeded only by The Avengers as the most productive show of its genre produced in the UK.", "rate": 75, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Roger Moore"], "character": ["Simon Templar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4333   Expand The Saint   (1962) User Score Overview The Saint was an ITC mystery spy thriller television series that aired in the UK on ITV between 1962 and 1969. It centred on the Leslie Charteris literary character Simon Templar, played by Roger Moore as a suave and sophisticated Robin Hood-like adventurer. The character may be nicknamed The Saint because the initial letters of his name are also an abbreviation for the word saint. When taking on an American persona, he would often use the name Sebastian Tombs. As a result of the strong performance in the US of the first two black-and-white series in first-run syndication, NBC picked up the show as a summer replacement in its evening schedule in 1966. The programme therefore ended its run with both trans-Atlantic prime time scheduling and colour episodes. It also proved popular beyond the UK and US, eventually airing in over 60 countries, and made a profit in excess of £350m for ITC. With almost 120 episodes, the programme is exceeded only by The Avengers as the most productive show of its genre produced in the UK. Featured Crew Leslie Charteris Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roger Moore Simon Templar Full Cast & Crew Last Season Season 6 1968 | 21 Episodes Season 6 of The Saint premiered on September 22, 1968. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Roger Moore is to The Saint as Sean Connery is to James Bond Open 1 by  JohnSteed Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  6 Recommendations   1970-09-16 McCloud 7.0    1976-10-22 The New Avengers 7.6    1971-09-17 The Persuaders! 8.0    1968-09-22 Land of the Giants 6.3    1982-09-26 Matt Houston 6.6    1973-10-24 Kojak 7.4    1967-03-28 Ironside 6.8    1979-09-22 Hart to Hart 6.5  Facts Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Comedy Keywords outlaw thief gentleman thief Content Score 71 Just a little bit more... Top Contributors 17 Banana 6 LuX 5 go2x 4 Joe Carson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}