{"link": "https://www.themoviedb.org/tv/62925?language=en", "title": "The Time We Were Not in Love", "resume": "Jang Ha Na and Choi Won are incredibly close platonic friends: throughout 20 years, they've braved it all through thick and thin. As Ha Na's 30th birthday approaches, Won extols the virtues of aging as a man—like a wine—while explaining that women are like grapes that shrivel into raisins. Determined to prove him wrong, Ha Na strikes a bet on which of the two will marry before turning 35. Based on Taiwan's hit In Time With You, can these two friends make the ultimate leap?", "rate": 70, "genre": ["Drama", "Romance"], "cast": ["Ha Ji-won", "Lee Jin-wook", "Yoon Kyun-sang", "Choo Soo-hyun", "Shin Jung-geun"], "character": ["Oh Ha-na", "Choi Won", "Cha Seo-hoo", "Lee So-eun", "Lee Jung-geun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62925   Expand The Time We Were Not in Love   (2015) User Score Overview Jang Ha Na and Choi Won are incredibly close platonic friends: throughout 20 years, they've braved it all through thick and thin. As Ha Na's 30th birthday approaches, Won extols the virtues of aging as a man—like a wine—while explaining that women are like grapes that shrivel into raisins. Determined to prove him wrong, Ha Na strikes a bet on which of the two will marry before turning 35. Based on Taiwan's hit In Time With You, can these two friends make the ultimate leap? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ha Ji-won Oh Ha-na Lee Jin-wook Choi Won Yoon Kyun-sang Cha Seo-hoo Choo Soo-hyun Lee So-eun Shin Jung-geun Lee Jung-geun Full Cast & Crew Last Season Season 1 2015 | 16 Episodes Season 1 of The Time We Were Not in Love premiered on June 27, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on The Time We Were Not in Love. You can help by rating TV shows you've seen. Facts Original Name  너를 사랑한 시간 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/inlove Genres Drama Romance Keywords remake korea Content Score 86 Almost there... Top Contributors M 42 Maria180493 6 Wendy t 5 tmdb38202327 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}