{"link": "https://www.themoviedb.org/tv/17005?language=en", "title": "Hark at Barker", "resume": "Hark at Barker was a 1969 British comedy series combining elements of sitcom and sketch show, which starred Ronnie Barker. It was made for the ITV network by LWT.\nEach show began with a spoof news item read by Barker as a continuity announcer. He would then introduce the main part of the programme, a lecture to be given by Lord Rustless on a different topic each week from his stately home, Chrome Hall. Helped and hindered by Rustless' secretary Bates, his Butler Badger, his bad-tempered Cook, his incoherent gardener Dithers and his buxom, near-mute maid Effie, these lectures invariably degenerated into farce, and were frequently interrupted by comic sketches on film or videotape which also starred Barker in various roles.\nBarker reprised the role of Lord Rustless in the BBC series His Lordship Entertains, and played very similar characters in Futtock's End and the Two Ronnies specials The Picnic and By the Sea.", "rate": 0, "genre": ["Comedy"], "cast": ["David Jason", "Josephine Tewson", "Ronnie Barker"], "character": ["Dithers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17005   Expand Hark at Barker   (1969) User Score Overview Hark at Barker was a 1969 British comedy series combining elements of sitcom and sketch show, which starred Ronnie Barker. It was made for the ITV network by LWT. Each show began with a spoof news item read by Barker as a continuity announcer. He would then introduce the main part of the programme, a lecture to be given by Lord Rustless on a different topic each week from his stately home, Chrome Hall. Helped and hindered by Rustless' secretary Bates, his Butler Badger, his bad-tempered Cook, his incoherent gardener Dithers and his buxom, near-mute maid Effie, these lectures invariably degenerated into farce, and were frequently interrupted by comic sketches on film or videotape which also starred Barker in various roles. Barker reprised the role of Lord Rustless in the BBC series His Lordship Entertains, and played very similar characters in Futtock's End and the Two Ronnies specials The Picnic and By the Sea. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Jason Dithers Josephine Tewson Ronnie Barker Full Cast & Crew Last Season Season 2 1970 | 7 Episodes Season 2 of Hark at Barker premiered on July 10, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hark at Barker. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords british humour Content Score 43 There's no 'I' in team... Top Contributors O 3 Ozbourne TB 2 TMDb Bot B 1 BWYoda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}