{"link": "https://www.themoviedb.org/tv/31684?language=en", "title": "Voyage of the Unicorn", "resume": "Mourning the loss of her mother, nine-year-old Cassie Aisling daydreams of the magical, mythical world her mother left unfinished. Then, one day, a troll appears. Then another. And another. Before they know it, the Aislings find themselves in the vortex between worlds and transported to a ship called the Unicorn. Here, the Aislings discover that they’ve been chosen to find the magical dragon.", "rate": 54, "genre": ["Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31684   Expand Voyage of the Unicorn   (2001) User Score  Play Trailer Overview Mourning the loss of her mother, nine-year-old Cassie Aisling daydreams of the magical, mythical world her mother left unfinished. Then, one day, a troll appears. Then another. And another. Before they know it, the Aislings find themselves in the vortex between worlds and transported to a ship called the Unicorn. Here, the Aislings discover that they’ve been chosen to find the magical dragon. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Miniseries 2001 | 2 Episodes Season 1 of Voyage of the Unicorn premiered on March  1, 2001. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Voyage of the Unicorn. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations   2004-06-13 King Solomon's Mines 5.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 9 Banana 4 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}