{"link": "https://www.themoviedb.org/tv/12961?language=en", "title": "Rubí", "resume": "Rubí is a Mexican telenovela produced by José Alberto Castro for Televisa. It is based on a short story by Yolanda Vargas Dulché, published as a serial on the 1960s Mexican comic book Lágrimas, Risas y Amor. Bárbara Mori stars as a dual protagonist/antagonist, Rubí.\nCanal de las Estrellas aired Rubí from May 17 to October 22, 2004, with Apuesta por un amor replacing it. Univision broadcast Rubí from September 20, 2004 to March 7, 2005, and has named Rubí as the top telenovela of all time.", "rate": 80, "genre": ["Drama"], "cast": ["Bárbara Mori", "Eduardo Santamarina", "Jacqueline Bracamontes", "Sebastián Rulli"], "character": ["Rubí Pérez Ochoa", "Alejandro Cárdenas Ruiz", "Maribel de la Fuente", "Héctor Ferrer Garza"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12961   Expand Rubí   (2004) User Score Overview Rubí is a Mexican telenovela produced by José Alberto Castro for Televisa. It is based on a short story by Yolanda Vargas Dulché, published as a serial on the 1960s Mexican comic book Lágrimas, Risas y Amor. Bárbara Mori stars as a dual protagonist/antagonist, Rubí. Canal de las Estrellas aired Rubí from May 17 to October 22, 2004, with Apuesta por un amor replacing it. Univision broadcast Rubí from September 20, 2004 to March 7, 2005, and has named Rubí as the top telenovela of all time. Featured Crew Yolanda Vargas Dulché Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bárbara Mori Rubí Pérez Ochoa Eduardo Santamarina Alejandro Cárdenas Ruiz Jacqueline Bracamontes Maribel de la Fuente Sebastián Rulli Héctor Ferrer Garza Full Cast & Crew Last Season Season 1 2004 | 1 Episode Season 1 of Rubí premiered on May 17, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2002-08-07 La familia P. Luche 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.esmas.com/rubi/ Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors s 13 shiff7 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}