{"link": "https://www.themoviedb.org/tv/61753?language=en", "title": "Thor & Loki: Blood Brothers", "resume": "Inspired by the acclaimed graphic novel from Robert Rodi and Esad Ribic, Marvel Knights Animation's \"Thor & Loki: Blood Brothers\" takes a powerful look inside the minds of Thor & Loki, brothers in the mythical land of Asgard and seemingly forever enemies. But just why does Loki hate his brother Thor? And could it be that this master of mischief isn’t really the villain he’s been branded? Loki's insatiable lust for power and his feud with Thor take on new meaning in this resonant epic.", "rate": 80, "genre": ["Animation"], "cast": ["David Blair", "Daniel Thorn", "Robin Goldsmith", "Jennifer Spriggs", "Phoebe Stewart"], "character": ["Loki", "Thor", "Attendant", "Animation Reference Performer", "Karnilla"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61753   Expand Thor & Loki: Blood Brothers   (2011) User Score Overview Inspired by the acclaimed graphic novel from Robert Rodi and Esad Ribic, Marvel Knights Animation's \"Thor & Loki: Blood Brothers\" takes a powerful look inside the minds of Thor & Loki, brothers in the mythical land of Asgard and seemingly forever enemies. But just why does Loki hate his brother Thor? And could it be that this master of mischief isn’t really the villain he’s been branded? Loki's insatiable lust for power and his feud with Thor take on new meaning in this resonant epic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Blair Loki Daniel Thorn Thor Robin Goldsmith Attendant Jennifer Spriggs Animation Reference Performer Phoebe Stewart Karnilla Full Cast & Crew Last Season Season 1 2011 | 4 Episodes Season 1 of Thor & Loki: Blood Brothers premiered on March 28, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Thor & Loki: Blood Brothers. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  English Runtime  68m Homepage  - Genres Animation Keywords viking based on comic miniseries norse mythology Content Score 86 Almost there... Top Contributors TB 37 TMDb Bot 15 Razze 11 Farkas Tibor 5 Rafaelasauani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}