{"link": "https://www.themoviedb.org/tv/67861?language=en", "title": "Midnight, Texas", "resume": "Welcome to a place where being normal is really quite strange. In a remote Texas town no one is who they seem. From vampires and witches to psychics and hit men, Midnight is a mysterious safe haven for those who are different. As the town members fight off outside pressures from rowdy biker gangs, ever-suspicious cops and their own dangerous pasts, they band together and form a strong and unlikely family.", "rate": 66, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["François Arnaud", "Sarah Ramos", "Dylan Bruce", "Parisa Fitz-Henley", "Arielle Kebbel"], "character": ["Manfred Bernardo", "Creek Lovell", "Bobo Winthrop", "Fiji Cavanaugh", "Olivia Charity"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67861   Expand Midnight, Texas   (2017) User Score  Play Trailer Overview Welcome to a place where being normal is really quite strange. In a remote Texas town no one is who they seem. From vampires and witches to psychics and hit men, Midnight is a mysterious safe haven for those who are different. As the town members fight off outside pressures from rowdy biker gangs, ever-suspicious cops and their own dangerous pasts, they band together and form a strong and unlikely family. Featured Crew Monica Breen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  12 Posters  5 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast François Arnaud Manfred Bernardo Sarah Ramos Creek Lovell Dylan Bruce Bobo Winthrop Parisa Fitz-Henley Fiji Cavanaugh Arielle Kebbel Olivia Charity Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Midnight, Texas premiered on July 24, 2017. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply T Premiere's July 25th Open 2 by  Nubyan Two night event this week Open 2 by  Terrie c Gonna bomb, and we know it Open 27 by  Taylorfirst1 Go to Discussions Media Most Popular Videos  3 Backdrops  12 Posters  5 Recommendations   2016-04-01 Wynonna Earp 6.3    2017-10-02 The Gifted 7.0    2017-09-29 Marvel's Inhumans 5.6    2016-09-23 Van Helsing 5.6    2017-04-04 Dimension 404 6.8    2016-01-22 Stan Lee's Lucky Man 7.3    2017-07-12 Salvation 6.5    2017-10-01 Extinct 5.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.nbc.com/midnight-texas Genres Drama Mystery Sci-Fi & Fantasy Keywords based on novel or book vampire supernatural psychic power fallen angel demon Content Score 100 Yes! Looking good! Top Contributors 71 Banana 34 Elizabeth Jennings 26 Bogdan Mateescu 26 Medianoche  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}