{"link": "https://www.themoviedb.org/tv/61476?language=en", "title": "Ancient Black Ops", "resume": "From Ancient Greece to the frozen North, rulers have always needed their elite troops – men trained to perfection, skilled with a devastating array of weaponry – men who will track down their leader’s enemies and kill them. All assassination teams faced one big problem: getting close enough to kill. No one in the ancient world had sniper rifles. As a result even the most formidable Japanese Ninjas got captured and tortured.\nThis series brings some of the most dramatic tales of antiquity to life with a mixture of dramatic reconstruction, documentary filming and expert testimony.\nEach episode details the intricate complexity of the elite troops who performed the assassination missions and how they worked. It shows what they had to do to achieve elite status, how they could dress, and the weapons they got to use when they completed their first mission.", "rate": 80, "genre": ["Documentary"], "cast": ["Murtaza Arif", "Max Bracey", "Martin Krøis Holtmann", "Nicholas Marshall", "Kumud Pant"], "character": ["Mamluk 2", "Harald Hardrada", "Himself", "Assassin", "High Priest"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61476   Expand Ancient Black Ops   (2014) User Score Overview From Ancient Greece to the frozen North, rulers have always needed their elite troops – men trained to perfection, skilled with a devastating array of weaponry – men who will track down their leader’s enemies and kill them. All assassination teams faced one big problem: getting close enough to kill. No one in the ancient world had sniper rifles. As a result even the most formidable Japanese Ninjas got captured and tortured. This series brings some of the most dramatic tales of antiquity to life with a mixture of dramatic reconstruction, documentary filming and expert testimony. Each episode details the intricate complexity of the elite troops who performed the assassination missions and how they worked. It shows what they had to do to achieve elite status, how they could dress, and the weapons they got to use when they completed their first mission. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Murtaza Arif Mamluk 2 Max Bracey Harald Hardrada Martin Krøis Holtmann Himself Nicholas Marshall Assassin Kumud Pant High Priest Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Ancient Black Ops premiered on September 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ancient Black Ops. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://yesterday.uktv.co.uk/shows/ancient-black-ops/ Genres Documentary Keywords war greek Content Score 71 Just a little bit more... Top Contributors 27 CouchTater CM 4 Cherche Moi 1 Banana 1 Sean Tu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}