{"link": "https://www.themoviedb.org/tv/70264?language=en", "title": "Misteri Wan Peah", "resume": "Mysterious story of an old woman who lived in Kampung Kuala Pari Hilir. Deck strange demeanor, often alone and never smile like sitting in the dark than the villagers assume Wan Peah (Normah Damanhuri) defend perennial.\nAs a result of an incident in which three close friends of Yeh beetle (RAW Tokan), Li Kelubi (Zee Tokan) and Ghani Stuttering (Faiz Tapaw) was stumble upon Wan Peah until they get sick, Wan Peah diherdik and scorned by the villagers. They said Wan Peah use black magic and he was warned not to leave the house immediately.", "rate": 0, "genre": ["Drama"], "cast": ["Zee Zainal", "Acap Jamaluddin", "Normah Damanhuri", "Usop Wilcha / Shy8"], "character": ["Lie Kelubi", "Yeh kumbang", "Wan Peah", "Tok Hashim"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70264   Expand Misteri Wan Peah   (2017) User Score Overview Mysterious story of an old woman who lived in Kampung Kuala Pari Hilir. Deck strange demeanor, often alone and never smile like sitting in the dark than the villagers assume Wan Peah (Normah Damanhuri) defend perennial. As a result of an incident in which three close friends of Yeh beetle (RAW Tokan), Li Kelubi (Zee Tokan) and Ghani Stuttering (Faiz Tapaw) was stumble upon Wan Peah until they get sick, Wan Peah diherdik and scorned by the villagers. They said Wan Peah use black magic and he was warned not to leave the house immediately. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Zee Zainal Lie Kelubi Acap Jamaluddin Yeh kumbang Normah Damanhuri Wan Peah Usop Wilcha / Shy8 Tok Hashim Full Cast & Crew Last Season Season 1 2017 | 20 Episodes Season 1 of Misteri Wan Peah premiered on February 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Misteri Wan Peah. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Malay Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors v 23 vplaytv 4 UniqueStream M 2 Mr_Democracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}