{"link": "https://www.themoviedb.org/tv/58981?language=en", "title": "The Thundermans", "resume": "Meet The Thundermans, a typical suburban family that happens to have astounding superpowers. At the center of the action are the 14-year-old Thunderman twins, who share the same bathroom, the same school, and the same annoying little siblings. Their only difference? The sister is a super student with a super sunny disposition who super looks forward to being a superhero someday, and her twin brother is a super villain.", "rate": 82, "genre": ["Action", "Adventure", "Comedy", "Family", "Sci-Fi", "Fantasy"], "cast": ["Kira Kosarin", "Jack Griffo", "Addison Riecke", "Diego Velazquez", "Maya Le Clark"], "character": ["Phoebe Thunderman", "Max Thunderman", "Nora Thunderman", "Billy Thunderman", "Chloe Thunderman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58981   Expand The Thundermans   (2013) User Score Overview Meet The Thundermans, a typical suburban family that happens to have astounding superpowers. At the center of the action are the 14-year-old Thunderman twins, who share the same bathroom, the same school, and the same annoying little siblings. Their only difference? The sister is a super student with a super sunny disposition who super looks forward to being a superhero someday, and her twin brother is a super villain. Featured Crew Jed Spingarn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  11 Content Issues  1 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kira Kosarin Phoebe Thunderman Jack Griffo Max Thunderman Addison Riecke Nora Thunderman Diego Velazquez Billy Thunderman Maya Le Clark Chloe Thunderman Full Cast & Crew Last Season Season 4 2016 | 27 Episodes Season 4 of The Thundermans premiered on October 16, 2016. View All Seasons Social Reviews  1 Discussions  12 L A review by Lloyd Written by  Lloyd  on June 25, 2017 I love this show. Its not juvenile but fun. Eventhough its a comedy it has drama in it as well. Love the Thundermans and how they deal with  being superheroes and deal with everyday life. Read All Reviews Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2015-09-12 Game Shakers 6.4    2011-12-02 Austin & Ally 5.8    2013-10-07 Mighty Med 6.2    2012-10-12 Dog With a Blog 5.3    2016-11-11 MECH-X4 6.3    2015-07-31 BUNK'D 5.3    2014-01-17 I Didn't Do It 6.8    2014-07-26 Henry Danger 7.3  Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.nick.com/the-thundermans/ Genres Action & Adventure Comedy Family Sci-Fi & Fantasy Keywords superhero teenager supervillain teen superhero Content Score 93 Almost there... Top Contributors 32 Elizabeth Jennings CM 16 Cherche Moi 11 DarkMan TB 10 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}