{"link": "https://www.themoviedb.org/tv/4697?language=en", "title": "Big Cat Week", "resume": "Big Cat Diary, also known as Big Cat Week or Big Cat Live, is a long-running nature documentary series on BBC television which follows the lives of African big cats in Kenya's Maasai Mara. The first series, broadcast on BBC One in 1996, was developed and jointly produced by Keith Scholey, who would go on to become Head of the BBC's Natural History Unit. Eight further series have followed, most recently Big Cat Live, a live broadcast from the Mara in 2008.\nThe original presenters, Jonathan Scott and Simon King, were joined by Saba Douglas-Hamilton from 2002 onwards. Kate Silverton and Jackson Looseyia were added to the presenting team for Big Cat Live.", "rate": 0, "genre": ["Documentary", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4697   Expand Big Cat Week   (1996) User Score Overview Big Cat Diary, also known as Big Cat Week or Big Cat Live, is a long-running nature documentary series on BBC television which follows the lives of African big cats in Kenya's Maasai Mara. The first series, broadcast on BBC One in 1996, was developed and jointly produced by Keith Scholey, who would go on to become Head of the BBC's Natural History Unit. Eight further series have followed, most recently Big Cat Live, a live broadcast from the Mara in 2008. The original presenters, Jonathan Scott and Simon King, were joined by Saba Douglas-Hamilton from 2002 onwards. Kate Silverton and Jackson Looseyia were added to the presenting team for Big Cat Live. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2008 | 8 Episodes Season 5 of Big Cat Week premiered on October  5, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Big Cat Week. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.bbc.co.uk/nature/programmes/tv/bcd/ Genres Documentary Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}