{"link": "https://www.themoviedb.org/tv/1998?language=en", "title": "Moonlighting", "resume": "Moonlighting is an American television series that aired on ABC from March 3, 1985, to May 14, 1989. The network aired a total of 66 episodes. Starring Bruce Willis and Cybill Shepherd as private detectives, the show was a mixture of drama, comedy, and romance, and was considered to be one of the first successful and influential examples of comedy-drama, or \"dramedy\", emerging as a distinct television genre.\nThe show's theme song was performed by jazz singer Al Jarreau and became a hit. The show is also credited with making Willis a star, while providing Shepherd with a critical success after a string of lackluster projects. In 1997, the episode \"The Dream Sequence Always Rings Twice\" was ranked #34 on TV Guide's 100 Greatest Episodes of All Time. In 2007, the series was listed as one of Time magazine's \"100 Best TV Shows of All-Time.\" The relationship between David and Maddie was included in TV Guide's list of the best TV couples of all time.", "rate": 74, "genre": ["Comedy", "Drama", "Mystery"], "cast": ["Cybill Shepherd", "Allyce Beasley", "Bruce Willis"], "character": ["Madelyn 'Maddie' Hayes", "Agnes DiPesto", "David Addison Jr."], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1998   Expand Moonlighting   (1985) User Score  Play Trailer Overview Moonlighting is an American television series that aired on ABC from March 3, 1985, to May 14, 1989. The network aired a total of 66 episodes. Starring Bruce Willis and Cybill Shepherd as private detectives, the show was a mixture of drama, comedy, and romance, and was considered to be one of the first successful and influential examples of comedy-drama, or \"dramedy\", emerging as a distinct television genre. The show's theme song was performed by jazz singer Al Jarreau and became a hit. The show is also credited with making Willis a star, while providing Shepherd with a critical success after a string of lackluster projects. In 1997, the episode \"The Dream Sequence Always Rings Twice\" was ranked #34 on TV Guide's 100 Greatest Episodes of All Time. In 2007, the series was listed as one of Time magazine's \"100 Best TV Shows of All-Time.\" The relationship between David and Maddie was included in TV Guide's list of the best TV couples of all time. Featured Crew Glenn Gordon Caron Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  16 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Cybill Shepherd Madelyn 'Maddie' Hayes Allyce Beasley Agnes DiPesto Bruce Willis David Addison Jr. Full Cast & Crew Last Season Season 4 1987 | 14 Episodes Season 4 of Moonlighting premiered on September 29, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply PE \"Blue Moon detective agency, we go anywhere to do almost eveything...except blow up buildings.\" Open 0 by Patrick E. Abe\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  16 Posters  5 Recommendations   1982-10-01 Remington Steele 6.9    1979-09-22 Hart to Hart 6.5    1976-09-18 The Muppet Show 7.8    1982-09-26 Knight Rider 6.5    1977-09-24 The Love Boat 5.8    1977-01-14 Fantasy Island 6.5    1982-09-22 Family Ties 7.0    1973-10-24 Kojak 7.4  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Drama Mystery Keywords yuppie detective model detective agency Content Score 71 Just a little bit more... Top Contributors 20 lineker 14 Banana 8 Nero Kosonen D 8 Decaliax  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}