{"link": "https://www.themoviedb.org/tv/72191?language=en", "title": "The Nightmare Years", "resume": "Based on the historical work \"The Rise and Fall of the Third Reich\", \"The Nightmare Years\" tells the story of William Shirer, American journalist who, during his days of correspondence as a foreign press in report in 1930s Germany, had to deal with the growing oppression of the Nazi regime, the increasing censorship of the press, and finally the prospect of World War. In the last days of peace, Shirer also struggles to have his German wife and child escape to the United States.", "rate": 0, "genre": ["Drama"], "cast": ["Sam Waterston", "Marthe Keller", "Kurtwood Smith", "Frances Barber", "Péter Benkő"], "character": ["Bill Shirer", "Tess Shirer", "Dr. Josef Goebbels", "Helga Bauer", "Putzi's Agent"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72191   Expand The Nightmare Years   (1989) User Score Overview Based on the historical work \"The Rise and Fall of the Third Reich\", \"The Nightmare Years\" tells the story of William Shirer, American journalist who, during his days of correspondence as a foreign press in report in 1930s Germany, had to deal with the growing oppression of the Nazi regime, the increasing censorship of the press, and finally the prospect of World War. In the last days of peace, Shirer also struggles to have his German wife and child escape to the United States. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Waterston Bill Shirer Marthe Keller Tess Shirer Kurtwood Smith Dr. Josef Goebbels Frances Barber Helga Bauer Péter Benkő Putzi's Agent Full Cast & Crew Last Season Season 1 1989 | 4 Episodes Season 1 of The Nightmare Years premiered on November 17, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Nightmare Years. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 18 Elizabeth Jennings AM 13 Audrey Mann R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}