{"link": "https://www.themoviedb.org/tv/74120?language=en", "title": "Night Goblin", "resume": "Lee Soo-geun, Jeong Hyeong-don, Park Sung-kwang, Lee Hong-gi, and JR from NU’EST race to be the first one to arrive at the most popular destinations first for a prize every week. Cast members, or the “Night Goblins,” start the race at midnight where they must stay awake all night to get to the destination first the next morning.", "rate": 0, "genre": ["Reality", "Talk"], "cast": ["Lee Soo-geun", "Jeong Hyeong-don", "Park Sung-kwang", "Lee Hong-gi", "Kim Jong-hyun"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74120   Expand Night Goblin   (2017) User Score Overview Lee Soo-geun, Jeong Hyeong-don, Park Sung-kwang, Lee Hong-gi, and JR from NU’EST race to be the first one to arrive at the most popular destinations first for a prize every week. Cast members, or the “Night Goblins,” start the race at midnight where they must stay awake all night to get to the destination first the next morning. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Soo-geun Jeong Hyeong-don Park Sung-kwang Lee Hong-gi Kim Jong-hyun Full Cast & Crew Last Season Season 1 2017 | 0 Episodes Season 1 of Night Goblin premiered on July 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Night Goblin. You can help by rating TV shows you've seen. Facts Original Name  밤도깨비 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres Reality Talk Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 16 helloskies 13 Charles TB 2 TMDb Bot R 2 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}