{"link": "https://www.themoviedb.org/tv/2422?language=en", "title": "Dynomutt, Dog Wonder", "resume": "Dynomutt, Dog Wonder is an American animated television series produced for Saturday mornings by Hanna-Barbera Productions. The show centers around a Batman-esque super hero, the Blue Falcon, and his assistant, bumbling yet generally effective robot dog Dynomutt, who can produce a seemingly infinite number of mechanical devices from his body. As with many other animated super-heroes of the era, no origins for the characters are ever provided.\nDynomutt was originally broadcast as a half-hour segment of The Scooby-Doo/Dynomutt Hour and its later expanded forms Scooby's All-Star Laff-a-Lympics and Scooby's All-Stars; it would later be rerun and syndicated on its own from 1978 on. The cast of The Scooby-Doo Show appeared as a recurring characters on Dynomutt, assisting the Daring Duo in cracking their crimes. Originally distributed by Hanna-Barbera's then-parent company Taft Broadcasting, Warner Bros. Television currently holds the television distribution to the series.\nBetween January 2 and March 9, 2008, repeats of Dynomutt, Dog Wonder were shown on Boomerang. On June 4, 2009, Dynomutt, Dog Wonder returned to Boomerang and airs Thursdays through Sundays at 10am Eastern.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Frank Welker", "Gary Owens", "Ron Feinberg", "Larry McCormick"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2422   Expand Dynomutt, Dog Wonder   (1976) User Score Overview Dynomutt, Dog Wonder is an American animated television series produced for Saturday mornings by Hanna-Barbera Productions. The show centers around a Batman-esque super hero, the Blue Falcon, and his assistant, bumbling yet generally effective robot dog Dynomutt, who can produce a seemingly infinite number of mechanical devices from his body. As with many other animated super-heroes of the era, no origins for the characters are ever provided. Dynomutt was originally broadcast as a half-hour segment of The Scooby-Doo/Dynomutt Hour and its later expanded forms Scooby's All-Star Laff-a-Lympics and Scooby's All-Stars; it would later be rerun and syndicated on its own from 1978 on. The cast of The Scooby-Doo Show appeared as a recurring characters on Dynomutt, assisting the Daring Duo in cracking their crimes. Originally distributed by Hanna-Barbera's then-parent company Taft Broadcasting, Warner Bros. Television currently holds the television distribution to the series. Between January 2 and March 9, 2008, repeats of Dynomutt, Dog Wonder were shown on Boomerang. On June 4, 2009, Dynomutt, Dog Wonder returned to Boomerang and airs Thursdays through Sundays at 10am Eastern. Featured Crew Ken Spears Creator Joe Ruby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Welker Gary Owens Ron Feinberg Larry McCormick Full Cast & Crew Last Season Season 2 1977 | 8 Episodes Season 2 of Dynomutt, Dog Wonder premiered on September 10, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dynomutt, Dog Wonder. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors m 3 magoozin 3 minhus 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}