{"link": "https://www.themoviedb.org/tv/34138?language=en", "title": "Monochrome Factor", "resume": "Monochrome Factor is a Japanese manga series written and illustrated by Kaili Sorano. It was first serialized in Mag Garden's bi-monthly manga magazine Comic Blade Masamune in May 2004. However, when the magazine ceased publication, the manga began serialization in the new and revamped magazine, Comic Blade Avarus, in September 2007.\nThe manga is licensed for distribution in North America by Tokyopop, and has so far released four volumes, with the latest having been released on December 2, 2008.\nAn anime adaptation produced by GENCO, and animated by A.C.G.T, premiered on Japan's terrestrial television network TV Tokyo on April 7, 2008. It also aired on other networks such as AT-X and TV Osaka, though the episodes aired on TV Tokyo first. The anime has shōnen-ai themes which are almost completely absent from the manga.", "rate": 0, "genre": ["Animation"], "cast": ["Daisuke Ono", "Masumi Asano", "Katsuyuki Konishi", "Hiroshi Kamiya", "Mitsuki Saiga"], "character": ["Akira Nikaido", "Aya Suzuno", "Kou", "Kengo Asamura", "Haruka Kujo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34138   Expand Monochrome Factor   (2008) User Score Overview Monochrome Factor is a Japanese manga series written and illustrated by Kaili Sorano. It was first serialized in Mag Garden's bi-monthly manga magazine Comic Blade Masamune in May 2004. However, when the magazine ceased publication, the manga began serialization in the new and revamped magazine, Comic Blade Avarus, in September 2007. The manga is licensed for distribution in North America by Tokyopop, and has so far released four volumes, with the latest having been released on December 2, 2008. An anime adaptation produced by GENCO, and animated by A.C.G.T, premiered on Japan's terrestrial television network TV Tokyo on April 7, 2008. It also aired on other networks such as AT-X and TV Osaka, though the episodes aired on TV Tokyo first. The anime has shōnen-ai themes which are almost completely absent from the manga. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daisuke Ono Akira Nikaido Masumi Asano Aya Suzuno Katsuyuki Konishi Kou Hiroshi Kamiya Kengo Asamura Mitsuki Saiga Haruka Kujo Full Cast & Crew Last Season Season 1 2008 | 24 Episodes Season 1 of Monochrome Factor premiered on April  7, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Monochrome Factor. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}