{"link": "https://www.themoviedb.org/tv/42290?language=en", "title": "Padam Padam... The Sound of His and Her Heartbeats", "resume": "Padam Padam... The Sound of His and Her Heartbeats is a 2011 South Korean romance/fantasy television series, starring Jung Woo-sung, Han Ji-min and Kim Bum. The series was written by Noh Hee-kyung, and the title is a reference to a 1951 Edith Piaf song, an onomatopoeia expressing the sound of a heartbeat. It was one of the inaugural dramas on newly launched cable channel jTBC, and aired from December 5, 2011 to February 7, 2012 on Mondays and Tuesdays at 20:45 for 20 episodes.", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Jung Woo-sung", "Kim Bum", "Han Ji-min", "Kim Sung-ryung", "Yoon Joo-sang"], "character": ["Yang Kang-chil", "Lee Gook-soo", "Jung Ji-na", "Ji-na's mother", "Prison warden Kim"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42290   Expand Padam Padam... The Sound of His and Her Heartbeats   (2011) User Score Overview Padam Padam... The Sound of His and Her Heartbeats is a 2011 South Korean romance/fantasy television series, starring Jung Woo-sung, Han Ji-min and Kim Bum. The series was written by Noh Hee-kyung, and the title is a reference to a 1951 Edith Piaf song, an onomatopoeia expressing the sound of a heartbeat. It was one of the inaugural dramas on newly launched cable channel jTBC, and aired from December 5, 2011 to February 7, 2012 on Mondays and Tuesdays at 20:45 for 20 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Woo-sung Yang Kang-chil Kim Bum Lee Gook-soo Han Ji-min Jung Ji-na Kim Sung-ryung Ji-na's mother Yoon Joo-sang Prison warden Kim Full Cast & Crew Last Season Padam padam season 1 2011 | 20 Episodes Season 1 of Padam Padam... The Sound of His and Her Heartbeats premiered on December  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Padam Padam... The Sound of His and Her Heartbeats. You can help by rating TV shows you've seen. Facts Original Name  빠담빠담... 그와 그녀의 심장박동소리 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://drama.jtbc.co.kr/padampadam/ Genres Drama Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 20 Maria180493 CM 8 Cherche Moi LS 3 Lee Seung-Su i 2 i90i90  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}