{"link": "https://www.themoviedb.org/tv/11841?language=en", "title": "Transformers: Super-God Masterforce", "resume": "Transformers: Super-God Masterforce is the title of a Japanese Transformers line of toys and anime series that ran from April 12, 1988 to March 7, 1989 for 42 episodes. On July 3, 2006 the series was released on DVD in the UK, and it was aired on AnimeCentral in the UK a few years later. In 2008, Madman Entertainment released the series on DVD in Australia in Region 4, PAL format. On May 1, 2012, the series was released on DVD in the US.", "rate": 70, "genre": ["Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11841   Expand Transformers: Super-God Masterforce   (1988) User Score Overview Transformers: Super-God Masterforce is the title of a Japanese Transformers line of toys and anime series that ran from April 12, 1988 to March 7, 1989 for 42 episodes. On July 3, 2006 the series was released on DVD in the UK, and it was aired on AnimeCentral in the UK a few years later. In 2008, Madman Entertainment released the series on DVD in Australia in Region 4, PAL format. On May 1, 2012, the series was released on DVD in the US. Featured Crew Masumi Kaneda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1988 | 42 Episodes Season 1 of Transformers: Super-God Masterforce premiered on April 12, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Transformers: Super-God Masterforce. You can help by rating TV shows you've seen. Facts Original Name  トランスフォーマー 超神マスターフォース Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Adventure Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 24 betsumei  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}