{"link": "https://www.themoviedb.org/tv/60671?language=en", "title": "Grey Home", "resume": "A moving story about the residents of correctional facility, rejected by parents and environment. Going through a strict regimen of life in the home, they are constantly trying to reverse the fate in their favor. Although they were given a chance to change, their actions always return to the beginning. Constantly on the border between personal whims and once-in-a-lifetime opportunity to become humans, they remain as wolves who find hard to change their mood. What finally remains is a perpetual dilemma whether their fate is innate, or is it forced the communities in which they grew up...", "rate": 90, "genre": ["Drama"], "cast": ["Žarko Laušević", "Zoran Cvijanović", "Dragan Nikolić", "Mihailo Janketić", "Velimir „Bata“ Živojinović"], "character": ["Šilja", "Šojka", "Zeka", "Beli", "Upravnik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60671   Expand Grey Home   (1986) User Score Overview A moving story about the residents of correctional facility, rejected by parents and environment. Going through a strict regimen of life in the home, they are constantly trying to reverse the fate in their favor. Although they were given a chance to change, their actions always return to the beginning. Constantly on the border between personal whims and once-in-a-lifetime opportunity to become humans, they remain as wolves who find hard to change their mood. What finally remains is a perpetual dilemma whether their fate is innate, or is it forced the communities in which they grew up... Featured Crew Darko Bajić Creator Gordan Mihić Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Žarko Laušević Šilja Zoran Cvijanović Šojka Dragan Nikolić Zeka Mihailo Janketić Beli Velimir „Bata“ Živojinović Upravnik Full Cast & Crew Last Season Season 1 1986 | 1 Episode Season 1 of Grey Home premiered on January  1, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Grey Home. You can help by rating TV shows you've seen. Facts Original Name  Sivi dom Status  Ended Networks - Certification  - Type  Scripted Original Language  Serbian Runtime  625m Homepage  - Genres Drama Keywords robbery escape pickpocket yugoslavia italy juvenile prison barbed wire song education psychologist fire fighting juvenile delinquent police officer stolen cars juvenile crime Content Score 86 Almost there... Top Contributors 84 Mario Gaborović M 18 Mario_Gaborović C 2 CormacJones TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}