{"link": "https://www.themoviedb.org/tv/66894?language=en", "title": "Frequency", "resume": "Detective Raimy Sullivan is stunned when a voice suddenly crackles through her father’s old, long-broken ham radio – it’s Frank Sullivan, somehow transmitting over the airwaves and through the decades from 1996. Separated by twenty years, father and daughter have reunited on a frequency only they can hear, but can they rewrite the story of their lives without risking everyone they love?", "rate": 74, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Peyton List", "Riley Smith", "Devin Kelley", "Lenny Jacobson", "Daniel Bonjour"], "character": ["Raimy Sullivan", "Frank Sullivan", "Julie Sullivan", "Gordo", "Daniel Lawrence"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66894   Expand Frequency   (2016) User Score Overview Detective Raimy Sullivan is stunned when a voice suddenly crackles through her father’s old, long-broken ham radio – it’s Frank Sullivan, somehow transmitting over the airwaves and through the decades from 1996. Separated by twenty years, father and daughter have reunited on a frequency only they can hear, but can they rewrite the story of their lives without risking everyone they love? Featured Crew Jeremy Carver Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peyton List Raimy Sullivan Riley Smith Frank Sullivan Devin Kelley Julie Sullivan Lenny Jacobson Gordo Daniel Bonjour Daniel Lawrence Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Frequency premiered on October  5, 2016. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply \"Frequency\" Epilogue Open 1 by  DoroDoro 2 S1E9 Spoilers? Open 3 by  Wysockin Season 2? Open 3 by  Z-12 Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  3 Recommendations   2016-10-03 Timeless 7.0    2016-10-17 Travelers 7.5    2016-01-13 Second Chance 6.5    2016-01-14 Colony 6.8    2013-10-09 The Tomorrow People 6.6    2014-10-06 Strange Empire 6.2    2016-06-01 Cleverman 5.7    2016-01-22 Stan Lee's Lucky Man 7.3  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://cwtv.com/shows/frequency Genres Drama Mystery Sci-Fi & Fantasy Keywords time travel time machine new york city police detective changing the past or future Content Score 93 Almost there... Top Contributors 50 Marr 🇳🇱 o 39 onlinemoviestar 36 Banana 13 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}