{"link": "https://www.themoviedb.org/tv/1892?language=en", "title": "The Fresh Prince of Bel-Air", "resume": "The Fresh Prince of Bel-Air is an American television sitcom that originally aired on NBC from September 10, 1990, to May 20, 1996. The show stars Will Smith as a fictionalized version of himself, a street-smart teenager from West Philadelphia who is sent to move in with his aunt and uncle in their wealthy Bel Air mansion, where his lifestyle often clashes with that of his relatives. The 148 episodes were broadcast over six seasons.", "rate": 73, "genre": ["Comedy"], "cast": ["Will Smith", "James Avery", "Alfonso Ribeiro", "Joseph Marcell"], "character": ["William 'Will' Smith", "Philip Banks", "Carlton Banks", "Geoffrey Butler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1892   Expand The Fresh Prince of Bel-Air   (1990) User Score Overview The Fresh Prince of Bel-Air is an American television sitcom that originally aired on NBC from September 10, 1990, to May 20, 1996. The show stars Will Smith as a fictionalized version of himself, a street-smart teenager from West Philadelphia who is sent to move in with his aunt and uncle in their wealthy Bel Air mansion, where his lifestyle often clashes with that of his relatives. The 148 episodes were broadcast over six seasons. Featured Crew Benny Medina Creator Andy Borowitz Creator Jeff Pollack Creator Susan Borowitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  7 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will Smith William 'Will' Smith James Avery Philip Banks Alfonso Ribeiro Carlton Banks Joseph Marcell Geoffrey Butler Full Cast & Crew Last Season Season 6 1995 | 24 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply g If this was made in this era Open 0 by gspgreases\n      \n     w Hillary: Happy Birthday Karyn Parsons! Open 0 by wonder2wonder\n      \n     w Will: Happy Birthday Will Smith! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  7 Recommendations   1998-08-23 That '70s Show 7.4    1991-09-17 Home Improvement 7.0    1996-01-09 3rd Rock from the Sun 7.3    1993-09-16 Frasier 7.7    1996-09-13 Everybody Loves Raymond 6.3    1987-09-22 Full House 5.9    1993-09-13 Animaniacs 7.6    1982-09-30 Cheers 7.5  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  23m Homepage  - Genres Comedy Keywords rap music wealthy family black family sitcom family of color black sitcom Content Score 100 Yes! Looking good! Top Contributors 178 t0by SG 83 Speedy Gonzales 21 lineker CN 20 Carmelo Nicolosi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}