{"link": "https://www.themoviedb.org/tv/62603?language=en", "title": "Ghosts under the Ferris Wheel", "resume": "Two kids suddenly call three very enchanted persons to reality while spending summer in their grandma's village.", "rate": 60, "genre": ["Action", "Adventure", "Comedy", "Family"], "cast": ["Katrin Raukopf", "Katja Paryla", "Stefan Lisewski", "Siegfried Seibt", "Harry Pietzsch"], "character": ["Keks", "Hexe Emma", "Riese Otto", "Rumpelstilzchen", "Leutnant Märzenbecher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62603   Expand Ghosts under the Ferris Wheel   (1979) User Score Overview Two kids suddenly call three very enchanted persons to reality while spending summer in their grandma's village. Featured Crew Günter Meyer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Katrin Raukopf Keks Katja Paryla Hexe Emma Stefan Lisewski Riese Otto Siegfried Seibt Rumpelstilzchen Harry Pietzsch Leutnant Märzenbecher Full Cast & Crew Last Season Season 1 1979 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ghosts under the Ferris Wheel. You can help by rating TV shows you've seen. Facts Original Name  Spuk unterm Riesenrad Status  Ended Network DFF 1 Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  German Runtime  23m Homepage  - Genres Action & Adventure Comedy Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 21 dannyvl 13 Elizabeth Jennings x 12 xPR CM 7 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}