{"link": "https://www.themoviedb.org/tv/67324?language=en", "title": "Crayon Shin-chan Spin-off", "resume": "Unlike the main television anime series which is mostly set in modern-day Japan, the new series will be a \"sealed room\" suspense comedy set 100 years in the future. The story begins when Shinnosuke and the entire Nohara family wake up from cold sleep to find themselves aboard a space ship drifting in space. The anime will depict the various events that take place inside the ship.", "rate": 0, "genre": ["Animation"], "cast": ["Akiko Yajima", "Miki Narahashi", "Toshiyuki Morikawa", "Satomi Kōrogi", "Mari Mashiba"], "character": ["Shinnosuke Nohara (voice)", "Misae Nohara (voice)", "Hiroshi Nohara (voice)", "Himawari Nohara (voice)", "White (voice) / Toru Kazama (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67324   Expand Crayon Shin-chan Spin-off   (2016) User Score Overview Unlike the main television anime series which is mostly set in modern-day Japan, the new series will be a \"sealed room\" suspense comedy set 100 years in the future. The story begins when Shinnosuke and the entire Nohara family wake up from cold sleep to find themselves aboard a space ship drifting in space. The anime will depict the various events that take place inside the ship. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akiko Yajima Shinnosuke Nohara (voice) Miki Narahashi Misae Nohara (voice) Toshiyuki Morikawa Hiroshi Nohara (voice) Satomi Kōrogi Himawari Nohara (voice) Mari Mashiba White (voice) / Toru Kazama (voice) Full Cast & Crew Last Season Season 4 2017 | 13 Episodes Season 4 of Crayon Shin-chan Spin-off premiered on May 31, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crayon Shin-chan Spin-off. You can help by rating TV shows you've seen. Facts Original Name  クレヨンしんちゃん外伝 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  8m Homepage   https://www.amazon.co.jp/dp/B01IWBMHNG/ Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 72 United600 C 5 Carulux1 TB 2 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}