{"link": "https://www.themoviedb.org/tv/64375?language=en", "title": "Mobile Suit Gundam: Iron-Blooded Orphans", "resume": "The year is Post Disaster 323. More than 300 years after a great war between Earth and Mars known as the \"Calamity War\", Mars has been successfully terraformed and colonized by humans. However even with the technological advancements, the humans on Mars crave freedom against the government of Earth and seek to improve their livelihoods. Furthermore, while most of Mars' nations have received autonomy, the planet is virtually dependent on Earth for economic development. A young orphan named Mikazuki Augus is part of a group of children who work for the civilian security company Chryse Guard Security, entrusted with the safety of the Martian Princess Kudelia Aina Bernstein, who has plans for her nation of Chryse to secure independence from Earth. One day, the group was attacked by the Earth Military organization Gjallarhorn, which aims to stop the Martian independence movement. During the attack, the leader of the children and the Third Army Division within CGS, Orga Itsuka, decides to rebel against the adults and higher-ups who had escaped and left the children and foot-soldiers to remain and fight as decoys. Augus must now choose to either follow his friends, or his mission as he stumbles into the legendary mobile suit: the Gundam Barbatos.", "rate": 72, "genre": ["Drama", "Animation"], "cast": ["Yoshimasa Hosoya", "Kengo Kawanishi", "Yuka Terazaki"], "character": ["Orga Itsuka", "Mikazuki Augus", "Kudelia Aina Bernstein"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64375   Expand Mobile Suit Gundam: Iron-Blooded Orphans   (2015) User Score  Play Trailer Overview The year is Post Disaster 323. More than 300 years after a great war between Earth and Mars known as the \"Calamity War\", Mars has been successfully terraformed and colonized by humans. However even with the technological advancements, the humans on Mars crave freedom against the government of Earth and seek to improve their livelihoods. Furthermore, while most of Mars' nations have received autonomy, the planet is virtually dependent on Earth for economic development. A young orphan named Mikazuki Augus is part of a group of children who work for the civilian security company Chryse Guard Security, entrusted with the safety of the Martian Princess Kudelia Aina Bernstein, who has plans for her nation of Chryse to secure independence from Earth. One day, the group was attacked by the Earth Military organization Gjallarhorn, which aims to stop the Martian independence movement. During the attack, the leader of the children and the Third Army Division within CGS, Orga Itsuka, decides to rebel against the adults and higher-ups who had escaped and left the children and foot-soldiers to remain and fight as decoys. Augus must now choose to either follow his friends, or his mission as he stumbles into the legendary mobile suit: the Gundam Barbatos. Featured Crew Tatsuyuki Nagai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshimasa Hosoya Orga Itsuka Kengo Kawanishi Mikazuki Augus Yuka Terazaki Kudelia Aina Bernstein Full Cast & Crew Last Season Season 2 2016 | 25 Episodes Season 2 of Mobile Suit Gundam: Iron-Blooded Orphans premiered on October  2, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   2007-10-06 Mobile Suit Gundam 00 7.2  Facts Original Name  機動戦士ガンダム 鉄血のオルフェンズ Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://g-tekketsu.com/index.html Genres Drama Animation Keywords politics mecha gundam anime Content Score 71 Just a little bit more... Top Contributors J 20 Json188 13 sp1ti 12 Kenta Nomura f 12 fanqing  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}