{"link": "https://www.themoviedb.org/tv/52243?language=en", "title": "August Strindberg: Ett liv", "resume": "A mini-series about the life of Swedish playwright, novelist, poet, essayist and painter, August Strindberg. He is portrayed as a misogynous, selfish and racial. And he loses everything, for the sake of the art.", "rate": 0, "genre": ["Drama"], "cast": ["Thommy Berggren", "Stina Ekblad", "Tomas Bolme", "Göran Stangertz", "Stellan Skarsgård"], "character": ["August Strindberg", "Siri von Essen", "Hjalmar Branting", "Carl Larsson", "Verner von Heidenstam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52243   Expand August Strindberg: Ett liv   (1985) User Score Overview A mini-series about the life of Swedish playwright, novelist, poet, essayist and painter, August Strindberg. He is portrayed as a misogynous, selfish and racial. And he loses everything, for the sake of the art. Featured Crew Kjell Grede Creator Johan Bergenstråhle Creator Per-Olof Enquist Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thommy Berggren August Strindberg Stina Ekblad Siri von Essen Tomas Bolme Hjalmar Branting Göran Stangertz Carl Larsson Stellan Skarsgård Verner von Heidenstam Full Cast & Crew Last Season Season 1 1985 | 6 Episodes Season 1 of August Strindberg: Ett liv premiered on February 18, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on August Strindberg: Ett liv. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  Swedish Runtime  383m Homepage  - Genres Drama Keywords biography Content Score 79 Pump it up! We're close now. Top Contributors n 32 nicovicen 11 Ulf Kjell Gür VA 7 Viktor Andersson TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}