{"link": "https://www.themoviedb.org/tv/68402?language=en", "title": "Matoi the Sacred Slayer", "resume": "There are two girls who are in training to become Miko at the Tema Shrine: Matoi Sumeragi and Yuma Kusanagi. Matoi Sumeragi lived with her grandparents on her father's side because her mother left her since she was young, until the second year of junior high school when she finally was able to live with her father since three months ago. Matoi yearns to live a simple life. Yuma Kusanagi is the daughter of a family who lives at the shrine and is expected to become the next Miko. She knows that her ancestor used Taimakou, a technique to exorcise evil spirits and invites Matoi to challenge the ritual called Kamikagari using the skill of Taimakou. One day after school on the way to the shrine, the two girls go to meet Yuma's parents, but discover that they have fallen in pain. Shingo, who is Matoi's father, and a police officer involved in investigating the case, discover a man giving off an unusual aura. To stop this man, Yuma calls out Kamikagari, but something happens to Matoi. The girl who yearns for a simple life has a power to exorcise evil spirits? In order to get her simple life back, she goes on a task to exorcise evil spirits.", "rate": 60, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68402   Expand Matoi the Sacred Slayer   (2016) User Score  Play Trailer Overview There are two girls who are in training to become Miko at the Tema Shrine: Matoi Sumeragi and Yuma Kusanagi. Matoi Sumeragi lived with her grandparents on her father's side because her mother left her since she was young, until the second year of junior high school when she finally was able to live with her father since three months ago. Matoi yearns to live a simple life. Yuma Kusanagi is the daughter of a family who lives at the shrine and is expected to become the next Miko. She knows that her ancestor used Taimakou, a technique to exorcise evil spirits and invites Matoi to challenge the ritual called Kamikagari using the skill of Taimakou. One day after school on the way to the shrine, the two girls go to meet Yuma's parents, but discover that they have fallen in pain. Shingo, who is Matoi's father, and a police officer involved in investigating the case, discover a man giving off an unusual aura. To stop this man, Yuma calls out Kamikagari, but something happens to Matoi. The girl who yearns for a simple life has a power to exorcise evil spirits? In order to get her simple life back, she goes on a task to exorcise evil spirits. Featured Crew Masayuki Sakoi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Matoi the Sacred Slayer premiered on October  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Matoi the Sacred Slayer. You can help by rating TV shows you've seen. Facts Original Name  装神少女まとい Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.matoi-anime.com/ Genres Animation Comedy Sci-Fi & Fantasy Keywords fantasy Content Score 71 Just a little bit more... Top Contributors 18 iliass guendouz z 5 zurman1 5 Despair-Paradise 5 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}