{"link": "https://www.themoviedb.org/tv/41040?language=en", "title": "Die Rote Meile", "resume": "Die Rote Meile is a German television drama that aired on Sat.1 and follows the lives of strippers, prostitutes and their pimps in the district of St. Pauli in Hamburg. The first season premiered on 1 October 1999 and consisted 26 episodes. The show was a rival to the RTL drama Hinter Gittern - Der Frauenknast; both airing in the same time-slot - Monday nights at 9:15 pm. A second season was ordered by the network in the spring of 2000 and started airing on Thursday nights at 8:15 pm on 14 December 2000. The show was canceled in the beginning of 2001, airing its last episode on 8 March 2001.", "rate": 0, "genre": ["Drama"], "cast": ["Ann-Cathrin Sudhoff", "Fabian Harloff", "Leon Boden", "Christiane Hagemann", "Yasmina Filali"], "character": ["Annette Verhoven", "Andreas Verhoven", "Johnny Roland", "Gitti", "Yvonne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41040   Expand Die Rote Meile   (1999) User Score Overview Die Rote Meile is a German television drama that aired on Sat.1 and follows the lives of strippers, prostitutes and their pimps in the district of St. Pauli in Hamburg. The first season premiered on 1 October 1999 and consisted 26 episodes. The show was a rival to the RTL drama Hinter Gittern - Der Frauenknast; both airing in the same time-slot - Monday nights at 9:15 pm. A second season was ordered by the network in the spring of 2000 and started airing on Thursday nights at 8:15 pm on 14 December 2000. The show was canceled in the beginning of 2001, airing its last episode on 8 March 2001. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ann-Cathrin Sudhoff Annette Verhoven Fabian Harloff Andreas Verhoven Leon Boden Johnny Roland Christiane Hagemann Gitti Yasmina Filali Yvonne Full Cast & Crew Last Season Season 2 2001 | 13 Episodes Season 2 of Die Rote Meile premiered on December 14, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Die Rote Meile. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors S 29 Samara 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}