{"link": "https://www.themoviedb.org/tv/77583?language=en", "title": "Little Dog", "resume": "Pro-boxer Tommy “Little Dog” Ross (JOEL THOMAS HYNES), the favourite to win a Championship Belt, has a world-class meltdown in the middle of the fight and walks out of the ring. We meet up with him again five years later, living a life of general self-destruction, when he is caught on video in a bar fight, prompting old rival Rico “Havoc” St. George (DWAIN MURPHY) to challenge him to a title rematch. Tommy struggles to get the noise of his strong-willed family out of his head in order to make the decision of whether or not to get back in the ring.", "rate": 0, "genre": ["Comedy"], "cast": ["Joel Thomas Hynes", "Ger Ryan", "Katharine Isabelle"], "character": ["Tommy Ross", "Sylvia Ross", "Ginny Ross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77583   Expand Little Dog   (2018) User Score Overview Pro-boxer Tommy “Little Dog” Ross (JOEL THOMAS HYNES), the favourite to win a Championship Belt, has a world-class meltdown in the middle of the fight and walks out of the ring. We meet up with him again five years later, living a life of general self-destruction, when he is caught on video in a bar fight, prompting old rival Rico “Havoc” St. George (DWAIN MURPHY) to challenge him to a title rematch. Tommy struggles to get the noise of his strong-willed family out of his head in order to make the decision of whether or not to get back in the ring. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joel Thomas Hynes Tommy Ross Ger Ryan Sylvia Ross Katharine Isabelle Ginny Ross Full Cast & Crew Current Season Season 1 2018 | 7 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Little Dog. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cbc.ca/littledog/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 10 joeynotjoe g 6 grantleicester c 5 crkvice 1 Maretoh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}