{"link": "https://www.themoviedb.org/tv/61929?language=en", "title": "The Jinx: The Life and Deaths of Robert Durst", "resume": "Robert Durst, scion of one of New York’s billionaire real estate families, has been accused of three murders but never convicted. Brilliant, reclusive, and the subject of relentless media scrutiny, he’s never spoken publicly—until now. During interviews with Andrew Jarecki, he reveals secrets of the case that baffled authorities for 30 years. In 2010, Jarecki made the narrative film All Good Things based on the infamous story of Robert Durst. After Durst saw the film, he contacted Jarecki wanting to tell his story. What began as a feature documentary ultimately became a six-part series as more and more of his incredible story was revealed.", "rate": 81, "genre": ["Documentary"], "cast": ["Robert Durst", "Andrew Jarecki", "Marc Smerling", "Zachary Stuart-Pontier", "Lynda Obst"], "character": ["Himself", "Himself", "Himself", "Himself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61929   Expand The Jinx: The Life and Deaths of Robert Durst   (2015) User Score  Play Trailer Overview Robert Durst, scion of one of New York’s billionaire real estate families, has been accused of three murders but never convicted. Brilliant, reclusive, and the subject of relentless media scrutiny, he’s never spoken publicly—until now. During interviews with Andrew Jarecki, he reveals secrets of the case that baffled authorities for 30 years. In 2010, Jarecki made the narrative film All Good Things based on the infamous story of Robert Durst. After Durst saw the film, he contacted Jarecki wanting to tell his story. What began as a feature documentary ultimately became a six-part series as more and more of his incredible story was revealed. Featured Crew Andrew Jarecki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Durst Himself Andrew Jarecki Himself Marc Smerling Himself Zachary Stuart-Pontier Himself Lynda Obst Herself Full Cast & Crew Last Season Season 1 2015 | 6 Episodes Season 1 of The Jinx: The Life and Deaths of Robert Durst premiered on February  8, 2015. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply The head Open 1 by  mechajutaro A Documentaries Open 0 by Ajja\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2015-12-18 Making a Murderer 7.8    2005-04-04 The Staircase 7.9    2003-11-02 Arrested Development 8.2    2010-06-29 Louie 7.7    Jonestown: The Life and Death of Peoples Temple 8.2    2001-07-09 The Office 8.1    2007-06-17 Flight of the Conchords 7.9    2000-10-15 Curb Your Enthusiasm 8.1  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  - Homepage   http://www.hbo.com/the-jinx-the-life-and-deaths-of-robert-durst Genres Documentary Keywords murder miniseries crime true crime murder investigation multiple murders real life new york elite Content Score 100 Yes! Looking good! Top Contributors TB 29 TMDb Bot 26 Elizabeth Jennings F 9 FreemanUS 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}