{"link": "https://www.themoviedb.org/tv/13399?language=en", "title": "Timothy Goes to School", "resume": "Timothy Goes to School is a cartoon series based on the Yoko series and other individual books by Rosemary Wells such as \"Shy Charles\", \"Fritz and the Mess Fairy\" and \"Noisy Nora\", but is titled after the book of the same name.\nIt features a young raccoon, Timothy, who attends a fictional primary school. The series aired on PBS Kids as part of the PBS Kids Bookworm Bunch from 2000 until 2004. Reruns were later broadcast on Discovery Kids in the US until 2006. This show airs on YTV, Treehouse TV, and TVO Kids in Canada, and also Tiny Pop, a digital TV channel in the UK. In Brazil was aired on TV Cultura. In Mexico and Latin America, was broadcast on ZAZ. The series premiered on September 30, 2000 and aired its last episode on December 28, 2001.", "rate": 0, "genre": ["Animation"], "cast": ["Alyson Court", "Rob Stefaniuk", "Max Morrow", "Joanne Vannicola", "Fiona Reid"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13399   Expand Timothy Goes to School   (2000) User Score Overview Timothy Goes to School is a cartoon series based on the Yoko series and other individual books by Rosemary Wells such as \"Shy Charles\", \"Fritz and the Mess Fairy\" and \"Noisy Nora\", but is titled after the book of the same name. It features a young raccoon, Timothy, who attends a fictional primary school. The series aired on PBS Kids as part of the PBS Kids Bookworm Bunch from 2000 until 2004. Reruns were later broadcast on Discovery Kids in the US until 2006. This show airs on YTV, Treehouse TV, and TVO Kids in Canada, and also Tiny Pop, a digital TV channel in the UK. In Brazil was aired on TV Cultura. In Mexico and Latin America, was broadcast on ZAZ. The series premiered on September 30, 2000 and aired its last episode on December 28, 2001. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alyson Court Rob Stefaniuk Max Morrow Joanne Vannicola Fiona Reid Full Cast & Crew Last Season Season 2 2001 | 13 Episodes Season 2 of Timothy Goes to School premiered on September  4, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Timothy Goes to School. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 3 NathanChampion  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}