{"link": "https://www.themoviedb.org/tv/6357?language=en", "title": "The Twilight Zone", "resume": "A series of unrelated stories containing drama, psychological thriller, fantasy, science fiction, suspense, and/or horror, often concluding with a macabre or unexpected twist.", "rate": 82, "genre": ["Comedy", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Rod Serling"], "character": ["Himself/Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6357   Expand The Twilight Zone   (1959) User Score  Play Trailer Overview A series of unrelated stories containing drama, psychological thriller, fantasy, science fiction, suspense, and/or horror, often concluding with a macabre or unexpected twist. Featured Crew Rod Serling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  20 Content Issues  1 Images Backdrops  21 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Rod Serling Himself/Host Full Cast & Crew Last Season Season 5 1963 | 36 Episodes View All Seasons Social Reviews  0 Discussions  21 Subject Status Replies Last Reply w Season 3. Episode 8.  \"It's a Good Life\" Open 12 by  Jayhn1111 D Lousiest  special effect Open 6 by  Tresix M Beyond is another dimension. A dimension of sound. a dimension of sight... Open 1 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  2 Backdrops  21 Posters  9 Recommendations   1963-09-16 The Outer Limits 7.8    1985-09-27 The Twilight Zone 7.4    1955-10-02 Alfred Hitchcock Presents 7.8    1989-06-10 Tales from the Crypt 7.7    1988-11-24 Mystery Science Theater 3000 7.8    1964-09-26 Gilligan's Island 6.6    1951-06-15 I Love Lucy 7.6    1995-03-26 The Outer Limits 8.0  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.cbs.com/shows/the_twilight_zone/ Genres Comedy Drama Mystery Sci-Fi & Fantasy Keywords escape irony anthology misfit second chance Content Score 71 Just a little bit more... Top Contributors 54 lineker PE 27 Patrick E. Abe 23 Steve e 19 enzo94  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}