{"link": "https://www.themoviedb.org/tv/40084?language=en", "title": "The Voice of Ireland", "resume": "The Voice of Ireland is the Irish edition of the international TV franchise The Voice, a reality singing competition created by media tycoon John de Mol. The first series began airing from 8 January 2012 on RTÉ One. The coaches originally were Bressie, Sharon Corr, Kian Egan and Brian Kennedy. Kennedy left after the first series and was replaced by Jamelia. After the second series Sharon Corr quit the show owing to other commitments. The show is hosted by Kathryn Thomas and co-hosted by Eoghan McDermott.\nThe series is part of the The Voice franchise and is based on a similar competition format in the Netherlands entitled The Voice of Holland. One of the important premises of the show is the quality of the singing talent. Four coaches, themselves popular performing artists, train the talents in their group and occasionally perform with them. Talents are selected in blind auditions, where the coaches cannot see, but only hear the auditioner.\nThe TV show \"blind\" auditions were held at the The Helix, and broadcast for the first five weeks of the series. The Battle Phase was broadcast over three weeks from 12 February to 26 February. The winner of the show will be offered a recording contract with Universal Music Ireland worth €100,000.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40084   Expand The Voice of Ireland   (2012) User Score Overview The Voice of Ireland is the Irish edition of the international TV franchise The Voice, a reality singing competition created by media tycoon John de Mol. The first series began airing from 8 January 2012 on RTÉ One. The coaches originally were Bressie, Sharon Corr, Kian Egan and Brian Kennedy. Kennedy left after the first series and was replaced by Jamelia. After the second series Sharon Corr quit the show owing to other commitments. The show is hosted by Kathryn Thomas and co-hosted by Eoghan McDermott. The series is part of the The Voice franchise and is based on a similar competition format in the Netherlands entitled The Voice of Holland. One of the important premises of the show is the quality of the singing talent. Four coaches, themselves popular performing artists, train the talents in their group and occasionally perform with them. Talents are selected in blind auditions, where the coaches cannot see, but only hear the auditioner. The TV show \"blind\" auditions were held at the The Helix, and broadcast for the first five weeks of the series. The Battle Phase was broadcast over three weeks from 12 February to 26 February. The winner of the show will be offered a recording contract with Universal Music Ireland worth €100,000. Featured Crew John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2016 | 2 Episodes Season 5 of The Voice of Ireland premiered on January  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Voice of Ireland. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.rte.ie/blogs/thevoice/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 Elizabeth Jennings d 2 diwasta a 1 apung21  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}