{"link": "https://www.themoviedb.org/tv/2604?language=en", "title": "The Boondocks", "resume": "The Boondocks is an American adult animated sitcom on Cartoon Network's late night programming block, Adult Swim. The series premiered on November 6, 2005 and was created by Aaron McGruder, based upon McGruder's comic strip of the same name. The show begins with an African-American family, the Freemans, having moved from the South Side of Chicago, Illinois to the fictional, peaceful and mostly white suburb of Woodcrest. The perspective offered by this mixture of cultures, lifestyles, socioeconomic classes, stereotypes, and races provides for much of the comedy and conflict in this series.\nThere have been a total of 45 episodes over the course of the shows first three seasons. The two part season two finale \"The Hunger Strike\" and \"The Uncle Ruckus Reality Show\" was never aired on American television as Adult Swim feared legal actions against them from BET. Both episodes were aired on Teletoon and were released on DVD in the United States. The season three episodes \"Pause\" and \"The Story of Jimmy Rebel\" have been pulled from general episode rotation following the television debuts and no longer appear in reruns. A fourth season containing twenty episodes has been announced to air in January 2014.", "rate": 78, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Jill Talley", "Regina King", "John Witherspoon", "Cedric Yarbrough", "Gary Anthony Williams"], "character": ["Sarah Dubois (voice)", "Riley Freeman (voice)", "Robert Jebediah Freeman (voice)", "Tom Dubois (voice)", "Uncle Ruckus (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2604   Expand The Boondocks   (2005) User Score  Play Trailer Overview The Boondocks is an American adult animated sitcom on Cartoon Network's late night programming block, Adult Swim. The series premiered on November 6, 2005 and was created by Aaron McGruder, based upon McGruder's comic strip of the same name. The show begins with an African-American family, the Freemans, having moved from the South Side of Chicago, Illinois to the fictional, peaceful and mostly white suburb of Woodcrest. The perspective offered by this mixture of cultures, lifestyles, socioeconomic classes, stereotypes, and races provides for much of the comedy and conflict in this series. There have been a total of 45 episodes over the course of the shows first three seasons. The two part season two finale \"The Hunger Strike\" and \"The Uncle Ruckus Reality Show\" was never aired on American television as Adult Swim feared legal actions against them from BET. Both episodes were aired on Teletoon and were released on DVD in the United States. The season three episodes \"Pause\" and \"The Story of Jimmy Rebel\" have been pulled from general episode rotation following the television debuts and no longer appear in reruns. A fourth season containing twenty episodes has been announced to air in January 2014. Featured Crew Aaron McGruder Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jill Talley Sarah Dubois (voice) Regina King Riley Freeman (voice) John Witherspoon Robert Jebediah Freeman (voice) Cedric Yarbrough Tom Dubois (voice) Gary Anthony Williams Uncle Ruckus (voice) Full Cast & Crew Last Season Season 4 2014 | 10 Episodes Season 4 of The Boondocks premiered on April 21, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Absolutely brilliant show Open 0 by movie_nazi\n      \n     IBM Refugees are now officially the Katrinians!! Ep 9 Season 2. Open 0 by Norrin_Radd_Of_Zenn_La\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  2 Recommendations   2000-12-30 Aqua Teen Hunger Force 7.2    1999-09-24 Mission Hill 7.3    2004-08-07 The Venture Bros. 8.2    2007-05-13 Superjail! 7.5    2000-12-21 Sealab 2021 7.8    1994-12-19 The Head 7.3    2004-11-07 Squidbillies 6.2    1994-09-10 The Tick 7.7  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m, 30m, 420m Homepage   http://www.theboondockstv.com/ Genres Animation Action & Adventure Comedy Keywords based on comic racism adult animation black family Content Score 100 Yes! Looking good! Top Contributors 21 Banana 6 Elizabeth Jennings A 3 AnthonyAtkins232 3 HRVTH  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}