{"link": "https://www.themoviedb.org/tv/65633?language=en", "title": "Teenagers", "resume": "A web series that deals with teen angst, race, sexuality and more through the eyes of several off-beat Canadian teenagers as they navigate their way through High School.", "rate": 0, "genre": ["Drama"], "cast": ["Allyson Pratt", "Jas Dhanda", "Nykeem Provo", "Dana Jeffrey", "Chloe Rose"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65633   Expand Teenagers   (2014) User Score  Play Trailer Overview A web series that deals with teen angst, race, sexuality and more through the eyes of several off-beat Canadian teenagers as they navigate their way through High School. Featured Crew M. H. Murray Creator Sara Tamosauskas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Allyson Pratt Jas Dhanda Nykeem Provo Dana Jeffrey Chloe Rose Full Cast & Crew Last Season Season 1 2014 | 8 Episodes Season 1 of Teenagers premiered on January 19, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Teenagers. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Teenagers. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  10m, 7m, 17m Homepage   http://www.teenagerswebseries.ca/ Genres Drama Keywords sexuality teen angst racism high school friends teenage romance popular teens Content Score 100 Yes! Looking good! Top Contributors 28 Craig Ettinger 14 janar 7 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}