{"link": "https://www.themoviedb.org/tv/16584?language=en", "title": "Cousins", "resume": "Cousins is a nature documentary TV series produced by the BBC Natural History Unit in Bristol, England, first transmitted in the UK on BBC One in August 2000. The series looks at the primates, the closest living relatives to human beings.\nThe series marked the debut as a television presenter of Charlotte Uhlenbroek, a 32-year-old primatologist who had worked with Jane Goodall at Gombe Stream studying chimpanzee behaviour. Over the course of the three, 50 minute episodes, Uhlenbroek encounters many species of primate, from the lemurs of Madagascar to the mountain gorillas of Rwanda. The animal behaviour filmed is used to explain the origins of primates and the development of skills and adaptations that have enabled human beings to become the most successful primate of all.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16584   Expand Cousins   (2000) User Score Overview Cousins is a nature documentary TV series produced by the BBC Natural History Unit in Bristol, England, first transmitted in the UK on BBC One in August 2000. The series looks at the primates, the closest living relatives to human beings. The series marked the debut as a television presenter of Charlotte Uhlenbroek, a 32-year-old primatologist who had worked with Jane Goodall at Gombe Stream studying chimpanzee behaviour. Over the course of the three, 50 minute episodes, Uhlenbroek encounters many species of primate, from the lemurs of Madagascar to the mountain gorillas of Rwanda. The animal behaviour filmed is used to explain the origins of primates and the development of skills and adaptations that have enabled human beings to become the most successful primate of all. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 — | 3 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cousins. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/nature/programmes/tv/cousins/ Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}