{"link": "https://www.themoviedb.org/tv/53606?language=en", "title": "Love", "resume": "Rebellious Mickey and good-natured Gus navigate the thrills and agonies of modern relationships.", "rate": 75, "genre": ["Comedy", "Drama"], "cast": ["Gillian Jacobs", "Paul Rust", "Jordan Rock", "Brett Gelman", "Mike Mitchell"], "character": ["Mickey Dobbs", "Gus Cruikshan", "Kevin", "Dr. Greg Colter", "Randy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53606   Expand Love   (2016) User Score  Play Trailer Overview Rebellious Mickey and good-natured Gus navigate the thrills and agonies of modern relationships. Featured Crew Paul Rust Creator Lesley Arfin Creator Judd Apatow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gillian Jacobs Mickey Dobbs Paul Rust Gus Cruikshan Jordan Rock Kevin Brett Gelman Dr. Greg Colter Mike Mitchell Randy Full Cast & Crew Current Season Season 3 2018 | 12 Episodes Season 3 of Love premiered on March  9, 2018. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply w Arya: Happy Birthday Iris Apatow! Open 0 by wonder2wonder\n      \n     Rewatched the first episode Open 2 by  domremy Is This the Male Version of Girls? Open 0 by HoneyWest\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  6 Posters  7 Recommendations   2015-11-06 Master of None 8.0    2015-12-01 Real Rob 5.8    2015-10-06 Chewing Gum 7.0    2017-04-21 Girlboss 6.8    2016-03-11 Flaked 7.2    2015-04-26 HAPPYish 6.9    2013-05-03 Maron 6.9    2017-07-14 Friends from College 6.8  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  37m, 27m, 32m Homepage   http://www.netflix.com/title/80026506 Genres Comedy Drama Keywords romance love hollywood los angeles couple addict millenials Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings 23 cobain 14 lmao7 14 Bendik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}