{"link": "https://www.themoviedb.org/tv/35339?language=en", "title": "Alcatraz", "resume": "Alcatraz is an American television series created by Elizabeth Sarnoff, Steven Lilien and Bryan Wynbrandt, and produced by J. J. Abrams and Bad Robot Productions. The series premiered on Fox on January 16, 2012, as a mid-season replacement. Switching between eras, the series focuses on the Alcatraz prison, which was allegedly shut down in 1963 due to unsafe conditions for its prisoners and guards. The show's premise is that both the prisoners and the guards disappeared in 1963 and have abruptly reappeared in modern-day San Francisco, where they are being tracked down by a government agency. The series starred Sarah Jones, Jorge Garcia, Sam Neill and Parminder Nagra. The show was cancelled on May 9, 2012.", "rate": 62, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["Sarah Jones", "Sam Neill", "Jorge Garcia", "Parminder Nagra", "Jason Butler Harner"], "character": ["Rebecca Madsen", "Emerson Hauser", "Diego Soto", "Lucy Banerjee", "E.B. Tiller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35339   Expand Alcatraz   (2012) User Score  Play Trailer Overview Alcatraz is an American television series created by Elizabeth Sarnoff, Steven Lilien and Bryan Wynbrandt, and produced by J. J. Abrams and Bad Robot Productions. The series premiered on Fox on January 16, 2012, as a mid-season replacement. Switching between eras, the series focuses on the Alcatraz prison, which was allegedly shut down in 1963 due to unsafe conditions for its prisoners and guards. The show's premise is that both the prisoners and the guards disappeared in 1963 and have abruptly reappeared in modern-day San Francisco, where they are being tracked down by a government agency. The series starred Sarah Jones, Jorge Garcia, Sam Neill and Parminder Nagra. The show was cancelled on May 9, 2012. Featured Crew Elizabeth Sarnoff Creator Bryan Wynbrandt Creator Steven Lilien Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  11 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Jones Rebecca Madsen Sam Neill Emerson Hauser Jorge Garcia Diego Soto Parminder Nagra Lucy Banerjee Jason Butler Harner E.B. Tiller Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Alcatraz premiered on January 16, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply MK Cool Show With An Interesting Concept Open 0 by Maria Kelly\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  8 Recommendations   2012-01-25 Touch 6.7    2011-09-26 Terra Nova 6.3    2010-09-20 The Event 6.2    2013-11-17 Almost Human 7.0    2009-11-03 V 6.2    2004-07-11 The 4400 6.9    2009-09-24 FlashForward 6.9    2012-09-17 Revolution 6.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.fox.com/programming/shows/?sh=alcatraz Genres Action & Adventure Drama Mystery Keywords san francisco time travel alcatraz disappearance police detective escaped prisoner Content Score 100 Yes! Looking good! Top Contributors 21 Elizabeth Jennings f 17 furkan-guven0115 b 14 bestiada t 13 tinu88  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}