{"link": "https://www.themoviedb.org/tv/68727?language=en", "title": "Brown Nation", "resume": "Hasmukh operates a small IT Consulting company \"Shree Ganesh Computers Limited Inc\" in Queens, NY. Staffed by a disinterested and lazy cast of characters, his business flounders. His home life is not much better. His wife Dimple, a frustrated and jobless artist, complains constantly about not having enough time to explore her creativity because of the demands of taking care of her dog, Bobby. Hasmukh tries desperately to balance his work and family, but neither seem to have his best interest at heart.", "rate": 73, "genre": ["Comedy"], "cast": ["Rajeev Varma", "Shenaz Treasury", "Melanie Chandra", "Doug E. Doug", "Omi Vaidya"], "character": ["Hasmukh", "Dimple", "Roli", "Lemont", "Balan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68727   Expand Brown Nation   (2016) User Score  Play Trailer Overview Hasmukh operates a small IT Consulting company \"Shree Ganesh Computers Limited Inc\" in Queens, NY. Staffed by a disinterested and lazy cast of characters, his business flounders. His home life is not much better. His wife Dimple, a frustrated and jobless artist, complains constantly about not having enough time to explore her creativity because of the demands of taking care of her dog, Bobby. Hasmukh tries desperately to balance his work and family, but neither seem to have his best interest at heart. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rajeev Varma Hasmukh Shenaz Treasury Dimple Melanie Chandra Roli Doug E. Doug Lemont Omi Vaidya Balan Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Brown Nation premiered on November 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations   2015-06-12 Conspiracy 5.7    2012-10-16 The Strange Calls 6.8    2015-05-24 Tales by Light 7.8  Facts Status  Ended Networks - Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  20m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 14 Warpath 7 MichelD MP 5 Mr. Peanutbutter 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}