{"link": "https://www.themoviedb.org/tv/9491?language=en", "title": "Playing the Field", "resume": "The on-the-field trials and tribulations and the off-the-field lives, loves and infidelities of 'The Castlefield Blues', an under funded, badly managed ladies football team from South Yorkshire in the north of England whose loyalty to the team, the game and each other far exceeds their chances of ever winning the championship.", "rate": 0, "genre": ["Drama"], "cast": ["Marsha Thomason", "Gaynor Faye", "Debra Stephenson", "Lorraine Ashbourne", "Lesley Sharp"], "character": ["Sharon Pearce", "Holly Quinn", "Diane Powell", "Geraldine Powell", "Theresa Mullen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9491   Expand Playing the Field   (1998) User Score Overview The on-the-field trials and tribulations and the off-the-field lives, loves and infidelities of 'The Castlefield Blues', an under funded, badly managed ladies football team from South Yorkshire in the north of England whose loyalty to the team, the game and each other far exceeds their chances of ever winning the championship. Featured Crew Kay Mellor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marsha Thomason Sharon Pearce Gaynor Faye Holly Quinn Debra Stephenson Diane Powell Lorraine Ashbourne Geraldine Powell Lesley Sharp Theresa Mullen Full Cast & Crew Last Season Season 5 2002 | 6 Episodes Season 5 of Playing the Field premiered on January  6, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Playing the Field. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords american football yorkshire south yorkshire Content Score 79 Pump it up! We're close now. Top Contributors R 6 Rebecca L 6 Leah 4 Markxist 4 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}