{"link": "https://www.themoviedb.org/tv/2093?language=en", "title": "Matlock", "resume": "Matlock is an American television legal drama, starring Andy Griffith in the title role of criminal defense attorney Ben Matlock. The show, produced by The Fred Silverman Company, Dean Hargrove Productions, Viacom Productions and Paramount Television originally aired from September 23, 1986 to May 8, 1992 on NBC; and from November 5, 1992 until May 7, 1995 on ABC.\nThe show's format is similar to that of CBS's Perry Mason, with Matlock identifying the perpetrators and then confronting them in dramatic courtroom scenes. One difference, however, was that whereas Mason usually exculpated his clients at a pretrial hearing, Matlock usually secured an acquittal at trial, from the jury.", "rate": 72, "genre": ["Crime", "Drama"], "cast": ["Andy Griffith", "Julie Sommars", "Clarence Gilyard Jr.", "Brynn Thayer", "Daniel Roebuck"], "character": ["Ben Matlock", "Julie March", "Conrad McMasters", "Leanne McIntyre", "Cliff Lewis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2093   Expand Matlock   (1986) User Score Overview Matlock is an American television legal drama, starring Andy Griffith in the title role of criminal defense attorney Ben Matlock. The show, produced by The Fred Silverman Company, Dean Hargrove Productions, Viacom Productions and Paramount Television originally aired from September 23, 1986 to May 8, 1992 on NBC; and from November 5, 1992 until May 7, 1995 on ABC. The show's format is similar to that of CBS's Perry Mason, with Matlock identifying the perpetrators and then confronting them in dramatic courtroom scenes. One difference, however, was that whereas Mason usually exculpated his clients at a pretrial hearing, Matlock usually secured an acquittal at trial, from the jury. Featured Crew Dean Hargrove Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Andy Griffith Ben Matlock Julie Sommars Julie March Clarence Gilyard Jr. Conrad McMasters Brynn Thayer Leanne McIntyre Daniel Roebuck Cliff Lewis Full Cast & Crew Last Season Season 9 1994 | 18 Episodes Season 9 of Matlock premiered on October 13, 1994. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply M Why can't all these whippersnapper lawyers on TV be more like Matchlock? Open 1 by  VinTinKin Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   1981-11-24 Simon & Simon 6.6    1970-09-16 McCloud 7.0    1987-09-26 Jake and the Fatman 4.9    1965-09-18 I Dream of Jeannie 7.1    1971-09-14 Cannon 5.6    1983-10-03 Scarecrow and Mrs. King 5.5    1993-10-29 Diagnosis: Murder 6.5    1984-09-19 Highway to Heaven 6.1  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Crime Drama Keywords lawyer courtroom elderly criminal defence lawyer Content Score 100 Yes! Looking good! Top Contributors 25 Banana m 10 mode2 5 TheOneManBoxOffice 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}