{"link": "https://www.themoviedb.org/tv/78017?language=en", "title": "Roeng", "resume": "The mayor of Roeng finds his municipality Roeng insanely rich after a 15-year-old finds gold in investing the municipality's savings in hedge funds, making the target of going into space.", "rate": 0, "genre": ["Comedy"], "cast": ["Fridtjov Såheim", "Otto Jespersen", "Renate Reinsve", "Arnhild Litleré", "Ingunn Beate Øyen"], "character": ["Tom", "Gøran", "Lena", "Bjørg", "Gunn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78017   Expand Roeng   (2018) User Score Overview The mayor of Roeng finds his municipality Roeng insanely rich after a 15-year-old finds gold in investing the municipality's savings in hedge funds, making the target of going into space. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fridtjov Såheim Tom Otto Jespersen Gøran Renate Reinsve Lena Arnhild Litleré Bjørg Ingunn Beate Øyen Gunn Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Roeng premiered on March  2, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Roeng. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Norwegian Runtime  22m Homepage   https://sumo.tv2.no/programmer/humor/roeng/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 27 Bendik 10 Eramik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}