{"link": "https://www.themoviedb.org/tv/786?language=en", "title": "Vic Reeves Big Night Out", "resume": "Vic Reeves Big Night Out is a British cult comedy stage show and later TV series which ran on Channel 4 for two series in 1990 and 1991, as well as a New Year special. It marked the beginnings of the collaboration between Vic Reeves and Bob Mortimer and started their Vic and Bob comedy double act.\nThe show was later acknowledged as a seminal force in British comedy throughout the 1990s and which continues to the present day.\nArguably the most surreal of the pair's work, Vic Reeves Big Night Out was effectively a parody of the variety shows which dominated the early years of television, but which were, by the early 1990s, falling from grace. Vic, introduced by Patrick Allen as \"Britain's Top Light Entertainer and Singer\", would sit behind a cluttered desk talking nonsense and introducing the various segments and surreal guests on the show. Vic Reeves Big Night Out is notable as the only time in their career where Vic solely took the role of host, while Bob was consigned to the back stage, appearing every few minutes as either himself or as a strange character. The two received equal billing in the series credits.\nOn 3 October 2007, the first episode was re-broadcast on More4 as part of Channel 4 at 25, a season of classic Channel 4 programmes shown to celebrate the channel's 25th birthday.", "rate": 90, "genre": ["Comedy"], "cast": ["Bob Mortimer", "Vic Reeves"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 786   Expand Vic Reeves Big Night Out   (1990) User Score Overview Vic Reeves Big Night Out is a British cult comedy stage show and later TV series which ran on Channel 4 for two series in 1990 and 1991, as well as a New Year special. It marked the beginnings of the collaboration between Vic Reeves and Bob Mortimer and started their Vic and Bob comedy double act. The show was later acknowledged as a seminal force in British comedy throughout the 1990s and which continues to the present day. Arguably the most surreal of the pair's work, Vic Reeves Big Night Out was effectively a parody of the variety shows which dominated the early years of television, but which were, by the early 1990s, falling from grace. Vic, introduced by Patrick Allen as \"Britain's Top Light Entertainer and Singer\", would sit behind a cluttered desk talking nonsense and introducing the various segments and surreal guests on the show. Vic Reeves Big Night Out is notable as the only time in their career where Vic solely took the role of host, while Bob was consigned to the back stage, appearing every few minutes as either himself or as a strange character. The two received equal billing in the series credits. On 3 October 2007, the first episode was re-broadcast on More4 as part of Channel 4 at 25, a season of classic Channel 4 programmes shown to celebrate the channel's 25th birthday. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Mortimer Vic Reeves Full Cast & Crew Last Season Season 2 1991 | 8 Episodes Season 2 of Vic Reeves Big Night Out premiered on February 27, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Vic Reeves Big Night Out. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords surreal parody sketch comedy british humour Content Score 56 We're so close, yet so far. Top Contributors O 9 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}