{"link": "https://www.themoviedb.org/tv/531?language=en", "title": "Saved by the Bell: The New Class", "resume": "Saved by the Bell: The New Class is a spin-off of the Saved by the Bell series which ran from September 11, 1993 to January 8, 2000. The series lasted for seven seasons on NBC as a part of the network's TNBC Saturday morning line-up. It was the fourth incarnation of the franchise.\nThe show had the same concept as the original series but featured a new group of students now roaming the halls of the fictional Bayside High School. Mr. Belding, played by Dennis Haskins, remained as the school's principal. Many of the stories were recycled plots of its parent series. The first season cast included Robert Sutherland Telfer, Jonathan Angel, Isaac Lidsky, Natalia Cigliuti, Bianca Lawson, and Bonnie Russavage. Unlike the original series, which featured very few major cast changes throughout its run, The New Class regularly changed its core cast with Mr. Belding being the only constant factor.\nThe series was universally panned by critics and most fans of the original series and is one of the worst reviewed teen shows, but had a positive reception to new fans of the franchise.", "rate": 42, "genre": ["Comedy"], "cast": ["Dennis Haskins", "Natalia Cigliuti", "Lindsey McKeon", "Sarah Lancaster", "Dustin Diamond"], "character": ["Lindsay Warner", "Rachel Meyers", "Samuel \"Screech\" Powers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 531   Expand Saved by the Bell: The New Class   (1993) User Score Overview Saved by the Bell: The New Class is a spin-off of the Saved by the Bell series which ran from September 11, 1993 to January 8, 2000. The series lasted for seven seasons on NBC as a part of the network's TNBC Saturday morning line-up. It was the fourth incarnation of the franchise. The show had the same concept as the original series but featured a new group of students now roaming the halls of the fictional Bayside High School. Mr. Belding, played by Dennis Haskins, remained as the school's principal. Many of the stories were recycled plots of its parent series. The first season cast included Robert Sutherland Telfer, Jonathan Angel, Isaac Lidsky, Natalia Cigliuti, Bianca Lawson, and Bonnie Russavage. Unlike the original series, which featured very few major cast changes throughout its run, The New Class regularly changed its core cast with Mr. Belding being the only constant factor. The series was universally panned by critics and most fans of the original series and is one of the worst reviewed teen shows, but had a positive reception to new fans of the franchise. Featured Crew Sam Bobrick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dennis Haskins Natalia Cigliuti Lindsay Warner Lindsey McKeon Sarah Lancaster Rachel Meyers Dustin Diamond Samuel \"Screech\" Powers Full Cast & Crew Last Season Season 7 1999 | 13 Episodes Season 7 of Saved by the Bell: The New Class premiered on September 11, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1992-03-07 Sailor Moon 6.7    1993-01-01 Dr. Quinn, Medicine Woman 6.2    1983-09-17 Alvin and the Chipmunks 6.0    1983-09-10 Inspector Gadget 6.6    1994-09-05 Aladdin 6.2    1989-09-22 Family Matters 6.2    1989-08-20 Saved by the Bell 6.2    1991-09-08 Darkwing Duck 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords high school teen comedy sitcom Content Score 93 Almost there... Top Contributors 11 Banana 3 lineker TB 2 TMDb Bot 1 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}