{"link": "https://www.themoviedb.org/tv/27017?language=en", "title": "Jo Brand Through the Cakehole", "resume": "Jo Brand Through the Cakehole is a British stand-up comedy television series produced by Channel X, and starring Jo Brand as the show's host. It debuted on 30 December 1993 in the United Kingdom and was broadcast on Channel 4 for three years, from 1993 to 1996.", "rate": 0, "genre": ["Comedy"], "cast": ["Jo Brand"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27017   Expand Jo Brand Through the Cakehole   (1994) User Score Overview Jo Brand Through the Cakehole is a British stand-up comedy television series produced by Channel X, and starring Jo Brand as the show's host. It debuted on 30 December 1993 in the United Kingdom and was broadcast on Channel 4 for three years, from 1993 to 1996. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jo Brand Full Cast & Crew Last Season Season 2 1996 | 6 Episodes Season 2 of Jo Brand Through the Cakehole premiered on January 12, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jo Brand Through the Cakehole. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  35m Homepage  - Genres Comedy Keywords stand-up comedy stand-up comedian sketch comedy rudeness british humour Content Score 43 There's no 'I' in team... Top Contributors a 9 alexmate TB 2 TMDb Bot O 2 Ozbourne 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}