{"link": "https://www.themoviedb.org/tv/63425?language=en", "title": "Building Wild", "resume": "National Geographic Channel goes off the map to kick off its first do-it-yourself series, Building Wild. Paulie, as he is known, has partnered with woodsman and master fabricator Pat \"Tuffy\" Bakaitis on a cabin design and construction business called Cabin Kings. These \"Cabin Kings\" are construction's odd couple: Paulie is a city boy at heart and Tuffy is a gruff, logical woodsman who has never heard of Starbucks. But together, this duo creates unbelievable wilderness getaways, transforming discarded materials into fabulous contraptions and overcoming outrageous building challenges along the way.", "rate": 70, "genre": ["Reality"], "cast": ["Patrick Tuffy Bakaitis"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63425   Expand Building Wild   (2014) User Score Overview National Geographic Channel goes off the map to kick off its first do-it-yourself series, Building Wild. Paulie, as he is known, has partnered with woodsman and master fabricator Pat \"Tuffy\" Bakaitis on a cabin design and construction business called Cabin Kings. These \"Cabin Kings\" are construction's odd couple: Paulie is a city boy at heart and Tuffy is a gruff, logical woodsman who has never heard of Starbucks. But together, this duo creates unbelievable wilderness getaways, transforming discarded materials into fabulous contraptions and overcoming outrageous building challenges along the way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Tuffy Bakaitis Himself Full Cast & Crew Last Season Season 2 2015 | 10 Episodes Season 2 of Building Wild premiered on February 24, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Building Wild. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://channel.nationalgeographic.com/building-wild/ Genres Reality Keywords log cabin Content Score 56 We're so close, yet so far. Top Contributors 30 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}