{"link": "https://www.themoviedb.org/tv/15642?language=en", "title": "The Trojan Horse", "resume": "Politician Tom McLaughlin watches from the sidelines as Canada relinquishes sovereignty and joins the United States. He refuses to lose his country without a fight, whether it's fair or not.", "rate": 40, "genre": ["Drama"], "cast": ["Rick Cosnett", "Paul Gross", "William Hutt", "Stephen McHattie", "Martha Burns"], "character": ["Will Tullman", "Thomas David McLaughlin", "Miles Fortnum", "Jack Shea", "Mary Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15642   Expand The Trojan Horse   (2008) User Score Overview Politician Tom McLaughlin watches from the sidelines as Canada relinquishes sovereignty and joins the United States. He refuses to lose his country without a fight, whether it's fair or not. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rick Cosnett Will Tullman Paul Gross Thomas David McLaughlin William Hutt Miles Fortnum Stephen McHattie Jack Shea Martha Burns Mary Miller Full Cast & Crew Last Season Miniseries 2008 | 2 Episodes Season 1 of The Trojan Horse premiered on March 29, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Trojan Horse. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://www.cbc.ca/trojanhorse/index.html Genres Drama Keywords politics miniseries Content Score 86 Almost there... Top Contributors 23 Banana R 9 Rebecca x 6 xmodder TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}