{"link": "https://www.themoviedb.org/tv/5716?language=en", "title": "Spring Waltz", "resume": "Spring Waltz is a 2006 South Korean television series starring Seo Do-young, Han Hyo-joo, Daniel Henney, and Lee So-yeon. It aired on KBS2 from March 6 to May 16, 2006 on Mondays and Tuesdays at 21:55 for 20 episodes.\nIt is the fourth and final installment of director Yoon Seok-ho's season-themed Endless Love series, following Autumn in My Heart, Winter Sonata and Summer Scent.", "rate": 90, "genre": ["Drama"], "cast": ["Han Hyo-joo", "Daniel Henney", "Seo Do-young", "Lee So-yeon", "Jung Dong-Hwan"], "character": ["Seo/Park Eun-young", "Phillip", "Lee Soo-ho/Yoon Jae-ha", "Song Yi-na", "Yoon Myung-hoon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5716   Expand Spring Waltz   (2006) User Score Overview Spring Waltz is a 2006 South Korean television series starring Seo Do-young, Han Hyo-joo, Daniel Henney, and Lee So-yeon. It aired on KBS2 from March 6 to May 16, 2006 on Mondays and Tuesdays at 21:55 for 20 episodes. It is the fourth and final installment of director Yoon Seok-ho's season-themed Endless Love series, following Autumn in My Heart, Winter Sonata and Summer Scent. Featured Crew Yoon Suk Ho Creator Hwang Da Eun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Hyo-joo Seo/Park Eun-young Daniel Henney Phillip Seo Do-young Lee Soo-ho/Yoon Jae-ha Lee So-yeon Song Yi-na Jung Dong-Hwan Yoon Myung-hoon Full Cast & Crew Last Season Season 1 2006 | 20 Episodes Season 1 of Spring Waltz premiered on March  6, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Spring Waltz. You can help by rating TV shows you've seen. Facts Original Name  봄의 왈츠 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  80m Homepage   http://www.kbs.co.kr/drama/springwaltz/ Genres Drama Keywords korea Content Score 93 Almost there... Top Contributors t 25 tmdb38202327 N 20 Nightowl.Kr 15 part-mozi CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}