{"link": "https://www.themoviedb.org/tv/46849?language=en", "title": "Generation War", "resume": "Five friends go out to war and promise each other to be back for Christmas.", "rate": 82, "genre": ["Drama"], "cast": ["Miriam Stein", "Mark Waschke", "Henriette Richter-Röhl", "Götz Schubert", "Christiane Paul"], "character": ["Charlotte", "Dorn", "Hildegard", "Dr. Jahn", "Lilja"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46849   Expand Generation War   (2013) User Score  Play Trailer Overview Five friends go out to war and promise each other to be back for Christmas. Featured Crew Philipp Kadelbach Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miriam Stein Charlotte Mark Waschke Dorn Henriette Richter-Röhl Hildegard Götz Schubert Dr. Jahn Christiane Paul Lilja Full Cast & Crew Last Season Season 1 2013 | 3 Episodes Season 1 of Generation War premiered on March 17, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Generation War. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  15 Recommendations   2010-03-14 The Pacific 7.9    2001-09-09 Band of Brothers 8.2    2007-10-25 Corleone 8.2    2009-09-08 Apocalypse: The Second World War 8.2    2008-07-13 Generation Kill 8.1    2012-03-30 Magic City 6.7    2014-01-12 True Detective 8.1    2010-01-22 Spartacus 7.8  Facts Original Name  Unsere Mütter, unsere Väter Status  Ended Network Certification N-7 Meaning Intended for viewers from 7 years old. Type  Miniseries Original Language  German Runtime  90m Homepage  - Genres Drama Keywords war world war ii miniseries Content Score 100 Yes! Looking good! Top Contributors TB 56 TMDb Bot a 18 aberacjusz 14 nmapleaf f 12 fjmorena  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}