{"link": "https://www.themoviedb.org/tv/4588?language=en", "title": "ER", "resume": "Explores the inner workings of an urban teaching hospital and the critical issues faced by the dedicated physicians and staff of its overburdened emergency room.", "rate": 72, "genre": ["Drama"], "cast": ["Maura Tierney", "Parminder Nagra", "Scott Grimes", "Linda Cardellini", "John Stamos"], "character": ["Abby Lockhart", "Neela Rasgotra", "Archie Morris", "Samantha Taggart", "Tony Gates"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4588   Expand ER   (1994) User Score  Play Trailer Overview Explores the inner workings of an urban teaching hospital and the critical issues faced by the dedicated physicians and staff of its overburdened emergency room. Featured Crew Michael Crichton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  35 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Maura Tierney Abby Lockhart Parminder Nagra Neela Rasgotra Scott Grimes Archie Morris Linda Cardellini Samantha Taggart John Stamos Tony Gates Full Cast & Crew Last Season Season 15 2008 | 22 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply ER Season 7 to air on POP TV starting 10/07/17! Open 0 by clunybrown2017\n      \n     Is ER streaming anywhere? Open 9 by  WalkGood Go to Discussions Media Most Popular Videos  2 Backdrops  35 Posters  2 Recommendations   1997-09-08 Ally McBeal 5.9    1993-09-21 NYPD Blue 6.5    1992-07-08 Melrose Place 4.9    2003-07-22 Nip/Tuck 6.9    1998-09-21 Will & Grace 6.5    2002-09-26 Without a Trace 6.8    1993-04-21 Walker, Texas Ranger 5.0    1992-09-23 Mad About You 6.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.nbc.com/ER/ Genres Drama Keywords hospital doctor surgical operation emergency room medical drama Content Score 100 Yes! Looking good! Top Contributors 426 United600 28 lineker 23 Imzadi 22 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}