{"link": "https://www.themoviedb.org/tv/7942?language=en", "title": "Himmelblå", "resume": "Himmelblå is a Norwegian drama series which aired on NRK1 in Norway, on SVT in Sweden and on RÚV in Iceland. It is based on the British TV drama Two Thousand Acres of Sky written by Timothy Prager and produced by Adrian Bate.", "rate": 0, "genre": ["Drama"], "cast": ["Line Verndal"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7942   Expand Himmelblå   (2008) User Score Overview Himmelblå is a Norwegian drama series which aired on NRK1 in Norway, on SVT in Sweden and on RÚV in Iceland. It is based on the British TV drama Two Thousand Acres of Sky written by Timothy Prager and produced by Adrian Bate. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Line Verndal Full Cast & Crew Last Season Season 3 2010 | 1 Episode Season 3 of Himmelblå premiered on March  7, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Himmelblå. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Bokmål, Norwegian; Norwegian Bokmål Runtime  47m, 45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors KS 4 Kristen Sigmarsson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}