{"link": "https://www.themoviedb.org/tv/12461?language=en", "title": "Players", "resume": "Three young ex-cons track down criminals as a part of a new FBI program.", "rate": 70, "genre": ["Drama", "Crime"], "cast": ["Costas Mandylor", "Ice-T", "Mia Korf", "Frank John Hughes"], "character": ["Alphonse Royo", "Isaac 'Ice' Gregory", "Christine Kowalski", "Charlie O' Bannon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12461   Expand Players   (1997) User Score Overview Three young ex-cons track down criminals as a part of a new FBI program. Featured Crew Dick Wolf Creator Shaun Cassidy Creator Reggie Rock Bythewood Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Costas Mandylor Alphonse Royo Ice-T Isaac 'Ice' Gregory Mia Korf Christine Kowalski Frank John Hughes Charlie O' Bannon Full Cast & Crew Last Season Season 1 1997 | 18 Episodes Season 1 of Players premiered on October 17, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Players. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Crime Keywords fbi ex-con criminal consultant Content Score 93 Almost there... Top Contributors 18 Banana d 6 denis 2 guyltlh D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}