{"link": "https://www.themoviedb.org/tv/61742?language=en", "title": "Laughing Under the Clouds", "resume": "When swords were outlawed in the eleventh year of the Meiji era, the mighty samurai population began to dwindle. Those who rejected the ban on blades rebelled, causing violent unrest to erupt throughout the countryside. To combat the rise in criminal activity, an inescapable lake prison was constructed. Three young men, born of the Kumo line, were given the duty of delivering criminals to their place of confinement – but could there be more to their mission than meets the eye?", "rate": 70, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61742   Expand Laughing Under the Clouds   (2014) User Score Overview When swords were outlawed in the eleventh year of the Meiji era, the mighty samurai population began to dwindle. Those who rejected the ban on blades rebelled, causing violent unrest to erupt throughout the countryside. To combat the rise in criminal activity, an inescapable lake prison was constructed. Three young men, born of the Kumo line, were given the duty of delivering criminals to their place of confinement – but could there be more to their mission than meets the eye? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Laughing Under the Clouds premiered on October  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  12 Recommendations We don't have enough data to suggest any TV shows based on Laughing Under the Clouds. You can help by rating TV shows you've seen. Facts Original Name  曇天に笑う Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.dontenniwarau.com/ Genres Animation Keywords samurai anime Content Score 56 We're so close, yet so far. Top Contributors 61 Elizabeth Jennings p 12 psy4trik 5 Jaime Neto 4 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}