{"link": "https://www.themoviedb.org/tv/31229?language=en", "title": "City Hall", "resume": "The City Hall is a 2009 South Korean television series starring Kim Sun-ah and Cha Seung-won. It aired on SBS from April 29 to July 2, 2009 on Wednesdays and Thursdays at 21:55 for 20 episodes.\nWritten by Kim Eun-sook and directed by Shin Woo-chul, the story revolves around a low-ranking government clerk who becomes the youngest mayor of the fictional Inju City, and her romance with an ambitious and cynical deputy mayor.\nThe drama series also marked movie star Cha Seung-won's return to the small screen after a six-year absence.", "rate": 80, "genre": ["Drama", "Comedy"], "cast": ["Kim Sun-a", "Chu Sang-mi", "Cha Seung-won", "Cha Hwa-yeon"], "character": ["Shin Mi-rae", "Min Joo-hwa", "Jo Gook", "Jo Yong-hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31229   Expand City Hall   (2009) User Score Overview The City Hall is a 2009 South Korean television series starring Kim Sun-ah and Cha Seung-won. It aired on SBS from April 29 to July 2, 2009 on Wednesdays and Thursdays at 21:55 for 20 episodes. Written by Kim Eun-sook and directed by Shin Woo-chul, the story revolves around a low-ranking government clerk who becomes the youngest mayor of the fictional Inju City, and her romance with an ambitious and cynical deputy mayor. The drama series also marked movie star Cha Seung-won's return to the small screen after a six-year absence. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Sun-a Shin Mi-rae Chu Sang-mi Min Joo-hwa Cha Seung-won Jo Gook Cha Hwa-yeon Jo Yong-hee Full Cast & Crew Last Season Season 1 2009 | 20 Episodes Season 1 of City Hall premiered on April 29, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on City Hall. You can help by rating TV shows you've seen. Facts Original Name  시티 홀 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://tv.sbs.co.kr/cityhall/ Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors N 15 Nightowl.Kr t 5 tmdb38202327 4 sansalayne 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}