{"link": "https://www.themoviedb.org/tv/47141?language=en", "title": "The Bridge", "resume": "A murdered body on a bridge between El Paso and Juarez bring together El Paso detective Sonya Cross and Chihuahua State Police detective Marco Ruiz.", "rate": 66, "genre": ["Drama"], "cast": ["Diane Kruger", "Demián Bichir", "Annabeth Gish", "Thomas M. Wright", "Matthew Lillard"], "character": ["Sonya Cross", "Marco Ruiz", "Charlotte Millwright", "Steven Linder", "Daniel Frye"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47141   Expand The Bridge   (2013) User Score Overview A murdered body on a bridge between El Paso and Juarez bring together El Paso detective Sonya Cross and Chihuahua State Police detective Marco Ruiz. Featured Crew Meredith Stiehm Creator Elwood Reid Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diane Kruger Sonya Cross Demián Bichir Marco Ruiz Annabeth Gish Charlotte Millwright Thomas M. Wright Steven Linder Matthew Lillard Daniel Frye Full Cast & Crew Last Season Season 2 2014 | 13 Episodes Season 2 of The Bridge premiered on July  9, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply A great show that died too soon Open 0 by RCH2288\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   2012-10-11 Copper 6.0    2014-08-23 Intruders 6.5    2011-11-06 Hell on Wheels 7.2    2014-05-30 Crossbones 6.0    2011-04-03 The Killing 7.5    2014-10-02 Gracepoint 6.5    2015-03-25 Big Time in Hollywood, Fl 5.7    2012-03-30 Magic City 6.7  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Drama Keywords mexico fbi organized crime drug cartel serial killer police detective murder investigation Content Score 93 Almost there... Top Contributors 65 Travis Bell 30 seawolf 11 Matthew Sanders 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}