{"link": "https://www.themoviedb.org/tv/34730?language=en", "title": "Yugo", "resume": "Yugo is a manga written by Shinji Makari and illustrated by Akana Shu, serialized in Kodansha's Afternoon magazine from 1994 to 2004. The series transferred to Kodansha's Evening magazine wherein the subtitle \"the Negotiator\" is added in. Subsequent compilations of the original manga also add this phrase.\n”Yugo” A.K.A. Yugo the Negotiator, or Yugo Koushounin, is the realization of the popular comic Yu-go that was published in Kondasha Afternoon Magazine over a period of 10 years. The manga was adapted into an animated television series in 2004 as Yugo the Negotiator. The anime comprises the manga's first two major arcs, which fit within 13 episodes.\nThe series follows Yugo Beppu, a hostage negotiator, in various cases around the world.", "rate": 55, "genre": ["Animation", "Drama", "Mystery"], "cast": ["Takashi Hagino", "Akemi Okamura", "Yuki Kaida", "Yumi Kakazu", "Yumi Kakazu"], "character": ["Yugo Beppu", "Ruba", "Mariko", "Mayuko", "Raira"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34730   Expand Yugo   (2004) User Score Overview Yugo is a manga written by Shinji Makari and illustrated by Akana Shu, serialized in Kodansha's Afternoon magazine from 1994 to 2004. The series transferred to Kodansha's Evening magazine wherein the subtitle \"the Negotiator\" is added in. Subsequent compilations of the original manga also add this phrase. ”Yugo” A.K.A. Yugo the Negotiator, or Yugo Koushounin, is the realization of the popular comic Yu-go that was published in Kondasha Afternoon Magazine over a period of 10 years. The manga was adapted into an animated television series in 2004 as Yugo the Negotiator. The anime comprises the manga's first two major arcs, which fit within 13 episodes. The series follows Yugo Beppu, a hostage negotiator, in various cases around the world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takashi Hagino Yugo Beppu Akemi Okamura Ruba Yuki Kaida Mariko Yumi Kakazu Mayuko Yumi Kakazu Raira Full Cast & Crew Last Season the negotiator season 1 2004 | 13 Episodes Season 1 of Yugo premiered on February 24, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Yugo. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Mystery Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin 3 enams90 2 J. n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}