{"link": "https://www.themoviedb.org/tv/63407?language=en", "title": "My Heart is Yours", "resume": "Fernando Lascurain is a wealthy businessman and recent widower, attempting to raise his seven unruly children. He seeks the assistance of a new nanny. He hires and falls in love with Ana Leal, a struggling exotic dancer who tries to hide her double life. Although Ana lacks experience and a refined education, she quickly bonds with the Lascurain children. Ana dreams of being a mother, but when her home is destroyed following an accident, she must borrow money from her ruthless boss at \"Chicago\", the night club where she is secretly employed. When Fernando simultaneously falls for Ana and Isabela, an economist and sophisticated woman who is trained by her mother to marry a millionaire, he must choose between both women.", "rate": 0, "genre": ["Comedy", "Drama", "Family"], "cast": ["Silvia Navarro", "Jorge Salinas", "Mayrín Villanueva", "Rafael Inclán", "Adrian Uribe"], "character": ["Ana Leal", "Fernando Lascuráin Borbolla", "Isabela Vázquez de Castro", "Nicolás Lascuráin", "Juan \"Johnny\" Gutiérrez Pérez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63407   Expand My Heart is Yours   (2014) User Score Overview Fernando Lascurain is a wealthy businessman and recent widower, attempting to raise his seven unruly children. He seeks the assistance of a new nanny. He hires and falls in love with Ana Leal, a struggling exotic dancer who tries to hide her double life. Although Ana lacks experience and a refined education, she quickly bonds with the Lascurain children. Ana dreams of being a mother, but when her home is destroyed following an accident, she must borrow money from her ruthless boss at \"Chicago\", the night club where she is secretly employed. When Fernando simultaneously falls for Ana and Isabela, an economist and sophisticated woman who is trained by her mother to marry a millionaire, he must choose between both women. Featured Crew Ana Obregón Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Silvia Navarro Ana Leal Jorge Salinas Fernando Lascuráin Borbolla Mayrín Villanueva Isabela Vázquez de Castro Rafael Inclán Nicolás Lascuráin Adrian Uribe Juan \"Johnny\" Gutiérrez Pérez Full Cast & Crew Last Season Season 1 2014 | 1 Episode Season 1 of My Heart is Yours premiered on June 30, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on My Heart is Yours. You can help by rating TV shows you've seen. Facts Original Name  Mi corazón es tuyo Status  Ended Networks Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Comedy Drama Family Keywords telenovela Content Score 93 Almost there... Top Contributors s 35 shiff7 24 Alexandre Gomes a 4 asusar 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}