{"link": "https://www.themoviedb.org/tv/5829?language=en", "title": "Flashpoint", "resume": "The Strategic Response Unit (SRU) is an elite team of cops who specialize in high-risk critical incidents. Trained in tactics and psychology, they deal with extreme situations, where split-second decisions could save a life...or cost one.", "rate": 72, "genre": ["Drama", "Action", "Adventure"], "cast": ["David Paetkau", "Enrico Colantoni", "Amy Jo Johnson", "Hugh Dillon", "Sergio Di Zio"], "character": ["Sam Braddock", "Gregory Parker", "Jules Callaghan", "Ed Lane", "Mike Scarlatti"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5829   Expand Flashpoint   (2008) User Score  Play Trailer Overview The Strategic Response Unit (SRU) is an elite team of cops who specialize in high-risk critical incidents. Trained in tactics and psychology, they deal with extreme situations, where split-second decisions could save a life...or cost one. Featured Crew Stephanie Morgenstern Creator Mark Ellis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  15 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Paetkau Sam Braddock Enrico Colantoni Gregory Parker Amy Jo Johnson Jules Callaghan Hugh Dillon Ed Lane Sergio Di Zio Mike Scarlatti Full Cast & Crew Last Season Season 5 2012 | 13 Episodes Season 5 of Flashpoint premiered on September 20, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Jules Callaghan: Happy Birthday Amy Jo Johnson! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  11 Recommendations   2002-09-20 John Doe 7.5    2011-03-14 Endgame 6.3    2010-06-24 Rookie Blue 7.0    2010-07-13 Covert Affairs 6.4    2006-03-05 Numb3rs 6.5    2001-09-30 Law & Order: Criminal Intent 7.1    2007-06-28 Burn Notice 7.3    2008-06-01 In Plain Sight 7.0  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   http://ctv.ca/FlashPoint Genres Drama Action & Adventure Keywords canada police toronto task force hostage situation cop drama elite tactical unit Content Score 100 Yes! Looking good! Top Contributors 25 Banana 21 Elizabeth Jennings S 10 Shady12 c 7 chapichapo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}