{"link": "https://www.themoviedb.org/tv/23377?language=en", "title": "Victoria's Secret Fashion Show", "resume": "Merging fashion, fantasy and entertainment, this lingerie runway show includes pink carpet interviews, model profiles, behind-the-scenes looks at the making of the show, and musical performances.", "rate": 0, "genre": ["Documentary"], "cast": ["Jessica Stam", "Dewi Driegen", "Élise Crombez", "Ajuma Nasenyana", "Rosie Huntington-Whiteley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23377   Expand Victoria's Secret Fashion Show   (2001) User Score Overview Merging fashion, fantasy and entertainment, this lingerie runway show includes pink carpet interviews, model profiles, behind-the-scenes looks at the making of the show, and musical performances. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  14 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Stam Dewi Driegen Élise Crombez Ajuma Nasenyana Rosie Huntington-Whiteley Full Cast & Crew Last Season Season 1 1995 | 21 Episodes Season 1 of Victoria's Secret Fashion Show premiered on August  1, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Victoria's Secret Fashion Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.cbs.com/shows/victorias_secret/ Genres Documentary Keywords fashion show modeling victoria's secret Content Score 86 Almost there... Top Contributors 24 Elizabeth Jennings b 5 bangcaw z 5 zurman1 h 4 halikkuaink  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}