{"link": "https://www.themoviedb.org/tv/35772?language=en", "title": "Tree of Heaven", "resume": "Tree of Heaven is a 2006 South Korean-Japanese series starring Park Shin-hye and Lee Wan. It aired on SBS from February 8 to March 9, 2006 on Wednesdays and Thursdays at 21:55 for 10 episodes.\nAlso known as Tengoku no ki, the series was filmed completely in Japan and featured a cast of both Korean and Japanese actors.", "rate": 0, "genre": ["Drama"], "cast": ["Jung Dong-Hwan", "Lee Wan", "Park Shin-hye", "Asahi Uchida"], "character": ["Yoon Seo", "Hana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35772   Expand Tree of Heaven   (2006) User Score Overview Tree of Heaven is a 2006 South Korean-Japanese series starring Park Shin-hye and Lee Wan. It aired on SBS from February 8 to March 9, 2006 on Wednesdays and Thursdays at 21:55 for 10 episodes. Also known as Tengoku no ki, the series was filmed completely in Japan and featured a cast of both Korean and Japanese actors. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jung Dong-Hwan Lee Wan Yoon Seo Park Shin-hye Hana Asahi Uchida Full Cast & Crew Last Season Tree in heaven season 1 2006 | 10 Episodes Season 1 of Tree of Heaven premiered on February  8, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tree of Heaven. You can help by rating TV shows you've seen. Facts Original Name  천국의 나무 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 5 zurman1 t 4 tmdb983464 N 3 Nosirus 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}