{"link": "https://www.themoviedb.org/tv/35212?language=en", "title": "La vita di Leonardo Da Vinci", "resume": "La Vita di Leonardo Da Vinci — in English, The Life of Leonardo da Vinci — is a 1971 Italian television miniseries dramatizing the life of the Italian Renaissance polymath Leonardo da Vinci.\nThe Golden Globe-winning miniseries was directed by Renato Castellani, and produced by RAI and distributed in the United States by CBS, which aired it from August 13, 1972 to September 10, 1972. Castellani wrote the screenplay. It was filmed entirely on location in Italy and France. The total runtime of the five episodes is nearly five hours.", "rate": 0, "genre": ["Documentary"], "cast": ["Philippe Leroy", "Marta Fischer", "Renzo Rossi", "Giampiero Albertini", "Ann Odessa"], "character": ["Leonardo", "Isabella d'Aragona", "Sandro Botticelli", "Ludovico Il Moro", "Catherine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35212   Expand La vita di Leonardo Da Vinci   (1971) User Score Overview La Vita di Leonardo Da Vinci — in English, The Life of Leonardo da Vinci — is a 1971 Italian television miniseries dramatizing the life of the Italian Renaissance polymath Leonardo da Vinci. The Golden Globe-winning miniseries was directed by Renato Castellani, and produced by RAI and distributed in the United States by CBS, which aired it from August 13, 1972 to September 10, 1972. Castellani wrote the screenplay. It was filmed entirely on location in Italy and France. The total runtime of the five episodes is nearly five hours. Featured Crew Renato Castellani Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philippe Leroy Leonardo Marta Fischer Isabella d'Aragona Renzo Rossi Sandro Botticelli Giampiero Albertini Ludovico Il Moro Ann Odessa Catherine Full Cast & Crew Last Season Season 1 1971 | 5 Episodes Season 1 of La vita di Leonardo Da Vinci premiered on October 28, 1971. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for La vita di Leonardo Da Vinci. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on La vita di Leonardo Da Vinci. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Documentary Original Language  Italian Runtime  - Homepage  - Genres Documentary Keywords leonardo da vinci Content Score 79 Pump it up! We're close now. Top Contributors m 22 magico77 n 20 nosve s 4 speedycars 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}