{"link": "https://www.themoviedb.org/tv/17437?language=en", "title": "Nonni und Manni", "resume": "Nonni and Manni is a children's television series produced as a joint venture between Iceland and West Germany. It debuted on 26 December 1988 on West Germany's ZDF channel and lasted for six episodes with the last one being aired on 1 January 1989.\nThe story was based on the eponymous book written by the popular Icelandic children's author Jón Sveinsson, nicknamed \"Nonni\", who had written several books inspired by his own experiences of growing up alongside his brother Ármann, nicknamed \"Manni\". The filming for the series took place in Iceland, West Germany and Norway.", "rate": 87, "genre": [], "cast": ["Lisa Harrow", "Klaus Grünberg", "Stuart Wilson", "Sverre Anker Ousdal", "Garðar Thór Cortes"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17437   Expand Nonni und Manni   (1988) User Score Overview Nonni and Manni is a children's television series produced as a joint venture between Iceland and West Germany. It debuted on 26 December 1988 on West Germany's ZDF channel and lasted for six episodes with the last one being aired on 1 January 1989. The story was based on the eponymous book written by the popular Icelandic children's author Jón Sveinsson, nicknamed \"Nonni\", who had written several books inspired by his own experiences of growing up alongside his brother Ármann, nicknamed \"Manni\". The filming for the series took place in Iceland, West Germany and Norway. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisa Harrow Klaus Grünberg Stuart Wilson Sverre Anker Ousdal Garðar Thór Cortes Full Cast & Crew Last Season Nonni og manni season 1 1988 | 6 Episodes Season 1 of Nonni und Manni premiered on December 26, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Nonni und Manni. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  50m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors S 2 Samara A 2 Arndt  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}