{"link": "https://www.themoviedb.org/tv/16532?language=en", "title": "Buried", "resume": "Buried is a British television drama series, produced by World Productions for Channel 4 and originally screened in 2003. The programme starred Lennie James as Lee Kingley, who is serving a long prison sentence in order to protect a member of his family from a violent criminal. Critically well-received, the programme won the Best Drama Series category at the British Academy Television Awards in 2004.", "rate": 80, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16532   Expand Buried   (2003) User Score Overview Buried is a British television drama series, produced by World Productions for Channel 4 and originally screened in 2003. The programme starred Lennie James as Lee Kingley, who is serving a long prison sentence in order to protect a member of his family from a violent criminal. Critically well-received, the programme won the Best Drama Series category at the British Academy Television Awards in 2004. Featured Crew Robert Jones Creator Jimmy Gardner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2003 | 8 Episodes Season 1 of Buried premiered on January 14, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Excellent but forgotten series Open 0 by rudely_murray\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Buried. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Drama Keywords prison england gritty prison life Content Score 64 We're so close, yet so far. Top Contributors 9 rudely_murray 7 Banana PS 3 P. Snoopy 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}