{"link": "https://www.themoviedb.org/tv/51821?language=en", "title": "Justice Bao", "resume": "Justice Bao is a 236-episode television series from Taiwan, first airing on Chinese Television System from February 1993 to January 1994. The show stars Jin Chao-chun as the Chinese official Bao Zheng in the Song Dynasty. It was hugely popular in Greater China as well as many other countries in the Far East.\nThe series was originally scheduled for just 15 episodes. However, the show garnered high ratings when the initial episodes aired. Due to its popularity, CTS expanded the show to 236 episodes.\nThe TVB and ATV Home networks in Hong Kong both bought the series in an attempt to gain viewers. Competition between the two networks during the showing of the series was so severe that identical episodes were shown on both channels on the same night. It was also one of the first dramas that used NICAM technology.", "rate": 90, "genre": ["Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51821   Expand Justice Bao User Score Overview Justice Bao is a 236-episode television series from Taiwan, first airing on Chinese Television System from February 1993 to January 1994. The show stars Jin Chao-chun as the Chinese official Bao Zheng in the Song Dynasty. It was hugely popular in Greater China as well as many other countries in the Far East. The series was originally scheduled for just 15 episodes. However, the show garnered high ratings when the initial episodes aired. Due to its popularity, CTS expanded the show to 236 episodes. The TVB and ATV Home networks in Hong Kong both bought the series in an attempt to gain viewers. Competition between the two networks during the showing of the series was so severe that identical episodes were shown on both channels on the same night. It was also one of the first dramas that used NICAM technology. Featured Crew Chao Ta-shen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 hifni1985  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}