{"link": "https://www.themoviedb.org/tv/43851?language=en", "title": "Iczer Reborn", "resume": "Iczer Reborn, also known Adventure! Iczer 3, is a 6-episode anime OVA series. It is the sequel to Fight!! Iczer One. Although originally released in North America on VHS and Laserdisc under the title \"Iczer-3\", Central Park Media renamed it \"Iczer Reborn\" for the DVD release.\nA sound novel trilogy, based on the manga version of the OVA and released as Adventure!! Iczer 3, functions as a sequel to the manga version of Fight!! Iczer-1, and features a 19-year-old Nagisa Kanō as the main heroine. The trilogy was released on three cassette tapes prior to the OVA.", "rate": 0, "genre": ["Action", "Adventure", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43851   Expand Iczer Reborn   (1990) User Score Overview Iczer Reborn, also known Adventure! Iczer 3, is a 6-episode anime OVA series. It is the sequel to Fight!! Iczer One. Although originally released in North America on VHS and Laserdisc under the title \"Iczer-3\", Central Park Media renamed it \"Iczer Reborn\" for the DVD release. A sound novel trilogy, based on the manga version of the OVA and released as Adventure!! Iczer 3, functions as a sequel to the manga version of Fight!! Iczer-1, and features a 19-year-old Nagisa Kanō as the main heroine. The trilogy was released on three cassette tapes prior to the OVA. Featured Crew Toshiki Hirano Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Adventure! iczer-3 season 1 1990 | 6 Episodes Season 1 of Iczer Reborn premiered on September 25, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Iczer Reborn. You can help by rating TV shows you've seen. Facts Original Name  冒険！イクサー３ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 23 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}