{"link": "https://www.themoviedb.org/tv/26674?language=en", "title": "Solty Rei", "resume": "It’s been twelve years since the Blast Fall, an unexplained disaster that left countless dead and many more maimed. Society is divided and every citizen feels the burn, most of all the Resembles – people whose mangled bodies have been rebuilt with high-tech prosthetic devices. Bounty hunter Roy Revant has seen it all, walking alone in this shattered city. That is, until the day a strange little girl named Solty falls from the sky straight into his heart. The search for family turns into a search for meaning and those that wield harsh power over society won’t go unnamed for long. Roy and Solty may seek different things… But who wants to search for truth alone?", "rate": 83, "genre": ["Action", "Adventure", "Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Mamiko Noto", "Masumi Asano", "Jouji Nakata", "Natsuko Kuwatani", "Nobuo Tobita"], "character": ["Accela Warrick", "Rose Anderson", "Roy Revant", "Kerchr", "Ashley Links"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 26674   Expand Solty Rei   (2005) User Score Overview It’s been twelve years since the Blast Fall, an unexplained disaster that left countless dead and many more maimed. Society is divided and every citizen feels the burn, most of all the Resembles – people whose mangled bodies have been rebuilt with high-tech prosthetic devices. Bounty hunter Roy Revant has seen it all, walking alone in this shattered city. That is, until the day a strange little girl named Solty falls from the sky straight into his heart. The search for family turns into a search for meaning and those that wield harsh power over society won’t go unnamed for long. Roy and Solty may seek different things… But who wants to search for truth alone? Featured Crew Noboru Kimura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamiko Noto Accela Warrick Masumi Asano Rose Anderson Jouji Nakata Roy Revant Natsuko Kuwatani Kerchr Nobuo Tobita Ashley Links Full Cast & Crew Last Season Season 1 — | 24 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Solty Rei. You can help by rating TV shows you've seen. Facts Original Name  ソルティレイ Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.funimation.com/shows/solty-rei/home Genres Action & Adventure Animation Drama Sci-Fi & Fantasy Keywords bounty hunter technology mecha super power anime robot girl Content Score 93 Almost there... Top Contributors 41 WillofOwn M 3 Migi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}