{"link": "https://www.themoviedb.org/tv/61928?language=en", "title": "Lucha Underground", "resume": "Lucha Underground introduces U.S. audiences to the high-flying, explosive moves of lucha libre. An ancient combat tradition, watch as good and evil wage war in a gritty battleground called “The Temple.”", "rate": 60, "genre": [], "cast": ["Lil' Cholo"], "character": ["Mr. Cisco"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61928   Expand Lucha Underground   (2014) User Score  Play Trailer Overview Lucha Underground introduces U.S. audiences to the high-flying, explosive moves of lucha libre. An ancient combat tradition, watch as good and evil wage war in a gritty battleground called “The Temple.” Featured Crew Mark Burnett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lil' Cholo Mr. Cisco Full Cast & Crew Current Season Season 4 2018 | 2 Episodes Season 4 of Lucha Underground premiered on June 13, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  6 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Lucha Underground. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.elreynetwork.com/originals/lucha/ Genres No genres have been added. Keywords underground fighter wrestling wrestler violence pro wrestling man vs man box ring Content Score 64 We're so close, yet so far. Top Contributors A 134 Asset 18 Elizabeth Jennings 10 david8s95 C 7 Carulux  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}