{"link": "https://www.themoviedb.org/tv/5062?language=en", "title": "RE:Brand", "resume": "RE:Brand was a British documentary and comedy television program that aimed to take a challenging look at cultural taboos.\nIt was conceived, written and hosted by Russell Brand, with the help of his comic partner for many projects, Matt Morgan. The series was shown on the now defunct digital satellite channel UK Play in 2002. As confirmed in his memoirs 'My Booky Wook' and mentioned on his radio shows, Brand was often drunk or on heroin during the filming of RE:Brand.", "rate": 0, "genre": ["Documentary", "Comedy"], "cast": ["Russell Brand"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5062   Expand RE:Brand User Score Overview RE:Brand was a British documentary and comedy television program that aimed to take a challenging look at cultural taboos. It was conceived, written and hosted by Russell Brand, with the help of his comic partner for many projects, Matt Morgan. The series was shown on the now defunct digital satellite channel UK Play in 2002. As confirmed in his memoirs 'My Booky Wook' and mentioned on his radio shows, Brand was often drunk or on heroin during the filming of RE:Brand. Featured Crew Russell Brand Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Russell Brand Full Cast & Crew Last Season Season 1 — | 7 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Documentary Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}