{"link": "https://www.themoviedb.org/tv/6986?language=en", "title": "The Squirrels", "resume": "The Squirrels is a British television sitcom, written by Eric Chappell, who went on to create the Yorkshire Television sitcoms Rising Damp and Only When I Laugh. It ran for 3 series and 28 episodes and was made and broadcast from 1974 to 1977 on the ITV network, by ATV. Phil Redmond, the creator of now defunct Soap-Opera Brookside, was also a writer for the series.", "rate": 0, "genre": ["Comedy"], "cast": ["Ken Jones", "Alan David", "Bernard Hepton", "Patsy Rowlands", "Ellis Jones"], "character": ["Harry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6986   Expand The Squirrels   (1974) User Score Overview The Squirrels is a British television sitcom, written by Eric Chappell, who went on to create the Yorkshire Television sitcoms Rising Damp and Only When I Laugh. It ran for 3 series and 28 episodes and was made and broadcast from 1974 to 1977 on the ITV network, by ATV. Phil Redmond, the creator of now defunct Soap-Opera Brookside, was also a writer for the series. Featured Crew Eric Chappell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Jones Alan David Harry Bernard Hepton Patsy Rowlands Ellis Jones Full Cast & Crew Last Season Season 3 1976 | 12 Episodes Season 3 of The Squirrels premiered on November 25, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Squirrels. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords boss workplace british humour workplace comedy Content Score 79 Pump it up! We're close now. Top Contributors O 5 Ozbourne 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}