{"link": "https://www.themoviedb.org/tv/16869?language=en", "title": "Special Squad", "resume": "Spetsnaz is a 2002 Russian TV miniseries directed by Andrei Malyukov.", "rate": 55, "genre": ["Action", "Adventure"], "cast": ["Aleksandr Baluev", "Vladislav Galkin", "Aleksei Kravchenko", "Igor Lifanov", "Aleksandr Nosik"], "character": ["Major Platov aka Klim", "Senior lieutenant Urmanov aka Yakut", "Captain Vyazemsky aka Doc", "Khrustalyov aka Khrust", "Ensign Kobrin aka Serpent"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16869   Expand Special Squad   (2002) User Score Overview Spetsnaz is a 2002 Russian TV miniseries directed by Andrei Malyukov. Featured Crew Andrey Malyukov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aleksandr Baluev Major Platov aka Klim Vladislav Galkin Senior lieutenant Urmanov aka Yakut Aleksei Kravchenko Captain Vyazemsky aka Doc Igor Lifanov Khrustalyov aka Khrust Aleksandr Nosik Ensign Kobrin aka Serpent Full Cast & Crew Last Season Season 2 2003 | 4 Episodes Season 2 of Special Squad premiered on October  6, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Special Squad. You can help by rating TV shows you've seen. Facts Original Name  Спецназ Status  Ended Network Certification  - Type  Scripted Original Language  Russian Runtime  52m Homepage  - Genres Action & Adventure Keywords soviet war in afghanistan Content Score 79 Pump it up! We're close now. Top Contributors 28 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}