{"link": "https://www.themoviedb.org/tv/15211?language=en", "title": "Malgudi Days", "resume": "Malgudi Days is an Indian television series based on the works of R.K. Narayan. The series was directed by Kannada actor and director, Shankar Nag and Carnatic musician L. Vaidyanathan composed the score. R. K Narayan's brother and acclaimed cartoonist R. K. Laxman was the sketch artist. The series was made in 1986 by film producer T. S. Narasimhan with Anant Nag as the lead actor.\nThirty-nine episodes of Malgudi Days were telecast on Doordarshan. Subsequently, it was re-telecast on Doordarshan and later on Sony Entertainment Television, and Maa Television in Telugu. This television series was shot entirely near Agumbe in Shimoga District, Karnataka.\nIn 2004, the project was revived with film-maker Kavitha Lankesh replacing Shankar Nag as director. The new series was telecast from April 26, 2006 on Doordarshan.", "rate": 45, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15211   Expand Malgudi Days   (1987) User Score Overview Malgudi Days is an Indian television series based on the works of R.K. Narayan. The series was directed by Kannada actor and director, Shankar Nag and Carnatic musician L. Vaidyanathan composed the score. R. K Narayan's brother and acclaimed cartoonist R. K. Laxman was the sketch artist. The series was made in 1986 by film producer T. S. Narasimhan with Anant Nag as the lead actor. Thirty-nine episodes of Malgudi Days were telecast on Doordarshan. Subsequently, it was re-telecast on Doordarshan and later on Sony Entertainment Television, and Maa Television in Telugu. This television series was shot entirely near Agumbe in Shimoga District, Karnataka. In 2004, the project was revived with film-maker Kavitha Lankesh replacing Shankar Nag as director. The new series was telecast from April 26, 2006 on Doordarshan. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 — | 46 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Malgudi Days. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.malgudidays.net/ Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}