{"link": "https://www.themoviedb.org/tv/63510?language=en", "title": "Attack on Titan: Junior High", "resume": "The story follows Eren Yeager and Mikasa Ackerman entering Titan Jr. High, a school where humans and Titans study in the same area in coexistence. Because of a \"traumatic\" event, where the Colossal Titan ate his lunch back in middle school, Eren hates the Titans, and is constantly trying to find a way to rid the earth of their kind. Because of this, he has a hard time making friends, much to Mikasa's worry.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Yui Ishikawa", "Yuuki Kaji", "Marina Inoue", "Hiroshi Kamiya", "Yu Kobayashi"], "character": ["Mikasa Ackerman", "Eren Yeager", "Armin Arlert", "Levi", "Sasha Blouse"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63510   Expand Attack on Titan: Junior High   (2015) User Score Overview The story follows Eren Yeager and Mikasa Ackerman entering Titan Jr. High, a school where humans and Titans study in the same area in coexistence. Because of a \"traumatic\" event, where the Colossal Titan ate his lunch back in middle school, Eren hates the Titans, and is constantly trying to find a way to rid the earth of their kind. Because of this, he has a hard time making friends, much to Mikasa's worry. Featured Crew Yoshihide Ibata Creator Midori Goto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yui Ishikawa Mikasa Ackerman Yuuki Kaji Eren Yeager Marina Inoue Armin Arlert Hiroshi Kamiya Levi Yu Kobayashi Sasha Blouse Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Attack on Titan: Junior High premiered on October  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2014-01-11 No-Rin 6.0    2013-01-03 Choboraunyopomi Gekijou Ai Mai Mii 4.5    2007-10-02 Bamboo Blade 9.5    2005-01-06 Ah! My Goddess 9.0    2014-01-07 D-Frag! 8.0    2016-04-08 Shonen Maid 6.0    2011-07-07 Mayo Chiki! 9.5    2016-07-08 Handa-kun 6.7  Facts Original Name  進撃！ 巨人中学校 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  17m Homepage   http://kyojinchu.tv/ Genres Animation Comedy Keywords parody anime Content Score 93 Almost there... Top Contributors 16 Aramys López Aguilar 15 Martin B 5 Bonsai 4 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}