{"link": "https://www.themoviedb.org/tv/78658?language=en", "title": "CrimeTube SouthTyrol", "resume": "When Karl, a young monk, comes to Bolzano after a robbery, he only reminisces about the events of the previous night. Ambitious journalist Chiara, sensing a new story, and Erich, the commissioner investigating the case, meet in the hospital room. What initially looks like a simple case turns out to be increasingly a secret network full of intrigues and criminal machinations that draws its circles into the highest social classes in South Tyrol.", "rate": 100, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Ricardo Angelini", "Andreas Hartner", "Lissy Pernthaler", "Roland Selva", "Martina Schölzhorn"], "character": ["Erich", "Karl", "Chiara", "Abt Domenikus", "Johanna"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78658   Expand CrimeTube SouthTyrol   (2017) User Score Overview When Karl, a young monk, comes to Bolzano after a robbery, he only reminisces about the events of the previous night. Ambitious journalist Chiara, sensing a new story, and Erich, the commissioner investigating the case, meet in the hospital room. What initially looks like a simple case turns out to be increasingly a secret network full of intrigues and criminal machinations that draws its circles into the highest social classes in South Tyrol. Featured Crew Ricardo Angelini Creator Andreas Hartner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ricardo Angelini Erich Andreas Hartner Karl Lissy Pernthaler Chiara Roland Selva Abt Domenikus Martina Schölzhorn Johanna Full Cast & Crew Current Season The Suitcase 2017 | 5 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on CrimeTube SouthTyrol. You can help by rating TV shows you've seen. Facts Original Name  CrimeTube Südtirol Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Miniseries Original Language  German Runtime  11m Homepage   http://www.crimetube.bz Genres Crime Drama Mystery Keywords police monk miniseries hospital crime case criminal tube female police commissioner network police commissioner südtirol southtyrol bozen bolzano Content Score 100 Yes! Looking good! Top Contributors 156 ThoSap TB 2 TMDb Bot S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}