{"link": "https://www.themoviedb.org/tv/38270?language=en", "title": "Fractale", "resume": "Clain lives quietly amongst doppels—holograms that replace his parents and friends. Alone on a typical day, he saves a shrine maiden from pursuers and treats her wounds. He’s mystified by her worldly charms, but she disappears—leaving only a pendant behind. When a curious girl emerges from the amulet, Clain’s life takes a chaotic turn as he seeks to unlock the secrets his new friend holds.", "rate": 85, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Yu Kobayashi", "Minami Tsuda", "Kana Hanazawa", "Yuka Iguchi", "Shintarou Asanuma"], "character": ["Clain (voice)", "Phryne (voice)", "Nessa (voice)", "Enri (voice)", "Sunda (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38270   Expand Fractale   (2011) User Score Overview Clain lives quietly amongst doppels—holograms that replace his parents and friends. Alone on a typical day, he saves a shrine maiden from pursuers and treats her wounds. He’s mystified by her worldly charms, but she disappears—leaving only a pendant behind. When a curious girl emerges from the amulet, Clain’s life takes a chaotic turn as he seeks to unlock the secrets his new friend holds. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yu Kobayashi Clain (voice) Minami Tsuda Phryne (voice) Kana Hanazawa Nessa (voice) Yuka Iguchi Enri (voice) Shintarou Asanuma Sunda (voice) Full Cast & Crew Last Season Season 1 2011 | 11 Episodes Season 1 of Fractale premiered on January 14, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Fractale. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Fractale. You can help by rating TV shows you've seen. Facts Original Name  フラクタル Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://fractale-anime.com/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords rebellion virtual reality dystopia hologram seinen anime Content Score 86 Almost there... Top Contributors 69 Marr 🇳🇱 4 WillofOwn J 4 JohnyB0y s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}