{"link": "https://www.themoviedb.org/tv/17629?language=en", "title": "Grow Your Own Drugs", "resume": "Grow Your Own Drugs is a British television documentary series, first broadcast on BBC Two, exploring the many remedies which can be provided by plants. James Wong, an ethnobotanist, presents the series and takes the view that people should start making their own remedies in order to save money and feel healthier plus providing simple remedies to everyday ailments. Wong tries out his remedies on members of the public in order to demonstrate the beneficial effects of natural remedies, adding appropriate safety warnings. He is careful to stress that viewers should always seek medical advice before trying natural medicines, and in discussing the outcomes of treatment always states \"It's not a clinical trial...\" and acknowledges that results might be attributed to a placebo effect.\nProving a huge ratings success for the BBC, the programme quickly became the highest rated gardening programme in the UK, producing an internationally best-selling book, by the same title, as a spin-off. In 2009, the series also won \"Best Television Programme\" at the UK Garden Media Guild Awards.\nWong's says:\nand:\nA special edition, Grow Your Own Drugs for Christmas, focusing mostly on the applications of plants associated with the season such as holly, ivy, mistletoe and pine, aired on 16 December 2009.", "rate": 70, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17629   Expand Grow Your Own Drugs   (2009) User Score Overview Grow Your Own Drugs is a British television documentary series, first broadcast on BBC Two, exploring the many remedies which can be provided by plants. James Wong, an ethnobotanist, presents the series and takes the view that people should start making their own remedies in order to save money and feel healthier plus providing simple remedies to everyday ailments. Wong tries out his remedies on members of the public in order to demonstrate the beneficial effects of natural remedies, adding appropriate safety warnings. He is careful to stress that viewers should always seek medical advice before trying natural medicines, and in discussing the outcomes of treatment always states \"It's not a clinical trial...\" and acknowledges that results might be attributed to a placebo effect. Proving a huge ratings success for the BBC, the programme quickly became the highest rated gardening programme in the UK, producing an internationally best-selling book, by the same title, as a spin-off. In 2009, the series also won \"Best Television Programme\" at the UK Garden Media Guild Awards. Wong's says: and: A special edition, Grow Your Own Drugs for Christmas, focusing mostly on the applications of plants associated with the season such as holly, ivy, mistletoe and pine, aired on 16 December 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2010 | 6 Episodes Season 2 of Grow Your Own Drugs premiered on March 23, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Grow Your Own Drugs. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00j3ktd Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}