{"link": "https://www.themoviedb.org/tv/59574?language=en", "title": "Labyrinth of Passion", "resume": "Laberintos de pasión is a Mexican telenovela produced by Televisa in 1999. Starring Leticia Calderon, Francisco Gattorno, César Évora, in addition to the participation of Manuel Ojeda, Monika Sanchez and Azela Robinson.", "rate": 0, "genre": [], "cast": ["Leticia Calderón", "Francisco Gattorno", "César Évora", "Manuel Ojeda", "Azela Robinson"], "character": ["Julieta Valderrama", "Pedro Valencia Miranda", "Gabriel Almada", "Genaro Valencia", "Carmina Roldán de Valencia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59574   Expand Labyrinth of Passion   (1999) User Score Overview Laberintos de pasión is a Mexican telenovela produced by Televisa in 1999. Starring Leticia Calderon, Francisco Gattorno, César Évora, in addition to the participation of Manuel Ojeda, Monika Sanchez and Azela Robinson. Featured Crew Caridad Bravo Adams Creator Cuauhtémoc Blanco Creator María del Carmen Peña Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leticia Calderón Julieta Valderrama Francisco Gattorno Pedro Valencia Miranda César Évora Gabriel Almada Manuel Ojeda Genaro Valencia Azela Robinson Carmina Roldán de Valencia Full Cast & Crew Last Season Season 1 1999 | 1 Episode Season 1 of Labyrinth of Passion premiered on October  4, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Labyrinth of Passion. You can help by rating TV shows you've seen. Facts Original Name  Laberintos de pasión Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors s 25 shiff7 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}