{"link": "https://www.themoviedb.org/tv/1570?language=en", "title": "The Adventures of Tintin", "resume": "Travel with Tintin, the young and intrepid Belgian reporter, and his faithful dog Snowy as they take you from Tibet to the Moon, or from Egypt to the depths of the sea -- solving mysteries, pursuing truth and justice, and gambling with their lives.", "rate": 78, "genre": ["Action", "Adventure", "Animation"], "cast": ["Thierry Wermuth", "Christian Pelissier", "Henri Labussière", "Yves Barsacq", "Jean-Pierre Moulin"], "character": ["Tintin (voice)", "Capitaine Haddock (voice)", "Professeur Tournessol (voice)", "Dupont (voice)", "Dupond (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1570   Expand The Adventures of Tintin   (1991) User Score  Play Trailer Overview Travel with Tintin, the young and intrepid Belgian reporter, and his faithful dog Snowy as they take you from Tibet to the Moon, or from Egypt to the depths of the sea -- solving mysteries, pursuing truth and justice, and gambling with their lives. Featured Crew Hergé Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  13 Images Backdrops  9 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thierry Wermuth Tintin (voice) Christian Pelissier Capitaine Haddock (voice) Henri Labussière Professeur Tournessol (voice) Yves Barsacq Dupont (voice) Jean-Pierre Moulin Dupond (voice) Full Cast & Crew Last Season Original Air Date Original Air Date Comics Order (Absolute) Season 3 1992 | 13 Episodes Season 3 of The Adventures of Tintin premiered on July  5, 1992. View All Seasons Social Reviews  0 Discussions  13 Subject Status Replies Last Reply There are no discussions for The Adventures of Tintin. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  15 Recommendations   1986-09-22 Dennis the Menace 5.6    1990-01-01 Mr. Bean 7.8    1995-09-09 Pinky and the Brain 7.7    1986-08-23 Macken 5.8    1962-09-23 The Jetsons 6.6    1993-09-13 Animaniacs 7.6    1987-09-10 Teenage Mutant Ninja Turtles 7.3    1984-10-15 Lucky Luke 6.1  Facts Status  Ended Networks Certification NR Meaning No rating information. Type  Scripted Original Language  French Runtime  22m Homepage   http://en.tintin.com/ Genres Action & Adventure Animation Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors M 152 Mec!as S 60 Spyke.fr 46 Elizabeth Jennings 26 bredchalice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}