{"link": "https://www.themoviedb.org/tv/61971?language=en", "title": "Dear America", "resume": "Based on the best-selling Scholastic books; Dear America features the rich and spirited stories of young women at various turning points in history.", "rate": 0, "genre": ["Drama", "Family", "History"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61971   Expand Dear America   (1999) User Score Overview Based on the best-selling Scholastic books; Dear America features the rich and spirited stories of young women at various turning points in history. Featured Crew Deborah Forte Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 - The Royal Diaries 2000 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dear America. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Family History Keywords princess usa immigrant civil war politics freedom queen native american industrial revolution pilgrim religion historical fiction slave race ancient egypt americana pioneer women american revolution pioneers american history young women monarch young adult Content Score 50 Still needs a little work. Top Contributors G 49 GigaBerry 6 Elizabeth Jennings r 1 rectifyer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}