{"link": "https://www.themoviedb.org/tv/67005?language=en", "title": "Dark Woods Justice", "resume": "Deep in the heart of Washington's Olympic Peninsula is home to one of the country's last great forests - one so massive and diverse that it has been called America's \"Last Untamed Wilderness.\" With land stretching over 2,000 square miles and filled with some of the rarest and most ancient trees on earth, this vast forest hides dark secrets, including an illicit underground black market of natural resource theft. However, Sheriff's deputies throughout the region have sworn to protect their communities and the forest at all costs.", "rate": 0, "genre": ["Reality"], "cast": ["Mark Apeland", "Don Kolilis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67005   Expand Dark Woods Justice   (2016) User Score Overview Deep in the heart of Washington's Olympic Peninsula is home to one of the country's last great forests - one so massive and diverse that it has been called America's \"Last Untamed Wilderness.\" With land stretching over 2,000 square miles and filled with some of the rarest and most ancient trees on earth, this vast forest hides dark secrets, including an illicit underground black market of natural resource theft. However, Sheriff's deputies throughout the region have sworn to protect their communities and the forest at all costs. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Apeland Don Kolilis Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Dark Woods Justice premiered on June  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Dark Woods Justice. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  45m Homepage   http://www.discovery.com/tv-shows/dark-woods-justice/ Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 13 Elizabeth Jennings p 6 pucxy mj 6 mistreis jhon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}