{"link": "https://www.themoviedb.org/tv/42556?language=en", "title": "Mysterious Girlfriend X", "resume": "Mysterious Girlfriend X is an ongoing Japanese manga written and illustrated by Riichi Ueshiba. It was originally published as a one-shot story in 2004 before becoming a serialized comic in Kodansha's Afternoon magazine in 2006. An anime adaptation by Hoods Entertainment aired in Japan from April 7, 2012 to June 30, 2012, with an original video animation episode released on August 23, 2012.", "rate": 0, "genre": ["Animation", "Drama", "Comedy"], "cast": ["Miyu Irino"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42556   Expand Mysterious Girlfriend X   (2012) User Score Overview Mysterious Girlfriend X is an ongoing Japanese manga written and illustrated by Riichi Ueshiba. It was originally published as a one-shot story in 2004 before becoming a serialized comic in Kodansha's Afternoon magazine in 2006. An anime adaptation by Hoods Entertainment aired in Japan from April 7, 2012 to June 30, 2012, with an original video animation episode released on August 23, 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyu Irino Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Mysterious Girlfriend X premiered on April  7, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mysterious Girlfriend X. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Drama Comedy Keywords based on manga anime monthly afternoon Content Score 56 We're so close, yet so far. Top Contributors 13 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}