{"link": "https://www.themoviedb.org/tv/45994?language=en", "title": "The Kitchen", "resume": "Maksim \"Max\" Lavrov wants to become a great chef. But he finds out that  the kitchen isn't the place for an easy career. And in restaurant  \"Claude Monet\" this job looks even harder and much more complicated than  just cooking.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Dmitri Nazarov", "Dmitriy Nagiev", "Sergey Epishev", "Olga Kuzmina", "Viktor Horinyak"], "character": ["Viktor Barinov", "Dmitriy Nagiev", "Lev Semyonovich Solovyov", "Nastya", "Konstantin Anisimov"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45994   Expand The Kitchen   (2012) User Score Overview Maksim \"Max\" Lavrov wants to become a great chef. But he finds out that  the kitchen isn't the place for an easy career. And in restaurant  \"Claude Monet\" this job looks even harder and much more complicated than  just cooking. Featured Crew Vasili Kutsenko Creator Igor Tudvasev Creator Dimitry Jan Creator Pavel Danilov Creator Vitaly Shlyappo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dmitri Nazarov Viktor Barinov Dmitriy Nagiev Dmitriy Nagiev Sergey Epishev Lev Semyonovich Solovyov Olga Kuzmina Nastya Viktor Horinyak Konstantin Anisimov Full Cast & Crew Last Season Season 6 2016 | 20 Episodes Season 6 of The Kitchen premiered on February 29, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2010-11-08 Реальные пацаны 7.5    2008-08-25 Универ 4.3    2006-11-04 Our Russia 3.7    2014-04-07 P. E. Teacher 6.1    1997-04-03 Police Academy: The Series 5.6    2010-03-29 Interny 5.7    1969-01-01 Nu, pogodi! 6.8    1980-12-25 Arabela 8.3  Facts Original Name  Кухня Status  Ended Network Certification  - Type  Scripted Original Language  Russian Runtime  24m Homepage   http://ctc.ru/rus/projects/serials/kukhnya/ Genres Comedy Drama Keywords waitress cook restaurant kitchen parody food claude monet Content Score 100 Yes! Looking good! Top Contributors 54 NEOhidra 19 david8s95 v 11 vking 7 mrtextortexel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}