{"link": "https://www.themoviedb.org/tv/39810?language=en", "title": "Il giovane Mussolini", "resume": "After rapidly ascending the ranks of the Socialist Party, Benito Mussolini created a Fascist state in 1920s Italy through his use of propaganda and diplomacy and led his people in a bloody war that would ultimately result in his downfall.", "rate": 0, "genre": [], "cast": ["Antonio Banderas", "Toni Bertorelli", "Valentina Lainati", "Ivano Marescotti", "Franco Mescolini"], "character": ["Benito Mussolini", "Primo", "Giulia Ferrari", "Giacinto Menotti Serrati", "Ferrari"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39810   Expand Il giovane Mussolini   (1994) User Score Overview After rapidly ascending the ranks of the Socialist Party, Benito Mussolini created a Fascist state in 1920s Italy through his use of propaganda and diplomacy and led his people in a bloody war that would ultimately result in his downfall. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antonio Banderas Benito Mussolini Toni Bertorelli Primo Valentina Lainati Giulia Ferrari Ivano Marescotti Giacinto Menotti Serrati Franco Mescolini Ferrari Full Cast & Crew Last Season Miniseries 1994 | 3 Episodes Season 1 of Il giovane Mussolini premiered on February  1, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Il giovane Mussolini. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  Italian Runtime  - Homepage  - Genres No genres have been added. Keywords benito mussolini Content Score 64 We're so close, yet so far. Top Contributors m 12 magico77 11 Banana TB 6 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}