{"link": "https://www.themoviedb.org/tv/67148?language=en", "title": "Haters Back Off", "resume": "Delve into the oddball family life of Miranda Sings, an incredibly confident, totally untalented star on the rise, who continues to fail upward by the power of her belief that she was born famous, it's just no one knows it yet.", "rate": 61, "genre": ["Comedy"], "cast": ["Colleen Ballinger", "Angela Kinsey", "Francesca Reale", "Erik Stocklin", "Steve Little"], "character": ["Miranda Sings", "Bethany", "Emily", "Patrick", "Uncle Jim"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67148   Expand Haters Back Off   (2016) User Score  Play Trailer Overview Delve into the oddball family life of Miranda Sings, an incredibly confident, totally untalented star on the rise, who continues to fail upward by the power of her belief that she was born famous, it's just no one knows it yet. Featured Crew Colleen Ballinger Creator Chris Ballinger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Colleen Ballinger Miranda Sings Angela Kinsey Bethany Francesca Reale Emily Erik Stocklin Patrick Steve Little Uncle Jim Full Cast & Crew Current Season Season 2 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply s a very brilliant show Open 1 by  AmBeck22 w Emily: Happy Birthday Francesca Reale! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  2 Posters  4 Recommendations   2017-04-21 Hot Girls Wanted: Turned On 7.6    2015-12-01 Real Rob 5.8    2016-08-12 Ask the Storybots 7.5    2015-09-08 Apaches 7.3    2017-09-20 Tiempos de guerra 7.0    2016-07-05 Fangbone! 6.7    2015-08-07 Project Mc² 4.7    2015-06-12 Conspiracy 5.7  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://netflix.com/hatersbackoff Genres Comedy Keywords youtube viral video Content Score 100 Yes! Looking good! Top Contributors 67 Marr 🇳🇱 37 Elizabeth Jennings p 13 plumpro 8 Ibuddy66  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}