{"link": "https://www.themoviedb.org/tv/69866?language=en", "title": "Detroiters", "resume": "Best friends and fledgling ad men Sam and Tim may not have the money, connections or talent that the big guys do, but they have ambition out the wazoo. Together, they’re out to build a local advertising empire and restore their home city of Detroit to its former glory in this new show from executive producers Lorne Michaels and Jason Sudeikis.", "rate": 60, "genre": ["Comedy"], "cast": ["Sam Richardson", "Tim Robinson", "Shawntay Dalon"], "character": ["Sam Duvet", "Tim Cramblin", "Chrissy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69866   Expand Detroiters   (2017) User Score  Play Trailer Overview Best friends and fledgling ad men Sam and Tim may not have the money, connections or talent that the big guys do, but they have ambition out the wazoo. Together, they’re out to build a local advertising empire and restore their home city of Detroit to its former glory in this new show from executive producers Lorne Michaels and Jason Sudeikis. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Richardson Sam Duvet Tim Robinson Tim Cramblin Shawntay Dalon Chrissy Full Cast & Crew Current Season Season 2 2018 | 5 Episodes Season 2 of Detroiters premiered on June 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Detroiters. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.cc.com/shows/detroiters Genres Comedy Keywords detroit Content Score 64 We're so close, yet so far. Top Contributors 15 YareYareDaze 14 Elizabeth Jennings 5 zkoof 4 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}