{"link": "https://www.themoviedb.org/tv/62974?language=en", "title": "8 Out of 10 Cats Does Countdown", "resume": "Jimmy Carr hosts proceedings as the 8 Out of 10 Cats crew take over the words and numbers quiz.", "rate": 73, "genre": ["Comedy", "Reality"], "cast": ["Jimmy Carr", "Jon Richardson", "Sean Lock", "Rachel Riley", "Susie Dent"], "character": ["Host", "Team Captain", "Team Captain", "Co-Host", "Lexicographer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62974   Expand 8 Out of 10 Cats Does Countdown   (2013) User Score  Play Trailer Overview Jimmy Carr hosts proceedings as the 8 Out of 10 Cats crew take over the words and numbers quiz. Featured Crew Armand Jammot Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  40 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jimmy Carr Host Jon Richardson Team Captain Sean Lock Team Captain Rachel Riley Co-Host Susie Dent Lexicographer Full Cast & Crew Current Season Season 15 2018 | 4 Episodes Season 15 of 8 Out of 10 Cats Does Countdown premiered on January 19, 2018. View All Seasons Social Reviews  0 Discussions  40 Subject Status Replies Last Reply There are no discussions for 8 Out of 10 Cats Does Countdown. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   1996-11-12 Never Mind the Buzzcocks 7.5    2007-06-16 Would I Lie to You? 7.8    1991-01-03 The Mary Whitehouse Experience 8.0    1993-12-27 Shooting Stars 6.7    2013-01-16 Kroll Show 7.1    2013-10-06 Was It Something I Said? 7.6    2007-08-06 Drunk History 6.6    1999-04-07 Strangers with Candy 7.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  47m Homepage   http://www.channel4.com/programmes/8-out-of-10-cats-does-countdown/ Genres Comedy Reality Keywords game show puzzle numbers panel show mash up british humour celebrity panel letters Content Score 100 Yes! Looking good! Top Contributors 36 Chimpanzee p 28 ptrain 27 Ash TK 24 The K  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}