{"link": "https://www.themoviedb.org/tv/22830?language=en", "title": "Flambards", "resume": "In the early 1900s in England, young Christina is orphaned and goes to live with her Uncle Russell, who owns the country estate of Flambards, and has two sons. Mark, the elder, is a wastrel, a roue and, like his father, loves to hunt. The younger son, William, lives to fly aeroplanes. Christina finds herself struggling with the ideas of classism as she falls in love with country life, the hunt, and one of her cousins. But after their impulsive marriage, when her husband is called away by the First World War, Christina must keep Flambards afloat by herself.", "rate": 80, "genre": ["Drama"], "cast": ["Christine McKenna", "Rosalie Williams", "Steven Grives", "Frank Mills", "Alan Parnaby"], "character": ["Christina Parsons", "Mary", "Mark Russell", "Fowler", "William Russell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 22830   Expand Flambards   (1979) User Score Overview In the early 1900s in England, young Christina is orphaned and goes to live with her Uncle Russell, who owns the country estate of Flambards, and has two sons. Mark, the elder, is a wastrel, a roue and, like his father, loves to hunt. The younger son, William, lives to fly aeroplanes. Christina finds herself struggling with the ideas of classism as she falls in love with country life, the hunt, and one of her cousins. But after their impulsive marriage, when her husband is called away by the First World War, Christina must keep Flambards afloat by herself. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christine McKenna Christina Parsons Rosalie Williams Mary Steven Grives Mark Russell Frank Mills Fowler Alan Parnaby William Russell Full Cast & Crew Last Season Season 1 1979 | 13 Episodes Season 1 of Flambards premiered on February  2, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Flambards. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords miniseries Content Score 86 Almost there... Top Contributors TB 28 TMDb Bot R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}