{"link": "https://www.themoviedb.org/tv/11863?language=en", "title": "Aktenzeichen XY … ungelöst", "resume": "Aktenzeichen XY … ungelöst is a German television programme broadcast since October 1967 on ZDF that aims to combat and solve crimes. Until 2003 it was produced in co-operation with the Austrian public service broadcaster ORF and Schweizer Fernsehen, a division of the Swiss public broadcaster SRG SSR idée suisse. It was the basis for the BBC show Crimewatch, the Dutch show Opsporing Verzocht and its US equivalent America's Most Wanted.\nThe goal of the programme is to throw light on unsolved offences with the aid of viewers. Each episode contains three to five short films, each lasting about ten minutes, in which a real criminal case is reconstructed. The cases are mostly complex ones in which the criminals and chains of events are still unknown. In addition cases are discussed in the studio in which, for example, the identities of criminals or unknown murder victims are sought with the aid of a photo. Viewers can use the telephone or Internet to give information. According to a study by the programme's editorial department, about forty percent of cases shown on the programme are solved.", "rate": 70, "genre": ["Reality"], "cast": ["Eduard Zimmermann", "Rudi Cerne"], "character": ["Gastgeber", "Gastgeber"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11863   Expand Aktenzeichen XY … ungelöst   (1967) User Score Overview Aktenzeichen XY … ungelöst is a German television programme broadcast since October 1967 on ZDF that aims to combat and solve crimes. Until 2003 it was produced in co-operation with the Austrian public service broadcaster ORF and Schweizer Fernsehen, a division of the Swiss public broadcaster SRG SSR idée suisse. It was the basis for the BBC show Crimewatch, the Dutch show Opsporing Verzocht and its US equivalent America's Most Wanted. The goal of the programme is to throw light on unsolved offences with the aid of viewers. Each episode contains three to five short films, each lasting about ten minutes, in which a real criminal case is reconstructed. The cases are mostly complex ones in which the criminals and chains of events are still unknown. In addition cases are discussed in the studio in which, for example, the identities of criminals or unknown murder victims are sought with the aid of a photo. Viewers can use the telephone or Internet to give information. According to a study by the programme's editorial department, about forty percent of cases shown on the programme are solved. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eduard Zimmermann Gastgeber Rudi Cerne Gastgeber Full Cast & Crew Last Season Season 1 1967 | 135 Episodes Season 1 of Aktenzeichen XY … ungelöst premiered on October 20, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Aktenzeichen XY … ungelöst. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  German Runtime  90m Homepage  - Genres Reality Keywords crime Content Score 43 There's no 'I' in team... Top Contributors S 22 Samara A 5 Atlomonk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}