{"link": "https://www.themoviedb.org/tv/20451?language=en", "title": "Tenchi Universe", "resume": "Tenchi Masaki may be a 17-year-old young man in rural Japan, but  little does he know how bad his day will be getting. When a space pirate  chased by a pair of Galaxy Police officers crash-lands at his  grandfather's temple, Tenchi is sucked into a new adventure that will  literally blast him off into outer space and beyond.", "rate": 82, "genre": ["Animation", "Action", "Adventure", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Yuuko Kobayashi", "Etsuko Kozakura", "Yuri Amano", "Ai Orikasa", "Norio Wakamoto"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20451   Expand Tenchi Universe   (1995) User Score Overview Tenchi Masaki may be a 17-year-old young man in rural Japan, but  little does he know how bad his day will be getting. When a space pirate  chased by a pair of Galaxy Police officers crash-lands at his  grandfather's temple, Tenchi is sucked into a new adventure that will  literally blast him off into outer space and beyond. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuko Kobayashi Etsuko Kozakura Yuri Amano Ai Orikasa Norio Wakamoto Full Cast & Crew Last Season Season 1 1995 | 26 Episodes Season 1 of Tenchi Universe premiered on April  2, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Tenchi Universe. You can help by rating TV shows you've seen. Facts Original Name  天地無用！ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors NS 6 Norte Serra f 5 francoaldo t 5 tmdb983464 1 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}