{"link": "https://www.themoviedb.org/tv/45886?language=en", "title": "Happy Together", "resume": "Happy Together is a Russian TV series that has been broadcast in TNT since March 2006. It is a remake of an American TV series Married... with Children.", "rate": 45, "genre": [], "cast": ["Viktor Loginov", "Natalya Bochkaryova", "Darya Sagalova", "Alexandr Yakin"], "character": ["Геннадий Петрович Букин (Гена)", "Евдокия Евкакиевна Букина (Даша)", "Светлана Геннадиевна Букина (Светка)", "Роман Геннадиевич Букин (Рома)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45886   Expand Happy Together   (2006) User Score Overview Happy Together is a Russian TV series that has been broadcast in TNT since March 2006. It is a remake of an American TV series Married... with Children. Featured Crew Ron Leavitt Creator Michael G. Moye Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Viktor Loginov Геннадий Петрович Букин (Гена) Natalya Bochkaryova Евдокия Евкакиевна Букина (Даша) Darya Sagalova Светлана Геннадиевна Букина (Светка) Alexandr Yakin Роман Геннадиевич Букин (Рома) Full Cast & Crew Last Season Season 1 2006 | 10 Episodes Season 1 of Happy Together premiered on March  8, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2008-08-25 Универ 4.3    2006-11-04 Our Russia 3.7    2005-12-19 The Master and Margarita 6.0    2010-03-29 Interny 5.7    1990-04-22 Jeeves and Wooster 7.7    2014-04-07 P. E. Teacher 6.1    1976-06-04 Twelve Chairs 7.5  Facts Original Name  Счастливы вместе Status  Ended Network Certification  - Type  Scripted Original Language  Russian Runtime  25m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 17 West@ d 8 dimka r 4 rodion D 3 Denys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}