{"link": "https://www.themoviedb.org/tv/45467?language=en", "title": "Ally of Justice", "resume": "15-year-old Yoko, a young girl who is constantly tormented by her self-centered and devilish older sister Makiko, who works for a government office after having graduated from a famous university. But despite her ill nature, Makiko's actions tend to somehow make things better for those around her, causing others to praise her as an \"ally of justice.\"", "rate": 80, "genre": ["Comedy"], "cast": ["Yu Yamada", "Mirai Shida", "Osamu Mukai", "Kanata Hongo", "Saori Takizawa"], "character": ["Nakata Makiko / Yoshikawa Makiko", "Nakata Yoko", "Yoshikawa Naoki", "Okamoto Riku", "Yamashita Midori"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45467   Expand Ally of Justice   (2008) User Score Overview 15-year-old Yoko, a young girl who is constantly tormented by her self-centered and devilish older sister Makiko, who works for a government office after having graduated from a famous university. But despite her ill nature, Makiko's actions tend to somehow make things better for those around her, causing others to praise her as an \"ally of justice.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yu Yamada Nakata Makiko / Yoshikawa Makiko Mirai Shida Nakata Yoko Osamu Mukai Yoshikawa Naoki Kanata Hongo Okamoto Riku Saori Takizawa Yamashita Midori Full Cast & Crew Last Season Season 1 2008 | 10 Episodes Season 1 of Ally of Justice premiered on July  9, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ally of Justice. You can help by rating TV shows you've seen. Facts Original Name  正義の味方 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage   http://www.ntv.co.jp/seigi/ Genres Comedy Keywords japan sibling relationship older sister Content Score 71 Just a little bit more... Top Contributors 27 Wendy A 5 Aka75 c 3 creativo 3 Terence Haejin Lee  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}