{"link": "https://www.themoviedb.org/tv/19836?language=en", "title": "Magical Girl Lyrical Nanoha", "resume": "Magical Girl Lyrical Nanoha is a Japanese anime television series directed by Akiyuki Shinbo, with screenplay written by Masaki Tsuzuki, and produced by Seven Arcs. It forms part of the Magical Girl Lyrical Nanoha series. The Japanese Association of Independent Television Stations broadcast thirteen episodes between October and December 2004. The series is a spin-off of the Triangle Heart series and its story follows a young girl named Nanoha Takamachi who decides to help a young mage named Yūno to recover a set of twenty-one artifacts named the \"Jewel Seeds\".\nMasaki Tsuzuki adapted the series into a novel, which Megami Bunko published in August 2005. King Records has adapted several soundtracks and drama CDs from the series. A sequel to the anime series titled Magical Girl Lyrical Nanoha A's produced by Seven Arcs premiered in Japan on October 2005, broadcast on Chiba TV. A film adaptation of the anime series, also by Seven Arcs, was released in theaters on January 23, 2010, accompanied by a manga series which was serialized in Megami Magazine between November 2009 and March 2011.\nGeneon Entertainment licensed the anime series for English-language dubbed release in North America at Anime Expo 2007. Due to Geneon switching distribution labels between September 2007 and July 2008, Funimation Entertainment distributed the series approximately one and a half years after the announcement of the licensing. Many production-credits for the English-language dubbed release were missing.", "rate": 70, "genre": ["Animation", "Sci-Fi", "Fantasy", "Drama", "Comedy", "Drama", "Action", "Adventure", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19836   Expand Magical Girl Lyrical Nanoha   (2004) User Score Overview Magical Girl Lyrical Nanoha is a Japanese anime television series directed by Akiyuki Shinbo, with screenplay written by Masaki Tsuzuki, and produced by Seven Arcs. It forms part of the Magical Girl Lyrical Nanoha series. The Japanese Association of Independent Television Stations broadcast thirteen episodes between October and December 2004. The series is a spin-off of the Triangle Heart series and its story follows a young girl named Nanoha Takamachi who decides to help a young mage named Yūno to recover a set of twenty-one artifacts named the \"Jewel Seeds\". Masaki Tsuzuki adapted the series into a novel, which Megami Bunko published in August 2005. King Records has adapted several soundtracks and drama CDs from the series. A sequel to the anime series titled Magical Girl Lyrical Nanoha A's produced by Seven Arcs premiered in Japan on October 2005, broadcast on Chiba TV. A film adaptation of the anime series, also by Seven Arcs, was released in theaters on January 23, 2010, accompanied by a manga series which was serialized in Megami Magazine between November 2009 and March 2011. Geneon Entertainment licensed the anime series for English-language dubbed release in North America at Anime Expo 2007. Due to Geneon switching distribution labels between September 2007 and July 2008, Funimation Entertainment distributed the series approximately one and a half years after the announcement of the licensing. Many production-credits for the English-language dubbed release were missing. Featured Crew Seven Arcs Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Vivid 2015 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Magical Girl Lyrical Nanoha. You can help by rating TV shows you've seen. Facts Original Name  魔法少女リリカルなのは Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.nanoha.com/archive/ Genres Animation Sci-Fi & Fantasy Drama Comedy Drama Action & Adventure Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 5 yoshizuka 5 a4840639 T 4 Tiran m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}