{"link": "https://www.themoviedb.org/tv/3411?language=en", "title": "RoboCop: The Animated Series", "resume": "RoboCop: The Animated Series is an American animated series produced in the 1980s by Marvel Productions, and is based on the character and events of the movie RoboCop.\nThe animated series was derived from source material with mature themes, as was the case with contemporary animated shows such as Rambo: The Force of Freedom, Mortal Kombat: Defenders of the Realm, Police Academy and Toxic Crusaders. Among the more notable changes were the removal of bullets and a more science fiction setting. In this series, RoboCop had a red light in the middle of his visor.\nThe series was animated by AKOM Productions.", "rate": 47, "genre": ["Animation", "Action", "Adventure"], "cast": ["Barbara Budd", "Len Carlson", "Rex Hagon", "Susan Roman", "Dan Hennessey"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3411   Expand RoboCop: The Animated Series   (1988) User Score Overview RoboCop: The Animated Series is an American animated series produced in the 1980s by Marvel Productions, and is based on the character and events of the movie RoboCop. The animated series was derived from source material with mature themes, as was the case with contemporary animated shows such as Rambo: The Force of Freedom, Mortal Kombat: Defenders of the Realm, Police Academy and Toxic Crusaders. Among the more notable changes were the removal of bullets and a more science fiction setting. In this series, RoboCop had a red light in the middle of his visor. The series was animated by AKOM Productions. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barbara Budd Len Carlson Rex Hagon Susan Roman Dan Hennessey Full Cast & Crew Last Season Season 1 1988 | 12 Episodes Season 1 of RoboCop: The Animated Series premiered on October  1, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on RoboCop: The Animated Series. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 3 speedycars M 3 Mec!as D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}