{"link": "https://www.themoviedb.org/tv/1615?language=en", "title": "Chip 'n Dale Rescue Rangers", "resume": "Chip 'n Dale: Rescue Rangers is an animated series produced by Walt Disney Television Animation. Created by Tad Stones and Alan Zaslove, it featured the established Disney characters Chip 'n' Dale in a new setting. The series premiered on the Disney Channel on March 4, 1989, after a preview episode was aired on August 27, 1988. The series premiered with a two-hour movie special, Rescue Rangers: To the Rescue, which was later broken up into five parts to air as part of the weekday run. The final episode aired on November 19, 1990.\nOn September 18, 1989, the series entered national syndication. From 1998 to 1999, reruns of the show were aired as a part of the Disney Afternoon line up.", "rate": 73, "genre": ["Animation", "Comedy", "Mystery"], "cast": ["Corey Burton", "Tress MacNeille", "Jim Cummings", "Harald Mæle", "Mari Maurstad"], "character": ["Dale (voice)", "Chip (voice)", "Monterey Jack / Professor Norton Nimnul  (voice)", "Snapp, Norton Nimnul, Fat Cat, Jolly Roger, DTZ, Conrad Cockatoo (stemme)", "Snipp (stemme)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1615   Expand Chip 'n Dale Rescue Rangers   (1989) User Score Overview Chip 'n Dale: Rescue Rangers is an animated series produced by Walt Disney Television Animation. Created by Tad Stones and Alan Zaslove, it featured the established Disney characters Chip 'n' Dale in a new setting. The series premiered on the Disney Channel on March 4, 1989, after a preview episode was aired on August 27, 1988. The series premiered with a two-hour movie special, Rescue Rangers: To the Rescue, which was later broken up into five parts to air as part of the weekday run. The final episode aired on November 19, 1990. On September 18, 1989, the series entered national syndication. From 1998 to 1999, reruns of the show were aired as a part of the Disney Afternoon line up. Featured Crew Tad Stones Creator Alan Zaslove Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Corey Burton Dale (voice) Tress MacNeille Chip (voice) Jim Cummings Monterey Jack / Professor Norton Nimnul  (voice) Harald Mæle Snapp, Norton Nimnul, Fat Cat, Jolly Roger, DTZ, Conrad Cockatoo (stemme) Mari Maurstad Snipp (stemme) Full Cast & Crew Last Season Season 3 1990 | 5 Episodes Season 3 of Chip 'n Dale Rescue Rangers premiered on September 10, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   1987-09-18 DuckTales 7.6    1987-09-10 Teenage Mutant Ninja Turtles 7.3    1991-09-08 Darkwing Duck 7.3    1985-09-14 Disney's Adventures of the Gummi Bears 7.6    1994-09-05 Aladdin 6.2    1983-09-10 Inspector Gadget 6.6    1992-07-25 TaleSpin 7.3    1991-09-07 Taz-Mania 6.3  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m Homepage   http://movies.disney.com/chip-n-dale-rescue-rangers Genres Animation Comedy Mystery Keywords amateur detective chipmunk Content Score 93 Almost there... Top Contributors 20 Banana 16 Elizabeth Jennings 9 d00ziie z 8 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}