{"link": "https://www.themoviedb.org/tv/7094?language=en", "title": "Ross Kemp in Afghanistan", "resume": "Ross Kemp in Afghanistan, also known as Ross Kemp: Return to Afghanistan for series 2, is a Sky One British documentary series fronted by actor Ross Kemp about the British soldiers fighting in the War in Afghanistan as part of the International Security Assistance Force mission against the Taliban. The two series involved Kemp and a small embedded film crew following troops fighting in Helmand Province, documenting their part in the ongoing Operation Herrick.\nRoss Kemp in Afghanistan, first broadcast in January 2008, followed the 2007 deployment of the 1st Battalion of the Royal Anglian Regiment. As a follow-up to the first series, Ross Kemp: Return to Afghanistan, first broadcast from 1 February 2009, followed the 2008 deployment of the Argyll and Sutherland Highlanders, the 5th battalion of the Royal Regiment of Scotland.\nIn the first series Kemp and his crew participate in the Vikings' initial training in Britain for the deployment. They then visit the unit during their six-month tour, filming both life at rest and on fighting patrols in Helmand. The series finally covers their return to the UK. In the follow-up series Kemp returns to Afghanistan to assess how the conflict has changed since his first visit in 2007.", "rate": 100, "genre": ["Documentary"], "cast": ["Ross Kemp"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7094   Expand Ross Kemp in Afghanistan   (2008) User Score Overview Ross Kemp in Afghanistan, also known as Ross Kemp: Return to Afghanistan for series 2, is a Sky One British documentary series fronted by actor Ross Kemp about the British soldiers fighting in the War in Afghanistan as part of the International Security Assistance Force mission against the Taliban. The two series involved Kemp and a small embedded film crew following troops fighting in Helmand Province, documenting their part in the ongoing Operation Herrick. Ross Kemp in Afghanistan, first broadcast in January 2008, followed the 2007 deployment of the 1st Battalion of the Royal Anglian Regiment. As a follow-up to the first series, Ross Kemp: Return to Afghanistan, first broadcast from 1 February 2009, followed the 2008 deployment of the Argyll and Sutherland Highlanders, the 5th battalion of the Royal Regiment of Scotland. In the first series Kemp and his crew participate in the Vikings' initial training in Britain for the deployment. They then visit the unit during their six-month tour, filming both life at rest and on fighting patrols in Helmand. The series finally covers their return to the UK. In the follow-up series Kemp returns to Afghanistan to assess how the conflict has changed since his first visit in 2007. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ross Kemp Full Cast & Crew Last Season Season 2 2009 | 5 Episodes Season 2 of Ross Kemp in Afghanistan premiered on February  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Ross Kemp in Afghanistan. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Documentary Original Language  English Runtime  44m Homepage  - Genres Documentary Keywords war in afghanistan documentary british soldier Content Score 56 We're so close, yet so far. Top Contributors 13 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}