{"link": "https://www.themoviedb.org/tv/4495?language=en", "title": "Victor and Hugo", "resume": "Victor and Hugo, Bunglers in Crime is an animated series made by Cosgrove Hall for Thames Television and screened on CITV from 6 September 1991 to 29 December 1992 and is a spin off from Count Duckula.\nThe series centres on the exploits of two bumbling French criminals - the eponymous brothers of the title. Despite referencing the French author Victor Hugo in their names, neither brother was particularly intelligent.\nThe plot of each episode dealt with Victor and Hugo and their English-based business \"Naughtiness International\" being hired by crime figures to steal something. Victor would come up with a \"meticulous plan\" to achieve this goal, which was routinely botched by Hugo. The episodes would traditionally end with the brothers imprisoned.", "rate": 0, "genre": ["Animation"], "cast": ["Jimmy Hibbert", "David Jason", "Brian Trueman"], "character": ["Hugo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4495   Expand Victor and Hugo   (1991) User Score Overview Victor and Hugo, Bunglers in Crime is an animated series made by Cosgrove Hall for Thames Television and screened on CITV from 6 September 1991 to 29 December 1992 and is a spin off from Count Duckula. The series centres on the exploits of two bumbling French criminals - the eponymous brothers of the title. Despite referencing the French author Victor Hugo in their names, neither brother was particularly intelligent. The plot of each episode dealt with Victor and Hugo and their English-based business \"Naughtiness International\" being hired by crime figures to steal something. Victor would come up with a \"meticulous plan\" to achieve this goal, which was routinely botched by Hugo. The episodes would traditionally end with the brothers imprisoned. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jimmy Hibbert David Jason Hugo Brian Trueman Full Cast & Crew Last Season bunglers in crime season 2 1992 | 17 Episodes Season 2 of Victor and Hugo premiered on September 11, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Victor and Hugo. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 20m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}