{"link": "https://www.themoviedb.org/tv/73950?language=en", "title": "A Criação", "resume": "A fable with people and furrys about the creative industry and the commercial arts.", "rate": 0, "genre": ["Comedy"], "cast": ["Diogo Mesquita", "Gonçalo Carvalho", "Mafalda Jara", "Romeu Vala", "Angel Tovar"], "character": ["Urso", "Leãozinho", "Girafa", "Corvo", "Raposa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73950   Expand A Criação   (2017) User Score Overview A fable with people and furrys about the creative industry and the commercial arts. Featured Crew Pedro Bidarra Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diogo Mesquita Urso Gonçalo Carvalho Leãozinho Mafalda Jara Girafa Romeu Vala Corvo Angel Tovar Raposa Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of A Criação premiered on September 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Criação. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification 16 Meaning Not suitable for children under 16, access to these programs is locked by a personal password. Type  Scripted Original Language  Portuguese Runtime  25m Homepage   http://media.rtp.pt/acriacao/ Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors J 75 JoaoEdu 22 TheMrKiko HS 9 Hugo S. R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}