{"link": "https://www.themoviedb.org/tv/66276?language=en", "title": "The Night Of", "resume": "After a night of partying with a female stranger, a man wakes up to find her stabbed to death and is charged with her murder.", "rate": 77, "genre": ["Crime", "Drama", "Mystery"], "cast": ["John Turturro", "Riz Ahmed", "Michael Kenneth Williams", "Bill Camp", "Jeannie Berlin"], "character": ["Jack Stone", "Nasir Khan", "Freddy Knight", "Dennis Box", "Helen Weiss"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66276   Expand The Night Of   (2016) User Score  Play Trailer Overview After a night of partying with a female stranger, a man wakes up to find her stabbed to death and is charged with her murder. Featured Crew Richard Price Creator Steven Zaillian Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Turturro Jack Stone Riz Ahmed Nasir Khan Michael Kenneth Williams Freddy Knight Bill Camp Dennis Box Jeannie Berlin Helen Weiss Full Cast & Crew Last Season Season 1 2016 | 8 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply one of the best shows ever! Open 4 by  Levenspiel So ... Did he or didn´t he? (spoiler) Open 1 by  Levenspiel Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  5 Recommendations   2016-02-21 The Night Manager 7.7    2017-07-21 Ozark 8.0    2014-04-15 Fargo 8.2    2016-10-14 Goliath 7.8    2014-06-29 The Leftovers 7.7    2011-04-03 The Killing 7.5    2015-02-08 Better Call Saul 8.1    2013-02-01 House of Cards 8.2  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  50m Homepage   http://www.hbo.com/the-night-of Genres Crime Drama Mystery Keywords prison trial murder jail miniseries crime court trial murder investigation murder trial eczema Content Score 100 Yes! Looking good! Top Contributors 22 Travis Bell 17 Elizabeth Jennings b 12 broccoli7 G 9 Gadileth  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}