{"link": "https://www.themoviedb.org/tv/34844?language=en", "title": "キスダム -ENGAGE planet-", "resume": "Engage Planet kiss dum is a mecha anime series, directed by Yasuchika Nagaoka and Eiichi Satō, and produced by Aniplex and Satelight. It premiered in Japan from April 3, 2007 on TV Tokyo.", "rate": 0, "genre": ["Drama", "Animation", "Action", "Adventure", "Action", "Adventure"], "cast": ["Marina Inoue", "Katsuyuki Konishi", "Daisuke Ono", "Ryoka Yuzuki", "Kenji Nomura"], "character": ["Ton Kirī", "Masaki", "Shū Aiba", "Rei", "Roki Demon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34844   Expand キスダム -ENGAGE planet-   (2007) User Score Overview Engage Planet kiss dum is a mecha anime series, directed by Yasuchika Nagaoka and Eiichi Satō, and produced by Aniplex and Satelight. It premiered in Japan from April 3, 2007 on TV Tokyo. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marina Inoue Ton Kirī Katsuyuki Konishi Masaki Daisuke Ono Shū Aiba Ryoka Yuzuki Rei Kenji Nomura Roki Demon Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of キスダム -ENGAGE planet- premiered on April  3, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on キスダム -ENGAGE planet-. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Drama Animation Action & Adventure Action & Adventure Keywords mecha Content Score 86 Almost there... Top Contributors T 8 TexBill m 3 magoozin TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}