{"link": "https://www.themoviedb.org/tv/34858?language=en", "title": "The Snow Queen", "resume": "The Snow Queen is an anime television series based on the children's story of the same name by Hans Christian Andersen. It is directed by Osamu Dezaki and animated by TMS Entertainment. The first episode aired on May 22, 2005 on Japan's NHK network.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Rio Natsuki", "Ayako Kawasumi", "Noriko Hidaka", "Tetsuo Goto", "Mayo Suzukaze"], "character": ["Kay", "Gerda", "Nina", "Red Troll", "Snow Queen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34858   Expand The Snow Queen   (2005) User Score Overview The Snow Queen is an anime television series based on the children's story of the same name by Hans Christian Andersen. It is directed by Osamu Dezaki and animated by TMS Entertainment. The first episode aired on May 22, 2005 on Japan's NHK network. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rio Natsuki Kay Ayako Kawasumi Gerda Noriko Hidaka Nina Tetsuo Goto Red Troll Mayo Suzukaze Snow Queen Full Cast & Crew Last Season Season 1 2005 | 36 Episodes Season 1 of The Snow Queen premiered on May 22, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Snow Queen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}