{"link": "https://www.themoviedb.org/tv/13753?language=en", "title": "The Duchess of Duke Street", "resume": "The Duchess Of Duke Street is a BBC television drama series set in London between 1900 and 1925. It was created by John Hawkesworth, the former producer of the highly successful ITV period drama Upstairs, Downstairs. It starred Gemma Jones as Louisa Leyton/Trotter, the eponymous \"Duchess\" who works her way up from servant to renowned cook to proprietrix of the upper-class Bentinck Hotel in Duke Street, St. James's, in London.\nThe story is loosely based on the real-life career of Rosa Lewis, the \"Duchess of Jermyn Street\", who ran the Cavendish Hotel in London. When the show first aired, there were many people who still remembered her, as she lived until 1952. According to census returns, she was born in Leyton, Essex, to a watchmaker. In the series, Louisa's family name is Leyton, and her father is a clock-maker.\nThe programme lasted for two series totalling 31 episodes, shown between 1976 and 1977. It was nominated for an Emmy Award for Outstanding Limited Series in 1980. The theme music was composed by Alexander Faris.", "rate": 77, "genre": ["Drama"], "cast": ["John Welsh", "Richard Vernon", "John Cater", "Gemma Jones", "Christopher Cazenove"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13753   Expand The Duchess of Duke Street   (1976) User Score Overview The Duchess Of Duke Street is a BBC television drama series set in London between 1900 and 1925. It was created by John Hawkesworth, the former producer of the highly successful ITV period drama Upstairs, Downstairs. It starred Gemma Jones as Louisa Leyton/Trotter, the eponymous \"Duchess\" who works her way up from servant to renowned cook to proprietrix of the upper-class Bentinck Hotel in Duke Street, St. James's, in London. The story is loosely based on the real-life career of Rosa Lewis, the \"Duchess of Jermyn Street\", who ran the Cavendish Hotel in London. When the show first aired, there were many people who still remembered her, as she lived until 1952. According to census returns, she was born in Leyton, Essex, to a watchmaker. In the series, Louisa's family name is Leyton, and her father is a clock-maker. The programme lasted for two series totalling 31 episodes, shown between 1976 and 1977. It was nominated for an Emmy Award for Outstanding Limited Series in 1980. The theme music was composed by Alexander Faris. Featured Crew John Hawkesworth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Welsh Richard Vernon John Cater Gemma Jones Christopher Cazenove Full Cast & Crew Last Season Season 1 1976 | 15 Episodes Season 1 of The Duchess of Duke Street premiered on September  4, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1988-11-14 Murphy Brown 6.5    2014-10-02 Gracepoint 6.5    2012-09-06 The Bletchley Circle 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 2 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}