{"link": "https://www.themoviedb.org/tv/47597?language=en", "title": "A Respectable Trade", "resume": "A four-part drama, set against the background of the English slave trade and adapted by Philippa Gregory from her novel.", "rate": 0, "genre": ["Drama"], "cast": ["Makaela Alexander", "Sainabou Manneh", "Anton Rice", "Jake Ritzema", "Warren Clarke"], "character": ["Naomi", "Ruth", "Luke", "Link Boy", "Josiah Cole"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47597   Expand A Respectable Trade   (1998) User Score Overview A four-part drama, set against the background of the English slave trade and adapted by Philippa Gregory from her novel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Makaela Alexander Naomi Sainabou Manneh Ruth Anton Rice Luke Jake Ritzema Link Boy Warren Clarke Josiah Cole Full Cast & Crew Last Season Miniseries 1998 | 4 Episodes Season 1 of A Respectable Trade premiered on April 19, 1998. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for A Respectable Trade. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Respectable Trade. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Drama Keywords based on novel or book slavery miniseries 18th century slave trade bristol Content Score 71 Just a little bit more... Top Contributors 29 rudely_murray 15 suzieqtypye R 10 Rebecca 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}