{"link": "https://www.themoviedb.org/tv/3769?language=en", "title": "Dynasty", "resume": "The saga of a wealthy Denver family in the oil business: Blake Carrington, the patriarch; Krystle, his former secretary and wife; his children: Adam, lost in childhood after a kidnapping; Fallon, pampered and spoiled; Steven, openly gay; and Amanda, hidden from him by his ex-wife, the conniving Alexis. Most of the show features the conflict between 2 large corporations, Blake's Denver Carrington and Alexis' ColbyCo.", "rate": 63, "genre": ["Soap", "Drama"], "cast": ["Heather Locklear", "John Forsythe", "Gordon Thomson", "Jack Coleman", "Joan Collins"], "character": ["Sammy Jo Dean Carrington", "Steven Carrington"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3769   Expand Dynasty   (1981) User Score Overview The saga of a wealthy Denver family in the oil business: Blake Carrington, the patriarch; Krystle, his former secretary and wife; his children: Adam, lost in childhood after a kidnapping; Fallon, pampered and spoiled; Steven, openly gay; and Amanda, hidden from him by his ex-wife, the conniving Alexis. Most of the show features the conflict between 2 large corporations, Blake's Denver Carrington and Alexis' ColbyCo. Featured Crew Richard Shaprio Creator Esther Shapiro Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Heather Locklear Sammy Jo Dean Carrington John Forsythe Gordon Thomson Jack Coleman Steven Carrington Joan Collins Full Cast & Crew Last Season Season 9 1988 | 22 Episodes Season 9 of Dynasty premiered on November  2, 1988. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Why So Much Hatred Towards This Show? Open 1 by  crushme c Only on 1st Season Open 3 by  crushme T Reboot Ordered by The CW Open 1 by  Stratego! Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  4 Recommendations   1981-12-04 Falcon Crest 4.2    1974-09-11 Petrocelli 7.8    1978-04-02 Dallas 6.1    1982-09-26 Matt Houston 6.6    1983-09-06 Taggart 7.7    American Gladiators 5.9    1992-07-08 Melrose Place 4.9    1979-09-22 Hart to Hart 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  46m, 60m Homepage   http://www.der-denver-clan.de/de/home.cfm Genres Soap Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors M 101 MAthePA 81 Elizabeth Jennings 9 niqo19 i 3 ismax935  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}