{"link": "https://www.themoviedb.org/tv/37179?language=en", "title": "Nigella Kitchen", "resume": "With her winning mix of passion, enthusiasm and greed, Nigella Lawson is in the kitchen cooking food for modern living that you can and will want to make all the time, whatever the situation. There are easy, everyday, fast and fabulous recipes to beat the clock and celebrate the end of the working day; then more leisurely recipes to unwind with over relaxing weekends. As well as creating dazzling dishes for greedy days, Nigella offers up inspiring and inventive ways to make leftovers delicious. Nigella Kitchen is about cooking at home with simple, accessible ingredients, making every day special and special days easy.", "rate": 0, "genre": [], "cast": ["Nigella Lawson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37179   Expand Nigella Kitchen   (2010) User Score Overview With her winning mix of passion, enthusiasm and greed, Nigella Lawson is in the kitchen cooking food for modern living that you can and will want to make all the time, whatever the situation. There are easy, everyday, fast and fabulous recipes to beat the clock and celebrate the end of the working day; then more leisurely recipes to unwind with over relaxing weekends. As well as creating dazzling dishes for greedy days, Nigella offers up inspiring and inventive ways to make leftovers delicious. Nigella Kitchen is about cooking at home with simple, accessible ingredients, making every day special and special days easy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nigella Lawson Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of Nigella Kitchen premiered on September 30, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Nigella Kitchen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   https://www.bbc.co.uk/programmes/b00v37l6 Genres No genres have been added. Keywords cooking cooking show Content Score 50 Still needs a little work. Top Contributors R 5 Rebecca a 4 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}