{"link": "https://www.themoviedb.org/tv/48860?language=en", "title": "The Tomorrow People", "resume": "The story of several young people from around the world who represent the next stage in human evolution, possessing special powers, including the ability to teleport and communicate with each other telepathically. Together they work to defeat the forces of evil.", "rate": 66, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Robbie Amell", "Peyton List", "Luke Mitchell", "Aaron Yoo", "Mark Pellegrino"], "character": ["Stephen Jameson", "Cara Coburn", "John Young", "Russell Kwon", "Dr. Jedikiah Price"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48860   Expand The Tomorrow People   (2013) User Score  Play Trailer Overview The story of several young people from around the world who represent the next stage in human evolution, possessing special powers, including the ability to teleport and communicate with each other telepathically. Together they work to defeat the forces of evil. Featured Crew Roger Price Creator Greg Berlanti Creator Phil Klemmer Creator Julie Plec Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robbie Amell Stephen Jameson Peyton List Cara Coburn Luke Mitchell John Young Aaron Yoo Russell Kwon Mark Pellegrino Dr. Jedikiah Price Full Cast & Crew Last Season Season 1 2013 | 22 Episodes Season 1 of The Tomorrow People premiered on October  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  10 Recommendations   2014-01-07 Intelligence 6.3    2011-07-11 Alphas 6.5    2012-05-27 Continuum 7.1    2013-11-17 Almost Human 7.0    2004-07-11 The 4400 6.9    2014-02-17 Star-Crossed 5.6    2010-07-09 Haven 7.0    2012-09-17 Revolution 6.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.cwtv.com/shows/the-tomorrow-people Genres Drama Sci-Fi & Fantasy Keywords based on tv series remake superhuman supernatural ability Content Score 100 Yes! Looking good! Top Contributors 27 Elizabeth Jennings 11 dannyfej R 10 Rebecca M 9 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}