{"link": "https://www.themoviedb.org/tv/20745?language=en", "title": "Stockinger", "resume": "Stockinger is an Austrian-made police television drama, with fourteen 45-minute episodes first aired from 1996 to 1997.\nThe series is a spin-off from the popular Austrian television drama Inspector Rex, and focuses on Ernst Stockinger, one of the original members of the Homicide division or Mordkommission in German.\nStockinger leaves the series to return to Salzburg where his wife has inherited a dental practice from her late father . He is appointed a Bezirksinspektor at the Landes Gendarmerie, sharing an office with District Inspector Antonella Simoni.\nUnlike the members of the team in 'Rex', who appear to be self-directed and are seldom seen to answer to senior management, Stockinger reports to Dr Brunner, a philosophising burecratic senior police inspector.\nStockinger is portrayed as a clumsy, almost Inspector Clouseau-like character, driving a clapped-out 1973 VW Variant, but single-minded when following up clues.\nThe series was first broadcast in Australia in February 2008 on SBS television. SBS was responsible for the English subtitles therefore bringing the series to a wider audience than simply those with a knowledge of the German language. SBS also provided the English subtitles for all the Inspector Rex series. The series has since been released in two parts on DVD.", "rate": 0, "genre": ["Crime"], "cast": ["Karl Markovics", "Sandra Cervik", "Anja Schiller", "Herbert Fux", "Hans-Peter Heinzl"], "character": ["Bezirksinspektor Ernst Stockinger", "Bezirksinspektorin Antonella Simoni", "Dr. Karin Stockinger", "Postenkommandant Michael Fuchs", "Oberst Dr. Brunner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20745   Expand Stockinger   (1996) User Score Overview Stockinger is an Austrian-made police television drama, with fourteen 45-minute episodes first aired from 1996 to 1997. The series is a spin-off from the popular Austrian television drama Inspector Rex, and focuses on Ernst Stockinger, one of the original members of the Homicide division or Mordkommission in German. Stockinger leaves the series to return to Salzburg where his wife has inherited a dental practice from her late father . He is appointed a Bezirksinspektor at the Landes Gendarmerie, sharing an office with District Inspector Antonella Simoni. Unlike the members of the team in 'Rex', who appear to be self-directed and are seldom seen to answer to senior management, Stockinger reports to Dr Brunner, a philosophising burecratic senior police inspector. Stockinger is portrayed as a clumsy, almost Inspector Clouseau-like character, driving a clapped-out 1973 VW Variant, but single-minded when following up clues. The series was first broadcast in Australia in February 2008 on SBS television. SBS was responsible for the English subtitles therefore bringing the series to a wider audience than simply those with a knowledge of the German language. SBS also provided the English subtitles for all the Inspector Rex series. The series has since been released in two parts on DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karl Markovics Bezirksinspektor Ernst Stockinger Sandra Cervik Bezirksinspektorin Antonella Simoni Anja Schiller Dr. Karin Stockinger Herbert Fux Postenkommandant Michael Fuchs Hans-Peter Heinzl Oberst Dr. Brunner Full Cast & Crew Last Season Season 1 1996 | 14 Episodes Season 1 of Stockinger premiered on October 23, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Stockinger. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  45m Homepage  - Genres Crime Keywords kommissar Content Score 86 Almost there... Top Contributors S 20 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}