{"link": "https://www.themoviedb.org/tv/61526?language=en", "title": "The Destiny of Rome", "resume": "At the Battle of Philippi, Marc Antony and Octavian fight back their joint enemies to lay claim to Caesar's throne. Eleven years later, the two square off in the naval Battle of Actium to decide once and for all the destiny of Rome. The bitter personal rivalry between the two men climaxes when Marc Antony abandons his attacking forces to pursue the fleeing Cleopatra. This single act sounded the death knell of the Roman Republic and gave birth to an empire.", "rate": 75, "genre": ["Documentary"], "cast": ["Paweł Deląg", "Andy Gillet", "Laëtitia Eïdo", "Tom Hygreck"], "character": ["Marcus Antonius", "Octavian", "Cleopatra", "Agrippa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61526   Expand The Destiny of Rome   (2011) User Score Overview At the Battle of Philippi, Marc Antony and Octavian fight back their joint enemies to lay claim to Caesar's throne. Eleven years later, the two square off in the naval Battle of Actium to decide once and for all the destiny of Rome. The bitter personal rivalry between the two men climaxes when Marc Antony abandons his attacking forces to pursue the fleeing Cleopatra. This single act sounded the death knell of the Roman Republic and gave birth to an empire. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paweł Deląg Marcus Antonius Andy Gillet Octavian Laëtitia Eïdo Cleopatra Tom Hygreck Agrippa Full Cast & Crew Last Season Season 1 2011 | 2 Episodes Season 1 of The Destiny of Rome premiered on June 18, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Destiny of Rome. You can help by rating TV shows you've seen. Facts Original Name  Le Destin de Rome Status  Ended Networks - Certification  - Type  Scripted Original Language  French Runtime  - Homepage  - Genres Documentary Keywords history Content Score 86 Almost there... Top Contributors v 11 vanaj m 10 mikki53 9 Elizabeth Jennings d 6 duss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}