{"link": "https://www.themoviedb.org/tv/14610?language=en", "title": "Secret Lives", "resume": "Salatut elämät is a Finnish television series that premiered on MTV3 on 25 January 1999. It was the first, and so far only, Finnish daily soap opera.\nDuring the series' 14-year run, over 2,500 episodes have been aired. On 17 August 2009, it was announced that Salatut elämät will be on the air until the spring 2015 making the series the second longest-lasting drama series of all time in Finland, only behind Yle TV1's Kotikatu. The series' storylines follow the daily lives of several families who live in the same apartment block in Helsinki. The series primarily centres around the residents of Pihlajakatu and its neighbouring areas. Only three of the original twenty characters Seppo, Ismo and Kalle, still remain in the series, and most of the series' current characters have made their debuts in 2008 or later.\nMTV3 also airs reruns of the series every weekend. In the summer, the channel airs reruns of the series; in the summer of 2011, episodes from the season 2006–2007 and 2007–2008 were aired.\nFour web spin-off series have been made; Romeo & Rafael Desperados in 2008, Lillukanvarsia in 2010–2011, Tuuliranta in 2011–2012 and \"Young man cash man\" in 2013.", "rate": 70, "genre": ["Soap", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14610   Expand Secret Lives   (1999) User Score Overview Salatut elämät is a Finnish television series that premiered on MTV3 on 25 January 1999. It was the first, and so far only, Finnish daily soap opera. During the series' 14-year run, over 2,500 episodes have been aired. On 17 August 2009, it was announced that Salatut elämät will be on the air until the spring 2015 making the series the second longest-lasting drama series of all time in Finland, only behind Yle TV1's Kotikatu. The series' storylines follow the daily lives of several families who live in the same apartment block in Helsinki. The series primarily centres around the residents of Pihlajakatu and its neighbouring areas. Only three of the original twenty characters Seppo, Ismo and Kalle, still remain in the series, and most of the series' current characters have made their debuts in 2008 or later. MTV3 also airs reruns of the series every weekend. In the summer, the channel airs reruns of the series; in the summer of 2011, episodes from the season 2006–2007 and 2007–2008 were aired. Four web spin-off series have been made; Romeo & Rafael Desperados in 2008, Lillukanvarsia in 2010–2011, Tuuliranta in 2011–2012 and \"Young man cash man\" in 2013. Featured Crew Jason Daniel Creator Anne Harris Creator Greg Stevens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 18 2015 | 55 Episodes Season 18 of Secret Lives premiered on August 31, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Secret Lives. You can help by rating TV shows you've seen. Facts Original Name  Salatut elämät Status  Returning Series Network Certification  - Type  Scripted Original Language  Finnish Runtime  30m Homepage   http://www.mtv3.fi/salatutelamat/ Genres Soap Drama Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors J 44 Jouni a 38 alicea 16 Elizabeth Jennings p 9 plastik_beg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}