{"link": "https://www.themoviedb.org/tv/31411?language=en", "title": "Campus", "resume": "Campus is a semi-improvised British sitcom created by the team behind the comedy sketch show Smack the Pony and hospital-based sitcom Green Wing, led by Victoria Pile who acts as co-writer, producer and director. It is set in the fictitious Kirke University and follows the lives of the staff, in particular the power-crazed and callous vice chancellor Jonty de Wolfe, lazy womanising English literature professor Matt Beer and newly promoted senior mathematics lecturer Imogen Moffat.\nCampus was first broadcast as a television pilot on Channel 4 on 6 November 2009, as part of the channel's Comedy Showcase season of comedy pilots. A full series was later commissioned and commenced airing on 5 April 2011, with the first episode being a re-shoot and expanded version of the pilot. When first broadcast many critics claimed it was too similar to Green Wing and that much of the humour was offensive. However, others praised the show's dark humour and surrealism. Campus was cancelled after one series due to poor TV ratings. Over the course of the first series the average ratings were 554,000 viewers per episode, or 2.99% of the total audience, which is below the Channel 4 average.", "rate": 71, "genre": ["Comedy"], "cast": ["Joseph Millson", "Andy Nyman", "Jonathan Bailey", "Chizzy Akudolu"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31411   Expand Campus   (2009) User Score Overview Campus is a semi-improvised British sitcom created by the team behind the comedy sketch show Smack the Pony and hospital-based sitcom Green Wing, led by Victoria Pile who acts as co-writer, producer and director. It is set in the fictitious Kirke University and follows the lives of the staff, in particular the power-crazed and callous vice chancellor Jonty de Wolfe, lazy womanising English literature professor Matt Beer and newly promoted senior mathematics lecturer Imogen Moffat. Campus was first broadcast as a television pilot on Channel 4 on 6 November 2009, as part of the channel's Comedy Showcase season of comedy pilots. A full series was later commissioned and commenced airing on 5 April 2011, with the first episode being a re-shoot and expanded version of the pilot. When first broadcast many critics claimed it was too similar to Green Wing and that much of the humour was offensive. However, others praised the show's dark humour and surrealism. Campus was cancelled after one series due to poor TV ratings. Over the course of the first series the average ratings were 554,000 viewers per episode, or 2.99% of the total audience, which is below the Channel 4 average. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joseph Millson Andy Nyman Jonathan Bailey Chizzy Akudolu Full Cast & Crew Last Season Season 1 2011 | 6 Episodes Season 1 of Campus premiered on April  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2015-06-12 Conspiracy 5.7    2012-10-16 The Strange Calls 6.8    2016-11-15 Brown Nation 7.3    2015-05-24 Tales by Light 7.8  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  - Homepage   http://www.channel4.com/programmes/campus Channel 4 Genres Comedy Keywords college teacher improvisation sitcom college staff Content Score 86 Almost there... Top Contributors 9 Banana 2 ash77ah a 1 alexmate 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}