{"link": "https://www.themoviedb.org/tv/60438?language=en", "title": "My Big Fat American Gypsy Wedding", "resume": "My Big Fat American Gypsy Wedding is an American reality television series that debuted on the TLC in April 2012 and features weddings of American Roma, mostly of the Romanichal ethnic group. It is a spinoff of Britain's Channel 4 series Big Fat Gypsy Weddings. It was announced in June 2012 that the series has been renewed for a second season, which debuted March 24, 2013.", "rate": 20, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60438   Expand My Big Fat American Gypsy Wedding   (2012) User Score Overview My Big Fat American Gypsy Wedding is an American reality television series that debuted on the TLC in April 2012 and features weddings of American Roma, mostly of the Romanichal ethnic group. It is a spinoff of Britain's Channel 4 series Big Fat Gypsy Weddings. It was announced in June 2012 that the series has been renewed for a second season, which debuted March 24, 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 — | 3 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Big Fat American Gypsy Wedding. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://www.tlc.com/tv-shows/my-big-fat-american-gypsy-wedding/ Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 11 Elizabeth Jennings 4 Sekhmet_03 A 2 Aukland D 2 DrakulL  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}