{"link": "https://www.themoviedb.org/tv/8792?language=en", "title": "You're My Pet", "resume": "Tramps Like Us is a Japanese josei manga series by Yayoi Ogawa. It is about Sumire, a young professional woman who takes in a younger man as a pet, and her attempts to keep her coworkers and conventionally perfect boyfriend from finding out about her pet. It also deals with the romantic attraction between Sumire and her pet.\nIt was serialised by Kodansha and was released in 14 volumes between 2000 and 2005, with an additional side-story volume being released in 2002. The volumes, barring the side-story volume, were published in English and German by Tokyopop, French by Kurokawa and Italian by Star Comics. The manga was adapted to a TV drama series that aired in Japan on TBS in 2003, and a South Korean film due out in 2011.", "rate": 80, "genre": ["Drama"], "cast": ["Koyuki", "Jun Matsumoto", "Satomi Ishihara", "Misa Uehara", "Eita"], "character": ["Sumire Iwaya", "Goda Takeshi", "Rumi Shibusawa", "Mayumi Kuraki", "Horibe Junpei"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8792   Expand You're My Pet   (2003) User Score Overview Tramps Like Us is a Japanese josei manga series by Yayoi Ogawa. It is about Sumire, a young professional woman who takes in a younger man as a pet, and her attempts to keep her coworkers and conventionally perfect boyfriend from finding out about her pet. It also deals with the romantic attraction between Sumire and her pet. It was serialised by Kodansha and was released in 14 volumes between 2000 and 2005, with an additional side-story volume being released in 2002. The volumes, barring the side-story volume, were published in English and German by Tokyopop, French by Kurokawa and Italian by Star Comics. The manga was adapted to a TV drama series that aired in Japan on TBS in 2003, and a South Korean film due out in 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Koyuki Sumire Iwaya Jun Matsumoto Goda Takeshi Satomi Ishihara Rumi Shibusawa Misa Uehara Mayumi Kuraki Eita Horibe Junpei Full Cast & Crew Last Season Kimi wa petto season 1 2003 | 10 Episodes Season 1 of You're My Pet premiered on April  9, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on You're My Pet. You can help by rating TV shows you've seen. Facts Original Name  きみはペット Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 22 Aka75 NS 4 Norte Serra TB 2 TMDb Bot R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}