{"link": "https://www.themoviedb.org/tv/1032?language=en", "title": "Aída", "resume": "Aída is a Spanish comedy sitcom set in Madrid, that spin off from another sitcom called 7 Vidas. The show first aired on January 16, 2005 and is produced by Globomedia for the Spanish network Telecinco. It currently started its ninth season.\nThe show stars Carmen Machi as the title character, Aída García, a working, single mother with two teenage children, forced to move in with her mother and brother to make ends meet.\nThe show has received favorable criticism from the audience and has been the most viewed show in Spain since 2007. It has also received several awards like the Ondas Award for Best Spanish Sitcom.\nThe Polish re-make of the series began airing in March 2012 on TVP2 channel.", "rate": 48, "genre": ["Drama", "Comedy"], "cast": ["Paco León", "Melani Olivares", "Pepe Viyuela", "Mariano Peña", "Miren Ibarguren"], "character": ["Luisma García", "Paz Bermejo", "Chema García", "Mauricio Colmenero", "Soraya García"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1032   Expand Aída   (2005) User Score Overview Aída is a Spanish comedy sitcom set in Madrid, that spin off from another sitcom called 7 Vidas. The show first aired on January 16, 2005 and is produced by Globomedia for the Spanish network Telecinco. It currently started its ninth season. The show stars Carmen Machi as the title character, Aída García, a working, single mother with two teenage children, forced to move in with her mother and brother to make ends meet. The show has received favorable criticism from the audience and has been the most viewed show in Spain since 2007. It has also received several awards like the Ondas Award for Best Spanish Sitcom. The Polish re-make of the series began airing in March 2012 on TVP2 channel. Featured Crew Ignacio García Velilla Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paco León Luisma García Melani Olivares Paz Bermejo Pepe Viyuela Chema García Mariano Peña Mauricio Colmenero Miren Ibarguren Soraya García Full Cast & Crew Last Season Season 10 2013 | 38 Episodes Season 10 of Aída premiered on September 15, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   1999-01-17 7 vidas 5.9    2008-01-09 Sin Tetas No Hay Paraíso 2.7    2001-09-13 Cuéntame cómo pasó 6.6    2008-02-04 Física o Química 3.0    2003-04-22 Los Serrano 5.1    2003-09-07 Aquí no hay quien viva 7.1    1985-10-26 David the Gnome 7.3    2005-09-18 Camera Café 6.5  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  55m Homepage   http://www.telecinco.es/aida/ Genres Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 60 prm96 O 14 Oscar a 13 aballester 12 Ovokx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}