{"link": "https://www.themoviedb.org/tv/8027?language=en", "title": "Swift and Shift Couriers", "resume": "Swift and Shift Couriers is an Australian comedy television series that first screened on SBS TV in October 2008. The series is produced, directed and written by Paul Fenech, who was also responsible for the comedy series Pizza. It is set around the staff who work at the 'Swift and Shift' Courier Company, in the central business district of Sydney. Episodes have been partly filmed in Egypt and Thailand.\nThe second season of \"Swift and Shift Couriers\" began screening on 15 August 2011 on SBS One.", "rate": 40, "genre": ["Comedy"], "cast": ["Melissa Tkautz", "Ian Turpie", "Angry Anderson", "Amanda Keller", "Kirsty Lee Allan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8027   Expand Swift and Shift Couriers   (2008) User Score Overview Swift and Shift Couriers is an Australian comedy television series that first screened on SBS TV in October 2008. The series is produced, directed and written by Paul Fenech, who was also responsible for the comedy series Pizza. It is set around the staff who work at the 'Swift and Shift' Courier Company, in the central business district of Sydney. Episodes have been partly filmed in Egypt and Thailand. The second season of \"Swift and Shift Couriers\" began screening on 15 August 2011 on SBS One. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melissa Tkautz Ian Turpie Angry Anderson Amanda Keller Kirsty Lee Allan Full Cast & Crew Last Season Season 2 2011 | 10 Episodes Season 2 of Swift and Shift Couriers premiered on August 15, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Swift and Shift Couriers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 5 Damien Haynes TB 2 TMDb Bot 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}