{"link": "https://www.themoviedb.org/tv/31559?language=en", "title": "Teen Mom", "resume": "In 16 and Pregnant, they were moms-to-be. Now, follow Farrah, Maci, Amber, and Catelynn as they face the challenges of motherhood. Each episode interweaves these stories revealing the wide variety of challenges young mothers can face: marriage, relationships, family support, adoption, finances, graduating high school, starting college, getting a job, and the daunting and exciting step of moving out to create their own families.", "rate": 52, "genre": ["Documentary", "Reality"], "cast": ["Maci Bookout", "Catelynn Lowell", "Amber Portwood", "Farrah Abraham"], "character": ["Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31559   Expand Teen Mom   (2009) User Score Overview In 16 and Pregnant, they were moms-to-be. Now, follow Farrah, Maci, Amber, and Catelynn as they face the challenges of motherhood. Each episode interweaves these stories revealing the wide variety of challenges young mothers can face: marriage, relationships, family support, adoption, finances, graduating high school, starting college, getting a job, and the daunting and exciting step of moving out to create their own families. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  9 Content Issues  3 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maci Bookout Herself Catelynn Lowell Herself Amber Portwood Herself Farrah Abraham Herself Full Cast & Crew Current Season Season 7 2017 | 21 Episodes Season 7 of Teen Mom premiered on November 27, 2017. View All Seasons Social Reviews  0 Discussions  12 Subject Status Replies Last Reply How many businesses is Farrah going to have? Open 7 by  Poetist j What will happen? Open 3 by  cflr Nova's daycare Open 0 by JennyDarling\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2011-01-11 Teen Mom 2 4.8    2000-07-05 Big Brother 4.4    1975-10-11 Saturday Night Live 6.5    2005-05-30 Hell's Kitchen 6.3    2000-05-31 Survivor 6.3    2009-07-19 Pawn Stars 6.5  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  42m Homepage   http://mtv.com/shows/teen-mom Genres Documentary Reality Keywords spin off teenage pregnancy Content Score 86 Almost there... Top Contributors 38 Banana 13 Elizabeth Jennings TB 8 TMDb Bot b 7 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}