{"link": "https://www.themoviedb.org/tv/34482?language=en", "title": "Children in Need", "resume": "BBC Children in Need is the BBC's UK charity. Since 1980 it has raised over £600 million to change the lives of disabled children and young people in the UK. One of the highlights is an annual telethon, held in November and televised on BBC One and BBC One HD from 7:30pm until 2am. \"Pudsey Bear\" is BBC Children in Need's mascot, whilst Terry Wogan is a long-standing host. BBC Children in Need is one of three high-profile British telethons, although the only charity belonging to the BBC, the other telethons being Red Nose Day and Sport Relief, both supporting the Comic Relief charity. The 2012 appeal took place on Friday 16 November.", "rate": 60, "genre": [], "cast": ["Chris Moyles", "Fearne Cotton", "Esther Rantzen", "Jill Dando", "Gaby Roslin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34482   Expand Children in Need   (1980) User Score  Play Trailer Overview BBC Children in Need is the BBC's UK charity. Since 1980 it has raised over £600 million to change the lives of disabled children and young people in the UK. One of the highlights is an annual telethon, held in November and televised on BBC One and BBC One HD from 7:30pm until 2am. \"Pudsey Bear\" is BBC Children in Need's mascot, whilst Terry Wogan is a long-standing host. BBC Children in Need is one of three high-profile British telethons, although the only charity belonging to the BBC, the other telethons being Red Nose Day and Sport Relief, both supporting the Comic Relief charity. The 2012 appeal took place on Friday 16 November. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Moyles Fearne Cotton Esther Rantzen Jill Dando Gaby Roslin Full Cast & Crew Last Season Season 1 1980 | 32 Episodes Season 1 of Children in Need premiered on November 21, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Children in Need. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  300m Homepage   http://www.bbc.co.uk/pudsey Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors Y 2 YRV M 1 MAthePA 1 tigru89 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}