{"link": "https://www.themoviedb.org/tv/6589?language=en", "title": "Kikoriki", "resume": "Kikoriki, known in Russia as Smeshariki, is a Russian animated television series consisting of 208 episodes of 6 minutes and 30 seconds each, aimed at children of 3 to 8 years. The first episode premiered in Russia on May 7, 2005. English-language distribution rights to the series were acquired by 4Kids Entertainment from worldwide distributor Fun Game Media, Munich and began airing as part of The CW4Kids block on The CW on September 27, 2008, under the name GoGoRiki. Fun Game Media is also producing a European version, which began airing on KI.KA on December 8, 2008.\nThe Smeshariki are stylized rounded animals. Each of the nine characters has a unique personality and a range of interests with no negative characters among them. Plots are built not on the battle of opposing forces but on the unexpected situations the animated characters stumble upon in their interactions deemed similar to the ones that children may encounter in their everyday lives. Many of the topics foreground the guidance that friendship and community provide to the individual making his or her way in the world. Complex themes and specific cultural references place this cartoon firmly within the Russian tradition of animation. Much attention was devoted to the humor in the series, some of which has attracted adults as well.", "rate": 58, "genre": ["Family", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6589   Expand Kikoriki   (2004) User Score Overview Kikoriki, known in Russia as Smeshariki, is a Russian animated television series consisting of 208 episodes of 6 minutes and 30 seconds each, aimed at children of 3 to 8 years. The first episode premiered in Russia on May 7, 2005. English-language distribution rights to the series were acquired by 4Kids Entertainment from worldwide distributor Fun Game Media, Munich and began airing as part of The CW4Kids block on The CW on September 27, 2008, under the name GoGoRiki. Fun Game Media is also producing a European version, which began airing on KI.KA on December 8, 2008. The Smeshariki are stylized rounded animals. Each of the nine characters has a unique personality and a range of interests with no negative characters among them. Plots are built not on the battle of opposing forces but on the unexpected situations the animated characters stumble upon in their interactions deemed similar to the ones that children may encounter in their everyday lives. Many of the topics foreground the guidance that friendship and community provide to the individual making his or her way in the world. Complex themes and specific cultural references place this cartoon firmly within the Russian tradition of animation. Much attention was devoted to the humor in the series, some of which has attracted adults as well. Featured Crew Anatoliy Prokhorov Creator Ilya Popov Creator Aleksandr Gerasimov Creator Denis Chernov Creator Salavat Shaykhinurov Creator Aleksei Lebedev Creator Vyacheslav Mayasov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2005 2005 | 24 Episodes Season 2005 of Kikoriki premiered on February 20, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Kikoriki. You can help by rating TV shows you've seen. Facts Original Name  Смешарики Status  Ended Networks Certification 0+ Meaning Can be watched by Any Age. Type  Scripted Original Language  Russian Runtime  6m Homepage   http://www.smeshariki.ru/ Genres Family Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 42 Elizabeth Jennings 20 Евгений G 13 G_Keeper 8 Idan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}