{"link": "https://www.themoviedb.org/tv/47265?language=en", "title": "P.S. Man", "resume": "After the famous author Xia He Jie crashed the movie premiere that supermodel Amanda attended, he was sentenced to 158 hours of community service at a kindergarten. And thus, it began the most hellish 158 hours of his life. There he met Ma Xiao Qian, a teacher who not only didn't fall for his charming personality like the rest of the female population, she made him suffer for every minute of his community service. What he didn't know was that Xiao Qian was a former neighbor who he had bullied relentlessly as a child. Now, she is bent on revenging for the miserable childhood that she endured under his tyrannical reign.", "rate": 40, "genre": ["Comedy", "Drama", "Romance"], "cast": ["Lan Cheng-lung", "Sonia Sui", "James Wen", "Bianca Bai"], "character": ["Xia He Jie", "Ma Xiao Qian", "Meng Cheng En", "Amanda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47265   Expand P.S. Man   (2010) User Score Overview After the famous author Xia He Jie crashed the movie premiere that supermodel Amanda attended, he was sentenced to 158 hours of community service at a kindergarten. And thus, it began the most hellish 158 hours of his life. There he met Ma Xiao Qian, a teacher who not only didn't fall for his charming personality like the rest of the female population, she made him suffer for every minute of his community service. What he didn't know was that Xiao Qian was a former neighbor who he had bullied relentlessly as a child. Now, she is bent on revenging for the miserable childhood that she endured under his tyrannical reign. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lan Cheng-lung Xia He Jie Sonia Sui Ma Xiao Qian James Wen Meng Cheng En Bianca Bai Amanda Full Cast & Crew Last Season Season 1 2010 | 21 Episodes Season 1 of P.S. Man premiered on February 28, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on P.S. Man. You can help by rating TV shows you've seen. Facts Original Name  偷心大聖 P.S. 男 Status  Ended Network Sanlih E-Television Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://blog.iset.com.tw/ps/ Genres Comedy Drama Romance Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 17 Wendy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}