{"link": "https://www.themoviedb.org/tv/61867?language=en", "title": "Medcezir", "resume": "Yaman, who lives in the suburb of Tozludere (Istanbul), is arrested and put in jail with his brother because his brother decided to steal a car at a petrol station. Until that day he tried to change his destiny by working hard to earn a good life. That evening he was unwillingly introduced to crime and his clean dossier was tainted. He meets a rich lawyer, Selim Serez.", "rate": 71, "genre": ["Comedy", "Drama"], "cast": ["Çağatay Ulusoy", "Serenay Sarıkaya", "Metin Akdulger", "Taner Ölmez", "Hazar Ergüçlü"], "character": ["Yaman Koper", "Mira Beylice", "Orkun Civanoglu", "Mert Serez", "Eylül Buluter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61867   Expand Medcezir   (2013) User Score  Play Trailer Overview Yaman, who lives in the suburb of Tozludere (Istanbul), is arrested and put in jail with his brother because his brother decided to steal a car at a petrol station. Until that day he tried to change his destiny by working hard to earn a good life. That evening he was unwillingly introduced to crime and his clean dossier was tainted. He meets a rich lawyer, Selim Serez. Featured Crew Ece Yörenç Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Çağatay Ulusoy Yaman Koper Serenay Sarıkaya Mira Beylice Metin Akdulger Orkun Civanoglu Taner Ölmez Mert Serez Hazar Ergüçlü Eylül Buluter Full Cast & Crew Last Season Season 2 2014 | 39 Episodes Season 2 of Medcezir premiered on September 12, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  14 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Medcezir. You can help by rating TV shows you've seen. Facts Status  In Production Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage   http://www.medcezir.tv/ Genres Comedy Drama Keywords rich woman poor man based on tv series love teen drama Content Score 100 Yes! Looking good! Top Contributors V 81 Vaine 45 Elizabeth Jennings 20 moviefars b 13 bluwy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}