{"link": "https://www.themoviedb.org/tv/68919?language=en", "title": "Continent 7: Antarctica", "resume": "Take a journey to Antarctica to experience the world’s most extreme wilderness, to see the massive undertaking it is to support human life there, and to chronicle the world-changing science being done. Embed with missions on the ice, underneath it, and atop some of its peaks, as scientists and survival experts join forces to fight brutal conditions to help change the world.", "rate": 65, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68919   Expand Continent 7: Antarctica   (2016) User Score  Play Trailer Overview Take a journey to Antarctica to experience the world’s most extreme wilderness, to see the massive undertaking it is to support human life there, and to chronicle the world-changing science being done. Embed with missions on the ice, underneath it, and atop some of its peaks, as scientists and survival experts join forces to fight brutal conditions to help change the world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 5 Episodes Season 1 of Continent 7: Antarctica premiered on November 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Continent 7: Antarctica. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  50m Homepage   http://channel.nationalgeographic.com/continent-7-antarctica/ Genres Documentary Keywords antarctica Content Score 64 We're so close, yet so far. Top Contributors 16 Elizabeth Jennings 5 rootraid 3 Banana - 2 -Alexander-  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}