{"link": "https://www.themoviedb.org/tv/10151?language=en", "title": "The Jack Benny Program", "resume": "The Jack Benny Program, starring Jack Benny, is a radio-TV comedy series that ran for more than three decades and is generally regarded as a high-water mark in 20th-century American comedy.", "rate": 88, "genre": ["Comedy"], "cast": ["Jack Benny"], "character": ["Jack Benny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10151   Expand The Jack Benny Program   (1950) User Score Overview The Jack Benny Program, starring Jack Benny, is a radio-TV comedy series that ran for more than three decades and is generally regarded as a high-water mark in 20th-century American comedy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Benny Jack Benny Full Cast & Crew Last Season Season 14 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply \"Jack on Trial for Murder\" episode is hilarious (**spoilers**) Open 0 by Moon_Doggie\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1968-09-24 The Mod Squad 6.3    1965-01-24 Branded 8.3    1974-09-07 Land of the Lost 6.9    1966-09-12 Family Affair 5.4    1963-09-24 Petticoat Junction 5.7    1963-09-29 My Favorite Martian 5.4    1957-09-14 Have Gun – Will Travel 8.3    1959-11-19 The Rocky and Bullwinkle Show 8.7  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sitcom variety show Content Score 56 We're so close, yet so far. Top Contributors 17 Banana TB 2 TMDb Bot s 2 s33k3r  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}