{"link": "https://www.themoviedb.org/tv/46434?language=en", "title": "The Vietnam War", "resume": "An immersive 360-degree narrative telling the epic story of the Vietnam War as it has never before been told on film. Featuring testimony from nearly 80 witnesses, including many Americans who fought in the war and others who opposed it, as well as Vietnamese combatants and civilians from both the winning and losing sides.", "rate": 81, "genre": ["Documentary"], "cast": ["Peter Coyote"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46434   Expand The Vietnam War   (2017) User Score  Play Trailer Overview An immersive 360-degree narrative telling the epic story of the Vietnam War as it has never before been told on film. Featuring testimony from nearly 80 witnesses, including many Americans who fought in the war and others who opposed it, as well as Vietnamese combatants and civilians from both the winning and losing sides. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  11 Posters  4 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Peter Coyote Himself - Narrator Full Cast & Crew Last Season Original Air Date Original Air Date French Version (TV) Season 1 2017 | 10 Episodes Season 1 of The Vietnam War premiered on September 16, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for The Vietnam War. Login to be first! Go to Discussions Media Most Popular Videos  3 Backdrops  11 Posters  4 Recommendations   2014-09-14 The Roosevelts: An Intimate History 8.6    2015-01-15 The Man in the High Castle 7.5  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  100m Homepage   http://www.pbs.org/show/vietnam-war/ Genres Documentary Keywords vietnam war miniseries Content Score 64 We're so close, yet so far. Top Contributors 48 Elizabeth Jennings 16 Banana TB 14 TMDb Bot L 4 Lemmy_6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}