{"link": "https://www.themoviedb.org/tv/65068?language=en", "title": "Shinigami-kun", "resume": "Shinigami-kun, alias grim reaper #413, is a rookie who pronounces the death of those scheduled to die and brings souls to the nether world. He would appear with the signature phrase “Congratulations! I’m here to call on you” although it is hard to say how this can be a happy occasion, and watch over the dying. To a grim reaper, persuading people attempting to commit suicide and preventing unforeseen deaths is also an important task. But because #413 is new to this grim reaper work, he has a tendency to lean towards humans in his judgments, break the rules of the nether world and get reprimanded by his superior.", "rate": 0, "genre": ["Drama", "Fantasy"], "cast": ["Satoshi Ohno", "Masaki Suda", "Mirei Kiritani", "Yutaka Matsushige"], "character": ["Shinigami-kun", "Akuma (devil)", "Shinigami-kun's surveillant", "Shinigami-kun's boss"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65068   Expand Shinigami-kun   (2014) User Score Overview Shinigami-kun, alias grim reaper #413, is a rookie who pronounces the death of those scheduled to die and brings souls to the nether world. He would appear with the signature phrase “Congratulations! I’m here to call on you” although it is hard to say how this can be a happy occasion, and watch over the dying. To a grim reaper, persuading people attempting to commit suicide and preventing unforeseen deaths is also an important task. But because #413 is new to this grim reaper work, he has a tendency to lean towards humans in his judgments, break the rules of the nether world and get reprimanded by his superior. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Satoshi Ohno Shinigami-kun Masaki Suda Akuma (devil) Mirei Kiritani Shinigami-kun's surveillant Yutaka Matsushige Shinigami-kun's boss Full Cast & Crew Last Season Season 1 2014 | 9 Episodes Season 1 of Shinigami-kun premiered on April 18, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shinigami-kun. You can help by rating TV shows you've seen. Facts Original Name  死神くん Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Drama Fantasy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 23 saltofstones s 5 speedycars 4 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}