{"link": "https://www.themoviedb.org/tv/68443?language=en", "title": "The Half Brother", "resume": "Revolving around the life of un-produced screenwriter Barnum Nilsen, The Half Brother is a dramatic family saga that offers an historical parable of 20th century Europe. On V Day, May 1945, as a continent emerges from war, Barnum’s mother Vera is raped in her attic in Oslo by an unknown man, leading to the birth of Barnum’s half brother, Fred. When Barnum is born five years later, to the man that Vera has since met and married, the Nilsen family, like Europe, is already splitting in two. Growing up together during the Cold War – Barnum with his father, Fred searching for his – the half brothers become estranged and Fred eventually disappears. At the film festival in Berlin in 1990, as the Wall is still coming down, Barnum learns that Fred has returned. Finally, as the true identity of Fred’s father comes to light, the two half brothers may once again be reunited.", "rate": 70, "genre": ["Drama"], "cast": ["Nicolai Cleve Broch", "Frank Kjosås", "Mariann Hole", "Marianne Nielsen", "Oskar Sandven Lundevold"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68443   Expand The Half Brother   (2013) User Score Overview Revolving around the life of un-produced screenwriter Barnum Nilsen, The Half Brother is a dramatic family saga that offers an historical parable of 20th century Europe. On V Day, May 1945, as a continent emerges from war, Barnum’s mother Vera is raped in her attic in Oslo by an unknown man, leading to the birth of Barnum’s half brother, Fred. When Barnum is born five years later, to the man that Vera has since met and married, the Nilsen family, like Europe, is already splitting in two. Growing up together during the Cold War – Barnum with his father, Fred searching for his – the half brothers become estranged and Fred eventually disappears. At the film festival in Berlin in 1990, as the Wall is still coming down, Barnum learns that Fred has returned. Finally, as the true identity of Fred’s father comes to light, the two half brothers may once again be reunited. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicolai Cleve Broch Frank Kjosås Mariann Hole Marianne Nielsen Oskar Sandven Lundevold Full Cast & Crew Last Season Season 1 2013 | 8 Episodes Season 1 of The Half Brother premiered on January  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Half Brother. You can help by rating TV shows you've seen. Facts Original Name  Halvbroren Status  Ended Network Certification  - Type  Miniseries Original Language  Norwegian Runtime  45m Homepage   https://tv.nrk.no/serie/halvbroren Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 29 TMDb Bot 27 Bendik 3 Banana 1 horse315  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}