{"link": "https://www.themoviedb.org/tv/77389?language=en", "title": "Dangerous Liaisons", "resume": "Updated adaptation of Choderlos de Laclos' classic 18th Century tale of seduction, betrayal and revenge set in the modern 1960s world of Parisian high society. The beautiful Madame de Merteuil seeks vengeance against her ex-lover Gercourt when he becomes engaged to her young goddaughter, Cécile.", "rate": 65, "genre": [], "cast": ["Catherine Deneuve", "Rupert Everett", "Nastassja Kinski", "Danielle Darrieux", "Leelee Sobieski"], "character": ["Marquise Isabelle de Merteuil", "Vicomte Sébastien de Valmont", "Madame Maria de Tourvel", "Madame de Rosemonde", "Cécile de Volanges"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77389   Expand Dangerous Liaisons   (2003) User Score Overview Updated adaptation of Choderlos de Laclos' classic 18th Century tale of seduction, betrayal and revenge set in the modern 1960s world of Parisian high society. The beautiful Madame de Merteuil seeks vengeance against her ex-lover Gercourt when he becomes engaged to her young goddaughter, Cécile. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Catherine Deneuve Marquise Isabelle de Merteuil Rupert Everett Vicomte Sébastien de Valmont Nastassja Kinski Madame Maria de Tourvel Danielle Darrieux Madame de Rosemonde Leelee Sobieski Cécile de Volanges Full Cast & Crew Last Season Miniseries 2003 | 3 Episodes Season 1 of Dangerous Liaisons premiered on January  4, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dangerous Liaisons. You can help by rating TV shows you've seen. Facts Original Name  Les Liaisons dangereuses Status  Ended Network Certification  - Type  Miniseries Original Language  French Runtime  90m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 15 Banana TB 13 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}