{"link": "https://www.themoviedb.org/tv/67752?language=en", "title": "Channel Zero", "resume": "A horror anthology series inspired by “Creepypasta” online tales.", "rate": 67, "genre": ["Drama"], "cast": ["Amy Forsyth", "Olivia Luccardi", "Holland Roden", "Rutger Hauer", "Brandon Scott"], "character": ["Margot Sleator", "Alice Woods", "Zoe Woods", "Joseph Peach", "Luke Vanczyk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67752   Expand Channel Zero   (2016) User Score  Play Trailer Overview A horror anthology series inspired by “Creepypasta” online tales. Featured Crew Nick Antosca Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amy Forsyth Margot Sleator Olivia Luccardi Alice Woods Holland Roden Zoe Woods Rutger Hauer Joseph Peach Brandon Scott Luke Vanczyk Full Cast & Crew Current Season Butcher's Block 2018 | 6 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply Season 3 is to much... Open 0 by coasttech\n      \n     y Mike Painter (Spoiler ) Open 1 by  furious_iz The finale Open 0 by Melanie\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  7 Posters  3 Recommendations   2016-09-27 Aftermath 6.1    2016-09-23 The Exorcist 7.2    2016-06-03 Outcast 7.0    2016-03-07 Damien 6.5    1957-09-18 Wagon Train 6.3    1965-01-24 Branded 8.3    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1972-09-08 Are You Being Served? 7.0  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.syfy.com/channelzerobutchersblock Genres Drama Keywords monster loss of loved one supernatural television horror anthology Content Score 100 Yes! Looking good! Top Contributors 74 Elizabeth Jennings L 19 Law m 14 misfit_noel 10 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}