{"link": "https://www.themoviedb.org/tv/34678?language=en", "title": "Basquash!", "resume": "Basquash! is a sports and sci-fi anime which aired on Mainichi Broadcasting System. It involves characters playing basketball while riding mecha. The series premise was created by Thomas Romain and Shoji Kawamori, with the animation produced by Satelight. Shoji Kawamori is handling the project direction, while the series direction will be done by Shin Itagaki. On July 10, 2009 it was reported that director Shin Itagaki was to be replaced by another, as yet, unnamed director starting from the eleventh episode. The series will be adapted as a remake but targeted for kids and sport fans.", "rate": 0, "genre": ["Animation"], "cast": ["Kana Hanazawa", "Masumi Asano", "Hiro Shimono", "Haruka Tomatsu"], "character": ["Rouge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34678   Expand Basquash!   (2009) User Score Overview Basquash! is a sports and sci-fi anime which aired on Mainichi Broadcasting System. It involves characters playing basketball while riding mecha. The series premise was created by Thomas Romain and Shoji Kawamori, with the animation produced by Satelight. Shoji Kawamori is handling the project direction, while the series direction will be done by Shin Itagaki. On July 10, 2009 it was reported that director Shin Itagaki was to be replaced by another, as yet, unnamed director starting from the eleventh episode. The series will be adapted as a remake but targeted for kids and sport fans. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Masumi Asano Hiro Shimono Haruka Tomatsu Rouge Full Cast & Crew Last Season Season 1 2009 | 26 Episodes Season 1 of Basquash! premiered on April  2, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Basquash!. You can help by rating TV shows you've seen. Facts Original Name  バスカッシュ！ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 6 Skeyhn z 4 zurman1 M 4 Migi 3 enams90  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}