{"link": "https://www.themoviedb.org/tv/1006?language=en", "title": "Man About the House", "resume": "Man about the house is a British sitcom starring John Carlin, Norman Eshley, Doug Fisher, Yootha Joyce, Roy Kinnear, Brian Murphy, Richard O'Sullivan, Sally Thomsett, and Paula Wilcox that was broadcast for six series on ITV from 15 August 1973 to 7 April 1976. It was created and written by Brian Cooke and Johnnie Mortimer. The series was considered daring at the time due to its subject matter of a man sharing a flat with two single women. It was made by Thames Television and recorded at their Teddington studios.\nTwo spin-off series were later made: George and Mildred and Robin's nest. In 2004, it came 69th in a poll to find Britain's best sitcom. The series was remade in the United States as Three's company in 1977. A film version was released in 1974.", "rate": 82, "genre": ["Comedy"], "cast": ["Yootha Joyce", "Richard O'Sullivan", "Sally Thomsett", "Brian Murphy", "Paula Wilcox"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1006   Expand Man About the House   (1973) User Score Overview Man about the house is a British sitcom starring John Carlin, Norman Eshley, Doug Fisher, Yootha Joyce, Roy Kinnear, Brian Murphy, Richard O'Sullivan, Sally Thomsett, and Paula Wilcox that was broadcast for six series on ITV from 15 August 1973 to 7 April 1976. It was created and written by Brian Cooke and Johnnie Mortimer. The series was considered daring at the time due to its subject matter of a man sharing a flat with two single women. It was made by Thames Television and recorded at their Teddington studios. Two spin-off series were later made: George and Mildred and Robin's nest. In 2004, it came 69th in a poll to find Britain's best sitcom. The series was remade in the United States as Three's company in 1977. A film version was released in 1974. Featured Crew Brian Cooke Creator Johnnie Mortimer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yootha Joyce Richard O'Sullivan Sally Thomsett Brian Murphy Paula Wilcox Full Cast & Crew Last Season Season 6 1976 | 7 Episodes Season 6 of Man About the House premiered on February 25, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1979-10-29 Minder 8.6    1962-01-04 Steptoe and Son 8.2    1978-09-14 Mork & Mindy 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords chef sitcom british humour flatmates Content Score 93 Almost there... Top Contributors O 8 Ozbourne 4 kcdh i 3 ismax935 t 1 tmdb59661364  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}