{"link": "https://www.themoviedb.org/tv/5904?language=en", "title": "Guest from the Future", "resume": "Alice Seleznyova, a girl from the future, finds herself 1984. Following her are the space pirates Krys and Joker Y, with most nasty pirate's intentions. Coming to her help is an ordinary boy, Kolya, and his friends from 6th grade. Based on Kir Bulychyov's 1077 novel \"One Hundred Years Ahead.\"", "rate": 83, "genre": ["Action", "Adventure", "Drama", "Kids", "Sci-Fi", "Fantasy"], "cast": ["Natalya Guseva", "Aleksei Fomkin", "Maryana Ionesyan", "Ilya Naumov"], "character": ["Alisa Seleznyova", "Kolya Gerasimov", "Yulya Gribkova", "Fima Korolyov"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5904   Expand Guest from the Future   (1985) User Score Overview Alice Seleznyova, a girl from the future, finds herself 1984. Following her are the space pirates Krys and Joker Y, with most nasty pirate's intentions. Coming to her help is an ordinary boy, Kolya, and his friends from 6th grade. Based on Kir Bulychyov's 1077 novel \"One Hundred Years Ahead.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natalya Guseva Alisa Seleznyova Aleksei Fomkin Kolya Gerasimov Maryana Ionesyan Yulya Gribkova Ilya Naumov Fima Korolyov Full Cast & Crew Last Season Season 1 1985 | 5 Episodes Season 1 of Guest from the Future premiered on March 25, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Guest from the Future. You can help by rating TV shows you've seen. Facts Original Name  Гостья из будущего Status  Ended Network Certification 6+ Meaning Only kids the age of 6 or older can watch. Type  Miniseries Original Language  Russian Runtime  64m Homepage   http://mielofon.ru/ Genres Action & Adventure Drama Kids Sci-Fi & Fantasy Keywords time travel space pirate Content Score 86 Almost there... Top Contributors 63 Elizabeth Jennings CM 9 Cherche Moi TB 4 TMDb Bot 2 sHa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}