{"link": "https://www.themoviedb.org/tv/65681?language=en", "title": "Apocalypse - Verdun", "resume": "A gripping and shocking documentary composed of numerous colorized archive footage. Apocalypse: Verdun takes us to the infamous and bloody battle of Verdun that occurred in February 1916, when World War I had been raging for two years.", "rate": 75, "genre": ["Documentary", "War", "Politics"], "cast": ["Mathieu Kassovitz"], "character": ["Narrateur"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65681   Expand Apocalypse - Verdun   (2016) User Score Overview A gripping and shocking documentary composed of numerous colorized archive footage. Apocalypse: Verdun takes us to the infamous and bloody battle of Verdun that occurred in February 1916, when World War I had been raging for two years. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mathieu Kassovitz Narrateur Full Cast & Crew Last Season Season 1 2016 | 2 Episodes Season 1 of Apocalypse - Verdun premiered on February 21, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Apocalypse - Verdun. You can help by rating TV shows you've seen. Facts Original Name  Apocalypse Verdun Status  Ended Network Certification  - Type  Miniseries Original Language  French Runtime  90m Homepage  - Genres Documentary War & Politics Keywords world war i verdun Content Score 64 We're so close, yet so far. Top Contributors M 13 Manu TB 10 TMDb Bot T 7 TheWhisler c 7 cedricbr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}