{"link": "https://www.themoviedb.org/tv/69632?language=en", "title": "Superior Donuts", "resume": "The relationship between Arthur, the gruff owner of a small donut shop, his enterprising new young employee, Franco, and their loyal patrons in a quickly gentrifying Chicago neighborhood.", "rate": 66, "genre": ["Comedy"], "cast": ["Judd Hirsch", "Jermaine Fowler", "Katey Sagal", "David Koechner", "Maziyar Jobrani"], "character": ["Arthur Przybyszewski", "Franco Wicks", "Randy DeLuca", "Carl “Tush” Tushinski", "Fawz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69632   Expand Superior Donuts   (2017) User Score  Play Trailer Overview The relationship between Arthur, the gruff owner of a small donut shop, his enterprising new young employee, Franco, and their loyal patrons in a quickly gentrifying Chicago neighborhood. Featured Crew Neil Goldman Creator Garrett Donovan Creator Bob Daily Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Judd Hirsch Arthur Przybyszewski Jermaine Fowler Franco Wicks Katey Sagal Randy DeLuca David Koechner Carl “Tush” Tushinski Maziyar Jobrani Fawz Full Cast & Crew Current Season Season 2 2017 | 21 Episodes Season 2 of Superior Donuts premiered on October 30, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply m What's with the ice episode Open 0 by madmehr\n      \n     MY Judd Hirsch Open 2 by  Bananaghost Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2016-10-19 HIM 6.2    2016-09-21 Speechless 7.5    2017-05-17 Downward Dog 6.7    2017-11-05 SMILF 6.7    2017-02-19 Crashing 7.7    2016-10-24 Man with a Plan 5.1    2015-02-19 The Odd Couple 5.4    2009-03-03 The Listener 5.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  21m Homepage   http://www.cbs.com/shows/superior-donuts/ Genres Comedy Keywords chicago restaurant based on play or musical sitcom workplace comedy donut shop Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings 25 Banana t 12 thermo6 P 10 PC  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}