{"link": "https://www.themoviedb.org/tv/44303?language=en", "title": "Magical Taluluto", "resume": "Fifth grader Edojou Honmaru is one of the most trodden-upon losers in his class, until he meets Magical Taruruuto-kun. Taruruuto's powers help him deal with all his hardships, such as girls, bullies, and numerous other challenges.", "rate": 100, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Minami Takayama", "Tarako", "Yumi Touma", "Hiromi Tsuru", "Ryou Horikawa"], "character": ["Honmaru Edojô (voice)", "Tarurûto (voice)", "Iyona Kawai (voice)", "Mari Ôaya (voice)", "Tsuyoshi Harako (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44303   Expand Magical Taluluto   (1990) User Score Overview Fifth grader Edojou Honmaru is one of the most trodden-upon losers in his class, until he meets Magical Taruruuto-kun. Taruruuto's powers help him deal with all his hardships, such as girls, bullies, and numerous other challenges. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Minami Takayama Honmaru Edojô (voice) Tarako Tarurûto (voice) Yumi Touma Iyona Kawai (voice) Hiromi Tsuru Mari Ôaya (voice) Ryou Horikawa Tsuyoshi Harako (voice) Full Cast & Crew Last Season Season 1 1990 | 87 Episodes Season 1 of Magical Taluluto premiered on September  2, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Magical Taluluto. You can help by rating TV shows you've seen. Facts Original Name  まじかる☆タルるートくん Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 50m Homepage  - Genres Animation Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 36 Ritz TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}