{"link": "https://www.themoviedb.org/tv/6733?language=en", "title": "Taboo", "resume": "Taboo is a documentary television series that premiered in 2002 on the National Geographic Channel. The program is an educational look into \"taboo\" rituals and traditions practiced in some societies, yet forbidden and illegal in others.\nEach hour long episode details a specific topic, such as marriage or initiation rituals, and explores how such topics are viewed throughout the world. Taboo generally focuses on the most misunderstood, despised, or disagreed-upon activities, jobs, and roles.", "rate": 100, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6733   Expand Taboo User Score Overview Taboo is a documentary television series that premiered in 2002 on the National Geographic Channel. The program is an educational look into \"taboo\" rituals and traditions practiced in some societies, yet forbidden and illegal in others. Each hour long episode details a specific topic, such as marriage or initiation rituals, and explores how such topics are viewed throughout the world. Taboo generally focuses on the most misunderstood, despised, or disagreed-upon activities, jobs, and roles. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://channel.nationalgeographic.com/series/taboo Genres Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}