{"link": "https://www.themoviedb.org/tv/20532?language=en", "title": "Play of the Month", "resume": "Play of the Month is a BBC television anthology series featuring productions of classic and contemporary stage plays which were usually broadcast on BBC1. Each production featured a different work, often using prominent British stage actors in the leading roles. The series was transmitted from October 1965 to September 1983; the producer most associated with the Play of the Month was Cedric Messina.\nSome of the 121 episodes are missing from the archives, having been junked in the 1960s and 1970s. Unless stated otherwise, the indication that the play is \"lost\" is taken from the lostshows.com website page as of 25 May 2013.", "rate": 0, "genre": ["Drama"], "cast": ["Robert Powell", "Robert Powell", "Jeremy Brett"], "character": ["Frank Gardner", "Valentine", "Basil Hallward"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20532   Expand Play of the Month   (1965) User Score Overview Play of the Month is a BBC television anthology series featuring productions of classic and contemporary stage plays which were usually broadcast on BBC1. Each production featured a different work, often using prominent British stage actors in the leading roles. The series was transmitted from October 1965 to September 1983; the producer most associated with the Play of the Month was Cedric Messina. Some of the 121 episodes are missing from the archives, having been junked in the 1960s and 1970s. Unless stated otherwise, the indication that the play is \"lost\" is taken from the lostshows.com website page as of 25 May 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Powell Frank Gardner Robert Powell Valentine Jeremy Brett Basil Hallward Full Cast & Crew Last Season Season 16 1983 | 3 Episodes Season 16 of Play of the Month premiered on May 22, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Play of the Month. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m, 60m Homepage  - Genres Drama Keywords anthology play adaptation Content Score 43 There's no 'I' in team... Top Contributors t 20 tmdb15589237 4 lineker 4 Banana 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}