{"link": "https://www.themoviedb.org/tv/48623?language=en", "title": "Hakkenden: Eight Dogs of the East", "resume": "Hakkenden: Eight Dogs of the East is a Japanese manga series by Miyuki Abe based on the epic novel series Nansō Satomi Hakkenden. An anime adaptation of the manga, produced by Studio Deen, premiered on January 5, 2013. A second season has been announced to premiere summer 2013.", "rate": 50, "genre": ["Animation", "Action", "Adventure"], "cast": ["Tetsuya Kakihara", "Nobuhiko Okamoto", "Satoshi Hino", "Ayahi Takagaki", "Tomoaki Maeno"], "character": ["Shino Inuzuka", "Murasame", "Sosuke Inukawa", "Hamaji", "Genpachi Inukai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 48623   Expand Hakkenden: Eight Dogs of the East   (2013) User Score Overview Hakkenden: Eight Dogs of the East is a Japanese manga series by Miyuki Abe based on the epic novel series Nansō Satomi Hakkenden. An anime adaptation of the manga, produced by Studio Deen, premiered on January 5, 2013. A second season has been announced to premiere summer 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tetsuya Kakihara Shino Inuzuka Nobuhiko Okamoto Murasame Satoshi Hino Sosuke Inukawa Ayahi Takagaki Hamaji Tomoaki Maeno Genpachi Inukai Full Cast & Crew Last Season Season 2 2013 | 13 Episodes Season 2 of Hakkenden: Eight Dogs of the East premiered on July  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hakkenden: Eight Dogs of the East. You can help by rating TV shows you've seen. Facts Original Name  八犬伝 ―東方八犬異聞― Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://hakken-den.com/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 8 Elizabeth Jennings 3 seboseboss 3 HauReNx 3 yoshizuka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}