{"link": "https://www.themoviedb.org/tv/74948?language=en", "title": "Last Minute Romance", "resume": "Baek-Se (Han Seung-Yeon) lives an ordinary life. She is a big fan of a top star. One day, Baek-Se is diagnosed with a terminal disease and she doesn't have much time left to live. She decides to have a contract date with Dong-Joon (Lee Seo-Won) who looks just like the top star she likes.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Han Seung-yeon", "Lee Seo-won"], "character": ["Baek Se", "Yoon Dong Joon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74948   Expand Last Minute Romance   (2017) User Score Overview Baek-Se (Han Seung-Yeon) lives an ordinary life. She is a big fan of a top star. One day, Baek-Se is diagnosed with a terminal disease and she doesn't have much time left to live. She decides to have a contract date with Dong-Joon (Lee Seo-Won) who looks just like the top star she likes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Seung-yeon Baek Se Lee Seo-won Yoon Dong Joon Full Cast & Crew Current Season Season 1 2017 | 10 Episodes Season 1 of Last Minute Romance premiered on October 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Last Minute Romance. You can help by rating TV shows you've seen. Facts Original Name  막판 로맨스 Status  Ended Networks Certification  - Type  Scripted Original Language  Korean Runtime  15m Homepage   http://tv.naver.com/jtbc.termsofromance Genres Comedy Drama Keywords romance web series Content Score 56 We're so close, yet so far. Top Contributors n 23 nubie 14 sansalayne TB 4 TMDb Bot 1 kangtahu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}