{"link": "https://www.themoviedb.org/tv/78337?language=en", "title": "Show Me The Movie!", "resume": "Hosted by Australia’s triple TV Week Gold Logie award-winning presenter and movie tragic, Rove McManus, Show Me The Movie! features two competing teams captained by acclaimed actor Jane Harber and comedy star Joel Creasey. Each week, Rove, Jane and Joel will be joined by a stellar cast of different actors, comedians and visiting international stars, who will do battle in a series of funny, irreverent and always entertaining rounds. From big-budget Hollywood blockbusters to sci-fi, animation and chick flicks, Show Me The Movie! will celebrate the good, the bad and the ugly of the big screen. The stars, A-list gossip, iconic movie dialogue and classic cinematic moments all get a comedy make-over.", "rate": 0, "genre": ["Talk"], "cast": ["Rove McManus", "Joel Creasey", "Jane Harber"], "character": ["Host", "Regular", "Regular"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78337   Expand Show Me The Movie!   (2018) User Score Overview Hosted by Australia’s triple TV Week Gold Logie award-winning presenter and movie tragic, Rove McManus, Show Me The Movie! features two competing teams captained by acclaimed actor Jane Harber and comedy star Joel Creasey. Each week, Rove, Jane and Joel will be joined by a stellar cast of different actors, comedians and visiting international stars, who will do battle in a series of funny, irreverent and always entertaining rounds. From big-budget Hollywood blockbusters to sci-fi, animation and chick flicks, Show Me The Movie! will celebrate the good, the bad and the ugly of the big screen. The stars, A-list gossip, iconic movie dialogue and classic cinematic moments all get a comedy make-over. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rove McManus Host Joel Creasey Regular Jane Harber Regular Full Cast & Crew Current Season Season 1 2018 | 2 Episodes Season 1 of Show Me The Movie! premiered on March 22, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Show Me The Movie!. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Talk Show Original Language  English Runtime  60m Homepage  - Genres Talk Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 18 zdlr 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}