{"link": "https://www.themoviedb.org/tv/21918?language=en", "title": "Searching for the Full Moon", "resume": "Twelve-year-old Kouyama Mitsuki was devastated when she was diagnosed with a malignant tumor of the throat. She had made a promise to the boy she loves that she would one day become a singer, but her illness made singing impossible. To make matters even worse, two angels of death, Takuto and Meroko, appeared to Mitsuki and informed her that she only had one year left to live. This news provides an even greater motivation for Mitsuki to fulfill her dreams, and with a little bit of divine intervention, she begins her quest to become a professional singer so she can be reunited with Eichi before time runs out.", "rate": 70, "genre": ["Animation", "Drama"], "cast": ["Yakkun Sakurazuka", "Myco", "Chieko Honda", "Megumi Ogata"], "character": ["Takuto Kira (voice)", "Mitsuki Kouyama (voice)", "Meroko Yui (voice)", "Izumi Rio (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21918   Expand Searching for the Full Moon   (2002) User Score Overview Twelve-year-old Kouyama Mitsuki was devastated when she was diagnosed with a malignant tumor of the throat. She had made a promise to the boy she loves that she would one day become a singer, but her illness made singing impossible. To make matters even worse, two angels of death, Takuto and Meroko, appeared to Mitsuki and informed her that she only had one year left to live. This news provides an even greater motivation for Mitsuki to fulfill her dreams, and with a little bit of divine intervention, she begins her quest to become a professional singer so she can be reunited with Eichi before time runs out. Featured Crew Toshiyuki Kato Creator Arina Tanemura Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yakkun Sakurazuka Takuto Kira (voice) Myco Mitsuki Kouyama (voice) Chieko Honda Meroko Yui (voice) Megumi Ogata Izumi Rio (voice) Full Cast & Crew Last Season Season 1 2002 | 52 Episodes Season 1 of Searching for the Full Moon premiered on April  6, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Searching for the Full Moon. You can help by rating TV shows you've seen. Facts Original Name  満月をさがして Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.nasinc.co.jp/jp/index.php?action=USER.WORKS.DETAIL&master_id=33 Genres Animation Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 8 Mikedeth5 8 deanzel B 5 BrennanBones t 3 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}