{"link": "https://www.themoviedb.org/tv/6750?language=en", "title": "Grand Star", "resume": "Grand Star, called La Compagnie des Glaces in France is a Canadian French Belgian Co-production science fiction television series playing on Space and A-Channel as of September 2007.\nSet in an apocalyptic future 100 years after a cataclysmic nuclear explosion on the Moon sends the Earth into a new Ice Age, the show revolves around the interactions between a small community of Earth survivors and the returning descendants of colonists who escaped Earth in advance of the disaster. The series is adapted from a series of novels called La Compagnie des glaces by Georges-Jean Arnaud.\nA multiplayer strategy game based on the universe of the TV series was launched in 2007. In the game, players face each other and use their trains to gather money for the control of energy sources.\nA French video game named Transarctica was also based on the novel series and haphazardly translated into English.\nThe first novel in the series was translated in 2010 under the title The Ice Company by Jean-Marc Lofficier & Randy Lofficier ISBN 978-1-935558-31-6", "rate": 0, "genre": [], "cast": ["Tyler Johnston", "Tammy Hui", "Kyle Labine", "Susan Gilmore", "Patrick Albenque"], "character": ["Cal Ragg", "Suki", "Kurt Masters", "Tara Masters", "Zel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6750   Expand Grand Star   (2007) User Score Overview Grand Star, called La Compagnie des Glaces in France is a Canadian French Belgian Co-production science fiction television series playing on Space and A-Channel as of September 2007. Set in an apocalyptic future 100 years after a cataclysmic nuclear explosion on the Moon sends the Earth into a new Ice Age, the show revolves around the interactions between a small community of Earth survivors and the returning descendants of colonists who escaped Earth in advance of the disaster. The series is adapted from a series of novels called La Compagnie des glaces by Georges-Jean Arnaud. A multiplayer strategy game based on the universe of the TV series was launched in 2007. In the game, players face each other and use their trains to gather money for the control of energy sources. A French video game named Transarctica was also based on the novel series and haphazardly translated into English. The first novel in the series was translated in 2010 under the title The Ice Company by Jean-Marc Lofficier & Randy Lofficier ISBN 978-1-935558-31-6 Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tyler Johnston Cal Ragg Tammy Hui Suki Kyle Labine Kurt Masters Susan Gilmore Tara Masters Patrick Albenque Zel Full Cast & Crew Last Season Season 1 2007 | 26 Episodes Season 1 of Grand Star premiered on September 22, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Grand Star. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.grandstar.tv/ Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors TS 7 Tony S. s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}