{"link": "https://www.themoviedb.org/tv/66715?language=en", "title": "Baek Hee Has Returned", "resume": "Yang Baek-Hee (Gang Ye-Won) returns to the quiet island Sumwol for the first time in 18 years. She has changed her identity.", "rate": 83, "genre": ["Comedy", "Drama"], "cast": ["Kang Ye-won", "Jin Ji-hee", "Kim Seong-oh", "Choi Phillip", "In Gyo-jin"], "character": ["Yang Baek-hee (Becky) / Yang So-hee", "Shin Ok-hee", "Woo Beom-ryong", "Shin Ki-joon", "Hong Doo-sik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66715   Expand Baek Hee Has Returned   (2016) User Score Overview Yang Baek-Hee (Gang Ye-Won) returns to the quiet island Sumwol for the first time in 18 years. She has changed her identity. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kang Ye-won Yang Baek-hee (Becky) / Yang So-hee Jin Ji-hee Shin Ok-hee Kim Seong-oh Woo Beom-ryong Choi Phillip Shin Ki-joon In Gyo-jin Hong Doo-sik Full Cast & Crew Last Season Season 1 2016 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Baek Hee Has Returned. You can help by rating TV shows you've seen. Facts Original Name  백희가 돌아왔다 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/becky/ Genres Comedy Drama Keywords korea Content Score 86 Almost there... Top Contributors M 29 Maria180493 g 17 ganooltv 6 bblsjy 3 SeRuJi0  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}