{"link": "https://www.themoviedb.org/tv/2973?language=en", "title": "Life on Mars", "resume": "A detective chief inspector from 2006 is investigating a serial killer when he is knocked over by a speeding car. Waking up, he finds himself mysteriously transported back in time to 1973. Initially struggling to come to terms with his situation, he has to come to terms with the old-fashioned technology and attitude of the day, while figuring out how he came to be trapped in the past.", "rate": 80, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["John Simm", "Philip Glenister", "Liz White", "Dean Andrews", "Marshall Lancaster"], "character": ["Sam Tyler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2973   Expand Life on Mars   (2006) User Score  Play Trailer Overview A detective chief inspector from 2006 is investigating a serial killer when he is knocked over by a speeding car. Waking up, he finds himself mysteriously transported back in time to 1973. Initially struggling to come to terms with his situation, he has to come to terms with the old-fashioned technology and attitude of the day, while figuring out how he came to be trapped in the past. Featured Crew Ashley Pharoah Creator Matthew Graham Creator Tony Jordan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  18 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Simm Sam Tyler Philip Glenister Liz White Dean Andrews Marshall Lancaster Full Cast & Crew Last Season Season 2 2007 | 8 Episodes View All Seasons Social Reviews  1 Discussions  0 A review by VanVliet  9.0 Written by  VanVliet  on November  9, 2017 It's rare that you get anything that's original but here's a great example. In times where we are subjected to rebooted series that were popular when most of the advertisers important demographic weren't even born here we have a series that you'll have never seen anything like it before. I know people who read this will never experienced that but with this in mind here's a classic. Being original isn't, of course, going to make it a success so the scripts are top class and the characters allow the superb actors to create something very special. Read All Reviews Media Most Popular Videos  1 Backdrops  18 Posters  14 Recommendations   2008-02-07 Ashes to Ashes 7.9    2008-10-09 Life on Mars 6.4    1985-11-04 Edge of Darkness 8.4    2007-06-16 Jekyll 8.1    2000-09-04 Waking the Dead 7.9    2002-10-27 Foyle's War 8.1    1997-05-09 Jonathan Creek 7.7    2000-04-26 Rebus 4.9  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Mystery Sci-Fi & Fantasy Keywords northern england 1970s time travel police detective police precinct life on mars Content Score 100 Yes! Looking good! Top Contributors R 10 Rebecca O 7 Ozbourne s 7 speedycars W 5 WJS  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}