{"link": "https://www.themoviedb.org/tv/57758?language=en", "title": "Brother vs. Brother", "resume": "Team Jonathan vs. Team Drew. The Brothers get two teams built of various skills (contractors, designers, realtors) & have a series of competitions, each week sending home a competitor. The final man (or woman) standing takes the title of Brother vs. Brother.", "rate": 67, "genre": ["Reality"], "cast": ["Jonathan Silver Scott", "Drew Scott"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57758   Expand Brother vs. Brother   (2013) User Score  Play Trailer Overview Team Jonathan vs. Team Drew. The Brothers get two teams built of various skills (contractors, designers, realtors) & have a series of competitions, each week sending home a competitor. The final man (or woman) standing takes the title of Brother vs. Brother. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Silver Scott Himself Drew Scott Himself Full Cast & Crew Current Season Season 6 2018 | 6 Episodes Season 6 of Brother vs. Brother premiered on May 23, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Brother vs. Brother. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  42m Homepage   http://www.hgtv.com/shows/brother-vs-brother Genres Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 9 Gonny 8 Elizabeth Jennings TB 5 TMDb Bot 4 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}