{"link": "https://www.themoviedb.org/tv/41407?language=en", "title": "Solve the Mystery after Dinner", "resume": "Nazotoki wa Dinner no Ato de is a Japanese television drama series based on the mystery novel of the same name by Japanese author Tokuya Higashigawa. It premiered on Fuji TV on October 18, 2011. This drama series was subsequently followed two-hour long special episode, then a film sequel.", "rate": 100, "genre": ["Mystery", "Comedy", "Action", "Adventure"], "cast": ["Anri Okamoto", "Keiko Kitagawa", "Sho Sakurai"], "character": ["Azumi Munemori", "Reiko Hosho", "Kageyama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41407   Expand Solve the Mystery after Dinner   (2011) User Score Overview Nazotoki wa Dinner no Ato de is a Japanese television drama series based on the mystery novel of the same name by Japanese author Tokuya Higashigawa. It premiered on Fuji TV on October 18, 2011. This drama series was subsequently followed two-hour long special episode, then a film sequel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anri Okamoto Azumi Munemori Keiko Kitagawa Reiko Hosho Sho Sakurai Kageyama Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of Solve the Mystery after Dinner premiered on October 18, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Solve the Mystery after Dinner. You can help by rating TV shows you've seen. Facts Original Name  謎解きはディナーのあとで Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage  - Genres Mystery Comedy Action & Adventure Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 7 kappa-papa t 6 taxigps t 2 tmdb38202327 A 1 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}