{"link": "https://www.themoviedb.org/tv/20413?language=en", "title": "Bo on the Go!", "resume": "Bo on the Go! is a Canadian TV series, created by Jeff Rosen and produced by Decode Entertainment, a DHX Media Company, in association with Decode Entertainment and Halifaxfilm. The TV series emphasizes the importance of movement for children through a plot element called \"Animoves\", which are animations demonstrating specific body movements that viewers must learn in order to solve problems highlighted in each episode.\nIt is broadcast in Canada on CBC Television in the Kids' CBC programming block. It is broadcast in the United Kingdom on Playhouse Disney and it is also broadcast in the United States on Playhouse Disney and is also broadcast on Disney Junior every weekday at 5:00 a.m. EST and 12:00 a.m. EST. It is currently broadcast on seventeen broadcasters around the world, in over twelve languages, including Spanish, French, Italian, Greek, Arabic, Thai, Finnish, Hebrew, Portuguese, Turkish, and Gaelic.", "rate": 60, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20413   Expand Bo on the Go! User Score Overview Bo on the Go! is a Canadian TV series, created by Jeff Rosen and produced by Decode Entertainment, a DHX Media Company, in association with Decode Entertainment and Halifaxfilm. The TV series emphasizes the importance of movement for children through a plot element called \"Animoves\", which are animations demonstrating specific body movements that viewers must learn in order to solve problems highlighted in each episode. It is broadcast in Canada on CBC Television in the Kids' CBC programming block. It is broadcast in the United Kingdom on Playhouse Disney and it is also broadcast in the United States on Playhouse Disney and is also broadcast on Disney Junior every weekday at 5:00 a.m. EST and 12:00 a.m. EST. It is currently broadcast on seventeen broadcasters around the world, in over twelve languages, including Spanish, French, Italian, Greek, Arabic, Thai, Finnish, Hebrew, Portuguese, Turkish, and Gaelic. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 — | 15 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 4 Banana 1 fabio.migliaccio  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}