{"link": "https://www.themoviedb.org/tv/38391?language=en", "title": "Summer Romance Shines in Rainbow Color", "resume": "Taiga is a struggling second-generation actor who has developed a complex due to his father, a famous actor in his time. Most of the time, Taiga only gets to appear in variety shows. One day when his friend brings him out skydiving, a big wind drags him away from the dropping point and he gets stuck in a tree. A beautiful woman, Shiori, rescues him. Shiori is a cheerful woman who laughs away all of her worries. She's exactly the opposite of Taiga...", "rate": 0, "genre": ["Drama"], "cast": ["Jun Matsumoto", "Yuko Takeuchi", "Ikki Sawamura", "Mirei Kiritani", "Hideyuki Kasahara"], "character": ["Taiga kusunoki", "Shiori Kitamura", "Daiki Kusunoki", "Sakura Miyase", "Keita Ueno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38391   Expand Summer Romance Shines in Rainbow Color   (2010) User Score Overview Taiga is a struggling second-generation actor who has developed a complex due to his father, a famous actor in his time. Most of the time, Taiga only gets to appear in variety shows. One day when his friend brings him out skydiving, a big wind drags him away from the dropping point and he gets stuck in a tree. A beautiful woman, Shiori, rescues him. Shiori is a cheerful woman who laughs away all of her worries. She's exactly the opposite of Taiga... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Matsumoto Taiga kusunoki Yuko Takeuchi Shiori Kitamura Ikki Sawamura Daiki Kusunoki Mirei Kiritani Sakura Miyase Hideyuki Kasahara Keita Ueno Full Cast & Crew Last Season Season 1 2010 | 10 Episodes Season 1 of Summer Romance Shines in Rainbow Color premiered on July 19, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Summer Romance Shines in Rainbow Color. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Summer Romance Shines in Rainbow Color. You can help by rating TV shows you've seen. Facts Original Name  夏の恋は虹色に輝く Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  45m Homepage  - Genres Drama Keywords romantic comedy Content Score 86 Almost there... Top Contributors A 16 Aka75 13 Elizabeth Jennings c 3 cunnox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}