{"link": "https://www.themoviedb.org/tv/10710?language=en", "title": "Wheeler Dealers", "resume": "Experienced car dealer Mike Brewer is joined by multi-talented mechanics in a monumental motoring mission: to find and restore iconic cars to later sell for a profit at their LA-based shop. In the series, Mike has the challenging job of finding vehicles that have money-making potential. He then hands them over to a mechanic, who tackles everything from bare metal re-sprays to gearbox swaps to bring them back to their former glory.", "rate": 79, "genre": ["Documentary"], "cast": ["Mike Brewer", "Ant Anstead"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10710   Expand Wheeler Dealers   (2003) User Score  Play Trailer Overview Experienced car dealer Mike Brewer is joined by multi-talented mechanics in a monumental motoring mission: to find and restore iconic cars to later sell for a profit at their LA-based shop. In the series, Mike has the challenging job of finding vehicles that have money-making potential. He then hands them over to a mechanic, who tackles everything from bare metal re-sprays to gearbox swaps to bring them back to their former glory. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  6 Images Backdrops  11 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mike Brewer Himself - Presenter Ant Anstead Full Cast & Crew Current Season Season 15 2018 | 9 Episodes Season 15 of Wheeler Dealers premiered on April 11, 2018. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply Anybody watching this show anymore? Open 2 by  Bananaghost Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  2 Recommendations   1969-09-13 The Perils of Penelope Pitstop 5.7    James Dean 6.5    1977-09-10 Captain Caveman and the Teen Angels 6.1    1983-09-06 Taggart 7.7    1990-09-27 Rab C. Nesbitt 7.1    1994-06-01 Inside the Actors Studio 7.1    1998-04-12 Scrapheap Challenge 6.8    2003-11-13 Brainiac: Science Abuse 7.1  Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  45m Homepage   http://wheelerdealers.discoveryuk.com/the-show/ Genres Documentary Keywords car mechanic car restoration Content Score 64 We're so close, yet so far. Top Contributors 19 radocity 13 seawolf 12 Elizabeth Jennings TB 9 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}