{"link": "https://www.themoviedb.org/tv/65589?language=en", "title": "In a Good Way", "resume": "In the summer of 1995, childhood friends Zheng Ren Wei and Lin Jia En took their college entrance exam. Zheng got into a college in Taipei and was ready to start an exciting life in the big city. Lin, unfortunately, failed the test and was stuck in the countryside. Bored out of her mind, Lin decided to go find Zheng and spend her 4th year of high school in Taipei as well.", "rate": 0, "genre": ["Drama", "Romance"], "cast": ["Kirsten Ren", "Lego Li", "Jay Shih", "Smile Weng"], "character": ["Lin Jia En", "Liu Shan Feng", "Zheng Ren Wei", "Bai Xue Fen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65589   Expand In a Good Way   (2013) User Score Overview In the summer of 1995, childhood friends Zheng Ren Wei and Lin Jia En took their college entrance exam. Zheng got into a college in Taipei and was ready to start an exciting life in the big city. Lin, unfortunately, failed the test and was stuck in the countryside. Bored out of her mind, Lin decided to go find Zheng and spend her 4th year of high school in Taipei as well. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kirsten Ren Lin Jia En Lego Li Liu Shan Feng Jay Shih Zheng Ren Wei Smile Weng Bai Xue Fen Full Cast & Crew Last Season Season 1 2013 | 26 Episodes Season 1 of In a Good Way premiered on November 15, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on In a Good Way. You can help by rating TV shows you've seen. Facts Original Name  我的自由年代 Status  Ended Network Sanlih E-Television Certification  - Type  Scripted Original Language  Chinese Runtime  90m Homepage  - Genres Drama Romance Keywords friendship freedom nostalgia coming of age taiwan slice of life unrequited love youth first love 1990s college life Content Score 86 Almost there... Top Contributors 56 saltofstones z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}