{"link": "https://www.themoviedb.org/tv/30782?language=en", "title": "The Legend of Neil", "resume": "The Legend of Neil is a comedy web series distributed by Comedy Central's partner Atom.com and is a parody of the Nintendo game The Legend of Zelda. Sandeep Parikh of The Guild fame directs the series. Tony Janning writes for the series, and acts as the title character Neil. Felicia Day and Mike Rose, who have worked with Parikh on the set of The Guild, appear as recurring characters.\nThe series follows Neil, who is sucked into the world of The Legend of Zelda while playing the game. As he travels Hyrule he is mistaken for the hero of the game, Link. The series is \"full of self degrading, foul humor\", such as when Neil is being sucked into the game he is masturbating and strangled himself with his NES controller.\nThe series began as a four-minute YouTube video posted in 2007. The video went viral, receiving several million views. Its popularity led to Atom.com financing a web series based around the video.\nThe first season was released in 2008. According to Fox Business before the premiere of the second season, \"With nearly one million plays, the hit Web series by creator Sandeep Parikh built one of the Web's most enthusiastic fan bases in 2008.\" In the run-up to the August 2009 premiere of the second season, MTV2 planned to air the complete first season. The series was also nominated for multiple Streamys at the 1st Streamy Awards in 2009.", "rate": 70, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Felicia Day", "Robert Hoffman", "Mike Rose", "Tony Janning"], "character": ["Fairy", "Captain Lynel", "Neil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30782   Expand The Legend of Neil   (2008) User Score Overview The Legend of Neil is a comedy web series distributed by Comedy Central's partner Atom.com and is a parody of the Nintendo game The Legend of Zelda. Sandeep Parikh of The Guild fame directs the series. Tony Janning writes for the series, and acts as the title character Neil. Felicia Day and Mike Rose, who have worked with Parikh on the set of The Guild, appear as recurring characters. The series follows Neil, who is sucked into the world of The Legend of Zelda while playing the game. As he travels Hyrule he is mistaken for the hero of the game, Link. The series is \"full of self degrading, foul humor\", such as when Neil is being sucked into the game he is masturbating and strangled himself with his NES controller. The series began as a four-minute YouTube video posted in 2007. The video went viral, receiving several million views. Its popularity led to Atom.com financing a web series based around the video. The first season was released in 2008. According to Fox Business before the premiere of the second season, \"With nearly one million plays, the hit Web series by creator Sandeep Parikh built one of the Web's most enthusiastic fan bases in 2008.\" In the run-up to the August 2009 premiere of the second season, MTV2 planned to air the complete first season. The series was also nominated for multiple Streamys at the 1st Streamy Awards in 2009. Featured Crew Sandeep Parikh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Felicia Day Fairy Robert Hoffman Captain Lynel Mike Rose Tony Janning Neil Full Cast & Crew Last Season Season 3 2010 | 7 Episodes Season 3 of The Legend of Neil premiered on July 25, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Legend of Neil. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Neil. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://www.legendofneil.com/ Genres Sci-Fi & Fantasy Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 12 Elizabeth Jennings 8 dbowman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}