{"link": "https://www.themoviedb.org/tv/52854?language=en", "title": "Tawan Chai Nai Marn Mek", "resume": "A young woman goes in search of her first love to get inspiration for a novel she is writing. In her search she finds herself pretending to be a man to be a manny for a guy who owns the home of her first love.\n‘Tawanchai Nai Marn Mek (Tawanchai in a veil of clouds)’ is a lakorn for Ch3, produced by ‘Jett’ Nattapong Mernprasitivej and directed by actor Chai Chatayodom Hiranyatithi. It’s based of a novel by the same name and it centers around a young woman name Tawanchai played by Taew Nataporn who wants to be a writer and has to write about love, something she has never experienced before. Love doesn’t come easily, you can’t shop for it at the store, you can’t conjure it up by just saying come over–the only experience she had close to resembling love was a crush on P’Thee when she was in high school.\nTawanchai goes in search for Thee at his home but she finds her nemesis P’Mek Boy Pakorn Chatborirak and his young son at the home. To investigate about the whereabouts of her first love, Tawanchai disguises herself as a man named ‘San’ to become a manny to Mek’s young son. Tawanchai has to disguise herself a guy because Mek is an oddball who will only allow men to watch over his young son.", "rate": 58, "genre": ["Soap", "Drama"], "cast": ["Pakorn Chatborirak", "Nattaporn Temeeruk", "Toni Rakkaen", "Amena Gul", "Benjawan Artner"], "character": ["Nopatee (Mek)", "Tawanchai (Sun)", "Yut", "Ingfah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52854   Expand Tawan Chai Nai Marn Mek   (2012) User Score  Play Trailer Overview A young woman goes in search of her first love to get inspiration for a novel she is writing. In her search she finds herself pretending to be a man to be a manny for a guy who owns the home of her first love. ‘Tawanchai Nai Marn Mek (Tawanchai in a veil of clouds)’ is a lakorn for Ch3, produced by ‘Jett’ Nattapong Mernprasitivej and directed by actor Chai Chatayodom Hiranyatithi. It’s based of a novel by the same name and it centers around a young woman name Tawanchai played by Taew Nataporn who wants to be a writer and has to write about love, something she has never experienced before. Love doesn’t come easily, you can’t shop for it at the store, you can’t conjure it up by just saying come over–the only experience she had close to resembling love was a crush on P’Thee when she was in high school. Tawanchai goes in search for Thee at his home but she finds her nemesis P’Mek Boy Pakorn Chatborirak and his young son at the home. To investigate about the whereabouts of her first love, Tawanchai disguises herself as a man named ‘San’ to become a manny to Mek’s young son. Tawanchai has to disguise herself a guy because Mek is an oddball who will only allow men to watch over his young son.  Featured Crew Maker Y Group Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pakorn Chatborirak Nopatee (Mek) Nattaporn Temeeruk Tawanchai (Sun) Toni Rakkaen Yut Amena Gul Benjawan Artner Ingfah Full Cast & Crew Last Season Season 1 2012 | 15 Episodes Season 1 of Tawan Chai Nai Marn Mek premiered on December 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tawan Chai Nai Marn Mek. You can help by rating TV shows you've seen. Facts Original Name  ตะวันฉายในม่านเมฆ Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 29 Crip TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}