{"link": "https://www.themoviedb.org/tv/37?language=en", "title": "Seven of One", "resume": "Seven of One was a British comedy series that aired on BBC2 in 1973. Starring Ronnie Barker, 7 of One is a series of seven separate comedies that would serve as possible pilots for sitcoms. Originally it was to be called Six of One, which Barker planned to follow up with another series called Half Dozen of the Other. This was a BBC version of a similar showcase for LWT called Six Dates with Barker created in 1971.", "rate": 70, "genre": ["Comedy"], "cast": ["Ronnie Barker"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37   Expand Seven of One   (1973) User Score Overview Seven of One was a British comedy series that aired on BBC2 in 1973. Starring Ronnie Barker, 7 of One is a series of seven separate comedies that would serve as possible pilots for sitcoms. Originally it was to be called Six of One, which Barker planned to follow up with another series called Half Dozen of the Other. This was a BBC version of a similar showcase for LWT called Six Dates with Barker created in 1971. Featured Crew Ronnie Barker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ronnie Barker Full Cast & Crew Last Season Season 1 1973 | 7 Episodes Season 1 of Seven of One premiered on March 25, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Seven of One. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}