{"link": "https://www.themoviedb.org/tv/73544?language=en", "title": "Warrior", "resume": "A gritty, action-packed crime drama set during the brutal Tong Wars of San Francisco’s Chinatown in the second half of the 19th century. The series follows Ah Sahm, a martial arts prodigy who immigrates from China to San Francisco under mysterious circumstances, and becomes a hatchet man for one of Chinatown’s most powerful tongs.", "rate": 0, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Andrew Koji", "Olivia Cheng", "Jason Tobin", "Dianne Doan", "Kieran Bew"], "character": ["Ah Sahm", "Ah Toy", "Young Jun", "Mai Ling", "Officer “Big Bill” O’Hara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73544   Expand Warrior   (2018) User Score Overview A gritty, action-packed crime drama set during the brutal Tong Wars of San Francisco’s Chinatown in the second half of the 19th century. The series follows Ah Sahm, a martial arts prodigy who immigrates from China to San Francisco under mysterious circumstances, and becomes a hatchet man for one of Chinatown’s most powerful tongs. Featured Crew Jonathan Tropper Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrew Koji Ah Sahm Olivia Cheng Ah Toy Jason Tobin Young Jun Dianne Doan Mai Ling Kieran Bew Officer “Big Bill” O’Hara Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  In Production Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  - Homepage  - Genres Action & Adventure Crime Drama Keywords martial arts san francisco early america tong wars Content Score 79 Pump it up! We're close now. Top Contributors 59 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}