{"link": "https://www.themoviedb.org/tv/46874?language=en", "title": "Fast N' Loud", "resume": "Motor mastermind Richard Rawlings and mechanical prodigy Aaron Kaufman search for forgotten and neglected vintage cars. They need big projects and big profits to keep the doors open at Gas Monkey Garage in Dallas, TX.", "rate": 64, "genre": ["Reality"], "cast": ["Richard Rawlings", "Aaron Kaufmann"], "character": ["Besitzer", "Chef Mechaniker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46874   Expand Fast N' Loud   (2012) User Score  Play Trailer Overview Motor mastermind Richard Rawlings and mechanical prodigy Aaron Kaufman search for forgotten and neglected vintage cars. They need big projects and big profits to keep the doors open at Gas Monkey Garage in Dallas, TX. Featured Crew Richard Rawlings Creator Aaron Kaufmann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  7 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Rawlings Besitzer Aaron Kaufmann Chef Mechaniker Full Cast & Crew Current Season Season 14 2018 | 9 Episodes Season 14 of Fast N' Loud premiered on March 12, 2018. View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply t Crossing the threshhold into a new home... Open 0 by tonyismad\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2014-10-13 Misfit Garage 7.5    2012-08-13 Counting Cars 6.3    2004-04-13 Overhaulin' 6.8    2010-10-25 American Restoration 6.1    1999-01-31 Family Guy 6.5  Facts Status  Returning Series Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.discovery.com/tv-shows/fast-n-loud/ Genres Reality Keywords hot rod car restoration Content Score 71 Just a little bit more... Top Contributors s 23 scuff-1 d 14 dblek73 13 gaminginsider 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}