{"link": "https://www.themoviedb.org/tv/59174?language=en", "title": "Toda una dama", "resume": "Toda una dama is a successful Venezuelan telenovela produced and broadcast on RCTV International in 2007. The telenovela is a remake of Señora, an original story written by renowned telenovela author José Ignacio Cabrujas. This new verison was adapred by Iris Dubs and starred Christina Dieckmann and Ricardo Álamo as the main protagonists with Nohely Arteaga starred as the main antagonist.", "rate": 60, "genre": ["Family", "Soap", "Drama"], "cast": ["Christina Dieckmann", "Ricardo Álamo", "Roberto Messuti", "Nohely Arteaga", "María Gabriela de Faría"], "character": ["Valeria Aguirre", "Miguel Reyes", "Ignacio Caballero", "Imperio Laya", "Helena Trujillo Laya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59174   Expand Toda una dama   (2007) User Score Overview Toda una dama is a successful Venezuelan telenovela produced and broadcast on RCTV International in 2007. The telenovela is a remake of Señora, an original story written by renowned telenovela author José Ignacio Cabrujas. This new verison was adapred by Iris Dubs and starred Christina Dieckmann and Ricardo Álamo as the main protagonists with Nohely Arteaga starred as the main antagonist. Featured Crew Paola Meneres Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christina Dieckmann Valeria Aguirre Ricardo Álamo Miguel Reyes Roberto Messuti Ignacio Caballero Nohely Arteaga Imperio Laya María Gabriela de Faría Helena Trujillo Laya Full Cast & Crew Last Season Season 1 2007 | 169 Episodes Season 1 of Toda una dama premiered on November  7, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Toda una dama. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12 Meaning Content suitable for viewers over the age of 12. Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Family Soap Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 68 Amanda s 3 speedycars TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}