{"link": "https://www.themoviedb.org/tv/1630?language=en", "title": "Dirty Sanchez", "resume": "Dirty Sanchez is a British stunt and prank TV series featuring a group of three Welshmen and one Englishman harming themselves, and each other, through dangerous stunts. It is known as Sanchez Boys and Team Sanchez in the U.S. The performers are Matthew Pritchard, Lee Dainton, Michael Locke and Dan Joyce, and were originally based in Newport, South Wales, but later series of the show take place elsewhere in the United Kingdom and the world. Pritchard and Locke also starred as the Pain Men in Channel 4's Balls of Steel.", "rate": 58, "genre": ["Comedy"], "cast": ["Matthew Pritchard", "Dan Joyce"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1630   Expand Dirty Sanchez   (2003) User Score Overview Dirty Sanchez is a British stunt and prank TV series featuring a group of three Welshmen and one Englishman harming themselves, and each other, through dangerous stunts. It is known as Sanchez Boys and Team Sanchez in the U.S. The performers are Matthew Pritchard, Lee Dainton, Michael Locke and Dan Joyce, and were originally based in Newport, South Wales, but later series of the show take place elsewhere in the United Kingdom and the world. Pritchard and Locke also starred as the Pain Men in Channel 4's Balls of Steel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Pritchard Dan Joyce Full Cast & Crew Last Season Season 5 2007 | 7 Episodes Season 5 of Dirty Sanchez premiered on July  1, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2003-10-26 Viva La Bam 6.1    2003-09-19 Peep Show 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.mtv.co.uk/dirty_sanchez Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 Banana 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}