{"link": "https://www.themoviedb.org/tv/33037?language=en", "title": "Journey to the West", "resume": "Journey to the West is a Chinese television series adapted from the classical novel of the same title. The series was directed and produced by Cheng Lidong and starred Fei Zhenxiang, Victor Chen, Xie Ning and Mou Fengbin in the leading roles. It was first aired on Zhejiang Satellite TV in China on 14 February 2010. This version is not to be confused with the 2011 television series of the same title produced by Zhang Jizhong.", "rate": 0, "genre": [], "cast": ["Diana Pang"], "character": ["Baozhu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33037   Expand Journey to the West   (2010) User Score Overview Journey to the West is a Chinese television series adapted from the classical novel of the same title. The series was directed and produced by Cheng Lidong and starred Fei Zhenxiang, Victor Chen, Xie Ning and Mou Fengbin in the leading roles. It was first aired on Zhejiang Satellite TV in China on 14 February 2010. This version is not to be confused with the 2011 television series of the same title produced by Zhang Jizhong. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diana Pang Baozhu Full Cast & Crew Last Season Season 1 — | 52 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Journey to the West. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 5 Batliebre 2 jack denis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}