{"link": "https://www.themoviedb.org/tv/68554?language=en", "title": "Kiss x Sis", "resume": "A young man in his last year of middle school trying to get into the same highschool as them is constantly being seduced by his slightly older step-sisters. The series revolves around his struggle to balance his school, and personal life with his sisters affections. Takes place in modern Japan.", "rate": 60, "genre": ["Comedy", "Animation"], "cast": ["Yuiko Tatsumi", "Ayana Taketatsu", "Ken Takeuchi"], "character": ["Suminoe Riko", "Suminoe Ako", "Suminoe Keita"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68554   Expand Kiss x Sis   (2010) User Score Overview A young man in his last year of middle school trying to get into the same highschool as them is constantly being seduced by his slightly older step-sisters. The series revolves around his struggle to balance his school, and personal life with his sisters affections. Takes place in modern Japan. Featured Crew Munenori Nawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuiko Tatsumi Suminoe Riko Ayana Taketatsu Suminoe Ako Ken Takeuchi Suminoe Keita Full Cast & Crew Last Season Season 1 2010 | 1 Episode Season 1 of Kiss x Sis premiered on April  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kiss x Sis. You can help by rating TV shows you've seen. Facts Original Name  キスシス Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Comedy Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors H 17 Hide K 5 Kuroneko45 n 2 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}