{"link": "https://www.themoviedb.org/tv/57911?language=en", "title": "Doraemon", "resume": "Doraemon is an anime TV series created by Fujiko F. Fujio and based on the manga series of the same name. This anime is the much more successful successor of the 1973 anime.", "rate": 56, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Noriko Ohara ", "Kaneta Kimotsuki", "Michiko Nomura", "Nobuyo Oyama", "Kazuya Tatekabe"], "character": ["Nobita Nobi", "Suneo Honekawa", "Shizuka Minamoto", "Doraemon (voice)", "Takeshi Gouda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57911   Expand Doraemon   (1979) User Score Overview Doraemon is an anime TV series created by Fujiko F. Fujio and based on the manga series of the same name. This anime is the much more successful successor of the 1973 anime. Featured Crew Fujiko F. Fujio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Noriko Ohara  Nobita Nobi Kaneta Kimotsuki Suneo Honekawa Michiko Nomura Shizuka Minamoto  Nobuyo Oyama Doraemon (voice) Kazuya Tatekabe Takeshi Gouda Full Cast & Crew Last Season Season 27 2005 | 28 Episodes Season 27 of Doraemon premiered on January  7, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1981-10-09 Dogtanian and the Three Muskehounds 6.5    2003-09-07 Aquí no hay quien viva 7.1    1974-01-06 Heidi, Girl of the Alps 7.3    1992-04-13 Crayon Shin-chan 7.4    1940-11-25 The Woody Woodpecker Show 7.1    1969-11-10 Sesame Street 7.4    1994-11-19 Spider-Man 7.8    1960-09-30 The Flintstones 7.0  Facts Original Name  ドラえもん Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  11m Homepage   http://www.tv-asahi.co.jp/doraemon/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords japan daily life student kids time traveler school life Content Score 93 Almost there... Top Contributors 126 Wong n 28 naggarok 27 niqo19 7 matar12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}