{"link": "https://www.themoviedb.org/tv/20763?language=en", "title": "Mother Love", "resume": "Mother Love is a British television drama that first aired in 1989. It was adapted by Andrew Davies from Domini Taylor's novel concerning a mother's obsessive love for her son, vengeful hatred of his father, her ex-husband, and the effect on her daughter-in-law and grandchildren. It starred Diana Rigg, David McCallum, James Wilby, and Fiona Gillies, and was directed by Simon Langton.\nChristopher \"Kit\" Vesey and Angela Vesey, a British yuppie couple, enjoy a seemingly idyllic life. Yet there is one troubling factor in their lives - Kit's mother Helena, an eccentric and often difficult woman consumed by anger with Kit's father, a famed concert musician with whom she believes Kit has no contact.\nHer oddness is confirmed in a series of incidents involving her ex-husband and his second wife, Ruth, an artist. Flashbacks throughout the series reveal bits of Helena's troubled past. Little by little, the young couple's life begins to fall apart as Helena begins to act out her feelings of intense jealousy and desire for revenge, implicating a dear old friend and leading to murder.", "rate": 82, "genre": ["Drama"], "cast": ["James Wilby", "Diana Rigg", "David McCallum", "Fiona Gillies"], "character": ["Helena Vesey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20763   Expand Mother Love   (1989) User Score Overview Mother Love is a British television drama that first aired in 1989. It was adapted by Andrew Davies from Domini Taylor's novel concerning a mother's obsessive love for her son, vengeful hatred of his father, her ex-husband, and the effect on her daughter-in-law and grandchildren. It starred Diana Rigg, David McCallum, James Wilby, and Fiona Gillies, and was directed by Simon Langton. Christopher \"Kit\" Vesey and Angela Vesey, a British yuppie couple, enjoy a seemingly idyllic life. Yet there is one troubling factor in their lives - Kit's mother Helena, an eccentric and often difficult woman consumed by anger with Kit's father, a famed concert musician with whom she believes Kit has no contact. Her oddness is confirmed in a series of incidents involving her ex-husband and his second wife, Ruth, an artist. Flashbacks throughout the series reveal bits of Helena's troubled past. Little by little, the young couple's life begins to fall apart as Helena begins to act out her feelings of intense jealousy and desire for revenge, implicating a dear old friend and leading to murder. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Wilby Diana Rigg Helena Vesey David McCallum Fiona Gillies Full Cast & Crew Last Season Season 1 — | 4 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mother Love. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  55m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 1 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}