{"link": "https://www.themoviedb.org/tv/25836?language=en", "title": "By Way of the Stars", "resume": "A young boy's search for his father takes him from 19th century Prussia to the wilds of the American West.", "rate": 50, "genre": ["Drama"], "cast": ["Zachary Bennett", "Gema Zamprogna", "Christian Kohlund", "Anja Kruse", "Dietmar Schönherr"], "character": ["Lukas Bienmann", "Ursula von Knabig", "Karl Bienmann", "Maria Bienmann", "Friedrich Brunneck"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25836   Expand By Way of the Stars   (1992) User Score  Play Trailer Overview A young boy's search for his father takes him from 19th century Prussia to the wilds of the American West. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zachary Bennett Lukas Bienmann Gema Zamprogna Ursula von Knabig Christian Kohlund Karl Bienmann Anja Kruse Maria Bienmann Dietmar Schönherr Friedrich Brunneck Full Cast & Crew Last Season Miniseries 1992 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  13 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on By Way of the Stars. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage   http://sullivanmovies.com/portfolio/by-way-of-the-stars Genres Drama Keywords canada escape Content Score 93 Almost there... Top Contributors 54 janar c 10 clhitch 8 Steve p 3 pgranado  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}