{"link": "https://www.themoviedb.org/tv/64043?language=en", "title": "Casual", "resume": "A dysfunctional family tries to help each other navigate the modern dating scene. Recent divorcee Tara and her bachelor brother coach each other through the crazy world of dating (on-line and off), while living under the same roof again for the second time and raising her teenage daughter.", "rate": 65, "genre": ["Comedy"], "cast": ["Michaela Watkins", "Tommy Dewey", "Tara Lynne Barr", "Zak Orth"], "character": ["Valerie", "Alex Cole", "Laura", "Drew Meyers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64043   Expand Casual   (2015) User Score  Play Trailer Overview A dysfunctional family tries to help each other navigate the modern dating scene. Recent divorcee Tara and her bachelor brother coach each other through the crazy world of dating (on-line and off), while living under the same roof again for the second time and raising her teenage daughter. Featured Crew Jason Reitman Creator Zander Lehmann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michaela Watkins Valerie Tommy Dewey Alex Cole Tara Lynne Barr Laura Zak Orth Drew Meyers Full Cast & Crew Last Season Season 3 2017 | 13 Episodes Season 3 of Casual premiered on May 23, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Depressing AF Open 2 by  YouShouldKnow m Valerie this season has been on the verge of a mental break and I don't get why? Open 0 by madmehr\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  9 Recommendations   2016-06-07 Agatha Raisin 6.3    2013-08-01 The Awesomes 7.6    2013-08-05 Quick Draw 6.3    2016-03-01 Loosely Exactly Nicole 5.8    2015-08-05 Difficult People 7.4    2017-11-05 SMILF 6.7    2015-03-03 Billy & Billie 7.9    2016-10-27 The Great Indoors 5.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hulu.com/casual Genres Comedy Keywords sibling relationship bachelor dysfunctional family dating divorcee Content Score 100 Yes! Looking good! Top Contributors 60 Elizabeth Jennings m 7 misfit_noel s 7 speedycars 6 Bendik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}