{"link": "https://www.themoviedb.org/tv/14864?language=en", "title": "Who's Watching the Kids?", "resume": "Who's Watching the Kids? is an American sitcom which aired on NBC from September 22, 1978 until December 15, 1978. It was produced by Garry Marshall, who was partly responsible for ratings domination over at rival ABC at the time with his string of hits. The series focused on two young Las Vegas showgirls, working and rooming together, who each had a younger sibling living with them.\nThe series originated as the pilot special Legs, which NBC aired on May 19, 1978.", "rate": 0, "genre": ["Comedy"], "cast": ["Lynda Goodfriend", "Jim Belushi", "Tammy Lauren", "Scott Baio", "Marcia Lewis"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14864   Expand Who's Watching the Kids?   (1978) User Score Overview Who's Watching the Kids? is an American sitcom which aired on NBC from September 22, 1978 until December 15, 1978. It was produced by Garry Marshall, who was partly responsible for ratings domination over at rival ABC at the time with his string of hits. The series focused on two young Las Vegas showgirls, working and rooming together, who each had a younger sibling living with them. The series originated as the pilot special Legs, which NBC aired on May 19, 1978. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lynda Goodfriend Jim Belushi Tammy Lauren Scott Baio Marcia Lewis Full Cast & Crew Last Season Season 1 1978 | 16 Episodes Season 1 of Who's Watching the Kids? premiered on September 22, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Who's Watching the Kids?. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords las vegas showgirl sitcom living with sibling Content Score 71 Just a little bit more... Top Contributors 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}