{"link": "https://www.themoviedb.org/tv/5484?language=en", "title": "The Beiderbecke Tapes", "resume": "The Beiderbecke Tapes is a two-part British television drama serial written by Alan Plater and broadcast in 1987. It is the second serial in The Beiderbecke Trilogy and stars James Bolam and Barbara Flynn as schoolteachers Trevor Chaplin and Jill Swinburne. When a tape recording of a conversation about nuclear waste inadvertently falls into Trevor's hands, Trevor and Jill find themselves being pursued by national security agents.", "rate": 100, "genre": ["Comedy", "Drama"], "cast": ["James Bolam", "Barbara Flynn", "Dudley Sutton", "Beryl Reid", "Don Fellows"], "character": ["Trevor Chaplin", "Jill Swinburne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5484   Expand The Beiderbecke Tapes   (1987) User Score Overview The Beiderbecke Tapes is a two-part British television drama serial written by Alan Plater and broadcast in 1987. It is the second serial in The Beiderbecke Trilogy and stars James Bolam and Barbara Flynn as schoolteachers Trevor Chaplin and Jill Swinburne. When a tape recording of a conversation about nuclear waste inadvertently falls into Trevor's hands, Trevor and Jill find themselves being pursued by national security agents. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Bolam Trevor Chaplin Barbara Flynn Jill Swinburne Dudley Sutton Beryl Reid Don Fellows Full Cast & Crew Last Season Season 1 1987 | 2 Episodes Season 1 of The Beiderbecke Tapes premiered on December 13, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Beiderbecke Tapes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Comedy Drama Keywords miniseries Content Score 86 Almost there... Top Contributors R 6 Rebecca TB 4 TMDb Bot I 1 Iain_S  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}