{"link": "https://www.themoviedb.org/tv/1451?language=en", "title": "Santa Barbara", "resume": "Santa Barbara is an American television soap opera, first broadcast in the United States on NBC on July 30, 1984, and last aired on January 15, 1993. The show revolves around the eventful lives of the wealthy Capwell family of Santa Barbara, California. Other prominent families featured on the soap were the rival Lockridge family, and the more modest Andrade and Perkins families.\nThe serial was co-produced by NBC and Dobson Productions until February 1985, when New World Pictures joined NBC and Dobson as a production partner. The newly created partnership, New World Television, then served as the distributor for the show.\nSanta Barbara aired in over 40 countries around the world. The show's popularity continued to rise, and it even had fans in the White House. In 1985, when character Augusta Lockridge was blinded following a tunnel collapse, Ronald Reagan sent actress Louise Sorel a letter saying he and Nancy were praying for her and hoped she recovered. Santa Barbara has won 24 Daytime Emmy Awards and was nominated 30 times for the same award. The show also won 18 Soap Opera Digest Awards, and won various other awards.\nIn 1993, NBC replaced Santa Barbara with game shows Scrabble and Scattergories. Shortly before the program was canceled by NBC, New World Television tried to shop Santa Barbara to other broadcast and cable networks, but failed to find one that would air the show.", "rate": 38, "genre": ["Soap", "Drama"], "cast": ["Jed Allan", "Robin Wright", "Lane Davies", "Nancy Lee Grahn", "Todd McKee"], "character": ["Kelly Capwell", "Julia Wainwright Capwell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1451   Expand Santa Barbara   (1984) User Score Overview Santa Barbara is an American television soap opera, first broadcast in the United States on NBC on July 30, 1984, and last aired on January 15, 1993. The show revolves around the eventful lives of the wealthy Capwell family of Santa Barbara, California. Other prominent families featured on the soap were the rival Lockridge family, and the more modest Andrade and Perkins families. The serial was co-produced by NBC and Dobson Productions until February 1985, when New World Pictures joined NBC and Dobson as a production partner. The newly created partnership, New World Television, then served as the distributor for the show. Santa Barbara aired in over 40 countries around the world. The show's popularity continued to rise, and it even had fans in the White House. In 1985, when character Augusta Lockridge was blinded following a tunnel collapse, Ronald Reagan sent actress Louise Sorel a letter saying he and Nancy were praying for her and hoped she recovered. Santa Barbara has won 24 Daytime Emmy Awards and was nominated 30 times for the same award. The show also won 18 Soap Opera Digest Awards, and won various other awards. In 1993, NBC replaced Santa Barbara with game shows Scrabble and Scattergories. Shortly before the program was canceled by NBC, New World Television tried to shop Santa Barbara to other broadcast and cable networks, but failed to find one that would air the show. Featured Crew Jerome Dobson Creator Bridget Dobson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jed Allan Robin Wright Kelly Capwell Lane Davies Nancy Lee Grahn Julia Wainwright Capwell Todd McKee Full Cast & Crew Last Season Season 10 1993 | 10 Episodes Season 10 of Santa Barbara premiered on January  4, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1984-09-16 Miami Vice 7.1    2006-12-11 The Lost Room 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Soap Drama Keywords california soap opera Content Score 93 Almost there... Top Contributors 17 Banana 12 t0by M 3 MAthePA 3 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}