{"link": "https://www.themoviedb.org/tv/15746?language=en", "title": "North Square", "resume": "North Square is an award-winning British television drama series written by Peter Moffat and broadcast by Channel 4 at the end of 2000. Starring an ensemble cast, including Phil Davis, Rupert Penry-Jones, Helen McCrory and Kevin McKidd, the programme is set around the practice of a Leeds Legal Chambers.\nThe series was filmed in and around the real life Park Square, Leeds. This is the area near the city where the majority of legal firms are concentrated.\nDespite gaining considerable critical acclaim the show failed to garner a substantial audience resulting in only the one series of ten episodes being produced. In Australia the series was broadcast in 2001 on ABC and repeated in 2004 after popular and critical acclaim. The full series was released on DVD for the first time by Acorn Media UK on 5 March 2012.", "rate": 70, "genre": ["Drama"], "cast": ["Kevin McKidd", "Victoria Smurfit", "Phil Davis", "James Murray", "Sasha Behar"], "character": ["Billy Guthrie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15746   Expand North Square   (2000) User Score Overview North Square is an award-winning British television drama series written by Peter Moffat and broadcast by Channel 4 at the end of 2000. Starring an ensemble cast, including Phil Davis, Rupert Penry-Jones, Helen McCrory and Kevin McKidd, the programme is set around the practice of a Leeds Legal Chambers. The series was filmed in and around the real life Park Square, Leeds. This is the area near the city where the majority of legal firms are concentrated. Despite gaining considerable critical acclaim the show failed to garner a substantial audience resulting in only the one series of ten episodes being produced. In Australia the series was broadcast in 2001 on ABC and repeated in 2004 after popular and critical acclaim. The full series was released on DVD for the first time by Acorn Media UK on 5 March 2012. Featured Crew Peter Moffat Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin McKidd Billy Guthrie Victoria Smurfit Phil Davis James Murray Sasha Behar Full Cast & Crew Last Season Season 1 — | 10 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on North Square. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage  - Genres Drama Keywords northern england england yorkshire lawyer barrister Content Score 93 Almost there... Top Contributors 8 Banana z 4 zurman1 TB 2 TMDb Bot 2 BagronkeN  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}