{"link": "https://www.themoviedb.org/tv/77362?language=en", "title": "Iron Man: Extremis", "resume": "An experimental serum called Extremis gets stolen, and Iron Man rockets into action. The ensuing battles test Stark's spirit and Iron Man's power.", "rate": 69, "genre": [], "cast": ["Jason Griffith", "Therese Spurrier", "Ted Lewis"], "character": ["Tony Stark (Voice)", "Maya Hansen (voice)", "Mallen (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77362   Expand Iron Man: Extremis   (2010) User Score  Play Trailer Overview An experimental serum called Extremis gets stolen, and Iron Man rockets into action. The ensuing battles test Stark's spirit and Iron Man's power. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Griffith Tony Stark (Voice) Therese Spurrier Maya Hansen (voice) Ted Lewis Mallen (Voice) Full Cast & Crew Last Season Miniseries 2010 | 6 Episodes Season 1 of Iron Man: Extremis premiered on November 30, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply iron man extremis Open 0 by ludwigmartina\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Iron Man: Extremis. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords super soldier scientist iron man virus motion comic Content Score 56 We're so close, yet so far. Top Contributors TB 17 TMDb Bot 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}