{"link": "https://www.themoviedb.org/tv/30695?language=en", "title": "Bab Al-Hara", "resume": "Bab Al-Hara is one of the most popular television series in the Arab world, watched by tens of millions of people from \"poverty-stricken Gaza to the opulent cities of the Persian Gulf.\" The series chronicles the daily happenings and family dramas in a neighborhood in Damascus, Syria in the inter-war period under French rule when the local population yearned for independence. The appeal is cross-generational, and viewers include Muslims, Christians, Druze and Jews from Arab countries, the show was a huge success in the Arab World so MBC decides to renew it for a second season, the series' second season was even a bigger success as the finale was watched by over a 50 million viewers around the Arab World. It was renewed for 3 more seasons, the viewers went down in both seasons 4 and 5 so the channel announced its cancellation. Although, according to some recent news by syria-drama.net that the series will be making a come back next Ramadan 2014 or 2015.", "rate": 0, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30695   Expand Bab Al-Hara User Score Overview Bab Al-Hara is one of the most popular television series in the Arab world, watched by tens of millions of people from \"poverty-stricken Gaza to the opulent cities of the Persian Gulf.\" The series chronicles the daily happenings and family dramas in a neighborhood in Damascus, Syria in the inter-war period under French rule when the local population yearned for independence. The appeal is cross-generational, and viewers include Muslims, Christians, Druze and Jews from Arab countries, the show was a huge success in the Arab World so MBC decides to renew it for a second season, the series' second season was even a bigger success as the finale was watched by over a 50 million viewers around the Arab World. It was renewed for 3 more seasons, the viewers went down in both seasons 4 and 5 so the channel announced its cancellation. Although, according to some recent news by syria-drama.net that the series will be making a come back next Ramadan 2014 or 2015. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2017 | 1 Episode Season 9 of Bab Al-Hara premiered on June  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.mbc.net/portal/site/mbc Genres Drama Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 6 anoskinz F 2 FLIX555 1 Banana TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}