{"link": "https://www.themoviedb.org/tv/8086?language=en", "title": "The Julekalender", "resume": "The Julekalender was a Danish TV series that ran at Christmas 1991. It was written and performed almost entirely by a trio of Danish comedy musicians called De Nattergale with financial and technical assistance from TV2, a Danish television company. It was hugely successful at the time, causing many invented phrases from the series to enter popular culture and was later released on VHS, and recently, DVD.\nIt had 24 episodes, as has been typical of other TV \"calendars\" before and since The Julekalender.", "rate": 79, "genre": ["Comedy"], "cast": ["Viggo Sommer", "Carsten Knudsen", "Uffe Rørbæk Madsen"], "character": ["Oluf Sand / Fritz", "Gertrud Sand / Günter", "Benny / Hansi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8086   Expand The Julekalender   (1991) User Score Overview The Julekalender was a Danish TV series that ran at Christmas 1991. It was written and performed almost entirely by a trio of Danish comedy musicians called De Nattergale with financial and technical assistance from TV2, a Danish television company. It was hugely successful at the time, causing many invented phrases from the series to enter popular culture and was later released on VHS, and recently, DVD. It had 24 episodes, as has been typical of other TV \"calendars\" before and since The Julekalender. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Viggo Sommer Oluf Sand / Fritz Carsten Knudsen Gertrud Sand / Günter Uffe Rørbæk Madsen Benny / Hansi Full Cast & Crew Last Season Season 1 1991 | 24 Episodes Season 1 of The Julekalender premiered on December  1, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2004-09-22 Lost 7.8    1989-12-17 The Simpsons 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Danish Runtime  15m Homepage  - Genres Comedy Keywords nordic christmas calendar Content Score 56 We're so close, yet so far. Top Contributors k 13 klaus_kaag 11 BryGur 2 Banana 2 Mads  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}