{"link": "https://www.themoviedb.org/tv/76443?language=en", "title": "Malkin", "resume": "“Malkin” is a story which narrates some of the evil traits of a human being like selfishness, greediness and being heartless towards other people. A woman can destroy a happily living family just for the sake of her own interest and desires.\nThis play revolves around the wolfish character Gulnaz (Maria Wasti), whose integrity and loyalty is pretty doubtful. She ties the knot with an unprincipled guy Yawar (Alyy Khan), he himself do nothing but spending an extravagant life just because he was born in a rich family. When Yawar introduces his wife to his mother Nafeesa Begum (Samina Ahmed), she rejects her and lawfully transfers all her property and assets to younger Son and his Wife.\nGulnaz, who is diabolic in nature, somehow manages to stay in Yawar’s mansion and she starts making scheme against other fellows. She wants to rule the house by hook or by crook and for her supremacy she can go any low. She destroys the happy life of her brother-in-law and sister-in-law to be able to hold all the property.", "rate": 70, "genre": ["Drama"], "cast": ["Samina Ahmed", "Natasha Ali", "Maria Wasti", "Alyy Khan"], "character": ["Nafisa", "Bisma", "Gulnaz", "Yawer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76443   Expand Malkin   (2017) User Score Overview “Malkin” is a story which narrates some of the evil traits of a human being like selfishness, greediness and being heartless towards other people. A woman can destroy a happily living family just for the sake of her own interest and desires. This play revolves around the wolfish character Gulnaz (Maria Wasti), whose integrity and loyalty is pretty doubtful. She ties the knot with an unprincipled guy Yawar (Alyy Khan), he himself do nothing but spending an extravagant life just because he was born in a rich family. When Yawar introduces his wife to his mother Nafeesa Begum (Samina Ahmed), she rejects her and lawfully transfers all her property and assets to younger Son and his Wife. Gulnaz, who is diabolic in nature, somehow manages to stay in Yawar’s mansion and she starts making scheme against other fellows. She wants to rule the house by hook or by crook and for her supremacy she can go any low. She destroys the happy life of her brother-in-law and sister-in-law to be able to hold all the property. Featured Crew Aijaz Aslam Creator Syed Wajahat Hussain Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samina Ahmed Nafisa Natasha Ali Bisma Maria Wasti Gulnaz Alyy Khan Yawer Full Cast & Crew Current Season Season 1 2017 | 2 Episodes Season 1 of Malkin premiered on October  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Malkin. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Geo Entertainment Certification  - Type  Scripted Original Language  English Runtime  37m Homepage  - Genres Drama Keywords family drama Content Score 100 Yes! Looking good! Top Contributors c 26 crackme  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}