{"link": "https://www.themoviedb.org/tv/3900?language=en", "title": "Underground Ernie", "resume": "Underground Ernie is a Computer-animated children's television series produced by Joella Productions in the UK and shown by the BBC on both CBeebies and BBC Two. It is set in International Station, a fictional worldwide underground network, and focuses on the everyday adventures of Ernie, a friendly Underground supervisor, Millie, his multilingual colleague and Mr Rails the lovable maintenance man. The locomotives under Ernie's watchful eye all have characters of their own. There is Bakerloo, Victoria, Circle, Jubilee and the twins, Hammersmith & City. From time to time they are joined by their friends from across the world including; Paris, Brooklyn, Moscow, Sydney and Osaka.\nThe show is aimed at children between the ages of 3 and 8 years old. The initial series has 26 episodes each lasting 12 mins. Its first showing on was on Monday 5 June 2006 on CBeebies.\nThe Producers of the show 'Joella Productions' are currently trying to raise money to get another series of 'Underground Ernie' created. The Production costs for a series is £4 million.", "rate": 40, "genre": ["Animation"], "cast": ["Emma Weaver", "Tim Whitnall", "Gary Lineker", "Janet Brown"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3900   Expand Underground Ernie   (2006) User Score Overview Underground Ernie is a Computer-animated children's television series produced by Joella Productions in the UK and shown by the BBC on both CBeebies and BBC Two. It is set in International Station, a fictional worldwide underground network, and focuses on the everyday adventures of Ernie, a friendly Underground supervisor, Millie, his multilingual colleague and Mr Rails the lovable maintenance man. The locomotives under Ernie's watchful eye all have characters of their own. There is Bakerloo, Victoria, Circle, Jubilee and the twins, Hammersmith & City. From time to time they are joined by their friends from across the world including; Paris, Brooklyn, Moscow, Sydney and Osaka. The show is aimed at children between the ages of 3 and 8 years old. The initial series has 26 episodes each lasting 12 mins. Its first showing on was on Monday 5 June 2006 on CBeebies. The Producers of the show 'Joella Productions' are currently trying to raise money to get another series of 'Underground Ernie' created. The Production costs for a series is £4 million. Featured Crew John Deery Creator Sid Rainey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Emma Weaver Tim Whitnall Gary Lineker Janet Brown Full Cast & Crew Last Season Season 1 2006 | 24 Episodes Season 1 of Underground Ernie premiered on June  5, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Underground Ernie. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  12m, 15m Homepage   http://www.undergroundernie.com/ Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}