{"link": "https://www.themoviedb.org/tv/67433?language=en", "title": "Ozzy and Jack's World Detour", "resume": "The self-proclaimed history nerds hit the road in a father-son journey they've waited years to take. No roadies, no tour buses and no boundaries - just a bucket list of iconic and historically significant spots that includes Mt. Rushmore, Stonehenge, The Alamo, Roswell, The Jamestown Settlement and Sun Studios and a hit list of some fascinating sights and people that they've read about. From a Cold War era Missile Silo to Bletchley Park; from gold miner Rattlesnake Randy's stream of dreams to vintage tank collector Allan Cors' private museum of working war machines, Ozzy and Jack get their eyes and hands on history.", "rate": 55, "genre": ["Reality"], "cast": ["Ozzy Osbourne", "Jack Osbourne"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67433   Expand Ozzy and Jack's World Detour   (2016) User Score  Play Trailer Overview The self-proclaimed history nerds hit the road in a father-son journey they've waited years to take. No roadies, no tour buses and no boundaries - just a bucket list of iconic and historically significant spots that includes Mt. Rushmore, Stonehenge, The Alamo, Roswell, The Jamestown Settlement and Sun Studios and a hit list of some fascinating sights and people that they've read about. From a Cold War era Missile Silo to Bletchley Park; from gold miner Rattlesnake Randy's stream of dreams to vintage tank collector Allan Cors' private museum of working war machines, Ozzy and Jack get their eyes and hands on history. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  1 Clips  2 Featurettes  0 Opening Credits  0 Top Billed Cast Ozzy Osbourne Jack Osbourne Full Cast & Crew Current Season Season 3 2018 | 3 Episodes Season 3 of Ozzy and Jack's World Detour premiered on June 13, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  4 Backdrops  5 Posters  3 Recommendations   2000-01-14 Trigger Happy TV 7.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage   http://www.history.com/shows/ozzy-and-jacks-world-detour Genres Reality Keywords road trip strange places Content Score 64 We're so close, yet so far. Top Contributors S 44 SALL 30 Elizabeth Jennings TB 6 TMDb Bot MP 4 Mr. Peanutbutter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}