{"link": "https://www.themoviedb.org/tv/12029?language=en", "title": "The Forest Rangers", "resume": "The Forest Rangers was a Canadian television series that ran from 1963 to 1965. It was a co-production between CBC Television and ITC Entertainment and was Canada's first television show produced in colour. Executive producer Maxine Samuels founded the show.\nThe series ran for three seasons, a total of 104 30-minute colour episodes. Early episodes of the series were broadcast in serialized form as part of a CBC children's series entitled Razzle Dazzle, hosted by Alan Hamel and Michelle Finney.\nThis was the first appearance in a major series by Gordon Pinsent. He left the series in 1965 to star in Quentin Durgens, M.P.\nIn June 2004, there was a reunion for ex-cast and fans just south of Kleinburg, where the show was originally filmed. Six of the ex-junior rangers appeared and Peter Tully flew in from his home in Ireland. Another reunion occurred June 15, 2013 at the actual studios where the show was filmed. This time nine junior rangers and Gordon Pinsent were in attendance.\nThe show's first season was released on DVD by Imavision in early 2007.", "rate": 0, "genre": ["Drama", "Action", "Adventure"], "cast": ["Gordon Pinsent", "Rex Hagon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12029   Expand The Forest Rangers User Score Overview The Forest Rangers was a Canadian television series that ran from 1963 to 1965. It was a co-production between CBC Television and ITC Entertainment and was Canada's first television show produced in colour. Executive producer Maxine Samuels founded the show. The series ran for three seasons, a total of 104 30-minute colour episodes. Early episodes of the series were broadcast in serialized form as part of a CBC children's series entitled Razzle Dazzle, hosted by Alan Hamel and Michelle Finney. This was the first appearance in a major series by Gordon Pinsent. He left the series in 1965 to star in Quentin Durgens, M.P. In June 2004, there was a reunion for ex-cast and fans just south of Kleinburg, where the show was originally filmed. Six of the ex-junior rangers appeared and Peter Tully flew in from his home in Ireland. Another reunion occurred June 15, 2013 at the actual studios where the show was filmed. This time nine junior rangers and Gordon Pinsent were in attendance. The show's first season was released on DVD by Imavision in early 2007. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gordon Pinsent Rex Hagon Full Cast & Crew Last Season Forest rangers season 3 — | 33 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Action & Adventure Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 2 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}