{"link": "https://www.themoviedb.org/tv/42301?language=en", "title": "The Ultimate Fighter: Brazil", "resume": "The Ultimate Fighter: Brazil is an installment of the Ultimate Fighting Championship-produced reality television series The Ultimate Fighter. This season marked the first time the show was filmed, in its entirety, outside of Las Vegas, Nevada, and consisted of 12 episodes and a live finale in Brazil. The season tournament finale appeared on pay-per-view in June 2012. It started filming in February 2012 and was in Portuguese. The season was produced by Floresta, a Brazilian production company, and aired in Brazil on Globo. Each episode was broadcast over the Internet at TUF.tv each Sunday night and later aired on Fuel TV in a marathon leading up to the finale.\nOn December 13, 2011, during the pre-UFC 142 press conference, Dana White announced that the coaches for the season would be Vitor Belfort and Wanderlei Silva. Belfort still faced and defeated Anthony Johnson at UFC 142. This was a departure from past seasons where following the coaches announcement the coaches did not compete against other fighters until facing each other after the conclusion of that season of The Ultimate Fighter.\nThe UFC held open tryouts on December 14, 2011. The casting call was for Lightweight and Middleweight fighters who are at least 21 years old and have a minimum of two wins in three professional fights. Of those who applied for the tryouts the UFC invited 350 fighters to participate. The fighters in the season were from the Featherweight and Middleweight weight classes.", "rate": 0, "genre": [], "cast": ["Dana White", "Wanderlei Silva", "Vitor Belfort"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42301   Expand The Ultimate Fighter: Brazil   (2012) User Score Overview The Ultimate Fighter: Brazil is an installment of the Ultimate Fighting Championship-produced reality television series The Ultimate Fighter. This season marked the first time the show was filmed, in its entirety, outside of Las Vegas, Nevada, and consisted of 12 episodes and a live finale in Brazil. The season tournament finale appeared on pay-per-view in June 2012. It started filming in February 2012 and was in Portuguese. The season was produced by Floresta, a Brazilian production company, and aired in Brazil on Globo. Each episode was broadcast over the Internet at TUF.tv each Sunday night and later aired on Fuel TV in a marathon leading up to the finale. On December 13, 2011, during the pre-UFC 142 press conference, Dana White announced that the coaches for the season would be Vitor Belfort and Wanderlei Silva. Belfort still faced and defeated Anthony Johnson at UFC 142. This was a departure from past seasons where following the coaches announcement the coaches did not compete against other fighters until facing each other after the conclusion of that season of The Ultimate Fighter. The UFC held open tryouts on December 14, 2011. The casting call was for Lightweight and Middleweight fighters who are at least 21 years old and have a minimum of two wins in three professional fights. Of those who applied for the tryouts the UFC invited 350 fighters to participate. The fighters in the season were from the Featherweight and Middleweight weight classes. Featured Crew Frank Fertitta III Creator Dana White Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dana White Wanderlei Silva Vitor Belfort Full Cast & Crew Last Season Season 2 2013 | 2 Episodes Season 2 of The Ultimate Fighter: Brazil premiered on March 17, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Ultimate Fighter: Brazil. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors a 3 antrrax 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}