{"link": "https://www.themoviedb.org/tv/2099?language=en", "title": "Kenny the Shark", "resume": "Kenny the Shark is an animated television series produced by Discovery Kids. The show premiered on NBC's Discovery Kids on NBC from November 1, 2003 and ended February 18, 2006 with two seasons and 26 episodes having been shown. The series continued to run on Discovery Kids until the network changed into The Hub on October 10, 2010. Discovery Kids closed with a 4 hour marathon of Kenny the Shark episodes. Despite the closure, it still aired on The Hub until March 25, 2012.\nIt is about an anthropomorphic tiger shark named Kenny that decides to move out of the ocean. He was the protagonist and main character in the series.\nThis was not Kenny's first appearance, however. In the late-1990s, a series of shorts ran between regular programming. Kenny was not seen, as the camera was from his point of view. A contest was held to guess what kind of shark Kenny was with the result being a tiger shark.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Rob Bartlett", "Kelli Rabke", "Jim Conroy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2099   Expand Kenny the Shark   (2003) User Score Overview Kenny the Shark is an animated television series produced by Discovery Kids. The show premiered on NBC's Discovery Kids on NBC from November 1, 2003 and ended February 18, 2006 with two seasons and 26 episodes having been shown. The series continued to run on Discovery Kids until the network changed into The Hub on October 10, 2010. Discovery Kids closed with a 4 hour marathon of Kenny the Shark episodes. Despite the closure, it still aired on The Hub until March 25, 2012. It is about an anthropomorphic tiger shark named Kenny that decides to move out of the ocean. He was the protagonist and main character in the series. This was not Kenny's first appearance, however. In the late-1990s, a series of shorts ran between regular programming. Kenny was not seen, as the camera was from his point of view. A contest was held to guess what kind of shark Kenny was with the result being a tiger shark. Featured Crew Jim Jinkins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Bartlett Kelli Rabke Jim Conroy Full Cast & Crew Last Season Season 2 2004 | 13 Episodes Season 2 of Kenny the Shark premiered on October  2, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Kenny the Shark. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords shark Content Score 64 We're so close, yet so far. Top Contributors 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}