{"link": "https://www.themoviedb.org/tv/62251?language=en", "title": "Tyler Perry's If Loving You Is Wrong", "resume": "Follow the relationships of a group of husbands and wives that live and love on the same street. While the neighbors come from very different backgrounds, their lives are similar – raising children, dealing with exes, worrying about money and keeping romance in their relationships. But just below the surface — secrets, lies and deception threaten to destroy what they have built.", "rate": 68, "genre": ["Soap", "Drama"], "cast": ["April Parker-Jones", "Aiden Turner", "Charles Malik Whitfield", "Amanda Clayton", "Edwina Findley Dickerson"], "character": ["Natalie", "Brad", "Lushion", "Alex", "Kelly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62251   Expand Tyler Perry's If Loving You Is Wrong   (2014) User Score  Play Trailer Overview Follow the relationships of a group of husbands and wives that live and love on the same street. While the neighbors come from very different backgrounds, their lives are similar – raising children, dealing with exes, worrying about money and keeping romance in their relationships. But just below the surface — secrets, lies and deception threaten to destroy what they have built. Featured Crew Tyler Perry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  6 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast April Parker-Jones Natalie Aiden Turner Brad Charles Malik Whitfield Lushion Amanda Clayton Alex Edwina Findley Dickerson Kelly Full Cast & Crew Last Season Original Air Date Original Air Date Current (Original Air Date) Erroneous (Original Air Date) Season 4 2017 | 18 Episodes Season 4 of Tyler Perry's If Loving You Is Wrong premiered on September 19, 2017. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Kelly and Esperanza's super tight clothes Open 4 by  IveGotASecret So, whose Marcy's baby daddy? Open 4 by  IveGotASecret Stopped watching last season and didn't miss a thing Open 2 by  IveGotASecret Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2008-03-04 The Real Housewives of New York City 5.0    2005-04-12 Deadliest Catch 6.6    2005-06-13 The Closer 7.0    2016-06-14 Animal Kingdom 6.7  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.oprah.com/app/if-loving-you-is-wrong.html Genres Soap Drama Keywords marriage married life Content Score 100 Yes! Looking good! Top Contributors 53 Banana t 23 tmdb98495582 16 Elizabeth Jennings b 10 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}