{"link": "https://www.themoviedb.org/tv/44178?language=en", "title": "Buck Rogers", "resume": "A pilot and his young passenger crash-land on a mountaintop and are put into suspended animation by a strange gas. They awake 500 years later to discover that the Earth is now ruled by a tyrannical despot called Killer Kane, and they lead a fight to overthrow him.", "rate": 0, "genre": ["Family", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Buster Crabbe", "Anthony Warde", "C. Montague Shaw", "Constance Moore", "Jack Mulhall"], "character": ["Buck Rogers", "Killer Kane", "Prof. Huer", "Wilma Deering", "Capt. Rankin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44178   Expand Buck Rogers   (1939) User Score Overview A pilot and his young passenger crash-land on a mountaintop and are put into suspended animation by a strange gas. They awake 500 years later to discover that the Earth is now ruled by a tyrannical despot called Killer Kane, and they lead a fight to overthrow him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Buster Crabbe Buck Rogers Anthony Warde Killer Kane C. Montague Shaw Prof. Huer Constance Moore Wilma Deering Jack Mulhall Capt. Rankin Full Cast & Crew Last Season Season 1 1939 | 12 Episodes Season 1 of Buck Rogers premiered on April 11, 1939. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Buck Rogers. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  200m Homepage  - Genres Family Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors R 18 Rebecca 1 Elizabeth Jennings C 1 CaptainBarnius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}