{"link": "https://www.themoviedb.org/tv/16656?language=en", "title": "Фитиль", "resume": "Fitil is a popular Soviet/Russian television satirical/comedy short film series which ran for about 500 episodes. Some of the episodes were aimed at children, and were called Фитилёк, Fitilyok, Little Fuse. Each issue contained from the few short segments: documentary, fictional and animated ones. Directed by various artists, including Leonid Gaidai who presented his famous trio of Nikulin, Vitsin and Morgunov into the cast. It was called in USSR as \"the anecdotes from the Soviet government\".", "rate": 55, "genre": ["Comedy", "Documentary", "Animation", "Family"], "cast": ["Olga Aroseva", "Georgi Burkov", "Rolan Bykov", "Lev Durov", "Igor Ilyinsky"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16656   Expand Фитиль   (1962) User Score Overview Fitil is a popular Soviet/Russian television satirical/comedy short film series which ran for about 500 episodes. Some of the episodes were aimed at children, and were called Фитилёк, Fitilyok, Little Fuse. Each issue contained from the few short segments: documentary, fictional and animated ones. Directed by various artists, including Leonid Gaidai who presented his famous trio of Nikulin, Vitsin and Morgunov into the cast. It was called in USSR as \"the anecdotes from the Soviet government\". Featured Crew Sergei Mikhalkov Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Olga Aroseva Georgi Burkov Rolan Bykov Lev Durov Igor Ilyinsky Full Cast & Crew Last Season Season 54 1966 | 4 Episodes Season 54 of Фитиль premiered on December  1, 1966. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Фитиль. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 12+ Meaning Only kids the age of 12 or older can watch. Type  Scripted Original Language  Russian Runtime  36420m Homepage   http://fitill.ru/ Genres Comedy Documentary Animation Family Keywords satirical Content Score 100 Yes! Looking good! Top Contributors n 206 navarro2018 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}