{"link": "https://www.themoviedb.org/tv/68920?language=en", "title": "Our Fascinating Planet", "resume": "From renowned author, educator and television presenter Ted Rimmarniet comes \"Our Fascinating Planet\", an exciting new educational series that explores our Universe and ourselves - and our place in both of those things. Featuring episodes on Space, Energy, The Brain and The Earth, this staggeringly monumental series contains all of the passion, wonder and curiosity of award-winning programs like “NOVA\" but with double or triple the amount of fascinatingness.", "rate": 100, "genre": ["Comedy", "Documentary", "Sci-Fi", "Fantasy"], "cast": ["Demetri Martin", "Al Madrigal", "Charlyne Yi", "Kate Berlant", "Ron Funches"], "character": ["Ted Rimmarniet", "Gore Muskhope", "Esther Plumb"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68920   Expand Our Fascinating Planet   (2016) User Score  Play Trailer Overview From renowned author, educator and television presenter Ted Rimmarniet comes \"Our Fascinating Planet\", an exciting new educational series that explores our Universe and ourselves - and our place in both of those things. Featuring episodes on Space, Energy, The Brain and The Earth, this staggeringly monumental series contains all of the passion, wonder and curiosity of award-winning programs like “NOVA\" but with double or triple the amount of fascinatingness. Featured Crew Demetri Martin Creator Funny Or Die Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Demetri Martin Ted Rimmarniet Al Madrigal Gore Muskhope Charlyne Yi Esther Plumb Kate Berlant Ron Funches Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Our Fascinating Planet premiered on September 20, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Our Fascinating Planet. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  9m Homepage   https://www.go90.com/profiles/series_6434fb00c14a41e4a4ab7b65e3839003 Genres Comedy Documentary Sci-Fi & Fantasy Keywords brain parody science fiction space spoof science sci-fi comedy cosmos nova Content Score 100 Yes! Looking good! Top Contributors 43 Jeremy Outinen m 2 micaela.ara 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}