{"link": "https://www.themoviedb.org/tv/33286?language=en", "title": "Cops L.A.C.", "resume": "Cops L.A.C. is a 2010 Australian television police drama, which screened on the Nine Network. The series followed the work of officers at the Seaview Local Area Command, a fictitious police response area of the 'State Police' set in harbourside Sydney, New South Wales. The first series premiered on 2 September 2010, in the same timeslot of Network Ten's police drama Rush.\nOn 22 November 2010, the Nine Network cancelled the show due to the high production costs.", "rate": 0, "genre": ["Drama"], "cast": ["Martin Dingle-Wall", "Kate Ritchie", "Gary Sweet", "Roy Billing", "Ria Vandervis"], "character": ["Rhys Llewellyn", "Samantha Cooper", "Jack Finch", "Graeme Sinclair", "Roxanne Perez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33286   Expand Cops L.A.C.   (2010) User Score Overview Cops L.A.C. is a 2010 Australian television police drama, which screened on the Nine Network. The series followed the work of officers at the Seaview Local Area Command, a fictitious police response area of the 'State Police' set in harbourside Sydney, New South Wales. The first series premiered on 2 September 2010, in the same timeslot of Network Ten's police drama Rush. On 22 November 2010, the Nine Network cancelled the show due to the high production costs. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Dingle-Wall Rhys Llewellyn Kate Ritchie Samantha Cooper Gary Sweet Jack Finch Roy Billing Graeme Sinclair Ria Vandervis Roxanne Perez Full Cast & Crew Last Season Season 1 2010 | 13 Episodes Season 1 of Cops L.A.C. premiered on September  2, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cops L.A.C.. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords sydney police police detective Content Score 86 Almost there... Top Contributors 12 lineker 10 Banana 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}