{"link": "https://www.themoviedb.org/tv/11573?language=en", "title": "Blue Thunder", "resume": "Blue Thunder is a 1984 ABC television series based on the movie of the same title featuring the Blue Thunder helicopter.\nThe series uses the converted Aérospatiale Gazelle helicopter and large portions of stock footage from the 1983 film. A ground unit named \"Rolling Thunder\" backed up the helicopter in the television series. This was a large support van with a desert camouflage off-road vehicle stored inside.\nThe television series cast includes James Farentino, Dana Carvey, and former professional American football players Bubba Smith and Dick Butkus. The series was canceled by ABC after they felt the similar Airwolf on CBS would win the ratings battle. Also, the series aired at the same time as the CBS soap opera Dallas on Friday nights, and lost.\nEleven episodes were made before the series was cancelled.", "rate": 66, "genre": ["Action", "Adventure"], "cast": ["Dick Butkus", "Dana Carvey", "James Farentino", "Bubba Smith", "Sandy McPeak"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11573   Expand Blue Thunder   (1984) User Score  Play Trailer Overview Blue Thunder is a 1984 ABC television series based on the movie of the same title featuring the Blue Thunder helicopter. The series uses the converted Aérospatiale Gazelle helicopter and large portions of stock footage from the 1983 film. A ground unit named \"Rolling Thunder\" backed up the helicopter in the television series. This was a large support van with a desert camouflage off-road vehicle stored inside. The television series cast includes James Farentino, Dana Carvey, and former professional American football players Bubba Smith and Dick Butkus. The series was canceled by ABC after they felt the similar Airwolf on CBS would win the ratings battle. Also, the series aired at the same time as the CBS soap opera Dallas on Friday nights, and lost. Eleven episodes were made before the series was cancelled. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dick Butkus Dana Carvey James Farentino Bubba Smith Sandy McPeak Full Cast & Crew Last Season Season 1 1984 | 11 Episodes Season 1 of Blue Thunder premiered on January  6, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1974-09-07 Hong Kong Phooey 6.1    1968-09-14 Wacky Races 7.1    1979-09-22 Hart to Hart 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors c 5 cemmec w 3 webmaster i 3 ismax935 d 2 dandy02  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}