{"link": "https://www.themoviedb.org/tv/38808?language=en", "title": "Les Lavigueur, la vraie histoire", "resume": "On April 1st, 1986, Jean-Guy Lavigueur, an unemployed blue-collar worker and his family won 7.6 million dollars. At the time, it was the largest amount ever won at Loto-Quebec's 6/49 weekly draws. What should have been the beginning of a fairytale for the family turned rapidly into a nightmare...", "rate": 0, "genre": ["Drama"], "cast": ["Pierre Verville", "Patrice Bélanger", "Amélie Grenier", "Sophie Cadieux", "Laurence Leboeuf"], "character": ["Jean-Guy Lavigueur", "Yve Lavigueur", "Micheline Daudelin Lavigueur", "Sylvie Lavigueur", "Louise Lavigueur"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38808   Expand Les Lavigueur, la vraie histoire   (2008) User Score Overview On April 1st, 1986, Jean-Guy Lavigueur, an unemployed blue-collar worker and his family won 7.6 million dollars. At the time, it was the largest amount ever won at Loto-Quebec's 6/49 weekly draws. What should have been the beginning of a fairytale for the family turned rapidly into a nightmare...  Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pierre Verville Jean-Guy Lavigueur Patrice Bélanger Yve Lavigueur Amélie Grenier Micheline Daudelin Lavigueur Sophie Cadieux Sylvie Lavigueur Laurence Leboeuf Louise Lavigueur Full Cast & Crew Last Season Season 1 2008 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Les Lavigueur, la vraie histoire. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords quebec miniseries sudden wealth winning lottery Content Score 86 Almost there... Top Contributors 20 Banana M 2 MarioCine x 1 xblitz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}