{"link": "https://www.themoviedb.org/tv/14079?language=en", "title": "Destry", "resume": "Destry is a Western television series starring John Gavin that aired on the ABC television network from February 14, 1964 until May 8, 1964. Destry was based on the classic James Stewart Western, Destry Rides Again, and a subsequent remake, Destry, starring Audie Murphy.\nIn the original films, the main character was Tom Destry, a Western lawman who was a crack shot, but who preferred non-violent solutions to problems with outlaws. In the television series, Gavin played Harrison Destry, son of Tom, who had himself been a lawman until he was framed for a crime and sent to prison. The show followed Harrison Destry upon his release from prison as he wandered the West looking for the people that framed him. Just like the feature films, many comedic situations arose because Destry went to great lengths to avoid violence even though he was always running into trouble.\nDestry never caught on with television audiences, especially since the popularity of the Western genre had begun to wane, and the series only lasted for thirteen episodes.\nAmong the guest stars were Chris Alcaide, Ron Hayes, Roger Mobley, Stuart Randall, and Barbara Stuart.", "rate": 0, "genre": ["Western"], "cast": ["John Gavin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14079   Expand Destry   (1964) User Score Overview Destry is a Western television series starring John Gavin that aired on the ABC television network from February 14, 1964 until May 8, 1964. Destry was based on the classic James Stewart Western, Destry Rides Again, and a subsequent remake, Destry, starring Audie Murphy. In the original films, the main character was Tom Destry, a Western lawman who was a crack shot, but who preferred non-violent solutions to problems with outlaws. In the television series, Gavin played Harrison Destry, son of Tom, who had himself been a lawman until he was framed for a crime and sent to prison. The show followed Harrison Destry upon his release from prison as he wandered the West looking for the people that framed him. Just like the feature films, many comedic situations arose because Destry went to great lengths to avoid violence even though he was always running into trouble. Destry never caught on with television audiences, especially since the popularity of the Western genre had begun to wane, and the series only lasted for thirteen episodes. Among the guest stars were Chris Alcaide, Ron Hayes, Roger Mobley, Stuart Randall, and Barbara Stuart. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Gavin Full Cast & Crew Last Season Season 1 1964 | 13 Episodes Season 1 of Destry premiered on February 14, 1964. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Destry. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Western Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors S 1 Scotman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}