{"link": "https://www.themoviedb.org/tv/44169?language=en", "title": "Brickleberry", "resume": "Brickleberry National Park is facing closure, but not if the park’s dysfunctional park rangers can help it!\n“Brickleberry,” an animated half-hour series, follows the crazy bunch of park rangers as they do their worst to keep the park running. Steve (David Herman) has been “Ranger of the Month” every month for years, so he feels threatened when Ethel (Natasha Leggero) is transferred from Yellowstone National Park to help whip the park into shape. Connie (Roger Black) and Denzel (Jerry Minor) are two unique rangers that each bring special skills (or in Denzel’s case, lack of skills) to the job, and Woody (Tom Kenny) is the hapless Head Ranger who puts nothing above his beloved park, except his adopted bear cub, Malloy (Daniel Tosh), who he’s taken in and spoils to death.", "rate": 71, "genre": ["Animation", "Comedy"], "cast": ["David Herman", "Daniel Tosh", "Roger Black", "Natasha Leggero", "Tom Kenny"], "character": ["Steve Williams (voice)", "Malloy (voice)", "Connie Cunaman (voice)", "Ethel Anderson (voice)", "Woodrow 'Woody' Johnson (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44169   Expand Brickleberry   (2012) User Score  Play Trailer Overview Brickleberry National Park is facing closure, but not if the park’s dysfunctional park rangers can help it! “Brickleberry,” an animated half-hour series, follows the crazy bunch of park rangers as they do their worst to keep the park running. Steve (David Herman) has been “Ranger of the Month” every month for years, so he feels threatened when Ethel (Natasha Leggero) is transferred from Yellowstone National Park to help whip the park into shape. Connie (Roger Black) and Denzel (Jerry Minor) are two unique rangers that each bring special skills (or in Denzel’s case, lack of skills) to the job, and Woody (Tom Kenny) is the hapless Head Ranger who puts nothing above his beloved park, except his adopted bear cub, Malloy (Daniel Tosh), who he’s taken in and spoils to death. Featured Crew Roger Black Creator Waco O'Guin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Herman Steve Williams (voice) Daniel Tosh Malloy (voice) Roger Black Connie Cunaman (voice) Natasha Leggero Ethel Anderson (voice) Tom Kenny Woodrow 'Woody' Johnson (voice) Full Cast & Crew Last Season Season 3 2014 | 13 Episodes Season 3 of Brickleberry premiered on September 16, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Brickleberry. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2010-03-17 Ugly Americans 6.9    2012-01-19 Unsupervised 6.6    2004-10-27 Drawn Together 6.9    2015-12-18 F is for Family 6.8    2009-09-27 The Cleveland Show 5.2    2014-08-22 BoJack Horseman 8.0    2005-11-06 The Boondocks 7.7    1994-12-19 The Head 7.3  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cc.com/shows/brickleberry Genres Animation Comedy Keywords national park park ranger adult animation Content Score 100 Yes! Looking good! Top Contributors 54 BudsieBuds 13 Banana 11 NEOhidra 8 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}