{"link": "https://www.themoviedb.org/tv/10421?language=en", "title": "Alf Tales", "resume": "ALF Tales is an animated American series that ran on the NBC television network on Saturdays from August 1988 to December 1989. The show was a spinoff from the series ALF: The Animated Series. The show had characters from that series play various characters from fairy tales. The fairy tale was usually altered for comedic effect in a manner relational to Fractured Fairy Tales.\nEach story typically spoofs a film genre, such as the \"Cinderella\" episode done as an Elvis movie. Some episodes featured a \"fourth wall\" effect where ALF is backstage preparing for the episode, and Rob Cowan would appear drawn as a TV executive to try to brief ALF on how to improve this episode. For instance Cowan once told ALF who was readying for a medieval themed episode that \"less than 2% of our audience lives in the Dark Ages\".", "rate": 0, "genre": ["Comedy", "Animation", "Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10421   Expand Alf Tales   (1988) User Score Overview ALF Tales is an animated American series that ran on the NBC television network on Saturdays from August 1988 to December 1989. The show was a spinoff from the series ALF: The Animated Series. The show had characters from that series play various characters from fairy tales. The fairy tale was usually altered for comedic effect in a manner relational to Fractured Fairy Tales. Each story typically spoofs a film genre, such as the \"Cinderella\" episode done as an Elvis movie. Some episodes featured a \"fourth wall\" effect where ALF is backstage preparing for the episode, and Rob Cowan would appear drawn as a TV executive to try to brief ALF on how to improve this episode. For instance Cowan once told ALF who was readying for a medieval themed episode that \"less than 2% of our audience lives in the Dark Ages\". Featured Crew Paul Fusco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 1989 | 8 Episodes Season 2 of Alf Tales premiered on September 16, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Alf Tales. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Animation Family Keywords fairy tale alien alf Content Score 64 We're so close, yet so far. Top Contributors 30 Banana 2 BlackDelivery w 1 whitetigerx8 1 MaxdMerc  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}