{"link": "https://www.themoviedb.org/tv/64491?language=en", "title": "Andrija and Andjelka", "resume": "Andrija i Andjelka , a couple in their mid thirties, are a typical example of what happens when a man and woman live together. Although they are sincerely love each other, they often get on each others nerves, whether in the bedroom, a supermarket or a dinner with friends.", "rate": 80, "genre": ["Comedy"], "cast": ["Andjelka Prpic", "Andrija Milošević"], "character": ["Andjelka", "Andrija"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64491   Expand Andrija and Andjelka User Score Overview Andrija i Andjelka , a couple in their mid thirties, are a typical example of what happens when a man and woman live together. Although they are sincerely love each other, they often get on each others nerves, whether in the bedroom, a supermarket or a dinner with friends. Featured Crew Guy A. Lepage Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Andjelka Prpic Andjelka Andrija Milošević Andrija Full Cast & Crew Last Season Season 1 — | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Facts Original Name  Andrija i Andjelka Status  Returning Series Network Certification  - Type  Scripted Original Language  Serbian Runtime  30m Homepage   www.andrijaiandjelka.com Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors a 18 agentsmith u 8 uriyah92 6 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}