{"link": "https://www.themoviedb.org/tv/404?language=en", "title": "Fimbles", "resume": "Fimbles is a British television programme designed for pre-school children. The Fimbles are Fimbo, Florrie and Baby Pom, who all live in a bright, lush and colourful place called Fimble Valley. Fimbles is produced by Novel Entertainment who created the characters. These Fimbles are magical.\nThe snouted and concentrically-ringed appearance of the Fimbles was based on the eponymous villains of Lucy Anna and the Finders, written and illustrated by Sarah Hayes. Although Hayes is cited in the credits of Fimbles, and she was involved in adapting the characters for the television series, the implacably omnivorous Finders have nothing else in common with the Fimbles.\nThe scripts of the 200 episodes were written by a number of writers, most notably the programme's producer Lucinda Whiteley. The Fimbles are cuddly, hippo like creatures and are portrayed by 'skin' actors in complex, fluffy animatronic suits and all look quite similar apart from their colour and size. Fimbo is yellow with green stripes, is the tallest and likes to eat Crumble Crackers, Florrie is turquoise with purple stripes, a little smaller than Fimbo and is often seen carrying a Fimble-like doll called Little One, and Baby Pom is the smallest, pink with green stripes and generally follows the others like a toddler, whilst pushing her Trundle Truck. Other characters, which are essentially large scale puppets, are a blue tree frog called Rockit, a purple and green striped mole called Roly Mo, a plump and motherly pink bird called Bessie, and Bessie's chick, Ribble. Originally Ribble was an almost featureless squeaking blob of orange fur with a beak; more recently he has also had eyes.", "rate": 0, "genre": [], "cast": ["Kate Harbour", "Samantha Dodd", "Wayne Forester", "Shelley Longworth"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 404   Expand Fimbles   (2002) User Score Overview Fimbles is a British television programme designed for pre-school children. The Fimbles are Fimbo, Florrie and Baby Pom, who all live in a bright, lush and colourful place called Fimble Valley. Fimbles is produced by Novel Entertainment who created the characters. These Fimbles are magical. The snouted and concentrically-ringed appearance of the Fimbles was based on the eponymous villains of Lucy Anna and the Finders, written and illustrated by Sarah Hayes. Although Hayes is cited in the credits of Fimbles, and she was involved in adapting the characters for the television series, the implacably omnivorous Finders have nothing else in common with the Fimbles. The scripts of the 200 episodes were written by a number of writers, most notably the programme's producer Lucinda Whiteley. The Fimbles are cuddly, hippo like creatures and are portrayed by 'skin' actors in complex, fluffy animatronic suits and all look quite similar apart from their colour and size. Fimbo is yellow with green stripes, is the tallest and likes to eat Crumble Crackers, Florrie is turquoise with purple stripes, a little smaller than Fimbo and is often seen carrying a Fimble-like doll called Little One, and Baby Pom is the smallest, pink with green stripes and generally follows the others like a toddler, whilst pushing her Trundle Truck. Other characters, which are essentially large scale puppets, are a blue tree frog called Rockit, a purple and green striped mole called Roly Mo, a plump and motherly pink bird called Bessie, and Bessie's chick, Ribble. Originally Ribble was an almost featureless squeaking blob of orange fur with a beak; more recently he has also had eyes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Harbour Samantha Dodd Wayne Forester Shelley Longworth Full Cast & Crew Last Season Season 1 2002 | 39 Episodes Season 1 of Fimbles premiered on April  2, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fimbles. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  20m Homepage   http://www.bbc.co.uk/cbeebies/fimbles/ CBeebies - Fimbles Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}