{"link": "https://www.themoviedb.org/tv/49887?language=en", "title": "Dila Hanım", "resume": "Dila is a beautiful bride of Barazoglu family. Her life turns upside down when her lovely husband is killed by the older son of the Karadagli family, Riza. Dila swears to take revenge of her husband and swears to kill Riza. She moves out Istanbul and starts to live in a big farm house of her father-in-law in order to exact her vengeance.When Riza meets Dila, he is immediately drowned to her without knowing that she comes from Barazoglu family. At the same time, Dila falls in love with Riza but she does not know that Riza is the killer of her ex-husband.In this story, you will explore the impossible love of two proud persons who come from opposing families. Will Dila learn that Riza is the one who has killed her ex-husband? Will Dila and Riza manage to restrain their love? Will the past be forgotten?", "rate": 80, "genre": ["Drama"], "cast": ["Necip Memili", "Oktay Gürsoy", "Erkan Petekkaya", "Hatice Şendil", "Engin Şenkan"], "character": ["Azer", "Metin", "Rıza", "Dila", "Seyit"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49887   Expand Dila Hanım User Score Overview Dila is a beautiful bride of Barazoglu family. Her life turns upside down when her lovely husband is killed by the older son of the Karadagli family, Riza. Dila swears to take revenge of her husband and swears to kill Riza. She moves out Istanbul and starts to live in a big farm house of her father-in-law in order to exact her vengeance.When Riza meets Dila, he is immediately drowned to her without knowing that she comes from Barazoglu family. At the same time, Dila falls in love with Riza but she does not know that Riza is the killer of her ex-husband.In this story, you will explore the impossible love of two proud persons who come from opposing families. Will Dila learn that Riza is the one who has killed her ex-husband? Will Dila and Riza manage to restrain their love? Will the past be forgotten? Featured Crew Onur Tan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Necip Memili Azer Oktay Gürsoy Metin Erkan Petekkaya Rıza Hatice Şendil Dila Engin Şenkan Seyit Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Facts Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors V 12 Vaine M 11 Mylie e 5 escalepion s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}