{"link": "https://www.themoviedb.org/tv/13890?language=en", "title": "Victory at Sea", "resume": "Victory at Sea is a documentary television series about naval warfare during World War II that was originally broadcast by NBC in the USA in 1952–1953. It was condensed into a film in 1954. Excerpts from the music soundtrack, by Richard Rodgers and Robert Russell Bennett, were re-recorded and sold as record albums. The original TV broadcasts comprised 26 half-hour segments—Sunday afternoons at 3pm in most markets—starting October 26, 1952 and ending May 3, 1953. The series, which won an Emmy award in 1954 as \"best public affairs program\", played an important part in establishing historic \"compilation\" documentaries as a viable television genre.  \nOver 13,000 hours of footage gathered from US, British, German and Japanese navies during World War II were perused in the making of these compelling episodes.", "rate": 55, "genre": ["Documentary", "War", "Politics"], "cast": ["Leonard Graves"], "character": ["Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13890   Expand Victory at Sea   (1952) User Score Overview Victory at Sea is a documentary television series about naval warfare during World War II that was originally broadcast by NBC in the USA in 1952–1953. It was condensed into a film in 1954. Excerpts from the music soundtrack, by Richard Rodgers and Robert Russell Bennett, were re-recorded and sold as record albums. The original TV broadcasts comprised 26 half-hour segments—Sunday afternoons at 3pm in most markets—starting October 26, 1952 and ending May 3, 1953. The series, which won an Emmy award in 1954 as \"best public affairs program\", played an important part in establishing historic \"compilation\" documentaries as a viable television genre.   Over 13,000 hours of footage gathered from US, British, German and Japanese navies during World War II were perused in the making of these compelling episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Leonard Graves Narrator Full Cast & Crew Last Season Season 1 1952 | 26 Episodes Season 1 of Victory at Sea premiered on October 26, 1952. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Victory at Sea. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  30m Homepage  - Genres Documentary War & Politics Keywords world war ii u.s. navy Content Score 56 We're so close, yet so far. Top Contributors 16 Banana JC 4 James Clark  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}