{"link": "https://www.themoviedb.org/tv/17435?language=en", "title": "A Ghost Story for Christmas", "resume": "A Ghost Story for Christmas is a strand of annual British short television films originally broadcast on BBC One from 1971 to 1978, and later revived in 2005 on BBC Four. With one exception, the original instalments are directed by Lawrence Gordon Clark and the films are all shot on 16 mm colour film. The remit behind the series was to provide a television adaptation of a classic ghost story referencing the oral tradition of telling supernatural tales at Christmas.\nEach instalment is a separate adaptation of a short story, ranging from 30 to 50 minutes in duration and each featuring well-known British actors such as Clive Swift, Robert Hardy, Peter Vaughan, Edward Petherbridge and Denholm Elliott in the title roles. The first five are adaptations of ghost stories by M. R. James, the sixth is based on a short story by Charles Dickens and the two final instalments are original screenplays by Clive Exton and John Bowen respectively.\nAn earlier black-and-white 1968 Omnibus adaptation of M.R. James's Whistle and I'll Come to You, directed by Jonathan Miller, is often cited as an influence upon the production of the films, and is sometimes included in the canon. The series was revived by BBC Four in 2005 with a new series of annual adaptations.", "rate": 0, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17435   Expand A Ghost Story for Christmas   (1971) User Score Overview A Ghost Story for Christmas is a strand of annual British short television films originally broadcast on BBC One from 1971 to 1978, and later revived in 2005 on BBC Four. With one exception, the original instalments are directed by Lawrence Gordon Clark and the films are all shot on 16 mm colour film. The remit behind the series was to provide a television adaptation of a classic ghost story referencing the oral tradition of telling supernatural tales at Christmas. Each instalment is a separate adaptation of a short story, ranging from 30 to 50 minutes in duration and each featuring well-known British actors such as Clive Swift, Robert Hardy, Peter Vaughan, Edward Petherbridge and Denholm Elliott in the title roles. The first five are adaptations of ghost stories by M. R. James, the sixth is based on a short story by Charles Dickens and the two final instalments are original screenplays by Clive Exton and John Bowen respectively. An earlier black-and-white 1968 Omnibus adaptation of M.R. James's Whistle and I'll Come to You, directed by Jonathan Miller, is often cited as an influence upon the production of the films, and is sometimes included in the canon. The series was revived by BBC Four in 2005 with a new series of annual adaptations. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1971 | 11 Episodes Season 1 of A Ghost Story for Christmas premiered on December 24, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on A Ghost Story for Christmas. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 2 kcdh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}