{"link": "https://www.themoviedb.org/tv/6527?language=en", "title": "The Circuit", "resume": "The Circuit is an Australian television drama series. The six part first season screened on SBS TV, premiering on 8 July 2007 at 9:30 pm, and concluding on 12 August 2007. Season 2 began airing on 1 December 2009.\nThe series stars Aaron Pedersen and Gary Sweet and centres on mixed-race solicitor Drew Ellis who joins the district to work at the Kimberley Circuit Court. Filmed mainly in Broome, Western Australia and surrounding areas, the show had a budget of more than $4 million, and 1,000 local Aboriginal extras have been employed for the production.", "rate": 0, "genre": ["Drama"], "cast": ["Gary Sweet", "Aaron Pedersen", "Tammy Clarkson", "Nick Simpson-Deeks"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6527   Expand The Circuit   (2007) User Score Overview The Circuit is an Australian television drama series. The six part first season screened on SBS TV, premiering on 8 July 2007 at 9:30 pm, and concluding on 12 August 2007. Season 2 began airing on 1 December 2009. The series stars Aaron Pedersen and Gary Sweet and centres on mixed-race solicitor Drew Ellis who joins the district to work at the Kimberley Circuit Court. Filmed mainly in Broome, Western Australia and surrounding areas, the show had a budget of more than $4 million, and 1,000 local Aboriginal extras have been employed for the production. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Sweet Aaron Pedersen Tammy Clarkson Nick Simpson-Deeks Full Cast & Crew Last Season Season 2 2009 | 7 Episodes Season 2 of The Circuit premiered on December  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Circuit. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.thecircuit.com.au/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}