{"link": "https://www.themoviedb.org/tv/64222?language=en", "title": "Immutable Law of First Love", "resume": "The story of Jong Goo, a handsome genius man and Yeo Ri, a woman who is always hurt by seeing her boyfriend together with other girls.", "rate": 0, "genre": ["Drama"], "cast": ["Song Ji-Eun", "Kim Jeong-hoon"], "character": ["Lee Yeo Ri", "Park Jong Goo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64222   Expand Immutable Law of First Love   (2015) User Score Overview The story of Jong Goo, a handsome genius man and Yeo Ri, a woman who is always hurt by seeing her boyfriend together with other girls. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Song Ji-Eun Lee Yeo Ri Kim Jeong-hoon Park Jong Goo Full Cast & Crew Last Season Season 1 2015 | 11 Episodes Season 1 of Immutable Law of First Love premiered on September 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Immutable Law of First Love. You can help by rating TV shows you've seen. Facts Original Name  첫사랑 불변의 법칙 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  10m Homepage   http://tvcast.naver.com/firstlovesyndrome Genres Drama Keywords korea Content Score 56 We're so close, yet so far. Top Contributors M 29 Maria180493 z 5 zurman1 4 Elizabeth Jennings s 3 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}