{"link": "https://www.themoviedb.org/tv/2085?language=en", "title": "Courage the Cowardly Dog", "resume": "Courage the Cowardly Dog is an American comedy horror animated television series created by John R. Dilworth for Cartoon Network. Its central plot revolves around a somewhat anthropomorphic pink/purple dog named Courage who lives with his owners, Muriel and Eustace Bagge, an elderly, married farming couple in the \"Middle of Nowhere\". Courage and his owners are frequently thrown into bizarre misadventures, often involving the paranormal/supernatural and various villains. The show is known for its surreal, often disquieting humor and bizarre plot twists. The series combines elements of comedy horror, science fantasy, and drama.\nThe program originated from a short on Cartoon Network's animation showcase series created by Hanna-Barbera president Fred Seibert, \"What a Cartoon!\" titled \"The Chicken from Outer Space\". The segment was nominated for an Academy Award in 1996, and Cartoon Network commissioned a series based on the short. The series, which premiered on November 12, 1999, ran for four seasons, ending on November 22, 2002 with a total of 52 episodes produced. The series was the sixth and final series to be spun off from World Premiere Toons, and it was the eighth series to fall under the Cartoon Cartoons label.", "rate": 77, "genre": ["Sci-Fi", "Fantasy", "Animation", "Mystery", "Comedy"], "cast": ["Thea White", "Marty Grabstein", "Simon Prebble", "Lionel G. Wilson", "Billie Lou Watt"], "character": ["Muriel Bagge (voice)", "Courage (voice)", "The Computer (voice)", "Eustace Bagge (voice)", "Ma Bagge (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2085   Expand Courage the Cowardly Dog   (1999) User Score Overview Courage the Cowardly Dog is an American comedy horror animated television series created by John R. Dilworth for Cartoon Network. Its central plot revolves around a somewhat anthropomorphic pink/purple dog named Courage who lives with his owners, Muriel and Eustace Bagge, an elderly, married farming couple in the \"Middle of Nowhere\". Courage and his owners are frequently thrown into bizarre misadventures, often involving the paranormal/supernatural and various villains. The show is known for its surreal, often disquieting humor and bizarre plot twists. The series combines elements of comedy horror, science fantasy, and drama. The program originated from a short on Cartoon Network's animation showcase series created by Hanna-Barbera president Fred Seibert, \"What a Cartoon!\" titled \"The Chicken from Outer Space\". The segment was nominated for an Academy Award in 1996, and Cartoon Network commissioned a series based on the short. The series, which premiered on November 12, 1999, ran for four seasons, ending on November 22, 2002 with a total of 52 episodes produced. The series was the sixth and final series to be spun off from World Premiere Toons, and it was the eighth series to fall under the Cartoon Cartoons label. Featured Crew John R. Dilworth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thea White Muriel Bagge (voice) Marty Grabstein Courage (voice) Simon Prebble The Computer (voice) Lionel G. Wilson Eustace Bagge (voice) Billie Lou Watt Ma Bagge (voice) Full Cast & Crew Last Season Season 4 2002 | 26 Episodes Season 4 of Courage the Cowardly Dog premiered on September  6, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations   1999-01-04 Ed, Edd n Eddy 7.0    2001-08-24 The Grim Adventures of Billy and Mandy 7.3    1996-04-28 Dexter's Laboratory 7.3    1998-11-18 The Powerpuff Girls 7.0    2002-12-06 Codename: Kids Next Door 6.5    2003-07-19 Teen Titans 7.6    1997-07-07 Johnny Bravo 6.6    1997-09-16 Cow and Chicken 6.4  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.cartoonnetwork.com/tv_shows/courage/games/index.html Genres Sci-Fi & Fantasy Animation Mystery Comedy Keywords cartoon dog Content Score 93 Almost there... Top Contributors 54 Banana 14 Marr 🇳🇱 C 11 Charls12x 10 d00ziie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}