{"link": "https://www.themoviedb.org/tv/64859?language=en", "title": "Spun Out", "resume": "SPUN OUT is a multi-camera sitcom that stars Dave Foley, Paul Campbell, Darcy Michael, Al Mukadam, Holly Devo, Becky Dalton, and J.P. Manoux. Beckett Ryan (Paul Campbell, BATTLESTAR GALACTICA), a struggling writer who ends up working at the public relations firm after suffering his own PR disaster. No matter how bizarre the cases are that the agency takes on, they pale in comparison to the workplace romances, rivalries, personal successes, and often hilarious failures of the close-knit and dysfunctional colleagues.", "rate": 50, "genre": ["Comedy"], "cast": ["Paul Campbell", "Dave Foley", "Rebecca Dalton", "Ali Mukaddam", "Holly Deveaux"], "character": ["Ryan Beckett", "Dave Lyons", "Stephanie Lyons", "Nelson Abrams", "Abby Hayes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64859   Expand Spun Out   (2014) User Score Overview SPUN OUT is a multi-camera sitcom that stars Dave Foley, Paul Campbell, Darcy Michael, Al Mukadam, Holly Devo, Becky Dalton, and J.P. Manoux. Beckett Ryan (Paul Campbell, BATTLESTAR GALACTICA), a struggling writer who ends up working at the public relations firm after suffering his own PR disaster. No matter how bizarre the cases are that the agency takes on, they pale in comparison to the workplace romances, rivalries, personal successes, and often hilarious failures of the close-knit and dysfunctional colleagues. Featured Crew Jeff Biederman Creator Brent Piaskoski Creator Brian K. Roberts Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Campbell Ryan Beckett Dave Foley Dave Lyons Rebecca Dalton Stephanie Lyons Ali Mukaddam Nelson Abrams Holly Deveaux Abby Hayes Full Cast & Crew Last Season Season 2 2015 | 1 Episode Season 2 of Spun Out premiered on August  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Spun Out. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 27 RonKing 4 Michael s 4 speedycars D 2 DrakulL  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}