{"link": "https://www.themoviedb.org/tv/64934?language=en", "title": "Do You Speak American?", "resume": "Why is the English spoken by Maine lobstermen so different from thatscene from the broadcast spoken by cowboys in Texas? Does Spanish pose a threat to English as the dominant language in America? And what on earth do yins, wickety wack, ayuh, catty whompus, and stomping it clean mean?\nRobert MacNeil travels cross-country to answer these questions and examine the dynamic state of American English – a language rich with regional variety, strong global impact and cultural controversy.", "rate": 80, "genre": ["Documentary"], "cast": ["Robert MacNeil"], "character": ["Robert MacNeil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64934   Expand Do You Speak American?   (2005) User Score Overview Why is the English spoken by Maine lobstermen so different from thatscene from the broadcast spoken by cowboys in Texas? Does Spanish pose a threat to English as the dominant language in America? And what on earth do yins, wickety wack, ayuh, catty whompus, and stomping it clean mean? Robert MacNeil travels cross-country to answer these questions and examine the dynamic state of American English – a language rich with regional variety, strong global impact and cultural controversy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert MacNeil Robert MacNeil Full Cast & Crew Last Season Season 1 2005 | 3 Episodes Season 1 of Do You Speak American? premiered on January  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Do You Speak American?. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   https://www.pbs.org/speak/ Genres Documentary Keywords journalist travelogue american accent usa travel Content Score 56 We're so close, yet so far. Top Contributors NS 34 Norte Serra  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}