{"link": "https://www.themoviedb.org/tv/35834?language=en", "title": "Bodyguard", "resume": "Bodyguard is a 2003 South Korean television series starring Cha Seung-won, Im Eun-kyung and Han Go-eun. It aired on KBS2 from July 5 to September 14, 2003 on Saturdays and Sundays at 19:50 for 22 episodes.", "rate": 0, "genre": ["Action", "Comedy", "Romance"], "cast": ["Maya", "Cha Seung-won", "Lim Eun-kyoung", "Song Il-gook"], "character": ["Hong Kyung-tak", "Han Sung-soo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35834   Expand Bodyguard   (2003) User Score Overview Bodyguard is a 2003 South Korean television series starring Cha Seung-won, Im Eun-kyung and Han Go-eun. It aired on KBS2 from July 5 to September 14, 2003 on Saturdays and Sundays at 19:50 for 22 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maya Cha Seung-won Hong Kyung-tak Lim Eun-kyoung Song Il-gook Han Sung-soo Full Cast & Crew Last Season Season 1 2003 | 22 Episodes Season 1 of Bodyguard premiered on July  5, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bodyguard. You can help by rating TV shows you've seen. Facts Original Name  보디가드 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage  - Genres Action Comedy Romance Keywords korea Content Score 71 Just a little bit more... Top Contributors t 8 tmdb38202327 N 7 Nightowl.Kr 3 Zlogorek 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}