{"link": "https://www.themoviedb.org/tv/66576?language=en", "title": "Stupid Man, Smart Phone", "resume": "Russell Kane, joined by a different online star every episode, is convinced that, even though they have no survival skills or knowledge of the local language or customs, they can be dropped anywhere in the world and survive with only their mobile phone for help.", "rate": 0, "genre": ["Documentary"], "cast": ["Russell Kane"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66576   Expand Stupid Man, Smart Phone   (2016) User Score Overview Russell Kane, joined by a different online star every episode, is convinced that, even though they have no survival skills or knowledge of the local language or customs, they can be dropped anywhere in the world and survive with only their mobile phone for help. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Russell Kane Himself - Presenter Full Cast & Crew Last Season Season 1 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Stupid Man, Smart Phone. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  48m Homepage   http://www.bbc.co.uk/programmes/p03rv90y Genres Documentary Keywords stupidity survival smart phone Content Score 56 We're so close, yet so far. Top Contributors c 27 clonedtwice 11 Elizabeth Jennings TB 2 TMDb Bot 1 MaFt  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}