{"link": "https://www.themoviedb.org/tv/78407?language=en", "title": "The Cry Of Mann", "resume": "The Cry of Mann: A Trool Day Holiday Spectacular is a series by Wham City that streamed on the [adult swim] website in late October/early November 2017. It tells the story of a family whose patriarch, industrialist Tank Mann, has gone missing; meanwhile, due to the machinations of the stepmother, Courtney, the company is on the verge of a hostile takeover. Viewers could call in and talk to the characters thanks to the many orange phones that the \"Ghost Lady\" sets up around the house.", "rate": 0, "genre": ["Soap", "Comedy", "Crime"], "cast": ["Sam Weiner", "Robby Rackleff", "Cricket Arrison", "Connor M. Kizer", "Ben O'Brien"], "character": ["Mailman", "Frank", "Courtney Mann", "Gergiev", "Jouglat Mann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78407   Expand The Cry Of Mann   (2017) User Score Overview The Cry of Mann: A Trool Day Holiday Spectacular is a series by Wham City that streamed on the [adult swim] website in late October/early November 2017. It tells the story of a family whose patriarch, industrialist Tank Mann, has gone missing; meanwhile, due to the machinations of the stepmother, Courtney, the company is on the verge of a hostile takeover. Viewers could call in and talk to the characters thanks to the many orange phones that the \"Ghost Lady\" sets up around the house. Featured Crew Robby Rackleff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  2 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Weiner Mailman Robby Rackleff Frank Cricket Arrison Courtney Mann Connor M. Kizer Gergiev Ben O'Brien Jouglat Mann Full Cast & Crew Current Season Season 1 2017 | 8 Episodes Season 1 of The Cry Of Mann premiered on October 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Cry Of Mann. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification NR Meaning No rating information Type  Miniseries Original Language  English Runtime  45m Homepage   http://www.adultswim.com/videos/the-cry-of-mann-a-trool-day-holiday-spectacular-in-eight-parts Genres Soap Comedy Crime Keywords telephone call soap opera interactive live stream Content Score 100 Yes! Looking good! Top Contributors s 49 silsha  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}