{"link": "https://www.themoviedb.org/tv/34556?language=en", "title": "Nostalgia Critic", "resume": "Nostalgia Critic is a comedy webseries created, written, edited by, and starring Chicago native Doug Walker. The series initially launched on YouTube in 2007 before moving to independent sites That Guy with the Glasses and Blip.tv. The show follows the titular Nostalgia Critic, a bitter and sarcastic film critic, as he reviews movies and television shows from his childhood and recent past, usually with comically exaggerated rage. The show often alternates the Critic's angry rants and juvenile humor with legitimate analysis of the episode's subject.\nWalker briefly retired the series at the end of 2012 to work on other projects, even writing the character out of existence in the Channel Awesome film To Boldly Flee. However, on January 22, 2013, Walker announced the show's imminent return in a narrative video called \"The Review Must Go On\". The more sketch-heavy sixth season began on February 5, 2013 with a review of the film The Odd Life of Timothy Green.", "rate": 83, "genre": ["Comedy"], "cast": ["Doug Walker"], "character": ["Nostalgia Critic"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34556   Expand Nostalgia Critic   (2008) User Score Overview Nostalgia Critic is a comedy webseries created, written, edited by, and starring Chicago native Doug Walker. The series initially launched on YouTube in 2007 before moving to independent sites That Guy with the Glasses and Blip.tv. The show follows the titular Nostalgia Critic, a bitter and sarcastic film critic, as he reviews movies and television shows from his childhood and recent past, usually with comically exaggerated rage. The show often alternates the Critic's angry rants and juvenile humor with legitimate analysis of the episode's subject. Walker briefly retired the series at the end of 2012 to work on other projects, even writing the character out of existence in the Channel Awesome film To Boldly Flee. However, on January 22, 2013, Walker announced the show's imminent return in a narrative video called \"The Review Must Go On\". The more sketch-heavy sixth season began on February 5, 2013 with a review of the film The Odd Life of Timothy Green. Featured Crew Doug Walker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Doug Walker Nostalgia Critic Full Cast & Crew Last Season The  season 6 2013 | 48 Episodes Season 6 of Nostalgia Critic premiered on February  5, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Nostalgia Critic. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  20m Homepage   http://www.thatguywiththeglasses.com/ Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors z 5 zurman1 3 Mikedeth5 2 Mendelson9 2 Fludogenerator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}