{"link": "https://www.themoviedb.org/tv/73108?language=en", "title": "Aki Sora ~In a Dream~", "resume": "The relationship between the siblings Aki and Sora continues to grow, even with the family constantly around. Nami on the other hand has strong feelings for her friend Kana, even though Kana actually likes Sora. This turmoil makes Sora question if he can or should continue the incestuous relation with his older sister Aki.", "rate": 60, "genre": ["Animation", "Drama"], "cast": ["Kori Natsuno", "Kumo Shiroi", "Nazuna Gogyo", "Hiromi Igarashi"], "character": ["Aki Aoi", "Sora Aoi", "Kana Sumiya", "Nami Aoi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73108   Expand Aki Sora ~In a Dream~   (2010) User Score Overview The relationship between the siblings Aki and Sora continues to grow, even with the family constantly around. Nami on the other hand has strong feelings for her friend Kana, even though Kana actually likes Sora. This turmoil makes Sora question if he can or should continue the incestuous relation with his older sister Aki. Featured Crew Masahiro Itosugi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kori Natsuno Aki Aoi Kumo Shiroi Sora Aoi Nazuna Gogyo Kana Sumiya Hiromi Igarashi Nami Aoi Full Cast & Crew Last Season Season 1 2010 | 2 Episodes Season 1 of Aki Sora ~In a Dream~ premiered on July 30, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Aki Sora ~In a Dream~. You can help by rating TV shows you've seen. Facts Original Name  あきそら～夢の中～ Status  Ended Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  Japanese Runtime  25m Homepage  - Genres Animation Drama Keywords based on manga anime Content Score 93 Almost there... Top Contributors 38 CrewMdk 21 Jack Duiz 4 Jimmyilhamm  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}