{"link": "https://www.themoviedb.org/tv/1466?language=en", "title": "Joey", "resume": "Joey is an American sitcom, a spin-off from Friends, which stars Matt LeBlanc reprising his role as Joey Tribbiani. It premiered on the NBC television network, on September 9, 2004, in the former time slot of its parent series, Thursday nights at 8:00 p.m.\nMidway through the second season, the show was placed on a hiatus by NBC but returned on March 7, 2006, in a new timeslot of Tuesdays at 8:30 p.m. One episode, \"Joey and the Snowball Fight\", was shown on a Tuesday at 8:30 p.m, but was pulled by NBC when it was overshadowed in ratings by American Idol. NBC canceled the series due to poor ratings in May 2006 and did not broadcast the remaining episodes.\nNo other cast members from Friends reprised their roles on Joey.", "rate": 58, "genre": ["Comedy"], "cast": ["Matt LeBlanc", "Paulo Costanzo", "Andrea Anders", "Drea de Matteo", "Jennifer Coolidge"], "character": ["Joey Tribbiani", "Alex Garrett", "Gina Tribbiani", "Bobbie Morganstern"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1466   Expand Joey   (2004) User Score Overview Joey is an American sitcom, a spin-off from Friends, which stars Matt LeBlanc reprising his role as Joey Tribbiani. It premiered on the NBC television network, on September 9, 2004, in the former time slot of its parent series, Thursday nights at 8:00 p.m. Midway through the second season, the show was placed on a hiatus by NBC but returned on March 7, 2006, in a new timeslot of Tuesdays at 8:30 p.m. One episode, \"Joey and the Snowball Fight\", was shown on a Tuesday at 8:30 p.m, but was pulled by NBC when it was overshadowed in ratings by American Idol. NBC canceled the series due to poor ratings in May 2006 and did not broadcast the remaining episodes. No other cast members from Friends reprised their roles on Joey. Featured Crew Scott Silveri Creator Shana Goldberg-Meehan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt LeBlanc Joey Tribbiani Paulo Costanzo Andrea Anders Alex Garrett Drea de Matteo Gina Tribbiani Jennifer Coolidge Bobbie Morganstern Full Cast & Crew Last Season Season 2 2005 | 22 Episodes Season 2 of Joey premiered on September 22, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Joey: Happy Birthday Matt LeBlanc! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  8 Recommendations   1996-09-17 Spin City 7.0    1996-01-09 3rd Rock from the Sun 7.3    1998-09-21 Will & Grace 6.5    1998-08-23 That '70s Show 7.4    1997-03-04 Just Shoot Me! 6.4    2005-09-20 My Name Is Earl 7.2    1992-09-23 Mad About You 6.0    1998-09-21 The King of Queens 6.7  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  20m, 30m Homepage  - Genres Comedy Keywords los angeles spin off aspiring actor sitcom Content Score 93 Almost there... Top Contributors 11 lineker 10 Banana NG 5 Norbert Gyuris 5 Atanas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}