{"link": "https://www.themoviedb.org/tv/10273?language=en", "title": "The Adventures of T-Rex", "resume": "The Adventures of T-Rex is an animated series that aired in syndication from 1992 to 1993 in North America. The show features five musical Tyrannosaurus brothers who played to sold-out crowds as a vaudeville group for the Dragon company owned by the beautiful and wealthy Myrna while also secretly fighting crime as \"T-REX,\" masterminded by Professor Edison. The show, an American/Japanese coproduction between DIC and well-known anime producer Kitty Film lasted only one season.\nSet in a world of anthropomophic dinosaurs, brothers Bernie, Bruno, Bubba, Buck and Bugsy were born with special powers to help fight crime. Each brother's special power was related to a specific part of their anatomy; Bernie's legs, Bruno's arms, Bubba's tail, Buck's mouth and teeth, and Bugsy's telekinetic eyes. The group rode out on their Rexmobile to battle “Big Boss” Graves, crime kingpin of Rep City, and his evil organization, The Corporation. Kid sister Ginger was part of the singing group, but didn’t know about her brothers’ secret identities.\nOne of the show’s other noteworthy elements was giving the T-Rexes imitation celebrity voices: Jack Benny, Art Carney, Bing Crosby, Humphrey Bogart and Jimmy Durante.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": ["Ian James Corlett", "Kathleen Barr", "Scott McNeil", "Venus Terzo", "Garry Chalk"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10273   Expand The Adventures of T-Rex   (1992) User Score Overview The Adventures of T-Rex is an animated series that aired in syndication from 1992 to 1993 in North America. The show features five musical Tyrannosaurus brothers who played to sold-out crowds as a vaudeville group for the Dragon company owned by the beautiful and wealthy Myrna while also secretly fighting crime as \"T-REX,\" masterminded by Professor Edison. The show, an American/Japanese coproduction between DIC and well-known anime producer Kitty Film lasted only one season. Set in a world of anthropomophic dinosaurs, brothers Bernie, Bruno, Bubba, Buck and Bugsy were born with special powers to help fight crime. Each brother's special power was related to a specific part of their anatomy; Bernie's legs, Bruno's arms, Bubba's tail, Buck's mouth and teeth, and Bugsy's telekinetic eyes. The group rode out on their Rexmobile to battle “Big Boss” Graves, crime kingpin of Rep City, and his evil organization, The Corporation. Kid sister Ginger was part of the singing group, but didn’t know about her brothers’ secret identities. One of the show’s other noteworthy elements was giving the T-Rexes imitation celebrity voices: Jack Benny, Art Carney, Bing Crosby, Humphrey Bogart and Jimmy Durante. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian James Corlett Kathleen Barr Scott McNeil Venus Terzo Garry Chalk Full Cast & Crew Last Season Season 1 1992 | 52 Episodes Season 1 of The Adventures of T-Rex premiered on September 18, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of T-Rex. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}