{"link": "https://www.themoviedb.org/tv/34066?language=en", "title": "Xenosaga: The Animation", "resume": "Xenosaga: The Animation is a 12-episode Japanese anime television series by Toei Animation, which premiered on TV Asahi in Japan on January 5, 2005. The series is based on the PlayStation 2 game Xenosaga Episode I: Der Wille zur Macht. The anime series was picked up by ADV Films but, in 2008, the series, along with over 30 other ADV titles were transferred to Funimation Entertainment.", "rate": 0, "genre": ["Animation"], "cast": ["Masakazu Morita", "Ai Maeda", "Rumi Shishido", "Masashi Ebara", "Wakana Yamazaki"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34066   Expand Xenosaga: The Animation   (2005) User Score Overview Xenosaga: The Animation is a 12-episode Japanese anime television series by Toei Animation, which premiered on TV Asahi in Japan on January 5, 2005. The series is based on the PlayStation 2 game Xenosaga Episode I: Der Wille zur Macht. The anime series was picked up by ADV Films but, in 2008, the series, along with over 30 other ADV titles were transferred to Funimation Entertainment. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masakazu Morita Ai Maeda Rumi Shishido Masashi Ebara Wakana Yamazaki Full Cast & Crew Last Season Season 1 2005 | 12 Episodes Season 1 of Xenosaga: The Animation premiered on January  5, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Xenosaga: The Animation. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 4 yoshizuka m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}