{"link": "https://www.themoviedb.org/tv/65763?language=en", "title": "Wabbit", "resume": "Wabbit is an animated series starring Bugs Bunny. The series features many other Looney Tunes characters including Wile E. Coyote, Yosemite Sam, and the Tasmanian Devil.", "rate": 46, "genre": ["Animation", "Comedy"], "cast": ["Jeff Bergman", "Dee Bradley Baker", "JP Karliak", "Maurice LaMarche", "Matthew Mercer"], "character": ["Bugs Bunny", "Squeaks", "Wile E. Coyote", "Yosemite Same", "Bigfoot"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65763   Expand Wabbit   (2015) User Score Overview Wabbit is an animated series starring Bugs Bunny. The series features many other Looney Tunes characters including Wile E. Coyote, Yosemite Sam, and the Tasmanian Devil. Featured Crew Erik Kuska Creator Scott Berna Creator Robb Pratt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Bergman Bugs Bunny Dee Bradley Baker Squeaks JP Karliak Wile E. Coyote Maurice LaMarche Yosemite Same Matthew Mercer Bigfoot Full Cast & Crew Last Season Season 1 2015 | 52 Episodes Season 1 of Wabbit premiered on September 21, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2015-10-05 Be Cool, Scooby Doo! 5.1    2008-11-14 Batman: The Brave and the Bold 7.1    1993-09-18 Rocko's Modern Life 7.7  Facts Status  Returning Series Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  6m Homepage   http://www.cartoonnetwork.com/video/wabbit/ Genres Animation Comedy Keywords cartoon cartoon rabbit Content Score 100 Yes! Looking good! Top Contributors 53 Stephen 12 Banana w 8 wil001 R 4 Raabi2208  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}