{"link": "https://www.themoviedb.org/tv/63864?language=en", "title": "Mr. Sloane", "resume": "Mr. Sloane's titular character is a buttoned-down 1960's man in crisis. Between his failed attempts at marriage, career success and even suicide, it's fair to say that 1969 isn't shaping up to be Watford-dweller Mr. Sloane's year. But with a potential job opportunity on the horizon and the phone number of a prospective new love interest following a chance encounter in his local hardware store, could Mr Sloane's luck be about to change?", "rate": 85, "genre": ["Comedy", "Drama"], "cast": ["Nick Frost", "Olivia Colman", "Peter Serafinowicz", "Lawry Lewin", "Ophelia Lovibond"], "character": ["Jeremy Sloane", "Janet Sloane", "Ross", "Beans", "Robin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63864   Expand Mr. Sloane   (2014) User Score  Play Trailer Overview Mr. Sloane's titular character is a buttoned-down 1960's man in crisis. Between his failed attempts at marriage, career success and even suicide, it's fair to say that 1969 isn't shaping up to be Watford-dweller Mr. Sloane's year. But with a potential job opportunity on the horizon and the phone number of a prospective new love interest following a chance encounter in his local hardware store, could Mr Sloane's luck be about to change? Featured Crew Robert B. Weide Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nick Frost Jeremy Sloane Olivia Colman Janet Sloane Peter Serafinowicz Ross Lawry Lewin Beans Ophelia Lovibond Robin Full Cast & Crew Last Season Season 1 2014 | 6 Episodes Season 1 of Mr. Sloane premiered on May 23, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mr. Sloane. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.sky.com/tv/show/mr-sloane Genres Comedy Drama Keywords england middle age 1960s Content Score 100 Yes! Looking good! Top Contributors 34 Elizabeth Jennings 7 Banana 1 tigru89 l 1 lucybenson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}