{"link": "https://www.themoviedb.org/tv/72331?language=en", "title": "Advance Bravely", "resume": "Sergeant Xia Yao, born into a wealthy and renown ancestry, is a playboy who has turned over a new leaf. Yuan Zong is an ex-soldier from the special forces who opened a bodyguard training company after being discharged.\nWhen Yuan Ru, Yuan Zong's little sister fell for Xia Yao's charms, but could not break down his erected barriers, she came to Yuan Zong for assistance. The moment Yuan Zong saw Xia Yao, he knew no other person would ever catch his eyes. And so begins the battle between brother and sister for the most coveted price - Xia Yao's heart.", "rate": 0, "genre": ["Action", "Adventure", "Drama"], "cast": ["Gong Jun", "Xu Feng", "Li Qiao Dan", "Meng En", "Chen Xun"], "character": ["Xia Yao", "Yuan Zong", "Yuan Ru", "Xuan Da Yu", "Peng Ze"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72331   Expand Advance Bravely   (2017) User Score  Play Trailer Overview Sergeant Xia Yao, born into a wealthy and renown ancestry, is a playboy who has turned over a new leaf. Yuan Zong is an ex-soldier from the special forces who opened a bodyguard training company after being discharged. When Yuan Ru, Yuan Zong's little sister fell for Xia Yao's charms, but could not break down his erected barriers, she came to Yuan Zong for assistance. The moment Yuan Zong saw Xia Yao, he knew no other person would ever catch his eyes. And so begins the battle between brother and sister for the most coveted price - Xia Yao's heart. Featured Crew Chai Jidan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gong Jun Xia Yao Xu Feng Yuan Zong Li Qiao Dan Yuan Ru Meng En Xuan Da Yu Chen Xun Peng Ze Full Cast & Crew Last Season Season 1 2017 | 30 Episodes Season 1 of Advance Bravely premiered on April 14, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Advance Bravely. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Advance Bravely. You can help by rating TV shows you've seen. Facts Original Name  盛势 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  21m Homepage  - Genres Action & Adventure Drama Keywords gay romance military Content Score 100 Yes! Looking good! Top Contributors 37 kbogesz 11 Fernanda679 8 gayso 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}