{"link": "https://www.themoviedb.org/tv/20406?language=en", "title": "Paleoworld", "resume": "Paleoworld was a documentary television series that was produced for The Learning Channel, and has had a total of 50 episodes. Some consider it to be the largest and most comprehensive paleontology series ever made. The series began in late September 1994 and, after 4 seasons, ended in 1997. Each episode is approximately 24 minutes long.The series is now owned by the Discovery Channel, along with other documentaries such as Beyond T-rex, Valley Of The T-rex, Dinosaur Planet and When Dinosaurs Roamed America.Paleoworld currently airs on Science.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20406   Expand Paleoworld   (1994) User Score Overview Paleoworld was a documentary television series that was produced for The Learning Channel, and has had a total of 50 episodes. Some consider it to be the largest and most comprehensive paleontology series ever made. The series began in late September 1994 and, after 4 seasons, ended in 1997. Each episode is approximately 24 minutes long.The series is now owned by the Discovery Channel, along with other documentaries such as Beyond T-rex, Valley Of The T-rex, Dinosaur Planet and When Dinosaurs Roamed America.Paleoworld currently airs on Science. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 — | 36 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Paleoworld. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  24m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}