{"link": "https://www.themoviedb.org/tv/16380?language=en", "title": "13 Demon Street", "resume": "13 Demon Street is a Swedish horror television series that aired between 1959 and 1960 in American syndication. Thirteen 25-minute episodes were produced.\nLon Chaney Jr. was the host, introducing each episode from his 'home' at 13 Demon Street. Condemned for some shockingly atrocious crime, Chaney's purpose in relating the series' stories was to convince viewers that the crimes presented in them were worse than his, thus freeing him from his purgatory. This was hard for audiences to judge, however, because Chaney's original crime was never specified.\nThe series was originated by Curt Siodmak, who also wrote some of the scripts and directed several episodes. He had previously written Chaney's 1941 film The Wolf Man.\nThree episodes of the series were edited together to make a theatrical feature called The Devil's Messenger, in which Chaney's character was reconfigured as Satan himself. Chaney filmed new wraparound segments to link the chosen episodes, which were 'The Photograph', 'The Girl in the Glacier' and 'Condemned in Crystal'.\nSeveral of the show's stories were derivative in nature. 'The Black Hand', for example, was modelled on The Hands of Orlac, while 'The Photograph' is an updated version of the M R James story The Mezzotint.", "rate": 100, "genre": [], "cast": ["Lon Chaney Jr."], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16380   Expand 13 Demon Street User Score Overview 13 Demon Street is a Swedish horror television series that aired between 1959 and 1960 in American syndication. Thirteen 25-minute episodes were produced. Lon Chaney Jr. was the host, introducing each episode from his 'home' at 13 Demon Street. Condemned for some shockingly atrocious crime, Chaney's purpose in relating the series' stories was to convince viewers that the crimes presented in them were worse than his, thus freeing him from his purgatory. This was hard for audiences to judge, however, because Chaney's original crime was never specified. The series was originated by Curt Siodmak, who also wrote some of the scripts and directed several episodes. He had previously written Chaney's 1941 film The Wolf Man. Three episodes of the series were edited together to make a theatrical feature called The Devil's Messenger, in which Chaney's character was reconfigured as Satan himself. Chaney filmed new wraparound segments to link the chosen episodes, which were 'The Photograph', 'The Girl in the Glacier' and 'Condemned in Crystal'. Several of the show's stories were derivative in nature. 'The Black Hand', for example, was modelled on The Hands of Orlac, while 'The Photograph' is an updated version of the M R James story The Mezzotint. Featured Crew Curt Siodmak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lon Chaney Jr. Full Cast & Crew Last Season Season 1 — | 13 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}