{"link": "https://www.themoviedb.org/tv/34309?language=en", "title": "Taylor Swift: Journey to Fearless", "resume": "Riveting performances from the 2010 tour, revealing interviews, behind-the-scenes footage, and early home videos come together to tell the story of a little girl who dared to dream big, and who fearlessly faced near-insurmountable obstacles to make those dreams come true.", "rate": 70, "genre": ["Documentary"], "cast": ["Claire Callaway", "Jonathan Sylvan Carey", "Renee Horton", "Spencer Ralston", "Taylor Swift"], "character": ["Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34309   Expand Taylor Swift: Journey to Fearless   (2010) User Score Overview Riveting performances from the 2010 tour, revealing interviews, behind-the-scenes footage, and early home videos come together to tell the story of a little girl who dared to dream big, and who fearlessly faced near-insurmountable obstacles to make those dreams come true. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Claire Callaway Jonathan Sylvan Carey Renee Horton Spencer Ralston Taylor Swift Herself Full Cast & Crew Last Season Season 1 2010 | 3 Episodes Season 1 of Taylor Swift: Journey to Fearless premiered on October 22, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Taylor Swift: Journey to Fearless. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m, 44m Homepage   http://taylorswift.com Genres Documentary Keywords concert music musician pop live concert live performance country female musician music concert pop rock Content Score 86 Almost there... Top Contributors TB 20 TMDb Bot 11 Elizabeth Jennings w 6 willo123 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}