{"link": "https://www.themoviedb.org/tv/63556?language=en", "title": "Tiny Commando", "resume": "Richard Carlyle was an elite Navy SEAL, until a tragic military experiment left him four inches tall and out of a job. That's when he found Mitzy McNeil, an Ivy League whiz and crack detective. Now, they solve crimes and battle the super villain Cesar Pequeno using totally cool tiny vehicles and a cube van.", "rate": 75, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Zachary Levi", "Gillian Jacobs", "Ed Helms"], "character": ["Tiny Comando", "Mitzi McNeil", "Cesar Pequeno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63556   Expand Tiny Commando   (2013) User Score  Play Trailer Overview Richard Carlyle was an elite Navy SEAL, until a tragic military experiment left him four inches tall and out of a job. That's when he found Mitzy McNeil, an Ivy League whiz and crack detective. Now, they solve crimes and battle the super villain Cesar Pequeno using totally cool tiny vehicles and a cube van. Featured Crew Ed Helms Creator Jacob Fleisher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Zachary Levi Tiny Comando Gillian Jacobs Mitzi McNeil Ed Helms Cesar Pequeno Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Tiny Commando premiered on September  9, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tiny Commando. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   https://screen.yahoo.com/tiny-commando/ Genres Action & Adventure Comedy Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 24 jsayol 9 Elizabeth Jennings CM 5 Cherche Moi TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}