{"link": "https://www.themoviedb.org/tv/42099?language=en", "title": "Kuzey Güney", "resume": "Kuzey Güney is a spin-off Turkish television drama series of 1976 American television miniseries Rich Man, Poor Man. The scenarists are Ece Yörenç and Melek Gençoğlu. The series stars Kıvanç Tatlıtuğ as Kuzey Tekinoğlu, a restless son of an Istanbul baker, who comes back from prison four years after he admits to a crime his brother, Güney, committed.\nThe series is broadcast in the Turkey on the popular Kanal D channel, and is produced by Ay Yapım. It premiered on September 7, 2011 and was among Turkey's four most popular TV shows, after Muhteşem Yüzyıl, Adını Feriha Koydum, Öyle Bir Geçer Zaman Ki and Fatmagül'ün Suçu Ne? being the most successful one.\nKuzey Güney has been aired every Wednesday evening at 8 pm on Kanal D. But starting from Episode 61, airs on the same day at 10 pm. After two long seasons and 80 episodes Kuzey Güney came to an end on 26 June.", "rate": 68, "genre": ["Action", "Adventure", "Drama"], "cast": ["Kıvanç Tatlıtuğ", "Buğra Gülsoy", "Oyku Karayel", "Mustafa Avkıran", "Semra Dinçer"], "character": ["Kuzey Tekinoğlu", "Güney Tekinoğlu", "Cemre Çayak", "Samir 'Sami' Tekinoğlu", "Handan Tekinoğlu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42099   Expand Kuzey Güney   (2011) User Score Overview Kuzey Güney is a spin-off Turkish television drama series of 1976 American television miniseries Rich Man, Poor Man. The scenarists are Ece Yörenç and Melek Gençoğlu. The series stars Kıvanç Tatlıtuğ as Kuzey Tekinoğlu, a restless son of an Istanbul baker, who comes back from prison four years after he admits to a crime his brother, Güney, committed. The series is broadcast in the Turkey on the popular Kanal D channel, and is produced by Ay Yapım. It premiered on September 7, 2011 and was among Turkey's four most popular TV shows, after Muhteşem Yüzyıl, Adını Feriha Koydum, Öyle Bir Geçer Zaman Ki and Fatmagül'ün Suçu Ne? being the most successful one. Kuzey Güney has been aired every Wednesday evening at 8 pm on Kanal D. But starting from Episode 61, airs on the same day at 10 pm. After two long seasons and 80 episodes Kuzey Güney came to an end on 26 June. Featured Crew Ece Yörenç Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kıvanç Tatlıtuğ Kuzey Tekinoğlu Buğra Gülsoy Güney Tekinoğlu Oyku Karayel Cemre Çayak Mustafa Avkıran Samir 'Sami' Tekinoğlu Semra Dinçer Handan Tekinoğlu Full Cast & Crew Last Season Season 2 2012 | 40 Episodes Season 2 of Kuzey Güney premiered on September 12, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2010-09-17 Time Goes By 5.7  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.kuzeyguney.tv/ Genres Action & Adventure Drama Keywords love Content Score 93 Almost there... Top Contributors V 12 Vaine M 5 Mylie 5 Mucahid Zeyrek 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}