{"link": "https://www.themoviedb.org/tv/70702?language=en", "title": "Two Years Vacation", "resume": "The story of a group of young New Zealand school boys. Because one of them is the nephew of a ship captain, they win the opportunity to go on a sailing trip. Some pirates (Forbes and Pike) are looking for a boat so they can go and find treasure on a deserted island. They manage to be recruited as crew members on that same boat as the school boys. After a mutiny, the pirates take over the boat and take the young boys as hostages. Helped by O'Brian, the young kids manage to escape from the pirates with the boat. After a storm, they have to land on a deserted island. They have learn to live together in harmony if they want their community to survive, despite the rivalry within the group. But is this island really a deserted one? And can they really get away from the pirates?", "rate": 57, "genre": ["Action", "Adventure", "Family"], "cast": ["Marc Di Napoli", "Franz Seidenschwan", "Werner Pochath", "Rainer Basedow", "Angela Chiuaru"], "character": ["Doniphan", "Dick Sand", "Forbes", "Pike", "Frau Weldon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70702   Expand Two Years Vacation   (1974) User Score Overview The story of a group of young New Zealand school boys. Because one of them is the nephew of a ship captain, they win the opportunity to go on a sailing trip. Some pirates (Forbes and Pike) are looking for a boat so they can go and find treasure on a deserted island. They manage to be recruited as crew members on that same boat as the school boys. After a mutiny, the pirates take over the boat and take the young boys as hostages. Helped by O'Brian, the young kids manage to escape from the pirates with the boat. After a storm, they have to land on a deserted island. They have learn to live together in harmony if they want their community to survive, despite the rivalry within the group. But is this island really a deserted one? And can they really get away from the pirates? Featured Crew Gilles Grangier Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Marc Di Napoli Doniphan Franz Seidenschwan Dick Sand Werner Pochath Forbes Rainer Basedow Pike Angela Chiuaru Frau Weldon Full Cast & Crew Last Season Season 1 1974 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Two Years Vacation. You can help by rating TV shows you've seen. Facts Original Name  Deux ans de vacances Status  Ended Network Certification  - Type  Miniseries Original Language  French Runtime  55m Homepage  - Genres Action & Adventure Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 27 dannyvl TB 23 TMDb Bot 9 yannkallander 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}