{"link": "https://www.themoviedb.org/tv/10158?language=en", "title": "The World's Greatest Super Friends", "resume": "The World's Greatest Super Friends is an American animated television series about a team of superheroes which ran from September 22, 1979 to September 27, 1980 on ABC. It was produced by Hanna-Barbera and is based on the Justice League and associated comic book characters published by DC Comics.", "rate": 75, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Michael Bell", "Casey Kasem", "Olan Soule", "Danny Dark", "William Callaway"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10158   Expand The World's Greatest Super Friends   (1979) User Score Overview The World's Greatest Super Friends is an American animated television series about a team of superheroes which ran from September 22, 1979 to September 27, 1980 on ABC. It was produced by Hanna-Barbera and is based on the Justice League and associated comic book characters published by DC Comics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Bell Casey Kasem Olan Soule Danny Dark William Callaway Full Cast & Crew Last Season The world's greatest superfriends season 1 1979 | 8 Episodes Season 1 of The World's Greatest Super Friends premiered on September 22, 1979. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Universe of Evil Open 0 by GForce59\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1977-09-10 The All-New Super Friends Hour 6.8    1980-10-04 Thundarr the Barbarian 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.batmanytb.com/animated/wgsf/ Genres Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 Евгений 1 minhus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}