{"link": "https://www.themoviedb.org/tv/77295?language=en", "title": "Supermarket Sweep", "resume": "Teams answer questions to earn time and advantages over their competitors before going on a supermarket shopping spree. The team that adds the most valuable items to their carts wins.", "rate": 100, "genre": ["Comedy", "Family", "Reality"], "cast": ["David Ruprecht"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77295   Expand Supermarket Sweep   (2000) User Score Overview Teams answer questions to earn time and advantages over their competitors before going on a supermarket shopping spree. The team that adds the most valuable items to their carts wins. Featured Crew Al Howard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Ruprecht Himself - Host Full Cast & Crew Last Season Season 1 2000 | 20 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Supermarket Sweep. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Reality Original Language  English Runtime  30m Homepage  - Genres Comedy Family Reality Keywords supermarket competition teamwork game show quiz show contest team race shopping store shopping spree shopping show time limit shopping cart Content Score 64 We're so close, yet so far. Top Contributors 123 Ibuddy66 42 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}