{"link": "https://www.themoviedb.org/tv/61122?language=en", "title": "Mr Tuk Tuk", "resume": "The story of an ambitious Tuk Tuk driver working in Bangkok who gets himself in all sorts of bother trying to make a greater success of his life.", "rate": 60, "genre": ["Soap", "Drama"], "cast": ["Tawan Jarujinda", "Pleng Kavita", "Kwankawin Thamrongratthaset", "Chuerchart Wongsawat", "Nuntasai Pisolyabut"], "character": ["Mr Tuk Tuk", "รับบทเป็น วันสุข", "รับบทเป็น ต่อหญิง", "รับบทเป็น หมอทิน", "รับบทเป็น วีรจักร"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61122   Expand Mr Tuk Tuk   (2014) User Score  Play Trailer Overview The story of an ambitious Tuk Tuk driver working in Bangkok who gets himself in all sorts of bother trying to make a greater success of his life. Featured Crew School of Theatre Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tawan Jarujinda Mr Tuk Tuk Pleng Kavita รับบทเป็น วันสุข Kwankawin Thamrongratthaset รับบทเป็น ต่อหญิง Chuerchart Wongsawat รับบทเป็น หมอทิน Nuntasai Pisolyabut รับบทเป็น วีรจักร Full Cast & Crew Last Season Season 1 2014 | 30 Episodes Season 1 of Mr Tuk Tuk premiered on March 30, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mr Tuk Tuk. You can help by rating TV shows you've seen. Facts Original Name  ยอดชายนา ยตุ๊กตุ๊ก Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  48m Homepage   http://drama.ch7.com/detail/65526/%E0%B8%A2%E0%B8%AD%E0%B8%94%E0%B8%8A%E0%B8%B2%E0%B8%A2%E0%B8%99%E0%B8%B2%E0%B8%A2%E0%B8%95%E0%B8%B8%E0%B9%8A%E0%B8%81%E0%B8%95%E0%B8%B8%E0%B9%8A%E0%B8%81.html Genres Soap Drama Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 41 Crip 2 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}