{"link": "https://www.themoviedb.org/tv/17436?language=en", "title": "Jimmy Two-Shoes", "resume": "Jimmy Two-Shoes is a Canadian animated television series that aired on Disney XD in the United Kingdom and in the USA, and Teletoon in Canada. The series were centered around the exploits of the happy-go-lucky titular character Jimmy, who lives in Miseryville, a miserable town filled with monsters and demon-like creatures. The series were created by Edward Kay and Sean Scott. The series is rated G in Canada and TV-Y7 in the United States. The show premiered on February 21, 2009, ending its run in the U.S. on July 15, 2011, spanning 2 seasons.", "rate": 70, "genre": ["Animation", "Comedy"], "cast": ["Tabitha St. Germain", "Brian Froud", "Carlos Alazraqui", "Seán Cullen", "Cory Doran"], "character": ["Jimmy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17436   Expand Jimmy Two-Shoes   (2009) User Score Overview Jimmy Two-Shoes is a Canadian animated television series that aired on Disney XD in the United Kingdom and in the USA, and Teletoon in Canada. The series were centered around the exploits of the happy-go-lucky titular character Jimmy, who lives in Miseryville, a miserable town filled with monsters and demon-like creatures. The series were created by Edward Kay and Sean Scott. The series is rated G in Canada and TV-Y7 in the United States. The show premiered on February 21, 2009, ending its run in the U.S. on July 15, 2011, spanning 2 seasons. Featured Crew Doug TenNapel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tabitha St. Germain Brian Froud Carlos Alazraqui Seán Cullen Cory Doran Jimmy Full Cast & Crew Last Season Season 2 2010 | 52 Episodes Season 2 of Jimmy Two-Shoes premiered on October 30, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jimmy Two-Shoes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}