{"link": "https://www.themoviedb.org/tv/14749?language=en", "title": "Damo", "resume": "Damo is a 2003 South Korean fusion historical drama, starring Ha Ji-won, Lee Seo-jin, and Kim Min-joon. Set in the Joseon Dynasty, it tells the story of Chae-ok, a damo relegated to the low-status job of a female police detective who investigates crimes involving women of the upper class. Chae-ok shares a forbidden love with her mentor and superior Hwangbo Yoon, but while working undercover on a counterfeit ring case, she finds herself drawn to Jang Sung-baek, the mysterious leader of the rebel army she has infiltrated.\nIt aired on MBC from July 28 to September 9, 2003 on Mondays and Tuesdays at 21:55 for 14 episodes.", "rate": 80, "genre": ["Action", "Adventure", "Drama"], "cast": ["Ha Ji-won", "Jung Min-ah", "Lee Seo-jin", "Kim Min-joon", "Lee Mun-sik"], "character": ["Jang Jae-hui / Jang Chae-ok", "as young Jae-hui /  Chae-ok", "Yun Hwang-Bo", "Kang Seong-Baek", "Ma Chuk-Ji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14749   Expand Damo   (2003) User Score Overview Damo is a 2003 South Korean fusion historical drama, starring Ha Ji-won, Lee Seo-jin, and Kim Min-joon. Set in the Joseon Dynasty, it tells the story of Chae-ok, a damo relegated to the low-status job of a female police detective who investigates crimes involving women of the upper class. Chae-ok shares a forbidden love with her mentor and superior Hwangbo Yoon, but while working undercover on a counterfeit ring case, she finds herself drawn to Jang Sung-baek, the mysterious leader of the rebel army she has infiltrated. It aired on MBC from July 28 to September 9, 2003 on Mondays and Tuesdays at 21:55 for 14 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ha Ji-won Jang Jae-hui / Jang Chae-ok Jung Min-ah as young Jae-hui /  Chae-ok Lee Seo-jin Yun Hwang-Bo Kim Min-joon Kang Seong-Baek Lee Mun-sik Ma Chuk-Ji Full Cast & Crew Last Season Season 1 2003 | 14 Episodes Season 1 of Damo premiered on July 28, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Damo. You can help by rating TV shows you've seen. Facts Original Name  다모 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/damo/ Genres Action & Adventure Drama Keywords romance korea historical Content Score 86 Almost there... Top Contributors M 26 Maria180493 13 part-mozi s 11 sheva_vitali R 9 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}