{"link": "https://www.themoviedb.org/tv/77106?language=en", "title": "Acts of the Apostles", "resume": "Dramatization from the New Testament.", "rate": 53, "genre": ["Drama"], "cast": ["Edoardo Torricella", "Jacques Dumur", "Renzo Rossi", "Guiseppe  Mannaiuolo"], "character": ["Paolo/Saolo di Tarso", "Simone Pietro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77106   Expand Acts of the Apostles   (1969) User Score Overview Dramatization from the New Testament. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Edoardo Torricella Paolo/Saolo di Tarso Jacques Dumur Simone Pietro Renzo Rossi Guiseppe  Mannaiuolo Full Cast & Crew Last Season Miniseries 1969 | 5 Episodes Season 1 of Acts of the Apostles premiered on April  5, 1969. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Acts of the Apostles. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Acts of the Apostles. You can help by rating TV shows you've seen. Facts Original Name  Atti degli apostoli Status  Ended Network Certification  - Type  Miniseries Original Language  Italian Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 21 axmanoj TB 17 TMDb Bot 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}