{"link": "https://www.themoviedb.org/tv/78004?language=en", "title": "Death Note: New Generation", "resume": "The miniseries focuses on the three new lead characters of the film Death Note: Light Up the NEW World: Tsukuru Mishima, Ryuzaki, and Yuki Shien. Each episode provides backstory for one of the characters and bridges the 10-year gap between the previous films, which canonically took place in 2005-2006, and the new film taking place in 2016.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Masahiro Higashide", "Sosuke Ikematsu", "Masaki Suda", "Rina Kawaei"], "character": ["Tsukuru Mishima", "Ryūzaki", "Yūki Shien", "Sakura Aoi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78004   Expand Death Note: New Generation   (2016) User Score Overview The miniseries focuses on the three new lead characters of the film Death Note: Light Up the NEW World: Tsukuru Mishima, Ryuzaki, and Yuki Shien. Each episode provides backstory for one of the characters and bridges the 10-year gap between the previous films, which canonically took place in 2005-2006, and the new film taking place in 2016. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masahiro Higashide Tsukuru Mishima Sosuke Ikematsu Ryūzaki Masaki Suda Yūki Shien Rina Kawaei Sakura Aoi Full Cast & Crew Last Season Miniseries 2016 | 3 Episodes Season 1 of Death Note: New Generation premiered on September 15, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Death Note: New Generation. You can help by rating TV shows you've seen. Facts Original Name  デスノート NEW GENERATION Status  Ended Network Certification  - Type  Miniseries Original Language  Japanese Runtime  21m Homepage   https://www.happyon.jp/death-note-new-generation Genres Crime Drama Keywords prequel Content Score 86 Almost there... Top Contributors 28 Banana g 3 gpd67 3 Nojus741 1 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}