{"link": "https://www.themoviedb.org/tv/5110?language=en", "title": "Pecados Ajenos", "resume": "Pecados Ajenos is a Spanish-language telenovela written by Eric Vonn and produced by the United States-based television network Telemundo. This limited-run series was shot in Florida by Telemundo Studios, Miami. It is also known as A Chance to Love\nPecados Ajenos replaced Amor Mio in Telemundo's 10 p.m. time slot on October 8, 2007. Lorena Rojas and Mauricio Islas were paired together for the first time in this saga of love, marriage, betrayal, parenthood, friendship and passion.\nShow was launched for example in Poland on Puls TV and in Romania on Acasa TV. In Georgia, channel Rustavi 2 broadcast the novel.\nVonn penned this urban melodrama set in West Palm Beach and Pompano Beach. It features star-crossed lovers who fall in love at the worst possible moment. The show dealt with topics such as homosexuality and homophobia in Hispanic culture, date rape and marital rape, drug addiction and alcoholism, domestic violence, prostitution, abortion, incest, the dangers of religious fanaticism, illegal immigration, mental disorders like schizophrenia and multiple personality disorder, animal cruelty, and the corruption and abuse in women's prisons.\nAs with most of its telenovelas, the network broadcast English subtitles as closed captions on CC3. Many scenes were shot on location in Virginia Key.", "rate": 0, "genre": [], "cast": ["Mauricio Islas", "Catherine Siachoque", "Sofía Stamatiades", "Lupita Ferrer", "Jencarlos Canela"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5110   Expand Pecados Ajenos   (2007) User Score Overview Pecados Ajenos is a Spanish-language telenovela written by Eric Vonn and produced by the United States-based television network Telemundo. This limited-run series was shot in Florida by Telemundo Studios, Miami. It is also known as A Chance to Love Pecados Ajenos replaced Amor Mio in Telemundo's 10 p.m. time slot on October 8, 2007. Lorena Rojas and Mauricio Islas were paired together for the first time in this saga of love, marriage, betrayal, parenthood, friendship and passion. Show was launched for example in Poland on Puls TV and in Romania on Acasa TV. In Georgia, channel Rustavi 2 broadcast the novel. Vonn penned this urban melodrama set in West Palm Beach and Pompano Beach. It features star-crossed lovers who fall in love at the worst possible moment. The show dealt with topics such as homosexuality and homophobia in Hispanic culture, date rape and marital rape, drug addiction and alcoholism, domestic violence, prostitution, abortion, incest, the dangers of religious fanaticism, illegal immigration, mental disorders like schizophrenia and multiple personality disorder, animal cruelty, and the corruption and abuse in women's prisons. As with most of its telenovelas, the network broadcast English subtitles as closed captions on CC3. Many scenes were shot on location in Virginia Key. Featured Crew Eric Vonn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mauricio Islas Catherine Siachoque Sofía Stamatiades Lupita Ferrer Jencarlos Canela Full Cast & Crew Last Season \"\" season 1 2007 | 1 Episode Season 1 of Pecados Ajenos premiered on October  8, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pecados Ajenos. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m, 58m, 45m Homepage   http://tv.telemundo.yahoo.com/pecadosajenos/index.html Genres No genres have been added. Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors s 3 speedycars a 3 asusar 2 lineker s 1 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}