{"link": "https://www.themoviedb.org/tv/31136?language=en", "title": "Hi My Sweetheart", "resume": "Hi My Sweetheart is a 2009 Taiwanese Drama starring Show Luo, Rainie Yang and Lee Wei. It was produced by Comic Ritz International Production and Chai Zhi Ping as producer and directed by Lin He Long. It started filming on 26 July 2009 and wrapped in 23 November 2009. It was filmed on location in Kaohsiung, Taiwan and Hangzhou, China.\nThe series was first broadcast in Taiwan on free-to-air Chinese Television System from 1 November 2009 to 31 January 2010, every Sunday at 22:00 to 23:30 and cable TV Gala Television Variety Show/CH 28 on 8 November 2009 to 7 February 2010, every Sunday at 20:00 to 21:30.\nThe 14 episode series follows the romance between Xue Hai and Chen Bao Zhu, beginning from their college days until their late 20's.\nHi My Sweetheart was nominated in 2010 in five categories at the 45th Golden Bell Awards,including Best Television Series and Best Leading Actor in a Television Series for Show Luo. Rainie Yang who portrayed Chen Bao Zhu in the drama, won Best Leading Actress in a Television Series at the award ceremony in October.", "rate": 100, "genre": ["Drama", "Comedy"], "cast": ["Rainie Yang", "Show Luo"], "character": ["Chen Bao Zhu", "Xue Hai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31136   Expand Hi My Sweetheart   (2009) User Score Overview Hi My Sweetheart is a 2009 Taiwanese Drama starring Show Luo, Rainie Yang and Lee Wei. It was produced by Comic Ritz International Production and Chai Zhi Ping as producer and directed by Lin He Long. It started filming on 26 July 2009 and wrapped in 23 November 2009. It was filmed on location in Kaohsiung, Taiwan and Hangzhou, China. The series was first broadcast in Taiwan on free-to-air Chinese Television System from 1 November 2009 to 31 January 2010, every Sunday at 22:00 to 23:30 and cable TV Gala Television Variety Show/CH 28 on 8 November 2009 to 7 February 2010, every Sunday at 20:00 to 21:30. The 14 episode series follows the romance between Xue Hai and Chen Bao Zhu, beginning from their college days until their late 20's. Hi My Sweetheart was nominated in 2010 in five categories at the 45th Golden Bell Awards,including Best Television Series and Best Leading Actor in a Television Series for Show Luo. Rainie Yang who portrayed Chen Bao Zhu in the drama, won Best Leading Actress in a Television Series at the award ceremony in October. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rainie Yang Chen Bao Zhu Show Luo Xue Hai Full Cast & Crew Last Season Season 1 2009 | 14 Episodes Season 1 of Hi My Sweetheart premiered on November  1, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hi My Sweetheart. You can help by rating TV shows you've seen. Facts Original Name  海派甜心 Status  Ended Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage   http://sweetheart.blog.cts.com.tw/ Genres Drama Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 3 shadowfurious H 3 Heleandra 3 lareina123 G 1 Gurre  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}