{"link": "https://www.themoviedb.org/tv/65352?language=en", "title": "My Son-In-Law's Woman", "resume": "Jin-sook used to hate her son-in-law Hyun-tae when her daughter died, but now Hyun-tae is like a real son to her. One day, Hyun-tae falls in love with a woman named Soo-kyung, and Jin-sook, who was unhappy with Soo-kyung, finds out that Soo-kyung is her real daughter.", "rate": 90, "genre": ["Comedy", "Family", "Romance"], "cast": ["Seo Ha-joon", "Jeong Dong-gyoo", "Yang Jin-sung", "Jang Seung-jo", "Lee Si-Won"], "character": ["Kim Hyun-Tae", "Choi Dal-seok", "Park Soo-Kyung", "Choi Jae-Young", "Oh Young-Chae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65352   Expand My Son-In-Law's Woman   (2016) User Score Overview Jin-sook used to hate her son-in-law Hyun-tae when her daughter died, but now Hyun-tae is like a real son to her. One day, Hyun-tae falls in love with a woman named Soo-kyung, and Jin-sook, who was unhappy with Soo-kyung, finds out that Soo-kyung is her real daughter. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo Ha-joon Kim Hyun-Tae Jeong Dong-gyoo Choi Dal-seok Yang Jin-sung Park Soo-Kyung Jang Seung-jo Choi Jae-Young Lee Si-Won Oh Young-Chae Full Cast & Crew Last Season Season 1 2016 | 25 Episodes Season 1 of My Son-In-Law's Woman premiered on January  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on My Son-In-Law's Woman. You can help by rating TV shows you've seen. Facts Original Name  내 사위의 여자 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000008919 Genres Comedy Family Romance Keywords korea Content Score 86 Almost there... Top Contributors M 24 Maria180493 6 Charles t 1 tmdb38202327 R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}