{"link": "https://www.themoviedb.org/tv/10978?language=en", "title": "D.I.C.E.", "resume": "D.I.C.E. is an animated television series produced by Bandai Entertainment, Xebec, and Studio Galapagos. Originally made for the United States, the series was first broadcast in Cartoon Network in US, then YTV in Canada. On December 12, 2005, the Japanese version was premiered on Animax under the title Dinobreaker. On January 7, 2006, the Tagalog version premiered on Hero TV. ABS-CBN network followed by broadcasting the series in Tagalog on January 28, 2006. As of October 31, 2009, D.I.C.E. has already run for a total of 15 full runs in the 4 channels which broadcast D.I.C.E. in the Philippines.", "rate": 0, "genre": ["Animation"], "cast": ["Randy Brososky", "Robert Scott Henrickson", "Caitlynne Medrek", "Scott Roberts", "Brendan Hunter"], "character": ["Zaba Gun", "Marco Rocca", "Puffy Angel", "Tak Carter", "Robert Clapice"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10978   Expand D.I.C.E.   (2005) User Score Overview D.I.C.E. is an animated television series produced by Bandai Entertainment, Xebec, and Studio Galapagos. Originally made for the United States, the series was first broadcast in Cartoon Network in US, then YTV in Canada. On December 12, 2005, the Japanese version was premiered on Animax under the title Dinobreaker. On January 7, 2006, the Tagalog version premiered on Hero TV. ABS-CBN network followed by broadcasting the series in Tagalog on January 28, 2006. As of October 31, 2009, D.I.C.E. has already run for a total of 15 full runs in the 4 channels which broadcast D.I.C.E. in the Philippines. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Randy Brososky Zaba Gun Robert Scott Henrickson Marco Rocca Caitlynne Medrek Puffy Angel Scott Roberts Tak Carter Brendan Hunter Robert Clapice Full Cast & Crew Last Season Season 1 2005 | 40 Episodes Season 1 of D.I.C.E. premiered on January 22, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on D.I.C.E.. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 2 cobaltbuilds  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}