{"link": "https://www.themoviedb.org/tv/38934?language=en", "title": "Creating Destiny", "resume": "Han Sang-eun immigrated to Australia with her family at a young age. After graduating from law school, she announces her plans to marry her American boyfriend Alex, a fellow attorney. But her father is strongly opposed to the match, because he has his heart set on her marrying Kim Yeo-joon, the son of his best friend who lives back in Korea. He orders her to meet the bachelor that they picked out for her before she goes ahead and marries Alex. Sang-eun finds herself exiled to Korea, where she reluctantly teams up with Yeo-joon, who is focused on his career and equally uninterested in marriage, to devise a plan that will allow them to avoid their impending wedlock.", "rate": 70, "genre": ["Drama"], "cast": ["Kim Tae-Young", "Yunjin Kim", "Kang Byul", "Kim Jung", "Yang Hee-Kyung"], "character": ["Han Hyo-eun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38934   Expand Creating Destiny   (2009) User Score Overview Han Sang-eun immigrated to Australia with her family at a young age. After graduating from law school, she announces her plans to marry her American boyfriend Alex, a fellow attorney. But her father is strongly opposed to the match, because he has his heart set on her marrying Kim Yeo-joon, the son of his best friend who lives back in Korea. He orders her to meet the bachelor that they picked out for her before she goes ahead and marries Alex. Sang-eun finds herself exiled to Korea, where she reluctantly teams up with Yeo-joon, who is focused on his career and equally uninterested in marriage, to devise a plan that will allow them to avoid their impending wedlock. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Tae-Young Yunjin Kim Kang Byul Han Hyo-eun Kim Jung Yang Hee-Kyung Full Cast & Crew Last Season Season 1 2009 | 31 Episodes Season 1 of Creating Destiny premiered on October 10, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Creating Destiny. You can help by rating TV shows you've seen. Facts Original Name  인연 만들기 Status  Ended Networks - Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/bond/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 18 tmdb38202327 z 5 zurman1 R 1 RJ_F13 1 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}