{"link": "https://www.themoviedb.org/tv/61474?language=en", "title": "Gonna be the Twin-Tail!!", "resume": "Sōji is an ordinary high school student with an extraordinary love for pig tails (or \"twin tails\"). One day a mysterious girl from another universe named Thouars appears in front of him. At the exact same time, monsters begin attacking the city where Sōji lives, declaring they will drain the world's energy in the name of the Twintails. Sōji receives a powerful armor from Thouars called \"Tail Gear\" which transforms him into a female Twintail warrior named Tail Red.", "rate": 88, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61474   Expand Gonna be the Twin-Tail!!   (2014) User Score Overview Sōji is an ordinary high school student with an extraordinary love for pig tails (or \"twin tails\"). One day a mysterious girl from another universe named Thouars appears in front of him. At the exact same time, monsters begin attacking the city where Sōji lives, declaring they will drain the world's energy in the name of the Twintails. Sōji receives a powerful armor from Thouars called \"Tail Gear\" which transforms him into a female Twintail warrior named Tail Red. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2014 | 12 Episodes Season 1 of Gonna be the Twin-Tail!! premiered on October  9, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Gonna be the Twin-Tail!!. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gonna be the Twin-Tail!!. You can help by rating TV shows you've seen. Facts Original Name  俺、ツインテールになります。 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 7 Elizabeth Jennings 4 Sierrda D 4 Destr0y m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}