{"link": "https://www.themoviedb.org/tv/40448?language=en", "title": "99 Days Of Me And My Star", "resume": "Boku to Star no 99 Nichi is a Japanese television series which premiered on Fuji TV in October 2011. It starred Japanese actor Hidetoshi Nishijima and Korean actress Kim Tae Hee.", "rate": 78, "genre": ["Comedy", "Romance"], "cast": ["Kim Tae-hee", "Hidetoshi Nishijima", "Nanami Sakuraba", "Ok Taec-yeon", "Jun Kaname"], "character": ["Han Yoo-na", "Kohei", "Momo", "Tae-sung", "Kazuya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40448   Expand 99 Days Of Me And My Star   (2011) User Score Overview Boku to Star no 99 Nichi is a Japanese television series which premiered on Fuji TV in October 2011. It starred Japanese actor Hidetoshi Nishijima and Korean actress Kim Tae Hee. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Tae-hee Han Yoo-na Hidetoshi Nishijima Kohei Nanami Sakuraba Momo Ok Taec-yeon Tae-sung Jun Kaname Kazuya Full Cast & Crew Last Season Season 1 2011 | 10 Episodes Season 1 of 99 Days Of Me And My Star premiered on October 23, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 99 Days Of Me And My Star. You can help by rating TV shows you've seen. Facts Original Name  僕とスターの99日 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.fujitv.co.jp/99days/index.html Genres Comedy Romance Keywords japan Content Score 86 Almost there... Top Contributors M 16 Maria180493 N 4 Nosirus A 1 Aka75 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}