{"link": "https://www.themoviedb.org/tv/21514?language=en", "title": "Orthros no Inu", "resume": "Orthros no Inu is a TBS Japanese television drama, which stars Hideaki Takizawa and Ryo Nishikido. The series aired on July 24, 2009.", "rate": 50, "genre": ["Drama"], "cast": ["Hideaki Takizawa", "Ryo Nishikido", "Asami Mizukawa", "Shugo Oshinari", "Haru"], "character": ["Shinji Ryuzaki", "Ryosuke Aoi", "Nagisa Hasebe", "Masato Yoshizumi", "Kana Shirakawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21514   Expand Orthros no Inu   (2009) User Score Overview Orthros no Inu is a TBS Japanese television drama, which stars Hideaki Takizawa and Ryo Nishikido. The series aired on July 24, 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hideaki Takizawa Shinji Ryuzaki Ryo Nishikido Ryosuke Aoi Asami Mizukawa Nagisa Hasebe Shugo Oshinari Masato Yoshizumi Haru Kana Shirakawa Full Cast & Crew Last Season Season 1 2009 | 9 Episodes Season 1 of Orthros no Inu premiered on July 24, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Orthros no Inu. You can help by rating TV shows you've seen. Facts Original Name  オルトロスの犬 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  54m Homepage   http://www.tbs.co.jp/orthros-dog/ Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 12 thirstyhippo NS 3 Norte Serra 3 shadowfurious 3 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}