{"link": "https://www.themoviedb.org/tv/42336?language=en", "title": "A Casa das Sete Mulheres", "resume": "A Casa das Sete Mulheres is a 2003 Brazilian miniseries.\nIt was written by Maria Adelaide Amaral and Walther Negrão, with collaboration of Manfredi and Vincent Lucio Villari, based on the novel novel of the same name by Brazilian writer Letícia Wierzchowski, and directed by Teresa Lampreia, with the general direction of Jayme Monjardim and Marcos Schechtmann, and direction of core Jayme Monjardim.\nThe miniseries had Eliane Giardini, Camila Morgado, Samara Felippo, Mariana Ximenes, Daniela Escobar, Nívea Maria and Bete Mendes as the Seven Women, and still Thiago Lacerda, Giovanna Antonelli and Werner Schünemann, as the great heroes of the Revolution Farrukhabad, living their characters true figures, which complemented the country's history, being the same, large national icons.", "rate": 90, "genre": [], "cast": ["Camila Morgado", "Eliane Giardini", "Mariana Ximenes", "Daniela Escobar", "Samara Felippo"], "character": ["Manuela", "Dona Caetana", "Rosário", "Perpétua", "Mariana"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42336   Expand A Casa das Sete Mulheres   (2003) User Score Overview A Casa das Sete Mulheres is a 2003 Brazilian miniseries. It was written by Maria Adelaide Amaral and Walther Negrão, with collaboration of Manfredi and Vincent Lucio Villari, based on the novel novel of the same name by Brazilian writer Letícia Wierzchowski, and directed by Teresa Lampreia, with the general direction of Jayme Monjardim and Marcos Schechtmann, and direction of core Jayme Monjardim. The miniseries had Eliane Giardini, Camila Morgado, Samara Felippo, Mariana Ximenes, Daniela Escobar, Nívea Maria and Bete Mendes as the Seven Women, and still Thiago Lacerda, Giovanna Antonelli and Werner Schünemann, as the great heroes of the Revolution Farrukhabad, living their characters true figures, which complemented the country's history, being the same, large national icons. Featured Crew Walther Negrão Creator Maria Adelaide Amaral Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Camila Morgado Manuela Eliane Giardini Dona Caetana Mariana Ximenes Rosário Daniela Escobar Perpétua Samara Felippo Mariana Full Cast & Crew Last Season Season 1 2003 | 52 Episodes Season 1 of A Casa das Sete Mulheres premiered on January  7, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on A Casa das Sete Mulheres. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 66 Vini 7 pauloelifaz 2 Amanda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}