{"link": "https://www.themoviedb.org/tv/68436?language=en", "title": "Eurotika!", "resume": "Eurotika is a Channel 4 documentary film on European exploitation cinema. The documentary is similarly themed to Pete Tombs's book Immoral Tales: European Sex and Horror Movies 1956-1984. During the 1960s and 1970s, European low-budget films went kinky, emerging as a new type of cinema that blended eroticism, surrealism, horror, and over-the-top atmospherics.", "rate": 0, "genre": ["Documentary"], "cast": ["Penelope McGhie"], "character": ["Narrator (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68436   Expand Eurotika!   (1999) User Score Overview Eurotika is a Channel 4 documentary film on European exploitation cinema. The documentary is similarly themed to Pete Tombs's book Immoral Tales: European Sex and Horror Movies 1956-1984. During the 1960s and 1970s, European low-budget films went kinky, emerging as a new type of cinema that blended eroticism, surrealism, horror, and over-the-top atmospherics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Penelope McGhie Narrator (voice) Full Cast & Crew Last Season Season 1 1999 | 12 Episodes Season 1 of Eurotika! premiered on October  3, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Eurotika!. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors C 6 CherryJones RZ 5 Ryan Zimmerman 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}