{"link": "https://www.themoviedb.org/tv/10432?language=en", "title": "Adventures in Wonderland", "resume": "Adventures in Wonderland is a live-action musical television series based on Walt Disney's animated classic Alice in Wonderland. In the series, Alice, was portrayed as a girl who can go to and from Wonderland simply by walking through her mirror.\nThe show ran from 1992 to 1995 on the Disney Channel and on stations across the country. Like many Disney Channel original shows, Adventures in Wonderland was taped at Disney-MGM Studios at the Walt Disney World Resort in Lake Buena Vista, Florida, with two sound stages used exclusively for the show, but only for its first 40 episodes. Afterward, shooting was moved to Los Angeles, CA.\nWalt Disney Studios Home Entertainment released three VHS tapes of certain episodes.", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Wesley Mann", "Elisabeth Harnois", "Teri Garr", "John Robert Hoffman", "Harry Waters, Jr."], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10432   Expand Adventures in Wonderland User Score Overview Adventures in Wonderland is a live-action musical television series based on Walt Disney's animated classic Alice in Wonderland. In the series, Alice, was portrayed as a girl who can go to and from Wonderland simply by walking through her mirror. The show ran from 1992 to 1995 on the Disney Channel and on stations across the country. Like many Disney Channel original shows, Adventures in Wonderland was taped at Disney-MGM Studios at the Walt Disney World Resort in Lake Buena Vista, Florida, with two sound stages used exclusively for the show, but only for its first 40 episodes. Afterward, shooting was moved to Los Angeles, CA. Walt Disney Studios Home Entertainment released three VHS tapes of certain episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wesley Mann Elisabeth Harnois Teri Garr John Robert Hoffman Harry Waters, Jr. Full Cast & Crew Last Season Season 5 — | 22 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors JS 1 Jerry Skids  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}