{"link": "https://www.themoviedb.org/tv/16678?language=en", "title": "Der Clown", "resume": "Der Clown was a German television series that ran between 21 April 1998 and 11 October 2001. It ran for 46 episodes, and starred Sven Martinek, Diana Frank, Thomas Anzenhofer and Volkmar Kleinert.\nDer Clown was also a 2005 film.", "rate": 75, "genre": ["Crime", "Action", "Adventure"], "cast": ["Sven Martinek", "Diana Frank", "Thomas Anzenhofer", "Volkmar Kleinert", "Andreas Schmidt-Schaller"], "character": ["Der Clown", "Claudia Diehl", "Tobias 'Dobbs' Steiger", "Joseph Ludowski", "Führmann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16678   Expand Der Clown   (1998) User Score Overview Der Clown was a German television series that ran between 21 April 1998 and 11 October 2001. It ran for 46 episodes, and starred Sven Martinek, Diana Frank, Thomas Anzenhofer and Volkmar Kleinert. Der Clown was also a 2005 film. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sven Martinek Der Clown Diana Frank Claudia Diehl Thomas Anzenhofer Tobias 'Dobbs' Steiger Volkmar Kleinert Joseph Ludowski Andreas Schmidt-Schaller Führmann Full Cast & Crew Last Season The clown season 6 2001 | 6 Episodes Season 6 of Der Clown premiered on September  6, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Der Clown. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  93m Homepage  - Genres Crime Action & Adventure Keywords police agent Content Score 86 Almost there... Top Contributors S 36 Samara z 10 zurman1 d 9 denis t 8 tmdb61358576  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}