{"link": "https://www.themoviedb.org/tv/38937?language=en", "title": "Khloe & Lamar", "resume": "Khloé & Lamar is an American reality television series that debuted on E! in the United States and Canada on April 10, 2011. The series is the third spin-off of the show Keeping Up with the Kardashians and features reality star Khloé Kardashian Odom and her husband, basketball player Lamar Odom. The series returned for its second season on February 19, 2012. Khloe has mentioned that the series is on an indefinite hiatus but is not canceled.", "rate": 10, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38937   Expand Khloe & Lamar   (2011) User Score  Play Trailer Overview Khloé & Lamar is an American reality television series that debuted on E! in the United States and Canada on April 10, 2011. The series is the third spin-off of the show Keeping Up with the Kardashians and features reality star Khloé Kardashian Odom and her husband, basketball player Lamar Odom. The series returned for its second season on February 19, 2012. Khloe has mentioned that the series is on an indefinite hiatus but is not canceled. Featured Crew Ryan Seacrest Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2012 | 12 Episodes Season 2 of Khloe & Lamar premiered on February 19, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2011-01-23 Kourtney and Kim Take New York 1.0    2009-08-16 Kourtney and Khloé Take Miami 1.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.eonline.com/on/shows/khloe_and_lamar/index.html Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 5 d00ziie PS 3 P. Snoopy s 3 speedycars D 1 DoiD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}