{"link": "https://www.themoviedb.org/tv/71680?language=en", "title": "Spirit: Riding Free", "resume": "In a small Western town, spunky ex-city girl Lucky forms a tight bond with wild horse Spirit while having adventures with best pals Pru and Abigail.", "rate": 63, "genre": ["Kids", "Animation"], "cast": ["Amber Frank", "Sydney Park", "Bailey Gambertoglio"], "character": ["Lucky Prescott (voice)", "Pru Granger (voice)", "Abigail Stone (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71680   Expand Spirit: Riding Free   (2017) User Score  Play Trailer Overview In a small Western town, spunky ex-city girl Lucky forms a tight bond with wild horse Spirit while having adventures with best pals Pru and Abigail. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  2 Featurettes  2 Opening Credits  1 Top Billed Cast Amber Frank Lucky Prescott (voice) Sydney Park Pru Granger (voice) Bailey Gambertoglio Abigail Stone (voice) Full Cast & Crew Current Season Season 5 2018 | 7 Episodes Season 5 of Spirit: Riding Free premiered on May 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  6 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Spirit: Riding Free. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  24m Homepage   https://www.netflix.com/title/80115432 Genres Kids Animation Keywords horse Content Score 64 We're so close, yet so far. Top Contributors 40 Elizabeth Jennings TB 6 TMDb Bot 5 clapton O 5 OnNeVitQue2FoisJB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}