{"link": "https://www.themoviedb.org/tv/30321?language=en", "title": "A 4x4 is Born", "resume": "Watch and enjoy as Mark Evans turns an old rust-bucket Range Rover rescued from the scrap-heap and transforms it into the ultimate boulder-crawling beauty! When complete, Mark reckons the vehicle will virtually be able to climb a vertical wall! The extreme 3.5 litre, V8 powered, R380 gearboxed off-roader, custom built from scratch by Mark, also boasts some serious off-road kit, including: an outrageous hi-lift suspension system; a hand-made, one-off roll-cage & a specially modified twin-tank fuel system.", "rate": 100, "genre": ["Documentary"], "cast": ["Mark Evans"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30321   Expand A 4x4 is Born User Score Overview Watch and enjoy as Mark Evans turns an old rust-bucket Range Rover rescued from the scrap-heap and transforms it into the ultimate boulder-crawling beauty! When complete, Mark reckons the vehicle will virtually be able to climb a vertical wall! The extreme 3.5 litre, V8 powered, R380 gearboxed off-roader, custom built from scratch by Mark, also boasts some serious off-road kit, including: an outrageous hi-lift suspension system; a hand-made, one-off roll-cage & a specially modified twin-tank fuel system. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark Evans Full Cast & Crew Last Season Season 1 2004 | 15 Episodes Season 1 of A 4x4 is Born premiered on July 20, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors t 4 thaviper  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}