{"link": "https://www.themoviedb.org/tv/64409?language=en", "title": "Bang Baaja Baaraat", "resume": "Two people from very different backgrounds fall in love and decide to get married, but not without their parents blessings. Three days before the wedding they introduce each other with their respective parents and all hell breaks lose.", "rate": 87, "genre": ["Comedy", "Drama"], "cast": ["Angira Dhar", "Ayesha Raza", "Ali Fazal", "Rajit Kapoor", "Shernaz Patel"], "character": ["Shahana Arora", "Roli Sharma", "Pawan Sharma", "Ranjeet Arora", "Sushmita Ghosh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64409   Expand Bang Baaja Baaraat   (2015) User Score Overview Two people from very different backgrounds fall in love and decide to get married, but not without their parents blessings. Three days before the wedding they introduce each other with their respective parents and all hell breaks lose. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angira Dhar Shahana Arora Ayesha Raza Roli Sharma Ali Fazal Pawan Sharma Rajit Kapoor Ranjeet Arora Shernaz Patel Sushmita Ghosh Full Cast & Crew Last Season Season 1 2015 | 5 Episodes Season 1 of Bang Baaja Baaraat premiered on November  4, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   2015-06-03 TVF Pitchers 6.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Drama Keywords marriage romance culture Content Score 86 Almost there... Top Contributors 17 anshdedha7 d 12 dertrand 6 Banana 6 Fariduzzaman Xenar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}