{"link": "https://www.themoviedb.org/tv/77016?language=en", "title": "Danser pour gagner", "resume": "This competitive dance reality show pitts Quebec's best street and studio dance crews against each other. Each week one team will be eliminated until the final team is left standing and wins the title of \"Best Dance Crew in Quebec\".", "rate": 0, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77016   Expand Danser pour gagner   (2018) User Score Overview This competitive dance reality show pitts Quebec's best street and studio dance crews against each other. Each week one team will be eliminated until the final team is left standing and wins the title of \"Best Dance Crew in Quebec\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 47 Episodes Season 1 of Danser pour gagner premiered on January 24, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Danser pour gagner. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification G Meaning Suitable for general audiences. Programming suitable for the entire family with mild violence, and mild profanity and/or censored language. Type  Reality Original Language  French Runtime  22m Homepage   https://noovo.ca/emissions/danser-pour-gagner Genres Reality Keywords dance dance crew reality competition dance competition Content Score 56 We're so close, yet so far. Top Contributors 23 Banana e 8 ecjl 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}