{"link": "https://www.themoviedb.org/tv/34896?language=en", "title": "Moon Lovers", "resume": "Tsuki no Koibito ~Moon Lovers~ is a Japanese television drama starting on Fuji TV on 10 May 2010. The drama is known also under the Japanese short name Getsukoi.", "rate": 100, "genre": ["Drama"], "cast": ["Takuya Kimura", "Keiko Kitagawa", "Lin Chi-Ling", "Ryoko Shinohara", "Shota Matsuda"], "character": ["Rensuke Hazuki", "Ōnuki Yuzuki", "Liu Xiu Mei", "Maemi Ninomiya", "Sai Kazami/Cai Feng Jian"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34896   Expand Moon Lovers   (2010) User Score Overview Tsuki no Koibito ~Moon Lovers~ is a Japanese television drama starting on Fuji TV on 10 May 2010. The drama is known also under the Japanese short name Getsukoi. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Kimura Rensuke Hazuki Keiko Kitagawa Ōnuki Yuzuki Lin Chi-Ling Liu Xiu Mei Ryoko Shinohara Maemi Ninomiya Shota Matsuda Sai Kazami/Cai Feng Jian Full Cast & Crew Last Season ~moon lovers~ season 1 2010 | 9 Episodes Season 1 of Moon Lovers premiered on May 10, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Moon Lovers. You can help by rating TV shows you've seen. Facts Original Name  月の恋人 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.fujitv.co.jp/b_hp/getsukoi/index.html Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 19 Aka75 A 1 Aukland t 1 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}