{"link": "https://www.themoviedb.org/tv/74018?language=en", "title": "The Legend of the Galactic Heroes: Die Neue These", "resume": "In humanity's distant future, two interstellar states—the monarchic Galactic Empire and the democratic Free Planets Alliance—are embroiled in a never-ending war. The story focuses on the exploits of rivals Reinhard von Müsel and Yang Wen Li as they rise to power and fame in the Galactic Empire and the Free Planets Alliance.", "rate": 63, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy", "War", "Politics"], "cast": ["Mamoru Miyano", "Kenichi Suzumura", "Yuuichirou Umehara", "Ryouta Takeuchi", "Aya Endo"], "character": ["Reinhard von Lohengramm (voice)", "Yang Wen-Li (voice)", "Siegfried Kircheis (voice)", "Adalbert von Fahrenheit (voice)", "Frederica Greenhill (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74018   Expand The Legend of the Galactic Heroes: Die Neue These   (2018) User Score  Play Trailer Overview In humanity's distant future, two interstellar states—the monarchic Galactic Empire and the democratic Free Planets Alliance—are embroiled in a never-ending war. The story focuses on the exploits of rivals Reinhard von Müsel and Yang Wen Li as they rise to power and fame in the Galactic Empire and the Free Planets Alliance. Featured Crew Noboru Takagi Creator Shunsuke Tada Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamoru Miyano Reinhard von Lohengramm (voice) Kenichi Suzumura Yang Wen-Li (voice) Yuuichirou Umehara Siegfried Kircheis (voice) Ryouta Takeuchi Adalbert von Fahrenheit (voice) Aya Endo Frederica Greenhill (voice) Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of The Legend of the Galactic Heroes: Die Neue These premiered on April  1, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Legend of the Galactic Heroes: Die Neue These. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on The Legend of the Galactic Heroes: Die Neue These. You can help by rating TV shows you've seen. Facts Original Name  銀河英雄伝説 Die Neue These 邂逅 Status  Returning Series Networks - Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.gineiden-anime.com/ Genres Action & Adventure Animation Sci-Fi & Fantasy War & Politics Keywords based on novel or book space travel remake military anime Content Score 100 Yes! Looking good! Top Contributors 34 YabukiJoe1 24 sp1ti 24 Mikedeth5 13 neonime  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}