{"link": "https://www.themoviedb.org/tv/14314?language=en", "title": "The Money Programme", "resume": "The Money Programme was a finance and business affairs television programme on BBC Two which had a long run\nIt was first broadcast on 5 April 1966 and presented by \"commentators\" William Davis, Erskine B. Childers and Joe Roeber. At this time David Attenborough was the controller of BBC2. The programme has a memorable theme tune, a version of the main title theme from The Carpetbaggers film by Lalo Schifrin\nSince the start the programme used a magazine style, but changed to a single subject documentary in 2001. More recently the programme has formed a partnership with the Open University Business School. The Open University provides input into programmes and supplementary materials written by OU Business School academics.\nOn 1 June 2007, an episode of the Money Programme called \"Virtual World / Real Millions\" became the first full BBC programme to have been broadcast inside the virtual world Second Life. That episode featured an interview with Second Life founder and CEO Philip Rosedale amongst others.\nThis programme was parodied in Series 3 of Monty Python's Flying Circus as the opening sketch of the third episode in that series first airing on the BBC 3 November 1972.", "rate": 0, "genre": ["News"], "cast": ["Jeremy Clarkson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14314   Expand The Money Programme   (1966) User Score Overview The Money Programme was a finance and business affairs television programme on BBC Two which had a long run It was first broadcast on 5 April 1966 and presented by \"commentators\" William Davis, Erskine B. Childers and Joe Roeber. At this time David Attenborough was the controller of BBC2. The programme has a memorable theme tune, a version of the main title theme from The Carpetbaggers film by Lalo Schifrin Since the start the programme used a magazine style, but changed to a single subject documentary in 2001. More recently the programme has formed a partnership with the Open University Business School. The Open University provides input into programmes and supplementary materials written by OU Business School academics. On 1 June 2007, an episode of the Money Programme called \"Virtual World / Real Millions\" became the first full BBC programme to have been broadcast inside the virtual world Second Life. That episode featured an interview with Second Life founder and CEO Philip Rosedale amongst others. This programme was parodied in Series 3 of Monty Python's Flying Circus as the opening sketch of the third episode in that series first airing on the BBC 3 November 1972. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeremy Clarkson Full Cast & Crew Last Season Season 2010 2010 | 2 Episodes Season 2010 of The Money Programme premiered on November  9, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Money Programme. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/moneyprogramme/ Genres News Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors Y 2 YRV  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}