{"link": "https://www.themoviedb.org/tv/69800?language=en", "title": "Kerana Anisa", "resume": "Tells the story of Anisa and Shukri were good friends in the village. Anisa has big dreams in life when dreams of becoming a lawyer and ask Shukri become 'teachers' and booster spirit.\nHowever, Alice's father, Long Yahya against Shukri friendship and Anisa. After Anisa end Sijil Pelajaran Malaysia (SPM), Shukri went to London to continue his studies, but their relationship through letters.\nOne day, Alice is shocked by the proposal of the delegation Zahid. Anisa Zahid captivated by the beauty and the richness of his parents to buy walid heart. Anisa against because she wanted to continue her education, she passed the SPM coupled with excellent all. However, Alice is still forced to marry. After marriage, Zahid acted cruelly toward outward and inward Anisa.\nIn fact, Anisa Zahid getting hurt when he found out about the relationship of Anisa and Shukri.", "rate": 0, "genre": ["Drama"], "cast": ["Mustaqim Bahadon", "Zara Zya", "Fahrin Ahmad", "Sura Sojangi", "Aman Graseka"], "character": ["Syukri", "Anisa", "Zahid", "Adira", "Long Yahya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69800   Expand Kerana Anisa   (2017) User Score Overview Tells the story of Anisa and Shukri were good friends in the village. Anisa has big dreams in life when dreams of becoming a lawyer and ask Shukri become 'teachers' and booster spirit. However, Alice's father, Long Yahya against Shukri friendship and Anisa. After Anisa end Sijil Pelajaran Malaysia (SPM), Shukri went to London to continue his studies, but their relationship through letters. One day, Alice is shocked by the proposal of the delegation Zahid. Anisa Zahid captivated by the beauty and the richness of his parents to buy walid heart. Anisa against because she wanted to continue her education, she passed the SPM coupled with excellent all. However, Alice is still forced to marry. After marriage, Zahid acted cruelly toward outward and inward Anisa. In fact, Anisa Zahid getting hurt when he found out about the relationship of Anisa and Shukri. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mustaqim Bahadon Syukri Zara Zya Anisa Fahrin Ahmad Zahid Sura Sojangi Adira Aman Graseka Long Yahya Full Cast & Crew Last Season Season 1 2017 | 15 Episodes Season 1 of Kerana Anisa premiered on January  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Kerana Anisa. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Malay Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors v 22 vplaytv M 2 Mr_Democracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}