{"link": "https://www.themoviedb.org/tv/2211?language=en", "title": "'Allo 'Allo!", "resume": "'Allo 'Allo! is a British sitcom broadcast on BBC One from 1982 to 1992 comprising eighty-five episodes. It is a parody of another BBC programme, the wartime drama Secret Army. 'Allo, 'Allo! was created by David Croft, who also wrote the theme music, and Jeremy Lloyd. Lloyd and Croft wrote the first six series. The remaining series were written by Lloyd and Paul Adam.  The show tells the fictitious story of Rene Artois, a café owner in a small town in Nazi occupied France, who reluctantly helps the French resistance in their various schemes, the main of which is to help hide British airmen from the Germans. At the same time, he has to hide artefacts such as famous paintings for the German soldiers who frequent his café, while trying to keep his affairs with his waitresses secret from his wife. The comedy is a combination of wordplay, farce, slapstick, and sexual innuendo. Unlike most sitcoms, the episodes build on previous ones, requiring viewers to watch the series chronologically in order to fully understand the plot. In 2004, 'Allo 'Allo came 13th in Britain's Best Sitcom. A reunion special, comprising new material, archive clips and specially recorded interviews, was broadcast on 28 April 2007 on BBC Two.", "rate": 78, "genre": ["Comedy", "War", "Politics"], "cast": ["Carmen Silvera", "Vicki Michelle", "Guy Siner", "Kirsten Cooke", "Kim Hartman"], "character": ["Edith Melba Artois", "Yvette Carte-Blanche", "Teniente Hubert Gruber", "Michelle Dubois", "vojín Helga Geerhart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2211   Expand 'Allo 'Allo!   (1984) User Score Overview 'Allo 'Allo! is a British sitcom broadcast on BBC One from 1982 to 1992 comprising eighty-five episodes. It is a parody of another BBC programme, the wartime drama Secret Army. 'Allo, 'Allo! was created by David Croft, who also wrote the theme music, and Jeremy Lloyd. Lloyd and Croft wrote the first six series. The remaining series were written by Lloyd and Paul Adam.  The show tells the fictitious story of Rene Artois, a café owner in a small town in Nazi occupied France, who reluctantly helps the French resistance in their various schemes, the main of which is to help hide British airmen from the Germans. At the same time, he has to hide artefacts such as famous paintings for the German soldiers who frequent his café, while trying to keep his affairs with his waitresses secret from his wife. The comedy is a combination of wordplay, farce, slapstick, and sexual innuendo. Unlike most sitcoms, the episodes build on previous ones, requiring viewers to watch the series chronologically in order to fully understand the plot. In 2004, 'Allo 'Allo came 13th in Britain's Best Sitcom. A reunion special, comprising new material, archive clips and specially recorded interviews, was broadcast on 28 April 2007 on BBC Two. Featured Crew David Croft Creator Jeremy Lloyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carmen Silvera Edith Melba Artois Vicki Michelle Yvette Carte-Blanche Guy Siner Teniente Hubert Gruber Kirsten Cooke Michelle Dubois Kim Hartman vojín Helga Geerhart Full Cast & Crew Last Season Season 9 1992 | 6 Episodes Season 9 of 'Allo 'Allo! premiered on November  9, 1992. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Is this an accurate portrayal of occupied France in WW2? Open 0 by Gus Gorman\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  6 Recommendations   1975-09-19 Fawlty Towers 8.1    1995-11-13 The Thin Blue Line 7.3    1976-02-20 Open All Hours 7.7    1962-01-04 Steptoe and Son 8.2    1983-06-15 Blackadder 7.8    1974-09-05 Porridge 8.3    1990-10-29 Keeping Up Appearances 7.4    1982-09-30 Cheers 7.5  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy War & Politics Keywords small town mother prostitute france waitress escape wife world war ii prisoner of war painting dark comedy surreal british army radio satire parody workplace slapstick breaking the fourth wall french resistance farce royal air force undertaker soldier cafe gestapo dungeon double entendre sitcom 1940s forger british humour period sitcom german army affair chateau Content Score 93 Almost there... Top Contributors O 44 Ozbourne 37 rasasak M 19 Magicus 13 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}