{"link": "https://www.themoviedb.org/tv/1089?language=en", "title": "Zehu Ze!", "resume": "Zehu Ze! was a long-running Israeli entertainment television program produced by Israeli Educational Television and broadcast on the Israeli Channel 1 and Channel 2 on which the IETV has special broadcasting hours. The program ran regularly from 1978 to 1998.\nThe program was first promoted as a youth program. It was originally several comedy segments. From the start of the 1980s, the whole episode focused on one subject. The show's length was about one hour and it was shown live on Thursdays at 4pm; re-runs were shown the next day at 1:30pm.\nDue to its quality, and the status of the Israeli Channel 1 as Israel's only channel until 1993, the show became very popular.\nPlots of the episodes revolved around different subjects related to life in Israel, fashions like Folk dancing, tributes to classics like Charlie Chaplin movies, or contemporary series like The Simpsons and Dallas.", "rate": 0, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1089   Expand Zehu Ze! User Score Overview Zehu Ze! was a long-running Israeli entertainment television program produced by Israeli Educational Television and broadcast on the Israeli Channel 1 and Channel 2 on which the IETV has special broadcasting hours. The program ran regularly from 1978 to 1998. The program was first promoted as a youth program. It was originally several comedy segments. From the start of the 1980s, the whole episode focused on one subject. The show's length was about one hour and it was shown live on Thursdays at 4pm; re-runs were shown the next day at 1:30pm. Due to its quality, and the status of the Israeli Channel 1 as Israel's only channel until 1993, the show became very popular. Plots of the episodes revolved around different subjects related to life in Israel, fashions like Folk dancing, tributes to classics like Charlie Chaplin movies, or contemporary series like The Simpsons and Dallas. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}