{"link": "https://www.themoviedb.org/tv/67018?language=en", "title": "The Legend of the Blue Sea", "resume": "How can a mermaid from the Joseon era survive in modern-day Seoul? Shim Chung is a mermaid who finds herself transplanted to modern times. She is caught by Heo Joon Jae, a charming but cold con artist who is the doppelgänger for Kim Moon, the son of a nobleman from the Joseon Dynasty. But in the present time, Joon Jae works with Jo Nam Doo, a skilled conman who guides Joon Jae to become a genius scammer. But Joon Jae’s friend, Cha Shi Ah, who works as a researcher at KAIST, may be Chung’s only hope for surviving in her strange new world.", "rate": 46, "genre": ["Comedy", "Drama"], "cast": ["Jun Ji-hyun", "Lee Min-ho", "Lee Hee-joon", "Shin Won-ho", "Lee Ji-hoon"], "character": ["Sim Chung", "Heo Joon-Jae / Kim Moo", "Jo Nam-Doo", "Tae-Oh", "Heo Chi-Hyun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67018   Expand The Legend of the Blue Sea   (2016) User Score Overview How can a mermaid from the Joseon era survive in modern-day Seoul? Shim Chung is a mermaid who finds herself transplanted to modern times. She is caught by Heo Joon Jae, a charming but cold con artist who is the doppelgänger for Kim Moon, the son of a nobleman from the Joseon Dynasty. But in the present time, Joon Jae works with Jo Nam Doo, a skilled conman who guides Joon Jae to become a genius scammer. But Joon Jae’s friend, Cha Shi Ah, who works as a researcher at KAIST, may be Chung’s only hope for surviving in her strange new world. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Ji-hyun Sim Chung Lee Min-ho Heo Joon-Jae / Kim Moo Lee Hee-joon Jo Nam-Doo Shin Won-ho Tae-Oh Lee Ji-hoon Heo Chi-Hyun Full Cast & Crew Last Season Season 1 2016 | 20 Episodes Season 1 of The Legend of the Blue Sea premiered on November 16, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Legend of the Blue Sea. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations   2016-08-27 Our Gap Soon 9.3    2016-09-21 On the Way to the Airport 8.7    2016-09-26 Woman with a Suitcase 7.1    2016-11-16 Oh My Geum Bi 8.7    2016-12-19 Hwarang: The Poet Warrior Youth 6.7    2016-09-21 Shopping King Louie 6.7    2016-03-18 Ms. Temper & Nam Jung Gi 6.0    2016-08-27 Blow Breeze 6.6  Facts Original Name  푸른 바다의 전설 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.sbs.co.kr/builder/programMainList.do?pgm_id=22000009983 Genres Comedy Drama Keywords mermaid con man promise past life Content Score 93 Almost there... Top Contributors M 66 Maria180493 a 10 asura766 z 10 zurman1 s 7 sheva_vitali  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}