{"link": "https://www.themoviedb.org/tv/63397?language=en", "title": "The Mind of a Chef", "resume": "Go inside the minds of some of the world's top chefs. Narrated by Executive Producer Anthony Bourdain, The Mind of a Chef is that rare and beautiful thing: an intelligent show about cooking.", "rate": 80, "genre": ["Documentary"], "cast": ["Anthony Bourdain", "Ludo Lefebvre"], "character": ["Narrator", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63397   Expand The Mind of a Chef   (2012) User Score  Play Trailer Overview Go inside the minds of some of the world's top chefs. Narrated by Executive Producer Anthony Bourdain, The Mind of a Chef is that rare and beautiful thing: an intelligent show about cooking. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anthony Bourdain Narrator Ludo Lefebvre Himself Full Cast & Crew Last Season Season 5 2016 | 14 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Mind of a Chef. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  30m Homepage   http://www.pbs.org/show/mind-chef/ Genres Documentary Keywords cooking travel food chef Content Score 64 We're so close, yet so far. Top Contributors 39 Elizabeth Jennings LC 4 Legit Corporation z 4 zurman1 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}