{"link": "https://www.themoviedb.org/tv/32173?language=en", "title": "Big Brother", "resume": "Veliki brat is a Serbian production of the global reality show franchise Big Brother. The show is recorded and produced in Belgrade by Emotion Production.\nOriginally, the show started of as Serbian production with housmates form Serbia, Bosnia and Herzegovina and Montenegro. Third season included housmates from Macedonia as well. For the fourth season Croatian broadcaster and producer RTL got involved, and auditions were held in Croatia, making the show pan-regional.\nIn Serbia, the show was often picked up by different channels. The first three regular series and three celebrity series were broadcast on B92 channel while the other two celebrity and the fourth regular series were brodcated on Pink. In Montenegro the show is broadcast by Pink M and Prva, in Bosnia-Herzegovina by Pink BH, OBN and BN, in Macedonia by A1 and Sitel, and in Croatia the show is broadcast by RTL respectively.", "rate": 0, "genre": ["Documentary"], "cast": ["Antonija Blaće", "Sky Wikluh"], "character": ["Host", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32173   Expand Big Brother User Score Overview Veliki brat is a Serbian production of the global reality show franchise Big Brother. The show is recorded and produced in Belgrade by Emotion Production. Originally, the show started of as Serbian production with housmates form Serbia, Bosnia and Herzegovina and Montenegro. Third season included housmates from Macedonia as well. For the fourth season Croatian broadcaster and producer RTL got involved, and auditions were held in Croatia, making the show pan-regional. In Serbia, the show was often picked up by different channels. The first three regular series and three celebrity series were broadcast on B92 channel while the other two celebrity and the fourth regular series were brodcated on Pink. In Montenegro the show is broadcast by Pink M and Prva, in Bosnia-Herzegovina by Pink BH, OBN and BN, in Macedonia by A1 and Sitel, and in Croatia the show is broadcast by RTL respectively. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antonija Blaće Host Sky Wikluh Host Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Original Name  Veliki brat Status  Ended Networks - Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  Serbian Runtime  - Homepage   http://www.velikibrat.rs Genres Documentary Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors 12 imjakedeason M 10 Mario_Gaborović 2 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}