{"link": "https://www.themoviedb.org/tv/63161?language=en", "title": "Crazy Ex-Girlfriend", "resume": "Rebecca Bunch is a successful, driven, and possibly crazy young woman who impulsively gives up everything - her partnership at a prestigious law firm and her upscale apartment in Manhattan - in a desperate attempt to find love and happiness in that exotic hotbed of romance and adventure: suburban West Covina, California.", "rate": 67, "genre": ["Comedy", "Music"], "cast": ["Rachel Bloom", "Donna Lynne Champlin", "Vincent Rodriguez III", "Pete Gardner", "Vella Lovell"], "character": ["Rebecca Bunch", "Paula Proctor", "Josh Chan", "Darryl Whitefeather", "Heather Davis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63161   Expand Crazy Ex-Girlfriend   (2015) User Score  Play Trailer Overview Rebecca Bunch is a successful, driven, and possibly crazy young woman who impulsively gives up everything - her partnership at a prestigious law firm and her upscale apartment in Manhattan - in a desperate attempt to find love and happiness in that exotic hotbed of romance and adventure: suburban West Covina, California. Featured Crew Aline Brosh McKenna Creator Rachel Bloom Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  1 Images Backdrops  10 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachel Bloom Rebecca Bunch Donna Lynne Champlin Paula Proctor Vincent Rodriguez III Josh Chan Pete Gardner Darryl Whitefeather Vella Lovell Heather Davis Full Cast & Crew Current Season Season 3 2017 | 13 Episodes View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Season 4 to be the last Open 1 by  gspgreases November 10th Episode with Spoilers Open 0 by TrentTX\n      \n     November 3rd Episode  (With Spoilers) Open 1 by  Master_YODA Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  9 Recommendations   2012-10-29 Wizards vs Aliens 6.7    2011-01-10 Pop Pixie 6.0    2015-10-06 Chewing Gum 7.0    2014-09-30 Happyland 3.3    2014-01-06 Some Assembly Required 4.7    2015-09-02 Atelier 7.2    2011-04-02 Tiger & Bunny 6.5    2016-06-02 Hibana: Spark 7.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cwtv.com/shows/crazy-ex-girlfriend Genres Comedy Music Keywords california ex-lover musical relationship searching for love Content Score 100 Yes! Looking good! Top Contributors 88 Banana 35 Elizabeth Jennings 14 Gabriel W. Almeida a 11 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}