{"link": "https://www.themoviedb.org/tv/1242?language=en", "title": "Greek", "resume": "Casey Cartwright is poised to become the most powerful girl in the Greek system. Rusty, her little brother, is new on campus and he's the geek. But he sees Cyprus-Rhodes University as an opportunity to create a whole new identity.", "rate": 69, "genre": ["Comedy", "Drama"], "cast": ["Clark Duke", "Spencer Grammer", "Amber Stevens", "Jacob Zachar", "Dilshad Vadsaria"], "character": ["Dale Kettlewell", "Casey Cartwright", "Ashleigh Howard", "Rusty Cartwright", "Rebecca Logan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1242   Expand Greek   (2007) User Score Overview Casey Cartwright is poised to become the most powerful girl in the Greek system. Rusty, her little brother, is new on campus and he's the geek. But he sees Cyprus-Rhodes University as an opportunity to create a whole new identity. Featured Crew Patrick Sean Smith Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  18 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clark Duke Dale Kettlewell Spencer Grammer Casey Cartwright Amber Stevens Ashleigh Howard Jacob Zachar Rusty Cartwright Dilshad Vadsaria Rebecca Logan Full Cast & Crew Last Season Season 4 2011 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  18 Posters  1 Recommendations   2011-05-02 Case Sensitive 5.4    2011-01-12 Off the Map 6.9    2016-06-08 Power Monkeys 7.0    2014-01-10 Enlisted 6.2    2003-09-26 Joan of Arcadia 6.6    2006-01-01 In Justice 6.8    2009-02-11 Important Things with Demetri Martin 6.6    2009-06-22 Make It or Break It 6.6  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m, 45m Homepage   http://freeform.go.com/shows/greek Genres Comedy Drama Keywords college sorority student fraternity young adult Content Score 93 Almost there... Top Contributors 49 Banana 7 Ivana b 5 bugfix V 4 Vincent7778  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}