{"link": "https://www.themoviedb.org/tv/10393?language=en", "title": "The Adventures of Robin Hood", "resume": "The Adventures of Robin Hood is a British television series comprising 143 half-hour, black and white episodes broadcast weekly between 1955 and 1959 on ITV. It stars Richard Greene as the outlaw Robin Hood and Alan Wheatley as his nemesis, the Sheriff of Nottingham. The show followed the legendary character Robin Hood and his band of merry men in Sherwood Forest and the surrounding vicinity. While some episodes dramatised the traditional Robin Hood tales, most episodes were original dramas created by the show's writers and producers.\nThe programme was produced by Sapphire Films Ltd for ITC Entertainment, was filmed at Nettlefold Studios with some location work, and was the first of many pre-filmed shows commissioned by Lew Grade. In 1954, Grade was approached by American producer Hannah Weinstein to finance a series of 39 half hour episodes, at a budget of £10,000 an episode, of a series she wished to make called 'The Adventures of Robin Hood', for which she had already signed Richard Greene to the project as Robin Hood and been given the backing of US distribution company, Official Films Inc, who were confident of selling it to the US market. Grade was so impressed by her proposal that he agreed immediately to back the series, hoping to make large profits by selling programmes to the lucrative American market. In the UK, the series premiered on ATV London, on Sunday 25 September 1955 the US premiere was on Monday 26 September 1955 by CBS, ATV Midlands began the series on Friday 17 February 1956, the series had a staggered start across the other regions from 1956-1961 as the ITV regional stations came on-air for the first time in the UK. The series was shot on 35mm film to provide the best possible picture quality, and had fade-outs where US commercials were intended to slot in.", "rate": 65, "genre": ["Drama"], "cast": ["Richard Greene", "Archie Duncan", "Alexander Gauge", "Alan Wheatley", "Bernadette O'Farrell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10393   Expand The Adventures of Robin Hood   (1955) User Score Overview The Adventures of Robin Hood is a British television series comprising 143 half-hour, black and white episodes broadcast weekly between 1955 and 1959 on ITV. It stars Richard Greene as the outlaw Robin Hood and Alan Wheatley as his nemesis, the Sheriff of Nottingham. The show followed the legendary character Robin Hood and his band of merry men in Sherwood Forest and the surrounding vicinity. While some episodes dramatised the traditional Robin Hood tales, most episodes were original dramas created by the show's writers and producers. The programme was produced by Sapphire Films Ltd for ITC Entertainment, was filmed at Nettlefold Studios with some location work, and was the first of many pre-filmed shows commissioned by Lew Grade. In 1954, Grade was approached by American producer Hannah Weinstein to finance a series of 39 half hour episodes, at a budget of £10,000 an episode, of a series she wished to make called 'The Adventures of Robin Hood', for which she had already signed Richard Greene to the project as Robin Hood and been given the backing of US distribution company, Official Films Inc, who were confident of selling it to the US market. Grade was so impressed by her proposal that he agreed immediately to back the series, hoping to make large profits by selling programmes to the lucrative American market. In the UK, the series premiered on ATV London, on Sunday 25 September 1955 the US premiere was on Monday 26 September 1955 by CBS, ATV Midlands began the series on Friday 17 February 1956, the series had a staggered start across the other regions from 1956-1961 as the ITV regional stations came on-air for the first time in the UK. The series was shot on 35mm film to provide the best possible picture quality, and had fade-outs where US commercials were intended to slot in. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Greene Archie Duncan Alexander Gauge Alan Wheatley Bernadette O'Farrell Full Cast & Crew Last Season Season 4 1959 | 26 Episodes Season 4 of The Adventures of Robin Hood premiered on November 21, 1959. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of Robin Hood. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 2 Samara A 1 Andras62 1 t0by 1 rpeters  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}