{"link": "https://www.themoviedb.org/tv/251?language=en", "title": "Aqua Teen Hunger Force", "resume": "Aqua Teen Hunger Force is an American animated television series on Cartoon Network's late night programming block, Adult Swim. The series made its official debut on September 9, 2001 on Adult swim; after the pilot episode was aired as a special sneak peek on Cartoon Network on December 30, 2000. The show is about the surreal adventures of three anthropomorphic fast food items: Master Shake, Frylock and Meatwad, and their human nextdoor neighbor, Carl Brutananadilewski.\nAqua Teen Hunger Force is one of the spin-offs of the show Space Ghost Coast to Coast, and as of 2013, the longest running original series on Adult Swim, as well as one of the top 10 longest-running American animated television series of all time. Each episode is written and directed by series creators Dave Willis and Matt Maiellaro, who also provide several voices. As of 2011 each season is given a different alternative title accompanied by a different opening sequence as a running gag by the creators. Aqua Teen Hunger Force: The Movie, a film adaption of the series was released in theaters on April 13, 2007, marking the first time an Adult Swim series has been adapted into a movie.", "rate": 74, "genre": ["Animation", "Comedy"], "cast": ["Dave Willis", "Dana Snyder", "Carey Means", "C. Martin Croker", "Schoolly D"], "character": ["Meatwad / Carl (voice)", "Master Shake (voice)", "Frylock (voice)", "Dr. Weird / Steve / Bird (voice)", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 251   Expand Aqua Teen Hunger Force   (2000) User Score  Play Trailer Overview Aqua Teen Hunger Force is an American animated television series on Cartoon Network's late night programming block, Adult Swim. The series made its official debut on September 9, 2001 on Adult swim; after the pilot episode was aired as a special sneak peek on Cartoon Network on December 30, 2000. The show is about the surreal adventures of three anthropomorphic fast food items: Master Shake, Frylock and Meatwad, and their human nextdoor neighbor, Carl Brutananadilewski. Aqua Teen Hunger Force is one of the spin-offs of the show Space Ghost Coast to Coast, and as of 2013, the longest running original series on Adult Swim, as well as one of the top 10 longest-running American animated television series of all time. Each episode is written and directed by series creators Dave Willis and Matt Maiellaro, who also provide several voices. As of 2011 each season is given a different alternative title accompanied by a different opening sequence as a running gag by the creators. Aqua Teen Hunger Force: The Movie, a film adaption of the series was released in theaters on April 13, 2007, marking the first time an Adult Swim series has been adapted into a movie. Featured Crew Matt Maiellaro Creator Dave Willis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Willis Meatwad / Carl (voice) Dana Snyder Master Shake (voice) Carey Means Frylock (voice) C. Martin Croker Dr. Weird / Steve / Bird (voice) Schoolly D Narrator Full Cast & Crew Last Season Aqua Teen Hunger Force Forever  2015 | 9 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  12 Posters  6 Recommendations   2004-11-07 Squidbillies 6.2    2005-02-20 Robot Chicken 7.1    1994-04-15 Space Ghost Coast to Coast 8.3    2000-12-21 Sealab 2021 7.8    2004-08-07 The Venture Bros. 8.2    2000-12-21 The Brak Show 7.0    2000-12-30 Harvey Birdman, Attorney at Law 7.7    2006-08-06 Metalocalypse 6.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  11m Homepage   http://www.adultswim.com/shows/aquateenhungerforce/index.html Genres Animation Comedy Keywords roommate anthropomorphism cartoon food Content Score 100 Yes! Looking good! Top Contributors A 48 AnthonyAtkins232 35 Elizabeth Jennings 18 lineker 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}