{"link": "https://www.themoviedb.org/tv/42193?language=en", "title": "The Bleak Old Shop of Stuff", "resume": "A Victorian comedy adventure in the style of Charles Dickens following shop owner Jedrington Secret-Past. Jedrington teams up with a seemingly charming new business partner, Harmswell Grimstone. As the Secret-Past family's fortunes rise, it looks like they are built on crumbling foundations indeed, especially when it is revealed that Conceptiva too has a secret that turns out to be even darker than Jedrington's own.", "rate": 67, "genre": ["Comedy"], "cast": ["Robert Webb", "Katherine Parkinson", "Finlay Christie", "Ambra Lily Keegan", "Tim McInnerny"], "character": ["Jedrington Secret-Past", "Conceptiva", "Victor", "Victoria", "Harmswell Grimstone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42193   Expand The Bleak Old Shop of Stuff   (2012) User Score  Play Trailer Overview A Victorian comedy adventure in the style of Charles Dickens following shop owner Jedrington Secret-Past. Jedrington teams up with a seemingly charming new business partner, Harmswell Grimstone. As the Secret-Past family's fortunes rise, it looks like they are built on crumbling foundations indeed, especially when it is revealed that Conceptiva too has a secret that turns out to be even darker than Jedrington's own. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Webb Jedrington Secret-Past Katherine Parkinson Conceptiva Finlay Christie Victor Ambra Lily Keegan Victoria Tim McInnerny Harmswell Grimstone Full Cast & Crew Last Season Season 1 2012 | 3 Episodes Season 1 of The Bleak Old Shop of Stuff premiered on February 20, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   2014-04-29 Playing House 7.4    2014-08-07 Garfunkel and Oates 7.5    2011-09-22 Whitney 3.8    2013-09-26 The Michael J. Fox Show 5.6    2012-09-25 Ben and Kate 5.9    2007-02-01 The Sarah Silverman Program 5.8    2013-07-09 Drunk History 7.2    2011-09-21 Fresh Meat 7.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b0195ngq Genres Comedy Keywords london england parody victorian england miniseries charles dickens british humour Content Score 93 Almost there... Top Contributors 24 Elizabeth Jennings 7 Banana R 7 Rebecca w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}