{"link": "https://www.themoviedb.org/tv/5021?language=en", "title": "The Waltons", "resume": "The Waltons is an American television series created by Earl Hamner, Jr., based on his book Spencer's Mountain, and a 1963 film of the same name. The show is centered on a family in a rural Virginia community during the Great Depression and World War II.\nThe series pilot aired as a television movie entitled The Homecoming: A Christmas Story and was broadcast on December 19, 1971. Beginning in September 1972, the series originally aired on CBS for a total of nine seasons. After the series was canceled in 1981, three television movie sequels followed in 1982, with three more in the 1990s. The Waltons was produced by Lorimar Productions and distributed by Warner Bros. Domestic Television Distribution in syndication.", "rate": 69, "genre": ["Drama"], "cast": ["Ralph Waite", "Michael Learned", "Richard Thomas", "Will Geer", "Ellen Corby"], "character": ["John Walton Sr.", "Olivia Walton", "John-boy Walton", "Zebulon Tyler Walton (grandfather)", "Ester Walton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5021   Expand The Waltons   (1972) User Score  Play Trailer Overview The Waltons is an American television series created by Earl Hamner, Jr., based on his book Spencer's Mountain, and a 1963 film of the same name. The show is centered on a family in a rural Virginia community during the Great Depression and World War II. The series pilot aired as a television movie entitled The Homecoming: A Christmas Story and was broadcast on December 19, 1971. Beginning in September 1972, the series originally aired on CBS for a total of nine seasons. After the series was canceled in 1981, three television movie sequels followed in 1982, with three more in the 1990s. The Waltons was produced by Lorimar Productions and distributed by Warner Bros. Domestic Television Distribution in syndication. Featured Crew Earl Hamner, Jr. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ralph Waite John Walton Sr. Michael Learned Olivia Walton Richard Thomas John-boy Walton Will Geer Zebulon Tyler Walton (grandfather) Ellen Corby Ester Walton Full Cast & Crew Last Season Season 9 1980 | 22 Episodes Season 9 of The Waltons premiered on November 27, 1980. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply t Essential viewing for all the family Open 2 by  Jake Styvesant Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   1983-10-03 Scarecrow and Mrs. King 5.5    1954-09-12 Lassie 5.3    1970-09-17 The Flip Wilson Show 3.7    1963-09-29 My Favorite Martian 5.4    1974-09-11 Little House on the Prairie 7.0    1970-02-15 Catweazle 6.0    1987-03-09 Full House: Rags to Riches 8.0    1955-09-25 The Adventures of Robin Hood 4.3  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords small town world war ii big family great depression family 1940s 1930s Content Score 100 Yes! Looking good! Top Contributors n 18 nnwrz w 16 wonder2wonder 15 Banana m 12 mode2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}