{"link": "https://www.themoviedb.org/tv/69595?language=en", "title": "Sammy J & Randy in Ricketts Lane", "resume": "Sammy J is an obsessive, socially inept and altogether hopeless junior lawyer scrambling to hold onto his last ounce of dignity while clinging to the bottom rung of the corporate ladder.  Meanwhile, his slovenly housemate Randy has seen the world from all angles.  He's an opinionated, unemployed opportunist, desperately trying to win back the affections of his glamorous ex-wife... and he's a purple puppet.\nWhile they’re loyal, eccentric and prone to burst into hilarious song at any given moment, tensions between the man and puppet will soon rise.", "rate": 80, "genre": ["Comedy"], "cast": ["Sammy J", "Heath McIvor", "Georgia Chara", "Nathan Lovejoy", "Sam Healy"], "character": ["Himself", "Randy", "Wednesday", "Borkman", "Victoria Vincent"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69595   Expand Sammy J & Randy in Ricketts Lane   (2015) User Score  Play Trailer Overview Sammy J is an obsessive, socially inept and altogether hopeless junior lawyer scrambling to hold onto his last ounce of dignity while clinging to the bottom rung of the corporate ladder.  Meanwhile, his slovenly housemate Randy has seen the world from all angles.  He's an opinionated, unemployed opportunist, desperately trying to win back the affections of his glamorous ex-wife... and he's a purple puppet. While they’re loyal, eccentric and prone to burst into hilarious song at any given moment, tensions between the man and puppet will soon rise. Featured Crew Sammy J Creator Heath McIvor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sammy J Himself Heath McIvor Randy Georgia Chara Wednesday Nathan Lovejoy Borkman Sam Healy Victoria Vincent Full Cast & Crew Last Season Series 1 2015 | 6 Episodes Season 1 of Sammy J & Randy in Ricketts Lane premiered on October 14, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sammy J & Randy in Ricketts Lane. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  24m, 26m Homepage   http://www.abc.net.au/tv/programs/sammy-j-and-randy-in-ricketts-lane/ Genres Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 42 United600 TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}