{"link": "https://www.themoviedb.org/tv/33131?language=en", "title": "Bethenny Ever After", "resume": "Bethenny Ever After, titled Bethenny Getting Married? during season one, is an American reality documentary television series on Bravo. The series focuses on the life of Bethenny Frankel, a former original cast member of The Real Housewives of New York City.\nBethenny Getting Married? became Bravo's highest rated series premiere in the network's history but was later surpassed by Married to Medicine in March 2013.\nIt was reported in January 2012 that Frankel made the decision that the third season of the series would be her last in order for her to concentrate on her business ventures. Frankel confirmed the reports by announcing on her talk show, Bethenny, that she is done with reality television.", "rate": 0, "genre": ["Drama"], "cast": ["Bethenny Frankel"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33131   Expand Bethenny Ever After   (2010) User Score Overview Bethenny Ever After, titled Bethenny Getting Married? during season one, is an American reality documentary television series on Bravo. The series focuses on the life of Bethenny Frankel, a former original cast member of The Real Housewives of New York City. Bethenny Getting Married? became Bravo's highest rated series premiere in the network's history but was later surpassed by Married to Medicine in March 2013. It was reported in January 2012 that Frankel made the decision that the third season of the series would be her last in order for her to concentrate on her business ventures. Frankel confirmed the reports by announcing on her talk show, Bethenny, that she is done with reality television. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bethenny Frankel Full Cast & Crew Last Season Bethenny getting married? season 3 2012 | 15 Episodes Season 3 of Bethenny Ever After premiered on February 20, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bethenny Ever After. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 44m Homepage   http://www.bravotv.com/bethenny-getting-married Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors z 5 zurman1 1 gianpoker 1 lelouchvib  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}