{"link": "https://www.themoviedb.org/tv/72166?language=en", "title": "Persevere, Goo Hae Ra", "resume": "The female main character, Go Hae Ra who is always unlucky with whatever she does, her one-sided love, Kang Se Jong, who is a genius student at KAIST, and his fraternal twin, Kang Se Chan experience failure and breakdown after they participated in an audition as team, which they finally overcome. The drama unfolds a complex but romantic love story amongst the three characters.", "rate": 0, "genre": [], "cast": ["Min Hyo-rin", "Kwak Si-yang", "Jin Young", "Henry Lau"], "character": ["Goo Hae Ra", "Kang Se Jong", "Kang Se Chan", "Henry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72166   Expand Persevere, Goo Hae Ra   (2015) User Score Overview The female main character, Go Hae Ra who is always unlucky with whatever she does, her one-sided love, Kang Se Jong, who is a genius student at KAIST, and his fraternal twin, Kang Se Chan experience failure and breakdown after they participated in an audition as team, which they finally overcome. The drama unfolds a complex but romantic love story amongst the three characters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Min Hyo-rin Goo Hae Ra Kwak Si-yang Kang Se Jong Jin Young Kang Se Chan Henry Lau Henry Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Persevere, Goo Hae Ra premiered on January  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Persevere, Goo Hae Ra. You can help by rating TV shows you've seen. Facts Original Name  칠전팔기 구해라 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://tv.mnet.com/program/1320 Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors R 21 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}