{"link": "https://www.themoviedb.org/tv/42410?language=en", "title": "Durarara!!", "resume": "Durarara!!, often shortened to DRRR!!, is a Japanese light novel series written by Ryohgo Narita, with illustrations by Suzuhito Yasuda, that has also been adapted into a Japanese anime series. As of May 2012, eleven volumes have been published by ASCII Media Works under their Dengeki Bunko imprint. A manga adaptation by Akiyo Satorigi started serialization in the shōnen manga magazine Monthly GFantasy on April 18, 2009. An anime adaptation began airing in Japan in January 2010. Durarara!! tells the story of a dullahan working as an underworld courier in Ikebukuro, an internet-based anonymous gang called The Dollars, and the chaos that unfolds around the most dangerous people in Ikebukuro. Two games based on the series for the PlayStation Portable were released.", "rate": 78, "genre": ["Action", "Adventure", "Animation", "Drama", "Mystery"], "cast": ["Miyuki Sawashiro", "Toshiyuki Toyonaga", "Mamoru Miyano", "Kana Hanazawa", "Hiroshi Kamiya"], "character": ["Celty Sturluson", "Mikado Ryūgamine", "Masaomi Kida", "Anri Sonohara", "Izaya Orihara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42410   Expand Durarara!!   (2010) User Score  Play Trailer Overview Durarara!!, often shortened to DRRR!!, is a Japanese light novel series written by Ryohgo Narita, with illustrations by Suzuhito Yasuda, that has also been adapted into a Japanese anime series. As of May 2012, eleven volumes have been published by ASCII Media Works under their Dengeki Bunko imprint. A manga adaptation by Akiyo Satorigi started serialization in the shōnen manga magazine Monthly GFantasy on April 18, 2009. An anime adaptation began airing in Japan in January 2010. Durarara!! tells the story of a dullahan working as an underworld courier in Ikebukuro, an internet-based anonymous gang called The Dollars, and the chaos that unfolds around the most dangerous people in Ikebukuro. Two games based on the series for the PlayStation Portable were released. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  5 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyuki Sawashiro Celty Sturluson Toshiyuki Toyonaga Mikado Ryūgamine Mamoru Miyano Masaomi Kida Kana Hanazawa Anri Sonohara Hiroshi Kamiya Izaya Orihara Full Cast & Crew Last Season Original Air Date Original Air Date TV cour (Production) Durarara!!x2 2015 | 36 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for Durarara!!. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  8 Recommendations   2007-07-27 Baccano! 8.4    2015-10-03 K-Project 6.3    2011-04-17 Blue Exorcist 7.7    2014-01-05 Noragami 7.4    2009-04-05 Beyblade: Metal Fusion 3.8    2017-01-06 Saga of Tanya the Evil 7.6    2013-12-24 Turbo FAST 4.7    2016-03-21 72 Dangerous Places to Live 6.0  Facts Original Name  デュラララ!! Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.durarara.com/ Genres Action & Adventure Animation Drama Mystery Keywords urban legend youth culture city life based on light novel anime Content Score 93 Almost there... Top Contributors 49 sp1ti 40 Sadwick p 9 psy4trik 8 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}