{"link": "https://www.themoviedb.org/tv/73662?language=en", "title": "The Fifth Woman", "resume": "The 5th woman unfolds autumn 1994. An elderly man found in a gillrad pitfall impaled to death on the sharp sharpened bamboo poles, ecstatic praise of crows. Shortly afterwards disappears a florist without a trace and he also found executed in the forest. Kurt Wallander and his colleagues will soon understand that the attacks is all about revenge.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["Josefina Blomberg", "Britta Britting", "Henrik Byström", "Pierre Dahlander", "Jörgen Düberg"], "character": ["Therese Martinsson", "Sjuksköterska", "Unge Bo Runfeldt", "Tore Grundén", "Unge Holger Eriksson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73662   Expand The Fifth Woman   (2002) User Score Overview The 5th woman unfolds autumn 1994. An elderly man found in a gillrad pitfall impaled to death on the sharp sharpened bamboo poles, ecstatic praise of crows. Shortly afterwards disappears a florist without a trace and he also found executed in the forest. Kurt Wallander and his colleagues will soon understand that the attacks is all about revenge. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josefina Blomberg Therese Martinsson Britta Britting Sjuksköterska Henrik Byström Unge Bo Runfeldt Pierre Dahlander Tore Grundén Jörgen Düberg Unge Holger Eriksson Full Cast & Crew Last Season Season 1 2002 | 4 Episodes Season 1 of The Fifth Woman premiered on March  8, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Fifth Woman. You can help by rating TV shows you've seen. Facts Original Name  Den 5:e kvinnan Status  Ended Network Certification  - Type  Miniseries Original Language  Swedish Runtime  57m Homepage  - Genres Crime Drama Keywords miniseries Content Score 86 Almost there... Top Contributors VA 102 Viktor Andersson TB 29 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}