{"link": "https://www.themoviedb.org/tv/5626?language=en", "title": "High Stakes Poker", "resume": "High Stakes Poker is a cash game poker television program, which was broadcast by the cable television network GSN in the United States. The poker variant played on the show is no limit Texas hold 'em. It premiered on January 16, 2006 and ended on December 17, 2007 for the first 4 seasons and the last 3 seasons ran from March 1, 2009 to May 21, 2011 and was simulcast in 3DTV on N3D.\nThe participants on the show include both professional poker players and amateur players.\nThe show was hosted by AJ Benza in the first five seasons, alongside Gabe Kaplan. Starting with the sixth season, Kara Scott replaced Benza as Kaplan's co-host, with Scott conducting interviews from the poker room floor. Starting with the seventh season, Norm Macdonald replaced Gabe Kaplan as Scott's co-host.", "rate": 70, "genre": [], "cast": ["A. J. Benza", "Phil Ivey", "Guy Laliberté", "Kara Scott", "Corey Zeidman"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5626   Expand High Stakes Poker   (2006) User Score Overview High Stakes Poker is a cash game poker television program, which was broadcast by the cable television network GSN in the United States. The poker variant played on the show is no limit Texas hold 'em. It premiered on January 16, 2006 and ended on December 17, 2007 for the first 4 seasons and the last 3 seasons ran from March 1, 2009 to May 21, 2011 and was simulcast in 3DTV on N3D. The participants on the show include both professional poker players and amateur players. The show was hosted by AJ Benza in the first five seasons, alongside Gabe Kaplan. Starting with the sixth season, Kara Scott replaced Benza as Kaplan's co-host, with Scott conducting interviews from the poker room floor. Starting with the seventh season, Norm Macdonald replaced Gabe Kaplan as Scott's co-host. Featured Crew Henry Orenstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast A. J. Benza Phil Ivey Guy Laliberté Kara Scott Corey Zeidman Full Cast & Crew Last Season Season 7 2011 | 13 Episodes Season 7 of High Stakes Poker premiered on February 26, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on High Stakes Poker. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage   http://www.gsn.com/cgi/shows/list_single.html?tvshow_id=19 Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}