{"link": "https://www.themoviedb.org/tv/7537?language=en", "title": "Tomorrow is forever", "resume": "Mañana es para siempre is a Mexican telenovela that began airing on October 20, 2008 on XEW-TV, also known as Canal de las Estrellas. It is produced by the Televisa television network and is a production of Nicandro Díaz González. It stars Silvia Navarro as \"Fernanda Elizalde\", Fernando Colunga as \"Franco Santoro and Eduardo Juarez\" and Lucero as \"Bárbara Greco\" the main villain of the story.\nIts was one of the most popular soap operas in the history of Univision, its finale having been watched by over 11 million viewers, faring well against US mainstream shows.\nIt is a remake of the 2007–2008 Colombian telenovela by RCN Pura Sangre, which starred Rafael Novoa, Marcela Mar and Kathy Saenz in the antagonic role.", "rate": 0, "genre": ["Drama"], "cast": ["Silvia Navarro", "Fernando Colunga", "Lucero", "Rogelio Guerra", "Sergio Sendel"], "character": ["Fernanda Elizalde", "Eduardo Juarez / Franco Santoro", "Barbara Greco / Rebeca Sanchez", "Gonzalo Elizalde / Artemio Bravo", "Damian Gallardo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7537   Expand Tomorrow is forever   (2008) User Score Overview Mañana es para siempre is a Mexican telenovela that began airing on October 20, 2008 on XEW-TV, also known as Canal de las Estrellas. It is produced by the Televisa television network and is a production of Nicandro Díaz González. It stars Silvia Navarro as \"Fernanda Elizalde\", Fernando Colunga as \"Franco Santoro and Eduardo Juarez\" and Lucero as \"Bárbara Greco\" the main villain of the story. Its was one of the most popular soap operas in the history of Univision, its finale having been watched by over 11 million viewers, faring well against US mainstream shows. It is a remake of the 2007–2008 Colombian telenovela by RCN Pura Sangre, which starred Rafael Novoa, Marcela Mar and Kathy Saenz in the antagonic role. Featured Crew Mauricio Navas Creator Guillermo Restrepo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Silvia Navarro Fernanda Elizalde Fernando Colunga Eduardo Juarez / Franco Santoro Lucero Barbara Greco / Rebeca Sanchez Rogelio Guerra Gonzalo Elizalde / Artemio Bravo Sergio Sendel Damian Gallardo Full Cast & Crew Last Season Season 1 2008 | 1 Episode Season 1 of Tomorrow is forever premiered on October 20, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Tomorrow is forever. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tomorrow is forever. You can help by rating TV shows you've seen. Facts Original Name  Mañana es para siempre Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://www2.esmas.com/entretenimiento/telenovelas/manana-es-para-siempre/ Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors s 25 shiff7 7 Alexandre Gomes s 3 speedycars l 3 lencho_ape  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}