{"link": "https://www.themoviedb.org/tv/4360?language=en", "title": "Iron Chef America", "resume": "Iron Chef America: The Series is an American cooking show based on Fuji Television's Iron Chef, and is the second American adaptation of the series, following the failed Iron Chef USA. The show is produced by Food Network, which also carried a dubbed version of the original Iron Chef. Like the original Japanese program, the program is a culinary game show. In each episode, a new challenger chef competes against one of the resident \"Iron Chefs\" in a one-hour cooking competition based on a secret ingredient or ingredients, and sometimes theme.\nThe show is presented as a successor to the original Iron Chef, as opposed to being a remake. The Chairman is portrayed by actor and martial artist Mark Dacascos, who is introduced as the nephew of the original Japanese chairman Takeshi Kaga. The commentary is provided solely by Alton Brown, & Kevin Brauch is the floor reporter. The music is written by composer Craig Marks, who released the soundtrack titled \"Iron Chef America & The Next Iron Chef\" by the end of 2010. In addition, regular ICA judge and Chopped host Ted Allen provided additional floor commentary for two special battles: Battle First Thanksgiving and Battle White House Produce.", "rate": 62, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4360   Expand Iron Chef America   (2005) User Score  Play Trailer Overview Iron Chef America: The Series is an American cooking show based on Fuji Television's Iron Chef, and is the second American adaptation of the series, following the failed Iron Chef USA. The show is produced by Food Network, which also carried a dubbed version of the original Iron Chef. Like the original Japanese program, the program is a culinary game show. In each episode, a new challenger chef competes against one of the resident \"Iron Chefs\" in a one-hour cooking competition based on a secret ingredient or ingredients, and sometimes theme. The show is presented as a successor to the original Iron Chef, as opposed to being a remake. The Chairman is portrayed by actor and martial artist Mark Dacascos, who is introduced as the nephew of the original Japanese chairman Takeshi Kaga. The commentary is provided solely by Alton Brown, & Kevin Brauch is the floor reporter. The music is written by composer Craig Marks, who released the soundtrack titled \"Iron Chef America & The Next Iron Chef\" by the end of 2010. In addition, regular ICA judge and Chopped host Ted Allen provided additional floor commentary for two special battles: Battle First Thanksgiving and Battle White House Produce. Featured Crew Alton Brown Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 13 2018 | 7 Episodes Season 13 of Iron Chef America premiered on May 16, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2011-01-19 Restaurant: Impossible 5.7  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  46m, 60m Homepage   http://www.foodnetwork.com/iron-chef-america/index.html Genres Reality Keywords competition cooking food cooking competition Content Score 71 Just a little bit more... Top Contributors 16 Banana 6 Elizabeth Jennings b 5 basher R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}