{"link": "https://www.themoviedb.org/tv/14583?language=en", "title": "Oh No, It's Selwyn Froggitt!", "resume": "Oh No, It's Selwyn Froggitt! is an ITV sitcom that ran from 1974 to 1977 starring Bill Maynard as the council labourer, Scarsdale Working Men’s Club secretary, hapless handyman and all-round public nuisance Selwyn Froggitt. It was created by Roy Clarke, who wrote the pilot episode transmitted in 1974, though the series was mostly written by Alan Plater. It was made for the ITV network by Yorkshire Television\nWith outdoor location filming of the series filmed in Skelmanthorpe, West Yorkshire and Elvington, North Yorkshire", "rate": 80, "genre": ["Comedy"], "cast": ["Bill Maynard", "Richard Davies", "Lynda Baron", "Rosemary Martin", "Harold Goodwin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14583   Expand Oh No, It's Selwyn Froggitt!   (1974) User Score Overview Oh No, It's Selwyn Froggitt! is an ITV sitcom that ran from 1974 to 1977 starring Bill Maynard as the council labourer, Scarsdale Working Men’s Club secretary, hapless handyman and all-round public nuisance Selwyn Froggitt. It was created by Roy Clarke, who wrote the pilot episode transmitted in 1974, though the series was mostly written by Alan Plater. It was made for the ITV network by Yorkshire Television With outdoor location filming of the series filmed in Skelmanthorpe, West Yorkshire and Elvington, North Yorkshire Featured Crew Roy Clarke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Maynard Richard Davies Lynda Baron Rosemary Martin Harold Goodwin Full Cast & Crew Last Season Oh no it's selwyn froggitt season 3 1977 | 8 Episodes Season 3 of Oh No, It's Selwyn Froggitt! premiered on November  8, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Oh No, It's Selwyn Froggitt!. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords northern england yorkshire sitcom british humour handyman Content Score 79 Pump it up! We're close now. Top Contributors O 12 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}