{"link": "https://www.themoviedb.org/tv/33927?language=en", "title": "Love It or List It", "resume": "Love It or List It is a Canadian home design TV show currently airing on the W Network and on VIVA. The show is produced by Big Coat Productions and is based in Toronto and other surrounding areas in Ontario, Canada. The show premiered as a primetime program on W Network on September 8, 2008, and has since aired on VIVA Network as well as HGTV US.", "rate": 63, "genre": [], "cast": ["Tina Morasco", "Jacqueline Hennessy"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33927   Expand Love It or List It   (2008) User Score Overview Love It or List It is a Canadian home design TV show currently airing on the W Network and on VIVA. The show is produced by Big Coat Productions and is based in Toronto and other surrounding areas in Ontario, Canada. The show premiered as a primetime program on W Network on September 8, 2008, and has since aired on VIVA Network as well as HGTV US. Featured Crew Catherine Fogarty Creator Maria Armstrong Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tina Morasco Jacqueline Hennessy Full Cast & Crew Last Season Season 5 2012 | 63 Episodes Season 5 of Love It or List It premiered on September 10, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply t Just like every other home improvement show Open 0 by tmdb67572229\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2012-08-29 Property Brothers: Buying and Selling 7.8    2011-01-04 Property Brothers 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.wnetwork.com/shows/love-it-or-list-it Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors TB 23 TMDb Bot 4 Elizabeth Jennings s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}