{"link": "https://www.themoviedb.org/tv/64403?language=en", "title": "Hillbilly Horror Show", "resume": "Hillbilly Horror Show is a horror/ comedy franchise, that showcases short horror films from up and coming filmmakers, hosted by our favorite Hillbillies Bo, Cephus and their kissing cousin, Lulu.", "rate": 95, "genre": ["Comedy"], "cast": ["Rachel Faulkner", "Bo Keister", "Scott Geiter"], "character": ["Lulu", "Bo", "Cephus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64403   Expand Hillbilly Horror Show   (2014) User Score  Play Trailer Overview Hillbilly Horror Show is a horror/ comedy franchise, that showcases short horror films from up and coming filmmakers, hosted by our favorite Hillbillies Bo, Cephus and their kissing cousin, Lulu. Featured Crew Blu de Golyer Creator Bo Keister Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rachel Faulkner Lulu Bo Keister Bo Scott Geiter Cephus Full Cast & Crew Last Season Season 1 2014 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hillbilly Horror Show. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://hillbillyhorrorshow.com/ Genres Comedy Keywords dark comedy beer based on comic horror film in film cult comedy comedy team hillbilly horror movie art horror screwball comedy classic horror sketch comedy cult horror horror filmmaking occult horror Content Score 71 Just a little bit more... Top Contributors 55 bkeister3 RZ 5 Ryan Zimmerman 5 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}