{"link": "https://www.themoviedb.org/tv/60868?language=en", "title": "Walkure Romanze", "resume": "Horses dashing gallantly... Knights challenging their own limits... Magnificent, heroic battles highlight the horseback lance sport of jousting. One of the many people fascinated by this proud sport, Takahiro Mizuno, acts as a begleiter (an assistant) to jousting knights as he lives his rather tedious life at Winford Academy.", "rate": 45, "genre": ["Animation"], "cast": ["Seiichirou Yamashita", "Ai Shimizu", "Kei Mizusawa", "Eriko Nakamura", "Hiroko Taguchi"], "character": ["Takahiro Mizuno (voice)", "Mio Kisaki (voice)", "Celia Cumani Aintree (voice)", "Noel Marres Ascot (voice)", "Lisa Eostre (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60868   Expand Walkure Romanze   (2013) User Score Overview Horses dashing gallantly... Knights challenging their own limits... Magnificent, heroic battles highlight the horseback lance sport of jousting. One of the many people fascinated by this proud sport, Takahiro Mizuno, acts as a begleiter (an assistant) to jousting knights as he lives his rather tedious life at Winford Academy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seiichirou Yamashita Takahiro Mizuno (voice) Ai Shimizu Mio Kisaki (voice) Kei Mizusawa Celia Cumani Aintree (voice) Eriko Nakamura Noel Marres Ascot (voice) Hiroko Taguchi Lisa Eostre (voice) Full Cast & Crew Last Season Season 1 2013 | 12 Episodes Season 1 of Walkure Romanze premiered on October  7, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Walkure Romanze. You can help by rating TV shows you've seen. Facts Original Name  ワルキューレ ロマンツェ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://walroma.com Genres Animation Keywords sport horseback riding harem ecchi anime based on visual novel based on eroge Content Score 86 Almost there... Top Contributors 50 Marr 🇳🇱 t 17 tmdb62726470 15 Elizabeth Jennings 7 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}