{"link": "https://www.themoviedb.org/tv/31785?language=en", "title": "The Jaquie Brown Diaries", "resume": "The Jaquie Brown Diaries is a satirical New Zealand sitcom in which real-life television personality Jaquie Brown plays a fictionalised, over-ambitious, status-obsessed version of herself. The series was created by Gerard Johnstone, Jaquie Brown and Hayley Cunningham and premiered 25 July 2008 on TV3. The US cable television channel Logo began broadcasting the series' episodes to date 12 June 2010.", "rate": 60, "genre": ["Comedy"], "cast": ["Madeleine Sami"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31785   Expand The Jaquie Brown Diaries   (2008) User Score Overview The Jaquie Brown Diaries is a satirical New Zealand sitcom in which real-life television personality Jaquie Brown plays a fictionalised, over-ambitious, status-obsessed version of herself. The series was created by Gerard Johnstone, Jaquie Brown and Hayley Cunningham and premiered 25 July 2008 on TV3. The US cable television channel Logo began broadcasting the series' episodes to date 12 June 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Madeleine Sami Full Cast & Crew Last Season Season 2 2009 | 8 Episodes Season 2 of The Jaquie Brown Diaries premiered on October 23, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Jaquie Brown Diaries. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Jaquie Brown Diaries. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://www.thejaquiebrowndiaries.co.nz Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors S 2 Samara s 1 spirea 1 bigyellowbird  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}