{"link": "https://www.themoviedb.org/tv/42966?language=en", "title": "Getsumento Heiki Mina", "resume": "Getsumen to Heiki Mina was a fictitious anime which appeared in the television miniseries Densha Otoko. In the same manner as Kujibiki Unbalance, an anime that began as a fictitious anime/manga within the anime/manga Genshiken, it has been adapted into a television series, which itself was later adapted into a manga series. The 11-episode series has been adapted by the animation studio Gonzo. It premiered on January 13, 2007 on Japan's Fuji TV.\nAnime News Network has reported that the official pronunciation of the series' title is Getsumen To Heiki Mina, not Getsumen Usagi Heiki Mina. In the Densha Otoko drama, it was named just Getsumen Heiki Mina. The Densha Otoko version of Getsumen Heiki Mina ran for 26 episodes, and the story is completely different from the real-world anime.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42966   Expand Getsumento Heiki Mina   (2007) User Score Overview Getsumen to Heiki Mina was a fictitious anime which appeared in the television miniseries Densha Otoko. In the same manner as Kujibiki Unbalance, an anime that began as a fictitious anime/manga within the anime/manga Genshiken, it has been adapted into a television series, which itself was later adapted into a manga series. The 11-episode series has been adapted by the animation studio Gonzo. It premiered on January 13, 2007 on Japan's Fuji TV. Anime News Network has reported that the official pronunciation of the series' title is Getsumen To Heiki Mina, not Getsumen Usagi Heiki Mina. In the Densha Otoko drama, it was named just Getsumen Heiki Mina. The Densha Otoko version of Getsumen Heiki Mina ran for 26 episodes, and the story is completely different from the real-world anime. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2007 | 11 Episodes Season 1 of Getsumento Heiki Mina premiered on January 13, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Getsumento Heiki Mina. You can help by rating TV shows you've seen. Facts Original Name  月面兎兵器ミーナ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  26m Homepage  - Genres Animation Comedy Keywords magical girl aliens magie Content Score 56 We're so close, yet so far. Top Contributors 15 seboseboss 3 sp1ti m 3 magoozin TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}