{"link": "https://www.themoviedb.org/tv/45241?language=en", "title": "Muv-Luv Alternative: Total Eclipse", "resume": "In the year 1973, alien species known as BETA (Beings of Extra Terrestrial origin which is Adversary of human race) came to invade earth. During the next 30 years, they have conquered most of the Eurasian continent, effectively decreasing the world population by billions. In response to their unique behavior, a new type of mobile mechanical humanoid weapon was developed, known as Tactical Surface Fighter (TSF). In the year 2001, elite pilots from around the world start to gather at a UN base in Alaska named Yukon to participate in the Prominence Project. This project is a joint effort between Russia and America on research and development of next generation of TSF. The job of the pilots is to test the prototypes, which occasionally involves pitting them one against another...", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure", "Drama"], "cast": ["Daisuke Ono", "Mai Nakahara", "Hitomi Nabatame", "Mamiko Noto", "Sakura Nogawa"], "character": ["Yuuya Bridges", "Yui Takamura", "Cryska Barchenowa", "Inia Sestina", "Tarisa Manandal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45241   Expand Muv-Luv Alternative: Total Eclipse   (2012) User Score Overview In the year 1973, alien species known as BETA (Beings of Extra Terrestrial origin which is Adversary of human race) came to invade earth. During the next 30 years, they have conquered most of the Eurasian continent, effectively decreasing the world population by billions. In response to their unique behavior, a new type of mobile mechanical humanoid weapon was developed, known as Tactical Surface Fighter (TSF). In the year 2001, elite pilots from around the world start to gather at a UN base in Alaska named Yukon to participate in the Prominence Project. This project is a joint effort between Russia and America on research and development of next generation of TSF. The job of the pilots is to test the prototypes, which occasionally involves pitting them one against another... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daisuke Ono Yuuya Bridges Mai Nakahara Yui Takamura Hitomi Nabatame Cryska Barchenowa Mamiko Noto Inia Sestina Sakura Nogawa Tarisa Manandal Full Cast & Crew Last Season Season 1 2012 | 25 Episodes Season 1 of Muv-Luv Alternative: Total Eclipse premiered on July  2, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Muv-Luv Alternative: Total Eclipse. You can help by rating TV shows you've seen. Facts Original Name  トータル・イクリプス Status  Ended Network Certification 16 Meaning Not recommended for children under 16. Not allowed air before 10:30 p.m. Some channels and programs are subject to exception. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://muv-luv-te-anime.com/ Genres Sci-Fi & Fantasy Animation Action & Adventure Drama Keywords mecha ecchi guerre Content Score 86 Almost there... Top Contributors M 21 Maddrax 10 deanzel 8 BrerFox 6 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}