{"link": "https://www.themoviedb.org/tv/43178?language=en", "title": "Outlaw Empires", "resume": "Outlaw Empires is a six-part documentary series about American outlaws. It was first aired on May 14, 2012, on Discovery Channel. Each episode focuses on one organization and includes dramatizations of real events and interviews with current and former members. In the biker episode, only former members are interviewed as patched members needed to get the approval of all other members from all other charters to appear on the show.", "rate": 70, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43178   Expand Outlaw Empires   (2012) User Score Overview Outlaw Empires is a six-part documentary series about American outlaws. It was first aired on May 14, 2012, on Discovery Channel. Each episode focuses on one organization and includes dramatizations of real events and interviews with current and former members. In the biker episode, only former members are interviewed as patched members needed to get the approval of all other members from all other charters to appear on the show. Featured Crew Kurt Sutter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2012 | 6 Episodes Season 1 of Outlaw Empires premiered on May 14, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Outlaw Empires. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  43m Homepage   http://dsc.discovery.com/tv/outlaw-empires/ Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 15 Travis Bell 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}