{"link": "https://www.themoviedb.org/tv/66310?language=en", "title": "StartUp", "resume": "A desperate banker needs to conceal stolen money. A Haitian-American gang lord wants to go legit. A Cuban-American hacker has an idea that will revolutionize the very future of money itself. Forced to work together, they unwittingly create their version of the American dream - organized crime 2.0.", "rate": 75, "genre": ["Crime", "Drama"], "cast": ["Adam Brody", "Edi Gathegi", "Otmara Marrero", "Ron Perlman", "Martin Freeman"], "character": ["Nicholas \"Nick\" Talman", "Ronald \"Ronnie\" Dacey", "Isabelle \"Izzy\" Morales", "Wes Chandler", "Phil Rask"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66310   Expand StartUp   (2016) User Score  Play Trailer Overview A desperate banker needs to conceal stolen money. A Haitian-American gang lord wants to go legit. A Cuban-American hacker has an idea that will revolutionize the very future of money itself. Forced to work together, they unwittingly create their version of the American dream - organized crime 2.0. Featured Crew Ben Ketai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Brody Nicholas \"Nick\" Talman Edi Gathegi Ronald \"Ronnie\" Dacey Otmara Marrero Isabelle \"Izzy\" Morales Ron Perlman Wes Chandler Martin Freeman Phil Rask Full Cast & Crew Last Season Season 2 2017 | 10 Episodes View All Seasons Social Reviews  1 Discussions  0 D A review by Dan_Tebasco  4.0 Written by  Dan_Tebasco  on April 21, 2017 Some loonytoons compared this to THE WIRE and that made me want to see it, cause THE WIRE is one of the best series of all time. But while THE WIRE has some of the most fascinating characters in tv and film (alot because most of them are based on real people) this series has some of the most blandest characters in a series in recent memory. I usually don't mind the cast (the ones I know of, never heard of the woman before) but here they are rather dull and incredibly emotionless. 4 episodes and then I gave up, there are so many series I want to watch out there so why continue with one...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  3 Posters  5 Recommendations   2014-01-29 19-2 7.4    2012-06-26 Line of Duty 8.0    2018-01-01 McMafia 7.3    2016-10-03 Conviction 6.3    2016-08-19 Jean-Claude Van Johnson 7.0    2013-04-03 Rogue 7.1    2016-06-01 Cleverman 5.7    2017-02-27 Taken 6.1  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.crackle.com/startup Genres Crime Drama Keywords miami organized crime digital currency Content Score 100 Yes! Looking good! Top Contributors 340 janar 44 Elizabeth Jennings 7 joeynotjoe l 7 lexura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}