{"link": "https://www.themoviedb.org/tv/69557?language=en", "title": "Fauda", "resume": "A top Israeli agent comes out of retirement to hunt for a Palestinian militant he thought he'd killed, setting a chaotic chain of events into motion.", "rate": 66, "genre": ["Action", "Adventure", "Drama"], "cast": ["Lior Raz", "Netta Garti", "Tsahi Halevi", "Shadi Mar'i", "Doron Ben-David"], "character": ["Doron Kavillio", "Gali Kavillio", "Naor", "Walid El Abed", "Hertzel 'Steve' Pinto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69557   Expand Fauda   (2015) User Score  Play Trailer Overview A top Israeli agent comes out of retirement to hunt for a Palestinian militant he thought he'd killed, setting a chaotic chain of events into motion. Featured Crew Avi Issacharoff Creator Lior Raz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lior Raz Doron Kavillio Netta Garti Gali Kavillio Tsahi Halevi Naor Shadi Mar'i Walid El Abed Doron Ben-David Hertzel 'Steve' Pinto Full Cast & Crew Current Season Season 2 2017 | 12 Episodes Season 2 of Fauda premiered on December 31, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  9 Recommendations   2016-01-07 Deep 7.0    2015-10-13 River 7.8    2011-04-03 The Killing 7.5  Facts Original Name  פאודה Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Hebrew Runtime  34m Homepage  - Genres Action & Adventure Drama Keywords undercover agent thriller israeli palestinian conflict israeli defense force Content Score 100 Yes! Looking good! Top Contributors a 46 adambakir92 AK 28 Avshalom Kor 22 Banana v 16 vicman_mdb  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}