{"link": "https://www.themoviedb.org/tv/37119?language=en", "title": "Norwegian Cozy", "resume": "After a bad relationship breakup, Georg moves back in with his father Frank. Georg's biggest wish is to become a father himself, and his biggest fear is to become an intolerable paranoiac like his father. While still sane, Georg starts to write letters to his future son as he continues to search for a worthwhile mother for him.", "rate": 0, "genre": ["Drama"], "cast": ["Anders Baasmo Christiansen", "Stein Winge", "Anders Danielsen Lie", "Tone Danielsen", "Viktoria Winge"], "character": ["Georg", "Frank", "Terje", "Bente", "Jenny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37119   Expand Norwegian Cozy   (2011) User Score  Play Trailer Overview After a bad relationship breakup, Georg moves back in with his father Frank. Georg's biggest wish is to become a father himself, and his biggest fear is to become an intolerable paranoiac like his father. While still sane, Georg starts to write letters to his future son as he continues to search for a worthwhile mother for him. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anders Baasmo Christiansen Georg Stein Winge Frank Anders Danielsen Lie Terje Tone Danielsen Bente Viktoria Winge Jenny Full Cast & Crew Last Season Season 1 2011 | 6 Episodes Season 1 of Norwegian Cozy premiered on January  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Norwegian Cozy. You can help by rating TV shows you've seen. Facts Original Name  Koselig med peis Status  Ended Network Certification  - Type  Miniseries Original Language  Norwegian Runtime  58m Homepage   https://tv.nrk.no/serie/koselig-med-peis Genres Drama Keywords miniseries Content Score 93 Almost there... Top Contributors 38 Banana TB 8 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}