{"link": "https://www.themoviedb.org/tv/2322?language=en", "title": "Mystery Hunters", "resume": "Mystery Hunters is a Canadian Documentary television series aimed at a young audience. It aired on YTV in Canada and on Discovery Kids in the United States. It was also dubbed in Japanese and aired in Japan on NHK.\nTeenage hosts Araya and Christina investigate real-life reports of mysteries such as spirits, legendary creatures, monsters, dinosaurs and UFOs. They use scientific rigour to try to find plausible explanations for the sightings and eye-witness accounts that trigger their investigations. In another section of the show, Doubting Dave, a scientist played by David Acer, attempts to explain mysterious personal experiences that have been emailed in by viewers, in a feature called \"V-Files\", as well as a way to create your own versions of the mysteries in the show in his \"Mystery Lab\" segment.\nProduced by Apartment 11 Productions, four seasons and 78 episodes of the series have been made, and it has garnered awards and accolades from around the world, including eight Gemini Award nominations, a 2006 Parents' Choice Award, and a 2007 Japan Prize for the \"Stonehenge\" episode, awarded the Minister of Internal Affairs and Communications Prize in the Early Education category.", "rate": 90, "genre": ["Documentary"], "cast": ["Christina Broccolini", "David Acer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2322   Expand Mystery Hunters   (2002) User Score Overview Mystery Hunters is a Canadian Documentary television series aimed at a young audience. It aired on YTV in Canada and on Discovery Kids in the United States. It was also dubbed in Japanese and aired in Japan on NHK. Teenage hosts Araya and Christina investigate real-life reports of mysteries such as spirits, legendary creatures, monsters, dinosaurs and UFOs. They use scientific rigour to try to find plausible explanations for the sightings and eye-witness accounts that trigger their investigations. In another section of the show, Doubting Dave, a scientist played by David Acer, attempts to explain mysterious personal experiences that have been emailed in by viewers, in a feature called \"V-Files\", as well as a way to create your own versions of the mysteries in the show in his \"Mystery Lab\" segment. Produced by Apartment 11 Productions, four seasons and 78 episodes of the series have been made, and it has garnered awards and accolades from around the world, including eight Gemini Award nominations, a 2006 Parents' Choice Award, and a 2007 Japan Prize for the \"Stonehenge\" episode, awarded the Minister of Internal Affairs and Communications Prize in the Early Education category. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christina Broccolini David Acer Full Cast & Crew Last Season Season 2 2002 | 11 Episodes Season 2 of Mystery Hunters premiered on December 23, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mystery Hunters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.mysteryhunters.tv Genres Documentary Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 2 Reb_Brown  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}