{"link": "https://www.themoviedb.org/tv/46316?language=en", "title": "Motive", "resume": "A cat-and-mouse series with a twist on the everyday whodunit, \"Motive\" centers on Angie Flynn, a detective on a backwards chase for clues to a killer that has already been revealed to viewers. The series, filmed in Vancouver, is an unconventional way to watch a crime unfold. Each episode begins by revealing to the audience, not only the victim, but the killer as well. The homicide detective then begins to piece together clues. How did they do it? How are the victim and killer connected? What's the motive? As the mystery unfolds, the audience navigates the twisted and complicated maze of each murder and solves the puzzle alongside Det. Flynn and her team.", "rate": 63, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Kristin Lehman", "Louis Ferreira", "Brendan Penny", "Lauren Holly"], "character": ["Detective Angie Flynn", "Detective Oscar Vega", "Detective Brian Lucas", "Dr. Betty Rogers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46316   Expand Motive   (2013) User Score Overview A cat-and-mouse series with a twist on the everyday whodunit, \"Motive\" centers on Angie Flynn, a detective on a backwards chase for clues to a killer that has already been revealed to viewers. The series, filmed in Vancouver, is an unconventional way to watch a crime unfold. Each episode begins by revealing to the audience, not only the victim, but the killer as well. The homicide detective then begins to piece together clues. How did they do it? How are the victim and killer connected? What's the motive? As the mystery unfolds, the audience navigates the twisted and complicated maze of each murder and solves the puzzle alongside Det. Flynn and her team. Featured Crew Daniel Cerone Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  18 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kristin Lehman Detective Angie Flynn Louis Ferreira Detective Oscar Vega Brendan Penny Detective Brian Lucas Lauren Holly Dr. Betty Rogers Full Cast & Crew Last Season Season 4 2016 | 13 Episodes Season 4 of Motive premiered on March 22, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  18 Posters  2 Recommendations   2014-09-17 The Mysteries of Laura 6.3    2017-03-30 Hindsight 6.5    2010-07-12 Rizzoli & Isles 7.0    2015-06-16 Proof 5.7    2016-06-08 Power Monkeys 7.0    2015-01-27 Stalker 5.8    2016-07-04 Brief Encounters 7.3    2015-10-28 Cuffs 6.6  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   http://www.ctv.ca/Motive.aspx Genres Crime Drama Mystery Keywords canada female protagonist police detective vancouver female detective murder investigation cop drama Content Score 93 Almost there... Top Contributors 57 Banana 45 Elizabeth Jennings k 29 khedron S 8 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}