{"link": "https://www.themoviedb.org/tv/43064?language=en", "title": "Betty White's Off Their Rockers", "resume": "Betty White's Off Their Rockers is an American reality comedy television series broadcast on NBC. A sneak preview was released on January 16, 2012 in tribute to Betty White's 90th birthday. The show officially premiered April 4, 2012. It is based on the Belgian TV format Benidorm Bastards. White hosts the series, and also serves as an executive producer for the show.\nOn May 13, 2012, NBC renewed the series for a second season in the mid-season schedule. On July 11, 2013, The Hollywood Reporter reported that NBC had canceled the series, citing a drop-off in ratings and low DVR viewership.", "rate": 35, "genre": ["Reality", "Comedy"], "cast": ["Ted Lange", "Richard Herd", "Betty White"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43064   Expand Betty White's Off Their Rockers   (2012) User Score Overview Betty White's Off Their Rockers is an American reality comedy television series broadcast on NBC. A sneak preview was released on January 16, 2012 in tribute to Betty White's 90th birthday. The show officially premiered April 4, 2012. It is based on the Belgian TV format Benidorm Bastards. White hosts the series, and also serves as an executive producer for the show. On May 13, 2012, NBC renewed the series for a second season in the mid-season schedule. On July 11, 2013, The Hollywood Reporter reported that NBC had canceled the series, citing a drop-off in ratings and low DVR viewership. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ted Lange Richard Herd Betty White Host Full Cast & Crew Last Season Season 2 2013 | 18 Episodes Season 2 of Betty White's Off Their Rockers premiered on January  8, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Betty White's Off Their Rockers. You can help by rating TV shows you've seen. Facts Status  Cancelled Networks Certification  - Type  Reality Original Language  English Runtime  21m Homepage   http://www.nbc.com/betty-whites-off-their-rockers/ Genres Reality Comedy Keywords prank elderly Content Score 56 We're so close, yet so far. Top Contributors 17 Banana z 4 zurman1 3 wufatmio s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}