{"link": "https://www.themoviedb.org/tv/7966?language=en", "title": "Voltron: The Third Dimension", "resume": "Voltron: The Third Dimension is an American computer-animated television series, done in the same animation style as Beast Wars: Transformers and Reboot. It departed from the original Lion Voltron's animated look, as well as some character changes, such as the physical appearance of Prince Lotor. It served as a sequel to the Lion Voltron series, set three years after the end of that program, and among the tools used to bridge the gap was an official starmap as designed by writer Shannon Muir, and finalized in partnership with World Events Productions. The show was animated by Mike Young Productions. The show won a 1999 Daytime Emmy for Outstanding Sound Editing - Special Class Rick Hinson, Elizabeth Hinson. Legal issues occurred when WEP tried to make a new series. Neil Ross, Michael Bell and B.J. Ward reprised their roles as Keith, Lance and Princess Alura for the series.", "rate": 0, "genre": ["Animation"], "cast": ["Billy West", "B. J. Ward", "Kevin Michael Richardson", "Neil Ross", "Michael Bell"], "character": ["Pidge (voice)", "Princess Allura / Haggar (voice)", "Hunk / King Zarkon / Narrator (voice)", "Keith / Amalgamus (voice)", "Lance / Coran (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7966   Expand Voltron: The Third Dimension   (1998) User Score Overview Voltron: The Third Dimension is an American computer-animated television series, done in the same animation style as Beast Wars: Transformers and Reboot. It departed from the original Lion Voltron's animated look, as well as some character changes, such as the physical appearance of Prince Lotor. It served as a sequel to the Lion Voltron series, set three years after the end of that program, and among the tools used to bridge the gap was an official starmap as designed by writer Shannon Muir, and finalized in partnership with World Events Productions. The show was animated by Mike Young Productions. The show won a 1999 Daytime Emmy for Outstanding Sound Editing - Special Class Rick Hinson, Elizabeth Hinson. Legal issues occurred when WEP tried to make a new series. Neil Ross, Michael Bell and B.J. Ward reprised their roles as Keith, Lance and Princess Alura for the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy West Pidge (voice) B. J. Ward Princess Allura / Haggar (voice) Kevin Michael Richardson Hunk / King Zarkon / Narrator (voice) Neil Ross Keith / Amalgamus (voice) Michael Bell Lance / Coran (voice) Full Cast & Crew Last Season Season 2 1999 | 9 Episodes Season 2 of Voltron: The Third Dimension premiered on October  9, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Voltron: The Third Dimension. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.voltron.com/ Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 16 Banana A 1 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}