{"link": "https://www.themoviedb.org/tv/51216?language=en", "title": "Symphony of Fate", "resume": "The story focuses on two adopted sisters, An Qi and An Na, and their trials and tribulations in the fashion industry. An Qi is the older, nicer sister who is framed by An Na. She returns after five years of wrongful imprisonment as a talented fashion designer seeking to have a chance again to acquire her goal, while her younger sister, An Na, becomes a successful business woman in these five years.", "rate": 0, "genre": ["Drama", "Romance"], "cast": ["Yang Mi", "William Feng"], "character": ["Hao Anqi", "Liu Chenxi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51216   Expand Symphony of Fate   (2011) User Score Overview The story focuses on two adopted sisters, An Qi and An Na, and their trials and tribulations in the fashion industry. An Qi is the older, nicer sister who is framed by An Na. She returns after five years of wrongful imprisonment as a talented fashion designer seeking to have a chance again to acquire her goal, while her younger sister, An Na, becomes a successful business woman in these five years. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yang Mi Hao Anqi William Feng Liu Chenxi Full Cast & Crew Last Season Season 1 2011 | 30 Episodes Season 1 of Symphony of Fate premiered on October  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Symphony of Fate. You can help by rating TV shows you've seen. Facts Original Name  命运交响曲 Status  Ended Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  40m Homepage  - Genres Drama Romance Keywords sibling relationship foreign language adaptation Content Score 56 We're so close, yet so far. Top Contributors 20 Wendy 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}