{"link": "https://www.themoviedb.org/tv/59326?language=en", "title": "R&B Divas: Los Angeles", "resume": "R&B Divas: Los Angeles is an American Reality television series on TV One that premiered on July 10, 2013. The series chronicles the lives of R&B singers Lil Mo, Chanté Moore, Kelly Price, Claudette Ortiz, Michel'le and Dawn Robinson as they balance their music careers and personal lives. It is a spinoff to R&B Divas: Atlanta. The reunion was filmed on August 6, 2013, with Wendy Williams as the host.\nPart 1 of the R&B Divas: Los Angeles reunion acquired a 0.83 rating among P25-54 and a 0.95 rating among households. It drew a total of 834,000 viewers on its original airing night during its 10:00 p.m. premiere and encore airings. The episode is also tied with The Rickey Smiley Show as the TV One's No. 1 telecast among adults 25-54.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59326   Expand R&B Divas: Los Angeles User Score Overview R&B Divas: Los Angeles is an American Reality television series on TV One that premiered on July 10, 2013. The series chronicles the lives of R&B singers Lil Mo, Chanté Moore, Kelly Price, Claudette Ortiz, Michel'le and Dawn Robinson as they balance their music careers and personal lives. It is a spinoff to R&B Divas: Atlanta. The reunion was filmed on August 6, 2013, with Wendy Williams as the host. Part 1 of the R&B Divas: Los Angeles reunion acquired a 0.83 rating among P25-54 and a 0.95 rating among households. It drew a total of 834,000 viewers on its original airing night during its 10:00 p.m. premiere and encore airings. The episode is also tied with The Rickey Smiley Show as the TV One's No. 1 telecast among adults 25-54. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2015 | 6 Episodes Season 3 of R&B Divas: Los Angeles premiered on February 11, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 6 Elizabeth Jennings b 3 blaynang k 3 kopraljono r 2 robert123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}