{"link": "https://www.themoviedb.org/tv/69676?language=en", "title": "Ejen Ali", "resume": "The story of an elementary school student who accidentally involved himself in the world of intelligence. It all started when the dose of an agent of evil who are trying to steal a high-tech tool that can change the world, namely I.R.I.S (Infinity Retinal Intelligence System) were stolen from the training center M.A.T.A (Meta Advance Tactical Agency).", "rate": 0, "genre": ["Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69676   Expand Ejen Ali   (2016) User Score  Play Trailer Overview The story of an elementary school student who accidentally involved himself in the world of intelligence. It all started when the dose of an agent of evil who are trying to steal a high-tech tool that can change the world, namely I.R.I.S (Infinity Retinal Intelligence System) were stolen from the training center M.A.T.A (Meta Advance Tactical Agency). Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Ejen Ali premiered on April  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ejen Ali. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Malay Runtime  - Homepage  - Genres Animation Kids Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors v 14 vplaytv 4 Elizabeth Jennings 2 Banana TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}