{"link": "https://www.themoviedb.org/tv/69758?language=en", "title": "Der Wunschpunsch", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 83, "genre": ["Animation", "Kids"], "cast": ["Matthias Hummitzsch", "Wolfgang Jakob", "Karl Rieper", "Sebastian Schulz", "Tom Pauls"], "character": ["Feuerwehrhauptmann Hydrant", "Beelzebub Irrwitzer", "Karl", "Kater Maurizio di Mauro", "Tante Noah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69758   Expand Der Wunschpunsch   (2001) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthias Hummitzsch Feuerwehrhauptmann Hydrant Wolfgang Jakob Beelzebub Irrwitzer Karl Rieper Karl Sebastian Schulz Kater Maurizio di Mauro Tom Pauls Tante Noah Full Cast & Crew Last Season Season 2 2002 | 26 Episodes Season 2 of Der Wunschpunsch premiered on May 30, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1995-09-09 Pinky and the Brain 7.7  Facts Status  Ended Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  German Runtime  1300m Homepage  - Genres Animation Kids Keywords fantasy magic Content Score 71 Just a little bit more... Top Contributors t 51 tmdb56629201 TB 3 TMDb Bot 3 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}