{"link": "https://www.themoviedb.org/tv/31805?language=en", "title": "Cra$h & Burn", "resume": "Cra$h & Burn is a Canadian television drama series created by Malcolm MacRury. The show takes place in Hamilton, Ontario, Canada, where it is also filmed.\nThe series stars Luke Kirby as Jimmy Burn, a claims investigator for Protected Insurance.", "rate": 90, "genre": ["Drama", "Comedy"], "cast": ["Luke Kirby", "Caroline Cave"], "character": ["Catherine Scott"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31805   Expand Cra$h & Burn   (2009) User Score Overview Cra$h & Burn is a Canadian television drama series created by Malcolm MacRury. The show takes place in Hamilton, Ontario, Canada, where it is also filmed. The series stars Luke Kirby as Jimmy Burn, a claims investigator for Protected Insurance. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Kirby Caroline Cave Catherine Scott Full Cast & Crew Last Season Cra$h & burn season 1 2009 | 13 Episodes Season 1 of Cra$h & Burn premiered on November 18, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cra$h & Burn. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.crash-and-burn.com/ Genres Drama Comedy Keywords canada insurance Content Score 56 We're so close, yet so far. Top Contributors 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}