{"link": "https://www.themoviedb.org/tv/34060?language=en", "title": "Demon Lord Dante", "resume": "Demon Lord Dante is the title of several horror-themed manga series written by Go Nagai as well as an anime series.\nDuring 1971, Go Nagai wrote the original Demon Lord Dante manga, which was published in Kodansha's Bokura Magazine. After its original run in 1971 from January to June, Go Nagai went on to author the Devilman anime and manga, which was greatly inspired by Demon Lord Dante. However, the series received a remake in 1994 by illustrator Akira Fuuga called Shin Maō Dante.\nIn 2002, the comic series was officially revived for another remake by Go Nagai, and during the same year a 13 episode anime adaption was created and broadcast worldwide by Animax.", "rate": 0, "genre": ["Animation"], "cast": ["Sanae Kobayashi", "Shigeru Shibuya", "Mitsuru Ogata", "Takahiro Sakurai", "Rei Igarashi"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34060   Expand Demon Lord Dante   (2002) User Score Overview Demon Lord Dante is the title of several horror-themed manga series written by Go Nagai as well as an anime series. During 1971, Go Nagai wrote the original Demon Lord Dante manga, which was published in Kodansha's Bokura Magazine. After its original run in 1971 from January to June, Go Nagai went on to author the Devilman anime and manga, which was greatly inspired by Demon Lord Dante. However, the series received a remake in 1994 by illustrator Akira Fuuga called Shin Maō Dante. In 2002, the comic series was officially revived for another remake by Go Nagai, and during the same year a 13 episode anime adaption was created and broadcast worldwide by Animax. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sanae Kobayashi Shigeru Shibuya Mitsuru Ogata Takahiro Sakurai Rei Igarashi Full Cast & Crew Last Season Season 1 2002 | 13 Episodes Season 1 of Demon Lord Dante premiered on August 31, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Demon Lord Dante. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}