{"link": "https://www.themoviedb.org/tv/2187?language=en", "title": "Reno 911!", "resume": "Reno 911! is an American comedy television series on Comedy Central that ran from 2003 to 2009. It is a mockumentary-style parody of law enforcement documentary shows, specifically COPS, with comic actors playing the police officers. Most of the material is improvised, using a broad outline, and with minimal scripted material. The series spawned a film, Reno 911!: Miami, featuring the same cast. Thomas Lennon, Robert Ben Garant and Kerri Kenney-Silver both starred in and are billed as creators of the series.", "rate": 71, "genre": ["Comedy"], "cast": ["Thomas Lennon", "Cedric Yarbrough", "Kerri Kenney-Silver", "Carlos Alazraqui", "Wendi McLendon-Covey"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2187   Expand Reno 911!   (2003) User Score Overview Reno 911! is an American comedy television series on Comedy Central that ran from 2003 to 2009. It is a mockumentary-style parody of law enforcement documentary shows, specifically COPS, with comic actors playing the police officers. Most of the material is improvised, using a broad outline, and with minimal scripted material. The series spawned a film, Reno 911!: Miami, featuring the same cast. Thomas Lennon, Robert Ben Garant and Kerri Kenney-Silver both starred in and are billed as creators of the series. Featured Crew Thomas Lennon Creator Ben Garant Creator Kerri Kenney-Silver Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thomas Lennon Cedric Yarbrough Kerri Kenney-Silver Carlos Alazraqui Wendi McLendon-Covey Full Cast & Crew Last Season Season 6 2009 | 15 Episodes Season 6 of Reno 911! premiered on April  1, 2009. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Deputy Clementine Johnson: Happy Birthday Wendi McLendon-Covey! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2007-08-06 Drunk History 6.6    2003-01-22 Chappelle's Show 8.2    2008-12-03 Man v. Food 6.7    1992-09-23 Mad About You 6.0    1990-04-19 Wings 6.7    2011-04-06 Workaholics 6.9    1993-09-13 Late Night with Conan O'Brien 7.3    2007-02-01 The Sarah Silverman Program 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Comedy Keywords satire parody mockumentary politically incorrect improvisation police officer Content Score 93 Almost there... Top Contributors b 42 brewtown 10 Banana 8 Markxist w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}