{"link": "https://www.themoviedb.org/tv/50?language=en", "title": "Pacific Blue", "resume": "Pacific Blue is an American crime drama series about a team of police officers with the Santa Monica Police Department who patrolled its beaches on bicycles. The show ran for five seasons on the USA Network, from March 2, 1996 to April 9, 2000, with a total of one hundred and one episodes. Often compared as \"Baywatch on bikes,\" the series enjoyed a popular run among the Network's viewers, and was popular in France, Israel, Sweden, Bulgaria, Norway, Spain, Russia, Austria, Germany, Italy, South America, Canada, Denmark, Poland, and other foreign markets.", "rate": 55, "genre": ["Drama", "Action", "Adventure"], "cast": ["Jim Davidson", "Paula Trickey", "Darlene Vogel", "Shanna Moakler", "Jeff Stearns"], "character": ["T.C. Callaway", "Cory McNamara", "Chris Kelly", "Monica Harper", "Russ Granger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50   Expand Pacific Blue   (1996) User Score Overview Pacific Blue is an American crime drama series about a team of police officers with the Santa Monica Police Department who patrolled its beaches on bicycles. The show ran for five seasons on the USA Network, from March 2, 1996 to April 9, 2000, with a total of one hundred and one episodes. Often compared as \"Baywatch on bikes,\" the series enjoyed a popular run among the Network's viewers, and was popular in France, Israel, Sweden, Bulgaria, Norway, Spain, Russia, Austria, Germany, Italy, South America, Canada, Denmark, Poland, and other foreign markets. Featured Crew Bill Nuss Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Davidson T.C. Callaway Paula Trickey Cory McNamara Darlene Vogel Chris Kelly Shanna Moakler Monica Harper Jeff Stearns Russ Granger Full Cast & Crew Last Season Season 5 1999 | 22 Episodes Season 5 of Pacific Blue premiered on July 18, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2003-03-31 American Chopper 5.9    1998-09-26 V.I.P. 4.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Action & Adventure Keywords california beach police precinct bicycle cop Content Score 93 Almost there... Top Contributors 22 United600 8 Banana s 7 speedycars P 5 PepikBerry  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}