{"link": "https://www.themoviedb.org/tv/8719?language=en", "title": "Ghost Squad", "resume": "Ghost Squad, known as G.S.5 for its third series, was a crime drama series about an elite division of Scotland Yard that ran between 1961 and 1964. Each episode the Ghost Squad would investigate cases that fell outside the scope of normal police work. Despite the show and characters being fictional, an actual division did exist within the Metropolitan Police Service at the time.\nInspiration for the series was taken from a book of the same name, written by John Gosling — a retired police officer and former member of the team. Although the real-life squad only operated in London, the fictionalised team travelled internationally; however — as was typical of the time — most foreign locations were actually a combination of stock footage and sets at Independent Artists Studio at Beaconsfield and Elstree Studios. Music was by Philip Green.\nThe show was produced by ITC Entertainment, along with Rank Organisation TV and ATV. It was the first ITC show filmed to fit the one hour time-slot — setting the trend for the majority of ITC's future output. Another common ITC trait was to feature an American, in this case Michael Quinn, in a leading role so as to increase the chances of international sales. At 6' 3\", Quinn often towered over his co-workers. This was especially noticeable in the first series title sequence showing him walking through a crowd walking in the opposite direction. He frequently smoked in the show as did many others. The second series had a different title sequence and Neil Hallett sometimes replaced Quinn. Hallett looked more like a spy while Quinn looked a bit like a playboy. Quinn was replaced by Australian actor, Ray Barrett in the third series. Ray Austin played Billy Clay in and was also Stunt Director on all series bringing the action to life. Austin went on to become a renowned TV director in Hollywood and the UK.", "rate": 0, "genre": [], "cast": ["Claire Nielson", "Angela Browne", "Donald Wolfit", "Ray Austin"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8719   Expand Ghost Squad   (1961) User Score Overview Ghost Squad, known as G.S.5 for its third series, was a crime drama series about an elite division of Scotland Yard that ran between 1961 and 1964. Each episode the Ghost Squad would investigate cases that fell outside the scope of normal police work. Despite the show and characters being fictional, an actual division did exist within the Metropolitan Police Service at the time. Inspiration for the series was taken from a book of the same name, written by John Gosling — a retired police officer and former member of the team. Although the real-life squad only operated in London, the fictionalised team travelled internationally; however — as was typical of the time — most foreign locations were actually a combination of stock footage and sets at Independent Artists Studio at Beaconsfield and Elstree Studios. Music was by Philip Green. The show was produced by ITC Entertainment, along with Rank Organisation TV and ATV. It was the first ITC show filmed to fit the one hour time-slot — setting the trend for the majority of ITC's future output. Another common ITC trait was to feature an American, in this case Michael Quinn, in a leading role so as to increase the chances of international sales. At 6' 3\", Quinn often towered over his co-workers. This was especially noticeable in the first series title sequence showing him walking through a crowd walking in the opposite direction. He frequently smoked in the show as did many others. The second series had a different title sequence and Neil Hallett sometimes replaced Quinn. Hallett looked more like a spy while Quinn looked a bit like a playboy. Quinn was replaced by Australian actor, Ray Barrett in the third series. Ray Austin played Billy Clay in and was also Stunt Director on all series bringing the action to life. Austin went on to become a renowned TV director in Hollywood and the UK. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Claire Nielson Angela Browne Donald Wolfit Ray Austin Full Cast & Crew Last Season Season 3 1964 | 13 Episodes Season 3 of Ghost Squad premiered on February 22, 1964. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ghost Squad. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}