{"link": "https://www.themoviedb.org/tv/25744?language=en", "title": "Genghis Khan", "resume": "Genghis Khan is a Chinese-Mongolian co-produced television series based on the life story of Genghis Khan, the founder of the Mongol Empire in the 13th century. Ba Sen, who starred as Genghis Khan in the series, is actually a descendant of Chagatai, the second son of Genghis Khan. The series was first broadcast on CCTV in China in 2004 and was also aired on KBS in South Korea between September and December 2005.", "rate": 0, "genre": ["Drama"], "cast": ["Ba Sen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 25744   Expand Genghis Khan   (2005) User Score Overview Genghis Khan is a Chinese-Mongolian co-produced television series based on the life story of Genghis Khan, the founder of the Mongol Empire in the 13th century. Ba Sen, who starred as Genghis Khan in the series, is actually a descendant of Chagatai, the second son of Genghis Khan. The series was first broadcast on CCTV in China in 2004 and was also aired on KBS in South Korea between September and December 2005. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ba Sen Full Cast & Crew Last Season Season 1 2005 | 30 Episodes Season 1 of Genghis Khan premiered on September 10, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Genghis Khan. You can help by rating TV shows you've seen. Facts Original Name  成吉思汗 Status  Ended Network CCTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 8 Zlogorek c 3 ctchim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}