{"link": "https://www.themoviedb.org/tv/41717?language=en", "title": "The Confidant", "resume": "The Confidant is a Hong Kong biographical-fiction television drama produced by TVB under executive producer Marco Law, and stars Wayne Lai as imperial eunuch Li Lianying, Michelle Yim as Empress Dowager Cixi, and Maggie Shiu as Empress Dowager Ci'an. The drama depicts how a group of eunuchs survive in the weakening Qing empire, and closely traces Li's early life from the first day he entered the imperial palace to becoming one of the most powerful political figures in the latter years of the Qing Dynasty. The drama also follows Li's relationship with Cixi, and how he eventually becomes her closest confidant.\nFilming began on 16 December 2011 in Hong Kong, and ended on 9 April 2012 in the Hengdian World Studios. The Confident Eunuch premiered the first two episodes on 1 November 2012 at The Grand Cinema in Tsim Sha Tsui, Kowloon. It has received positive reviews from critics and viewers thus far. With a total of 33 produced episodes, The Confidant started its broadcast on Hong Kong's Jade and HD Jade channels on 5 November 2012.", "rate": 0, "genre": ["Drama"], "cast": ["Raymond Wong", "Maggie Cheung Hoh-Yee", "Natalie Tong", "Maggie Shiu", "Nancy Wu"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41717   Expand The Confidant   (2012) User Score Overview The Confidant is a Hong Kong biographical-fiction television drama produced by TVB under executive producer Marco Law, and stars Wayne Lai as imperial eunuch Li Lianying, Michelle Yim as Empress Dowager Cixi, and Maggie Shiu as Empress Dowager Ci'an. The drama depicts how a group of eunuchs survive in the weakening Qing empire, and closely traces Li's early life from the first day he entered the imperial palace to becoming one of the most powerful political figures in the latter years of the Qing Dynasty. The drama also follows Li's relationship with Cixi, and how he eventually becomes her closest confidant. Filming began on 16 December 2011 in Hong Kong, and ended on 9 April 2012 in the Hengdian World Studios. The Confident Eunuch premiered the first two episodes on 1 November 2012 at The Grand Cinema in Tsim Sha Tsui, Kowloon. It has received positive reviews from critics and viewers thus far. With a total of 33 produced episodes, The Confidant started its broadcast on Hong Kong's Jade and HD Jade channels on 5 November 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Raymond Wong Maggie Cheung Hoh-Yee Natalie Tong Maggie Shiu Nancy Wu Full Cast & Crew Last Season Season 1 2011 | 31 Episodes Season 1 of The Confidant premiered on November  5, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Confidant. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}