{"link": "https://www.themoviedb.org/tv/72244?language=en", "title": "Singderella", "resume": "South Korean variety show where the cast and their special guests battle it out through a karaoke singing competition, the winning performers are rewarded with the ingredients needed to make late night snacks.", "rate": 0, "genre": ["Talk"], "cast": ["Kim Hee-chul", "Moon Hee-joon", "Lee Soo-geun", "Kim Sung-Kyu"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72244   Expand Singderella   (2016) User Score  Play Trailer Overview South Korean variety show where the cast and their special guests battle it out through a karaoke singing competition, the winning performers are rewarded with the ingredients needed to make late night snacks. Featured Crew Jung Hee-uk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Hee-chul Moon Hee-joon Lee Soo-geun Kim Sung-Kyu Full Cast & Crew Last Season Season 2 2017 | 6 Episodes Season 2 of Singderella premiered on February 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Singderella. You can help by rating TV shows you've seen. Facts Original Name  싱데렐라 Status  Ended Network Certification  - Type  Talk Show Original Language  Korean Runtime  70m Homepage   http://tv.ichannela.com/enter/singderella Genres Talk Keywords music karaoke variety show Content Score 100 Yes! Looking good! Top Contributors 68 redarx TB 2 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}