{"link": "https://www.themoviedb.org/tv/65237?language=en", "title": "One-Pound Gospel", "resume": "Hatanaka Kosaku is a talented boxer who turned pro at the age of 19, winning his debut match with a first round KO. He is talented, but he has no guts. His uncontrollable appetite is an even bigger problem. He can't put himself in the right weight class, he runs out of energy because of hunger, and he gets knocked out while his eyes are set on food at the ringside. However, Kosaku's life changed when he met Sister Angela, a novice nun in the convent near his boxing gym. She became the source of his power, and Kosaku fights only to win her heart.", "rate": 60, "genre": ["Comedy", "Romance"], "cast": ["Kazuya Kamenashi", "Meisa Kuroki", "Issey Takahashi", "Nao Minamisawa", "Ryosuke Yamada"], "character": ["Kosaku Hatanaka", "Sister Angela", "Ishizaka", "Noriko", "Katsumi Mukoda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65237   Expand One-Pound Gospel   (2008) User Score Overview Hatanaka Kosaku is a talented boxer who turned pro at the age of 19, winning his debut match with a first round KO. He is talented, but he has no guts. His uncontrollable appetite is an even bigger problem. He can't put himself in the right weight class, he runs out of energy because of hunger, and he gets knocked out while his eyes are set on food at the ringside. However, Kosaku's life changed when he met Sister Angela, a novice nun in the convent near his boxing gym. She became the source of his power, and Kosaku fights only to win her heart. Featured Crew Rumiko Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kazuya Kamenashi Kosaku Hatanaka Meisa Kuroki Sister Angela Issey Takahashi Ishizaka Nao Minamisawa Noriko Ryosuke Yamada Katsumi Mukoda Full Cast & Crew Last Season Season 1 2008 | 9 Episodes Season 1 of One-Pound Gospel premiered on December  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on One-Pound Gospel. You can help by rating TV shows you've seen. Facts Original Name  １ポンドの福音 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  46m Homepage  - Genres Comedy Romance Keywords sport romance Content Score 93 Almost there... Top Contributors A 42 Aka75 6 Elizabeth Jennings o 3 oxide TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}