{"link": "https://www.themoviedb.org/tv/1108?language=en", "title": "Executive Stress", "resume": "Executive Stress is a British sitcom that aired on ITV from 1986 to 1988. Produced by Thames Television, it first aired on 20 October 1986. After three series, the last episode aired on 27 December 1988.\nWritten by George Layton, Executive Stress stars Penelope Keith as Caroline Fairchild, a middle-aged woman who decides to go back to work. Her husband, Donald, is played by Geoffrey Palmer in the first series. However, Palmer was unable to return for the second series, so Peter Bowles played Donald in the last two series. Keith and Bowles had previously appeared in together in To the Manor Born.", "rate": 60, "genre": ["Comedy"], "cast": ["Geoffrey Palmer", "Peter Bowles", "Penelope Keith", "Wanda Ventham", "Timothy Carlton"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1108   Expand Executive Stress   (1986) User Score Overview Executive Stress is a British sitcom that aired on ITV from 1986 to 1988. Produced by Thames Television, it first aired on 20 October 1986. After three series, the last episode aired on 27 December 1988. Written by George Layton, Executive Stress stars Penelope Keith as Caroline Fairchild, a middle-aged woman who decides to go back to work. Her husband, Donald, is played by Geoffrey Palmer in the first series. However, Palmer was unable to return for the second series, so Peter Bowles played Donald in the last two series. Keith and Bowles had previously appeared in together in To the Manor Born. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Geoffrey Palmer Peter Bowles Penelope Keith Wanda Ventham Timothy Carlton Full Cast & Crew Last Season Season 3 1988 | 6 Episodes Season 3 of Executive Stress premiered on November 22, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Executive Stress. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords middle aged woman workplace sitcom british humour workplace comedy Content Score 71 Just a little bit more... Top Contributors O 10 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}