{"link": "https://www.themoviedb.org/tv/61746?language=en", "title": "Inside No. 9", "resume": "Inside No. 9 invites viewers into many very different No. 9s, where the ordinary and mundane rub shoulders with the extraordinary and macabre. From a grand country house where a game of 'sardines' leads to some chilling revelations in a wardrobe; to a very oddly haunted house; to a blood-soaked actor's dressing room in London's West End; to the flat of an apparently happy primary school teacher who becomes the victim of a good deed; these unpredictable tales feature high comedy and claustrophobic horror by turns.", "rate": 82, "genre": ["Comedy", "Mystery"], "cast": ["Reece Shearsmith", "Steve Pemberton"], "character": ["Various", "Various"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61746   Expand Inside No. 9   (2014) User Score  Play Trailer Overview Inside No. 9 invites viewers into many very different No. 9s, where the ordinary and mundane rub shoulders with the extraordinary and macabre. From a grand country house where a game of 'sardines' leads to some chilling revelations in a wardrobe; to a very oddly haunted house; to a blood-soaked actor's dressing room in London's West End; to the flat of an apparently happy primary school teacher who becomes the victim of a good deed; these unpredictable tales feature high comedy and claustrophobic horror by turns. Featured Crew Reece Shearsmith Creator Steve Pemberton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  10 Posters  5 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Reece Shearsmith Various Steve Pemberton Various Full Cast & Crew Current Season Original Air Date Original Air Date Digital Order (Digital) Series 4 2018 | 6 Episodes Season 4 of Inside No. 9 premiered on January  2, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply M The Bill Open 1 by  Fergoose Go to Discussions Media Most Popular Videos  2 Backdrops  10 Posters  5 Recommendations   2013-03-25 Plebs 7.6    2006-01-01 In Justice 6.8    2010-09-28 Whites 6.7    2013-08-25 What Remains 7.1    2013-09-05 The Guilty 7.0    2012-03-05 Dirk Gently 8.1    2011-01-13 Kidnap and Ransom 7.6    2015-10-28 Cuffs 6.6  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b05p650r Genres Comedy Mystery Keywords dark comedy anthology british humour horror anthology Content Score 71 Just a little bit more... Top Contributors 64 Elizabeth Jennings 20 Banana O 6 Ozbourne CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}