{"link": "https://www.themoviedb.org/tv/39951?language=en", "title": "Die Affäre Semmeling", "resume": "Die Affäre Semmeling was a 2002 German teleplay, broadcast on ZDF. It starred Mario Adorf as Walter 'Beton-Walter' Wegener, Robert Atzorn as Dr. Klaus Hennig, Heinz Hoenig as Axel Ropert, Stefan Kurt as Sigi Semmeling and Heike Makatsch as Silke Semmeling.", "rate": 0, "genre": ["Drama"], "cast": ["Mario Adorf", "Robert Atzorn", "Heinz Hoenig", "Stefan Kurt", "Heike Makatsch"], "character": ["Walter „Beton-Walter“ Wegener", "Dr. Klaus Hennig", "Axel Ropert", "Sigi Semmeling", "Silke Semmeling"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39951   Expand Die Affäre Semmeling   (2002) User Score Overview Die Affäre Semmeling was a 2002 German teleplay, broadcast on ZDF. It starred Mario Adorf as Walter 'Beton-Walter' Wegener, Robert Atzorn as Dr. Klaus Hennig, Heinz Hoenig as Axel Ropert, Stefan Kurt as Sigi Semmeling and Heike Makatsch as Silke Semmeling. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mario Adorf Walter „Beton-Walter“ Wegener Robert Atzorn Dr. Klaus Hennig Heinz Hoenig Axel Ropert Stefan Kurt Sigi Semmeling Heike Makatsch Silke Semmeling Full Cast & Crew Last Season Season 1 2002 | 1 Episode Season 1 of Die Affäre Semmeling premiered on January  2, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Die Affäre Semmeling. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  90m Homepage  - Genres Drama Keywords politics family clan Content Score 86 Almost there... Top Contributors S 34 Samara TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}