{"link": "https://www.themoviedb.org/tv/42188?language=en", "title": "Storage Wars: Texas", "resume": "Storage Wars: Texas is a reality television series on the A&E Network that premiered in 2011. It is a regionalized spin-off of the highly-popular series Storage Wars. The show features auctioneer Walt Cade, as well as auction hunters Ricky and Bubba Smith, Morris \"Moe\" Prigoff, Victor Rjesnjansky, Lesa Lewis and her assistant Jerry Simpson, and Roy Williams, with new bidders Jenny Grumbles and Mary Padian starting in the second season. The premise is essentially the same as the parent show: when rent is not paid on a storage locker for three months in Texas, the contents are sold by an auctioneer as a single lot of items. The show follows professional buyers who bid on the contents based only on a five-minute inspection and what they can see only from the door when it is opened.\nSixteen episodes were filmed for the first season, debuting on A&E on Tuesday December 6, 2011. The premiere episode garnered 4.1 million viewers, making it the most watched series launch in network history. Viewers got a glimpse of Storage Wars: Texas on the first Storage Wars: Unlocked special, when Ricky and Bubba appeared to present a teaser clip. It was revealed that the show was to have been originally called Storage Wars: Dallas. It was later revealed that Storage Wars: Texas and its parent series Storage Wars had both been renewed for another twenty-six episode season respectively, with the second season of Texas premiering on August 15, 2012. Storage Wars: Texas can be seen internationally as well, as AETN International has sold the series to several channels in Canada, Finland, and the Netherlands. Roy Williams did not return for Season 2, and the team of Lesa Lewis & Jerry Simpson, also did not return as main cast members.", "rate": 50, "genre": [], "cast": ["Roy Williams"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42188   Expand Storage Wars: Texas   (2011) User Score Overview Storage Wars: Texas is a reality television series on the A&E Network that premiered in 2011. It is a regionalized spin-off of the highly-popular series Storage Wars. The show features auctioneer Walt Cade, as well as auction hunters Ricky and Bubba Smith, Morris \"Moe\" Prigoff, Victor Rjesnjansky, Lesa Lewis and her assistant Jerry Simpson, and Roy Williams, with new bidders Jenny Grumbles and Mary Padian starting in the second season. The premise is essentially the same as the parent show: when rent is not paid on a storage locker for three months in Texas, the contents are sold by an auctioneer as a single lot of items. The show follows professional buyers who bid on the contents based only on a five-minute inspection and what they can see only from the door when it is opened. Sixteen episodes were filmed for the first season, debuting on A&E on Tuesday December 6, 2011. The premiere episode garnered 4.1 million viewers, making it the most watched series launch in network history. Viewers got a glimpse of Storage Wars: Texas on the first Storage Wars: Unlocked special, when Ricky and Bubba appeared to present a teaser clip. It was revealed that the show was to have been originally called Storage Wars: Dallas. It was later revealed that Storage Wars: Texas and its parent series Storage Wars had both been renewed for another twenty-six episode season respectively, with the second season of Texas premiering on August 15, 2012. Storage Wars: Texas can be seen internationally as well, as AETN International has sold the series to several channels in Canada, Finland, and the Netherlands. Roy Williams did not return for Season 2, and the team of Lesa Lewis & Jerry Simpson, also did not return as main cast members. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roy Williams Full Cast & Crew Last Season Season 3 2013 | 28 Episodes Season 3 of Storage Wars: Texas premiered on August 27, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Storage Wars: Texas. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors D 5 DracoAn 3 Simon V. s 3 speedycars D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}