{"link": "https://www.themoviedb.org/tv/65158?language=en", "title": "War and Peace", "resume": "Eight-hour epic based on the book of the same name by Leo Tolstoy. Two main story-lines are complex and intertwined. One is the love story of young Countess Natasha Rostova and Count Pierre Bezukhov, who is unhappy in his marriage. Another is the \"Great Patriotic War\" of 1812 against the invading Napoleon's Armies.", "rate": 95, "genre": ["Drama", "War", "Politics"], "cast": ["Sergey Bondarchuk", "Lyudmila Saveleva", "Vyacheslav Tikhonov"], "character": ["Pierre Bezukhov", "Natasha Rostova", "Andrei Bolkonsky"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65158   Expand War and Peace   (1965) User Score Overview Eight-hour epic based on the book of the same name by Leo Tolstoy. Two main story-lines are complex and intertwined. One is the love story of young Countess Natasha Rostova and Count Pierre Bezukhov, who is unhappy in his marriage. Another is the \"Great Patriotic War\" of 1812 against the invading Napoleon's Armies. Featured Crew Sergey Bondarchuk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sergey Bondarchuk Pierre Bezukhov Lyudmila Saveleva Natasha Rostova Vyacheslav Tikhonov Andrei Bolkonsky Full Cast & Crew Last Season Season 1 1965 | 4 Episodes Season 1 of War and Peace premiered on June  6, 1965. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for War and Peace. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on War and Peace. You can help by rating TV shows you've seen. Facts Original Name  Война и мир Status  Ended Networks - Certification 16+ Meaning Only teens the age of 16 or older can watch. Type  Miniseries Original Language  Russian Runtime  431m Homepage  - Genres Drama War & Politics Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 31 Fludogenerator 6 Fleeman6109 3 Elizabeth Jennings s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}