{"link": "https://www.themoviedb.org/tv/34760?language=en", "title": "Yomigaeru Sora – Rescue Wings", "resume": "Yomigaeru Sora - Rescue Wings - is a Japanese anime series produced by J.C. STAFF which aired on TV Tokyo in 2006. The main character is 2nd Lieutenant Uchida Kazuhiro, a helicopter pilot in a search and rescue wing of the Japan Air Self Defense Force. A live-action movie adaptation was produced in 2008, with the original Japanese premiere on 2009. Two manga series were also written, having different storylines but based on the overall theme of SAR squads and personnel.\nThe real life JASDF Komatsu Air Base hosts a search and rescue wing in addition to two fighter wings with F-15J's and T-4's as portrayed in the anime. JDS Haruna, on which Hongou lands on to refuel in Episode 3, is a real ship of the JMSDF.", "rate": 0, "genre": ["Animation", "Action", "Adventure", "Drama"], "cast": ["Unsho Ishizuka", "Mamiko Noto", "Issei Miyazaki", "Mitsuaki Hoshino", "Shozo Iizuka"], "character": ["Shujiro Hongo", "Megumi Hasegawa", "Kazuhiro Uchida", "Ryunosuke Murakami", "Yutaka Motomura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34760   Expand Yomigaeru Sora – Rescue Wings   (2006) User Score Overview Yomigaeru Sora - Rescue Wings - is a Japanese anime series produced by J.C. STAFF which aired on TV Tokyo in 2006. The main character is 2nd Lieutenant Uchida Kazuhiro, a helicopter pilot in a search and rescue wing of the Japan Air Self Defense Force. A live-action movie adaptation was produced in 2008, with the original Japanese premiere on 2009. Two manga series were also written, having different storylines but based on the overall theme of SAR squads and personnel. The real life JASDF Komatsu Air Base hosts a search and rescue wing in addition to two fighter wings with F-15J's and T-4's as portrayed in the anime. JDS Haruna, on which Hongou lands on to refuel in Episode 3, is a real ship of the JMSDF. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Unsho Ishizuka Shujiro Hongo Mamiko Noto Megumi Hasegawa Issei Miyazaki Kazuhiro Uchida Mitsuaki Hoshino Ryunosuke Murakami Shozo Iizuka Yutaka Motomura Full Cast & Crew Last Season Yomigaeru sora rescue wings season 1 2006 | 13 Episodes Season 1 of Yomigaeru Sora – Rescue Wings premiered on January  9, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Yomigaeru Sora – Rescue Wings. You can help by rating TV shows you've seen. Facts Original Name  よみがえる空 -Rescue Wings- Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Action & Adventure Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 6 seboseboss m 3 magoozin 2 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}