{"link": "https://www.themoviedb.org/tv/45088?language=en", "title": "Tamayura", "resume": "Tamayura is a Japanese anime series written and directed by Junichi Sato. The initial four-episode original video animation series was produced by Hal Film Maker and released over two Blu-ray Disc and DVD volumes in November and December 2010. A 12-episode anime TV series produced by TYO Animations, titled Tamayura: Hitotose, aired in Japan between October and December 2011. A second TV anime season, Tamayura: More Aggressive, aired between July and September 2013. Two manga adaptations illustrated by Momo are published by Mag Garden.", "rate": 55, "genre": ["Comedy", "Animation"], "cast": ["Yuka Gibu", "Kana Asumi", "Yuka Iguchi", "Ayana Taketatsu", "Kayano Ai"], "character": ["Maon Sakurada", "Kaoru Hanawa", "Norie Okazaki", "Fuu Sawatari", "Kanae Mitani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45088   Expand Tamayura   (2010) User Score Overview Tamayura is a Japanese anime series written and directed by Junichi Sato. The initial four-episode original video animation series was produced by Hal Film Maker and released over two Blu-ray Disc and DVD volumes in November and December 2010. A 12-episode anime TV series produced by TYO Animations, titled Tamayura: Hitotose, aired in Japan between October and December 2011. A second TV anime season, Tamayura: More Aggressive, aired between July and September 2013. Two manga adaptations illustrated by Momo are published by Mag Garden. Featured Crew Junichi Sato Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuka Gibu Maon Sakurada Kana Asumi Kaoru Hanawa Yuka Iguchi Norie Okazaki Ayana Taketatsu Fuu Sawatari Kayano Ai Kanae Mitani Full Cast & Crew Last Season Season 2 2013 | 12 Episodes Season 2 of Tamayura premiered on July  3, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tamayura. You can help by rating TV shows you've seen. Facts Original Name  たまゆら Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tamayura.info/ Genres Comedy Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 9 purposelycryptic 9 lineker J 8 Jason 3 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}