{"link": "https://www.themoviedb.org/tv/3863?language=en", "title": "Countdown", "resume": "Countdown is a British game show involving word and number puzzles. It is produced by ITV Studios and broadcast on Channel 4. It is presented by Nick Hewer, assisted by Rachel Riley, with regular lexicographer Susie Dent. It was the first programme to be aired on Channel 4, and 67 series have been broadcast since its debut on 2 November 1982. With over 5,000 episodes, Countdown is one of the longest-running game shows in the world, along with the original French version, Des chiffres et des lettres, which has been running on French television continuously since 1965. Countdown was initially recorded at The Leeds Studios for 27 years, before moving to Granada Studios in 2009, and then over to MediaCityUK in Salford Quays in 2013.\nThe programme was presented by Richard Whiteley for over 20 years, until his death in June 2005. It was then presented by Des Lynam until the end of 2006, Des O'Connor until the end of 2008, and Jeff Stelling until the end of 2011. The current presenter is Nick Hewer.\nCarol Vorderman, the show's co-host, who had been on the programme since it began, left the show in December 2008, at the same time as O'Connor. She was replaced by Rachel Riley.\nA celebrity guest features in every programme, and provides a brief interlude before the first advertisement break. The two contestants in each episode compete in three disciplines: eleven letters rounds, in which the contestants attempt to make the longest word possible from nine randomly chosen letters; three numbers rounds, in which the contestants must use arithmetic to reach a random target number from six other numbers; and the conundrum, a buzzer round in which the contestants compete to solve a nine-letter anagram. During the series heats, the winning contestant returns the next day until he or she loses or has accumulated eight wins. The best contestants are invited back for the series finals, which are decided in knockout format. Contestants of exceptional skill have received national media coverage, and the programme as a whole is widely recognised and parodied within British culture.", "rate": 54, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3863   Expand Countdown   (1982) User Score Overview Countdown is a British game show involving word and number puzzles. It is produced by ITV Studios and broadcast on Channel 4. It is presented by Nick Hewer, assisted by Rachel Riley, with regular lexicographer Susie Dent. It was the first programme to be aired on Channel 4, and 67 series have been broadcast since its debut on 2 November 1982. With over 5,000 episodes, Countdown is one of the longest-running game shows in the world, along with the original French version, Des chiffres et des lettres, which has been running on French television continuously since 1965. Countdown was initially recorded at The Leeds Studios for 27 years, before moving to Granada Studios in 2009, and then over to MediaCityUK in Salford Quays in 2013. The programme was presented by Richard Whiteley for over 20 years, until his death in June 2005. It was then presented by Des Lynam until the end of 2006, Des O'Connor until the end of 2008, and Jeff Stelling until the end of 2011. The current presenter is Nick Hewer. Carol Vorderman, the show's co-host, who had been on the programme since it began, left the show in December 2008, at the same time as O'Connor. She was replaced by Rachel Riley. A celebrity guest features in every programme, and provides a brief interlude before the first advertisement break. The two contestants in each episode compete in three disciplines: eleven letters rounds, in which the contestants attempt to make the longest word possible from nine randomly chosen letters; three numbers rounds, in which the contestants must use arithmetic to reach a random target number from six other numbers; and the conundrum, a buzzer round in which the contestants compete to solve a nine-letter anagram. During the series heats, the winning contestant returns the next day until he or she loses or has accumulated eight wins. The best contestants are invited back for the series finals, which are decided in knockout format. Contestants of exceptional skill have received national media coverage, and the programme as a whole is widely recognised and parodied within British culture. Featured Crew Armand Jammot Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 71 2014 | 83 Episodes Season 71 of Countdown premiered on June 30, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1991-01-03 The Mary Whitehouse Experience 8.0    2009-08-24 Pointless 6.9    Soccer Saturday 6.5    Match of the Day 8.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  36m, 45m Homepage   http://www.channel4.com/programmes/countdown Genres Reality Keywords game show Content Score 64 We're so close, yet so far. Top Contributors 79 Elizabeth Jennings TB 2 TMDb Bot 2 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}