{"link": "https://www.themoviedb.org/tv/22371?language=en", "title": "Love Hina Again", "resume": "Keitaro has finally passed the entrance exams, and is officially a Toudai student. But after breaking his leg in an accident in the entrance ceremony, he thought and re-evaluated himself. Having new goals, Keitaro follows Seta on an overseas archeology trip. During his absence, however, all was not well in Hinata Lodge. Urashima Kanako, Keitaro's sister, arrives on the scene. She claims to be the new manager of Hinata Lodge starts to go against all the tenants. Things become even more complicated when they recieve a letter from Keitaro. The tenants and Kanako made a big mess trying to get the letter, but Seta's car crashes in before anyone could read the letter...", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Megumi Hayashibara", "Reiko Takagi", "Yuu Asakawa", "Satsuki Yukino", "Yuki Matsuoka"], "character": ["Haruka Urashima (voice)", "Kaolla Su (voice)", "Motoko Aoyama (voice)", "Mutsumi Otohime (voice)", "Kuro (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 22371   Expand Love Hina Again   (2002) User Score Overview Keitaro has finally passed the entrance exams, and is officially a Toudai student. But after breaking his leg in an accident in the entrance ceremony, he thought and re-evaluated himself. Having new goals, Keitaro follows Seta on an overseas archeology trip. During his absence, however, all was not well in Hinata Lodge. Urashima Kanako, Keitaro's sister, arrives on the scene. She claims to be the new manager of Hinata Lodge starts to go against all the tenants. Things become even more complicated when they recieve a letter from Keitaro. The tenants and Kanako made a big mess trying to get the letter, but Seta's car crashes in before anyone could read the letter... Featured Crew Sho Aikawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Megumi Hayashibara Haruka Urashima (voice) Reiko Takagi Kaolla Su (voice) Yuu Asakawa Motoko Aoyama (voice) Satsuki Yukino Mutsumi Otohime (voice) Yuki Matsuoka Kuro (voice) Full Cast & Crew Last Season Love Hina Again 2002 | 3 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Love Hina Again. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2000-04-19 Love Hina 7.2  Facts Original Name  ラブひなAgain Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Comedy Drama Keywords lovestory Content Score 93 Almost there... Top Contributors t 23 tmdb983464 B 19 Burnd33 11 Sergiojamon 4 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}