{"link": "https://www.themoviedb.org/tv/31360?language=en", "title": "Autumn's Concerto", "resume": "Autumn's Concerto is a 2009 Taiwanese drama starring Ady An, Vanness Wu of F4, and Tiffany Hsu. It was produced by Sanlih E-Television and directed by Chen Hui Ling. The drama started filming in June 2009 and was completed in December 2009.\nIt was first broadcast in Taiwan on free-to-air Taiwan Television from 4 October 2009 to 28 February 2010, on Sundays at 22:00 to 23:30. It was also shown on cable TV Sanlih E-Television on 10 October 2009 to 6 March 2010 on Saturdays at 21:00 to 22:30.\nAutumn's Concerto was nominated in 2010 for Best Marketing Programme at the 45th Golden Bell Awards, Taiwan.\nKnown as the drama serial which shot the child actor Xiao Xiao Bin to stardom, Autumn's Concerto has broken records with its high ratings. Scoring 8.23 as its peak point for episode 18, which aired January 31, 2010, Autumn's Concerto has broken the records of The Prince Who Turns into a Frog to become the second highest rating Taiwanese idol drama, the highest rating being held by Fated to Love You. Autumn's Concerto now airs on Hawaii's KIKU television, weekly on Saturday's at 7:00.", "rate": 78, "genre": ["Drama", "Romance"], "cast": ["Ady An", "Vanness Wu", "Tiffany Hsu", "Chris Wu"], "character": ["Liang Mu Cheng", "Ren Guang Xi", "He Yi Qian", "Hua Tuo Ye"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31360   Expand Autumn's Concerto   (2009) User Score Overview Autumn's Concerto is a 2009 Taiwanese drama starring Ady An, Vanness Wu of F4, and Tiffany Hsu. It was produced by Sanlih E-Television and directed by Chen Hui Ling. The drama started filming in June 2009 and was completed in December 2009. It was first broadcast in Taiwan on free-to-air Taiwan Television from 4 October 2009 to 28 February 2010, on Sundays at 22:00 to 23:30. It was also shown on cable TV Sanlih E-Television on 10 October 2009 to 6 March 2010 on Saturdays at 21:00 to 22:30. Autumn's Concerto was nominated in 2010 for Best Marketing Programme at the 45th Golden Bell Awards, Taiwan. Known as the drama serial which shot the child actor Xiao Xiao Bin to stardom, Autumn's Concerto has broken records with its high ratings. Scoring 8.23 as its peak point for episode 18, which aired January 31, 2010, Autumn's Concerto has broken the records of The Prince Who Turns into a Frog to become the second highest rating Taiwanese idol drama, the highest rating being held by Fated to Love You. Autumn's Concerto now airs on Hawaii's KIKU television, weekly on Saturday's at 7:00. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ady An Liang Mu Cheng Vanness Wu Ren Guang Xi Tiffany Hsu He Yi Qian Chris Wu Hua Tuo Ye Full Cast & Crew Last Season Season 1 2009 | 21 Episodes Season 1 of Autumn's Concerto premiered on October  4, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  7 Recommendations   2015-07-22 Diamond Lover 6.9    2016-03-06 Refresh Man 7.0  Facts Original Name  下一站，幸福 Status  Ended Networks TTV Main Channel Sanlih E-Television Certification  - Type  Scripted Original Language  Chinese Runtime  90m Homepage   http://www.ttv.com.tw/drama09/next/index.htm Genres Drama Romance Keywords taiwanese Content Score 86 Almost there... Top Contributors M 23 Maria180493 z 5 zurman1 3 lareina123 k 3 khyungil  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}