{"link": "https://www.themoviedb.org/tv/42887?language=en", "title": "Sayonara Zetsubou Sensei", "resume": "Sayonara, Zetsubou-Sensei is a Japanese manga by Kōji Kumeta, serialized in Weekly Shōnen Magazine. It is a comedy about a teacher who takes all aspects of life, word and culture in the most negative light possible. It satirizes politics, media, and Japanese society. In 2007, the manga received the thirty-first Kodansha Manga Award in the shōnen category, and was adapted into a twelve-episode anime series. A second season, titled Sayonara, Zetsubou-Sensei aired between January and March 2008. A set of three OVAs titled Goku: Sayonara, Zetsubou-Sensei were produced between October 2008 and February 2009. The first and third volume were bundled with the limited edition of volume fifteen and sixteen of the manga while the second volume was released separately. A third anime TV series, Zan: Sayonara, Zetsubou-Sensei, aired between July and September 2009.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42887   Expand Sayonara Zetsubou Sensei   (2007) User Score Overview Sayonara, Zetsubou-Sensei is a Japanese manga by Kōji Kumeta, serialized in Weekly Shōnen Magazine. It is a comedy about a teacher who takes all aspects of life, word and culture in the most negative light possible. It satirizes politics, media, and Japanese society. In 2007, the manga received the thirty-first Kodansha Manga Award in the shōnen category, and was adapted into a twelve-episode anime series. A second season, titled Sayonara, Zetsubou-Sensei aired between January and March 2008. A set of three OVAs titled Goku: Sayonara, Zetsubou-Sensei were produced between October 2008 and February 2009. The first and third volume were bundled with the limited edition of volume fifteen and sixteen of the manga while the second volume was released separately. A third anime TV series, Zan: Sayonara, Zetsubou-Sensei, aired between July and September 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Zan Sayonara Zetsubou Sensei 2009 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Sayonara Zetsubou Sensei. You can help by rating TV shows you've seen. Facts Original Name  さよなら絶望先生 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.starchild.co.jp/special/zetsubou/ Genres Animation Comedy Keywords dark comedy based on manga shounen anime Content Score 56 We're so close, yet so far. Top Contributors 21 deanzel 18 Sergiojamon 10 seboseboss LC 9 Legit Corporation  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}