{"link": "https://www.themoviedb.org/tv/45008?language=en", "title": "Undercover Boss Canada", "resume": "Undercover Boss, commonly referred to as Undercover Boss Canada is a Canadian reality television series, based on the British series of the same name. Each episode depicts a person who has a high management position at a major Canadian business, deciding to become undercover as an entry-level employee to discover the faults in the company. The first season, which consisted of 10 episodes, ran from February 2, 2012 to April 5, 2012, on W Network. On April 3, 2012, W Network, Alliance, and Corus ordered an additional 30 episodes for the series, to be split into four new seasons.\nThe second season, which consisted of 10 episodes, aired from September 6, 2012 to November 8, 2012. The show's third season, which contains 10 episodes, will air from January 17, 2013 to March 21, 2013.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45008   Expand Undercover Boss Canada User Score Overview Undercover Boss, commonly referred to as Undercover Boss Canada is a Canadian reality television series, based on the British series of the same name. Each episode depicts a person who has a high management position at a major Canadian business, deciding to become undercover as an entry-level employee to discover the faults in the company. The first season, which consisted of 10 episodes, ran from February 2, 2012 to April 5, 2012, on W Network. On April 3, 2012, W Network, Alliance, and Corus ordered an additional 30 episodes for the series, to be split into four new seasons. The second season, which consisted of 10 episodes, aired from September 6, 2012 to November 8, 2012. The show's third season, which contains 10 episodes, will air from January 17, 2013 to March 21, 2013. Featured Crew Stephen Lambert Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors f 2 farangkao  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}