{"link": "https://www.themoviedb.org/tv/66858?language=en", "title": "Shut Eye", "resume": "A darkly comedic look at the world of Los Angeles storefront psychics and the organized crime syndicate that runs them. Former magician Charlie Haverford oversees a number of fortune telling parlors on behalf of his violent and domineering Romani kingpin boss, until a blow to the head jars him into a new mindset, making him question everything he has ever believed.", "rate": 63, "genre": ["Comedy", "Drama"], "cast": ["Jeffrey Donovan", "KaDee Strickland", "Dylan Schmid", "Susan Misner", "Angus Sampson"], "character": ["Charlie Haverford", "Linda Haverford", "Nick", "Dr. Nora White", "Fonso Marks"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66858   Expand Shut Eye   (2016) User Score  Play Trailer Overview A darkly comedic look at the world of Los Angeles storefront psychics and the organized crime syndicate that runs them. Former magician Charlie Haverford oversees a number of fortune telling parlors on behalf of his violent and domineering Romani kingpin boss, until a blow to the head jars him into a new mindset, making him question everything he has ever believed. Featured Crew Leslie Bohem Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeffrey Donovan Charlie Haverford KaDee Strickland Linda Haverford Dylan Schmid Nick Susan Misner Dr. Nora White Angus Sampson Fonso Marks Full Cast & Crew Current Season Season 2 2017 | 10 Episodes Season 2 of Shut Eye premiered on December  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  1 Posters  3 Recommendations   2013-10-02 Cleaners 7.4    2014-08-04 Partners 5.1    2017-10-01 Ten Days in the Valley 6.0    2014-01-13 Chozen 6.1    2012-10-11 Copper 6.0    2013-02-19 Cult 4.2    2018-02-26 Final Space 7.8    2016-03-13 Houdini & Doyle 5.7  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://www.hulu.com/shut-eye Genres Comedy Drama Keywords dark comedy con man organized crime los angeles psychic Content Score 100 Yes! Looking good! Top Contributors 19 Elizabeth Jennings 17 muku555 p 15 plumpro 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}