{"link": "https://www.themoviedb.org/tv/29642?language=en", "title": "A Very British Coup", "resume": "A Very British Coup is a British political thriller series based on the novel by Chris Mullin. It stars Ray McAnally as the newly elected left-wing prime minister Harry Perkins, who soon finds himself up to his neck in conspiracy.", "rate": 81, "genre": ["Drama"], "cast": ["Ray McAnally", "Tim McInnerny", "Keith Allen"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29642   Expand A Very British Coup   (1988) User Score Overview A Very British Coup is a British political thriller series based on the novel by Chris Mullin. It stars Ray McAnally as the newly elected left-wing prime minister Harry Perkins, who soon finds himself up to his neck in conspiracy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ray McAnally Tim McInnerny Keith Allen Full Cast & Crew Last Season Season 1 1988 | 3 Episodes Season 1 of A Very British Coup premiered on June 19, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1996-01-15 Our Friends in the North 8.5    2014-03-19 W1A 7.6    1985-11-04 Edge of Darkness 8.4    1996-04-28 Karaoke 7.4    1996-05-26 Cold Lazarus 7.3    1982-09-20 Smiley's People 7.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  55m Homepage   http://www.channel4.com/programmes/a-very-british-coup Genres Drama Keywords politics conspiracy miniseries british politics british prime minister Content Score 56 We're so close, yet so far. Top Contributors 13 Banana R 5 Rebecca TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}