{"link": "https://www.themoviedb.org/tv/67831?language=en", "title": "People of Earth", "resume": "Skeptical journalist Ozzie Graham investigates a support group for alien abductees to write about the members' supposed encounters. The more he digs into their oddball claims, the more he realizes there is truth in their stories and possibly even signs that point to his own alien abduction.", "rate": 76, "genre": ["Comedy"], "cast": ["Wyatt Cenac", "Oscar Nunez", "Ana Gasteyer", "Luka Jones", "Alice Wetterlund"], "character": ["Ozzie Graham", "Father Doug", "Gina Morrison", "Gerry Johnson", "Kelly Grady"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67831   Expand People of Earth   (2016) User Score  Play Trailer Overview Skeptical journalist Ozzie Graham investigates a support group for alien abductees to write about the members' supposed encounters. The more he digs into their oddball claims, the more he realizes there is truth in their stories and possibly even signs that point to his own alien abduction. Featured Crew David Jenkins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wyatt Cenac Ozzie Graham Oscar Nunez Father Doug Ana Gasteyer Gina Morrison Luka Jones Gerry Johnson Alice Wetterlund Kelly Grady Full Cast & Crew Last Season Season 2 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  8 Subject Status Replies Last Reply People Of Earth: Cancelled :( Open 1 by  Patrick E. Abe Season Two Finale Open 0 by CaseyJones\n      \n     PoE: the new GoT? Open 0 by Hypnocratic Goat\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  5 Posters  4 Recommendations   2011-09-29 How to Be a Gentleman 5.3    2015-12-08 Tripped 7.3    2015-08-05 Difficult People 7.4    2016-01-22 Stan Lee's Lucky Man 7.3    2014-04-02 TripTank 4.6    2017-08-04 Wet Hot American Summer: 10 Years Later 6.8    2013-08-05 Quick Draw 6.3    2014-10-02 Bad Judge 6.1  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  22m Homepage   http://www.tbs.com/shows/people-of-earth.html Genres Comedy Keywords support group alien abduction skeptic investigative journalist Content Score 100 Yes! Looking good! Top Contributors 64 Elizabeth Jennings c 4 cfowler f 4 flashcg 4 helmetcreator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}