{"link": "https://www.themoviedb.org/tv/12151?language=en", "title": "Mike Bassett: Manager", "resume": "Mike Bassett: Manager is a British TV comedy series, which began transmitting from 29 September 2005 on ITV. It is a follow-up to the film Mike Bassett: England Manager, and stars Ricky Tomlinson in the title role, Steve Edge as his assistant, and Amanda Redman as his long-suffering wife, Karine. Neil Maskell, known from the Football Factory film, appears as a clubzine reporter.\nThe series picks up some time after Mike took England to the semi-finals of the 2002 World Cup. The side's attempt at qualifying for the 2004 European Championships ended in disaster, resulting in Mike being sacked. Since then, a spell at Newcastle ended in similar fashion after getting them relegated two seasons in a row, while his returns to former clubs Norwich and then Colchester fared little better. Mike decides to retire, but at the last minute is offered the manager's job at Wirral County F.C., for whom his father was a player. They seem doomed to be relegated to the Football Conference. Not helping his job is the fact that the chairman is senile, the chief executive is eagerly awaiting relegation so that he can sell their ground and Karine isn't pleased with the idea of retiring in Ellesmere Port rather than Spain.", "rate": 70, "genre": ["Comedy"], "cast": ["Ricky Tomlinson", "Steve Edge", "Amanda Redman", "David Gyasi"], "character": ["Karine Bassett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12151   Expand Mike Bassett: Manager   (2005) User Score Overview Mike Bassett: Manager is a British TV comedy series, which began transmitting from 29 September 2005 on ITV. It is a follow-up to the film Mike Bassett: England Manager, and stars Ricky Tomlinson in the title role, Steve Edge as his assistant, and Amanda Redman as his long-suffering wife, Karine. Neil Maskell, known from the Football Factory film, appears as a clubzine reporter. The series picks up some time after Mike took England to the semi-finals of the 2002 World Cup. The side's attempt at qualifying for the 2004 European Championships ended in disaster, resulting in Mike being sacked. Since then, a spell at Newcastle ended in similar fashion after getting them relegated two seasons in a row, while his returns to former clubs Norwich and then Colchester fared little better. Mike decides to retire, but at the last minute is offered the manager's job at Wirral County F.C., for whom his father was a player. They seem doomed to be relegated to the Football Conference. Not helping his job is the fact that the chairman is senile, the chief executive is eagerly awaiting relegation so that he can sell their ground and Karine isn't pleased with the idea of retiring in Ellesmere Port rather than Spain. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ricky Tomlinson Steve Edge Amanda Redman Karine Bassett David Gyasi Full Cast & Crew Last Season Season 1 2005 | 6 Episodes Season 1 of Mike Bassett: Manager premiered on September 29, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mike Bassett: Manager. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords sport soccer british comedy based on movie british humour Content Score 86 Almost there... Top Contributors O 7 Ozbourne 6 Banana D 2 Daniel 1 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}