{"link": "https://www.themoviedb.org/tv/55615?language=en", "title": "Scot Squad", "resume": "Mockumentary comedy series following the life of scottish police officers from different areas of the force in a fly on the wall style.", "rate": 0, "genre": ["Comedy"], "cast": ["Jack Docherty", "Jordan Young", "Sally Reid", "Grado", "Manjot Sumal"], "character": ["Chief Commissioner Cameron Miekelson", "PC Jack McLaren", "PC Sarah Fletcher", "PC Hugh McKirdy", "PC Surjit Singh"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 55615   Expand Scot Squad   (2012) User Score  Play Trailer Overview Mockumentary comedy series following the life of scottish police officers from different areas of the force in a fly on the wall style. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Docherty Chief Commissioner Cameron Miekelson Jordan Young PC Jack McLaren Sally Reid PC Sarah Fletcher Grado PC Hugh McKirdy Manjot Sumal PC Surjit Singh Full Cast & Crew Last Season Series 3 2017 | 5 Episodes Season 3 of Scot Squad premiered on January  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Scot Squad. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b06kw5fq Genres Comedy Keywords scotland mockumentary spoof Content Score 93 Almost there... Top Contributors 35 Elizabeth Jennings 7 t0by 1 tigru89 1 RubusSpectabilis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}