{"link": "https://www.themoviedb.org/tv/3922?language=en", "title": "Hee Haw", "resume": "Hee Haw was an American television variety show featuring country music and humor with fictional rural Kornfield Kounty as a backdrop. It aired on CBS-TV from 1969–1971 before a 20-year run in local syndication. The show was inspired by Rowan & Martin's Laugh-In, the major difference being that Hee Haw was far less topical, and was centered on country music and rural Southern culture. Co-hosted by country artists Buck Owens and Roy Clark for most of the series' run, the show was equally well known for its voluptuous, scantily-clad women in stereotypical farmer's daughter outfits and country-style minidresses, and its cornpone humor.\nHee Haw's appeal, however, was not limited to a rural audience. It was successful in all of the major markets, including New York, Los Angeles and Chicago. Other niche programs such as The Lawrence Welk Show and Soul Train also rose to prominence in syndication during the era. Like Laugh-In, the show minimized production costs by taping all of the recurring sketches for a season in batches— setting up for the Cornfield one day, the Joke Fence another, etc. At the height of its popularity, an entire year's worth of shows would be taped in two separate week-long sessions, then individual shows would be assembled from edited sections. Only musical performances were taped with a live audience; a laugh track was added to all other segments.", "rate": 80, "genre": ["Comedy"], "cast": ["Grandpa Jones", "Don Harron", "Gordie Tapp", "George Lindsey"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3922   Expand Hee Haw   (1969) User Score Overview Hee Haw was an American television variety show featuring country music and humor with fictional rural Kornfield Kounty as a backdrop. It aired on CBS-TV from 1969–1971 before a 20-year run in local syndication. The show was inspired by Rowan & Martin's Laugh-In, the major difference being that Hee Haw was far less topical, and was centered on country music and rural Southern culture. Co-hosted by country artists Buck Owens and Roy Clark for most of the series' run, the show was equally well known for its voluptuous, scantily-clad women in stereotypical farmer's daughter outfits and country-style minidresses, and its cornpone humor. Hee Haw's appeal, however, was not limited to a rural audience. It was successful in all of the major markets, including New York, Los Angeles and Chicago. Other niche programs such as The Lawrence Welk Show and Soul Train also rose to prominence in syndication during the era. Like Laugh-In, the show minimized production costs by taping all of the recurring sketches for a season in batches— setting up for the Cornfield one day, the Joke Fence another, etc. At the height of its popularity, an entire year's worth of shows would be taped in two separate week-long sessions, then individual shows would be assembled from edited sections. Only musical performances were taped with a live audience; a laugh track was added to all other segments. Featured Crew Frank Peppiatt Creator John Aylesworth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Grandpa Jones Don Harron Gordie Tapp George Lindsey Full Cast & Crew Last Season Season 1 1969 | 1 Episode Season 1 of Hee Haw premiered on June 15, 1969. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Hee Haw. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.heehaw.com Genres Comedy Keywords variety show Content Score 93 Almost there... Top Contributors 10 Wanderer189 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}