{"link": "https://www.themoviedb.org/tv/654?language=en", "title": "Reba", "resume": "After her dentist husband of 20 years leaves her for his dental hygienist, Reba Hart's seemingly perfect world is turned upside down.​", "rate": 57, "genre": ["Comedy"], "cast": ["Reba McEntire", "JoAnna Garcia", "Steve Howey", "Christopher Rich", "Mitch Holleman"], "character": ["Reba Hart", "Cheyenne Hart Montgomery", "Van Montgomery", "Brock Hart", "Jake Hart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 654   Expand Reba   (2001) User Score Overview After her dentist husband of 20 years leaves her for his dental hygienist, Reba Hart's seemingly perfect world is turned upside down.​ Featured Crew Allison M. Gibson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Reba McEntire Reba Hart JoAnna Garcia Cheyenne Hart Montgomery Steve Howey Van Montgomery Christopher Rich Brock Hart Mitch Holleman Jake Hart Full Cast & Crew Last Season Season 6 2006 | 13 Episodes Season 6 of Reba premiered on November 19, 2006. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply M Joanna Garcia was so hot on this show! Open 1 by  Lloyd S Brian Campbell Open 0 by Strannger18\n      \n     w Cheyenne: Happy Birthday JoAnna Garcia! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   1982-09-27 Square Pegs 7.3    1991-05-11 Sisters 6.7    1988-11-14 Murphy Brown 6.5    2003-09-26 Hope & Faith 5.1    1994-09-21 Touched by an Angel 5.3    1968-01-09 It Takes a Thief 7.4    1973-01-28 Barnaby Jones 8.0    1994-03-29 Ellen 6.2  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords texas single mother family sitcom Content Score 93 Almost there... Top Contributors 9 Banana R 5 Rebafan23 D 4 DracoAn w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}