{"link": "https://www.themoviedb.org/tv/63861?language=en", "title": "The Vault", "resume": "The year is 2016. TV sucks. Ratings - at least at one major network - are at an all-time low. Desperate to save their jobs, the executives make an unprecedented decision: It's time to pull the plug. On everything. All programming must go. But what will replace it? Enter \"The Vault,\" the greatest reality television competition in history... Or at least that's how they're selling it. A 24/7 game show that offers more questions than answers. The contestants, college students chosen from all over the country, will have 7 days to uncover its secrets and win a multi-million dollar prize. But once they're locked inside, they'll discover a game that's bigger and stranger than they could have ever imagined.", "rate": 67, "genre": ["Drama", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63861   Expand The Vault   (2011) User Score  Play Trailer Overview The year is 2016. TV sucks. Ratings - at least at one major network - are at an all-time low. Desperate to save their jobs, the executives make an unprecedented decision: It's time to pull the plug. On everything. All programming must go. But what will replace it? Enter \"The Vault,\" the greatest reality television competition in history... Or at least that's how they're selling it. A 24/7 game show that offers more questions than answers. The contestants, college students chosen from all over the country, will have 7 days to uncover its secrets and win a multi-million dollar prize. But once they're locked inside, they'll discover a game that's bigger and stranger than they could have ever imagined. Featured Crew Aaron Hann Creator Mario Miscione Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2011 | 15 Episodes Season 1 of The Vault premiered on April 16, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Vault. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://www.thevaultshow.com Genres Drama Mystery Keywords college game show university button cliffhanger puzzle solving Content Score 56 We're so close, yet so far. Top Contributors z 35 zweiratten 6 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}