{"link": "https://www.themoviedb.org/tv/66748?language=en", "title": "The Rebels", "resume": "Julie is in over her head when her husband suddenly dies leaving her as sole owner of a pro-football team.", "rate": 55, "genre": ["Comedy"], "cast": ["Natalie Zea", "Hayes MacArthur", "Affion Crockett", "Amin Joseph", "Hayley Erin"], "character": ["Julie Levine", "Rick Massella", "Lamont Slice", "Heather Massella"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66748   Expand The Rebels   (2014) User Score Overview Julie is in over her head when her husband suddenly dies leaving her as sole owner of a pro-football team. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natalie Zea Julie Levine Hayes MacArthur Rick Massella Affion Crockett Lamont Slice Amin Joseph Hayley Erin Heather Massella Full Cast & Crew Last Season Season 1 2014 | 1 Episode Season 1 of The Rebels premiered on February  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Rebels. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  28m Homepage   http://www.amazon.com/Pilot-HD/dp/B00I3MOG6G Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 33 United600 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}