{"link": "https://www.themoviedb.org/tv/965?language=en", "title": "Where in the World Is Carmen Sandiego?", "resume": "Where in the World Is Carmen Sandiego? is an American children's television game show based on the Carmen Sandiego computer game series created by Brøderbund Software. The program aired on PBS from September 30, 1991 until December 22, 1995, and reruns of the series continued until October 4, 1996. Greg Lee hosted the program in the role of \"The ACME Special Agent in charge of training new recruits.\" He was joined by Lynne Thigpen as \"The Chief\" and a capella performing group Rockapella, who served as the show's in-house band and comedy troupe. The series was recorded in New York City and coproduced by PBS stations WQED and WGBH. Howard Blumenthal, Dana Calderwood, and Dorothy Curley were the series' developers and Blumenthal served as the show's producer for its first four seasons.\nThe show was created partially in response to the results of a National Geographic survey that indicated Americans had alarmingly little knowledge of geography, with one in four being unable to locate the Soviet Union or the Pacific Ocean. Each episode consists of three contestants answering questions to determine the location of one of Carmen Sandiego's henchmen. The contestants are referred to as \"gumshoes\" throughout the program in reference to private detectives that are just starting out in the field. The program received the George Foster Peabody Award for excellence in 1993. The program's theme song, written by Sean Altman and David Yazbek, has maintained public awareness over the years. In 2001, TV Guide ranked the show at #47 on its list of 50 Greatest Game Shows of All Time.", "rate": 80, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 965   Expand Where in the World Is Carmen Sandiego? User Score Overview Where in the World Is Carmen Sandiego? is an American children's television game show based on the Carmen Sandiego computer game series created by Brøderbund Software. The program aired on PBS from September 30, 1991 until December 22, 1995, and reruns of the series continued until October 4, 1996. Greg Lee hosted the program in the role of \"The ACME Special Agent in charge of training new recruits.\" He was joined by Lynne Thigpen as \"The Chief\" and a capella performing group Rockapella, who served as the show's in-house band and comedy troupe. The series was recorded in New York City and coproduced by PBS stations WQED and WGBH. Howard Blumenthal, Dana Calderwood, and Dorothy Curley were the series' developers and Blumenthal served as the show's producer for its first four seasons. The show was created partially in response to the results of a National Geographic survey that indicated Americans had alarmingly little knowledge of geography, with one in four being unable to locate the Soviet Union or the Pacific Ocean. Each episode consists of three contestants answering questions to determine the location of one of Carmen Sandiego's henchmen. The contestants are referred to as \"gumshoes\" throughout the program in reference to private detectives that are just starting out in the field. The program received the George Foster Peabody Award for excellence in 1993. The program's theme song, written by Sean Altman and David Yazbek, has maintained public awareness over the years. In 2001, TV Guide ranked the show at #47 on its list of 50 Greatest Game Shows of All Time. Featured Crew Brøderbund Software Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 8 Rafaelasauani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}