{"link": "https://www.themoviedb.org/tv/80404?language=en", "title": "Bestsellers", "resume": "From the creative team behind Anyone But Me, a comedy series about five modern professional women balancing life, career and book club.", "rate": 100, "genre": ["Comedy", "Drama"], "cast": ["Natalie Kuhn", "Alice Barden", "Catherine Curtin", "Mandy Bruno Bogue", "Dena Tyler"], "character": ["Taylor", "Zoe", "Abby", "Nina", "Jules"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80404   Expand Bestsellers   (2011) User Score  Play Trailer Overview From the creative team behind Anyone But Me, a comedy series about five modern professional women balancing life, career and book club. Featured Crew Susan Miller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natalie Kuhn Taylor Alice Barden Zoe Catherine Curtin Abby Mandy Bruno Bogue Nina Dena Tyler Jules Full Cast & Crew Last Season Season 1 2011 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bestsellers. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m Homepage   https://www.youtube.com/user/TheBestsellersTV Genres Comedy Drama Keywords book club ensemble cast mature women working women women gathering working life professional woman all-female Content Score 86 Almost there... Top Contributors w 47 wilsoncleveland  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}