{"link": "https://www.themoviedb.org/tv/4512?language=en", "title": "Grady", "resume": "Grady is an spin-off of the sitcom, Sanford and Son. In this series, Fred Sanford's widower friend Grady moves out of Watts and moves in with his daughter and her family in Westwood. Executive producer Norman Lear served as a consultant to the show.\nRedd Foxx made a special guest appearance as Fred Sanford in the second episode. The series never found a solid audience, and was canceled after just ten episodes. Whitman Mayo returned to Sanford and Son and would go on to star in the revival series The Sanford Arms.", "rate": 0, "genre": ["Comedy"], "cast": ["Joe Morton", "Whitman Mayo", "Haywood Nelson", "Rosanne Katon", "Carole Cole"], "character": ["Hal Marshall", "Grady Wilson", "Haywood Marshall", "Laurie Marshall", "Ellie Wilson Marshall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4512   Expand Grady   (1975) User Score Overview Grady is an spin-off of the sitcom, Sanford and Son. In this series, Fred Sanford's widower friend Grady moves out of Watts and moves in with his daughter and her family in Westwood. Executive producer Norman Lear served as a consultant to the show. Redd Foxx made a special guest appearance as Fred Sanford in the second episode. The series never found a solid audience, and was canceled after just ten episodes. Whitman Mayo returned to Sanford and Son and would go on to star in the revival series The Sanford Arms. Featured Crew Bernie Orenstein Creator Saul Turteltaub Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Morton Hal Marshall Whitman Mayo Grady Wilson Haywood Nelson Haywood Marshall Rosanne Katon Laurie Marshall Carole Cole Ellie Wilson Marshall Full Cast & Crew Last Season Season 1 1975 | 10 Episodes Season 1 of Grady premiered on December  4, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Grady. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords middle class los angeles sitcom black sitcom Content Score 79 Pump it up! We're close now. Top Contributors 15 Banana 1 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}