{"link": "https://www.themoviedb.org/tv/62778?language=en", "title": "Beyond the Clouds", "resume": "Jung Se Ro (Yoon Kye Sang) lost his father and his life was destroyed by a murder case in Thailand which also involved stolen diamonds. After that incident, Se Ro lives his life as a swindler. Park Kang Jae (Jo Jin Woong) is his partner in crime and they are close like brothers. Se Ro then falls in love with Han Young Won (Han Ji Hye) whose her fiance died because of Jung Se Ro.", "rate": 90, "genre": ["Drama", "Romance"], "cast": ["Yoon Kye-sang", "Han Ji-hye", "Kim Yoo-ri", "Jeon Mi-seon", "Cho Jin-woong"], "character": ["Jung Se-ro", "Han Young-won", "Seo Jae-in", "Baek Nan-joo", "Park Kang-jae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62778   Expand Beyond the Clouds   (2014) User Score  Play Trailer Overview Jung Se Ro (Yoon Kye Sang) lost his father and his life was destroyed by a murder case in Thailand which also involved stolen diamonds. After that incident, Se Ro lives his life as a swindler. Park Kang Jae (Jo Jin Woong) is his partner in crime and they are close like brothers. Se Ro then falls in love with Han Young Won (Han Ji Hye) whose her fiance died because of Jung Se Ro. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoon Kye-sang Jung Se-ro Han Ji-hye Han Young-won Kim Yoo-ri Seo Jae-in Jeon Mi-seon Baek Nan-joo Cho Jin-woong Park Kang-jae Full Cast & Crew Last Season Season 1 2014 | 16 Episodes Season 1 of Beyond the Clouds premiered on February 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Beyond the Clouds. You can help by rating TV shows you've seen. Facts Original Name  태양은 가득히 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  65m Homepage   http://www.kbs.co.kr/drama/thesun/ Genres Drama Romance Keywords korea Content Score 79 Pump it up! We're close now. Top Contributors t 37 tmdb38202327 z 5 zurman1 M 3 Maria180493 3 part-mozi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}