{"link": "https://www.themoviedb.org/tv/44485?language=en", "title": "Tokyo Babylon", "resume": "Subaru Sumeragi, a young Onmyouji sorcerer, investigates a series of unusual murders with the aid of his twin sister and fellow Onmyouji Seishirô.", "rate": 53, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kappei Yamaguchi", "Miki Itou", "Takehito Koyasu"], "character": ["Subaru Sumeragi (voice)", "Hokuto Sumeragi (voice)", "Seishirō Sakurazawa (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44485   Expand Tokyo Babylon   (1992) User Score Overview Subaru Sumeragi, a young Onmyouji sorcerer, investigates a series of unusual murders with the aid of his twin sister and fellow Onmyouji Seishirô. Featured Crew Nanase Ohkawa Creator Tsubaki Nekoi Creator Satsuki Igarashi Creator Mokona Apapa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kappei Yamaguchi Subaru Sumeragi (voice) Miki Itou Hokuto Sumeragi (voice) Takehito Koyasu Seishirō Sakurazawa (voice) Full Cast & Crew Last Season Tokyo Babylon 1992 | 2 Episodes Season 1 of Tokyo Babylon premiered on October 21, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Tokyo Babylon. You can help by rating TV shows you've seen. Facts Original Name  東京ＢＡＢＹＬＯＮ Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  50m Homepage  - Genres Animation Drama Sci-Fi & Fantasy Keywords magic sorcery sorcerer anime Content Score 50 Still needs a little work. Top Contributors t 20 tmdb983464 O 8 Ohfudgecanada18 N 5 Nebil-k 4 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}