{"link": "https://www.themoviedb.org/tv/44261?language=en", "title": "The Scarred Man", "resume": "Yuko Kusaka is a Japanese journalist sent to Brazil to do a report on  the gold rush phenomenon that seems to be making many people rich from  night to day. Rumors say that among the many \"garimpeiros\" (gold  diggers) currently on the Amazon forest, there is a Japanese known as  Rio Baraki. Reaching their destination, her crew member is promptly  attacked and she is raped as a warning to stop their work and return  immediately to their home country. Determined to do her job, she stays  and finds out from the attacker that he is none other than Baraki, a  white haired muscular man with a large scar on his back. Later she  discovers that his real name is Keisuke Ibaraki. Once a promising  quarterback, he ended up falsely incriminated by a powerful organization  known as GPX.", "rate": 30, "genre": ["Animation"], "cast": ["Rica Fukami", "Hiromi Tsuru", "Keiichi Nanba", "Gara Takashima", "Takeshi Watabe"], "character": ["Misty", "Natsuko", "Riki", "Jiji", "Nik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44261   Expand The Scarred Man   (1986) User Score Overview Yuko Kusaka is a Japanese journalist sent to Brazil to do a report on  the gold rush phenomenon that seems to be making many people rich from  night to day. Rumors say that among the many \"garimpeiros\" (gold  diggers) currently on the Amazon forest, there is a Japanese known as  Rio Baraki. Reaching their destination, her crew member is promptly  attacked and she is raped as a warning to stop their work and return  immediately to their home country. Determined to do her job, she stays  and finds out from the attacker that he is none other than Baraki, a  white haired muscular man with a large scar on his back. Later she  discovers that his real name is Keisuke Ibaraki. Once a promising  quarterback, he ended up falsely incriminated by a powerful organization  known as GPX. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rica Fukami Misty Hiromi Tsuru Natsuko Keiichi Nanba Riki Gara Takashima Jiji Takeshi Watabe Nik Full Cast & Crew Last Season Season 1 1986 | 5 Episodes Season 1 of The Scarred Man premiered on July  5, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Scarred Man. You can help by rating TV shows you've seen. Facts Original Name  傷追い人 Status  Ended Networks - Certification 18+ Meaning Restricted to People 18 or Older. Type  Video Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 32 BrerFox 2 Jack Duiz 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}