{"link": "https://www.themoviedb.org/tv/32819?language=en", "title": "Cinderella Man", "resume": "Dae-san sells his own clothing designs at a small shop in Dongdaemun Market and all he thinks about is getting rich. One day, he crosses path with Joon-hee and finds that they share an uncanny resemblance to each other. Joon-hee, who is also the heir of a fashion empire, asks Dae-san if he could pose as him for a month. While secretly posing as Joon-hee, Dae-san uses his savvy business skills to outmaneuver Lee Jae-min and also finds true love. But then his cover is blown...", "rate": 68, "genre": ["Drama"], "cast": ["Kwon Sang-Woo", "Im Yoona", "Han Eun-jung", "Song Chang-eui", "Jung Hye-sun"], "character": ["Oh Dae-san / Lee Joon-hee", "Seo You-jin", "Jang Sae-eun", "Lee Jae-min", "Kang Ju-ok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32819   Expand Cinderella Man   (2009) User Score Overview Dae-san sells his own clothing designs at a small shop in Dongdaemun Market and all he thinks about is getting rich. One day, he crosses path with Joon-hee and finds that they share an uncanny resemblance to each other. Joon-hee, who is also the heir of a fashion empire, asks Dae-san if he could pose as him for a month. While secretly posing as Joon-hee, Dae-san uses his savvy business skills to outmaneuver Lee Jae-min and also finds true love. But then his cover is blown... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kwon Sang-Woo Oh Dae-san / Lee Joon-hee Im Yoona Seo You-jin Han Eun-jung Jang Sae-eun Song Chang-eui Lee Jae-min Jung Hye-sun Kang Ju-ok Full Cast & Crew Last Season Season 1 2009 | 16 Episodes Season 1 of Cinderella Man premiered on April 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Cinderella Man. You can help by rating TV shows you've seen. Facts Original Name  신데렐라 맨 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/cinderellaman Genres Drama Keywords romance korea Content Score 86 Almost there... Top Contributors M 25 Maria180493 t 3 tmdb38202327 2 lareina123 1 sansalayne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}