{"link": "https://www.themoviedb.org/tv/80162?language=en", "title": "Word Twisters' Adventures", "resume": "Plagued by a mysterious family curse, Chan Mung-Kat, who comes from a legal family, is forced by his mother to fool around and devotes all his time to running a brothel despite his great talent. As a result of a careless mistake, he is embroiled in a legal dispute, through which he gets to know the eloquent Lap Lan Ching-Ching, though Lap Lan Ching-Ching was the only reasonfor the legal dispute and he knew her before, and the government opponent Fong Tong-Kan. Kat has developed a strong hatred towards Ching and Kan since being innocently accused.", "rate": 70, "genre": [], "cast": ["Charmaine Sheh", "Jordan Chan", "Michael Tse Tin-Wah", "Akina Hong Wa", "Kara Hui"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80162   Expand Word Twisters' Adventures   (2007) User Score Overview Plagued by a mysterious family curse, Chan Mung-Kat, who comes from a legal family, is forced by his mother to fool around and devotes all his time to running a brothel despite his great talent. As a result of a careless mistake, he is embroiled in a legal dispute, through which he gets to know the eloquent Lap Lan Ching-Ching, though Lap Lan Ching-Ching was the only reasonfor the legal dispute and he knew her before, and the government opponent Fong Tong-Kan. Kat has developed a strong hatred towards Ching and Kan since being innocently accused. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charmaine Sheh Jordan Chan Michael Tse Tin-Wah Akina Hong Wa Kara Hui Full Cast & Crew Last Season Season 1 2007 | 0 Episodes Season 1 of Word Twisters' Adventures premiered on November  5, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Word Twisters' Adventures. You can help by rating TV shows you've seen. Facts Original Name  鐵咀銀牙 Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 16 friend-series.com 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}