{"link": "https://www.themoviedb.org/tv/62618?language=en", "title": "Flip or Flop", "resume": "Tarek is a self-proclaimed real estate genius with determination and drive. Christina is Tarek's picture-perfect wife, who Tarek's friends still can't believe he landed. In each episode of Flip or Flop, Tarek and Christina flip a new property. From the nail-biting purchase at auction, to the frustrating renovations and maddening showings, to the giddy acceptance of an offer, we'll follow along as these two relatively novice flippers try their hand at the toughest game in town. From purchase to resale, weaving their personal lives within the story of the flip. From paying cash, sight unseen, for a property at auction, through the hapless remodeling process, to the frantic sale, this young couple is putting everything they have into this venture.", "rate": 68, "genre": ["Reality"], "cast": ["Tarek El Moussa", "Christina El Moussa"], "character": ["Himself - Host", "Herself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62618   Expand Flip or Flop   (2013) User Score Overview Tarek is a self-proclaimed real estate genius with determination and drive. Christina is Tarek's picture-perfect wife, who Tarek's friends still can't believe he landed. In each episode of Flip or Flop, Tarek and Christina flip a new property. From the nail-biting purchase at auction, to the frustrating renovations and maddening showings, to the giddy acceptance of an offer, we'll follow along as these two relatively novice flippers try their hand at the toughest game in town. From purchase to resale, weaving their personal lives within the story of the flip. From paying cash, sight unseen, for a property at auction, through the hapless remodeling process, to the frantic sale, this young couple is putting everything they have into this venture. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tarek El Moussa Himself - Host Christina El Moussa Herself - Host Full Cast & Crew Last Season Season 7 2017 | 15 Episodes Season 7 of Flip or Flop premiered on June 15, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Cancelled Open 0 by PT 100\n      \n     Seems very staged Open 1 by  PT 100 Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2012-02-01 My 600-lb Life 5.8    1951-06-15 I Love Lucy 7.6    1972-09-17 M*A*S*H 7.7  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  30m Homepage   http://www.hgtv.com/shows/flip-or-flop Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors R 9 Rebecca b 8 bowen4514@gmail.com 6 Simon V. v 5 voyager0815  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}