{"link": "https://www.themoviedb.org/tv/5230?language=en", "title": "Good Guys", "resume": "Băieţi buni is a 2005 Romanian 8-episode police drama television miniseries which centers on the efforts of two police inspectors to bring down a far-reaching criminal network.", "rate": 80, "genre": ["Drama"], "cast": ["Anne Marie Paraschivescu", "Ion Grosu", "Bogdan Talasman", "Florin Călinescu", "Cosmina Pasarin"], "character": ["Lawyer Corina Marcu", "Detective Iulian Filipache", "Matrix", "Anton Marcu", "Guvida"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5230   Expand Good Guys   (2005) User Score Overview Băieţi buni is a 2005 Romanian 8-episode police drama television miniseries which centers on the efforts of two police inspectors to bring down a far-reaching criminal network. Featured Crew Andrei Boncea Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne Marie Paraschivescu Lawyer Corina Marcu Ion Grosu Detective Iulian Filipache Bogdan Talasman Matrix Florin Călinescu Anton Marcu Cosmina Pasarin Guvida Full Cast & Crew Last Season Season 2 2006 | 1 Episode Season 2 of Good Guys premiered on January  2, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Good Guys. You can help by rating TV shows you've seen. Facts Original Name  Băieţi buni Status  Ended Network Certification  - Type  Scripted Original Language  Romanian Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 26 vimishor M 3 Mario_Gaborović  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}