{"link": "https://www.themoviedb.org/tv/39606?language=en", "title": "Gwanggaeto, The Great Conqueror", "resume": "Gwanggaeto, The Great Conqueror is an alternate title for King Gwanggaeto the Great, a historical drama based on the life of the nineteenth monarch of Goguryeo, Gwanggaeto the Great. The drama was based on two sources, Gwanggaeto the Great by Jeong Jip, and Great Conquests of Gwanggaeto by Hyeong Minu.", "rate": 70, "genre": ["Drama"], "cast": ["Lee Tae-gon", "Kim Seung-soo", "Im Ho", "Park Jung Chul", "Oh Ji-eun"], "character": ["Damdeok", "Go Un (Gae Yun/Murong Un)", "Murong Bao", "King Asin", "Doyoung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39606   Expand Gwanggaeto, The Great Conqueror   (2011) User Score Overview Gwanggaeto, The Great Conqueror is an alternate title for King Gwanggaeto the Great, a historical drama based on the life of the nineteenth monarch of Goguryeo, Gwanggaeto the Great. The drama was based on two sources, Gwanggaeto the Great by Jeong Jip, and Great Conquests of Gwanggaeto by Hyeong Minu. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Tae-gon Damdeok Kim Seung-soo Go Un (Gae Yun/Murong Un) Im Ho Murong Bao Park Jung Chul King Asin Oh Ji-eun Doyoung Full Cast & Crew Last Season Season 1 2011 | 1 Episode Season 1 of Gwanggaeto, The Great Conqueror premiered on June  4, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Gwanggaeto, The Great Conqueror. You can help by rating TV shows you've seen. Facts Original Name  광개토태왕 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.kbs.co.kr/drama/greatking Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 12 tmdb983464 t 6 tmdb38202327 A 2 Aka75 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}