{"link": "https://www.themoviedb.org/tv/75824?language=en", "title": "Transformers: Micron Legend", "resume": "This is the history of the Transformers.  This is a history of battles where the evil Destron army has waged against the heroic Cybertron warriors.  However, the battle has changed onward due to the rise of a new type of Transfomer, known as the Microns.  Fighting to protect them in hopes of liberating them is Convoy, while Megatron wages battle in the hopes of enslaving them all.  As new warriors join the conflict the battle for the Microns changes into an entirely new scenario.", "rate": 80, "genre": ["Action", "Adventure", "Animation"], "cast": ["Masataka Nakai", "Toru Okawa", "Isshin Chiba", "Kousuke Okano", "Ikuya Sawaki"], "character": ["Rad", "Convoy", "Blurr, Sandstorm", "Hot Rod", "Ratchet"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75824   Expand Transformers: Micron Legend   (2003) User Score Overview This is the history of the Transformers.  This is a history of battles where the evil Destron army has waged against the heroic Cybertron warriors.  However, the battle has changed onward due to the rise of a new type of Transfomer, known as the Microns.  Fighting to protect them in hopes of liberating them is Convoy, while Megatron wages battle in the hopes of enslaving them all.  As new warriors join the conflict the battle for the Microns changes into an entirely new scenario. Featured Crew Eugene Ishikawa Creator Steve Drucker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  2 Featurettes  0 Opening Credits  2 Top Billed Cast Masataka Nakai Rad Toru Okawa Convoy Isshin Chiba Blurr, Sandstorm Kousuke Okano Hot Rod Ikuya Sawaki Ratchet Full Cast & Crew Last Season Season 1 2003 | 52 Episodes Season 1 of Transformers: Micron Legend premiered on January 10, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  4 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Transformers: Micron Legend. You can help by rating TV shows you've seen. Facts Original Name  Chō Robot Seimeitai Transformers Micron Densetsu Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.tv-tokyo.co.jp/anime/transformer/ Genres Action & Adventure Animation Keywords robot Content Score 100 Yes! Looking good! Top Contributors a 135 ajaconis83 TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}