{"link": "https://www.themoviedb.org/tv/58699?language=en", "title": "Wartime Farm", "resume": "Historian Ruth Goodman and archaeologists Alex Langlands and Peter Ginn turn back the clock to run Manor Farm in Hampshire exactly as it would have been during World War II.", "rate": 80, "genre": ["Reality", "Documentary"], "cast": ["Peter Ginn", "Ruth Goodman", "Alex Langlands", "John Simm"], "character": ["Himself", "Herself", "Himself", "Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 58699   Expand Wartime Farm   (2012) User Score Overview Historian Ruth Goodman and archaeologists Alex Langlands and Peter Ginn turn back the clock to run Manor Farm in Hampshire exactly as it would have been during World War II. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Ginn Himself Ruth Goodman Herself Alex Langlands Himself John Simm Narrator Full Cast & Crew Last Season Season 1 2012 | 8 Episodes Season 1 of Wartime Farm premiered on September  6, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Wartime Farm. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Reality Original Language  English Runtime  55m Homepage   http://www.bbc.co.uk/programmes/b01mmt8t Genres Reality Documentary Keywords farm war england wartime history rationing Content Score 86 Almost there... Top Contributors 61 Apollo A 8 Alexlfm R 6 Rebecca 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}