{"link": "https://www.themoviedb.org/tv/34773?language=en", "title": "Real Drive", "resume": "Real Drive is an anime TV series created by Production I.G and Masamune Shirow under the directorship of Kazuhiro Furuhashi, produced in collaboration with broadcaster Nippon Television. The series revolves around an information network known as \"The Metal\", and the series centers on Masamichi Haru, a paraplegic old man who was in a coma for 50 years after a test dive using Meta-Real technology went horribly wrong. After awakening from his coma, he starts searching for the \"answer in the sea\".\nThe series aired on NTV and other channels from April 8, 2008 to October 1, 2008. A manga adaptation by Momotarou Miyano was serialized in Magazine Z from the April 2008 to January 2009, with two volumes sold between August 22, 2008 and February 23, 2009 by Kodansha. A light novel adaptation by Yoshinobu Akita was published by Kodansha on August 5, 2008.", "rate": 0, "genre": ["Animation"], "cast": ["Hiroki Takahashi", "Hiromi Tsuru", "Ai Nonaka", "Ayako Kawasumi", "Katsuji Mori"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34773   Expand Real Drive   (2008) User Score Overview Real Drive is an anime TV series created by Production I.G and Masamune Shirow under the directorship of Kazuhiro Furuhashi, produced in collaboration with broadcaster Nippon Television. The series revolves around an information network known as \"The Metal\", and the series centers on Masamichi Haru, a paraplegic old man who was in a coma for 50 years after a test dive using Meta-Real technology went horribly wrong. After awakening from his coma, he starts searching for the \"answer in the sea\". The series aired on NTV and other channels from April 8, 2008 to October 1, 2008. A manga adaptation by Momotarou Miyano was serialized in Magazine Z from the April 2008 to January 2009, with two volumes sold between August 22, 2008 and February 23, 2009 by Kodansha. A light novel adaptation by Yoshinobu Akita was published by Kodansha on August 5, 2008. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroki Takahashi Hiromi Tsuru Ai Nonaka Ayako Kawasumi Katsuji Mori Full Cast & Crew Last Season Season 1 2008 | 26 Episodes Season 1 of Real Drive premiered on April  8, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Real Drive. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.ntv.co.jp/RD/ Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}