{"link": "https://www.themoviedb.org/tv/62409?language=en", "title": "Hwajung", "resume": "Fair Princess Jungmyung lives a life of the highest privilege, until her half-brother Prince Gwanghae executes the rightful crown prince and usurps the throne. Exiled from court, Jungmyung goes under disguise as a man and learns to adapt to life as a commoner — never forgetting Gwanghae's wrongdoing. But amidst rampant corruption throughout the kingdom, can Jyungmyung exact her vengeance, restore order and take back her rightful place in the palace?", "rate": 63, "genre": ["Drama", "History", "Romance"], "cast": ["Cha Seung-won", "Lee Tae-hwan", "Lee Yeon-hee", "Kim Jae-won", "Seo Kang-joon"], "character": ["Prince Gwanghae", "teenage Gwanghae", "Princess Jungmyung", "Prince Neungyang", "Hong Joo-won"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62409   Expand Hwajung   (2015) User Score Overview Fair Princess Jungmyung lives a life of the highest privilege, until her half-brother Prince Gwanghae executes the rightful crown prince and usurps the throne. Exiled from court, Jungmyung goes under disguise as a man and learns to adapt to life as a commoner — never forgetting Gwanghae's wrongdoing. But amidst rampant corruption throughout the kingdom, can Jyungmyung exact her vengeance, restore order and take back her rightful place in the palace? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cha Seung-won Prince Gwanghae Lee Tae-hwan teenage Gwanghae Lee Yeon-hee Princess Jungmyung Kim Jae-won Prince Neungyang Seo Kang-joon Hong Joo-won Full Cast & Crew Last Season Season 1 2015 | 50 Episodes Season 1 of Hwajung premiered on April 13, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  7 Recommendations We don't have enough data to suggest any TV shows based on Hwajung. You can help by rating TV shows you've seen. Facts Original Name  화정 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/hwajung/ Genres Drama History Romance Keywords korea Content Score 86 Almost there... Top Contributors M 69 Maria180493 z 5 zurman1 t 4 tmdb38202327 a 3 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}