{"link": "https://www.themoviedb.org/tv/21183?language=en", "title": "A Woman Called Moses", "resume": "A Woman Called Moses is a television miniseries based on the life of Harriet Tubman, the escaped African American slave who helped to organize the Underground Railroad, and who led dozens of African Americans from enslavement in the Southern United States to freedom in the Northern states and Canada. Narrated by Orson Welles, the production was broadcast on the NBC television network on December 11 and 12 1978.\nTubman was portrayed by Emmy Award winner and Academy Award nominee Cicely Tyson.", "rate": 80, "genre": ["Drama"], "cast": ["Cicely Tyson", "Will Geer", "Robert Hooks", "Orson Welles", "Jason Bernard"], "character": ["Harriet Tubman", "Thomas Garrett", "William Still", "Narrator", "Daddy Ben Ross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21183   Expand A Woman Called Moses   (1978) User Score Overview A Woman Called Moses is a television miniseries based on the life of Harriet Tubman, the escaped African American slave who helped to organize the Underground Railroad, and who led dozens of African Americans from enslavement in the Southern United States to freedom in the Northern states and Canada. Narrated by Orson Welles, the production was broadcast on the NBC television network on December 11 and 12 1978. Tubman was portrayed by Emmy Award winner and Academy Award nominee Cicely Tyson. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cicely Tyson Harriet Tubman Will Geer Thomas Garrett Robert Hooks William Still Orson Welles Narrator Jason Bernard Daddy Ben Ross Full Cast & Crew Last Season Miniseries 1978 | 2 Episodes Season 1 of A Woman Called Moses premiered on December 11, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Woman Called Moses. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Drama Keywords biography miniseries harriet tubman Content Score 71 Just a little bit more... Top Contributors TB 26 TMDb Bot R 9 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}