{"link": "https://www.themoviedb.org/tv/44228?language=en", "title": "Das grüne Ungeheuer", "resume": "Das grüne Ungeheuer is the title of a novel published in 1959 by East German author Wolfgang Schreyer. It is also the title of a five episodes miniserie adaptation from the book, produced in 1962 by film director Rudi Kurz for Deutscher Fernsehfunk.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Jürgen Frohriep", "Kati Székely", "Erik S. Klein", "Werner Dissel", "Wolfgang Brunecker"], "character": ["Antonio Morena", "Isabel „Chabelita“ Guerra", "Steve Baxter", "Dr. Luis Guerra", "Mr. Brandon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44228   Expand Das grüne Ungeheuer   (1962) User Score Overview Das grüne Ungeheuer is the title of a novel published in 1959 by East German author Wolfgang Schreyer. It is also the title of a five episodes miniserie adaptation from the book, produced in 1962 by film director Rudi Kurz for Deutscher Fernsehfunk. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jürgen Frohriep Antonio Morena Kati Székely Isabel „Chabelita“ Guerra Erik S. Klein Steve Baxter Werner Dissel Dr. Luis Guerra Wolfgang Brunecker Mr. Brandon Full Cast & Crew Last Season Season 1 1962 | 5 Episodes Season 1 of Das grüne Ungeheuer premiered on December 18, 1962. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Das grüne Ungeheuer. You can help by rating TV shows you've seen. Facts Status  Ended Network DFF 1 Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  German Runtime  70m Homepage  - Genres Action & Adventure Keywords miniseries Content Score 86 Almost there... Top Contributors x 61 xPR R 6 Rebecca S 5 Samara TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}