{"link": "https://www.themoviedb.org/tv/37913?language=en", "title": "American Ninja Warrior", "resume": "Follow competitors as they tackle a series of challenging obstacle courses in both city qualifying and city finals rounds across the country. Those that successfully complete the finals course in their designated region move on to the national finals round in Las Vegas, where they face a stunning four-stage course modeled after the famed Mt. Midoriyama course in Japan. The winner will take home a grand prize of $1 million.", "rate": 74, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37913   Expand American Ninja Warrior   (2009) User Score Overview Follow competitors as they tackle a series of challenging obstacle courses in both city qualifying and city finals rounds across the country. Those that successfully complete the finals course in their designated region move on to the national finals round in Las Vegas, where they face a stunning four-stage course modeled after the famed Mt. Midoriyama course in Japan. The winner will take home a grand prize of $1 million. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  14 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 10 2018 | 5 Episodes Season 10 of American Ninja Warrior premiered on May 30, 2018. View All Seasons Social Reviews  0 Discussions  15 Subject Status Replies Last Reply You know who would be great? Open 0 by phishhead\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2012-08-13 Hotel Hell 6.7    2005-05-30 Hell's Kitchen 6.3    2010-07-27 MasterChef 6.7  Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.nbc.com/american-ninja-warrior Genres Documentary Keywords endurance obstacle course strength Content Score 56 We're so close, yet so far. Top Contributors 19 Elizabeth Jennings TB 14 TMDb Bot 12 Banana 10 trvz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}