{"link": "https://www.themoviedb.org/tv/77706?language=en", "title": "Noble Woman", "resume": "A drama about the friendship of two girls from incredibly different background; one the daughter of a maid and the other the daughter of a wealthy family.", "rate": 0, "genre": ["Drama"], "cast": ["Seo Ji-hye", "Park Jung-ah", "Hyun Woo-Sung", "Jung Sung-woon", "Chang Mi-hee"], "character": ["Yoon Shin-Ae", "Lee Mi-Na", "Han Jung-Min", "Park Young-Min", "Hong Sun-Joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77706   Expand Noble Woman   (2014) User Score Overview A drama about the friendship of two girls from incredibly different background; one the daughter of a maid and the other the daughter of a wealthy family. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo Ji-hye Yoon Shin-Ae Park Jung-ah Lee Mi-Na Hyun Woo-Sung Han Jung-Min Jung Sung-woon Park Young-Min Chang Mi-hee Hong Sun-Joo Full Cast & Crew Last Season Season 1 2014 | 114 Episodes Season 1 of Noble Woman premiered on January 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Noble Woman. You can help by rating TV shows you've seen. Facts Original Name  귀부인 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  45m Homepage   http://tv.jtbc.joins.com/noblewoman Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors R 29 RJ_F13 7 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}