{"link": "https://www.themoviedb.org/tv/39019?language=en", "title": "Naor's Friends", "resume": "Naor's Friends is an Israeli television sitcom created by Naor Zion for the Israeli Channel 10. The series premiered on November 14, 2006 and series 3 started airing on April 5, 2011. The Israeli comedian Naor Zion completely wrote and directed the series and also stars in the series as a fictionalized version of himself. The series which is set in Tel Aviv revolves around Naor's eccentric friends and acquaintances, including Weisman, Dedi, Mika and Omri\nThe series focuses on four single friends in their thirties, who live in the center of Tel Aviv - Naor, Weisman, Dedi, Mika, Omri. Dafi is introduced in the third series as the closest female friend to the main male cast after Tamar Keinan quit her role as Mika.\nThe opening theme song of the series, \"לא נרדמת תל אביב\" was written, composed Danny Robas, and is performed in the series by Adi Cohen.", "rate": 80, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39019   Expand Naor's Friends User Score Overview Naor's Friends is an Israeli television sitcom created by Naor Zion for the Israeli Channel 10. The series premiered on November 14, 2006 and series 3 started airing on April 5, 2011. The Israeli comedian Naor Zion completely wrote and directed the series and also stars in the series as a fictionalized version of himself. The series which is set in Tel Aviv revolves around Naor's eccentric friends and acquaintances, including Weisman, Dedi, Mika and Omri The series focuses on four single friends in their thirties, who live in the center of Tel Aviv - Naor, Weisman, Dedi, Mika, Omri. Dafi is introduced in the third series as the closest female friend to the main male cast after Tamar Keinan quit her role as Mika. The opening theme song of the series, \"לא נרדמת תל אביב\" was written, composed Danny Robas, and is performed in the series by Adi Cohen. Featured Crew Naor Zion Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://naor.nana10.co.il/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors a 3 adambakir92 m 3 mlevi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}