{"link": "https://www.themoviedb.org/tv/71907?language=en", "title": "Alice in Borderland", "resume": "Arisu, Karube, and Segawa, a trio of highschool delinquents, are bored with their current lives. During a firework celebration, Arisu wishes that he could live in a different world which would be more exciting for him. As such, his wish was granted, and the three were transported into a seemingly post-apocalyptic-like parallel world. After stepping into what seems to be an empty festival, they are greeted by a woman who tells them that they have already \"entered their game\". After clearing the game, she reveals to them that, in Borderlands, they must play games to survive.", "rate": 50, "genre": ["Action", "Adventure", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Yoshimasa Hosoya", "Takahiro Sakurai", "Tatsuhisa Suzuki", "Tsubasa Yonaga", "Maaya Sakamoto"], "character": ["Ryouhei Arisu (voice)", "Shuntarou Chishiya (voice)", "Daikichi Karube (voice)", "Chouta Segawa (voice)", "Saori Shibuki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71907   Expand Alice in Borderland   (2014) User Score  Play Trailer Overview Arisu, Karube, and Segawa, a trio of highschool delinquents, are bored with their current lives. During a firework celebration, Arisu wishes that he could live in a different world which would be more exciting for him. As such, his wish was granted, and the three were transported into a seemingly post-apocalyptic-like parallel world. After stepping into what seems to be an empty festival, they are greeted by a woman who tells them that they have already \"entered their game\". After clearing the game, she reveals to them that, in Borderlands, they must play games to survive. Featured Crew Haro Aso Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoshimasa Hosoya Ryouhei Arisu (voice) Takahiro Sakurai Shuntarou Chishiya (voice) Tatsuhisa Suzuki Daikichi Karube (voice) Tsubasa Yonaga Chouta Segawa (voice) Maaya Sakamoto Saori Shibuki (voice) Full Cast & Crew Last Season Season 1 2014 | 3 Episodes Season 1 of Alice in Borderland premiered on October 17, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Alice in Borderland. You can help by rating TV shows you've seen. Facts Original Name  今際の国のアリス Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  70m Homepage  - Genres Action & Adventure Mystery Sci-Fi & Fantasy Keywords supernatural animation thriller game psychological Content Score 100 Yes! Looking good! Top Contributors 59 Noom s 2 sinano x 2 xoINARIox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}