{"link": "https://www.themoviedb.org/tv/4583?language=en", "title": "Derrick", "resume": "Derrick was a German TV series produced by Telenova Film und Fernsehproduktion in association with ZDF, ORF and SRG between 1974 and 1998 about Detective Chief Inspector Stephan Derrick and his loyal assistant Inspector Harry Klein, who solve murder cases in Munich and surroundings.", "rate": 65, "genre": ["Drama", "Crime"], "cast": ["Horst Tappert", "Fritz Wepper", "Willy Schäfer"], "character": ["Stephan Derrick", "Harry Klein", "Willi Berger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4583   Expand Derrick   (1974) User Score Overview Derrick was a German TV series produced by Telenova Film und Fernsehproduktion in association with ZDF, ORF and SRG between 1974 and 1998 about Detective Chief Inspector Stephan Derrick and his loyal assistant Inspector Harry Klein, who solve murder cases in Munich and surroundings. Featured Crew Herbert Reinecker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Horst Tappert Stephan Derrick Fritz Wepper Harry Klein Willy Schäfer Willi Berger Full Cast & Crew Last Season Season 25 1998 | 5 Episodes Season 25 of Derrick premiered on January 23, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   1981-09-11 A case for two 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  60m Homepage  - Genres Drama Crime Keywords munich police detective murder investigation Content Score 64 We're so close, yet so far. Top Contributors S 70 Samara 42 Banana J 26 JochenHD J 4 Joe064  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}