{"link": "https://www.themoviedb.org/tv/51803?language=en", "title": "The Gordin Cell", "resume": "The Gordin Cell is a drama/thriller series developed for Israeli television by Ron Leshem and Daniel Syrkin. created by Ron Leshem. The series stars Ran Danker as Eyal Gordin, an Israeli Air Force officer and Mark Ivanir as Yaakov Lundin, a Russian Intelligence Agent.\nThe Gordin Cell is a drama thriller, at the center of which is a married pair of former spies forced to face their past when asked to surrender their son to Russian Intelligence to become a spy himself. Will he choose to betray his parents or his native country?.", "rate": 70, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51803   Expand The Gordin Cell User Score Overview The Gordin Cell is a drama/thriller series developed for Israeli television by Ron Leshem and Daniel Syrkin. created by Ron Leshem. The series stars Ran Danker as Eyal Gordin, an Israeli Air Force officer and Mark Ivanir as Yaakov Lundin, a Russian Intelligence Agent. The Gordin Cell is a drama thriller, at the center of which is a married pair of former spies forced to face their past when asked to surrender their son to Russian Intelligence to become a spy himself. Will he choose to betray his parents or his native country?. Featured Crew Ron Leshem Creator Daniel Syrkin Creator Giyora Yahalom Creator Amit Cohen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://tedy.co.il/en/ta-gordin Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}