{"link": "https://www.themoviedb.org/tv/15430?language=en", "title": "Sunday Best", "resume": "Sunday Best is a reality television Gospel singing competition series which airs on BET.\nEach season the show and its judges set out to find the best undiscovered gospel talent in America. Finalist compete each week until a winner is crowned. Current judges of the competition are Gospel singers Yolanda Adams CeCe Winans and Donnie McClurkin, former host include Mary Mary & Bebe Winans. Gospel singer Kim Burrell serves as the contestants mentor, and the program is hosted by Kirk Franklin.\nThe Sunday Best winner receives a national recording contract, a new automobile, and an undisclosed cash prize benefiting his or her community as well as the title of 'Sunday Best'. Season one runner up Shari Addison also scored a recording contract, as well as season two runner up Jessica Reedy although her contract was not rewarded from the show.\nOn the season 4 finale, host Kirk Franklin announced that the series would be returning for a 5th season next year. The 5th season premiered Sunday, July 8, 2012. Season 5 ended with a 2 hour special on September 2, 2012. The winner of the 5th season is Joshua Rogers from Greeleyville, South Carolina. He made history as the first male contestant to win the Sunday Best title. Kirk Franklin announced at the close of Sunday Best 6 that there will be a season 7. Season 7 will premier on July 2014.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15430   Expand Sunday Best   (2007) User Score Overview Sunday Best is a reality television Gospel singing competition series which airs on BET. Each season the show and its judges set out to find the best undiscovered gospel talent in America. Finalist compete each week until a winner is crowned. Current judges of the competition are Gospel singers Yolanda Adams CeCe Winans and Donnie McClurkin, former host include Mary Mary & Bebe Winans. Gospel singer Kim Burrell serves as the contestants mentor, and the program is hosted by Kirk Franklin. The Sunday Best winner receives a national recording contract, a new automobile, and an undisclosed cash prize benefiting his or her community as well as the title of 'Sunday Best'. Season one runner up Shari Addison also scored a recording contract, as well as season two runner up Jessica Reedy although her contract was not rewarded from the show. On the season 4 finale, host Kirk Franklin announced that the series would be returning for a 5th season next year. The 5th season premiered Sunday, July 8, 2012. Season 5 ended with a 2 hour special on September 2, 2012. The winner of the 5th season is Joshua Rogers from Greeleyville, South Carolina. He made history as the first male contestant to win the Sunday Best title. Kirk Franklin announced at the close of Sunday Best 6 that there will be a season 7. Season 7 will premier on July 2014. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 8 2015 | 8 Episodes Season 8 of Sunday Best premiered on July 19, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sunday Best. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bet.com/OnTV/BETShows/sundaybest/default.htm Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors B 4 BIMop o 3 ogoan j 2 jeding 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}