{"link": "https://www.themoviedb.org/tv/77022?language=en", "title": "The Top Ten Revealed", "resume": "Spotlighting the most influential songs, bands, and musicians in the history of rock n' roll with a rotating panel of music icons and experts for an insightful discussion examining the music that has left an indelible mark on the rock n' roll scene.", "rate": 80, "genre": ["Talk"], "cast": ["Vivian Campbell", "Stryker", "Steven Adler"], "character": ["Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77022   Expand The Top Ten Revealed   (2018) User Score  Play Trailer Overview Spotlighting the most influential songs, bands, and musicians in the history of rock n' roll with a rotating panel of music icons and experts for an insightful discussion examining the music that has left an indelible mark on the rock n' roll scene. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vivian Campbell Himself Stryker Himself Steven Adler Himself Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of The Top Ten Revealed premiered on February 11, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Top Ten Revealed. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  - Homepage   http://www.axs.tv/originals/the-top-ten-revealed/ Genres Talk Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 26 Chiall™ 18 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}