{"link": "https://www.themoviedb.org/tv/6539?language=en", "title": "Between The Sheets", "resume": "Between the Sheets is a 2003 British television mini-series. This carnal, comedic drama is based around the love life and sexual hangups of several different couples that are all linked in some way. Emotional, touching, and sometimes humorous, the story follows these couples as they are forced to face their demons.", "rate": 80, "genre": ["Comedy", "Drama"], "cast": ["Richard Armitage", "Alun Armstrong", "Brenda Blethyn", "Julie Graham", "James Thornton"], "character": ["Paul Andrews", "Peter Delany", "Hazel Delany", "Alona Cunningham", "Simon Delany"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6539   Expand Between The Sheets   (2003) User Score Overview Between the Sheets is a 2003 British television mini-series. This carnal, comedic drama is based around the love life and sexual hangups of several different couples that are all linked in some way. Emotional, touching, and sometimes humorous, the story follows these couples as they are forced to face their demons. Featured Crew Kay Mellor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Armitage Paul Andrews Alun Armstrong Peter Delany Brenda Blethyn Hazel Delany Julie Graham Alona Cunningham James Thornton Simon Delany Full Cast & Crew Last Season Season 1 2003 | 6 Episodes Season 1 of Between The Sheets premiered on November 17, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Between The Sheets. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Comedy Drama Keywords sex sexual humor miniseries woman director british humour sex therapist couples Content Score 79 Pump it up! We're close now. Top Contributors TB 26 TMDb Bot O 11 Ozbourne R 7 Rebecca F 6 Fiona  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}