{"link": "https://www.themoviedb.org/tv/77363?language=en", "title": "Vendetta: Secrets of a Mafia Bride", "resume": "A girl's father is accidentally murdered during a botched mob hit. The don feels guilty and decides to take care of the girl. She grows up and falls in love with one of his goons. What she doesn't know yet is that he shot her dad.", "rate": 80, "genre": [], "cast": ["Eric Roberts", "Carol Alt", "Victor Argo", "Burt Young"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77363   Expand Vendetta: Secrets of a Mafia Bride   (1991) User Score Overview A girl's father is accidentally murdered during a botched mob hit. The don feels guilty and decides to take care of the girl. She grows up and falls in love with one of his goons. What she doesn't know yet is that he shot her dad. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Roberts Carol Alt Victor Argo Burt Young Full Cast & Crew Last Season Miniseries 1991 | 2 Episodes Season 1 of Vendetta: Secrets of a Mafia Bride premiered on May 19, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Vendetta: Secrets of a Mafia Bride. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors TB 20 TMDb Bot 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}