{"link": "https://www.themoviedb.org/tv/7704?language=en", "title": "Legend of the Seeker", "resume": "The adventures of woodsman Richard Cypher, who discovers that he was born to fulfill a prophecy of becoming a guardian hero to oppressed people. With the help of a mysterious woman named Kahlan and a wise old wizard named Zedd, he must stop a ruthless and bloodthirsty tyrant from unleashing an ancient evil and enslaving the world.", "rate": 72, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Craig Horner", "Bridget Regan", "Bruce Spence", "Craig Parker", "Tabrett Bethell"], "character": ["Richard Cypher", "Kahlan Amnell", "Zeddicus Zu'l Zorander", "Darken Rahl", "Cara Mason"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7704   Expand Legend of the Seeker   (2008) User Score Overview The adventures of woodsman Richard Cypher, who discovers that he was born to fulfill a prophecy of becoming a guardian hero to oppressed people. With the help of a mysterious woman named Kahlan and a wise old wizard named Zedd, he must stop a ruthless and bloodthirsty tyrant from unleashing an ancient evil and enslaving the world. Featured Crew Sam Raimi Creator Terry Goodkind Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  33 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig Horner Richard Cypher Bridget Regan Kahlan Amnell Bruce Spence Zeddicus Zu'l Zorander Craig Parker Darken Rahl Tabrett Bethell Cara Mason Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 2 2009 | 22 Episodes Season 2 of Legend of the Seeker premiered on November  6, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  33 Posters  12 Recommendations   2007-01-21 The Dresden Files 6.7    2008-09-20 Merlin 7.0    2009-02-13 Dollhouse 7.2    2013-10-06 Witches of East End 6.6    2013-10-09 The Tomorrow People 6.6    2008-10-03 Sanctuary 6.8    2000-10-03 Dark Angel 7.2    2009-09-24 FlashForward 6.9  Facts Status  Cancelled Network Broadcast Syndication Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.legendoftheseeker.com/ Genres Sci-Fi & Fantasy Action & Adventure Keywords based on novel or book magic sword fight fantasy world wizard Content Score 100 Yes! Looking good! Top Contributors 33 Banana J 19 Jenn 13 Jozef M 10 MAthePA  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}