{"link": "https://www.themoviedb.org/tv/45260?language=en", "title": "Rod 'n' Emu", "resume": "Rod 'n' Emu was an animated series shown on CITV around 1991.\nIt starred the voices of Rod Hull who created and wrote all the episodes starring as himself, Carol Lee Scott starred as Grotbags and Freddy Stevens as her assistants Croc the crocodile and Redford the robot.\nThis was the last series to feature Hull, Emu and Scott before she starred in her own TV series Grotbags. The show was made by FilmFair for Central Independent Television and thirteen episodes were aired.", "rate": 0, "genre": [], "cast": ["Freddy Stevens", "Rod Hull", "Carol Lee Scott"], "character": ["Redford / Croc", "Rod Hull", "Grotbags"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45260   Expand Rod 'n' Emu   (1991) User Score Overview Rod 'n' Emu was an animated series shown on CITV around 1991. It starred the voices of Rod Hull who created and wrote all the episodes starring as himself, Carol Lee Scott starred as Grotbags and Freddy Stevens as her assistants Croc the crocodile and Redford the robot. This was the last series to feature Hull, Emu and Scott before she starred in her own TV series Grotbags. The show was made by FilmFair for Central Independent Television and thirteen episodes were aired. Featured Crew Rod Hull Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Freddy Stevens Redford / Croc Rod Hull Rod Hull Carol Lee Scott Grotbags Full Cast & Crew Last Season Season 1 1991 | 13 Episodes Season 1 of Rod 'n' Emu premiered on January  8, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rod 'n' Emu. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors N 19 Notamymerrick 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}