{"link": "https://www.themoviedb.org/tv/66882?language=en", "title": "Declassified: Untold Stories of American Spies", "resume": "Explore the true stories of America's covert operations told firsthand by the agents who lived it, while getting unprecedented access to the riveting and secret world of espionage. Hosted by former U.S. Congressman, former House Intelligence Committee chair and current CNN national security contributor Mike Rogers.", "rate": 70, "genre": ["Action", "Adventure", "Crime", "Documentary", "Mystery", "War", "Politics"], "cast": ["Daniel Mandehr"], "character": ["Viktor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66882   Expand Declassified: Untold Stories of American Spies   (2016) User Score  Play Trailer Overview Explore the true stories of America's covert operations told firsthand by the agents who lived it, while getting unprecedented access to the riveting and secret world of espionage. Hosted by former U.S. Congressman, former House Intelligence Committee chair and current CNN national security contributor Mike Rogers. Featured Crew Aaron Saidman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Daniel Mandehr Viktor Full Cast & Crew Last Season Season 2 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Declassified: Untold Stories of American Spies. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://edition.cnn.com/shows/declassified Genres Action & Adventure Crime Documentary Mystery War & Politics Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors A 43 Alexandria 5 Elizabeth Jennings TB 2 TMDb Bot 2 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}