{"link": "https://www.themoviedb.org/tv/62168?language=en", "title": "Homicide Hunter: Lt Joe Kenda", "resume": "A non-fiction investigative series of murder cases told through the personal experience of retired detective, Lieutenant Joe Kenda. Through re-enactments, discussions with investigation teams, and interviews with victims' families and other involved persons, the show highlights Kenda's successes with his 400 homicide case history and 92 percent solution rate.", "rate": 87, "genre": ["Documentary", "Reality"], "cast": ["Carl Marino", "Josh Casaubon"], "character": ["Lt. Joe Kenda", "Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62168   Expand Homicide Hunter: Lt Joe Kenda   (2011) User Score Overview A non-fiction investigative series of murder cases told through the personal experience of retired detective, Lieutenant Joe Kenda. Through re-enactments, discussions with investigation teams, and interviews with victims' families and other involved persons, the show highlights Kenda's successes with his 400 homicide case history and 92 percent solution rate. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carl Marino Lt. Joe Kenda Josh Casaubon Himself - Narrator Full Cast & Crew Last Season Season 7 2017 | 20 Episodes Season 7 of Homicide Hunter: Lt Joe Kenda premiered on August 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Homicide Hunter: Lt Joe Kenda. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  43m Homepage   http://www.investigationdiscovery.com/tv-shows/homicide-hunter-joe-kenda/ Genres Documentary Reality Keywords homicide based on a true story docudrama reenactment Content Score 56 We're so close, yet so far. Top Contributors 42 Elizabeth Jennings 30 Nero Kosonen b 10 basher m 6 msgoodliffe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}