{"link": "https://www.themoviedb.org/tv/43500?language=en", "title": "The Waste Land", "resume": "Iki Tadashi is a military leader named who was captured by the Soviets during World War II. Treated as a war criminal, he was sentenced to many years of labor in a harsh Siberian detention camp. After 11 years of imprisonment, he is released. He returns to Japan and begins readjusting to life as a civilian, rejecting an offer from his former colleague to work on a defense project. Tadashi has decided to never involve himself in war again, much to the joy of his family. Instead, he attempts to set off on a new path working at a major trading company. --Tokyograph", "rate": 0, "genre": ["Drama", "Family"], "cast": ["Toshiaki Karasawa", "Emi Wakui", "Koyuki", "Mikako Tabe", "Yoshio Harada"], "character": ["Tadashi Iki", "Yoshiko Iki", "Chisato Akitsu", "Naokko Iki", "Ichizo Daimon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43500   Expand The Waste Land   (2009) User Score Overview Iki Tadashi is a military leader named who was captured by the Soviets during World War II. Treated as a war criminal, he was sentenced to many years of labor in a harsh Siberian detention camp. After 11 years of imprisonment, he is released. He returns to Japan and begins readjusting to life as a civilian, rejecting an offer from his former colleague to work on a defense project. Tadashi has decided to never involve himself in war again, much to the joy of his family. Instead, he attempts to set off on a new path working at a major trading company. --Tokyograph  Featured Crew Toyoko Yamazaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Toshiaki Karasawa Tadashi Iki Emi Wakui Yoshiko Iki Koyuki Chisato Akitsu Mikako Tabe Naokko Iki Yoshio Harada Ichizo Daimon Full Cast & Crew Last Season Season 01 2009 | 19 Episodes Season 1 of The Waste Land premiered on October 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Waste Land. You can help by rating TV shows you've seen. Facts Original Name  不毛地帯 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Drama Family Keywords business man family Content Score 79 Pump it up! We're close now. Top Contributors A 51 Aka75 TB 2 TMDb Bot 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}