{"link": "https://www.themoviedb.org/tv/60654?language=en", "title": "Magi", "resume": "This story is about the flow of fate and the battle to keep the world on the right path. Aladdin is a boy who has set out to explore the world after being trapped in a room for most of his life. His best friend is a flute with a djinn in it named Ugo. Soon enough, Aladdin discovers he is a Magi, a magician who chooses kings, and he was born to choose kings who will follow the righteous path, battling against those who want to destroy fate. Follow his adventures as he meets others from 1001 Arabian Nights, like Ali Baba and Sinbad, and fights to keep the balance of world in check!", "rate": 82, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Kaori Ishihara", "Yuuki Kaji", "Ryohei Kimura", "Haruka Tomatsu", "Toshiyuki Morikawa"], "character": ["Aladdin", "Alibaba Saluja", "Sinbad / Judal (voices)", "Morgiana", "Ugo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60654   Expand Magi   (2012) User Score  Play Trailer Overview This story is about the flow of fate and the battle to keep the world on the right path. Aladdin is a boy who has set out to explore the world after being trapped in a room for most of his life. His best friend is a flute with a djinn in it named Ugo. Soon enough, Aladdin discovers he is a Magi, a magician who chooses kings, and he was born to choose kings who will follow the righteous path, battling against those who want to destroy fate. Follow his adventures as he meets others from 1001 Arabian Nights, like Ali Baba and Sinbad, and fights to keep the balance of world in check! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kaori Ishihara Aladdin Yuuki Kaji Alibaba Saluja Ryohei Kimura Sinbad / Judal (voices) Haruka Tomatsu Morgiana Toshiyuki Morikawa Ugo Full Cast & Crew Last Season Magi: The Kingdom of Magic 2013 | 25 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2014-05-16 Magi: Adventure of Sinbad 6.7    2015-10-03 K-Project 6.3    2013-12-24 Turbo FAST 4.7    2014-09-02 72 Dangerous Animals: Australia 7.0    2012-10-05 Blast of Tempest 7.7    2008-10-30 Wakfu 8.4    2014-10-12 Fate/stay night [Unlimited Blade Works] 6.8    2006-10-03 Ghost Hunt 7.4  Facts Original Name  マギ Status  Ended Networks Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.project-magi.com/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords fantasy magic adventure arabian nights anime Content Score 93 Almost there... Top Contributors A 86 Arrigato t 23 tmdb983464 c 16 coffinbearer 10 Dreydor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}