{"link": "https://www.themoviedb.org/tv/72925?language=en", "title": "Stargate Origins", "resume": "Follow Catherine Langford, the young woman who witnessed her father uncover the Stargate in Giza in 1928, as she embarks on an unexpected adventure to unlock the mystery of what lies beyond the Stargate in order to save Earth from unimaginable darkness.", "rate": 46, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Ellie Gall", "Connor Trinneer"], "character": ["Catherine Langford", "Professor Langford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72925   Expand Stargate Origins   (2018) User Score  Play Trailer Overview Follow Catherine Langford, the young woman who witnessed her father uncover the Stargate in Giza in 1928, as she embarks on an unexpected adventure to unlock the mystery of what lies beyond the Stargate in order to save Earth from unimaginable darkness. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  2 Clips  0 Featurettes  2 Opening Credits  0 Top Billed Cast Ellie Gall Catherine Langford Connor Trinneer Professor Langford Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Stargate Origins premiered on February 15, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Here comes the continuity breaker Open 3 by  Froberg Go to Discussions Media Most Popular Videos  5 Backdrops  2 Posters  5 Recommendations   2017-10-21 Gunpowder 6.8    2018-02-17 Troy: Fall of a City 5.0    2018-04-02 The Crossing 7.8    2017-12-06 Knightfall 6.2    2017-09-25 The Brave 6.6    2017-01-25 Cardinal 6.9    2017-01-18 SIX 7.1    2016-11-06 Frontier 5.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   https://www.stargatecommand.co/series/stargate-origins--3 Genres Action & Adventure Sci-Fi & Fantasy Keywords space travel Content Score 64 We're so close, yet so far. Top Contributors 36 Elizabeth Jennings 19 ggTheV e 14 eloy86 D 12 DarkZeroCD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}