{"link": "https://www.themoviedb.org/tv/4939?language=en", "title": "Ikebukuro West Gate Park", "resume": "Ikebukuro West Gate Park was a wildly popular, highly influential Japanese television drama by screenwriter Kankuro Kudo, based on a novel by Ira Ishida, that initially aired on the Tokyo Broadcasting System during the summer of 2000, and directed by Yukihiko Tsutsumi. The success of the television series would launch a manga adaptation the following year. In a break from traditional Japanese programming, the series used edgy graphics and scene breaks to highlight a story involving themes drawn from the underbelly of modern Japanese society: hip-hop youth gang warfare, juvenile delinquency, prostitution, drug abuse, the Yakuza, rape and murder.\nNotable among the cast are Tokio lead singer Tomoya Nagase, film star Ken Watanabe, and future stars Koyuki, Satoshi Tsumabuki, and Tomohisa Yamashita of Johnny's Jimusho idol group NEWS. The series is also credited for bringing up the profile of actor Yosuke Kubozuka.", "rate": 70, "genre": ["Drama"], "cast": ["Tomoya Nagase", "Ai Kato", "Yosuke Kubozuka", "Ken Watanabe", "Tomohisa Yamashita"], "character": ["Makoto Majima", "Hikaru", "Takashi (King of G-Boys)", "Yokoyama", "Shun"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4939   Expand Ikebukuro West Gate Park   (2000) User Score Overview Ikebukuro West Gate Park was a wildly popular, highly influential Japanese television drama by screenwriter Kankuro Kudo, based on a novel by Ira Ishida, that initially aired on the Tokyo Broadcasting System during the summer of 2000, and directed by Yukihiko Tsutsumi. The success of the television series would launch a manga adaptation the following year. In a break from traditional Japanese programming, the series used edgy graphics and scene breaks to highlight a story involving themes drawn from the underbelly of modern Japanese society: hip-hop youth gang warfare, juvenile delinquency, prostitution, drug abuse, the Yakuza, rape and murder. Notable among the cast are Tokio lead singer Tomoya Nagase, film star Ken Watanabe, and future stars Koyuki, Satoshi Tsumabuki, and Tomohisa Yamashita of Johnny's Jimusho idol group NEWS. The series is also credited for bringing up the profile of actor Yosuke Kubozuka. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tomoya Nagase Makoto Majima Ai Kato Hikaru Yosuke Kubozuka Takashi (King of G-Boys) Ken Watanabe Yokoyama Tomohisa Yamashita Shun Full Cast & Crew Last Season Iwgp season 1 2000 | 11 Episodes Season 1 of Ikebukuro West Gate Park premiered on April  3, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ikebukuro West Gate Park. You can help by rating TV shows you've seen. Facts Original Name  池袋ウエストゲートパーク Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 27 Aka75 1 thirstyhippo K 1 Knossos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}