{"link": "https://www.themoviedb.org/tv/70456?language=en", "title": "Guns Germs & Steel", "resume": "A PBS documentary concerning Jared Diamond's theory on why there is such disparity between those who have advanced technology and those who still live primitively. He argues it is due to the acquisition of guns and steel and the changes brought about by germs.", "rate": 55, "genre": ["Documentary", "War", "Politics"], "cast": ["Jared Diamond"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70456   Expand Guns Germs & Steel   (2005) User Score Overview A PBS documentary concerning Jared Diamond's theory on why there is such disparity between those who have advanced technology and those who still live primitively. He argues it is due to the acquisition of guns and steel and the changes brought about by germs. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jared Diamond Himself Full Cast & Crew Last Season Miniseries 2005 | 3 Episodes Season 1 of Guns Germs & Steel premiered on July 11, 2005. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply n Convert from movie entry to TV entry? Open 0 by nikolajsheller\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Guns Germs & Steel. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  55m Homepage   http://www.pbs.org/gunsgermssteel/ Genres Documentary War & Politics Keywords miniseries Content Score 56 We're so close, yet so far. Top Contributors n 19 nikolajsheller R 9 Rebecca TB 5 TMDb Bot p 5 perikoman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}