{"link": "https://www.themoviedb.org/tv/19812?language=en", "title": "Put Your Money Where Your Mouth Is", "resume": "Put Your Money Where Your Mouth Is is a BBC television series that was first shown on BBC One from 10 March 2008 to 18 June 2010, then shown on BBC Two from 14 February 2011 to 13 May 2012 where it aired its Food spin-off from 5 May 2009 to 5 June 2009 and then shown back on BBC One since 18 February 2013 where it also aired its Chefs spin-off from 8 April 2013 to 26 April 2013.", "rate": 70, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19812   Expand Put Your Money Where Your Mouth Is   (2008) User Score Overview Put Your Money Where Your Mouth Is is a BBC television series that was first shown on BBC One from 10 March 2008 to 18 June 2010, then shown on BBC Two from 14 February 2011 to 13 May 2012 where it aired its Food spin-off from 5 May 2009 to 5 June 2009 and then shown back on BBC One since 18 February 2013 where it also aired its Chefs spin-off from 8 April 2013 to 26 April 2013. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 7 2013 | 30 Episodes Season 7 of Put Your Money Where Your Mouth Is premiered on February 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Put Your Money Where Your Mouth Is. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00dznhb Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors MP 1 Mr. Peanutbutter  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}