{"link": "https://www.themoviedb.org/tv/43927?language=en", "title": "Ai no Kusabi", "resume": "This futuristic tale is set in a world where men are assigned various social classes based on their hair color. Iason Mink, a high-class Blondie, runs into Riki, a black-haired Mongrel, and makes him his \"Pet.\" As Riki learns of the dangers Iason faces by keeping him, he finds himself developing feelings for his master.\nThis is a remake of the 1992 OVA of the same name.", "rate": 65, "genre": ["Drama", "Animation", "Science", "Fiction"], "cast": ["Shin'ichirou Miki", "Kentaro Ito", "Toru Okawa", "Kohsuke Toriumi", "Showtaro Morikubo"], "character": ["Katze (voice)", "Riki (voice)", "Isaon Mink (voice)", "Gai (voice)", "Kirie (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43927   Expand Ai no Kusabi   (2012) User Score Overview This futuristic tale is set in a world where men are assigned various social classes based on their hair color. Iason Mink, a high-class Blondie, runs into Riki, a black-haired Mongrel, and makes him his \"Pet.\" As Riki learns of the dangers Iason faces by keeping him, he finds himself developing feelings for his master. This is a remake of the 1992 OVA of the same name. Featured Crew Rieko Yoshihara Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin'ichirou Miki Katze (voice) Kentaro Ito Riki (voice) Toru Okawa Isaon Mink (voice) Kohsuke Toriumi Gai (voice) Showtaro Morikubo Kirie (voice) Full Cast & Crew Last Season Ai no Kusabi 2012 | 4 Episodes Season 1 of Ai no Kusabi premiered on January 18, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  3 Recommendations   1992-08-31 Ai no Kusabi 6.2    2005-05-30 The Life and Times of Juniper Lee 4.2  Facts Original Name  間の楔 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  26m Homepage  - Genres Drama Animation Science Fiction Keywords exploitation men remake bdsm caste system yaoi Content Score 79 Pump it up! We're close now. Top Contributors t 26 tmdb983464 16 BrerFox L 5 Law t 2 tmdb26811763  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}