{"link": "https://www.themoviedb.org/tv/21559?language=en", "title": "You Have Been Watching", "resume": "You Have Been Watching is a British comedy panel game presented by Charlie Brooker, produced by Zeppotron for Channel 4 and filmed at BBC Television Centre and Riverside Studios in London. It first aired on 7 July 2009, for a weekly eight-episode run. The show's title is a reference to sitcoms written by David Croft such as Dad's Army, 'Allo 'Allo!, Are You Being Served? and It Ain't Half Hot Mum which ended with the caption \"You have been watching\", which was then followed by the cast list.\nA second series of the show began on 15 April 2010 and ended prematurely by a week due to the Cumbria shootings; the final episode having been postponed because it is a crime special. The crime special was eventually broadcast on 4 August 2010, albeit airing on E4 rather than Channel 4.", "rate": 60, "genre": ["Comedy"], "cast": ["Charlie Brooker"], "character": ["Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21559   Expand You Have Been Watching   (2009) User Score Overview You Have Been Watching is a British comedy panel game presented by Charlie Brooker, produced by Zeppotron for Channel 4 and filmed at BBC Television Centre and Riverside Studios in London. It first aired on 7 July 2009, for a weekly eight-episode run. The show's title is a reference to sitcoms written by David Croft such as Dad's Army, 'Allo 'Allo!, Are You Being Served? and It Ain't Half Hot Mum which ended with the caption \"You have been watching\", which was then followed by the cast list. A second series of the show began on 15 April 2010 and ended prematurely by a week due to the Cumbria shootings; the final episode having been postponed because it is a crime special. The crime special was eventually broadcast on 4 August 2010, albeit airing on E4 rather than Channel 4. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Brooker Presenter Full Cast & Crew Last Season Season 2 2010 | 8 Episodes Season 2 of You Have Been Watching premiered on April 15, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for You Have Been Watching. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on You Have Been Watching. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 30m Homepage  - Genres Comedy Keywords game show Content Score 56 We're so close, yet so far. Top Contributors 3 Banana S 3 Samara 1 Markxist 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}