{"link": "https://www.themoviedb.org/tv/3064?language=en", "title": "30 případů majora Zemana", "resume": "Thirty Cases of Major Zeman is a Czechoslovak action-drama television show intended as a political propaganda to support the official attitude of the communist party. The series were filmed in the 1970s.\nEach episode encompasses one year, and investigations are stylized to that year. Most are inspired by real cases. The series follows the life of police investigator Jan Zeman during his career from 1945 to 1975.", "rate": 65, "genre": ["Drama", "Crime"], "cast": ["Vladimír Brabec", "Rudolf Jelínek", "Miloš Willig", "František Němec", "Ladislav Mrkvička"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3064   Expand 30 případů majora Zemana   (1976) User Score Overview Thirty Cases of Major Zeman is a Czechoslovak action-drama television show intended as a political propaganda to support the official attitude of the communist party. The series were filmed in the 1970s. Each episode encompasses one year, and investigations are stylized to that year. Most are inspired by real cases. The series follows the life of police investigator Jan Zeman during his career from 1945 to 1975. Featured Crew Jiří Sequens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vladimír Brabec Rudolf Jelínek Miloš Willig František Němec Ladislav Mrkvička Full Cast & Crew Last Season Season 1 1976 | 10 Episodes Season 1 of 30 případů majora Zemana premiered on January 11, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on 30 případů majora Zemana. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Czech Runtime  90m Homepage  - Genres Drama Crime Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors P 10 Petrvald r 10 robko22 K 5 Karlosd3 T 4 Thelvcz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}