{"link": "https://www.themoviedb.org/tv/1352?language=en", "title": "Chased by Dinosaurs", "resume": "Chased by Dinosaurs is a BBC program featuring Nigel Marven as a time-traveller who encounters dinosaurs in the wild. The two-part series, a sequel to Walking with Dinosaurs, was broadcast over Christmas 2002 and featured Nigel and his \"team of fellow explorers\" encountering prehistoric life over a large range of time, and seeing creatures not featured in the original series. A three part sequel, Sea Monsters, was later broadcast in 2003 and the similar series Prehistoric Park was produced by ITV in 2006. The series title wasn't used on screen, as it is the title for the Region 1 DVD.", "rate": 60, "genre": ["Documentary"], "cast": ["Nigel Marven"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1352   Expand Chased by Dinosaurs   (2002) User Score Overview Chased by Dinosaurs is a BBC program featuring Nigel Marven as a time-traveller who encounters dinosaurs in the wild. The two-part series, a sequel to Walking with Dinosaurs, was broadcast over Christmas 2002 and featured Nigel and his \"team of fellow explorers\" encountering prehistoric life over a large range of time, and seeing creatures not featured in the original series. A three part sequel, Sea Monsters, was later broadcast in 2003 and the similar series Prehistoric Park was produced by ITV in 2006. The series title wasn't used on screen, as it is the title for the Region 1 DVD. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nigel Marven Full Cast & Crew Last Season Season 1 2002 | 5 Episodes Season 1 of Chased by Dinosaurs premiered on December  1, 2002. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Chased by Dinosaurs. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Chased by Dinosaurs. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors D 4 DracoAn 3 jedgarau R 1 Rebecca 1 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}