{"link": "https://www.themoviedb.org/tv/21297?language=en", "title": "Beautiful Life", "resume": "Beautiful Life is a drama of \"Toshiba Nichiyo Gekijo\" on TBS Television. It was first shown in Japan from 16 January to 26 March 2000.\nBeautiful Life is a massive success, and holds the TV rating record of drama in Japan over the 30 years.", "rate": 100, "genre": ["Drama"], "cast": ["Takuya Kimura", "Takako Tokiwa", "Takanori Nishikawa", "Hiroyuki Ikeuchi", "Miki Mizuno"], "character": ["Shuji Okishima", "Kyoko Machida", "Satoru Kawamura", "Takumi Okabe", "Sachie Tamura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21297   Expand Beautiful Life   (2000) User Score Overview Beautiful Life is a drama of \"Toshiba Nichiyo Gekijo\" on TBS Television. It was first shown in Japan from 16 January to 26 March 2000. Beautiful Life is a massive success, and holds the TV rating record of drama in Japan over the 30 years. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takuya Kimura Shuji Okishima Takako Tokiwa Kyoko Machida Takanori Nishikawa Satoru Kawamura Hiroyuki Ikeuchi Takumi Okabe Miki Mizuno Sachie Tamura Full Cast & Crew Last Season (jp) season 1 2000 | 11 Episodes Season 1 of Beautiful Life premiered on January 16, 2000. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Love the Drama and Story Open 0 by kenjisan\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Beautiful Life. You can help by rating TV shows you've seen. Facts Original Name  ビューティフルライフ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 13 Aka75 c 4 ctchim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}