{"link": "https://www.themoviedb.org/tv/71692?language=en", "title": "Story of the Alps: My Annette", "resume": "Alps Story: My Annette (アルプス物語　わたしのアンネット) is a Japanese anime series by Nippon Animation.\nIt is based on the children's book Treasures of the Snow by Patricia St. John and set in the Swiss mountain village of Rossinière.", "rate": 80, "genre": ["Animation", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71692   Expand Story of the Alps: My Annette   (1983) User Score Overview Alps Story: My Annette (アルプス物語　わたしのアンネット) is a Japanese anime series by Nippon Animation. It is based on the children's book Treasures of the Snow by Patricia St. John and set in the Swiss mountain village of Rossinière. Featured Crew Patricia Saint John Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1983 | 48 Episodes Season 1 of Story of the Alps: My Annette premiered on January  9, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on Story of the Alps: My Annette. You can help by rating TV shows you've seen. Facts Original Name  アルプス物語 わたしのアンネット Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Drama Keywords world masterpiece theater Content Score 64 We're so close, yet so far. Top Contributors b 42 baux CN 8 Carmelo Nicolosi c 5 chloris77 TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}