{"link": "https://www.themoviedb.org/tv/2200?language=en", "title": "15/Love", "resume": "15/Love was a Canadian-produced television series that revolves around the lives of aspiring young tennis players at the Cascadia Tennis Academy. The show was created by Karen Troubetzkoy and Derek Schreyer, and was filmed in the city of Montreal during the summer. 15/Love first aired on the television channel YTV on September 6, 2004.", "rate": 0, "genre": ["Drama", "Comedy"], "cast": ["Kyle Switzer", "Laurence Leboeuf", "Meaghan Rath", "Amanda Crew", "Max Walker"], "character": ["Rick Geddes", "Cody Meyers", "Adena Stiles", "Tanis McTaggart", "Squib Furlong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2200   Expand 15/Love   (2004) User Score Overview 15/Love was a Canadian-produced television series that revolves around the lives of aspiring young tennis players at the Cascadia Tennis Academy. The show was created by Karen Troubetzkoy and Derek Schreyer, and was filmed in the city of Montreal during the summer. 15/Love first aired on the television channel YTV on September 6, 2004. Featured Crew Karen Troubetzkoy Creator Derek Schreyer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kyle Switzer Rick Geddes Laurence Leboeuf Cody Meyers Meaghan Rath Adena Stiles Amanda Crew Tanis McTaggart Max Walker Squib Furlong Full Cast & Crew Last Season Season 3 2006 | 14 Episodes Season 3 of 15/Love premiered on July 10, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 15/Love. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Comedy Keywords sport tennis training teenager Content Score 79 Pump it up! We're close now. Top Contributors 22 Banana z 8 zurman1 TB 2 TMDb Bot N 2 NoemiTalavera  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}