{"link": "https://www.themoviedb.org/tv/8269?language=en", "title": "Destroyed In Seconds", "resume": "Destroyed in Seconds is a half-hour American television series that airs on Discovery Channel. Hosted by Ron Pitts, it features video segments of various things being destroyed fairly quickly such as planes crashing, explosions, sinkholes, boats crashing, fires, race car incidents, floods, etc. The nature of the show closely resembles Real TV. The show uses real video of real events, and commentary explaining the destruction portrayed. Most videos have stock sound effects added. Some of the events seen resulted in fatalities, and all of the events have property damage. It is currently on hiatus.", "rate": 75, "genre": ["Documentary"], "cast": ["Ron Pitts"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8269   Expand Destroyed In Seconds   (2008) User Score Overview Destroyed in Seconds is a half-hour American television series that airs on Discovery Channel. Hosted by Ron Pitts, it features video segments of various things being destroyed fairly quickly such as planes crashing, explosions, sinkholes, boats crashing, fires, race car incidents, floods, etc. The nature of the show closely resembles Real TV. The show uses real video of real events, and commentary explaining the destruction portrayed. Most videos have stock sound effects added. Some of the events seen resulted in fatalities, and all of the events have property damage. It is currently on hiatus. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ron Pitts Host Full Cast & Crew Last Season First season 2008 | 33 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Destroyed In Seconds. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m, 30m Homepage   http://dsc.discovery.com/tv/destroyed-in-seconds/destroyed-in-seconds.html Genres Documentary Keywords destruction Content Score 56 We're so close, yet so far. Top Contributors 8 z3ntu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}