{"link": "https://www.themoviedb.org/tv/56?language=en", "title": "Newlyweds: Nick and Jessica", "resume": "Newlyweds: Nick and Jessica is a reality television show that was produced and aired by MTV and MuchMusic. It followed the marriage of then husband and wife Nick Lachey and Jessica Simpson. The show first aired in August 2003 and ran three seasons, with 41 episodes in total. The last season started on January 26, 2005, and the last episode aired on March 30, 2005.\nSimpson and Lachey were married on October 26, 2002 and filed for divorce on December 16, 2005. On June 30, 2006 Jessica and Nick's divorce was finalized.\nPart of the show's gimmick involved displaying Simpson's naive personality, playing on the popular stereotype of \"dumb blondes\". Perhaps the most famous example comes from the first episode, in which Simpson, confronted with a can of Chicken of the Sea tuna, asked Nick \"Is this chicken, what I have, or is this fish? I know it's tuna, but it says [sic] 'Chicken... by the Sea'.\"", "rate": 62, "genre": ["Reality"], "cast": ["Jessica Simpson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 56   Expand Newlyweds: Nick and Jessica   (2003) User Score Overview Newlyweds: Nick and Jessica is a reality television show that was produced and aired by MTV and MuchMusic. It followed the marriage of then husband and wife Nick Lachey and Jessica Simpson. The show first aired in August 2003 and ran three seasons, with 41 episodes in total. The last season started on January 26, 2005, and the last episode aired on March 30, 2005. Simpson and Lachey were married on October 26, 2002 and filed for divorce on December 16, 2005. On June 30, 2006 Jessica and Nick's divorce was finalized. Part of the show's gimmick involved displaying Simpson's naive personality, playing on the popular stereotype of \"dumb blondes\". Perhaps the most famous example comes from the first episode, in which Simpson, confronted with a can of Chicken of the Sea tuna, asked Nick \"Is this chicken, what I have, or is this fish? I know it's tuna, but it says [sic] 'Chicken... by the Sea'.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Simpson Full Cast & Crew Last Season Season 3 2005 | 10 Episodes Season 3 of Newlyweds: Nick and Jessica premiered on January 26, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Newlyweds: Nick and Jessica. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  30m, 23m Homepage  - Genres Reality Keywords blonde celebrity singer newlywed celebrity couple Content Score 56 We're so close, yet so far. Top Contributors 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}