{"link": "https://www.themoviedb.org/tv/76301?language=en", "title": "A Vicar's Life", "resume": "A Vicar's Life goes behind the scenes of the lives of country vicars at the heart of the rural community in the stunning Herefordshire countryside. From opening fêtes to marrying local couples, vicars are knitted into the fabric of country life, acting as a pillar of support in times of crisis and personal sorrow.\nEach episode features stories from across the county giving a closer perspective on rural life, as seen through the eyes of the church. Village fetes, shooting drives, and local issues - all served up with a heavy dose of humour, charity, and inspiring local leadership.", "rate": 60, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76301   Expand A Vicar's Life   (2018) User Score Overview A Vicar's Life goes behind the scenes of the lives of country vicars at the heart of the rural community in the stunning Herefordshire countryside. From opening fêtes to marrying local couples, vicars are knitted into the fabric of country life, acting as a pillar of support in times of crisis and personal sorrow. Each episode features stories from across the county giving a closer perspective on rural life, as seen through the eyes of the church. Village fetes, shooting drives, and local issues - all served up with a heavy dose of humour, charity, and inspiring local leadership. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of A Vicar's Life premiered on January 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A Vicar's Life. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b09m8kbf Genres Documentary Keywords vicar Content Score 56 We're so close, yet so far. Top Contributors l 14 lala07 R 10 Rebecca r 2 ricostream  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}