{"link": "https://www.themoviedb.org/tv/5592?language=en", "title": "Are You Smarter Than a 5th Grader?", "resume": "Are You Smarter Than a 5th Grader? is a television game show format based on posing grade-school level questions to adults, hosted by Jeff Foxworthy. This television show began broadcast on the Fox Broadcasting Company network as a special in the United States and Canada on February 27, 2007, and it grew to be popular enough that a half-hour-long syndicated TV series was developed by the owners.\nSince then, Are You Smarter Than a 5th Grader? has been replicated in several other countries, some versions under the same title, and some under modified ones. The first season of this TV program ranked 28th in the Nielsen ratings in the U.S., with an average of 12.7 million viewers per episode. The status of the Fox-TV series following the summer of 2008 is unknown, but the syndicated TV show debuted in late-September 2009. Episodes from this series are also broadcast on MyNetworkTV one evening per week, and on the Country Music Television channel it is broadcast on five evenings per week.\nGSN began airing the show November 6, 2011 in five-hour blocks starting at 7:00 p.m. Eastern/6:00 p.m. They currently air Are You Smarter than a 5th Grader? Sunday nights.\nIn 2013, the show appeared in TV Guide's list of the 60 greatest game shows ever.", "rate": 80, "genre": ["Family", "Kids"], "cast": ["Jeff Foxworthy"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5592   Expand Are You Smarter Than a 5th Grader? User Score Overview Are You Smarter Than a 5th Grader? is a television game show format based on posing grade-school level questions to adults, hosted by Jeff Foxworthy. This television show began broadcast on the Fox Broadcasting Company network as a special in the United States and Canada on February 27, 2007, and it grew to be popular enough that a half-hour-long syndicated TV series was developed by the owners. Since then, Are You Smarter Than a 5th Grader? has been replicated in several other countries, some versions under the same title, and some under modified ones. The first season of this TV program ranked 28th in the Nielsen ratings in the U.S., with an average of 12.7 million viewers per episode. The status of the Fox-TV series following the summer of 2008 is unknown, but the syndicated TV show debuted in late-September 2009. Episodes from this series are also broadcast on MyNetworkTV one evening per week, and on the Country Music Television channel it is broadcast on five evenings per week. GSN began airing the show November 6, 2011 in five-hour blocks starting at 7:00 p.m. Eastern/6:00 p.m. They currently air Are You Smarter than a 5th Grader? Sunday nights. In 2013, the show appeared in TV Guide's list of the 60 greatest game shows ever. Featured Crew Mark Burnett Creator John Stevens Creator Barry Poznick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeff Foxworthy Himself Full Cast & Crew  Create Episode Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Are You Smarter Than a 5th Grader?. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  2 Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  44m Homepage   http://www.5thgradertvshow.com/ Genres Family Kids Keywords education family kids Content Score 43 There's no 'I' in team... Top Contributors Q 25 QuantumHoneybees LC 1 Legit Corporation  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}