{"link": "https://www.themoviedb.org/tv/71360?language=en", "title": "Yu-Gi-Oh! VRAINS", "resume": "Den City is a city with advanced network systems in which a VR space called LINK VRAINS was created by SOL Technologies. The Knights of Hanoi, a group that hacks through dueling, as well as SOL Technologies are seeking a mysterious AI program. Yusaku Fujiki, also known as Playmaker, is a first year high school student who manages to capture this AI program while trying to find out the truth about an incident in the past.", "rate": 75, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71360   Expand Yu-Gi-Oh! VRAINS   (2017) User Score Overview Den City is a city with advanced network systems in which a VR space called LINK VRAINS was created by SOL Technologies. The Knights of Hanoi, a group that hacks through dueling, as well as SOL Technologies are seeking a mysterious AI program. Yusaku Fujiki, also known as Playmaker, is a first year high school student who manages to capture this AI program while trying to find out the truth about an incident in the past. Featured Crew Cameron Sharp Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 57 Episodes Season 1 of Yu-Gi-Oh! VRAINS premiered on May 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Yu-Gi-Oh! VRAINS. You can help by rating TV shows you've seen. Facts Original Name  遊☆戯☆王VRAINS Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tv-tokyo.co.jp/anime/yugioh-vrains/ Genres Sci-Fi & Fantasy Animation Action & Adventure Keywords card game hacker virtual reality Content Score 64 We're so close, yet so far. Top Contributors 24 Ly 22 YabukiJoe1 10 sekaidown04 6 Iuri3D  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}