{"link": "https://www.themoviedb.org/tv/72603?language=en", "title": "The Flame's Daughter", "resume": "The story of Ruge and Zhang Feng whose lives are interchanged after they are switched at birth. They meet and fall in love but their relationship takes a tragic turn due to the machinations of a man hell-bent on revenge.", "rate": 55, "genre": ["Drama"], "cast": ["Dilraba Dilmurat", "Vic Chou", "Vin Zhang", "Liu Rui Lin", "Lai Yi"], "character": ["Lie Ru Ge", "Yin Xue", "Zhan Feng", "Yu Zi Han", "An Ye Luo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72603   Expand The Flame's Daughter   (2018) User Score  Play Trailer Overview The story of Ruge and Zhang Feng whose lives are interchanged after they are switched at birth. They meet and fall in love but their relationship takes a tragic turn due to the machinations of a man hell-bent on revenge. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dilraba Dilmurat Lie Ru Ge Vic Chou Yin Xue Vin Zhang Zhan Feng Liu Rui Lin Yu Zi Han Lai Yi An Ye Luo Full Cast & Crew Current Season Season 1 2018 | 52 Episodes Season 1 of The Flame's Daughter premiered on March  1, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  7 Recommendations   2017-08-14 The King's Woman 4.3  Facts Original Name  烈火如歌 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage   http://www.weibo.com/u/6081477649 Genres Drama Keywords china romance historical fiction Content Score 93 Almost there... Top Contributors M 58 Maria180493 t 4 tmdb26811763 S 3 Solitudesfly 2 Morgan Wong  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}