{"link": "https://www.themoviedb.org/tv/50038?language=en", "title": "My Husband's Lover", "resume": "My Husband's Lover is a Filipino drama television series created and developed by Suzette Doctolero and produced by GMA Network. It premiered on June 10, 2013 replacing Love & Lies on the network's coveted Primetime block, and June 11, 2013 worldwide via GMA Pinoy TV. The series stars Carla Abellana, Tom Rodriguez and Dennis Trillo as the main characters. Carolyn Galve serves as the executive producer of show and Dominic Zapata directed the series.\nIt is credited as the very first gay-themed series in Philippine television due to the series' central subject of homosexual relationships and infidelity. The show has multiple continuing story lines that tackle sensitive yet relevant social issues like homosexual and bisexual relationships, homophobia and the society's discrimination against homosexuals, infidelity, pre-marital sex and the consequences of early or unplanned marriages. It also tackles the importance of family, friendship, integrity and love. The forty-five minute scripted drama chronicles the life of a woman, who belatedly discovers that her husband has been carrying on an affair, but not with another woman.", "rate": 95, "genre": [], "cast": ["Tom Rodriguez", "Carla Abellana", "Dennis Trillo", "Kuh Ledesma", "Roi Vinzon"], "character": ["Vincent Soriano", "Lally Agatep-Soriano", "Eric Del Mundo", "Elaine Soriano", "Armando Soriano"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50038   Expand My Husband's Lover   (2013) User Score Overview My Husband's Lover is a Filipino drama television series created and developed by Suzette Doctolero and produced by GMA Network. It premiered on June 10, 2013 replacing Love & Lies on the network's coveted Primetime block, and June 11, 2013 worldwide via GMA Pinoy TV. The series stars Carla Abellana, Tom Rodriguez and Dennis Trillo as the main characters. Carolyn Galve serves as the executive producer of show and Dominic Zapata directed the series. It is credited as the very first gay-themed series in Philippine television due to the series' central subject of homosexual relationships and infidelity. The show has multiple continuing story lines that tackle sensitive yet relevant social issues like homosexual and bisexual relationships, homophobia and the society's discrimination against homosexuals, infidelity, pre-marital sex and the consequences of early or unplanned marriages. It also tackles the importance of family, friendship, integrity and love. The forty-five minute scripted drama chronicles the life of a woman, who belatedly discovers that her husband has been carrying on an affair, but not with another woman. Featured Crew Dominic Zapata\t Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tom Rodriguez Vincent Soriano Carla Abellana Lally Agatep-Soriano Dennis Trillo Eric Del Mundo Kuh Ledesma Elaine Soriano Roi Vinzon Armando Soriano Full Cast & Crew Last Season Season 1 2013 | 1 Episode Season 1 of My Husband's Lover premiered on June 10, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on My Husband's Lover. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Tagalog Runtime  25m Homepage   http://www.gmanetwork.com/entertainment/tv/myhusbandslover/home/ Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 36 elebe11y  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}