{"link": "https://www.themoviedb.org/tv/6424?language=en", "title": "Just a Minute", "resume": "Just a Minute is a BBC Radio 4 radio comedy and television panel game chaired by Nicholas Parsons. Its first transmission on Radio 4 was on 22 December 1967, three months after the station's launch. The Radio 4 programme won a Gold Sony Radio Academy Award in 2003.\nThe object of the game is for panellists to talk for sixty seconds on a given subject, \"without repetition, hesitation or deviation\". The comedy comes from attempts to keep within these rules and the banter among the participants. In 2011 comedy writer David Quantick ascribed Just a Minute's success to its \"insanely basic\" format, stating, \"It's so blank that it can be filled by people as diverse as Paul Merton and Graham Norton, who don't have to adapt their style of humour to the show at all.\"", "rate": 95, "genre": [], "cast": ["Nicholas Parsons"], "character": ["Himself (host)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6424   Expand Just a Minute   (2012) User Score Overview Just a Minute is a BBC Radio 4 radio comedy and television panel game chaired by Nicholas Parsons. Its first transmission on Radio 4 was on 22 December 1967, three months after the station's launch. The Radio 4 programme won a Gold Sony Radio Academy Award in 2003. The object of the game is for panellists to talk for sixty seconds on a given subject, \"without repetition, hesitation or deviation\". The comedy comes from attempts to keep within these rules and the banter among the participants. In 2011 comedy writer David Quantick ascribed Just a Minute's success to its \"insanely basic\" format, stating, \"It's so blank that it can be filled by people as diverse as Paul Merton and Graham Norton, who don't have to adapt their style of humour to the show at all.\" Featured Crew Ian Messiter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Parsons Himself (host) Full Cast & Crew Last Season 2012 series 2012 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Just a Minute. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006s5dp Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 14 DBD AB 9 Alex Blackmore  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}