{"link": "https://www.themoviedb.org/tv/947?language=en", "title": "Cheyenne", "resume": "Cheyenne is an American western television series of 108 black-and-white episodes broadcast on ABC from 1955 to 1963. The show was the first hour-long western, and in fact the first hour-long dramatic series of any kind, with continuing characters, to last more than one season. It was also the first series to be made by a major Hollywood film studio which did not derive from its established film properties, and the first of a long chain of Warner Brothers original series produced by William T. Orr.", "rate": 71, "genre": ["Action", "Adventure", "Western"], "cast": ["Clint Walker"], "character": ["Cheyenne Bodie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 947   Expand Cheyenne   (1955) User Score Overview Cheyenne is an American western television series of 108 black-and-white episodes broadcast on ABC from 1955 to 1963. The show was the first hour-long western, and in fact the first hour-long dramatic series of any kind, with continuing characters, to last more than one season. It was also the first series to be made by a major Hollywood film studio which did not derive from its established film properties, and the first of a long chain of Warner Brothers original series produced by William T. Orr. Featured Crew Roy Huggins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Clint Walker Cheyenne Bodie Full Cast & Crew Last Season Season 7 1962 | 13 Episodes Season 7 of Cheyenne premiered on September 24, 1962. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Cheyenne: Happy Birthday Clint Walker! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   1963-09-24 Petticoat Junction 5.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 48m Homepage  - Genres Action & Adventure Western Keywords frontier western u.s. frontier justice native american tribe Content Score 71 Just a little bit more... Top Contributors R 21 Rebecca G 11 GJones4796 6 Banana 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}