{"link": "https://www.themoviedb.org/tv/53573?language=en", "title": "Shit faced", "resume": "A twisted comedy show that portrays the drinking and partying habits of the average swede in absurd, over-the-top and, most importantly, hilarious ways. A comedy drama that will make you laugh and cringe at the same time. Anything can and will happen and if it's possible to twist a joke one extra turn, it's twisted twice. \"Karatefylla\" is R-rated comedy dancing on the grave of good taste.", "rate": 83, "genre": ["Comedy"], "cast": ["Jim Cargill", "Dejmis Rustom", "Terran Andersson", "Veronica Kurba", "Thess Persson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53573   Expand Shit faced   (2011) User Score Overview A twisted comedy show that portrays the drinking and partying habits of the average swede in absurd, over-the-top and, most importantly, hilarious ways. A comedy drama that will make you laugh and cringe at the same time. Anything can and will happen and if it's possible to twist a joke one extra turn, it's twisted twice. \"Karatefylla\" is R-rated comedy dancing on the grave of good taste. Featured Crew Robin Muhr Creator Tapio Leopold Creator Fredrik Hallgren Creator Daniel Ottosson Creator Alexander Kantsjö Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Cargill Dejmis Rustom Terran Andersson Veronica Kurba Thess Persson Full Cast & Crew Last Season Season 2 2012 | 10 Episodes Season 2 of Shit faced premiered on February 20, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Shit faced. You can help by rating TV shows you've seen. Facts Original Name  Karatefylla Status  Ended Network Certification  - Type  Scripted Original Language  Swedish Runtime  23m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors j 30 jnylen t 9 thek h 9 hffd 2 PauliJC  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}