{"link": "https://www.themoviedb.org/tv/37694?language=en", "title": "Big Fat Gypsy Weddings", "resume": "Big Fat Gypsy Weddings is a British documentary series broadcast on Channel 4, that explores the lives and traditions of several Irish Traveller families as they prepare to unite one of their number in marriage. The series also featured Romanichal in several episodes, and has been criticised for not accurately representing England’s Romani and Travelling community. It was first broadcast in February 2010 as a one-off documentary called My Big Fat Gypsy Wedding, filmed as part of the Cutting Edge series and voted Most Groundbreaking Show in the Cultural Diversity Awards 2010. A series of 5 episodes were later commissioned, and the series first aired in January 2011. A second series began airing in February 2012. A third series will not be made, rather the show will end with six stand-alone specials.\nIn North America, the show airs on TLC under the title My Big Fat Gypsy Wedding, with the original narration by Barbara Flynn replaced by Ellen K., while the TLC network started airing a spinoff featuring American Roma called My Big Fat American Gypsy Wedding.", "rate": 42, "genre": ["Documentary"], "cast": ["Barbara Flynn"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37694   Expand Big Fat Gypsy Weddings   (2010) User Score Overview Big Fat Gypsy Weddings is a British documentary series broadcast on Channel 4, that explores the lives and traditions of several Irish Traveller families as they prepare to unite one of their number in marriage. The series also featured Romanichal in several episodes, and has been criticised for not accurately representing England’s Romani and Travelling community. It was first broadcast in February 2010 as a one-off documentary called My Big Fat Gypsy Wedding, filmed as part of the Cutting Edge series and voted Most Groundbreaking Show in the Cultural Diversity Awards 2010. A series of 5 episodes were later commissioned, and the series first aired in January 2011. A second series began airing in February 2012. A third series will not be made, rather the show will end with six stand-alone specials. In North America, the show airs on TLC under the title My Big Fat Gypsy Wedding, with the original narration by Barbara Flynn replaced by Ellen K., while the TLC network started airing a spinoff featuring American Roma called My Big Fat American Gypsy Wedding. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barbara Flynn Full Cast & Crew Last Season Season 1 2011 | 6 Episodes Season 1 of Big Fat Gypsy Weddings premiered on January 18, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Big Fat Gypsy Weddings. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 49m Homepage   http://www.channel4.com/programmes/big-fat-gypsy-weddings Genres Documentary Keywords documentary Content Score 56 We're so close, yet so far. Top Contributors 3 Banana 2 Damien Haynes 1 Michael 1 gianpoker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}