{"link": "https://www.themoviedb.org/tv/73078?language=en", "title": "Martial Universe", "resume": "Lin Dong, a child from a small village isn't favored by his clan. By chance, Lin Dong obtains a mysterious artifact that is coveted by many clans in the martial world. Because of this artifact, Lin Dong is approached by many people of different clans and is forcibly involved in various events of the martial universe", "rate": 0, "genre": ["Drama", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Yang Yang", "Crystal Zhang", "Wang Likun", "Wu Chun", "Ashton Chen"], "character": ["Lin Dong", "Ying Huan Huan", "Ling Qing Zhu", "Lin Lang Tian", "Lin Yan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73078   Expand Martial Universe   (2018) User Score Overview Lin Dong, a child from a small village isn't favored by his clan. By chance, Lin Dong obtains a mysterious artifact that is coveted by many clans in the martial world. Because of this artifact, Lin Dong is approached by many people of different clans and is forcibly involved in various events of the martial universe Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yang Yang Lin Dong Crystal Zhang Ying Huan Huan Wang Likun Ling Qing Zhu Wu Chun Lin Lang Tian Ashton Chen Lin Yan Full Cast & Crew Next Season Original Air Date Original Air Date Get (Original Air Date) Season 1 2018 | 1 Episode Season 1 of Martial Universe is set to premiere on December 31, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Original Name  武动乾坤 Status  In Production Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 91 Mohammed Osama Mohamed M 16 Maria180493 6 Travis Bell 6 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}