{"link": "https://www.themoviedb.org/tv/78025?language=en", "title": "VH1 Beauty Bar", "resume": "Welcome to Inwood, the crown jewel at the top of Manhattan. The neighborhood's hottest salon, House Of Dolls, is where you can get your hair, makeup, and nails done by some of the biggest, loudest, and most diverse voices the city has to offer. The House Of Dolls staff as they take their day jobs seriously but aren't afraid to have some fun when the sun goes down.", "rate": 50, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78025   Expand VH1 Beauty Bar   (2018) User Score  Play Trailer Overview Welcome to Inwood, the crown jewel at the top of Manhattan. The neighborhood's hottest salon, House Of Dolls, is where you can get your hair, makeup, and nails done by some of the biggest, loudest, and most diverse voices the city has to offer. The House Of Dolls staff as they take their day jobs seriously but aren't afraid to have some fun when the sun goes down. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of VH1 Beauty Bar premiered on February 28, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on VH1 Beauty Bar. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  - Homepage   http://www.vh1.com/shows/vh1-beauty-bar/ Genres Reality Keywords beauty salon new york city Content Score 64 We're so close, yet so far. Top Contributors 29 Banana r 5 ricostream w 3 why9843  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}