{"link": "https://www.themoviedb.org/tv/7207?language=en", "title": "So You Think You Can Dance Canada", "resume": "So You Think You Can Dance Canada was a dance competition and reality show that aired on CTV.\nBased on the original American TV show So You Think You Can Dance, the Canadian series showcased the best in Canadian dancing talent. Each season, the show held auditions in major cities across the country, looking for the top dancers in Canada. Competitors of all genres and styles tried to impress the judges in the hopes of making the Top 20, which gave them the opportunity to perform on national television.\nDuring each week's performance show, couples competed for the votes of the viewing public; the three couples receiving the fewest number of votes are forced to \"dance for their lives\" during the results show in an attempt to prove to the judges that they deserve to stay. Following this, the judges eliminated one man and one woman from the competition — for the first five weeks, the judges themselves chose who stays and who goes, but starting in Top 10 week, the voters alone decided which dancers continued on in the competition. Ultimately, one dancer prevailed. During the season finale, this person is crowned \"Canada's Favourite Dancer\", and receives a prize of CDN $100,000 and a new car. In Seasons 2 and 3, the runner-up also received a new car.", "rate": 100, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7207   Expand So You Think You Can Dance Canada   (2008) User Score Overview So You Think You Can Dance Canada was a dance competition and reality show that aired on CTV. Based on the original American TV show So You Think You Can Dance, the Canadian series showcased the best in Canadian dancing talent. Each season, the show held auditions in major cities across the country, looking for the top dancers in Canada. Competitors of all genres and styles tried to impress the judges in the hopes of making the Top 20, which gave them the opportunity to perform on national television. During each week's performance show, couples competed for the votes of the viewing public; the three couples receiving the fewest number of votes are forced to \"dance for their lives\" during the results show in an attempt to prove to the judges that they deserve to stay. Following this, the judges eliminated one man and one woman from the competition — for the first five weeks, the judges themselves chose who stays and who goes, but starting in Top 10 week, the voters alone decided which dancers continued on in the competition. Ultimately, one dancer prevailed. During the season finale, this person is crowned \"Canada's Favourite Dancer\", and receives a prize of CDN $100,000 and a new car. In Seasons 2 and 3, the runner-up also received a new car. Featured Crew Nigel Lythgoe Creator Simon Fuller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 4 2011 | 23 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on So You Think You Can Dance Canada. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m, 120m Homepage   http://dance.ctv.ca/ Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}