{"link": "https://www.themoviedb.org/tv/37538?language=en", "title": "Wellber no Monogatari: Sisters of Wellber", "resume": "Sisters of Wellber is a fantasy anime series animated by Trans Arts. Directed by Takayuki Hamana, the director behind the renowned Prince of Tennis TV series and animated movies, Sisters of Wellber began airing in Japan on Tokyo MX, Mētele, ABC, and AT-X in April 2007.\nA related manga, MUZZLE-LOADER 〜Wellber Stories〜, has begun serialization on February 28, 2007 in Monthly Comic Blade, one of Mag Garden's magazines.\nA second season started on January 1, 2008, picking up just where the first season left off.", "rate": 0, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Mikako Takahashi", "Eri Sendai", "Junko Takeuchi", "Yuki Kaida", "Namikawa Daisuke"], "character": ["Rita Sior", "Sherry", "Tina Lothar", "Jamille Kyra", "Galahad Eiger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37538   Expand Wellber no Monogatari: Sisters of Wellber   (2007) User Score Overview Sisters of Wellber is a fantasy anime series animated by Trans Arts. Directed by Takayuki Hamana, the director behind the renowned Prince of Tennis TV series and animated movies, Sisters of Wellber began airing in Japan on Tokyo MX, Mētele, ABC, and AT-X in April 2007. A related manga, MUZZLE-LOADER 〜Wellber Stories〜, has begun serialization on February 28, 2007 in Monthly Comic Blade, one of Mag Garden's magazines. A second season started on January 1, 2008, picking up just where the first season left off. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mikako Takahashi Rita Sior Eri Sendai Sherry Junko Takeuchi Tina Lothar Yuki Kaida Jamille Kyra Namikawa Daisuke Galahad Eiger Full Cast & Crew Last Season Season 2 2008 | 13 Episodes Season 2 of Wellber no Monogatari: Sisters of Wellber premiered on January  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Wellber no Monogatari: Sisters of Wellber. You can help by rating TV shows you've seen. Facts Original Name  ウエルベールの物語 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://avexmovie.jp/lineup/wellber/index.html Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 12 seboseboss 5 sp1ti 2 TheDerpMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}