{"link": "https://www.themoviedb.org/tv/31090?language=en", "title": "Atheism: A Rough History of Disbelief", "resume": "Atheism: A Rough History of Disbelief – known in the United States as A Brief History of Disbelief – is a 2004 television documentary series written and presented by Jonathan Miller for the BBC and tracing the history of atheism.", "rate": 100, "genre": ["Documentary"], "cast": ["Bernard Hill", "Richard Dawkins", "Jonathan Miller"], "character": ["Himself", "Biologist", "Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31090   Expand Atheism: A Rough History of Disbelief   (2004) User Score Overview Atheism: A Rough History of Disbelief – known in the United States as A Brief History of Disbelief – is a 2004 television documentary series written and presented by Jonathan Miller for the BBC and tracing the history of atheism. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bernard Hill Himself Richard Dawkins Biologist Jonathan Miller Presenter Full Cast & Crew Last Season Season 1 2004 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Atheism: A Rough History of Disbelief. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Documentary Keywords religion religious conflict religious differences atheism science vs religion Content Score 56 We're so close, yet so far. Top Contributors I 17 IndoSlim a 3 agbeale R 3 Rebecca w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}