{"link": "https://www.themoviedb.org/tv/43090?language=en", "title": "Naval Cadets, Charge!", "resume": "Three naval cadets accidentally get possession of a secret diary that was stolen from Bestuzhev, a vice-chancellor of Russia. If this diary ever gets abroad, the consequences for the country would be grave. The cadets are trying to return the papers to their owner, but there are others who want to get the papers...", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Sergey Zhigunov", "Dmitriy Kharatyan", "Vladimir Shevelkov", "Tatyana Lyutaeva", "Mikhail Boyarskiy"], "character": ["Aleksandr Belov", "Aleksei Korzak", "Nikita Olenyov", "Anastasiya Yaguzhinskaya", "Chevalier de Brillieu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43090   Expand Naval Cadets, Charge!   (1988) User Score Overview Three naval cadets accidentally get possession of a secret diary that was stolen from Bestuzhev, a vice-chancellor of Russia. If this diary ever gets abroad, the consequences for the country would be grave. The cadets are trying to return the papers to their owner, but there are others who want to get the papers... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sergey Zhigunov Aleksandr Belov Dmitriy Kharatyan Aleksei Korzak Vladimir Shevelkov Nikita Olenyov Tatyana Lyutaeva Anastasiya Yaguzhinskaya Mikhail Boyarskiy Chevalier de Brillieu Full Cast & Crew Last Season Season 1 1988 | 4 Episodes Season 1 of Naval Cadets, Charge! premiered on January  1, 1988. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Naval Cadets, Charge!. You can help by rating TV shows you've seen. Facts Original Name  Гардемарины, вперёд! Status  Ended Networks - Certification  - Type  Scripted Original Language  Russian Runtime  90m Homepage  - Genres Action & Adventure Keywords romance period drama historical drama costume drama Content Score 86 Almost there... Top Contributors 35 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}