{"link": "https://www.themoviedb.org/tv/40017?language=en", "title": "Birdie Buddy", "resume": "Birdie Buddy is a South Korean television series set in the world of professional golf. Based on the 2007 comic series of the same title by Lee Hyun-sae, it starred Uee, Lee Yong-woo and Lee Da-hee.\nThe drama was pre-produced in 2010, and initially expected to air on MBC in December 2010, but the network decided not to give it a timeslot. After several postponements, it aired on cable channel tvN from August 8 to October 25, 2011 on Mondays and Tuesdays at 23:00. But instead of the original 20 episodes of 70 minutes each, it was re-edited into 24 episodes spanning 45 minutes each.", "rate": 77, "genre": ["Drama", "Romance"], "cast": ["Uee", "Jin Ji-hee", "Lee Yong-Woo", "Lee Da-hee", "Oh Hyun-kyung"], "character": ["Sung Mi Soo", "Sung Mi Soo (young)", "John Lee", "Min Hae Ryung", "Min Se Hwa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40017   Expand Birdie Buddy   (2011) User Score Overview Birdie Buddy is a South Korean television series set in the world of professional golf. Based on the 2007 comic series of the same title by Lee Hyun-sae, it starred Uee, Lee Yong-woo and Lee Da-hee. The drama was pre-produced in 2010, and initially expected to air on MBC in December 2010, but the network decided not to give it a timeslot. After several postponements, it aired on cable channel tvN from August 8 to October 25, 2011 on Mondays and Tuesdays at 23:00. But instead of the original 20 episodes of 70 minutes each, it was re-edited into 24 episodes spanning 45 minutes each. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Uee Sung Mi Soo Jin Ji-hee Sung Mi Soo (young) Lee Yong-Woo John Lee Lee Da-hee Min Hae Ryung Oh Hyun-kyung Min Se Hwa Full Cast & Crew Last Season Season 1 2011 | 24 Episodes Season 1 of Birdie Buddy premiered on August  8, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2008-03-16 Fated to Love You 7.3    2017-09-04 Argon 6.8    2016-11-21 White Nights 8.0    2016-03-23 Click your Heart 7.0  Facts Original Name  버디버디 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  45m Homepage  - Genres Drama Romance Keywords korea Content Score 86 Almost there... Top Contributors M 33 Maria180493 NS 6 Norte Serra z 5 zurman1 3 lareina123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}