{"link": "https://www.themoviedb.org/tv/47134?language=en", "title": "Agatha Christie's Great Detectives Poirot and Marple", "resume": "Agatha Christie's Great Detectives Poirot and Marple is an anime television series that adapted several Agatha Christie stories about Hercule Poirot and Miss Marple. A new character named Mabel West, Miss Marple's great-niece, who becomes Poirot's junior assistant, is used to connect the two detectives.\nThe series was broadcast from 4 July 2004 to 15 May 2005 on NHK, and continues to be shown in re-runs on NHK and other networks in Japan. The series was adapted as manga under the same title, which was released in 2004 and 2005.", "rate": 60, "genre": ["Mystery", "Animation", "Crime"], "cast": ["Masaya Kato", "Yuusaku Yara", "Kaoru Yachigusa"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47134   Expand Agatha Christie's Great Detectives Poirot and Marple   (2004) User Score Overview Agatha Christie's Great Detectives Poirot and Marple is an anime television series that adapted several Agatha Christie stories about Hercule Poirot and Miss Marple. A new character named Mabel West, Miss Marple's great-niece, who becomes Poirot's junior assistant, is used to connect the two detectives. The series was broadcast from 4 July 2004 to 15 May 2005 on NHK, and continues to be shown in re-runs on NHK and other networks in Japan. The series was adapted as manga under the same title, which was released in 2004 and 2005. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masaya Kato Yuusaku Yara Kaoru Yachigusa Full Cast & Crew Last Season Agatha christie no meitantei poirot to marple season 1 2004 | 34 Episodes Season 1 of Agatha Christie's Great Detectives Poirot and Marple premiered on July  4, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Agatha Christie's Great Detectives Poirot and Marple. You can help by rating TV shows you've seen. Facts Original Name  アガサ・クリスティーの名探偵ポワロとマープル Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www3.nhk.or.jp/anime/agatha/ Genres Mystery Animation Crime Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 7 Jaime Neto t 6 tmdb983464 5 seboseboss m 1 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}