{"link": "https://www.themoviedb.org/tv/18040?language=en", "title": "Missing", "resume": "Missing was a British daytime television drama series starring Pauline Quirke and Mark Wingett. The series is set in a busy, under-resourced missing persons unit, and follows the team led by DS Mary Jane \"MJ\" Croft. The first series of five episodes aired on BBC One in 2009, with a second series of ten episodes airing in 2010. It was filmed in and around Dover, Kent and Tonbridge, Kent.\nAlso starring Felix Scott and Pooja Shah, guest stars during the second series included Roy Hudd, Paul Nicholas, Brooke Kinsella, Gary Lucy and Sylvia Syms.", "rate": 15, "genre": ["Drama"], "cast": ["Pauline Quirke", "Mark Wingett", "Pooja Shah"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18040   Expand Missing   (2009) User Score Overview Missing was a British daytime television drama series starring Pauline Quirke and Mark Wingett. The series is set in a busy, under-resourced missing persons unit, and follows the team led by DS Mary Jane \"MJ\" Croft. The first series of five episodes aired on BBC One in 2009, with a second series of ten episodes airing in 2010. It was filmed in and around Dover, Kent and Tonbridge, Kent. Also starring Felix Scott and Pooja Shah, guest stars during the second series included Roy Hudd, Paul Nicholas, Brooke Kinsella, Gary Lucy and Sylvia Syms. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pauline Quirke Mark Wingett Pooja Shah Full Cast & Crew Last Season (2009) season 2 2010 | 10 Episodes Season 2 of Missing premiered on March 15, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Missing. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Missing. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.bbc.co.uk/programmes/b00rmx2h Genres Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 7 janar 4 kcdh 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}