{"link": "https://www.themoviedb.org/tv/53390?language=en", "title": "Lily Colored Rose", "resume": "‘Lily See Kulap” is a romance action comedy about a young woman from Hong Kong who fled her country to Thailand to get out of a force marriage by her uber wealthy father. Her name is Lily. She hires Nop (Cee), a former police officer, as her bodyguard to help her fend off her father’s two bodyguards who were sent by her father to haul her back to Hong Kong to marry Peter, her betrothed.\nMore complete summary by Lyn's lakorn blog: Lily (Jakajan) is the only daughter of a very wealthy man in Hong Kong and she is a spoiled little brat. Her father wants her to marry Peter, the son of one of his closest friends. He wants to cure Lily of her selfishness and immaturity by marrying her off. Lily doesn’t love Peter so she flees to Thailand in search of her Thai friend and to find her true love. Her father sends out two bodyguard to bring her back to Hong Kong to marry Peter.\nWhen fleeing from her father’s bodyguards, she bumps into Nop and hires him as her bodyguard. At first, by the way she is dressing, Nop thinks she is a prostitute trying to run away from her pimp. Though he has misgivings about Lily, he does accept her proposition. Nop is going through a life crisis, he is having problems at home with his father who married a younger woman. He just quit his job as a public servant because of boredom. Nop is a former police officer. In meeting Lily, Nop’s life turns upside down.", "rate": 65, "genre": ["Comedy", "Drama", "Soap", "Romance"], "cast": ["Siwat Chottichaicharin", "Akumsiri Suwannasuk", "Thitinun Suwansuk", "Thee Wanichnanthatada", "Namwaan Kannaporn"], "character": ["Nop", "Lily/Leehua", "Tek", "Pipat", "Lada"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 53390   Expand Lily Colored Rose   (2011) User Score  Play Trailer Overview ‘Lily See Kulap” is a romance action comedy about a young woman from Hong Kong who fled her country to Thailand to get out of a force marriage by her uber wealthy father. Her name is Lily. She hires Nop (Cee), a former police officer, as her bodyguard to help her fend off her father’s two bodyguards who were sent by her father to haul her back to Hong Kong to marry Peter, her betrothed. More complete summary by Lyn's lakorn blog: Lily (Jakajan) is the only daughter of a very wealthy man in Hong Kong and she is a spoiled little brat. Her father wants her to marry Peter, the son of one of his closest friends. He wants to cure Lily of her selfishness and immaturity by marrying her off. Lily doesn’t love Peter so she flees to Thailand in search of her Thai friend and to find her true love. Her father sends out two bodyguard to bring her back to Hong Kong to marry Peter. When fleeing from her father’s bodyguards, she bumps into Nop and hires him as her bodyguard. At first, by the way she is dressing, Nop thinks she is a prostitute trying to run away from her pimp. Though he has misgivings about Lily, he does accept her proposition. Nop is going through a life crisis, he is having problems at home with his father who married a younger woman. He just quit his job as a public servant because of boredom. Nop is a former police officer. In meeting Lily, Nop’s life turns upside down.  Featured Crew Kantana Group Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Siwat Chottichaicharin Nop Akumsiri Suwannasuk Lily/Leehua Thitinun Suwansuk Tek Thee Wanichnanthatada Pipat Namwaan Kannaporn Lada Full Cast & Crew Last Season Season 1 2011 | 17 Episodes Season 1 of Lily Colored Rose premiered on June 24, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Lily Colored Rose. You can help by rating TV shows you've seen. Facts Original Name  ลิลลี่สีกุหลาบ Status  Ended Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  85m Homepage   http://news.ch7.com/detail/8506/7_%E0%B8%AA%E0%B8%B5%E0%B8%84%E0%B8%AD%E0%B8%99%E0%B9%80%E0%B8%AA%E0%B8%B4%E0%B8%A3%E0%B9%8C%E0%B8%95%E0%B8%A5%E0%B8%B4%E0%B8%A5%E0%B8%A5%E0%B8%B5%E0%B9%88%E0%B8%AA%E0%B8%B5%E0%B8%81%E0%B8%B8%E0%B8%AB%E0%B8%A5%E0%B8%B2%E0%B8%9A.html Genres Comedy Drama Soap Romance Keywords thai lakorn Content Score 100 Yes! Looking good! Top Contributors 34 Crip 13 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}