{"link": "https://www.themoviedb.org/tv/70943?language=en", "title": "Onihei", "resume": "The historical novel series depicts Heizou Hasegawa, who metes justice on wrongdoers and supervises the crackdown on arsonists and robbers in Japan's Edo period (1603-1868).", "rate": 78, "genre": ["Drama", "Animation", "Crime"], "cast": ["Ken'yuu Horiuchi", "Namikawa Daisuke", "Junko Iwao", "Sayaka Senbongi", "Romi Park"], "character": ["Heizō Hasegawa", "Tatsuzō", "Hisae", "Ojun", "Omasa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70943   Expand Onihei   (2017) User Score  Play Trailer Overview The historical novel series depicts Heizou Hasegawa, who metes justice on wrongdoers and supervises the crackdown on arsonists and robbers in Japan's Edo period (1603-1868). Featured Crew Shigeyuki Miya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken'yuu Horiuchi Heizō Hasegawa Namikawa Daisuke Tatsuzō Junko Iwao Hisae Sayaka Senbongi Ojun Romi Park Omasa Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Onihei premiered on January 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2004-04-06 Monster 7.7  Facts Original Name  鬼平犯科帳 Status  Ended Network Certification 10 Meaning Not recommended for children under 10. Not allowed in children's television series. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://onihei-anime.com/sp/ Genres Drama Animation Crime Keywords samurai police psychology crime combat medieval Content Score 100 Yes! Looking good! Top Contributors 22 chinvincible D 20 Destr0y 10 YabukiJoe1 jp 5 juan perez  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}