{"link": "https://www.themoviedb.org/tv/7354?language=en", "title": "Harper's Island", "resume": "A group of family and friends travels to a secluded island for a destination wedding. They've come to laugh... to love... and, though they don't know it... to die. As the wedding festivities begin, friendships are tested and secrets exposed as a murderer claims victims, one by one, transforming the wedding week of fun and celebration into a terrifying struggle for survival.", "rate": 71, "genre": ["Mystery", "Drama"], "cast": ["Elaine Cassidy", "Katie Cassidy", "Matt Barr", "Christopher Gorham", "Jim Beaver"], "character": ["Abby Mills", "Trish Wellington", "Christopher 'Sully' Sullivan", "Henry Dunn", "Charlie Mills"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7354   Expand Harper's Island   (2009) User Score  Play Trailer Overview A group of family and friends travels to a secluded island for a destination wedding. They've come to laugh... to love... and, though they don't know it... to die. As the wedding festivities begin, friendships are tested and secrets exposed as a murderer claims victims, one by one, transforming the wedding week of fun and celebration into a terrifying struggle for survival. Featured Crew Ari Schlossberg Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elaine Cassidy Abby Mills Katie Cassidy Trish Wellington Matt Barr Christopher 'Sully' Sullivan Christopher Gorham Henry Dunn Jim Beaver Charlie Mills Full Cast & Crew Last Season Season 1 2009 | 13 Episodes Season 1 of Harper's Island premiered on April  9, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  7 Recommendations   2008-11-13 Apparitions 7.9    2005-12-04 Sleeper Cell 7.4    2009-09-24 FlashForward 6.9    2003-06-27 Dead Like Me 7.8    2012-01-16 Alcatraz 5.9    2004-10-24 ReGenesis 7.0    2011-09-21 The Fades 7.0    2010-06-07 Persons Unknown 6.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 42m Homepage   http://www.cbs.com/primetime/harpers_island/ Genres Mystery Drama Keywords island horror serial killer wedding Content Score 100 Yes! Looking good! Top Contributors 65 Banana d 18 dais 18 Imzadi P 7 PC  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}