{"link": "https://www.themoviedb.org/tv/38646?language=en", "title": "Brødrene Dal og Spektralsteinene", "resume": "While digging for a meteor fragment containing Curium 82, a substance that can cure the common cold, the three brothers Dal finds a shining, diamond-like stone. Later, Roms Dal is visited by an alien in a space ship, and receives a ring containing blueprints to an unknown machine. The brothers decide to build the contraption, hoping to find out what it does. When Roms accidentaly triggers its mechanism using the stone, they are off on an exciting time-traveling adventure.", "rate": 82, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Trond Kirkvaag", "Knut Lystad", "Lars Mjøen", "Tom Mathisen", "Arne Bang-Hansen"], "character": ["Brumund Dal", "Roms Dal", "Gaus Dal", "Fortelleren", "Professor Slatters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38646   Expand Brødrene Dal og Spektralsteinene   (1982) User Score Overview While digging for a meteor fragment containing Curium 82, a substance that can cure the common cold, the three brothers Dal finds a shining, diamond-like stone. Later, Roms Dal is visited by an alien in a space ship, and receives a ring containing blueprints to an unknown machine. The brothers decide to build the contraption, hoping to find out what it does. When Roms accidentaly triggers its mechanism using the stone, they are off on an exciting time-traveling adventure. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Trond Kirkvaag Brumund Dal Knut Lystad Roms Dal Lars Mjøen Gaus Dal Tom Mathisen Fortelleren Arne Bang-Hansen Professor Slatters Full Cast & Crew Last Season Season 1 1982 | 13 Episodes Season 1 of Brødrene Dal og Spektralsteinene premiered on February  6, 1982. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Brødrene Dal og Spektralsteinene. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1994-09-24 Brødrene Dal og legenden om Atlant-is 8.3    1979-01-27 Brødrene Dal og Professor Drøvels hemmelighet 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Norwegian Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords sibling relationship miniseries stone Content Score 86 Almost there... Top Contributors TB 26 TMDb Bot 5 d00ziie 4 Lars the Alien  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}