{"link": "https://www.themoviedb.org/tv/4726?language=en", "title": "Al Murray's Happy Hour", "resume": "Al Murray's Happy Hour was a chat show presented by comedian Al Murray and produced by Avalon TV. The first series aired in early 2007. It is broadcast on the British terrestrial TV network, ITV, and the first series was broadcast on Saturday nights at 10pm. The second series aired on Fridays at 10pm. A third series returned to ITV on 12 September 2008, in the same 10pm Friday night slot. However, UTV in Northern Ireland did not show the third series in the 10pm Friday night slot with the other ITV regions. They now show it the following Thursday at around 11.40pm, due to UTV regional programming on Friday nights. Murray presents the programme in his Pub Landlord persona: a stereotypically nationalistic, chauvinistic character.\nThe show contains stand-up, guest interviews and live music. The show ends with Murray performing a Queen song with the musical guest.", "rate": 65, "genre": ["Comedy"], "cast": ["Al Murray"], "character": ["The Pub Landlord"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4726   Expand Al Murray's Happy Hour   (2007) User Score Overview Al Murray's Happy Hour was a chat show presented by comedian Al Murray and produced by Avalon TV. The first series aired in early 2007. It is broadcast on the British terrestrial TV network, ITV, and the first series was broadcast on Saturday nights at 10pm. The second series aired on Fridays at 10pm. A third series returned to ITV on 12 September 2008, in the same 10pm Friday night slot. However, UTV in Northern Ireland did not show the third series in the 10pm Friday night slot with the other ITV regions. They now show it the following Thursday at around 11.40pm, due to UTV regional programming on Friday nights. Murray presents the programme in his Pub Landlord persona: a stereotypically nationalistic, chauvinistic character. The show contains stand-up, guest interviews and live music. The show ends with Murray performing a Queen song with the musical guest. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Al Murray The Pub Landlord Full Cast & Crew Last Season Season 3 2008 | 7 Episodes Season 3 of Al Murray's Happy Hour premiered on September 12, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Al Murray's Happy Hour. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords talk show pub patriotism guest celebrity landlord host british humour Content Score 56 We're so close, yet so far. Top Contributors O 14 Ozbourne 1 Michael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}