{"link": "https://www.themoviedb.org/tv/40355?language=en", "title": "The Mercury Men", "resume": "The Mercury Men is a series of web shorts produced for the Syfy network by writer/director Christopher Preksta. It is shot in a retro, 1950s style, in black and white. Though it is set in the mid-1970s, shortly after the Apollo moon landings. The first episode is set explicitly in 1975 and the following eight episodes take place on the same night. The tenth episode is stated as taking place in 1976, but the month and day are unspecified, so it is not clear exactly how much time has lapsed between the ninth and tenth episodes, though it must be significant, as the protagonist somehow travels from Earth to Mercury in that time. Each episode is between 6 and 9 minutes long. The show follows the adventures of a mild-mannered office worker, Edward Borman who is drawn into an adventure when his building is attacked by men from the planet Mercury, who appear to be made of pure light. Their plan is to use the steel framework of the building to enhance their gravity device which will pull down the Moon into the Earth. He meets Jack Yaeger, a member of a secretive group of defenders known as The League. It was shot in Pittsburgh, Pennsylvania, on a budget of under $10,000.", "rate": 50, "genre": [], "cast": ["Curt Wootton"], "character": ["Jack Yeager"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40355   Expand The Mercury Men   (2011) User Score Overview The Mercury Men is a series of web shorts produced for the Syfy network by writer/director Christopher Preksta. It is shot in a retro, 1950s style, in black and white. Though it is set in the mid-1970s, shortly after the Apollo moon landings. The first episode is set explicitly in 1975 and the following eight episodes take place on the same night. The tenth episode is stated as taking place in 1976, but the month and day are unspecified, so it is not clear exactly how much time has lapsed between the ninth and tenth episodes, though it must be significant, as the protagonist somehow travels from Earth to Mercury in that time. Each episode is between 6 and 9 minutes long. The show follows the adventures of a mild-mannered office worker, Edward Borman who is drawn into an adventure when his building is attacked by men from the planet Mercury, who appear to be made of pure light. Their plan is to use the steel framework of the building to enhance their gravity device which will pull down the Moon into the Earth. He meets Jack Yaeger, a member of a secretive group of defenders known as The League. It was shot in Pittsburgh, Pennsylvania, on a budget of under $10,000. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Curt Wootton Jack Yeager Full Cast & Crew Last Season Season 1 2011 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Mercury Men. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.mercuryseries.com Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors k 3 kadagan 3 tulgha  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}