{"link": "https://www.themoviedb.org/tv/778?language=en", "title": "The Adventure of English", "resume": "The Adventure of English is a British television series on the history of the English language presented by Melvyn Bragg as well as a companion book, also written by Bragg. The series ran in 2003.\nThe series and the book are cast as an adventure story, or the biography of English as if it were a living being, covering the history of the language from its modest beginnings around 500 AD as a minor Germanic dialect to its rise as a truly established global language.\nIn the television series, Bragg explains the origins and spelling of many words based on the times in which they were introduced into the growing language that would eventually become modern English.", "rate": 60, "genre": ["Documentary"], "cast": ["Melvyn Bragg"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 778   Expand The Adventure of English   (2003) User Score Overview The Adventure of English is a British television series on the history of the English language presented by Melvyn Bragg as well as a companion book, also written by Bragg. The series ran in 2003. The series and the book are cast as an adventure story, or the biography of English as if it were a living being, covering the history of the language from its modest beginnings around 500 AD as a minor Germanic dialect to its rise as a truly established global language. In the television series, Bragg explains the origins and spelling of many words based on the times in which they were introduced into the growing language that would eventually become modern English. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melvyn Bragg Full Cast & Crew Last Season season 1 2003 | 8 Episodes Season 1 of The Adventure of English premiered on November  6, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Adventure of English. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  65m Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}