{"link": "https://www.themoviedb.org/tv/38428?language=en", "title": "Cover Story", "resume": "When Lára, a journalist on maternity leave finds herself newly single and in deep financial trouble, her outlook is bleak. Enter handsome and notorious businessman Hrafn: aware of her intuitive skills as an investigator, he hires her to prove his innocence in a case involving the murder of a young woman. Lára is saved from her desperate financial situation, but at what cost?", "rate": 0, "genre": ["Drama"], "cast": ["Sara Dögg Ásgeirsdóttir", "Kjartan Guðjónsson", "Þorsteinn Bachmann", "Orri Huginn Ágústsson", "Arndís Hrönn Egilsdóttir"], "character": ["Lára", "Nökkvi", "Gestur", "Viggó", "Stína"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38428   Expand Cover Story   (2007) User Score Overview When Lára, a journalist on maternity leave finds herself newly single and in deep financial trouble, her outlook is bleak. Enter handsome and notorious businessman Hrafn: aware of her intuitive skills as an investigator, he hires her to prove his innocence in a case involving the murder of a young woman. Lára is saved from her desperate financial situation, but at what cost? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sara Dögg Ásgeirsdóttir Lára Kjartan Guðjónsson Nökkvi Þorsteinn Bachmann Gestur Orri Huginn Ágústsson Viggó Arndís Hrönn Egilsdóttir Stína Full Cast & Crew Last Season Season 2 2011 | 6 Episodes Season 2 of Cover Story premiered on March 20, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cover Story. You can help by rating TV shows you've seen. Facts Original Name  Pressa Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 10 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}