{"link": "https://www.themoviedb.org/tv/9248?language=en", "title": "TLC", "resume": "TLC is a darkly surreal farce-like sitcom set in a fictional NHS hospital called South Middlesex where coffee is traded like drugs and pretty much everyone has a personality problem. It was first broadcast on the BBC on 11 November 2002 and ran over six episodes until 16 December. There were some very mixed opinions on the show among both critics and viewers, but it achieved decent ratings and featured an excellent comedy cast including Richard Griffiths, Alexander Armstrong and The League of Gentlemen's Reece Shearsmith. The series was released on DVD in the UK on 29 October 2007.\nThe show never confirms what \"TLC\" stands for, although it is presumed to be a sarcastic reference to the widely used abbreviation for \"Tender Loving Care\", but could equally refer to the alternative yet related abbreviation \"Total Lack of Concern\".", "rate": 0, "genre": [], "cast": ["Alexander Armstrong", "Benedict Wong", "Llewella Gideon", "Martin Trenaman", "Reece Shearsmith"], "character": ["Dr. Noble"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9248   Expand TLC   (2002) User Score Overview TLC is a darkly surreal farce-like sitcom set in a fictional NHS hospital called South Middlesex where coffee is traded like drugs and pretty much everyone has a personality problem. It was first broadcast on the BBC on 11 November 2002 and ran over six episodes until 16 December. There were some very mixed opinions on the show among both critics and viewers, but it achieved decent ratings and featured an excellent comedy cast including Richard Griffiths, Alexander Armstrong and The League of Gentlemen's Reece Shearsmith. The series was released on DVD in the UK on 29 October 2007. The show never confirms what \"TLC\" stands for, although it is presumed to be a sarcastic reference to the widely used abbreviation for \"Tender Loving Care\", but could equally refer to the alternative yet related abbreviation \"Total Lack of Concern\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexander Armstrong Dr. Noble Benedict Wong Llewella Gideon Martin Trenaman Reece Shearsmith Full Cast & Crew Last Season Season 1 2002 | 6 Episodes Season 1 of TLC premiered on November 17, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on TLC. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}