{"link": "https://www.themoviedb.org/tv/3669?language=en", "title": "The Janice Dickinson Modeling Agency", "resume": "The Janice Dickinson Modeling Agency was a reality television series that debuted on Oxygen on June 6, 2006. The show completed four seasons, through which it followed the self-proclaimed world's first supermodel Janice Dickinson as she took on the role of a modeling agent to her own eponymous agency, also called The Janice Dickinson Modeling Agency, which opened for business in November 2005.\nThe first season follows her opening of the agency, including the difficulty in finding models of Janice's vision, getting them proficient in front of the camera, obtaining financial backing and establishing a reputation for her agency. Subsequent seasons followed the development of the agency and a constantly changing cast of models. A number of the male models are openly gay, and a number of the agency's clients are gay-oriented businesses. This resulted in many of the episodes being gay-themed.\nOxygen aired a one-hour holiday special to bridge a gap between the first and second seasons, entitled Christmas with the Dickinsons.\nIn the UK, there was to be a British version of the show with supermodel Paula Hamilton as the agency head. Like the American version, the show was to be titled after the lead. It was to be shown on the cable channel Living, which is also the home of the Top Model franchise in UK. After much planning, the show was canceled due to a lack of interest in the American version.", "rate": 20, "genre": ["Documentary"], "cast": ["Nathan Fields", "Janice Dickinson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3669   Expand The Janice Dickinson Modeling Agency   (2006) User Score Overview The Janice Dickinson Modeling Agency was a reality television series that debuted on Oxygen on June 6, 2006. The show completed four seasons, through which it followed the self-proclaimed world's first supermodel Janice Dickinson as she took on the role of a modeling agent to her own eponymous agency, also called The Janice Dickinson Modeling Agency, which opened for business in November 2005. The first season follows her opening of the agency, including the difficulty in finding models of Janice's vision, getting them proficient in front of the camera, obtaining financial backing and establishing a reputation for her agency. Subsequent seasons followed the development of the agency and a constantly changing cast of models. A number of the male models are openly gay, and a number of the agency's clients are gay-oriented businesses. This resulted in many of the episodes being gay-themed. Oxygen aired a one-hour holiday special to bridge a gap between the first and second seasons, entitled Christmas with the Dickinsons. In the UK, there was to be a British version of the show with supermodel Paula Hamilton as the agency head. Like the American version, the show was to be titled after the lead. It was to be shown on the cable channel Living, which is also the home of the Top Model franchise in UK. After much planning, the show was canceled due to a lack of interest in the American version. Featured Crew Janice Dickinson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nathan Fields Janice Dickinson Full Cast & Crew Last Season Season 4 2008 | 10 Episodes Season 4 of The Janice Dickinson Modeling Agency premiered on August 26, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Janice Dickinson Modeling Agency. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.oxygen.com/janice Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}