{"link": "https://www.themoviedb.org/tv/77431?language=en", "title": "The thing of the year", "resume": "The thing of the year is a German tv show that started on the 9th Feb 2018 on Prosieben. Multiple pairs of inventors try to get the most enthusiasm for their product in order to win a marketing deal worth 2.5 Million Euros presented by ProsiebenSat.1.", "rate": 100, "genre": ["Animation", "Reality"], "cast": ["Hans-Jürgen Moog", "Lena Gercke", "Joko Winterscheidt"], "character": ["Jury", "Jury", "Jury"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77431   Expand The thing of the year   (2018) User Score Overview The thing of the year is a German tv show that started on the 9th Feb 2018 on Prosieben. Multiple pairs of inventors try to get the most enthusiasm for their product in order to win a marketing deal worth 2.5 Million Euros presented by ProsiebenSat.1. Featured Crew Stefan Raab Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Hans-Jürgen Moog Jury Lena Gercke Jury Joko Winterscheidt Jury Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of The thing of the year premiered on February  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The thing of the year. You can help by rating TV shows you've seen. Facts Original Name  Das Ding des Jahres Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  - Homepage   https://www.prosieben.ch/tv/das-ding-des-jahres Genres Animation Reality Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 25 tittiagoo 6 Russ007 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}