{"link": "https://www.themoviedb.org/tv/36248?language=en", "title": "Linebarrels of Iron", "resume": "Linebarrels of Iron is a Japanese manga series created by Eiichi Shimizu and Tomohiro Shimoguchi. The series was first serialized in Akita Shoten's monthly shōnen manga magazine, Champion Red, in 2005. It has since been compiled into eleven tankōbon, as of November 20, 2008. The story centers around Kouichi Hayase, a fourteen-year-old boy living a mediocre life, until an accident turns him into the pilot of a gigantic robot called \"Linebarrel\" and leads him to encounter a mysterious girl.\nAn anime adaptation of the manga series was announced in the February issue of Animage magazine. The anime is directed by Masamitsu Hidaka and animated by Gonzo. Though the world premiere of the first episode took place at Southern California's 2008 Anime Expo, the series premiered in Japan on the television network TBS on October 3, 2008. The anime broadcast a total of twenty-four episodes, the last of which aired on March 20, 2009. To commemorate the series' anime adaptation, Shimizu and Shimoguchi decided to create a one shot manga, recreating the entire first episode of the anime, in which the plot differs in many aspects compared to the beginning of the manga.", "rate": 0, "genre": ["Drama", "Animation", "Comedy", "Drama"], "cast": ["Mamiko Noto", "Miyuki Sawashiro", "Tetsuya Kakihara", "Rie Kugimiya", "Kana Ueda"], "character": ["Emi Kizaki", "Satoru Yamashita", "Kōichi Hayase", "Izuna Endō", "Shizuna Endō"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 36248   Expand Linebarrels of Iron   (2008) User Score Overview Linebarrels of Iron is a Japanese manga series created by Eiichi Shimizu and Tomohiro Shimoguchi. The series was first serialized in Akita Shoten's monthly shōnen manga magazine, Champion Red, in 2005. It has since been compiled into eleven tankōbon, as of November 20, 2008. The story centers around Kouichi Hayase, a fourteen-year-old boy living a mediocre life, until an accident turns him into the pilot of a gigantic robot called \"Linebarrel\" and leads him to encounter a mysterious girl. An anime adaptation of the manga series was announced in the February issue of Animage magazine. The anime is directed by Masamitsu Hidaka and animated by Gonzo. Though the world premiere of the first episode took place at Southern California's 2008 Anime Expo, the series premiered in Japan on the television network TBS on October 3, 2008. The anime broadcast a total of twenty-four episodes, the last of which aired on March 20, 2009. To commemorate the series' anime adaptation, Shimizu and Shimoguchi decided to create a one shot manga, recreating the entire first episode of the anime, in which the plot differs in many aspects compared to the beginning of the manga. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamiko Noto Emi Kizaki Miyuki Sawashiro Satoru Yamashita Tetsuya Kakihara Kōichi Hayase Rie Kugimiya Izuna Endō Kana Ueda Shizuna Endō Full Cast & Crew Last Season Season 1 2008 | 26 Episodes Season 1 of Linebarrels of Iron premiered on October  3, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Linebarrels of Iron. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.linebarrels.jp/index.html Genres Drama Animation Comedy Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors m 3 magoozin n 1 nakamas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}