{"link": "https://www.themoviedb.org/tv/16142?language=en", "title": "Drug Wars: The Camarena Story", "resume": "A miniseries based on Elaine Shannon’s book Desperados and the Time magazine article of the same name.", "rate": 62, "genre": ["Drama"], "cast": ["Steven Bauer", "Elizabeth Peña", "Miguel Ferrer", "Benicio del Toro", "Guy Boyd"], "character": ["Enrique 'Kiki' Camarena", "Mika Camarena", "Tony Riva", "Caro Quintero", "George Gilliard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16142   Expand Drug Wars: The Camarena Story   (1990) User Score Overview A miniseries based on Elaine Shannon’s book Desperados and the Time magazine article of the same name. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steven Bauer Enrique 'Kiki' Camarena Elizabeth Peña Mika Camarena Miguel Ferrer Tony Riva Benicio del Toro Caro Quintero Guy Boyd George Gilliard Full Cast & Crew Last Season Miniseries 1990 | 3 Episodes Season 1 of Drug Wars: The Camarena Story premiered on January  7, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Drug Wars: The Camarena Story. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Drama Keywords mexico war on drugs miniseries 1980s Content Score 71 Just a little bit more... Top Contributors 42 Banana TB 18 TMDb Bot R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}