{"link": "https://www.themoviedb.org/tv/77702?language=en", "title": "Mahou Shoujo Site", "resume": "Aya Asagiri is a middle school girl who has problems both at school with bullying and at home from physical abuse by her brother. While browsing online, a website pops up on her computer featuring a creepy looking person. This person appears to take pity on her, and announces that she has granted Asagiri magical powers.", "rate": 70, "genre": ["Animation"], "cast": ["Kizuna AI", "Yuu Serizawa", "Yuko Ono", "Aina Suzuki", "Haruka Yamazaki"], "character": ["Hachi", "Anazawa Nijimi", "Asagiri Aya", "Shioi Rina", "Shizukume Sarina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77702   Expand Mahou Shoujo Site   (2018) User Score Overview Aya Asagiri is a middle school girl who has problems both at school with bullying and at home from physical abuse by her brother. While browsing online, a website pops up on her computer featuring a creepy looking person. This person appears to take pity on her, and announces that she has granted Asagiri magical powers. Featured Crew Kentarou Satou Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kizuna AI Hachi Yuu Serizawa Anazawa Nijimi Yuko Ono Asagiri Aya Aina Suzuki Shioi Rina Haruka Yamazaki Shizukume Sarina Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Mahou Shoujo Site premiered on April  7, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Mahou Shoujo Site. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Mahou Shoujo Site. You can help by rating TV shows you've seen. Facts Original Name  魔法少女サイト Status  Returning Series Network Certification NR Meaning No rating information Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://mahoushoujyo-anime.com/ Genres Animation Keywords supernatural horror based on manga psychological Content Score 100 Yes! Looking good! Top Contributors 49 sp1ti 40 0x3199 21 neonime 11 Aubi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}