{"link": "https://www.themoviedb.org/tv/35410?language=en", "title": "Yōkai Ningen Bem", "resume": "Yōkai Ningen Bem is a 26 episode Japanese anime television series which first aired on Fuji TV between October 7, 1968 and March 31, 1969, on its 19:30–20:00 timeslot.\nThe series was later remade into a second anime TV series, which premiered on April 2006 in Japan on Animax, featuring a new cast, with a total of 26 episodes also produced. The remake was also later aired by Animax across its other international networks, including its English language networks in Southeast Asia and South Asia, for which Animax produced an English dub under the title Humanoid Monster Bem. This dub was later aired on Animax's United States web channel on Crackle.com.\nA live action television drama adaptation premiered on NTV on October 22, 2011. A film was released in December 15, 2012.", "rate": 0, "genre": ["Animation", "Action", "Adventure"], "cast": ["Kiyoshi Kobayashi", "Hiroko Mori", "Mari Shimizu"], "character": ["Bem (voice)", "Bella (voice)", "Vero (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35410   Expand Yōkai Ningen Bem   (1968) User Score Overview Yōkai Ningen Bem is a 26 episode Japanese anime television series which first aired on Fuji TV between October 7, 1968 and March 31, 1969, on its 19:30–20:00 timeslot. The series was later remade into a second anime TV series, which premiered on April 2006 in Japan on Animax, featuring a new cast, with a total of 26 episodes also produced. The remake was also later aired by Animax across its other international networks, including its English language networks in Southeast Asia and South Asia, for which Animax produced an English dub under the title Humanoid Monster Bem. This dub was later aired on Animax's United States web channel on Crackle.com. A live action television drama adaptation premiered on NTV on October 22, 2011. A film was released in December 15, 2012. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kiyoshi Kobayashi Bem (voice) Hiroko Mori Bella (voice) Mari Shimizu Vero (voice) Full Cast & Crew Last Season Original Air Date Original Air Date Japanese DVDs (DVD) Season 1 1968 | 26 Episodes Season 1 of Yōkai Ningen Bem premiered on October  7, 1968. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Yōkai Ningen Bem. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Yōkai Ningen Bem. You can help by rating TV shows you've seen. Facts Original Name  妖怪人間ベム Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Action & Adventure Keywords horror Content Score 56 We're so close, yet so far. Top Contributors 30 United600 2 Goffred0  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}