{"link": "https://www.themoviedb.org/tv/74063?language=en", "title": "To Be a Better Man", "resume": "Lu Yuan worked hard in America to become a Michelin 3-starred chef. To many, he is the Devil incarnate, reckless and wanton. But when it comes to the person he loves, he is an entirely different \"good man,\" loyal, kind, and honest. After a nightmarish car accident takes away his friend, he returns home with his remains. There, he runs into the person he most doesn't want to see, and becomes entangled with his ex, Gan Jing, their old classmate, Jiang Haokun, and Haokun's younger sister, Jiang Lai.", "rate": 0, "genre": ["Drama"], "cast": ["Che Xiao", "Sun Hong-Lei", "David Wang", "Guan Xiao Tong", "Yixing Zhang"], "character": ["Gan Jing", "Lu Yuan", "Jiang Haokun", "Peng Jiahe", "Xiao Cai"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74063   Expand To Be a Better Man   (2016) User Score Overview Lu Yuan worked hard in America to become a Michelin 3-starred chef. To many, he is the Devil incarnate, reckless and wanton. But when it comes to the person he loves, he is an entirely different \"good man,\" loyal, kind, and honest. After a nightmarish car accident takes away his friend, he returns home with his remains. There, he runs into the person he most doesn't want to see, and becomes entangled with his ex, Gan Jing, their old classmate, Jiang Haokun, and Haokun's younger sister, Jiang Lai. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Che Xiao Gan Jing Sun Hong-Lei Lu Yuan David Wang Jiang Haokun Guan Xiao Tong Peng Jiahe Yixing Zhang Xiao Cai Full Cast & Crew Last Season Season 1 2016 | 42 Episodes Season 1 of To Be a Better Man premiered on May 31, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on To Be a Better Man. You can help by rating TV shows you've seen. Facts Original Name  好先生 Status  Ended Networks Zhejiang Television JSTV Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 42 mikeglay 11 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}