{"link": "https://www.themoviedb.org/tv/5259?language=en", "title": "Dogfights", "resume": "Dogfights is a military aviation themed TV series depicting historical re-enactments of air-to-air combat that took place in World War I, World War II, the Korean War, and the Vietnam War, as well as smaller conflicts such as the Gulf War and the Six-Day War. The program, which airs on the History Channel, consists of former fighter pilots sharing their stories of actual dogfights in which they took part, and uses computer-generated imagery to give the viewer a better perspective of what it is like to partake in aerial combat The series premiered on November 3, 2006.", "rate": 40, "genre": ["Documentary", "News", "Action", "Adventure"], "cast": ["Phil Crowley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5259   Expand Dogfights   (2006) User Score Overview Dogfights is a military aviation themed TV series depicting historical re-enactments of air-to-air combat that took place in World War I, World War II, the Korean War, and the Vietnam War, as well as smaller conflicts such as the Gulf War and the Six-Day War. The program, which airs on the History Channel, consists of former fighter pilots sharing their stories of actual dogfights in which they took part, and uses computer-generated imagery to give the viewer a better perspective of what it is like to partake in aerial combat The series premiered on November 3, 2006. Featured Crew Cynthia Harrison Creator Brooks Wachtel Creator Jason McKinley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil Crowley Full Cast & Crew Last Season Season 2 2007 | 18 Episodes Season 2 of Dogfights premiered on July 13, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Dogfights. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.history.com/minisites/dogfights/ Genres Documentary News Action & Adventure Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 11 Aty 3 Steve S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}