{"link": "https://www.themoviedb.org/tv/62025?language=en", "title": "Quiz Me Quick", "resume": "The story of five underdogs, meeting by chance during a quiz in a local pub. They get the idea of taking part in the \"Superprestige\", the most important quiz. The selection procedure turns out to be difficult, requiring more than just knowledge. There's even more at stake than the five had in mind. \"Quiz Me Quick\" follows their successes as well as their failures", "rate": 88, "genre": ["Drama", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62025   Expand Quiz Me Quick   (2012) User Score Overview The story of five underdogs, meeting by chance during a quiz in a local pub. They get the idea of taking part in the \"Superprestige\", the most important quiz. The selection procedure turns out to be difficult, requiring more than just knowledge. There's even more at stake than the five had in mind. \"Quiz Me Quick\" follows their successes as well as their failures Featured Crew Bart De Pauw Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2012 | 10 Episodes Season 1 of Quiz Me Quick premiered on April 29, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2009-01-01 Van Vlees en Bloed 8.6    2000-02-11 In de gloria 8.7    2004-01-31 The Island 8.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  45m Homepage   http://www.quizmequick.be/menu.html Genres Drama Comedy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 21 Mathias Van Der Bruggen 5 kurt.smolderen 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}