{"link": "https://www.themoviedb.org/tv/64265?language=en", "title": "Lonely Gourmet: Taipei", "resume": "The best part of the day for a lonely old businessman is when he clocks out after a long day’s work and discovers a new place to eat. Wu Lang spends his days visiting clients in different parts of Taipei. After he finishes work for the day, he then starts his quest to discover hidden gems among the restaurants in the part of town where he ends up. As he explores new restaurants and meets new people, will he be able to dispel a little bit of his loneliness through good food and friendly people?", "rate": 0, "genre": ["Documentary", "Drama"], "cast": ["Winston Chao"], "character": ["Wu Lang"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64265   Expand Lonely Gourmet: Taipei   (2015) User Score Overview The best part of the day for a lonely old businessman is when he clocks out after a long day’s work and discovers a new place to eat. Wu Lang spends his days visiting clients in different parts of Taipei. After he finishes work for the day, he then starts his quest to discover hidden gems among the restaurants in the part of town where he ends up. As he explores new restaurants and meets new people, will he be able to dispel a little bit of his loneliness through good food and friendly people? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Winston Chao Wu Lang Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of Lonely Gourmet: Taipei premiered on May 28, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Lonely Gourmet: Taipei. You can help by rating TV shows you've seen. Facts Original Name  孤独的美食家 第一季·台湾篇 Status  Ended Networks - Certification  - Type  Scripted Original Language  Chinese Runtime  - Homepage  - Genres Documentary Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors j 15 jeupsy 2 Elizabeth Jennings a 1 aoufey  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}