{"link": "https://www.themoviedb.org/tv/10377?language=en", "title": "One Step Beyond", "resume": "Alcoa Presents: One Step Beyond is an American anthology series created by Merwin Gerard. The original series ran for three seasons on ABC from January 1959 to July 1961.", "rate": 75, "genre": ["Mystery", "Drama", "Sci-Fi", "Fantasy"], "cast": ["John Newland"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10377   Expand One Step Beyond   (1959) User Score Overview Alcoa Presents: One Step Beyond is an American anthology series created by Merwin Gerard. The original series ran for three seasons on ABC from January 1959 to July 1961. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Newland Full Cast & Crew Last Season One step beyond season 3 1960 | 37 Episodes Season 3 of One Step Beyond premiered on August 30, 1960. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Every episode is a matter of human record! Open 0 by Zürich Gnome\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on One Step Beyond. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Mystery Drama Sci-Fi & Fantasy Keywords anthology horror anthology Content Score 56 We're so close, yet so far. Top Contributors z 10 zurman1 3 Steve 2 Zlogorek 2 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}