{"link": "https://www.themoviedb.org/tv/1941?language=en", "title": "GARO", "resume": "\"Where there is light, shadows lurk and fear reigns. But by the blade of Knights, Mankind was given hope.\"\nThe Makai fight a secret war against the demon forces known as Horrors, evil creatures that manifest themselves through darkness to devour Humanity. On the frontlines are the Makai Knights, given the task of watching over a district and eliminating any Horrors that manifest there.\nGARO follows the tales of the Knights bearing the title of ‘Golden Knight Garo’, and their duty to vanquish the Horrors and protect Humanity from the darkness.", "rate": 90, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Yukijiro Hotaru"], "character": ["Gonza Kurahashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1941   Expand GARO   (2005) User Score Overview \"Where there is light, shadows lurk and fear reigns. But by the blade of Knights, Mankind was given hope.\" The Makai fight a secret war against the demon forces known as Horrors, evil creatures that manifest themselves through darkness to devour Humanity. On the frontlines are the Makai Knights, given the task of watching over a district and eliminating any Horrors that manifest there. GARO follows the tales of the Knights bearing the title of ‘Golden Knight Garo’, and their duty to vanquish the Horrors and protect Humanity from the darkness. Featured Crew Keita Amemiya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yukijiro Hotaru Gonza Kurahashi Full Cast & Crew Last Season Makai Retsuden 2016 | 12 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply There are no discussions for GARO. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on GARO. You can help by rating TV shows you've seen. Facts Original Name  牙狼＜GARO＞ Status  Returning Series Networks Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   https://garo-project.jp/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords tokusatsu garo makai knight Content Score 64 We're so close, yet so far. Top Contributors 216 miryoku J 103 Jenn 100 liteignited 11 J.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}