{"link": "https://www.themoviedb.org/tv/39650?language=en", "title": "The Cinder Path", "resume": "In a heroic journey of epic proportions, English everyman Charlie McFell (Lloyd Owen) wrestles with his demons -- including a coldhearted wife (Catherine Zeta-Jones), economic hardship, the horror of the world's first Great War and a painful secret he'd rather forget. But Charlie eventually comes out on top in this emotional, made-for-television miniseries based on Catherine Cookson's best-selling novel.", "rate": 90, "genre": ["Drama"], "cast": ["Catherine Zeta-Jones", "Lloyd Owen", "Polly Adams", "Antony Byrne", "Ralph Ineson"], "character": ["Victoria Chapman", "Charlie MacFell", "Florence Chapman", "Ginger Slater", "Arthur Benton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39650   Expand The Cinder Path   (1994) User Score Overview In a heroic journey of epic proportions, English everyman Charlie McFell (Lloyd Owen) wrestles with his demons -- including a coldhearted wife (Catherine Zeta-Jones), economic hardship, the horror of the world's first Great War and a painful secret he'd rather forget. But Charlie eventually comes out on top in this emotional, made-for-television miniseries based on Catherine Cookson's best-selling novel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Catherine Zeta-Jones Victoria Chapman Lloyd Owen Charlie MacFell Polly Adams Florence Chapman Antony Byrne Ginger Slater Ralph Ineson Arthur Benton Full Cast & Crew Last Season Miniseries 1994 | 3 Episodes Season 1 of The Cinder Path premiered on April 17, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Cinder Path. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   https://itvstudios.com/programmes/catherine-cookson-s-the-cinder-path Genres Drama Keywords sibling relationship based on novel or book england world war i miniseries period drama 1910s 20th century Content Score 86 Almost there... Top Contributors R 23 Rebecca TB 20 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}