{"link": "https://www.themoviedb.org/tv/61208?language=en", "title": "Miss Korea", "resume": "This drama takes place in year 1997 and is about a failing cosmetics company that tries to turn a former high school beauty queen into Miss Korea. Oh Ji Young is the former high school beauty queen who has grown up to be nothing more an an elevator girl. Meanwhile, Kim Hyung Joon is an employee of the cosmetics company and will lead the efforts to turn Oh Ji Young into Miss Korea to save his company.", "rate": 0, "genre": ["Drama"], "cast": ["Lee Yeon-hee", "Lee Sun-kyun", "Lee Mi-sook", "Lee Sung-min", "Ko Sung-hee"], "character": ["Oh Ji-young", "Kim Hyung-joon", "Ma Ae-ri", "Teacher Jung", "Kim Jae-hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61208   Expand Miss Korea   (2013) User Score Overview This drama takes place in year 1997 and is about a failing cosmetics company that tries to turn a former high school beauty queen into Miss Korea. Oh Ji Young is the former high school beauty queen who has grown up to be nothing more an an elevator girl. Meanwhile, Kim Hyung Joon is an employee of the cosmetics company and will lead the efforts to turn Oh Ji Young into Miss Korea to save his company. Featured Crew Seo Sook-Hyang Creator Kwon Seok-Jang Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Yeon-hee Oh Ji-young Lee Sun-kyun Kim Hyung-joon Lee Mi-sook Ma Ae-ri Lee Sung-min Teacher Jung Ko Sung-hee Kim Jae-hee Full Cast & Crew Last Season Season 1 2013 | 20 Episodes Season 1 of Miss Korea premiered on December 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Miss Korea. You can help by rating TV shows you've seen. Facts Original Name  미스코리아 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.imbc.com/broad/tv/drama/miko/ Genres Drama Keywords korea Content Score 93 Almost there... Top Contributors M 51 Maria180493 c 6 creativo N 2 Nightowl.Kr 2 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}