{"link": "https://www.themoviedb.org/tv/2430?language=en", "title": "Doc Martin", "resume": "Doc Martin is a British television comedy drama series starring Martin Clunes in the title role. It was created by Dominic Minghella after the character of Dr. Martin Bamford in the 2000 comedy film Saving Grace. The show is set in the fictional seaside village of Portwenn and filmed on location in the village of Port Isaac, Cornwall, England, with most interior scenes shot in a converted local barn. Five series aired between 2004 and 2011, together with a feature-length special that aired on Christmas Day 2006. Series 6 began airing on ITV on 2 September 2013.", "rate": 82, "genre": ["Comedy", "Drama"], "cast": ["Martin Clunes", "Caroline Catz", "Joe Absolom", "Ian McNeice", "Selina Cadell"], "character": ["Dr. Martin Ellingham", "Louisa Glasson", "Al Large", "Bert Large", "Mrs Tishell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2430   Expand Doc Martin   (2004) User Score  Play Trailer Overview Doc Martin is a British television comedy drama series starring Martin Clunes in the title role. It was created by Dominic Minghella after the character of Dr. Martin Bamford in the 2000 comedy film Saving Grace. The show is set in the fictional seaside village of Portwenn and filmed on location in the village of Port Isaac, Cornwall, England, with most interior scenes shot in a converted local barn. Five series aired between 2004 and 2011, together with a feature-length special that aired on Christmas Day 2006. Series 6 began airing on ITV on 2 September 2013. Featured Crew Dominic Minghella Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martin Clunes Dr. Martin Ellingham Caroline Catz Louisa Glasson Joe Absolom Al Large Ian McNeice Bert Large Selina Cadell Mrs Tishell Full Cast & Crew Last Season Season 8 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Two More Seasons before Doc Martin retires Open 8 by  CaseyJones Doc Martin Season 8 Premieres Thursday Sept. 21 Open 0 by CaseyJones\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  12 Recommendations   2010-01-06 Republic of Doyle 7.3    2006-10-10 Intelligence 8.3    2016-12-08 The Cuba Libre Story 7.7    2015-09-08 Apaches 7.3    2008-10-20 Danny Dyer's Deadliest Men 7.0    2017-09-20 Tiempos de guerra 7.0    2016-07-05 Fangbone! 6.7    1994-11-10 The Vicar of Dibley 7.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage   http://www.itv.com/docmartin/ Genres Comedy Drama Keywords small village british humour general practitioner (gp) Content Score 100 Yes! Looking good! Top Contributors m 23 miro22 r 16 rick555 S 15 Shady12 11 Philippe LeMarchand  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}