{"link": "https://www.themoviedb.org/tv/79423?language=en", "title": "Spark", "resume": "'Spark' is a mini music drama like a night concert in the summertime, centering on a man who leaks a great deal of electricity after a sudden accident and a woman he can't get away from no matter how hard he tries", "rate": 0, "genre": ["Drama"], "cast": ["Na Jong Chan", "Yeo Chang Gu", "Nam Bo-ra", "Joo Da-young"], "character": ["Yoon Ga Ohn", "Ji Seung", "Son Ha Neul", "Won Jae Kyung"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79423   Expand Spark   (2016) User Score Overview 'Spark' is a mini music drama like a night concert in the summertime, centering on a man who leaks a great deal of electricity after a sudden accident and a woman he can't get away from no matter how hard he tries Featured Crew Moon Ji Young Creator Moon Man Se Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Na Jong Chan Yoon Ga Ohn Yeo Chang Gu Ji Seung Nam Bo-ra Son Ha Neul Joo Da-young Won Jae Kyung Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Spark premiered on July 25, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Spark. You can help by rating TV shows you've seen. Facts Original Name  스파크 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 24 Chelsea  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}