{"link": "https://www.themoviedb.org/tv/3083?language=en", "title": "Shootout!", "resume": "Shootout! was a documentary series featured on The History Channel and ran for two seasons from 2005 to 2006. It depicts actual firefights between United States military personnel and other combatants. There are also occasional episodes dedicated to police or S.W.A.T. team firefights, as well as Wild West shootouts. It also now has a feature of downloading and playing a first-person shooter detailing some of the battles. The battles include skirmishes from World War II, the Vietnam War, and the ongoing War on Terror in Afghanistan and during the 2003-2010 Iraq War. Season 1 was produced for The History Channel by Greystone Communications and Season 2 was produced by Flight 33 Productions. The series was created by Dolores Gavin and Louis Tarantino.", "rate": 70, "genre": ["Documentary"], "cast": ["Erik Thompson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3083   Expand Shootout!   (2005) User Score Overview Shootout! was a documentary series featured on The History Channel and ran for two seasons from 2005 to 2006. It depicts actual firefights between United States military personnel and other combatants. There are also occasional episodes dedicated to police or S.W.A.T. team firefights, as well as Wild West shootouts. It also now has a feature of downloading and playing a first-person shooter detailing some of the battles. The battles include skirmishes from World War II, the Vietnam War, and the ongoing War on Terror in Afghanistan and during the 2003-2010 Iraq War. Season 1 was produced for The History Channel by Greystone Communications and Season 2 was produced by Flight 33 Productions. The series was created by Dolores Gavin and Louis Tarantino. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erik Thompson Full Cast & Crew Last Season Season 2 2006 | 9 Episodes Season 2 of Shootout! premiered on November  3, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Shootout!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.history.com/minisites/shootout Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}