{"link": "https://www.themoviedb.org/tv/4223?language=en", "title": "Cagney & Lacey", "resume": "Mary Beth Lacey and Chris Cagney are teamed up as NYPD police detectives. Their opposing personalities (one is tough and the other sensitive) mesh to make this one of the great crime-fighting duos of all time.", "rate": 66, "genre": ["Crime", "Drama"], "cast": ["Carl Lumbly", "Al Waxman", "Tyne Daly", "Sharon Gless", "Harvey Atkin"], "character": ["Mark Petrie", "Lieutenant Bert Samuels", "Mary Beth Lacey", "Christine Cagney", "Sergent Ronald Coleman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4223   Expand Cagney & Lacey   (1982) User Score  Play Trailer Overview Mary Beth Lacey and Chris Cagney are teamed up as NYPD police detectives. Their opposing personalities (one is tough and the other sensitive) mesh to make this one of the great crime-fighting duos of all time. Featured Crew Barbara Corday Creator Barbara Avedon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carl Lumbly Mark Petrie Al Waxman Lieutenant Bert Samuels Tyne Daly Mary Beth Lacey Sharon Gless Christine Cagney Harvey Atkin Sergent Ronald Coleman Full Cast & Crew Last Season Season 7 1987 | 22 Episodes Season 7 of Cagney & Lacey premiered on September 21, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Sergeant Ronald Coleman: Harvey Atkin R.I.P. Open 1 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   1990-06-28 Waiting for God 7.8    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1977-09-20 Lou Grant 6.2    1986-09-15 L.A. Law 7.2    1981-01-16 Harper Valley 4.7    1987-04-05 The Tracey Ullman Show 6.0    1964-09-24 Daniel Boone 5.9    1961-10-02 Ben Casey 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Crime Drama Keywords new york police detective nypd female detective Content Score 100 Yes! Looking good! Top Contributors m 34 mccalimero62 9 lineker 9 Banana 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}