{"link": "https://www.themoviedb.org/tv/19524?language=en", "title": "Combat Mecha Xabungle", "resume": "Combat Mecha Xabungle, infrequently called Blue Gale Xabungle, is a mecha anime television series by Sunrise, and directed by Yoshiyuki Tomino. It was broadcast on the Nagoya TV and TV Asahi networks at 5:30 PM each Saturday from February 6, 1982 through January 29, 1983. Promotional toys were produced by Clover. It also had a compilation movie called Xabungle Graffiti, which added a few minutes and a whole-new ending to the series.", "rate": 0, "genre": ["Animation", "Drama"], "cast": ["Kenichi Ogata", "Shinya Ōtaki", "Saeko Shimazu", "Tarako", "Toshio Furukawa"], "character": ["Kashim King (voice)", "Jiron Amos (voice)", "Rag (voice)", "Chil (voice)", "Bulme (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19524   Expand Combat Mecha Xabungle User Score Overview Combat Mecha Xabungle, infrequently called Blue Gale Xabungle, is a mecha anime television series by Sunrise, and directed by Yoshiyuki Tomino. It was broadcast on the Nagoya TV and TV Asahi networks at 5:30 PM each Saturday from February 6, 1982 through January 29, 1983. Promotional toys were produced by Clover. It also had a compilation movie called Xabungle Graffiti, which added a few minutes and a whole-new ending to the series. Featured Crew Hajime Yatate Creator Yoshiyuki Tomino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenichi Ogata Kashim King (voice) Shinya Ōtaki Jiron Amos (voice) Saeko Shimazu Rag (voice) Tarako Chil (voice) Toshio Furukawa Bulme (voice) Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Facts Original Name  戦闘メカ ザブングル Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage  - Genres Animation Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors t 18 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}