{"link": "https://www.themoviedb.org/tv/67743?language=en", "title": "Cardinal", "resume": "Detective John Cardinal attempts to uncover the mystery of what happened to the missing 13-year-old girl whose body is discovered in the shaft-head of an abandoned mine. At the same time, he comes under investigation by his new partner, Lise Delorme, a tough investigator in her own right.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["Billy Campbell", "Karine Vanasse", "Kristen Thomson", "David Richmond-Peck", "Glen Gould"], "character": ["John Cardinal", "Lise Delorme", "Noelle Dyson", "Corporal Malcolm Musgrave", "Jerry Commanda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67743   Expand Cardinal   (2017) User Score  Play Trailer Overview Detective John Cardinal attempts to uncover the mystery of what happened to the missing 13-year-old girl whose body is discovered in the shaft-head of an abandoned mine. At the same time, he comes under investigation by his new partner, Lise Delorme, a tough investigator in her own right. Featured Crew Daniel Grou Creator Jeff Renfroe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billy Campbell John Cardinal Karine Vanasse Lise Delorme Kristen Thomson Noelle Dyson David Richmond-Peck Corporal Malcolm Musgrave Glen Gould Jerry Commanda Full Cast & Crew Current Season Blackfly Season 2018 | 6 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Season 2 coming Jan 4, 2018 Open 1 by  lonegunman o Eric ( spoiler) Open 1 by  walking_bread w Viewers ? Open 0 by walking_bread\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2011-06-06 Injustice 7.3    2006-01-01 In Justice 6.8    2012-01-02 Endeavour 8.1    2015-04-15 The Delivery Man 6.5    2011-01-13 Kidnap and Ransom 7.6    2016-06-08 Power Monkeys 7.0    2016-10-16 Berlin Station 7.4    2014-09-28 The Brokenwood Mysteries 7.6  Facts Status  Returning Series Network Certification 14+ Meaning Programming intended for viewers ages 14 and older. May contain strong violence and strong profanity, and depictions of sexual activity as long as they are within the context of a story. Type  Scripted Original Language  English Runtime  42m, 44m Homepage   http://ctv.ca/Cardinal Genres Crime Drama Keywords canada based on novel or book ontario canada police detective murder investigation child murder murder mystery Content Score 100 Yes! Looking good! Top Contributors 84 Banana B 8 BelDave69 t 5 tmdb42368388 5 Mervan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}