{"link": "https://www.themoviedb.org/tv/71760?language=en", "title": "The iDOLM@STER.KR", "resume": "Only those who survive can make their debut as a girl group! The series follows the story of 11 girls as they fiercely compete and undergo vigorous training to become idol stars.", "rate": 60, "genre": ["Drama"], "cast": ["Jane Cheon", "Lee Yeeun", "Lee Suji", "Haseo Kwon", "Sung Hoon"], "character": ["Kang Shin Jyuk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71760   Expand The iDOLM@STER.KR   (2017) User Score Overview Only those who survive can make their debut as a girl group! The series follows the story of 11 girls as they fiercely compete and undergo vigorous training to become idol stars. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jane Cheon Lee Yeeun Lee Suji Haseo Kwon Sung Hoon Kang Shin Jyuk Full Cast & Crew Last Season Season 1 2017 | 24 Episodes Season 1 of The iDOLM@STER.KR premiered on April 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The iDOLM@STER.KR. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.idolmaster-kr.com Genres Drama Keywords music idol south korea based on anime Content Score 86 Almost there... Top Contributors 25 Marr 🇳🇱 14 sojuoppa 10 dgw 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}