{"link": "https://www.themoviedb.org/tv/7222?language=en", "title": "Uti vår hage", "resume": "Uti vår hage was a Norwegian sketch comedy television program which had two different runs on TV in 2003 and 2008 on the Norwegian state channel NRK. The show starred the three well-known comedians: Atle Antonsen, Harald Eia and Bård Tufte Johansen. The format of the show was one main storyline that would gradually branch off into several separate minor storylines. Two series of the show have been produced, and the second series carries the title Uti vår hage 2. The show has introduced popular characters like \"Lena\" from Døden på Oslo S and \"Oslolosen\". The first season consisted of six episodes and was first broadcast in September and October 2003, while the second season was aired in January – March 2008, with seven ordinary episodes and one special. The first season was the first occasion where the three comedians worked together.", "rate": 100, "genre": ["Comedy"], "cast": ["Atle Antonsen", "Harald Eia", "Bård Tufte Johansen"], "character": ["Various", "Various", "Various"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7222   Expand Uti vår hage   (2003) User Score Overview Uti vår hage was a Norwegian sketch comedy television program which had two different runs on TV in 2003 and 2008 on the Norwegian state channel NRK. The show starred the three well-known comedians: Atle Antonsen, Harald Eia and Bård Tufte Johansen. The format of the show was one main storyline that would gradually branch off into several separate minor storylines. Two series of the show have been produced, and the second series carries the title Uti vår hage 2. The show has introduced popular characters like \"Lena\" from Døden på Oslo S and \"Oslolosen\". The first season consisted of six episodes and was first broadcast in September and October 2003, while the second season was aired in January – March 2008, with seven ordinary episodes and one special. The first season was the first occasion where the three comedians worked together. Featured Crew Harald Eia Creator Atle Antonsen Creator Bård Tufte Johansen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Atle Antonsen Various Harald Eia Various Bård Tufte Johansen Various Full Cast & Crew Last Season Season 2 2008 | 8 Episodes Season 2 of Uti vår hage premiered on January 10, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Uti vår hage. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Norwegian Runtime  30m, 28m Homepage   http://www.nrk.no/programmer/tv/uti_var_hage/ Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors M 7 Mr_Democracy 6 prostapostei 4 Bendik TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}