{"link": "https://www.themoviedb.org/tv/31581?language=en", "title": "Os Trapalhões", "resume": "Os Trapalhões was a Brazilian comedy group and also a Brazilian television series created by Wilton Franco. Its members were Dedé Santana, Zacarias, Mussum and their leader Didi Mocó, that was played by Renato Aragão. The name Trapalhões is derived from the Portuguese verb atrapalhar, which means the opposite of helping, to do something the wrong way or to Those that confuse. The name is translated \"Tramps\" in English DVD subtitles. It was aired by Rede Globo from 1977 to 1999.\nOn March 18, 1990, Zacarias died due to respiratory failure, but the group and the series didn't come to an end until July 29, 1994, when Mussum died due to an unsuccessful heart transplant.", "rate": 65, "genre": ["Comedy"], "cast": ["Renato Aragão", "Dedé Santana", "Mussum", "Zacarias"], "character": ["Didi Mocó", "Dedé Santana", "Mussum", "Zacarias"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31581   Expand Os Trapalhões   (1977) User Score Overview Os Trapalhões was a Brazilian comedy group and also a Brazilian television series created by Wilton Franco. Its members were Dedé Santana, Zacarias, Mussum and their leader Didi Mocó, that was played by Renato Aragão. The name Trapalhões is derived from the Portuguese verb atrapalhar, which means the opposite of helping, to do something the wrong way or to Those that confuse. The name is translated \"Tramps\" in English DVD subtitles. It was aired by Rede Globo from 1977 to 1999. On March 18, 1990, Zacarias died due to respiratory failure, but the group and the series didn't come to an end until July 29, 1994, when Mussum died due to an unsuccessful heart transplant. Featured Crew Wilton Franco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Renato Aragão Didi Mocó Dedé Santana Dedé Santana Mussum Mussum Zacarias Zacarias Full Cast & Crew Last Season Season 1 1977 | 1 Episode Season 1 of Os Trapalhões premiered on March 13, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Os Trapalhões. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  60m Homepage   http://memoriaglobo.globo.com/programas/entretenimento/humor/os-trapalhoes.htm Genres Comedy Keywords satire sketch comedy sitcom Content Score 100 Yes! Looking good! Top Contributors 38 RubeensVinicius 21 Renato TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}