{"link": "https://www.themoviedb.org/tv/18927?language=en", "title": "The Second World War in Colour", "resume": "The Second World War In Colour [1999] is a three-part documentary which reveals hours of previously unseen colour film of World War II. As almost all newsreel film was shot in black and white, this DVD offers a completely new portrait of the war. Dramatic colour footage from as early as 1933 shows home movies of Adolf Hitler and his cohorts, the devastation wrought by the Blitzkrieg, life on the home front, D-Day and the Allied invasion of France, British bombers defying German fighters, the horror of the Holocaust that troops met as they entered Germany, and the jubilation of the final Allied victory. With John Thaw's narration intercut with spoken accounts from the letters and diaries of those who fought, those who survived, and those the war claimed as victims, this documentary is an extraordinary remembrance of a monumental time in world history.", "rate": 80, "genre": ["Documentary"], "cast": ["John Thaw"], "character": ["Himself - Narrator"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18927   Expand The Second World War in Colour   (1999) User Score Overview The Second World War In Colour [1999] is a three-part documentary which reveals hours of previously unseen colour film of World War II. As almost all newsreel film was shot in black and white, this DVD offers a completely new portrait of the war. Dramatic colour footage from as early as 1933 shows home movies of Adolf Hitler and his cohorts, the devastation wrought by the Blitzkrieg, life on the home front, D-Day and the Allied invasion of France, British bombers defying German fighters, the horror of the Holocaust that troops met as they entered Germany, and the jubilation of the final Allied victory. With John Thaw's narration intercut with spoken accounts from the letters and diaries of those who fought, those who survived, and those the war claimed as victims, this documentary is an extraordinary remembrance of a monumental time in world history. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Thaw Himself - Narrator Full Cast & Crew Last Season Season 1 1999 | 3 Episodes Season 1 of The Second World War in Colour premiered on September  8, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Second World War in Colour. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres Documentary Keywords world war ii Content Score 56 We're so close, yet so far. Top Contributors 40 Banana 3 sambassador  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}