{"link": "https://www.themoviedb.org/tv/2699?language=en", "title": "Japanorama", "resume": "Japanorama was a series of documentaries presented by Jonathan Ross, exploring various facets of popular culture and trends of modern-day Japan.\nEach episode had a theme, around which he presented cultural phenomena, films, music, and art that exemplify facets of Japan. The series was colourful in both its creative use of subject matter, and its use of bright colours that helped accent the action on screen rather than distract from it. Subjects were separated by eye catches that often featured the artwork of Junko Mizuno. Ross hosted each episode in suits so bright and stylised they could have been stolen from an anime character.\nFans have credited the series for the care that both Ross and the BBC have placed in its production. Time was given to delve into each subject, and he was able to interview various figureheads of culture and industry, including Mamoru Oshii, Hayao Miyazaki, Takeshi Kitano, Takashi Miike with Takashi Murakami and Sonny Chiba.\nThe theme song of the show was Kiyoshi no zundoko bushi by Kiyoshi Hikawa.", "rate": 70, "genre": ["Documentary", "News", "Comedy"], "cast": ["Jonathan Ross"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2699   Expand Japanorama   (2002) User Score Overview Japanorama was a series of documentaries presented by Jonathan Ross, exploring various facets of popular culture and trends of modern-day Japan. Each episode had a theme, around which he presented cultural phenomena, films, music, and art that exemplify facets of Japan. The series was colourful in both its creative use of subject matter, and its use of bright colours that helped accent the action on screen rather than distract from it. Subjects were separated by eye catches that often featured the artwork of Junko Mizuno. Ross hosted each episode in suits so bright and stylised they could have been stolen from an anime character. Fans have credited the series for the care that both Ross and the BBC have placed in its production. Time was given to delve into each subject, and he was able to interview various figureheads of culture and industry, including Mamoru Oshii, Hayao Miyazaki, Takeshi Kitano, Takashi Miike with Takashi Murakami and Sonny Chiba. The theme song of the show was Kiyoshi no zundoko bushi by Kiyoshi Hikawa. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Ross Host Full Cast & Crew Last Season Season 3 2007 | 6 Episodes Season 3 of Japanorama premiered on March 19, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Japanorama. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Documentary News Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}