{"link": "https://www.themoviedb.org/tv/33941?language=en", "title": "71 Degrees North", "resume": "71 Degrees North is a TV series on ITV which began broadcasting on 11 September 2010. 10 celebrities must battle it out to see who will make it to the 71st parallel north, with challenges along the way. Mazda formerly sponsored the show, Continental tires are the current sponsors. The show is based on the Norwegian format 71° nord, which has been broadcast on TVNorge since 1999, and adapted in Sweden, Denmark, Poland, Holland, and Belgium. The format is distributed by Banijay International.\nIn the UK, the show is made by London-based production company Fever Media and finished broadcasting its first series on 2 November 2010. The show is aired at 9 pm on Tuesday nights. Series 1 hosts were Gethin Jones and Kate Thornton. Marcus Patric was crowned champion after a closely fought final with Gavin Henson in the first series.\nA second series was commissioned by ITV and started airing on 13 September 2011 hosted by Paddy McGuinness and Charlotte Jackson with 12 celebrities taking part. As with the first series, the second series airs on Tuesday evenings at 9 pm. In 2011, six countries acquired both series of the UK version. They were: TV Norge, Network Ten in Australia, TVNZ in New Zealand, Sic in Portugal, TV5 in Finland and Évasion in Canada.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33941   Expand 71 Degrees North   (2010) User Score Overview 71 Degrees North is a TV series on ITV which began broadcasting on 11 September 2010. 10 celebrities must battle it out to see who will make it to the 71st parallel north, with challenges along the way. Mazda formerly sponsored the show, Continental tires are the current sponsors. The show is based on the Norwegian format 71° nord, which has been broadcast on TVNorge since 1999, and adapted in Sweden, Denmark, Poland, Holland, and Belgium. The format is distributed by Banijay International. In the UK, the show is made by London-based production company Fever Media and finished broadcasting its first series on 2 November 2010. The show is aired at 9 pm on Tuesday nights. Series 1 hosts were Gethin Jones and Kate Thornton. Marcus Patric was crowned champion after a closely fought final with Gavin Henson in the first series. A second series was commissioned by ITV and started airing on 13 September 2011 hosted by Paddy McGuinness and Charlotte Jackson with 12 celebrities taking part. As with the first series, the second series airs on Tuesday evenings at 9 pm. In 2011, six countries acquired both series of the UK version. They were: TV Norge, Network Ten in Australia, TVNZ in New Zealand, Sic in Portugal, TV5 in Finland and Évasion in Canada. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 18 2016 | 2 Episodes Season 18 of 71 Degrees North premiered on August 29, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on 71 Degrees North. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.itv.com/71degreesnorth Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors L 2 Luandri BH 1 Budi Hideung  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}