{"link": "https://www.themoviedb.org/tv/14872?language=en", "title": "Mother and Son", "resume": "Mother and Son was a multiple Logie Award-winning Australian television sitcom produced by the Australian Broadcasting Corporation from 16 January 1984 until 21 March 1994. The show stars Ruth Cracknell, Garry McDonald, Henri Szeps and Judy Morris. It was created and written by Geoffrey Atherden AM. Its classic theme song features the Tasmanian Symphony Orchestra, playing to I Want a Girl, a jazz standard which was recorded by Al Jolson in the 1920s.", "rate": 0, "genre": ["Comedy"], "cast": ["Garry McDonald", "Ruth Cracknell", "Henri Szeps", "Judy Morris"], "character": ["Arthur Beare", "Maggie Beare"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14872   Expand Mother and Son   (1984) User Score Overview Mother and Son was a multiple Logie Award-winning Australian television sitcom produced by the Australian Broadcasting Corporation from 16 January 1984 until 21 March 1994. The show stars Ruth Cracknell, Garry McDonald, Henri Szeps and Judy Morris. It was created and written by Geoffrey Atherden AM. Its classic theme song features the Tasmanian Symphony Orchestra, playing to I Want a Girl, a jazz standard which was recorded by Al Jolson in the 1920s. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Garry McDonald Arthur Beare Ruth Cracknell Maggie Beare Henri Szeps Judy Morris Full Cast & Crew Last Season Season 1 1984 | 22 Episodes Season 1 of Mother and Son premiered on January 16, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Mother and Son. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}