{"link": "https://www.themoviedb.org/tv/64554?language=en", "title": "BrainDead", "resume": "A young fresh-faced Hill staffer gets her first job in Washington, D.C. and discovering two things: 1. The government has stopped working, and 2. alien spawn have come to earth and eaten the brains of a growing number of Congressmen and Hill staffers.", "rate": 72, "genre": ["Sci-Fi", "Fantasy", "Drama", "Comedy"], "cast": ["Mary Elizabeth Winstead", "Danny Pino", "Aaron Tveit", "Tony Shalhoub", "Nikki M. James"], "character": ["Laurel Healy", "Luke Healy", "Gareth Ritter", "Senator Red Wheatus", "Rochelle Daudier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64554   Expand BrainDead   (2016) User Score Overview A young fresh-faced Hill staffer gets her first job in Washington, D.C. and discovering two things: 1. The government has stopped working, and 2. alien spawn have come to earth and eaten the brains of a growing number of Congressmen and Hill staffers. Featured Crew Michelle King Creator Robert King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Mary Elizabeth Winstead Laurel Healy Danny Pino Luke Healy Aaron Tveit Gareth Ritter Tony Shalhoub Senator Red Wheatus Nikki M. James Rochelle Daudier Full Cast & Crew Last Season Season 1 2016 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply enjoyed it Open 9 by  violet75 Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2016-03-07 Damien 6.5    2015-09-30 You, Me and the Apocalypse 7.2    2016-01-22 Stan Lee's Lucky Man 7.3    2008-03-10 The Fixer 7.6    2010-08-25 Spirited 8.0    2016-10-27 The Great Indoors 5.3    2016-09-23 The Exorcist 7.2    2014-08-05 Sequestered 6.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.cbs.com/shows/braindead/ Genres Sci-Fi & Fantasy Drama Comedy Keywords washington d.c. government politics alien usa politics Content Score 100 Yes! Looking good! Top Contributors 41 Elizabeth Jennings R 26 Rebecca 14 Banana x 4 xxstranger  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}