{"link": "https://www.themoviedb.org/tv/54310?language=en", "title": "Plastic Nee-san", "resume": "Based on Kurii Cha's gag comedy manga, Plastic Nee-san is a very short anime that follows a third-year high school girl who likes building plastic models and the wacky conversations she has with her fellow club members.", "rate": 65, "genre": ["Animation", "Comedy"], "cast": ["Mari Kanou", "Yumi Uchiyama", "Marina Inoue"], "character": ["Iroe Genma (voice)", "Hazuki Okamoto (voice)", "Makina Sakamaki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54310   Expand Plastic Nee-san   (2011) User Score Overview Based on Kurii Cha's gag comedy manga, Plastic Nee-san is a very short anime that follows a third-year high school girl who likes building plastic models and the wacky conversations she has with her fellow club members. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mari Kanou Iroe Genma (voice) Yumi Uchiyama Hazuki Okamoto (voice) Marina Inoue Makina Sakamaki (voice) Full Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of Plastic Nee-san premiered on May 16, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Plastic Nee-san. You can help by rating TV shows you've seen. Facts Original Name  ＋チック姉さん Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  2m Homepage  - Genres Animation Comedy Keywords anime short Content Score 56 We're so close, yet so far. Top Contributors 28 Nuno Filipe de Vilhena Santos 11 CrewMdk 3 seboseboss f 2 franfac  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}