{"link": "https://www.themoviedb.org/tv/77071?language=en", "title": "Derren Brown: Fear and Faith", "resume": "An extraordinary look at what happens when people have the experience of fear removed through the use of a powerful new drug. Derren examines the psychology of religious belief, performs a satanic rite and attempts to give an atheist a religious conversion.", "rate": 90, "genre": [], "cast": ["Derren Brown"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77071   Expand Derren Brown: Fear and Faith   (2012) User Score Overview An extraordinary look at what happens when people have the experience of fear removed through the use of a powerful new drug. Derren examines the psychology of religious belief, performs a satanic rite and attempts to give an atheist a religious conversion. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Derren Brown Himself Full Cast & Crew Last Season Miniseries 2012 | 2 Episodes Season 1 of Derren Brown: Fear and Faith premiered on November  8, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Derren Brown: Fear and Faith. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 13 Banana TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}