{"link": "https://www.themoviedb.org/tv/20710?language=en", "title": "Angry Kid", "resume": "Angry Kid is the main character of a series of British stop motion animation short films, voiced by Darren Walsh. The show was created, directed, written, and designed by Darren Walsh and produced by Aardman Animations. Most of the episodes contain adult content.\nUnlike most Aardman productions, Angry Kid was not created using clay animation but a combination of pixilation and stop motion puppetry.\nSeasons 1 and 2 have been released on DVD in the UK and Australia. All the Angry Kid animations are free to watch and / or download on Atom.com. A compilation DVD called Aardman's Dark Side was also released, and it contains several Season 2 episodes and an exclusive episode.", "rate": 100, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20710   Expand Angry Kid   (1999) User Score Overview Angry Kid is the main character of a series of British stop motion animation short films, voiced by Darren Walsh. The show was created, directed, written, and designed by Darren Walsh and produced by Aardman Animations. Most of the episodes contain adult content. Unlike most Aardman productions, Angry Kid was not created using clay animation but a combination of pixilation and stop motion puppetry. Seasons 1 and 2 have been released on DVD in the UK and Australia. All the Angry Kid animations are free to watch and / or download on Atom.com. A compilation DVD called Aardman's Dark Side was also released, and it contains several Season 2 episodes and an exclusive episode. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Angry Kid. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}