{"link": "https://www.themoviedb.org/tv/20409?language=en", "title": "Son of the Dragon", "resume": "When the Royal Family decides to accept suitors for the hand of Princess Li Wei, a young thief who calls himself 'Devil Boy' decides to pose as a prince in order to swipe the crown jewels. To his surprise, he ends up genuinely falling in love with the young woman, placing himself and his faithful servant in the crosshairs of the dangerous Prince of the North.", "rate": 61, "genre": [], "cast": ["David Carradine", "John Reardon", "Desiree Ann Siahaan", "Rupert Graves", "Lim Kay Tong"], "character": ["Bird", "D.B. (Devil Boy)", "Prinzessin Li Wei", "Prinzen des Nordens", "Gouverneur"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20409   Expand Son of the Dragon   (2008) User Score Overview When the Royal Family decides to accept suitors for the hand of Princess Li Wei, a young thief who calls himself 'Devil Boy' decides to pose as a prince in order to swipe the crown jewels. To his surprise, he ends up genuinely falling in love with the young woman, placing himself and his faithful servant in the crosshairs of the dangerous Prince of the North. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Carradine Bird John Reardon D.B. (Devil Boy) Desiree Ann Siahaan Prinzessin Li Wei Rupert Graves Prinzen des Nordens Lim Kay Tong Gouverneur Full Cast & Crew Last Season Miniseries 2006 | 2 Episodes Season 1 of Son of the Dragon premiered on December 26, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Son of the Dragon. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  - Homepage   https://sonarent.com/titles/son-of-the-dragon Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors TB 38 TMDb Bot 8 Banana c 2 culssw f 1 franv01  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}