{"link": "https://www.themoviedb.org/tv/44256?language=en", "title": "The Adventures of the Mole", "resume": "Created by Czech director and animator Zdeněk Miler in 1956, Krtek, or The Mole in English, was an international hit with children. Because the cartoons were presented with no dialogue, Krtek was held to no national boundaries.\nMilers daughter voiced the noises and grunts that Krtek made, and gave Miler the feedback from a child's perspective he needed to keep his stories focus on his young fans.", "rate": 69, "genre": ["Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44256   Expand The Adventures of the Mole   (1957) User Score Overview Created by Czech director and animator Zdeněk Miler in 1956, Krtek, or The Mole in English, was an international hit with children. Because the cartoons were presented with no dialogue, Krtek was held to no national boundaries. Milers daughter voiced the noises and grunts that Krtek made, and gave Miler the feedback from a child's perspective he needed to keep his stories focus on his young fans. Featured Crew Zdeněk Miler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  6 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1957 | 61 Episodes Season 1 of The Adventures of the Mole premiered on January  1, 1957. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for The Adventures of the Mole. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  13 Recommendations   1995-09-08 Timon & Pumbaa 5.7    1992-09-05 Goof Troop 6.5    1969-01-01 Nu, pogodi! 6.8    1994-09-05 Aladdin 6.2    1995-09-09 The Sylvester & Tweety Mysteries 7.3    1976-06-04 Twelve Chairs 7.5    1998-08-31 Hercules 5.3    2003-09-20 Lilo & Stitch: The Series 6.0  Facts Original Name  Krtkova dobrodružství Status  Ended Network Certification  - Type  Scripted Original Language  Czech Runtime  - Homepage  - Genres Animation Kids Keywords mole animal lead Content Score 64 We're so close, yet so far. Top Contributors 23 Hollul 16 golibali S 9 Samara C 8 Cheiz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}