{"link": "https://www.themoviedb.org/tv/5537?language=en", "title": "The Factory", "resume": "Factory was a comedy television series. It premiered on Sunday, 29 June 2008 at 10:00 p.m. Eastern/9:00 p.m. Central on Spike. The series, produced by 3 Arts Entertainment, is directed by and stars Mitch Rouse and fellow comedians Michael Coleman, Jay Leggett and David Pasquesi. The pilot episode of the show has been made available free on iTunes.\nThe show starred and was produced by Mitch Rouse, formerly of According To Jim.", "rate": 0, "genre": ["Comedy"], "cast": ["Michael Coleman", "Jay Leggett", "Mitch Rouse", "David Pasquesi"], "character": ["Chase", "Gus", "Gary", "Smitty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5537   Expand The Factory   (2008) User Score Overview Factory was a comedy television series. It premiered on Sunday, 29 June 2008 at 10:00 p.m. Eastern/9:00 p.m. Central on Spike. The series, produced by 3 Arts Entertainment, is directed by and stars Mitch Rouse and fellow comedians Michael Coleman, Jay Leggett and David Pasquesi. The pilot episode of the show has been made available free on iTunes. The show starred and was produced by Mitch Rouse, formerly of According To Jim. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Coleman Chase Jay Leggett Gus Mitch Rouse Gary David Pasquesi Smitty Full Cast & Crew Last Season Season 1 2008 | 6 Episodes Season 1 of The Factory premiered on June 29, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Factory. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.wizzard.tv/factory Genres Comedy Keywords factory male friendship improvisation Content Score 71 Just a little bit more... Top Contributors 19 Banana D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}