{"link": "https://www.themoviedb.org/tv/1682?language=en", "title": "Teletubbies", "resume": "Teletubbies is a British BBC children's television series targeted at pre-school viewers and produced from 31 March 1997 to 5 January 2001 by Ragdoll Productions. It was created by Ragdoll's creative director Anne Wood CBE and Andrew Davenport, who wrote each of the show's 365 episodes. The programme's original narrator was Tim Whitnall. Teletubbies was also aired internationally in the United States on the Public Broadcasting Service public television on 6 April 1998 and aired until 19 June 2005. It would continue to air reruns until 29 August 2008, when it was pulled from the schedule along with Mister Rogers Neighborhood and Boohbah. In 2002, production was cancelled and it was announced that no new episodes would be produced, with the last episode being aired on 5 January 2001. However, a total of 365 episodes had been produced – enough for a full year.\nTeletubbies, particularly notable for its high production values, rapidly became a critical and commercial success in Britain and abroad and won a BAFTA in 1998. Teletubbies Everywhere was awarded \"Best Pre-school Live Action Series\" at the 2002 Children's BAFTA Awards.\nAlthough the programme is aimed at children between the ages of one and four, it had a substantial cult following with older generations, mainly university and college students. The mixture of bright colours, unusual designs, repetitive non-verbal dialogue, ritualistic format, and the occasional forays into physical comedy appealed to many who perceived the programme as having psychedelic qualities. Teletubbies was controversial for this reason. Other critics felt the show was insufficiently educational.", "rate": 29, "genre": ["Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1682   Expand Teletubbies   (1997) User Score Overview Teletubbies is a British BBC children's television series targeted at pre-school viewers and produced from 31 March 1997 to 5 January 2001 by Ragdoll Productions. It was created by Ragdoll's creative director Anne Wood CBE and Andrew Davenport, who wrote each of the show's 365 episodes. The programme's original narrator was Tim Whitnall. Teletubbies was also aired internationally in the United States on the Public Broadcasting Service public television on 6 April 1998 and aired until 19 June 2005. It would continue to air reruns until 29 August 2008, when it was pulled from the schedule along with Mister Rogers Neighborhood and Boohbah. In 2002, production was cancelled and it was announced that no new episodes would be produced, with the last episode being aired on 5 January 2001. However, a total of 365 episodes had been produced – enough for a full year. Teletubbies, particularly notable for its high production values, rapidly became a critical and commercial success in Britain and abroad and won a BAFTA in 1998. Teletubbies Everywhere was awarded \"Best Pre-school Live Action Series\" at the 2002 Children's BAFTA Awards. Although the programme is aimed at children between the ages of one and four, it had a substantial cult following with older generations, mainly university and college students. The mixture of bright colours, unusual designs, repetitive non-verbal dialogue, ritualistic format, and the occasional forays into physical comedy appealed to many who perceived the programme as having psychedelic qualities. Teletubbies was controversial for this reason. Other critics felt the show was insufficiently educational. Featured Crew Anne Wood Creator Andrew Davenport Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Episode 15 2015 | 2 Episodes Season 15 of Teletubbies premiered on November  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1999-04-12 Bob the Builder 5.5    1997-10-20 Bear in the Big Blue House 7.2    1991-09-26 Brum 5.2    1992-07-20 Bananas in Pyjamas 3.3    1992-04-06 Barney & Friends 3.6    2004-12-18 W.I.T.C.H. 6.6    The Oprah Winfrey Show 4.1    1986-05-28 Pingu 6.5  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  25m, 30m, 28m Homepage   http://www.teletubbies.co.uk/ Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors R 3 Rebecca b 2 bllopis G 2 Grey20 2 Henrico Scaranello  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}