{"link": "https://www.themoviedb.org/tv/78519?language=en", "title": "Red Cynic", "resume": "A cynical Russian reviewer dissects popular shows in search of any possible logical flaws.", "rate": 100, "genre": ["Comedy", "Sci-Fi", "Fantasy", "Documentary", "War", "Politics"], "cast": ["Red Cynic", "Chertoznai"], "character": ["Red Cynic"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78519   Expand Red Cynic   (2011) User Score Overview A cynical Russian reviewer dissects popular shows in search of any possible logical flaws. Featured Crew Red Cynic Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Red Cynic Red Cynic Chertoznai Full Cast & Crew Last Season All Reviews 2011 | 49 Episodes View All Seasons Social Reviews  1 Discussions  0 A review by GAim4A  10.0 Written by  GAim4A  on April  2, 2018 One of the best if not THE BEST Russian movie reviewer. His fundamental knowledge of the source material, subtle humor, and the inimitable manner of speech makes his videos unique and unbelievably powerful. If you want to look at SMART reviewer with a well-built and well-grounded point of view - he is your guy. HIGHLY RECOMMEND! P.S. Most videos have English subtitles =) Read All Reviews Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Red Cynic. You can help by rating TV shows you've seen. Facts Original Name  Красный Циник Status  Returning Series Network Certification  - Type  Scripted Original Language  Russian Runtime  50m Homepage   http://www.redcynic.com Genres Comedy Sci-Fi & Fantasy Documentary War & Politics Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 31 GAim4A  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}