{"link": "https://www.themoviedb.org/tv/1511?language=en", "title": "The Adventures of Twizzle", "resume": "The Adventures of Twizzle is the very first television show produced by AP Films and specifically Gerry Anderson, after being approached by author Roberta Leigh and her colleague Suzanne Warner. Sources vary as to who directed the series. In addition to his production duties, Anderson also directed the action whilst photography was directed by Arthur Provis, Anderson's founding partner at AP Films. The music for the songs were written by Leslie Clair, the music was scored by Barry Gray, art direction came from Reg Hill and special effects were by Derek Meddings, all of whom would become long-time collaborators with Anderson. Twizzle and all the puppets for the 52 films were made by Joy Laurey, and there were two Twizzle puppets made for filming, one Twizzle puppet for conventional shots and another Twizzle puppet for the stunt shots when Twizzle's arms and legs became longer. The trick of extending Twizzle's arms and legs were based on a system of curtain rings and puppet strings pulled internally inside the puppets arms and legs.", "rate": 100, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Denise Bryer"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1511   Expand The Adventures of Twizzle   (1957) User Score Overview The Adventures of Twizzle is the very first television show produced by AP Films and specifically Gerry Anderson, after being approached by author Roberta Leigh and her colleague Suzanne Warner. Sources vary as to who directed the series. In addition to his production duties, Anderson also directed the action whilst photography was directed by Arthur Provis, Anderson's founding partner at AP Films. The music for the songs were written by Leslie Clair, the music was scored by Barry Gray, art direction came from Reg Hill and special effects were by Derek Meddings, all of whom would become long-time collaborators with Anderson. Twizzle and all the puppets for the 52 films were made by Joy Laurey, and there were two Twizzle puppets made for filming, one Twizzle puppet for conventional shots and another Twizzle puppet for the stunt shots when Twizzle's arms and legs became longer. The trick of extending Twizzle's arms and legs were based on a system of curtain rings and puppet strings pulled internally inside the puppets arms and legs. Featured Crew Janey Scott Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Denise Bryer Full Cast & Crew Last Season Season 2 — | 26 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of Twizzle. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  15m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}