{"link": "https://www.themoviedb.org/tv/8908?language=en", "title": "Flint the Time Detective", "resume": "Flint the Time Detective, known in Japan as Space-Time Detective Genshi-kun, is an animated Japanese television series directed by Hiroshi Fukutomi. It was based on a manga by Hideki Sonoda and Akira Yamauchi and was published by Kodansha in Japan. The anime aired from 1998 to 1999 in Japan and ran for 39 episodes. In USA Flint the Time Detective airs from March 5, 2000 until November 5, 2000. The series also aired in the Philippines via GMA 7 and dubbed in Filipino language which runs from late 2000 until mid-2001.\nEnoki Films and Sanrio hold the license to Flint the Time Detective.", "rate": 90, "genre": ["Animation"], "cast": ["Yukiji", "Nana Mizuki", "Chiaki Morita", "Masamichi Sato", "Fumihiko Tachiki"], "character": ["Genshi-kun", "Sora Yamato", "Tokio Yamato", "Professor Yamato", "Ototan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8908   Expand Flint the Time Detective   (1998) User Score Overview Flint the Time Detective, known in Japan as Space-Time Detective Genshi-kun, is an animated Japanese television series directed by Hiroshi Fukutomi. It was based on a manga by Hideki Sonoda and Akira Yamauchi and was published by Kodansha in Japan. The anime aired from 1998 to 1999 in Japan and ran for 39 episodes. In USA Flint the Time Detective airs from March 5, 2000 until November 5, 2000. The series also aired in the Philippines via GMA 7 and dubbed in Filipino language which runs from late 2000 until mid-2001. Enoki Films and Sanrio hold the license to Flint the Time Detective. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yukiji Genshi-kun Nana Mizuki Sora Yamato Chiaki Morita Tokio Yamato Masamichi Sato Professor Yamato Fumihiko Tachiki Ototan Full Cast & Crew Last Season Season 1 1998 | 39 Episodes Season 1 of Flint the Time Detective premiered on October  1, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Flint the Time Detective. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors A 3 Axiobyte K 1 Knossos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}