{"link": "https://www.themoviedb.org/tv/66719?language=en", "title": "The King's Dream", "resume": "Kim Chunchu is the grandson of King Jinji, but when his grandfather is overthrown, Chunchu is denied the chance to become a successor to the throne of Silla. He later meets Kim Yushin, and the two men begin a friendship. Chunchu later becomes King Muyeol, the 29th Korean monarch who leads the unification of three ancient kingdoms - Goguryeo, Baekje and Silla, while Kim Yushin becomes one of the greatest generals in Korean history.", "rate": 0, "genre": ["Drama"], "cast": ["Choi Soo-jong", "Chae Sang-woo", "Kim Yu-seok", "Noh Young-hak", "Lee Young-ah"], "character": ["Kim Chunchu", "Chunchu (young)", "Kim Yushin", "Yushin (young)", "Queen Jindeok"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66719   Expand The King's Dream   (2012) User Score Overview Kim Chunchu is the grandson of King Jinji, but when his grandfather is overthrown, Chunchu is denied the chance to become a successor to the throne of Silla. He later meets Kim Yushin, and the two men begin a friendship. Chunchu later becomes King Muyeol, the 29th Korean monarch who leads the unification of three ancient kingdoms - Goguryeo, Baekje and Silla, while Kim Yushin becomes one of the greatest generals in Korean history. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Choi Soo-jong Kim Chunchu Chae Sang-woo Chunchu (young) Kim Yu-seok Kim Yushin Noh Young-hak Yushin (young) Lee Young-ah Queen Jindeok Full Cast & Crew Last Season Season 1 2012 | 2 Episodes Season 1 of The King's Dream premiered on September  8, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The King's Dream. You can help by rating TV shows you've seen. Facts Original Name  대왕의 꿈 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  50m Homepage   http://www.kbs.co.kr/drama/kingsdream/ Genres Drama Keywords politics korea historical Content Score 86 Almost there... Top Contributors t 48 tmdb38202327 d 2 daphie t 1 tmdb983464 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}