{"link": "https://www.themoviedb.org/tv/45301?language=en", "title": "Couples Therapy", "resume": "A reality-tv show where 5 celebrity couples in rocky relationships each season would stay in a big mansion together with continous meetings with psychologists and experts in the field led by Dr. Jenn Mann to try to sort their relationship problems as well as personal ones.\nThe 2 couples that spawned the most controversy in media were the tumultious relationship beween rapper DMX and Tashera Simmons plus actor Doug Hutchinson (The Green Mile) and wife and fame-seeker Courtney Stodden  (they stood out alot due to Courtney being 17 turning 18 when the show was filmed while Doug was 52).\nSome a-list celebs appeared (Too Short,  Treach from Naughty By Nature, Jenna Jameson, Scott Stapp from Creed, JoJo from K-Ci and JoJo and Ghostface Killah for instance).\nBut half of the so called celebrities were people from previous reality-shows like The Bachelor, The Bachelorette, Teen Mom and Jersey Shore that weren't even that famous when those shows were on and most even forgot existed when they appeared on this show.", "rate": 65, "genre": ["Documentary", "Reality"], "cast": ["Jenn Mann", "Janice Dickinson", "Robert Gerner", "Angela Raiola", "Neil Murphy"], "character": ["The Host", "Herself", "Himself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45301   Expand Couples Therapy   (2012) User Score Overview A reality-tv show where 5 celebrity couples in rocky relationships each season would stay in a big mansion together with continous meetings with psychologists and experts in the field led by Dr. Jenn Mann to try to sort their relationship problems as well as personal ones. The 2 couples that spawned the most controversy in media were the tumultious relationship beween rapper DMX and Tashera Simmons plus actor Doug Hutchinson (The Green Mile) and wife and fame-seeker Courtney Stodden  (they stood out alot due to Courtney being 17 turning 18 when the show was filmed while Doug was 52). Some a-list celebs appeared (Too Short,  Treach from Naughty By Nature, Jenna Jameson, Scott Stapp from Creed, JoJo from K-Ci and JoJo and Ghostface Killah for instance). But half of the so called celebrities were people from previous reality-shows like The Bachelor, The Bachelorette, Teen Mom and Jersey Shore that weren't even that famous when those shows were on and most even forgot existed when they appeared on this show. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jenn Mann The Host Janice Dickinson Herself Robert Gerner Himself Angela Raiola Herself Neil Murphy Himself Full Cast & Crew Last Season Season 6 2015 | 10 Episodes Season 6 of Couples Therapy premiered on October  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Couples Therapy. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  60m Homepage   http://www.vh1.com/shows/couples-therapy-with-dr-jenn Genres Documentary Reality Keywords infidelity psychology romance relationship gay marriage therapy actor rappers Content Score 86 Almost there... Top Contributors 80 EmperorCommodus D 46 Dan_Tebasco 7 Elizabeth Jennings TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}