{"link": "https://www.themoviedb.org/tv/73715?language=en", "title": "Amazing Hotels: Life Beyond the Lobby", "resume": "Giles Coren and Monica Galetti travel the globe visiting some of the world's most incredible hotels. They go beyond the lobby to see the areas that the public never see and roll up their sleeves to work alongside staff.", "rate": 80, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73715   Expand Amazing Hotels: Life Beyond the Lobby   (2017) User Score  Play Trailer Overview Giles Coren and Monica Galetti travel the globe visiting some of the world's most incredible hotels. They go beyond the lobby to see the areas that the public never see and roll up their sleeves to work alongside staff. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Amazing Hotels: Life Beyond the Lobby premiered on March 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Amazing Hotels: Life Beyond the Lobby. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b08l2m2x Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 8 Elizabeth Jennings 6 anchilidas 3 tigru89  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}