{"link": "https://www.themoviedb.org/tv/75666?language=en", "title": "McMafia", "resume": "Alex Godman, the English-raised son of Russian mafia exiles, has spent his life trying to escape the shadow of their past, building his own legitimate business and forging a life with his girlfriend Rebecca. But when a murder forces his family's past to return to threaten them, Alex is drawn into the criminal underworld and must confront his values to protect those he loves.", "rate": 70, "genre": ["Crime", "Drama"], "cast": ["James Norton", "David Strathairn", "Juliet Rylance", "Merab Ninidze", "Aleksey Serebryakov"], "character": ["Alex Godman", "Semiyon Kleinman", "Rebecca Harper", "Vadim Kalyagin", "Dmitri Godman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75666   Expand McMafia   (2018) User Score  Play Trailer Overview Alex Godman, the English-raised son of Russian mafia exiles, has spent his life trying to escape the shadow of their past, building his own legitimate business and forging a life with his girlfriend Rebecca. But when a murder forces his family's past to return to threaten them, Alex is drawn into the criminal underworld and must confront his values to protect those he loves. Featured Crew Hossein Amini Creator James Watkins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Norton Alex Godman David Strathairn Semiyon Kleinman Juliet Rylance Rebecca Harper Merab Ninidze Vadim Kalyagin Aleksey Serebryakov Dmitri Godman Full Cast & Crew Current Season Season 1 2017 | 8 Episodes Season 1 of McMafia premiered on December 31, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply This show any good? Open 2 by  Strange Bedfellows Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  5 Recommendations   2018-01-02 LA to Vegas 7.0    2018-03-13 Rise 6.8    2017-01-25 Mary Kills People 7.5    2017-11-05 SMILF 6.7    2018-01-21 The Resident 7.0    2018-03-11 Deception 7.0    2015-10-07 Casual 6.5    2016-09-06 StartUp 7.4  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Miniseries Original Language  English Runtime  55m Homepage   http://www.bbc.co.uk/programmes/p05pksm8 Genres Crime Drama Keywords russian mafia criminal underworld Content Score 100 Yes! Looking good! Top Contributors 22 Elizabeth Jennings c 14 castacasta 11 EveDemocracy R 9 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}