{"link": "https://www.themoviedb.org/tv/76566?language=en", "title": "Hidden", "resume": "DI Cadi John and DC Owen Vaughan try to solve a case involving Mali Pryce, a young woman whose body was discovered in a stream in the woods.", "rate": 0, "genre": ["Drama", "Crime", "Mystery"], "cast": ["Sian Reese-Williams", "Sion Alun Davies"], "character": ["DI Cadi John", "DC Owen Vaughan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76566   Expand Hidden   (2018) User Score  Play Trailer Overview DI Cadi John and DC Owen Vaughan try to solve a case involving Mali Pryce, a young woman whose body was discovered in a stream in the woods. Featured Crew Mark Andrew Creator Ed Talfan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sian Reese-Williams DI Cadi John Sion Alun Davies DC Owen Vaughan Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Hidden premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply SB Hidden - and might well remain so Open 3 by  MareZare1991 Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Hidden. You can help by rating TV shows you've seen. Facts Original Name  Craith Status  Returning Series Network Certification  - Type  Scripted Original Language  Welsh Runtime  57m Homepage   http://www.s4c.cymru/en/drama/craith/ Genres Drama Crime Mystery Keywords welsh Content Score 71 Just a little bit more... Top Contributors 24 gusmt 19 Elizabeth Jennings 4 tigru89 3 tatergator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}