{"link": "https://www.themoviedb.org/tv/20706?language=en", "title": "Aux frontières du possible", "resume": "Aux frontières du possible is a French television show that was broadcast from 1971 and 1974. The show was created by Henri Viard and Jacques Bergier, based on the latter's book Scientific Espionage. 13 50-minute episodes were made, and the series was shown on channel 2 of the French ORTF network. In Canada, the series was broadcast in 1972 and 1974 on Radio-Canada.", "rate": 0, "genre": [], "cast": ["Pierre Vaneck", "Elga Andersen", "Eva Christian"], "character": ["Yan Thomas", "Berbara Andersen", "Christa Neumann"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20706   Expand Aux frontières du possible   (1971) User Score Overview Aux frontières du possible is a French television show that was broadcast from 1971 and 1974. The show was created by Henri Viard and Jacques Bergier, based on the latter's book Scientific Espionage. 13 50-minute episodes were made, and the series was shown on channel 2 of the French ORTF network. In Canada, the series was broadcast in 1972 and 1974 on Radio-Canada. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pierre Vaneck Yan Thomas Elga Andersen Berbara Andersen Eva Christian Christa Neumann Full Cast & Crew Last Season Season 2 1974 | 7 Episodes Season 2 of Aux frontières du possible premiered on February 23, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Aux frontières du possible. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  French Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 9 zoltan140 5 yannkallander  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}