{"link": "https://www.themoviedb.org/tv/70391?language=en", "title": "Philip K. Dick's Electric Dreams", "resume": "A diverse anthology of ambitious, moving tales inspired by Philip K Dick's short stories.", "rate": 72, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70391   Expand Philip K. Dick's Electric Dreams   (2017) User Score  Play Trailer Overview A diverse anthology of ambitious, moving tales inspired by Philip K Dick's short stories. Featured Crew Ronald D. Moore Creator Michael Dinner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  10 Images Backdrops  2 Posters  5 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Philip K. Dick's Electric Dreams premiered on September 17, 2017. View All Seasons Social Reviews  0 Discussions  14 Subject Status Replies Last Reply Picked up by Amazon Open 10 by  drjekel_mrhyde Kill all others Open 0 by Markoff\n      \n     S01E06 SPOILERS About xenomorph Open 1 by  JustinJackFlash Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  5 Recommendations   2017-10-21 Gunpowder 6.8    2016-10-19 Chance 7.3    2017-08-04 Wet Hot American Summer: 10 Years Later 6.8    2017-09-26 Law & Order True Crime 6.1    2018-02-11 Here and Now 7.7    2017-09-10 The Deuce 7.9    2018-01-02 LA to Vegas 7.0    2014-08-28 Hand of God 6.8  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  52m Homepage   http://www.channel4.com/programmes/electric-dreams Genres Drama Sci-Fi & Fantasy Keywords anthology futuristic cyberpunk based on short story blade runner Content Score 71 Just a little bit more... Top Contributors 47 LucusNon 39 Elizabeth Jennings 36 EveDemocracy 15 Miguel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}