{"link": "https://www.themoviedb.org/tv/34210?language=en", "title": "Bakuretsu Hunters", "resume": "Sorcerer Hunters is a 13-volume manga series, written by Satoru Akahori and illustrated by Rei Omishi. Akahori and Omishi also published Sorcerer Hunters Special, a one-volume story set sometime after the series' conclusion.\nIn the United States Sorcerer Hunters was serialized in MixxZine, replacing Ice Blade, which had ended.", "rate": 65, "genre": ["Animation", "Sci-Fi", "Fantasy", "Comedy", "Action", "Adventure"], "cast": ["Yuko Mizutani", "Sakiko Tamagawa", "Megumi Hayashibara", "Kiyoyuki Yanada", "Shinnosuke Furumoto"], "character": ["Chocolat Misu", "Dotta", "Tira Misu", "Gateau Mocha", "Carrot Glasse"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34210   Expand Bakuretsu Hunters   (1995) User Score Overview Sorcerer Hunters is a 13-volume manga series, written by Satoru Akahori and illustrated by Rei Omishi. Akahori and Omishi also published Sorcerer Hunters Special, a one-volume story set sometime after the series' conclusion. In the United States Sorcerer Hunters was serialized in MixxZine, replacing Ice Blade, which had ended. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuko Mizutani Chocolat Misu Sakiko Tamagawa Dotta Megumi Hayashibara Tira Misu Kiyoyuki Yanada Gateau Mocha Shinnosuke Furumoto Carrot Glasse Full Cast & Crew Last Season Season 2 1996 | 12 Episodes Season 2 of Bakuretsu Hunters premiered on January  9, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Bakuretsu Hunters. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Comedy Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 12 seboseboss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}