{"link": "https://www.themoviedb.org/tv/76624?language=en", "title": "Tahajjud Cinta", "resume": "Tahajjud Cinta story about the sacrifice of two women, Citra Maisara (Nur Fazura) and Seri (Fouziah Gous) in the fight for truth, rights and reputation of women. Derived from two different backgrounds, Citra is the daughter of a married couple is the leader of a big company. For 5 years studying abroad, Citra parents never knew that their daughter whom they sent to London to pursue Civil, had secretly migrated to Jordan to explore the field of Shari'a law. In it, Citra reunited with her close friends Seri, who shared the same ambitions.\nTheir lives began being bombarded with many trials and great pressure after returning to the bosom of their families in Malaysia. Back at the Malaysia, Citra parents are very surprised with the changes and approvals obtained. So frustrated with the actions, Citra parents will not allow Citra the resolve to pursue her dream as a Syariah lawyer.\nBut everything changes when her sister, Emelda (Tiz Zaqyah) suffer as a result of violence by her husband (Heryanto Hassan). Seeing the seriousness of the oppression of Emelda defend her husband, Citra parents finally endorsing the struggle.\nIn contrast, the fate of Seri, where she had to forget her ambitions as a Syariah lawyer. As the request of her father (Ahmad Tarmimi Siregar), Seri was forced to marry Ustaz Shauki (Eman Manan) that has been financing Seri overseas studies. Unfortunately, Seri victims of flogging Ustaz Shauki that already had three wives (Erma Fatima), (Melissa Saila) and (Dira Abu Zahar). Seri is forced to forget her love for Sollahudin (Remy Ishak), son of Ustaz Shauki.\nThis situation also cut Ustaz Shauki three wives feelings very jealous of the Seri. Although tormented, for family firm and pleased to continue to live, Seri throw her ambition to succeed as a Syariah lawyer. However, the situation start change when the emergence of Armani (Neelofa).", "rate": 0, "genre": ["Drama"], "cast": ["Nur Fazura", "Fouziah Gous", "Erma Fatima", "Remy Ishak", "Aaron Aziz"], "character": ["Citra Maisara", "Seri", "Hamani", "Solahudin", "Iskandar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76624   Expand Tahajjud Cinta   (2011) User Score Overview Tahajjud Cinta story about the sacrifice of two women, Citra Maisara (Nur Fazura) and Seri (Fouziah Gous) in the fight for truth, rights and reputation of women. Derived from two different backgrounds, Citra is the daughter of a married couple is the leader of a big company. For 5 years studying abroad, Citra parents never knew that their daughter whom they sent to London to pursue Civil, had secretly migrated to Jordan to explore the field of Shari'a law. In it, Citra reunited with her close friends Seri, who shared the same ambitions. Their lives began being bombarded with many trials and great pressure after returning to the bosom of their families in Malaysia. Back at the Malaysia, Citra parents are very surprised with the changes and approvals obtained. So frustrated with the actions, Citra parents will not allow Citra the resolve to pursue her dream as a Syariah lawyer. But everything changes when her sister, Emelda (Tiz Zaqyah) suffer as a result of violence by her husband (Heryanto Hassan). Seeing the seriousness of the oppression of Emelda defend her husband, Citra parents finally endorsing the struggle. In contrast, the fate of Seri, where she had to forget her ambitions as a Syariah lawyer. As the request of her father (Ahmad Tarmimi Siregar), Seri was forced to marry Ustaz Shauki (Eman Manan) that has been financing Seri overseas studies. Unfortunately, Seri victims of flogging Ustaz Shauki that already had three wives (Erma Fatima), (Melissa Saila) and (Dira Abu Zahar). Seri is forced to forget her love for Sollahudin (Remy Ishak), son of Ustaz Shauki. This situation also cut Ustaz Shauki three wives feelings very jealous of the Seri. Although tormented, for family firm and pleased to continue to live, Seri throw her ambition to succeed as a Syariah lawyer. However, the situation start change when the emergence of Armani (Neelofa). Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nur Fazura Citra Maisara Fouziah Gous Seri Erma Fatima Hamani Remy Ishak Solahudin Aaron Aziz Iskandar Full Cast & Crew Last Season Season 1 2011 | 13 Episodes Season 1 of Tahajjud Cinta premiered on July  8, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tahajjud Cinta. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Malay Runtime  - Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 31 love.warrior  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}