{"link": "https://www.themoviedb.org/tv/44547?language=en", "title": "CB Chara Nagai Go World", "resume": "CB Chara Nagai Go World is an original video animation based in the works of Go Nagai. It was originally released from February 21, 1991 to June 27, 1991 in three episodes. Following the same concept, a oneshot manga by Nagai was released in 1992.\nThe OVA was also released in Italy under the name Il pazzo mondo di Go Nagai.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44547   Expand CB Chara Nagai Go World   (1991) User Score Overview CB Chara Nagai Go World is an original video animation based in the works of Go Nagai. It was originally released from February 21, 1991 to June 27, 1991 in three episodes. Following the same concept, a oneshot manga by Nagai was released in 1992. The OVA was also released in Italy under the name Il pazzo mondo di Go Nagai. Featured Crew Umanosuke Iida Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1991 | 3 Episodes Season 1 of CB Chara Nagai Go World premiered on February 21, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on CB Chara Nagai Go World. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors d 7 denis B 3 BlizzardPicard  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}