{"link": "https://www.themoviedb.org/tv/32911?language=en", "title": "I Rock", "resume": "I Rock is an Australian comedy / drama television series which first screened on ABC2 from 3 May 2010.\nThe series revolves around Nash Taylor and his struggling indie rock band, Boy Crazy Stacey, trying to make it big on the Australian music scene. The series was shot in the pub scene of the inner west suburbs of Sydney. Guest stars include Tim Rogers from Sydney band You Am I, Cassette Kids and radio broadcaster personality Scott Dooley.\nThe series stars Josh Mapleston. It was written by Josh Mapleston with David Fedirchuk and Rob Macdonald, produced by David Fedirchuk & Rob Macdonald and directed by Rob Macdonald.", "rate": 0, "genre": ["Comedy"], "cast": ["Alison Bell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32911   Expand I Rock   (2010) User Score Overview I Rock is an Australian comedy / drama television series which first screened on ABC2 from 3 May 2010. The series revolves around Nash Taylor and his struggling indie rock band, Boy Crazy Stacey, trying to make it big on the Australian music scene. The series was shot in the pub scene of the inner west suburbs of Sydney. Guest stars include Tim Rogers from Sydney band You Am I, Cassette Kids and radio broadcaster personality Scott Dooley. The series stars Josh Mapleston. It was written by Josh Mapleston with David Fedirchuk and Rob Macdonald, produced by David Fedirchuk & Rob Macdonald and directed by Rob Macdonald. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alison Bell Full Cast & Crew Last Season Season 1 2010 | 8 Episodes Season 1 of I Rock premiered on May  3, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on I Rock. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.abc.net.au/tv/irock/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}