{"link": "https://www.themoviedb.org/tv/4879?language=en", "title": "Second chance", "resume": "El cuerpo del Deseo also known as Second Chance is a Spanish-language telenovela produced by Telemundo and Film in Florida. This limited-run series is about a man who comes back from the dead and discovers dark secrets about his beautiful widow. The first version of El cuerpo del Deseo was En Cuerpo Ajeno produced by RTI Colombia in 1992.This telenovela was aired in 25 countries around the world.", "rate": 0, "genre": ["Comedy", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4879   Expand Second chance User Score Overview El cuerpo del Deseo also known as Second Chance is a Spanish-language telenovela produced by Telemundo and Film in Florida. This limited-run series is about a man who comes back from the dead and discovers dark secrets about his beautiful widow. The first version of El cuerpo del Deseo was En Cuerpo Ajeno produced by RTI Colombia in 1992.This telenovela was aired in 25 countries around the world. Featured Crew Julio Jiménez Creator Julio Jimenez Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  4 Facts Original Name  El Cuerpo del Deseo Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.telemundo.com/elcuerpo/index.html Genres Comedy Drama Mystery Sci-Fi & Fantasy Keywords secret reincarnation betrayal Content Score 43 There's no 'I' in team... Top Contributors 11 Anderson Mesquita d 6 denim s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}