{"link": "https://www.themoviedb.org/tv/31804?language=en", "title": "The Persuasionists", "resume": "The Persuasionists is a sitcom broadcast on BBC Two set in the world of advertising starring Iain Lee, Simon Farnaby, Adam Buxton, Jarred Christmas and Daisy Haggard, and featuring Natalie Gumede. It was the sitcom writing debut for Jonathan Thake, best known until then for ‘the slag of all snacks’ campaign for Pot Noodle. The Persuasionists premiered on Wednesday 13 January 2010.\nBwark Productions produced the series, Iain Morris and Damon Beesley were the executive producers and Tristram Shapeero directed. Andrew Collins acted as script editor.", "rate": 0, "genre": ["Comedy"], "cast": ["Adam Buxton", "Daisy Haggard", "Kelly Adams"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31804   Expand The Persuasionists   (2010) User Score Overview The Persuasionists is a sitcom broadcast on BBC Two set in the world of advertising starring Iain Lee, Simon Farnaby, Adam Buxton, Jarred Christmas and Daisy Haggard, and featuring Natalie Gumede. It was the sitcom writing debut for Jonathan Thake, best known until then for ‘the slag of all snacks’ campaign for Pot Noodle. The Persuasionists premiered on Wednesday 13 January 2010. Bwark Productions produced the series, Iain Morris and Damon Beesley were the executive producers and Tristram Shapeero directed. Andrew Collins acted as script editor. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Buxton Daisy Haggard Kelly Adams Full Cast & Crew Last Season Season 1 2010 | 6 Episodes Season 1 of The Persuasionists premiered on January 13, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Persuasionists. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00q3ks7 Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors a 1 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}