{"link": "https://www.themoviedb.org/tv/34971?language=en", "title": "Storage Wars", "resume": "When rent is not paid on a storage locker for three months in California, the contents can be sold by an auctioneer as a single lot of items in the form of a cash-only auction. The show follows professional buyers who purchase the contents based only on a five-minute inspection of what they can see from the door when it is open. The goal is to turn a profit on the merchandise.", "rate": 55, "genre": ["Reality"], "cast": ["Dan Dotson", "Jarrod Schulz", "Brandi Passante", "Darrell Sheets", "Dave Hester"], "character": ["Himself", "Himself", "Herself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34971   Expand Storage Wars   (2010) User Score  Play Trailer Overview When rent is not paid on a storage locker for three months in California, the contents can be sold by an auctioneer as a single lot of items in the form of a cash-only auction. The show follows professional buyers who purchase the contents based only on a five-minute inspection of what they can see from the door when it is open. The goal is to turn a profit on the merchandise. Featured Crew Thom Beers Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dan Dotson Himself Jarrod Schulz Himself Brandi Passante Herself Darrell Sheets Himself Dave Hester Himself Full Cast & Crew Current Season Season 11 2017 | 29 Episodes Season 11 of Storage Wars premiered on November  8, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Storage Wars. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   2009-07-19 Pawn Stars 6.5    2010-08-16 Hardcore Pawn 4.2    2010-10-25 American Restoration 6.1    2008-12-03 Man v. Food 6.7    2010-01-18 American Pickers 7.4    2004-03-04 Pimp My Ride 5.2    2001-01-06 How It's Made 7.4    2004-08-31 Dog the Bounty Hunter 3.4  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  21m Homepage   http://www.aetv.com/storage-wars/ Genres Reality Keywords auction storage unit Content Score 100 Yes! Looking good! Top Contributors 22 Elizabeth Jennings TB 19 TMDb Bot 11 OzDrDj b 11 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}