{"link": "https://www.themoviedb.org/tv/8095?language=en", "title": "Crocodile Shoes", "resume": "Crocodile Shoes is a British 7-part television series made by the BBC and screened on BBC One in 1994. The series was written by and starred Jimmy Nail as a factory worker who becomes a country and western singer. A sequel, Crocodile Shoes II followed in 1996 and the theme tune \"Country Boy\" was a hit for Nail too.", "rate": 65, "genre": ["Drama"], "cast": ["Melanie Hill", "Alex Kingston", "Jimmy Nail", "Amy Madigan", "Christopher Fairbank"], "character": ["Caroline Carrison"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8095   Expand Crocodile Shoes   (1994) User Score Overview Crocodile Shoes is a British 7-part television series made by the BBC and screened on BBC One in 1994. The series was written by and starred Jimmy Nail as a factory worker who becomes a country and western singer. A sequel, Crocodile Shoes II followed in 1996 and the theme tune \"Country Boy\" was a hit for Nail too. Featured Crew Jimmy Nail Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melanie Hill Alex Kingston Caroline Carrison Jimmy Nail Amy Madigan Christopher Fairbank Full Cast & Crew Last Season Season 2 1996 | 6 Episodes Season 2 of Crocodile Shoes premiered on November 14, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crocodile Shoes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 55m Homepage  - Genres Drama Keywords factory worker country music northern england aspiring singer working class Content Score 93 Almost there... Top Contributors 6 Banana R 4 Rebecca O 3 Ozbourne 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}