{"link": "https://www.themoviedb.org/tv/70703?language=en", "title": "A vous de jouer milord", "resume": "This French spy story presented in comic book style was broadcasted on TV on November 1974. It tells the adventures of Hubert de Pomarec (Henri Piégay), alias “Milord”, a retired spy called back into service to foil the abduction of the new army tank AMX 30 by a gang of crooks.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Henri Piégay", "Patrick Préjean", "Mario David", "Marianne Comtell", "Jacques Mauclair"], "character": ["Milord", "Zouroc", "Loubère", "Eve", "N° 1"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70703   Expand A vous de jouer milord   (1974) User Score Overview This French spy story presented in comic book style was broadcasted on TV on November 1974. It tells the adventures of Hubert de Pomarec (Henri Piégay), alias “Milord”, a retired spy called back into service to foil the abduction of the new army tank AMX 30 by a gang of crooks. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Henri Piégay Milord Patrick Préjean Zouroc Mario David Loubère Marianne Comtell Eve Jacques Mauclair N° 1 Full Cast & Crew Last Season Miniseries 1974 | 6 Episodes Season 1 of A vous de jouer milord premiered on November  4, 1974. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on A vous de jouer milord. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  French Runtime  45m Homepage  - Genres Action & Adventure Keywords miniseries Content Score 71 Just a little bit more... Top Contributors TB 24 TMDb Bot 9 yannkallander R 6 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}