{"link": "https://www.themoviedb.org/tv/43035?language=en", "title": "TASS Is Authorized to Declare...", "resume": "The struggle of Soviet and American intelligence agencies during the Cold War era", "rate": 73, "genre": [], "cast": ["Vyacheslav Tikhonov", "Yuriy Solomin", "Vakhtang Kikabidze", "Aleksey Petrenko", "Nikolai Skorobogatov"], "character": ["Константин Иванович Константинов, генерал КГБ", "Виталий Всеволодович Славин, полковник КГБ", "Джон Грегори Глэбб, заместитель резидента ЦРУ в Тразиленде", "Пол Дик, американский журналист, собственный корреспондент газеты «Пост»", "Олег Карпович Архипкин, садовник в советском посольстве"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43035   Expand TASS Is Authorized to Declare...   (1984) User Score Overview The struggle of Soviet and American intelligence agencies during the Cold War era Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vyacheslav Tikhonov Константин Иванович Константинов, генерал КГБ Yuriy Solomin Виталий Всеволодович Славин, полковник КГБ Vakhtang Kikabidze Джон Грегори Глэбб, заместитель резидента ЦРУ в Тразиленде Aleksey Petrenko Пол Дик, американский журналист, собственный корреспондент газеты «Пост» Nikolai Skorobogatov Олег Карпович Архипкин, садовник в советском посольстве Full Cast & Crew Last Season Miniseries 1984 | 10 Episodes Season 1 of TASS Is Authorized to Declare... premiered on July 30, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1973-08-11 Seventeen Moments of Spring 7.5    1969-01-01 Nu, pogodi! 6.8  Facts Original Name  ТАСС уполномочен заявить… Status  Ended Networks - Certification  - Type  Miniseries Original Language  Russian Runtime  - Homepage  - Genres No genres have been added. Keywords cia based on novel or book politics spy cold war kgb miniseries intelligence agent Content Score 79 Pump it up! We're close now. Top Contributors TB 24 TMDb Bot 15 Banana S 3 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}