{"link": "https://www.themoviedb.org/tv/70767?language=en", "title": "Dear White People", "resume": "At a predominantly white Ivy League college, a diverse group of students navigate various forms of racial and other types of discrimination.", "rate": 60, "genre": ["Comedy"], "cast": ["Ashley Blaine Featherson", "Brandon P. Bell", "Logan Browning", "Antoinette Robertson", "DeRon Horton"], "character": ["Joelle Brooks", "Troy Fairbanks", "Samantha White", "Coco Conners", "Lionel Higgins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70767   Expand Dear White People   (2017) User Score  Play Trailer Overview At a predominantly white Ivy League college, a diverse group of students navigate various forms of racial and other types of discrimination. Featured Crew Justin Simien Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  2 Teasers  3 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashley Blaine Featherson Joelle Brooks Brandon P. Bell Troy Fairbanks Logan Browning Samantha White Antoinette Robertson Coco Conners DeRon Horton Lionel Higgins Full Cast & Crew Current Season Volume 2 2018 | 10 Episodes View All Seasons Social Reviews  1 Discussions  0 s A review by sexxyadventure  1.0 Written by  sexxyadventure  on December 31, 2017 I don't recommend. Read All Reviews Media Most Popular Videos  5 Backdrops  3 Posters  2 Recommendations   2016-11-15 Brown Nation 7.3    2012-11-01 Redfern Now 8.0    2015-06-12 Conspiracy 5.7    Decker 4.8    2017-01-30 Bonus Family 8.5    2017-01-11 The Worst Witch 7.4    2017-02-27 When We Rise 6.7    2004-11-08 Sarabhai vs Sarabhai 5.6  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   https://www.netflix.com/title/80095698 Genres Comedy Keywords college social commentary racism racial tension social justice based on movie racial issues young adult Content Score 100 Yes! Looking good! Top Contributors 26 A Fan of Many Things 19 Bendik 11 Banana Y 5 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}