{"link": "https://www.themoviedb.org/tv/43422?language=en", "title": "Pulkkinen", "resume": "Pulkkinen was an award-winning Finnish sketch series which aired between 1999 and 2002, and starring actors Jari Salmi and Antti Virmavirta . The series was written by Juha Jokela, and is known for its courageous humor. Pulkkinen's first season was released on DVD in 2005 and the second season in 2006. The third and last series was published in October 2006.", "rate": 0, "genre": ["Comedy"], "cast": ["Jari Salmi", "Juha Jokela"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43422   Expand Pulkkinen   (1999) User Score Overview Pulkkinen was an award-winning Finnish sketch series which aired between 1999 and 2002, and starring actors Jari Salmi and Antti Virmavirta . The series was written by Juha Jokela, and is known for its courageous humor. Pulkkinen's first season was released on DVD in 2005 and the second season in 2006. The third and last series was published in October 2006. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jari Salmi Juha Jokela Full Cast & Crew Last Season Season 1 1999 | 10 Episodes Season 1 of Pulkkinen premiered on September  6, 1999. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Pulkkinen. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pulkkinen. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Finnish Runtime  25m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 18 BryGur R 2 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}