{"link": "https://www.themoviedb.org/tv/66078?language=en", "title": "Twin Star Exorcists", "resume": "Rokuro is from a family of exorcists, but he'd rather be a singer, a soccer player or anything but an exorcist! He's forced to own up to his own incredible potential when new arrival Benio stirs his competitive spirit. But their rivalry gets a twist when they earn the prestigious title of \"Twin Star Exorcists\"—two supreme fighters fated to marry and birth the ultimate spiritual warrior!", "rate": 84, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66078   Expand Twin Star Exorcists   (2016) User Score  Play Trailer Overview Rokuro is from a family of exorcists, but he'd rather be a singer, a soccer player or anything but an exorcist! He's forced to own up to his own incredible potential when new arrival Benio stirs his competitive spirit. But their rivalry gets a twist when they earn the prestigious title of \"Twin Star Exorcists\"—two supreme fighters fated to marry and birth the ultimate spiritual warrior! Featured Crew Tomohisa Taguchi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2016 | 50 Episodes Season 1 of Twin Star Exorcists premiered on April  6, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2017-04-05 Armed Girl's Machiavellism 8.6    2015-10-03 Chivalry of a Failed Knight 7.9    2016-01-14 KonoSuba – God’s blessing on this wonderful world!! 8.4    2008-01-08 Spice and Wolf 7.3    2015-04-03 Food Wars!: Shokugeki no Soma 7.9    2014-07-06 Akame ga Kill! 7.0    2014-10-05 The Seven Deadly Sins 7.9  Facts Original Name  双星の陰陽師 Status  In Production Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.sousei-anime.jp/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords based on manga anime jump sq Content Score 71 Just a little bit more... Top Contributors 21 sp1ti 16 Minicocoxt 11 deanzel 8 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}