{"link": "https://www.themoviedb.org/tv/16028?language=en", "title": "Italian Spiderman", "resume": "Italian Spiderman is a film parody of Italian action–adventure films of the 60s and 70s, first released on YouTube in 2007. The parody purports to be a \"lost Italian film\" by Alrugo Entertainment, an Australian film-making collective formed by Dario Russo, Tait Wilson, David Ashby, Will Spartalis and Boris Repasky.\nOstensibly an Italian take on the comic book superhero Spider-Man, the film is a reference to foreign movies that misappropriate popular American superheroes such as the Turkish film \"3 Dev Adam\" and the Japanese TV series \"Spider-Man\", both of which alter the character of Spider-Man for foreign audiences. Other notable entries include the Indian version of Superman, I Fantastici Tre Supermen and La Mujer Murcielago. It also resembles the movie The Bathman dal pianeta Eros.\nA trailer was released, followed by a full-length feature made up of ten mini-episodes.", "rate": 100, "genre": ["Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16028   Expand Italian Spiderman   (2008) User Score  Play Trailer Overview Italian Spiderman is a film parody of Italian action–adventure films of the 60s and 70s, first released on YouTube in 2007. The parody purports to be a \"lost Italian film\" by Alrugo Entertainment, an Australian film-making collective formed by Dario Russo, Tait Wilson, David Ashby, Will Spartalis and Boris Repasky. Ostensibly an Italian take on the comic book superhero Spider-Man, the film is a reference to foreign movies that misappropriate popular American superheroes such as the Turkish film \"3 Dev Adam\" and the Japanese TV series \"Spider-Man\", both of which alter the character of Spider-Man for foreign audiences. Other notable entries include the Indian version of Superman, I Fantastici Tre Supermen and La Mujer Murcielago. It also resembles the movie The Bathman dal pianeta Eros. A trailer was released, followed by a full-length feature made up of ten mini-episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2008 | 10 Episodes Season 1 of Italian Spiderman premiered on May 22, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Italian Spiderman. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.alrugo.com/ Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors C 9 Cataloguer TB 1 TMDb Bot k 1 kangchen r 1 rikeman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}