{"link": "https://www.themoviedb.org/tv/32469?language=en", "title": "Connor Undercover", "resume": "Connor Undercover is a Canadian tween action-comedy television series airing on Canadian specialty channel Family. It stars Max Morrow as the titular character Connor Heath. It is co-produced by Heroic Films Company and Shaftesbury Films. In early 2010, Family renewed the series for a second season.", "rate": 0, "genre": ["Comedy"], "cast": ["Max Morrow", "Will Seatle Bowes", "Jordan Francis", "Carleigh Beverly", "Dylan Authors"], "character": ["Connor Heath"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32469   Expand Connor Undercover   (2010) User Score Overview Connor Undercover is a Canadian tween action-comedy television series airing on Canadian specialty channel Family. It stars Max Morrow as the titular character Connor Heath. It is co-produced by Heroic Films Company and Shaftesbury Films. In early 2010, Family renewed the series for a second season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Max Morrow Connor Heath Will Seatle Bowes Jordan Francis Carleigh Beverly Dylan Authors Full Cast & Crew Last Season Season 2 — | 17 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Connor Undercover. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.connorundercover.com Genres Comedy Keywords teenager hidden identity Content Score 86 Almost there... Top Contributors s 3 speedycars 3 Banana 1 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}