{"link": "https://www.themoviedb.org/tv/46527?language=en", "title": "Bachelor's Vegetable Store", "resume": "The true story of a young man who turned a tiny vegetable store into a nationwide franchise. Based on a book published in 2003 about Lee Young Suk's life. He started his vegetable stand in 1998 and eventually expanded it to 33 stores around South Korea.", "rate": 60, "genre": ["Comedy", "Drama", "Romance"], "cast": ["Kim Young-kwang", "Ji Chang-wook", "Wang Ji-hye", "Oh Jae Moo", "Park Soo-jin"], "character": ["Lee Seul-woo", "Han Tae-yang", "Mok Ga-on / Jin Jin-shim", "young Han Tae-yang", "Jung Dan-bi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46527   Expand Bachelor's Vegetable Store   (2011) User Score Overview The true story of a young man who turned a tiny vegetable store into a nationwide franchise. Based on a book published in 2003 about Lee Young Suk's life. He started his vegetable stand in 1998 and eventually expanded it to 33 stores around South Korea. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Young-kwang Lee Seul-woo Ji Chang-wook Han Tae-yang Wang Ji-hye Mok Ga-on / Jin Jin-shim Oh Jae Moo young Han Tae-yang Park Soo-jin Jung Dan-bi Full Cast & Crew Last Season Season 1 2011 | 24 Episodes Season 1 of Bachelor's Vegetable Store premiered on December 21, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Bachelor's Vegetable Store. You can help by rating TV shows you've seen. Facts Original Name  총각네 야채가게 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.ichannela.com/drama/chonggakne/ Genres Comedy Drama Romance Keywords korea Content Score 86 Almost there... Top Contributors M 31 Maria180493 8 part-mozi 3 lareina123 R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}