{"link": "https://www.themoviedb.org/tv/63712?language=en", "title": "Place to Place", "resume": "Tsumiki Miniwa, a small girl who packs a punch, is in love with her best friend, tall and easygoing Io Otonashi. The only problem is that she can't bring herself to come out and say it. And, despite the fact that he can otherwise read her like a book, Io doesn't seem to be able to pick up the obvious clues—even with all of their friends teasing that there's no one better suited for each other.\nAcchi Kocchi follows Tsumiki and her circle of friends as they go through their day-to-day lives. Between Mayoi the electronics nerd, Sakaki the good-natured prankster, and the nosebleed-prone Hime, Tsumiki's friends will never let her live down her crush. But only time will tell if Tsumiki will gain the courage to finally say how she truly feels.", "rate": 95, "genre": ["Animation"], "cast": ["Rumi Ookubo", "Nobuhiko Okamoto", "Hitomi Nabatame", "Kaori Fukuhara", "Shintarou Asanuma"], "character": ["Tsukimi Miniwa", "Io Otonashi", "Mayoi Katase", "Hime Haruno", "Sakaki Inui"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63712   Expand Place to Place   (2012) User Score Overview Tsumiki Miniwa, a small girl who packs a punch, is in love with her best friend, tall and easygoing Io Otonashi. The only problem is that she can't bring herself to come out and say it. And, despite the fact that he can otherwise read her like a book, Io doesn't seem to be able to pick up the obvious clues—even with all of their friends teasing that there's no one better suited for each other. Acchi Kocchi follows Tsumiki and her circle of friends as they go through their day-to-day lives. Between Mayoi the electronics nerd, Sakaki the good-natured prankster, and the nosebleed-prone Hime, Tsumiki's friends will never let her live down her crush. But only time will tell if Tsumiki will gain the courage to finally say how she truly feels. Featured Crew Ishiki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  1 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Rumi Ookubo Tsukimi Miniwa Nobuhiko Okamoto Io Otonashi Hitomi Nabatame Mayoi Katase Kaori Fukuhara Hime Haruno Shintarou Asanuma Sakaki Inui Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Place to Place premiered on April  5, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Place to Place. You can help by rating TV shows you've seen. Facts Original Name  あっちこっち Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.tbs.co.jp/anime/ackc/ Genres Animation Keywords romance slice of life school Content Score 100 Yes! Looking good! Top Contributors 21 ニニ Z 15 Zayrus 14 Elizabeth Jennings 12 Nekthael  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}