{"link": "https://www.themoviedb.org/tv/60935?language=en", "title": "Fat n' Furious: Rolling Thunder", "resume": "In the rust belt state of Ohio, speed reigns supreme - the faster the car the fatter the profit and every second counts. With a waist size that rivals the Rust Belt itself, Tommy Christmas and his family are known for driving big and living even bigger. \"Fat n' Furious: Rolling Thunder\" follows the hilarious car junkies of Christmas Automotive as they hunt down left-for-dead cars and bringing the back to life and to the racetrack.", "rate": 100, "genre": ["Reality"], "cast": ["Tommy Christmas"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60935   Expand Fat n' Furious: Rolling Thunder   (2014) User Score Overview In the rust belt state of Ohio, speed reigns supreme - the faster the car the fatter the profit and every second counts. With a waist size that rivals the Rust Belt itself, Tommy Christmas and his family are known for driving big and living even bigger. \"Fat n' Furious: Rolling Thunder\" follows the hilarious car junkies of Christmas Automotive as they hunt down left-for-dead cars and bringing the back to life and to the racetrack. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tommy Christmas Himself Full Cast & Crew Last Season Season 3 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fat n' Furious: Rolling Thunder. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage  - Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 16 Elizabeth Jennings TB 12 TMDb Bot A 3 Alexandria p 2 pucxy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}