{"link": "https://www.themoviedb.org/tv/33761?language=en", "title": "Triumph of Love", "resume": "Triunfo del Amor is a Mexican telenovela, starring Maite Perroni, William Levy, and Victoria Ruffo as the main protagonists. Dominika Paleta, Guillermo García Cantú and Daniela Romo star as the main antagonists. It is based on El Privilegio de Amar produced in 1998, a remake of Delia Fiallo's classic Cristal produced in 1985. Triunfo del Amor won 3 awards in Premios TVyNovelas: Best female antagonist, best first actor, and best young lead actress.\nCanal de las Estrellas aired Triunfo del Amor on October 25, 2010, airing half hour episodes with Soy tu dueña from October 25 to November 5, 2010. From November 8, 2010 to June 26, 2011, one hour episodes were broadcast. Univision aired Triunfo del amor in the United States from January 3, 2011 to August 1, 2011 at 9pm/8pm central. During its run, Univision aired 2 hours of Triunfo del Amor from March 4 to March 29, 2011, and from May 16 to June 3, 2011 at 9pm central, due La reina del sur dominating the 10pm time slot.", "rate": 80, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33761   Expand Triumph of Love User Score Overview Triunfo del Amor is a Mexican telenovela, starring Maite Perroni, William Levy, and Victoria Ruffo as the main protagonists. Dominika Paleta, Guillermo García Cantú and Daniela Romo star as the main antagonists. It is based on El Privilegio de Amar produced in 1998, a remake of Delia Fiallo's classic Cristal produced in 1985. Triunfo del Amor won 3 awards in Premios TVyNovelas: Best female antagonist, best first actor, and best young lead actress. Canal de las Estrellas aired Triunfo del Amor on October 25, 2010, airing half hour episodes with Soy tu dueña from October 25 to November 5, 2010. From November 8, 2010 to June 26, 2011, one hour episodes were broadcast. Univision aired Triunfo del amor in the United States from January 3, 2011 to August 1, 2011 at 9pm/8pm central. During its run, Univision aired 2 hours of Triunfo del Amor from March 4 to March 29, 2011, and from May 16 to June 3, 2011 at 9pm central, due La reina del sur dominating the 10pm time slot. Featured Crew Delia Fiallo Creator Liliana Abud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Original Name  Triunfo del Amor Status  Ended Networks - Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://www.televisa.esmas.com/entretenimiento/telenovelas/triunfo-del-amor/ Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors s 6 shiff7 s 3 speedycars p 3 pepitopajas 2 Amanda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}