{"link": "https://www.themoviedb.org/tv/32134?language=en", "title": "Faces of America", "resume": "Faces of America is a four-part Public Broadcasting Service Public television television series hosted by Professor Henry Louis Gates. The series originally aired February 10 – March 3, 2010 from 8–9 p.m. ET. In Australia, this program aired on SBS One each Sunday at 7:30pm from 9 -30 January 2011. It uses genealogical research and genetics to find the family history of 12 Americans: Elizabeth Alexander, Mario Batali, Stephen Colbert, Louise Erdrich, Malcolm Gladwell, Eva Longoria, Yo-Yo Ma, Mike Nichols, Queen Noor of Jordan, Dr. Mehmet Oz, Meryl Streep, and Kristi Yamaguchi.\nIn the series finale, Gates explored the emerging use of full genome sequencing to understand personal ancestry and health, by learning what might be inferred from his whole genome sequence, and that of his father, through in-depth analysis by a personal genomics company and the Broad Institute.\nIn 2012, PBS aired another miniseries entitled Finding Your Roots also examining questions of genealogy and genetics, and hosted by Gates.", "rate": 0, "genre": ["Documentary"], "cast": ["Henry Louis Gates, Jr."], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32134   Expand Faces of America   (2010) User Score Overview Faces of America is a four-part Public Broadcasting Service Public television television series hosted by Professor Henry Louis Gates. The series originally aired February 10 – March 3, 2010 from 8–9 p.m. ET. In Australia, this program aired on SBS One each Sunday at 7:30pm from 9 -30 January 2011. It uses genealogical research and genetics to find the family history of 12 Americans: Elizabeth Alexander, Mario Batali, Stephen Colbert, Louise Erdrich, Malcolm Gladwell, Eva Longoria, Yo-Yo Ma, Mike Nichols, Queen Noor of Jordan, Dr. Mehmet Oz, Meryl Streep, and Kristi Yamaguchi. In the series finale, Gates explored the emerging use of full genome sequencing to understand personal ancestry and health, by learning what might be inferred from his whole genome sequence, and that of his father, through in-depth analysis by a personal genomics company and the Broad Institute. In 2012, PBS aired another miniseries entitled Finding Your Roots also examining questions of genealogy and genetics, and hosted by Gates. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Henry Louis Gates, Jr. Full Cast & Crew Last Season Miniseries 2010 | 4 Episodes Season 1 of Faces of America premiered on February 10, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Faces of America. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords miniseries Content Score 56 We're so close, yet so far. Top Contributors R 5 Rebecca 2 Mark Gubarenko  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}