{"link": "https://www.themoviedb.org/tv/42565?language=en", "title": "Cheeky Angel", "resume": "Cheeky Angel is a comedy romance action manga series by Hiroyuki Nishimori. The story revolves around the adventures of 15-year-old schoolgirl Megumi Amatsuka, a popular and beautiful tomboy that always get into fights with a secret: she used to be a boy. Originally a serial in Shōnen Sunday, it has been collected in 20 tankōbon volumes and adapted as a 50-episode anime series. In 2001, the manga won the Shogakukan Manga Award for shōnen.", "rate": 0, "genre": ["Animation"], "cast": ["Yuji Ueda"], "character": ["Tasuke Yasuda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42565   Expand Cheeky Angel   (2002) User Score Overview Cheeky Angel is a comedy romance action manga series by Hiroyuki Nishimori. The story revolves around the adventures of 15-year-old schoolgirl Megumi Amatsuka, a popular and beautiful tomboy that always get into fights with a secret: she used to be a boy. Originally a serial in Shōnen Sunday, it has been collected in 20 tankōbon volumes and adapted as a 50-episode anime series. In 2001, the manga won the Shogakukan Manga Award for shōnen. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuji Ueda Tasuke Yasuda Full Cast & Crew Last Season Season 1 2002 | 1 Episode Season 1 of Cheeky Angel premiered on April  6, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Cheeky Angel. You can help by rating TV shows you've seen. Facts Original Name  天使な小生意気 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tms-e.com/library/on_air_back/tensi/ Genres Animation Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors M 6 Migi R 3 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}