{"link": "https://www.themoviedb.org/tv/43398?language=en", "title": "Hezar Dastan", "resume": "Hezar-Dastan 1978-1987 is a highly popular TV series in Iran directed by Ali Hatami. Hezar Dastan is considered an eternal work in the history of Iranian TV. Hatami established a small town as historical site in which he made Hezar Dastan. In 2006, Hezar Dastan was voted by the Association of Iranian movies and TV critics as the best Iranian TV series ever made.", "rate": 0, "genre": ["Drama", "History"], "cast": ["Jamshid Mashayekhi", "Ezzatolah Entezami", "Davoud Rashidi", "Ali Nassirian", "Mohamad Ali Keshavarz"], "character": ["Dash Reza Tofangchi", "Hezardastan", "Mofattesh 6 Angoshti", "Abolfath", "Shaban Ostekhani"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43398   Expand Hezar Dastan User Score Overview Hezar-Dastan 1978-1987 is a highly popular TV series in Iran directed by Ali Hatami. Hezar Dastan is considered an eternal work in the history of Iranian TV. Hatami established a small town as historical site in which he made Hezar Dastan. In 2006, Hezar Dastan was voted by the Association of Iranian movies and TV critics as the best Iranian TV series ever made. Featured Crew Ali Hatami Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamshid Mashayekhi Dash Reza Tofangchi Ezzatolah Entezami Hezardastan Davoud Rashidi Mofattesh 6 Angoshti Ali Nassirian Abolfath Mohamad Ali Keshavarz Shaban Ostekhani Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  Persian Runtime  50m Homepage  - Genres Drama History Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 15 UniBox 14 Ali TB 2 TMDb Bot n 1 nima.ghz  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}