{"link": "https://www.themoviedb.org/tv/64169?language=en", "title": "Air Warriors", "resume": "A winged fighter that hasn’t lost a fight in 26 years, a lifesaver that’s part plane and part chopper, and an attack helicopter our enemies call the Black Death. These are America’s undisputed kings of the sky: the F-15 Eagle, the V-22 Osprey, and the AH-64 Apache. And their success stories are as remarkable as they are improbable. Witness their turbulent journeys, brought to life through rarely seen combat footage and the stories of the dedicated pilots and teams who fly and maintain these ultimate air warriors.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64169   Expand Air Warriors   (2014) User Score Overview A winged fighter that hasn’t lost a fight in 26 years, a lifesaver that’s part plane and part chopper, and an attack helicopter our enemies call the Black Death. These are America’s undisputed kings of the sky: the F-15 Eagle, the V-22 Osprey, and the AH-64 Apache. And their success stories are as remarkable as they are improbable. Witness their turbulent journeys, brought to life through rarely seen combat footage and the stories of the dedicated pilots and teams who fly and maintain these ultimate air warriors. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 04 2016 | 3 Episodes Season 4 of Air Warriors premiered on June 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Air Warriors. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Documentary Original Language  English Runtime  45m Homepage   http://www.smithsonianchannel.com/shows/air-warriors/1003487 Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors o 18 obishiro S 3 ShareRapid P 3 Playpilot 1 Sebastian Mares  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}