{"link": "https://www.themoviedb.org/tv/68126?language=en", "title": "Norsemen", "resume": "Norsemen is an epic and humorous drama series set in the Viking Age. The residents of an 8th-century Viking village experience political rivalry, social change and innovations that upend their culture and way of life.", "rate": 63, "genre": ["Comedy", "Drama"], "cast": ["Kåre Conradi", "Nils Jørgen Kaalstad", "Trond Fausa Aurvåg", "Silje Torp", "Øystein Martinsen"], "character": ["Orm", "Arvid", "Rufus", "Frøya", "Kark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68126   Expand Norsemen   (2016) User Score  Play Trailer Overview Norsemen is an epic and humorous drama series set in the Viking Age. The residents of an 8th-century Viking village experience political rivalry, social change and innovations that upend their culture and way of life. Featured Crew Jon Iver Helgaker Creator Jonas Torgersen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kåre Conradi Orm Nils Jørgen Kaalstad Arvid Trond Fausa Aurvåg Rufus Silje Torp Frøya Øystein Martinsen Kark Full Cast & Crew Current Season Season 2 2017 | 6 Episodes Season 2 of Norsemen premiered on November  3, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Funny Show Open 4 by  write2topcat Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  2 Recommendations   2015-09-08 Apaches 7.3    2016-12-08 The Cuba Libre Story 7.7    2016-07-05 Fangbone! 6.7    2017-09-20 Tiempos de guerra 7.0    2015-10-14 Call My Agent 8.2    2017-01-30 Bonus Family 8.5    2017-02-08 Alias J.J. 7.8    2017-09-22 Neo Yokio 5.5  Facts Original Name  Vikingane Status  Returning Series Networks Certification  - Type  Scripted Original Language  Norwegian Runtime  30m Homepage   https://tv.nrk.no/serie/vikingane Genres Comedy Drama Keywords viking Content Score 100 Yes! Looking good! Top Contributors 46 Bendik KL 14 Kristian Larsson 11 Elizabeth Jennings 10 nycerine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}