{"link": "https://www.themoviedb.org/tv/2578?language=en", "title": "The Two of Us", "resume": "The Two of Us is an ITV comedy series starring Nicholas Lyndhurst and Janet Dibley as Ashley and Elaine, an unmarried couple living together. It was produced by London Weekend Television.\nIn the last episode, after four series, broadcast on 18 March 1990, the couple married.\nAshley's grandfather, Perce, was first played by Patrick Troughton, but later replaced by Tenniel Evans after Troughton's death. The couple regularly visited his domineering mother and suppressed father.\nTwo regional remakes were made of the series. In Germany, 41 episodes of Unter einer Decke were produced in 1993/94, using most of the scripts from the original series, combined with new scripts from Germany and the Netherlands. The Dutch version Vrienden voor het leven had 65 episodes produced in 1990-95 of which 64 have been released on DVD in the Netherlands.", "rate": 50, "genre": ["Comedy"], "cast": ["Nicholas Lyndhurst", "Janet Dibley", "Tenniel Evans", "Patrick Troughton", "Elizabeth Morgan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2578   Expand The Two of Us   (1986) User Score Overview The Two of Us is an ITV comedy series starring Nicholas Lyndhurst and Janet Dibley as Ashley and Elaine, an unmarried couple living together. It was produced by London Weekend Television. In the last episode, after four series, broadcast on 18 March 1990, the couple married. Ashley's grandfather, Perce, was first played by Patrick Troughton, but later replaced by Tenniel Evans after Troughton's death. The couple regularly visited his domineering mother and suppressed father. Two regional remakes were made of the series. In Germany, 41 episodes of Unter einer Decke were produced in 1993/94, using most of the scripts from the original series, combined with new scripts from Germany and the Netherlands. The Dutch version Vrienden voor het leven had 65 episodes produced in 1990-95 of which 64 have been released on DVD in the Netherlands. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nicholas Lyndhurst Janet Dibley Tenniel Evans Patrick Troughton Elizabeth Morgan Full Cast & Crew Last Season Season 4 1990 | 8 Episodes Season 4 of The Two of Us premiered on January 14, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Two of Us. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords couple sitcom british humour Content Score 71 Just a little bit more... Top Contributors O 5 Ozbourne o 4 olivermoran  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}