{"link": "https://www.themoviedb.org/tv/66789?language=en", "title": "24: Legacy", "resume": "The story of  military hero Eric Carter’s return to the U.S. and the trouble that follows him back – compelling him to ask CTU for help in saving his life, and stopping what potentially could be one of the largest-scale terror attacks on American soil.", "rate": 56, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["Corey Hawkins", "Miranda Otto", "Anna Diop", "Teddy Sears", "Jimmy Smits"], "character": ["Eric Carter", "Rebecca Ingram", "Nicole Carter", "Keith Mullins", "Senator John Donovan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66789   Expand 24: Legacy   (2017) User Score  Play Trailer Overview The story of  military hero Eric Carter’s return to the U.S. and the trouble that follows him back – compelling him to ask CTU for help in saving his life, and stopping what potentially could be one of the largest-scale terror attacks on American soil. Featured Crew Evan Katz Creator Manny Coto Creator atom100 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  12 Content Issues  0 Images Backdrops  13 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Corey Hawkins Eric Carter Miranda Otto Rebecca Ingram Anna Diop Nicole Carter Teddy Sears Keith Mullins Jimmy Smits Senator John Donovan Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of 24: Legacy premiered on February  4, 2017. View All Seasons Social Reviews  0 Discussions  14 Subject Status Replies Last Reply Ended Open 4 by  censorshipsucks06 odd stuff and bad writing.. SPOILER ALERT Open 1 by  Dark_Sithlord d This is garbage.... Open 0 by discostu004\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  13 Posters  11 Recommendations   2017-02-02 Training Day 6.2    2017-02-06 APB 5.9    2017-09-29 Marvel's Inhumans 5.6    2017-02-23 The Blacklist: Redemption 6.6    2017-10-01 Ten Days in the Valley 6.0    2016-09-22 Notorious 5.8    2016-10-16 Berlin Station 7.4    2016-10-05 Frequency 7.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.fox.com/24-legacy Genres Action & Adventure Drama Mystery Keywords terrorist spin off Content Score 100 Yes! Looking good! Top Contributors 49 Marr 🇳🇱 30 Banana AK 14 Avshalom Kor G 8 GladioVenom  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}