{"link": "https://www.themoviedb.org/tv/10929?language=en", "title": "The Wild Wild West", "resume": "The Wild Wild West is an American television series that ran on CBS for four seasons from September 17, 1965 to April 4, 1969. Two television movies were made with the original cast in 1979 and 1980, and the series was adapted for a motion picture in 1999.\nDeveloped at a time when the television western was losing ground to the spy genre, this show was conceived by its creator, Michael Garrison, as \"James Bond on horseback.\" Set during the administration of President Ulysses Grant, the series followed Secret Service agents James West and Artemus Gordon as they solved crimes, protected the President, and foiled the plans of megalomaniacal villains to take over all or part of the United States.\nThe show also featured a number of fantasy elements, such as the technologically advanced devices used by the agents and their adversaries. The combination of the Victorian era time-frame and the use of Verne-esque style technology have inspired some to give the show credit for the origins of the steam punk subculture. These elements were accentuated even more in the 1999 movie adaptation.\nDespite high ratings, the series was cancelled near the end of its fourth season as a concession to Congress over television violence.", "rate": 74, "genre": ["Action", "Adventure", "Comedy", "Drama", "Western"], "cast": ["Robert Conrad", "Ross Martin", "Charles Aidman", "Agnes Moorehead"], "character": ["James T. West", "Artemus Gordon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10929   Expand The Wild Wild West   (1965) User Score Overview The Wild Wild West is an American television series that ran on CBS for four seasons from September 17, 1965 to April 4, 1969. Two television movies were made with the original cast in 1979 and 1980, and the series was adapted for a motion picture in 1999. Developed at a time when the television western was losing ground to the spy genre, this show was conceived by its creator, Michael Garrison, as \"James Bond on horseback.\" Set during the administration of President Ulysses Grant, the series followed Secret Service agents James West and Artemus Gordon as they solved crimes, protected the President, and foiled the plans of megalomaniacal villains to take over all or part of the United States. The show also featured a number of fantasy elements, such as the technologically advanced devices used by the agents and their adversaries. The combination of the Victorian era time-frame and the use of Verne-esque style technology have inspired some to give the show credit for the origins of the steam punk subculture. These elements were accentuated even more in the 1999 movie adaptation. Despite high ratings, the series was cancelled near the end of its fourth season as a concession to Congress over television violence. Featured Crew Michael Garrison Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  10 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Conrad James T. West Ross Martin Artemus Gordon Charles Aidman Agnes Moorehead Full Cast & Crew Last Season Season 4 1968 | 24 Episodes Season 4 of The Wild Wild West premiered on September 27, 1968. View All Seasons Social Reviews  1 Discussions  2 A review by MagicMark  10.0 Written by  MagicMark  on May 27, 2017 I was born after the show had been off the air for a few years, so of course I discovered it in reruns.  It was syndicated all over the country by then, and locally it aired on Sunday nights at 6pm (a fairly wise strategy, since airing episodes once a week meant they wouldn't run through them too quickly). My father was a fan of the show, and we watched it together every Sunday evening after dinner. When we started this ritual I was too young to enjoy most of the shows my dad enjoyed, but this had everything I could want; good guys, bad guys, lots of action, inventive plots, gadgets, and...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  10 Posters  4 Recommendations   1967-03-28 Ironside 6.8    1965-09-14 F Troop 6.4    1968-09-28 The Ghost & Mrs. Muir 6.7    1949-09-15 The Lone Ranger 5.4    1976-10-22 The New Avengers 7.6    1951-12-16 Dragnet 7.0    1971-09-17 McMillan & Wife 7.2    1963-09-29 My Favorite Martian 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 50m Homepage  - Genres Action & Adventure Comedy Drama Western Keywords secret agent wild west Content Score 93 Almost there... Top Contributors 16 Banana O 9 Ozbourne c 7 chapichapo 3 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}