{"link": "https://www.themoviedb.org/tv/42443?language=en", "title": "The Growing Pains of Adrian Mole", "resume": "\"Just my luck - we're in the middle of a national crisis and my nose has swollen up repulsively.\" - Adrian Mole\nAdapted from Sue Townsend's bestselling novels, these hit series chronicle the everyday traumas and emotional upheavals of the legendary teenage diarist as he struggles to come to terms with life in Margaret Thatcher's 1980s England. \nGian Sammarco is the angst-ridden scribbler with literary aspirations, with Julie Walters and Lulu successively portraying his mother, Beryl Reid his opinionated grandma, Stephen Moore his errant father, and Bill Fraser his elderly chum, Bert Baxter. Adrian certainly has much to contend with. Spots erupting on his chin; 'Good Samaritan' visits to an OAP who's even more obnoxious than his dog; Barry the school bully and his extortion rackets; warring parents forever on the brink of divorce; and Pandora, the capricious love of his young life.", "rate": 75, "genre": ["Comedy"], "cast": ["Gian Sammarco", "Lulu", "Lindsey Stagg", "Beryl Reid", "Bill Fraser"], "character": ["Adrian Mole", "Pauline Mole", "Pandora", "Grandma Mole", "Bert Fraser"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42443   Expand The Growing Pains of Adrian Mole User Score Overview \"Just my luck - we're in the middle of a national crisis and my nose has swollen up repulsively.\" - Adrian Mole Adapted from Sue Townsend's bestselling novels, these hit series chronicle the everyday traumas and emotional upheavals of the legendary teenage diarist as he struggles to come to terms with life in Margaret Thatcher's 1980s England.  Gian Sammarco is the angst-ridden scribbler with literary aspirations, with Julie Walters and Lulu successively portraying his mother, Beryl Reid his opinionated grandma, Stephen Moore his errant father, and Bill Fraser his elderly chum, Bert Baxter. Adrian certainly has much to contend with. Spots erupting on his chin; 'Good Samaritan' visits to an OAP who's even more obnoxious than his dog; Barry the school bully and his extortion rackets; warring parents forever on the brink of divorce; and Pandora, the capricious love of his young life. Featured Crew Sue Townsend Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gian Sammarco Adrian Mole Lulu Pauline Mole Lindsey Stagg Pandora Beryl Reid Grandma Mole Bill Fraser Bert Fraser Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  26m Homepage  - Genres Comedy Keywords england school margaret thatcher 1980s pandora anorak Content Score 71 Just a little bit more... Top Contributors c 32 clipper314 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}