{"link": "https://www.themoviedb.org/tv/41781?language=en", "title": "The Adventures of the Good Soldier Schwejk", "resume": "Die Abenteuer des braven Soldaten Schwejk is an Austrian television series.\nSchwejk is a bumbling fool (he claims to have been discharged from the army on the grounds of being a certified idiot) but manages to outwit his superiors and his arch nemesis, the secret policeman \"Bretschneider\" with hilarious results. Set during the first world war, it follow Schwejks adventures as a recruit in the Austro-Hungarian army.", "rate": 70, "genre": ["Comedy"], "cast": ["Fritz Muliar", "Kurt Jaggberg", "Heinz Marecek", "Heinz Petters", "Brigitte Swoboda"], "character": ["Josef Schwejk", "Feldwebel Wanek", "Marek", "Oberleutnant Lukasch", "Marie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 41781   Expand The Adventures of the Good Soldier Schwejk   (1972) User Score Overview Die Abenteuer des braven Soldaten Schwejk is an Austrian television series. Schwejk is a bumbling fool (he claims to have been discharged from the army on the grounds of being a certified idiot) but manages to outwit his superiors and his arch nemesis, the secret policeman \"Bretschneider\" with hilarious results. Set during the first world war, it follow Schwejks adventures as a recruit in the Austro-Hungarian army. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fritz Muliar Josef Schwejk Kurt Jaggberg Feldwebel Wanek Heinz Marecek Marek Heinz Petters Oberleutnant Lukasch Brigitte Swoboda Marie Full Cast & Crew Last Season Season 1 1972 | 13 Episodes Season 1 of The Adventures of the Good Soldier Schwejk premiered on February  6, 1972. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Adventures of the Good Soldier Schwejk. You can help by rating TV shows you've seen. Facts Original Name  Die Abenteuer des braven Soldaten Schwejk Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  60m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 19 Samara R 7 RudyTG D 2 Dan185 l 1 lonestarr102  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}