{"link": "https://www.themoviedb.org/tv/23997?language=en", "title": "The Last Precinct", "resume": "The Last Precinct is an American comedy series that aired on NBC from January to May 1986 on Friday Night at 9:00pm. The series stars Adam West as Capt. Rick Wright, leading a group of misfit police academy rejects. The pilot for the Stephen J. Cannell series debuted after Super Bowl XX in 1986, but the show was canceled within two months of its April premiere. This was the only sitcom from Stephen J. Cannell Productions.", "rate": 50, "genre": ["Comedy"], "cast": ["Adam West", "Lucy Lee Flippin", "Rick Ducommun", "Wings Hauser", "Randi Brooks"], "character": ["Captain Rick Wright", "Officer Rina Starland", "Officer 'Raid' Raider", "Lieutenant Hobbs", "Officer Mel Brubaker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23997   Expand The Last Precinct   (1986) User Score Overview The Last Precinct is an American comedy series that aired on NBC from January to May 1986 on Friday Night at 9:00pm. The series stars Adam West as Capt. Rick Wright, leading a group of misfit police academy rejects. The pilot for the Stephen J. Cannell series debuted after Super Bowl XX in 1986, but the show was canceled within two months of its April premiere. This was the only sitcom from Stephen J. Cannell Productions. Featured Crew Stephen J. Cannell Creator Frank Lupo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam West Captain Rick Wright Lucy Lee Flippin Officer Rina Starland Rick Ducommun Officer 'Raid' Raider Wings Hauser Lieutenant Hobbs Randi Brooks Officer Mel Brubaker Full Cast & Crew Last Season Season 1 1986 | 8 Episodes Season 1 of The Last Precinct premiered on January 26, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Last Precinct. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords police misfit police precinct Content Score 79 Pump it up! We're close now. Top Contributors 20 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}