{"link": "https://www.themoviedb.org/tv/47285?language=en", "title": "Tosca in the Settings and at the Times of Tosca", "resume": "Contemporary Rome is the setting for this unique and highly innovative version of Puccini's Tosca, performed in the Roman locations - and at the times of day - as Puccini had written into his score. Thus the action opens in the beautiful 16th-century church of Sant'Andrea della Valle at noon, where Cavaradossi (Placido Domingo) is painting a portrait, moves to the Farnese Palace that evening where Tosca (Catherine Malfitano) dramatically stabs the lustful Scarpia (Ruggero Raimondi), and finally to the battlements of the Castel Sant'Angelo at dawn the following day where the final drama is played out.", "rate": 0, "genre": ["Drama", "Action"], "cast": ["Placido Domino", "Catherine Malfitano", "Ruggero Raimondi", "Giacomo Puccini", "Zubin Mehta"], "character": ["Cavaradossi", "Tosca", "Scarpia", "Composer", "Conductor"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47285   Expand Tosca in the Settings and at the Times of Tosca   (1992) User Score Overview Contemporary Rome is the setting for this unique and highly innovative version of Puccini's Tosca, performed in the Roman locations - and at the times of day - as Puccini had written into his score. Thus the action opens in the beautiful 16th-century church of Sant'Andrea della Valle at noon, where Cavaradossi (Placido Domingo) is painting a portrait, moves to the Farnese Palace that evening where Tosca (Catherine Malfitano) dramatically stabs the lustful Scarpia (Ruggero Raimondi), and finally to the battlements of the Castel Sant'Angelo at dawn the following day where the final drama is played out. Featured Crew Giuseppe Patroni Griffi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Placido Domino Cavaradossi Catherine Malfitano Tosca Ruggero Raimondi Scarpia Giacomo Puccini Composer Zubin Mehta Conductor Full Cast & Crew Last Season Unique 1992 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tosca in the Settings and at the Times of Tosca. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Action Keywords opera Content Score 93 Almost there... Top Contributors P 16 PhilJPearson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}