{"link": "https://www.themoviedb.org/tv/63201?language=en", "title": "Glitch", "resume": "James Hayes is a small town police man who is called to the local cemetery in the middle of the night after six people have inexplicably risen from the dead in perfect health. With no memory of their identities, they are determined to discover who they are and what has happened to them. James recognises one of them and along with local doctor Elishia Glass, struggles to keep the case hidden from his colleagues, his family and the world. The six people are all linked in some way and the search begins for someone who knows the truth about how and why they have returned.", "rate": 66, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Patrick Brammall", "Genevieve O'Reilly", "Emma Booth", "Emily Barclay", "Ned Dennehy"], "character": ["James Hayes", "Elishia Glass", "Kate Willis", "Sarah Hayes", "Paddy Fitzgerald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63201   Expand Glitch   (2015) User Score  Play Trailer Overview James Hayes is a small town police man who is called to the local cemetery in the middle of the night after six people have inexplicably risen from the dead in perfect health. With no memory of their identities, they are determined to discover who they are and what has happened to them. James recognises one of them and along with local doctor Elishia Glass, struggles to keep the case hidden from his colleagues, his family and the world. The six people are all linked in some way and the search begins for someone who knows the truth about how and why they have returned. Featured Crew Tony Ayres Creator Louise Fox Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  1 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick Brammall James Hayes Genevieve O'Reilly Elishia Glass Emma Booth Kate Willis Emily Barclay Sarah Hayes Ned Dennehy Paddy Fitzgerald Full Cast & Crew Last Season Season 2 2017 | 6 Episodes Season 2 of Glitch premiered on September 14, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply James and Sarah, what a pair Open 8 by  Melanie Will the Doc be back? Open 0 by write2topcat\n      \n     There Must Be Rules, Vic and Charlie Open 0 by write2topcat\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2014-11-22 Witnesses 6.6    2014-08-13 Utopia 8.2    2015-02-04 Winter 7.0    2014-10-27 Tornado Hunters 6.0    2016-06-08 Power Monkeys 7.0    2015-05-21 Between 5.4    2013-10-29 Hinterland 7.5    2016-08-02 Borderline 7.1  Facts Status  Returning Series Networks Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Scripted Original Language  English Runtime  52m Homepage   http://www.abc.net.au/tv/programs/glitch/ Genres Drama Sci-Fi & Fantasy Keywords small town cemetery resurrection science fiction police officer Content Score 100 Yes! Looking good! Top Contributors 53 Elizabeth Jennings 7 Banana 7 United600 TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}