{"link": "https://www.themoviedb.org/tv/68604?language=en", "title": "Ishqbaaaz", "resume": "The story is about a rich business family, the Oberoi family. The family consists of two brothers and their wives. The elder brother Tej has a wife Jhanvi and has an illicit affair with his secretary Svetlana. Tej and his alcoholic wife Jhanvi have three children. Their elder son is Omkara, a sculptor and a self made billionaire. He has a history of drug abuse. He is an understanding person and hates his father. Tej and Jhanvi’s second child, Rudra, is a flirtatious guy and a playboy who is a fitness freak and loves partying and women, however, he does not believe in the concept of marriage.", "rate": 90, "genre": ["Drama", "Family"], "cast": ["Nakuul Mehta", "Surbhi Chandna", "Kunal Jaisingh", "Leenesh Mattoo"], "character": ["Shivaay Singh Oberoi", "Anika", "Omkara Singh Oberoi", "Rudra Singh Oberoi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68604   Expand Ishqbaaaz   (2016) User Score Overview The story is about a rich business family, the Oberoi family. The family consists of two brothers and their wives. The elder brother Tej has a wife Jhanvi and has an illicit affair with his secretary Svetlana. Tej and his alcoholic wife Jhanvi have three children. Their elder son is Omkara, a sculptor and a self made billionaire. He has a history of drug abuse. He is an understanding person and hates his father. Tej and Jhanvi’s second child, Rudra, is a flirtatious guy and a playboy who is a fitness freak and loves partying and women, however, he does not believe in the concept of marriage. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nakuul Mehta Shivaay Singh Oberoi Surbhi Chandna Anika Kunal Jaisingh Omkara Singh Oberoi Leenesh Mattoo Rudra Singh Oberoi Full Cast & Crew Last Season Season 1 2016 | 21 Episodes Season 1 of Ishqbaaaz premiered on June 27, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Ishqbaaaz. You can help by rating TV shows you've seen. Facts Original Name  इश्कबाज़ Status  Returning Series Network Star Plus Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Hindi Runtime  22m Homepage   http://www.hotstar.com/tv/ishqbaaaz/9567 Genres Drama Family Keywords romance india Content Score 86 Almost there... Top Contributors 24 Amaan4194 8 vmesh 5 Banana m 2 movieskickk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}