{"link": "https://www.themoviedb.org/tv/71365?language=en", "title": "Battlestar Galactica", "resume": "A re-imagining of the original series in which a \"rag-tag fugitive fleet\" of the last remnants of mankind flees pursuing robots while simultaneously searching for their true home, Earth.", "rate": 83, "genre": ["Action", "Adventure", "Drama"], "cast": ["Edward James Olmos", "Mary McDonnell", "Katee Sackhoff", "Jamie Bamber", "James Callis"], "character": ["Commander Adama", "President Laura Roslin", "Kara 'Starbuck' Thrace", "Lee 'Apollo' Adama", "Gaius Baltar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71365   Expand Battlestar Galactica   (2003) User Score Overview A re-imagining of the original series in which a \"rag-tag fugitive fleet\" of the last remnants of mankind flees pursuing robots while simultaneously searching for their true home, Earth. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Edward James Olmos Commander Adama Mary McDonnell President Laura Roslin Katee Sackhoff Kara 'Starbuck' Thrace Jamie Bamber Lee 'Apollo' Adama James Callis Gaius Baltar Full Cast & Crew Last Season Miniseries 2003 | 2 Episodes Season 1 of Battlestar Galactica premiered on December  8, 2003. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Cast Interviews From SDCC Open 11 by  AlienFanatic Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2004-10-18 Battlestar Galactica 8.1    2010-01-22 Caprica 6.7    2002-09-20 Firefly 8.2    1987-09-28 Star Trek: The Next Generation 8.2    2004-07-15 Stargate Atlantis 7.8    1994-01-26 Babylon 5 8.1    2001-09-26 Star Trek: Enterprise 7.4    1993-09-10 The X-Files 8.1  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  180m Homepage   http://www.syfy.com/battlestargalactica Genres Action & Adventure Drama Keywords survivor miniseries planet genocide quest Content Score 86 Almost there... Top Contributors TB 61 TMDb Bot 7 Stabiliser R 5 Rebecca 3 Travis Bell  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}