{"link": "https://www.themoviedb.org/tv/35553?language=en", "title": "Bush Baby, Little Angel of the Grasslands", "resume": "Bush Baby, Little Angel of the Grasslands, shortened as The Bush Baby, is the title of a 1992 anime series consisting of 40, 25-minute episodes. It is based on the novel, The Bushbabies, by Canadian author William Stevenson.\nThe series is part of Fuji Television & Nippon Animation's World Masterpiece Theater which consists of anime TV series adaptations of classic children's books. It has also been broadcast internationally on networks such as Antena 3, Italia 1, Tele 5, ORF1, ABS-CBN, GMA 7, Quality TeleVision and TVOntario.", "rate": 0, "genre": ["Animation", "Drama", "Action", "Adventure"], "cast": ["Kenichi Ogata"], "character": ["Professor Crankshaw (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35553   Expand Bush Baby, Little Angel of the Grasslands User Score Overview Bush Baby, Little Angel of the Grasslands, shortened as The Bush Baby, is the title of a 1992 anime series consisting of 40, 25-minute episodes. It is based on the novel, The Bushbabies, by Canadian author William Stevenson. The series is part of Fuji Television & Nippon Animation's World Masterpiece Theater which consists of anime TV series adaptations of classic children's books. It has also been broadcast internationally on networks such as Antena 3, Italia 1, Tele 5, ORF1, ABS-CBN, GMA 7, Quality TeleVision and TVOntario. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenichi Ogata Professor Crankshaw (voice) Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Facts Original Name  大草原の小さな天使　ブッシュベイビー Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Drama Action & Adventure Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors s 10 smatsh t 6 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}