{"link": "https://www.themoviedb.org/tv/31609?language=en", "title": "Jinx", "resume": "Jinx is a British children's comedy television sitcom based on the 'Lulu Baker' trilogy of books, written by Fiona Dunbar. The first series premiered on 31 October 2009 on CBBC and ended its initial run on 23 January 2010. The series follows the life of Lulu Baker, a teenager who is able to cook spells. However, her fairy godmother, Cookie, stops things from going smoothly.\nThe first series was produced by Kindle Entertainment and over a three month period, filmed in BBC Manchester studios and Oxford Road Studios, a second series has not been commissioned yet. Australian free-to-air channel ABC3 started airing the first episode on 28 September 2010.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Amber Beattie", "Chizzy Akudolu", "Michael Nardone", "Lucy Chalkley", "Ben-Ryan Davies"], "character": ["Lulu Baker", "Cookie", "Mike Baker", "Minty Le Bone", "Chip"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31609   Expand Jinx   (2009) User Score Overview Jinx is a British children's comedy television sitcom based on the 'Lulu Baker' trilogy of books, written by Fiona Dunbar. The first series premiered on 31 October 2009 on CBBC and ended its initial run on 23 January 2010. The series follows the life of Lulu Baker, a teenager who is able to cook spells. However, her fairy godmother, Cookie, stops things from going smoothly. The first series was produced by Kindle Entertainment and over a three month period, filmed in BBC Manchester studios and Oxford Road Studios, a second series has not been commissioned yet. Australian free-to-air channel ABC3 started airing the first episode on 28 September 2010. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amber Beattie Lulu Baker Chizzy Akudolu Cookie Michael Nardone Mike Baker Lucy Chalkley Minty Le Bone Ben-Ryan Davies Chip Full Cast & Crew Last Season Season 1 — | 13 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jinx. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords magic cooking teenager teen comedy Content Score 86 Almost there... Top Contributors 24 Banana 1 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}