{"link": "https://www.themoviedb.org/tv/6139?language=en", "title": "Love Bond", "resume": "Love Bond is a TVB modern drama series broadcast in February 2005.\nIt is a warm family show which follows two families, the Gei and the Lam, who are neighbors in the same building. This series also marked the fifth collaboration between Michael Tao and Kenix Kwok following the first three installments of the Detective Investigation Files Series and 2004's Shine On You.", "rate": 0, "genre": ["Drama"], "cast": ["Kenix Kwok", "Michael Tao", "Moses Chan", "Anne Heung", "Paul Chun"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6139   Expand Love Bond   (2005) User Score Overview Love Bond is a TVB modern drama series broadcast in February 2005. It is a warm family show which follows two families, the Gei and the Lam, who are neighbors in the same building. This series also marked the fifth collaboration between Michael Tao and Kenix Kwok following the first three installments of the Detective Investigation Files Series and 2004's Shine On You. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenix Kwok Michael Tao Moses Chan Anne Heung Paul Chun Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Love Bond. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.tvcity.tvb.com/drama/lovebond Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}