{"link": "https://www.themoviedb.org/tv/21172?language=en", "title": "Charles Darwin and the Tree of Life", "resume": "Charles Darwin and the Tree of Life is a 2009 television documentary about Charles Darwin and his revolutionary theory of evolution through natural selection, produced by the BBC to mark the bicentenary of Darwin's birth. It is part of the BBC Darwin Season. The presenter, David Attenborough, outlines the development of the theory by Darwin through his observations of animals and plants in nature and in the domesticated state, visiting sites important in Darwin's own life, including Down House, Cambridge University and the Natural History Museum, and using archive footage from Attenborough's many nature documentaries for the BBC. He reviews the development of the theory since its beginnings, and its revolutionary impact on the way in which humans view themselves - not as having dominion over the animals as The Bible says, but as part of the natural world and subject to the same controlling forces that govern all life on Earth.", "rate": 0, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21172   Expand Charles Darwin and the Tree of Life User Score Overview Charles Darwin and the Tree of Life is a 2009 television documentary about Charles Darwin and his revolutionary theory of evolution through natural selection, produced by the BBC to mark the bicentenary of Darwin's birth. It is part of the BBC Darwin Season. The presenter, David Attenborough, outlines the development of the theory by Darwin through his observations of animals and plants in nature and in the domesticated state, visiting sites important in Darwin's own life, including Down House, Cambridge University and the Natural History Museum, and using archive footage from Attenborough's many nature documentaries for the BBC. He reviews the development of the theory since its beginnings, and its revolutionary impact on the way in which humans view themselves - not as having dominion over the animals as The Bible says, but as part of the natural world and subject to the same controlling forces that govern all life on Earth. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00hd5mf Genres Documentary Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}