{"link": "https://www.themoviedb.org/tv/68814?language=en", "title": "Strong Woman Do Bong Soon", "resume": "She is no ordinary woman. Do Bong Soon is a woman who possesses Herculean strength. She can crush objects in her bare hands when she holds them too tightly. Although Bong Soon longs to be a dainty, elegant woman that men fall in love with, she can’t deny her superhuman strength. Her special attribute allows her to get a job as a bodyguard for Ahn Min Hyuk, the chaebol heir with eccentric tendencies who runs a gaming company. Bong Soon’s childhood friend In Gook Doo has had a secret crush on her since elementary school. How will he react when sparks begin to fly between Bong Soon and her crazy boss?", "rate": 68, "genre": ["Comedy", "Action", "Adventure"], "cast": ["Park Bo-young", "Park Hyung-sik", "Ji-soo", "An Woo-yeon", "Seol In-Ah"], "character": ["Do Bong-Soon", "An Min-Hyuk", "In Kook-Doo", "Do Bong-Ki", "Jo Hee-Ji"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68814   Expand Strong Woman Do Bong Soon   (2017) User Score Overview She is no ordinary woman. Do Bong Soon is a woman who possesses Herculean strength. She can crush objects in her bare hands when she holds them too tightly. Although Bong Soon longs to be a dainty, elegant woman that men fall in love with, she can’t deny her superhuman strength. Her special attribute allows her to get a job as a bodyguard for Ahn Min Hyuk, the chaebol heir with eccentric tendencies who runs a gaming company. Bong Soon’s childhood friend In Gook Doo has had a secret crush on her since elementary school. How will he react when sparks begin to fly between Bong Soon and her crazy boss? Featured Crew Baek Mi-kyung Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Park Bo-young Do Bong-Soon Park Hyung-sik An Min-Hyuk Ji-soo In Kook-Doo An Woo-yeon Do Bong-Ki Seol In-Ah Jo Hee-Ji Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Strong Woman Do Bong Soon premiered on February 24, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2016-08-12 Ask the Storybots 7.5    2015-08-07 Project Mc² 4.7    2012-11-01 Redfern Now 8.0    2015-07-03 Oh My Ghostess 7.9    2014-02-09 Cheo Yong 7.4    2017-10-14 Black 6.8    2016-03-23 Click your Heart 7.0    2015-07-22 Diamond Lover 6.9  Facts Original Name  힘쎈여자 도봉순 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.jtbc.joins.com/dobongsoon Genres Comedy Action & Adventure Keywords romance korea Content Score 93 Almost there... Top Contributors M 53 Maria180493 10 Mohammed Osama Mohamed 8 kim jaecheon d 4 dlovatolaura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}