{"link": "https://www.themoviedb.org/tv/1017?language=en", "title": "Laff-a-Lympics", "resume": "Laff-A-Lympics is the co-headlining segment, with Scooby-Doo, of the package Saturday morning cartoon series Scooby's All-Star Laff-A-Lympics, produced by Hanna-Barbera Productions beginning in 1977. The show was a spoof of the Olympics and the ABC television series Battle of the Network Stars, which debuted one year earlier. It featured 45 Hanna-Barbera characters organized into the teams which would compete each week for gold, silver, and bronze medals. One season of 16 episodes was produced in 1977–78, and eight new episodes combined with reruns for the 1978–79 season as Scooby's All-Stars. Unlike most cartoon series' produced by Hanna-Barbera in the 1970s, Laff-A-Lympics did not contain a laugh track.", "rate": 0, "genre": ["Animation", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1017   Expand Laff-a-Lympics User Score Overview Laff-A-Lympics is the co-headlining segment, with Scooby-Doo, of the package Saturday morning cartoon series Scooby's All-Star Laff-A-Lympics, produced by Hanna-Barbera Productions beginning in 1977. The show was a spoof of the Olympics and the ABC television series Battle of the Network Stars, which debuted one year earlier. It featured 45 Hanna-Barbera characters organized into the teams which would compete each week for gold, silver, and bronze medals. One season of 16 episodes was produced in 1977–78, and eight new episodes combined with reruns for the 1978–79 season as Scooby's All-Stars. Unlike most cartoon series' produced by Hanna-Barbera in the 1970s, Laff-A-Lympics did not contain a laugh track. Featured Crew William Hanna Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}