{"link": "https://www.themoviedb.org/tv/20874?language=en", "title": "War of the Century", "resume": "The War of the Century: When Hitler Fought Stalin, is a BBC documentary film series that examines Adolf Hitler's invasion of the Soviet Union in 1941 and the no-holds-barred war on both sides. It not only examines the war but also the terror inside the Soviet Union at the time due to the paranoia of Joseph Stalin - the revenge atrocities, the Great Purge of army officers, the near-lunacy orders, and the paranoia of being upstaged by others, especially Marshal Zhukov. The historical adviser is Ian Kershaw.", "rate": 80, "genre": ["Documentary"], "cast": ["Samuel West"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20874   Expand War of the Century   (1999) User Score Overview The War of the Century: When Hitler Fought Stalin, is a BBC documentary film series that examines Adolf Hitler's invasion of the Soviet Union in 1941 and the no-holds-barred war on both sides. It not only examines the war but also the terror inside the Soviet Union at the time due to the paranoia of Joseph Stalin - the revenge atrocities, the Great Purge of army officers, the near-lunacy orders, and the paranoia of being upstaged by others, especially Marshal Zhukov. The historical adviser is Ian Kershaw. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Samuel West Full Cast & Crew Last Season Season 1 1999 | 4 Episodes Season 1 of War of the Century premiered on October  5, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on War of the Century. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors s 5 speedycars 4 abernaolao R 1 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}