{"link": "https://www.themoviedb.org/tv/9156?language=en", "title": "Frank Herbert's Children of Dune", "resume": "Frank Herbert's Children of Dune is a three-part miniseries written by John Harrison and directed by Greg Yaitanes, based on Frank Herbert's novels Dune Messiah and Children of Dune. First broadcast in the United States on March 16, 2003, Children of Dune is the sequel to the 2000 miniseries Frank Herbert's Dune and produced by the Sci Fi Channel. As of 2004, this miniseries and its predecessor were two of the three highest-rated programs ever to be broadcast on the Sci-Fi Channel.\nIn 2003, the critically acclaimed miniseries won a Primetime Emmy Award for Outstanding Special Visual Effects.", "rate": 69, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Jessica Brooks", "Martin McDougall", "Alice Krige", "Edward Atterton", "Steven Berkoff"], "character": ["Ghanima Atreides", "Scytale", "Lady Jessica", "Duncan Idaho", "Stilgar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9156   Expand Frank Herbert's Children of Dune   (2003) User Score  Play Trailer Overview Frank Herbert's Children of Dune is a three-part miniseries written by John Harrison and directed by Greg Yaitanes, based on Frank Herbert's novels Dune Messiah and Children of Dune. First broadcast in the United States on March 16, 2003, Children of Dune is the sequel to the 2000 miniseries Frank Herbert's Dune and produced by the Sci Fi Channel. As of 2004, this miniseries and its predecessor were two of the three highest-rated programs ever to be broadcast on the Sci-Fi Channel. In 2003, the critically acclaimed miniseries won a Primetime Emmy Award for Outstanding Special Visual Effects. Featured Crew John Harrison Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  13 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Brooks Ghanima Atreides Martin McDougall Scytale Alice Krige Lady Jessica Edward Atterton Duncan Idaho Steven Berkoff Stilgar Full Cast & Crew Last Season Season 1 2003 | 3 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Frank Herbert's Children of Dune. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  13 Posters  9 Recommendations   2000-12-03 Frank Herbert's Dune 6.7    1999-03-19 Farscape 7.7    2003-12-08 Battlestar Galactica 8.3    2010-01-22 Caprica 6.7    2011-05-23 All Watched Over by Machines of Loving Grace 8.3    2006-09-11 Celebrity Masterchef 5.7    1992-03-04 The Young Indiana Jones Chronicles 6.3    1995-09-22 Space: Above and Beyond 6.8  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  English Runtime  88m, 266m Homepage  - Genres Sci-Fi & Fantasy Keywords prophecy world religion telepathy sandstorm Content Score 100 Yes! Looking good! Top Contributors TB 89 TMDb Bot m 27 mertvec z 15 zurman1 R 15 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}