{"link": "https://www.themoviedb.org/tv/1018?language=en", "title": "Bonanza", "resume": "Bonanza is an NBC television western series that ran from September 12, 1959 to January 16, 1973. Lasting 14 seasons and 430 episodes, it ranks as the second longest running western series, and the fourth longest running episodic series in U.S broadcast history: Gunsmoke, The Simpsons, Law and Order, Bonanza, Ozzie and Harriet. It continues to air in syndication.\nThe show centers around the Cartwright family, who live in the area of Virginia City, Nevada, bordering Lake Tahoe. The series stars Lorne Greene, Pernell Roberts, Dan Blocker, Michael Landon, and later, David Canary.\nThe title \"Bonanza\" is a term used by miners in regard to a large vein or deposit of ore, and commonly refers to The Comstock Lode. In 2002, Bonanza was ranked No. 43 on TV Guide's 50 Greatest TV Shows of All Time, and in 2013 TV Guide included it in its list of The 60 Greatest Dramas of All Time. The time period for the television series is roughly between 1861 to 1867 during and shortly after the American Civil War.\nDuring the summer of 1972, NBC aired reruns of episodes from the 1967-1970 period in prime time on Sunday evening under the title Ponderosa.", "rate": 63, "genre": ["Western", "Action", "Adventure"], "cast": ["Lorne Greene", "Dan Blocker", "Michael Landon"], "character": ["Ben Cartwright", "Eric 'Hoss' Cartwright", "Joseph 'Little Joe' Cartwright"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1018   Expand Bonanza   (1959) User Score Overview Bonanza is an NBC television western series that ran from September 12, 1959 to January 16, 1973. Lasting 14 seasons and 430 episodes, it ranks as the second longest running western series, and the fourth longest running episodic series in U.S broadcast history: Gunsmoke, The Simpsons, Law and Order, Bonanza, Ozzie and Harriet. It continues to air in syndication. The show centers around the Cartwright family, who live in the area of Virginia City, Nevada, bordering Lake Tahoe. The series stars Lorne Greene, Pernell Roberts, Dan Blocker, Michael Landon, and later, David Canary. The title \"Bonanza\" is a term used by miners in regard to a large vein or deposit of ore, and commonly refers to The Comstock Lode. In 2002, Bonanza was ranked No. 43 on TV Guide's 50 Greatest TV Shows of All Time, and in 2013 TV Guide included it in its list of The 60 Greatest Dramas of All Time. The time period for the television series is roughly between 1861 to 1867 during and shortly after the American Civil War. During the summer of 1972, NBC aired reruns of episodes from the 1967-1970 period in prime time on Sunday evening under the title Ponderosa. Featured Crew David Dortort Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  9 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lorne Greene Ben Cartwright Dan Blocker Eric 'Hoss' Cartwright Michael Landon Joseph 'Little Joe' Cartwright Full Cast & Crew Last Season Season 14 1972 | 16 Episodes Season 14 of Bonanza premiered on September 12, 1972. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply lost episodes Open 0 by manfromatlantis\n      \n     the  best episodes Open 1 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  2 Recommendations   1959-09-15 Laramie 6.7    1954-09-12 Lassie 5.3    1970-09-16 McCloud 7.0    1955-09-10 Gunsmoke 6.4    1961-01-05 Mister Ed 7.4    1964-09-19 Flipper 4.6    1984-09-20 Who's the Boss? 6.4    1962-09-26 The Beverly Hillbillies 6.6  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m, 49m Homepage  - Genres Western Action & Adventure Keywords nevada ranch family single father cowboy wild west 19th century Content Score 64 We're so close, yet so far. Top Contributors 41 Steve 21 Banana 19 Elizabeth Jennings 16 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}