{"link": "https://www.themoviedb.org/tv/67265?language=en", "title": "Chesapeake Shores", "resume": "A divorced mom deals with an old romance and complicated family issues when she returns to her hometown with her twin daughters.", "rate": 77, "genre": ["Drama", "Family"], "cast": ["Meghan Ory", "Jesse Metcalfe", "Treat Williams", "Diane Ladd", "Barbara Niven"], "character": ["Abby O'Brien", "Trace Riley", "Mick O'Brien", "Nell O'Brien", "Megan O'Brien"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67265   Expand Chesapeake Shores   (2016) User Score  Play Trailer Overview A divorced mom deals with an old romance and complicated family issues when she returns to her hometown with her twin daughters. Featured Crew John Tinker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Meghan Ory Abby O'Brien Jesse Metcalfe Trace Riley Treat Williams Mick O'Brien Diane Ladd Nell O'Brien Barbara Niven Megan O'Brien Full Cast & Crew Last Season Season 2 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Jess Open 0 by nukyatalks\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2016-11-25 Gilmore Girls: A Year in the Life 7.4    2016-06-21 Greenleaf 6.8    2017-09-27 SEAL Team 6.6    2017-11-02 S.W.A.T. 6.6    2012-10-10 Nashville 6.1    2017-09-25 The Good Doctor 7.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.hallmarkchannel.com/chesapeake-shores Genres Drama Family Keywords based on novel or book hometown Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings 7 Banana b 5 bugfix 4 RubeensVinicius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}