{"link": "https://www.themoviedb.org/tv/39409?language=en", "title": "Mr. Freeman", "resume": "Mr. Freeman is a Russian animated web series named after its main character. The series appeared on YouTube on September 21, 2009 and got considerable popularity in Runet. The main content of the series is monologues which in a harsh manner criticize the lifestyle of modern everyman. As of August 16, 2012 there are 19 episodes published. The total number of views is more than 35 million.\nThe earliest five episodes were dubbed by the Russian actor Vadim Demchog. On November 14, 2010 Demchog officially announced his immediate relation to the project. After that, the production of new episodes temporarily ceased, but on January 11, 2011 a new video was released. Since the episode \"Me?\" Vadim Demchog dubs the series again.\nIt is also known that an animator Pavel Muntyan worked on the first series.\nA possible prototype of the series is believed to be the main character of \"Franky-show\", broadcast from 2003 to 2011 on the Silver Rain Radio, which is also dubbed by exactly Vadim Demchog, and the script writer of some episodes is Pavel Muntyan. Many episodes of the program have been transferred to the cartoon, for example, the text of the ending of the episode \"Franky-show. Cicciolina\" is almost completely identical to the third episode of Mr. Freeman's \"Part 03. Will Sell Myself Expensive\".", "rate": 0, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39409   Expand Mr. Freeman User Score Overview Mr. Freeman is a Russian animated web series named after its main character. The series appeared on YouTube on September 21, 2009 and got considerable popularity in Runet. The main content of the series is monologues which in a harsh manner criticize the lifestyle of modern everyman. As of August 16, 2012 there are 19 episodes published. The total number of views is more than 35 million. The earliest five episodes were dubbed by the Russian actor Vadim Demchog. On November 14, 2010 Demchog officially announced his immediate relation to the project. After that, the production of new episodes temporarily ceased, but on January 11, 2011 a new video was released. Since the episode \"Me?\" Vadim Demchog dubs the series again. It is also known that an animator Pavel Muntyan worked on the first series. A possible prototype of the series is believed to be the main character of \"Franky-show\", broadcast from 2003 to 2011 on the Silver Rain Radio, which is also dubbed by exactly Vadim Demchog, and the script writer of some episodes is Pavel Muntyan. Many episodes of the program have been transferred to the cartoon, for example, the text of the ending of the episode \"Franky-show. Cicciolina\" is almost completely identical to the third episode of Mr. Freeman's \"Part 03. Will Sell Myself Expensive\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  3m Homepage   http://www.mf0.me Genres Animation Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}