{"link": "https://www.themoviedb.org/tv/4080?language=en", "title": "Star Trek: Odyssey", "resume": "Star Trek: Odyssey is a Star Trek fan production from Areakt Productions, the creators of Star Trek: Hidden Frontier. Set after the end of Hidden Frontier, Odyssey follows the USS Odyssey as it struggles to get home from a dangerous mission that has taken it and her crew 2.5 million light years from home... to the unknowns of the Andromeda Galaxy. This is the first Star Trek series, fan produced or otherwise, to take place outside of our own Earth's galaxy.\nThe pilot for Odyssey, entitled Iliad, was put to wide release on Saturday, September 22, 2007 and is now freely available on the official website.\nAccording to the creator of Hidden Frontier and Odyssey, Rob Caves, Odyssey will be primarily centered around Lt. Cmdr. Ro Nevin in a loose retelling of Homer's classic story of The Odyssey, set in the 24th century universe of Star Trek.\nRo was involved in numerous episodes of the Star Trek: Hidden Frontier series, and was in the first gay plotlines during the second season of Hidden Frontier. Caves has said that although Ro is an openly gay/bisexual character, the new series \"will focus instead on new aspects of his evolving persona that have not been explored yet in Hidden Frontier\".", "rate": 80, "genre": ["Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4080   Expand Star Trek: Odyssey   (2007) User Score Overview Star Trek: Odyssey is a Star Trek fan production from Areakt Productions, the creators of Star Trek: Hidden Frontier. Set after the end of Hidden Frontier, Odyssey follows the USS Odyssey as it struggles to get home from a dangerous mission that has taken it and her crew 2.5 million light years from home... to the unknowns of the Andromeda Galaxy. This is the first Star Trek series, fan produced or otherwise, to take place outside of our own Earth's galaxy. The pilot for Odyssey, entitled Iliad, was put to wide release on Saturday, September 22, 2007 and is now freely available on the official website. According to the creator of Hidden Frontier and Odyssey, Rob Caves, Odyssey will be primarily centered around Lt. Cmdr. Ro Nevin in a loose retelling of Homer's classic story of The Odyssey, set in the 24th century universe of Star Trek. Ro was involved in numerous episodes of the Star Trek: Hidden Frontier series, and was in the first gay plotlines during the second season of Hidden Frontier. Caves has said that although Ro is an openly gay/bisexual character, the new series \"will focus instead on new aspects of his evolving persona that have not been explored yet in Hidden Frontier\". Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2011 | 1 Episode Season 3 of Star Trek: Odyssey premiered on September 10, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Star Trek: Odyssey. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors R 9 Rebecca w 6 webmaster 2 rtentser KC 2 King Cover  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}