{"link": "https://www.themoviedb.org/tv/50838?language=en", "title": "Vyprávěj", "resume": "Vyprávěj je český televizní retroseriál vyráběný v koprodukci České televize a společnosti Dramedy Productions. Natáčení začalo v roce 2009 a první díl s názvem Od začátku byl uveden na programu ČT1 v pondělí 31. srpna 2009. Seriál je uváděn v týdenní periodicitě a stopáž každého dílu je cca 52 minut. Děj se odehrává v Československu a je zasazen do skutečných historických událostí, které ovlivňují příběhy jednotlivých postav. Dobovou atmosféru autoři navozují ukázkami z dobových Československých filmových týdeníků s původními komentáři, případně novým historizujícím komentářem, který namluvil Vladimír Fišer. Příběh je doprovázen hlasem vypravěče, který propůjčil herec Vojtěch Kotek a poté Matěj Hádek. Scénáře vznikají pod vedením scenáristy Rudolfa Merknera.", "rate": 70, "genre": ["Comedy", "Drama", "Family"], "cast": ["Ondrej Veselý", "Svatopluk Skopal", "Veronika Freimanová", "Andrea Kerestešová", "Roman Vojtek"], "character": ["Jarda Franc", "Josef Dvořák", "Jana Dvořáková", "Eva Dvořáková", "Karel Dvořák"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 50838   Expand Vyprávěj   (2009) User Score Overview Vyprávěj je český televizní retroseriál vyráběný v koprodukci České televize a společnosti Dramedy Productions. Natáčení začalo v roce 2009 a první díl s názvem Od začátku byl uveden na programu ČT1 v pondělí 31. srpna 2009. Seriál je uváděn v týdenní periodicitě a stopáž každého dílu je cca 52 minut. Děj se odehrává v Československu a je zasazen do skutečných historických událostí, které ovlivňují příběhy jednotlivých postav. Dobovou atmosféru autoři navozují ukázkami z dobových Československých filmových týdeníků s původními komentáři, případně novým historizujícím komentářem, který namluvil Vladimír Fišer. Příběh je doprovázen hlasem vypravěče, který propůjčil herec Vojtěch Kotek a poté Matěj Hádek. Scénáře vznikají pod vedením scenáristy Rudolfa Merknera. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ondrej Veselý Jarda Franc Svatopluk Skopal Josef Dvořák Veronika Freimanová Jana Dvořáková Andrea Kerestešová Eva Dvořáková Roman Vojtek Karel Dvořák Full Cast & Crew Last Season Season 5 2013 | 22 Episodes Season 5 of Vyprávěj premiered on January 18, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Vyprávěj. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Czech Runtime  52m Homepage   http://www.ceskatelevize.cz/porady/10195164142-vypravej/ Genres Comedy Drama Family Keywords politics socialism czechoslovakia history family life Content Score 86 Almost there... Top Contributors j 30 jzvc 29 minusha97 h 8 hubalda68 5 1 5lucina5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}