{"link": "https://www.themoviedb.org/tv/32249?language=en", "title": "Niña de mi Corazón", "resume": "Niña de mi Corazón is a teen Mexican telenovela produced by Televisa and Telefe adapted from Pedro Damian's 1997 Mi Pequeña Traviesa, that premiered on March 8, 2010 and ended on July 9, 2010. Damian was also the producer of this telenovela.", "rate": 0, "genre": ["Drama", "Soap"], "cast": ["Paulina Goto", "Erick Elías", "Maribel Guardia", "Arturo Peniche", "Lorena Herrera"], "character": ["Andrea Paz/Andrés Paz", "Darío Arrioja Alarcón", "Pilar Alarcón de Arrioja", "Máximo Arrioja Riquelme", "Silvana Quinto Vda. de Casca"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32249   Expand Niña de mi Corazón   (2010) User Score Overview Niña de mi Corazón is a teen Mexican telenovela produced by Televisa and Telefe adapted from Pedro Damian's 1997 Mi Pequeña Traviesa, that premiered on March 8, 2010 and ended on July 9, 2010. Damian was also the producer of this telenovela. Featured Crew Abel Santa Cruz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paulina Goto Andrea Paz/Andrés Paz Erick Elías Darío Arrioja Alarcón Maribel Guardia Pilar Alarcón de Arrioja Arturo Peniche Máximo Arrioja Riquelme Lorena Herrera Silvana Quinto Vda. de Casca Full Cast & Crew Last Season Season 1 2010 | 90 Episodes Season 1 of Niña de mi Corazón premiered on March  8, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Niña de mi Corazón. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://www2.esmas.com/entretenimiento/telenovelas/nina-de-mi-corazon Official Genres Drama Soap Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 54 Amanda 3 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}