{"link": "https://www.themoviedb.org/tv/11973?language=en", "title": "Danger UXB", "resume": "Danger UXB is a 1979 British ITV television series about World War II developed by John Hawkesworth and starring Anthony Andrews as Lieutenant Brian Ash, an officer in the Royal Engineers.\nThe series chronicles the exploits of the fictional 97 Tunnelling Company which as a result of thousands of unexploded bombs in London during the Blitz has been made a bomb disposal unit. As with all his fellow officers, Ash must for the most part learn the techniques and procedures of disarming and destroying the UXBs through experience, repeatedly confronted with more cunning and deadlier technological advances in aerial bomb fusing. The series primarily featured military story lines, with a romantic thread featuring an inventor's married daughter, Susan Mount, with whom Ash falls in love, and other human interest vignettes.\nThe programme was titled and partly based on the memoirs of Major A. B. Hartley, M.B.E, RE, Unexploded Bomb - The Story of Bomb Disposal, with episodes written by Hawkesworth and four screenwriters. The series was filmed in 1978 in and around the Clapham, Streatham and Tooting areas of South London.\nThe programme appeared on the U.S. PBS as a segment of Masterpiece Theatre from January 4 to April 5, 1981. It was also screened in Australia on the public broadcaster ABC Television.", "rate": 80, "genre": ["Drama"], "cast": ["Judy Geeson", "Anthony Andrews", "Deborah Watling", "Nick Tate", "Maurice Roeves"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11973   Expand Danger UXB   (1979) User Score Overview Danger UXB is a 1979 British ITV television series about World War II developed by John Hawkesworth and starring Anthony Andrews as Lieutenant Brian Ash, an officer in the Royal Engineers. The series chronicles the exploits of the fictional 97 Tunnelling Company which as a result of thousands of unexploded bombs in London during the Blitz has been made a bomb disposal unit. As with all his fellow officers, Ash must for the most part learn the techniques and procedures of disarming and destroying the UXBs through experience, repeatedly confronted with more cunning and deadlier technological advances in aerial bomb fusing. The series primarily featured military story lines, with a romantic thread featuring an inventor's married daughter, Susan Mount, with whom Ash falls in love, and other human interest vignettes. The programme was titled and partly based on the memoirs of Major A. B. Hartley, M.B.E, RE, Unexploded Bomb - The Story of Bomb Disposal, with episodes written by Hawkesworth and four screenwriters. The series was filmed in 1978 in and around the Clapham, Streatham and Tooting areas of South London. The programme appeared on the U.S. PBS as a segment of Masterpiece Theatre from January 4 to April 5, 1981. It was also screened in Australia on the public broadcaster ABC Television. Featured Crew John Hawkesworth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Judy Geeson Anthony Andrews Deborah Watling Nick Tate Maurice Roeves Full Cast & Crew Last Season Season 1 1979 | 13 Episodes Season 1 of Danger UXB premiered on January  8, 1979. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Danger UXB. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors TB 2 TMDb Bot PE 2 Patrick E. Abe 1 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}