{"link": "https://www.themoviedb.org/tv/14955?language=en", "title": "POV", "resume": "POV is a Public Broadcasting Service public television series which features independent nonfiction films. POV is an initialism for point of view.\nPOV is the longest-running showcase on television for independent documentary films. PBS presents 14-16 POV programs each year, and the series has premiered over 300 films to U.S. television audiences since 1988. POV's films have a strong first-person, social-issue focus. Many established directors, including Michael Moore, Jonathan Demme, Terry Zwigoff, Errol Morris, Albert and David Maysles, Michael Apted, Frederick Wiseman, Marlon Riggs, and Ross McElwee have had work screened as part of the POV series.\nThe series has garnered both critical and industry acclaim over its 20-plus years on television. POV programs have also won major industry awards including three Oscars, 32 Emmys, 36 Cine Golden Eagles, 15 Peabody Awards, 11 Alfred I. duPont-Columbia Awards, the Prix Italia and the Webby Award.", "rate": 93, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14955   Expand POV   (1988) User Score  Play Trailer Overview POV is a Public Broadcasting Service public television series which features independent nonfiction films. POV is an initialism for point of view. POV is the longest-running showcase on television for independent documentary films. PBS presents 14-16 POV programs each year, and the series has premiered over 300 films to U.S. television audiences since 1988. POV's films have a strong first-person, social-issue focus. Many established directors, including Michael Moore, Jonathan Demme, Terry Zwigoff, Errol Morris, Albert and David Maysles, Michael Apted, Frederick Wiseman, Marlon Riggs, and Ross McElwee have had work screened as part of the POV series. The series has garnered both critical and industry acclaim over its 20-plus years on television. POV programs have also won major industry awards including three Oscars, 32 Emmys, 36 Cine Golden Eagles, 15 Peabody Awards, 11 Alfred I. duPont-Columbia Awards, the Prix Italia and the Webby Award. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 30 2017 | 11 Episodes Season 30 of POV premiered on June 26, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on POV. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.pbs.org/pov Genres Documentary Keywords documentary Content Score 64 We're so close, yet so far. Top Contributors 187 lineker 77 Elizabeth Jennings TB 5 TMDb Bot A 4 Amoebabadass  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}