{"link": "https://www.themoviedb.org/tv/11057?language=en", "title": "Scrapheap Challenge", "resume": "Scrapheap Challenge is an engineering game show produced by RDF Media and broadcast on Channel 4 in the United Kingdom. In the show, teams of contestants had 10 hours in which to build a working machine that could do a specific task, using materials available in a scrapheap. The format was exported to the United States, where it was known as Junkyard Wars. The US show was also produced by RDF Media, and was originally shown on The Learning Channel. Repeats have aired on another Discovery network, the Science Channel.", "rate": 68, "genre": ["Action", "Adventure", "Reality"], "cast": ["Robert Llewellyn", "Lisa Rogers", "Dick Strawbridge"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11057   Expand Scrapheap Challenge   (1998) User Score Overview Scrapheap Challenge is an engineering game show produced by RDF Media and broadcast on Channel 4 in the United Kingdom. In the show, teams of contestants had 10 hours in which to build a working machine that could do a specific task, using materials available in a scrapheap. The format was exported to the United States, where it was known as Junkyard Wars. The US show was also produced by RDF Media, and was originally shown on The Learning Channel. Repeats have aired on another Discovery network, the Science Channel. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Llewellyn Lisa Rogers Dick Strawbridge Full Cast & Crew Last Season Season 12 2010 | 12 Episodes Season 12 of Scrapheap Challenge premiered on June  6, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Scrapheap Challenge. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  52m, 45m, 60m Homepage   http://www.channel4.com/scrapheap Genres Action & Adventure Reality Keywords junkyard engineering contests and competitions time limit expert opinion Content Score 56 We're so close, yet so far. Top Contributors 12 Marr 🇳🇱 7 Banana PE 6 Patrick E. Abe 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}