{"link": "https://www.themoviedb.org/tv/23591?language=en", "title": "Charlotte of the Young Grass", "resume": "Wakakusa no Charlotte is a vintage shōjo anime series produced by Nippon Animation Co. Ltd. It was first aired in Japan between October 29, 1977 and May 27, 1978, and is based on an original story by screenwriter Shun'ichi Yukimuro.\nWhile this series - Nippon Animation's first to specifically target the shōjo audience, followed by Haikara-san ga Tōru - was taken off the air in Japan early due to mediocre ratings, it is a much-loved and well-known series in some European countries, particularly in Italy.", "rate": 0, "genre": ["Animation"], "cast": ["Ichirō Murakoshi", "Ichirō Nagai", "Kaoru Kurosu", "Kazue Komiya", "Keiko Yokozawa"], "character": ["Andre", "Grampa", "Cassie", "Satie", "Charlotte"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 23591   Expand Charlotte of the Young Grass   (1977) User Score Overview Wakakusa no Charlotte is a vintage shōjo anime series produced by Nippon Animation Co. Ltd. It was first aired in Japan between October 29, 1977 and May 27, 1978, and is based on an original story by screenwriter Shun'ichi Yukimuro. While this series - Nippon Animation's first to specifically target the shōjo audience, followed by Haikara-san ga Tōru - was taken off the air in Japan early due to mediocre ratings, it is a much-loved and well-known series in some European countries, particularly in Italy. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ichirō Murakoshi Andre Ichirō Nagai Grampa Kaoru Kurosu Cassie Kazue Komiya Satie Keiko Yokozawa Charlotte Full Cast & Crew Last Season Season 1 1977 | 30 Episodes Season 1 of Charlotte of the Young Grass premiered on October 29, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Charlotte of the Young Grass. You can help by rating TV shows you've seen. Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.nipponanimation.com/catalogue/015/index.html Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors c 4 chloris77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}