{"link": "https://www.themoviedb.org/tv/78034?language=en", "title": "Tracey Breaks the News", "resume": "Tracey Ullman and her cast of characters take on the news.", "rate": 100, "genre": ["Comedy"], "cast": ["Tracey Ullman"], "character": ["Various"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78034   Expand Tracey Breaks the News   (2017) User Score  Play Trailer Overview Tracey Ullman and her cast of characters take on the news. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Tracey Ullman Various Full Cast & Crew Current Season Season 1 2017 | 3 Episodes Season 1 of Tracey Breaks the News premiered on October 27, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tracey Breaks the News. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b09cndm6 Genres Comedy Keywords politics comedian satire royal family british sketch impersonator sketch comedy impersonation british comedy celebrity impersonation political humour british royal family satirical female comedian donald trump bbc Content Score 50 Still needs a little work. Top Contributors r 36 rebel5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}