{"link": "https://www.themoviedb.org/tv/4971?language=en", "title": "Walking with Monsters", "resume": "A three-part British documentary film series about life in the Paleozoic, bringing to life extinct arthropods, fish, amphibians, synapsids, and reptiles. Narrated by Kenneth Branagh and using state-of-the-art visual effects, this prequel to Walking with Dinosaurs shows nearly 300 million years of Paleozoic history, from the Cambrian Period (530 million years ago) to the Early Triassic Period (248 million years ago).", "rate": 76, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4971   Expand Walking with Monsters   (2005) User Score Overview A three-part British documentary film series about life in the Paleozoic, bringing to life extinct arthropods, fish, amphibians, synapsids, and reptiles. Narrated by Kenneth Branagh and using state-of-the-art visual effects, this prequel to Walking with Dinosaurs shows nearly 300 million years of Paleozoic history, from the Cambrian Period (530 million years ago) to the Early Triassic Period (248 million years ago). Featured Crew Chloë Leland Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 2005 | 3 Episodes Season 1 of Walking with Monsters premiered on January  7, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2001-11-15 Walking with Beasts 7.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  88m, 90m, 30m Homepage   http://www.bbc.co.uk/programmes/p00v3q0x Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors R 9 Rebecca 7 puyol D 5 DracoAn 2 jedgarau  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}