{"link": "https://www.themoviedb.org/tv/64911?language=en", "title": "Wendell and Vinnie", "resume": "The series follows Vinnie Bassett, proprietor of a pop culture memorabilia store who only takes breaks to read comic books and play video games. His bachelor life comes to a halt when he assumes guardianship of his incredibly intelligent and mature nephew, Wendell. They soon find that 12-year-old Wendell may be just the parent Vinnie needs.", "rate": 80, "genre": ["Comedy", "Drama", "Family"], "cast": ["Jerry Trainor", "Buddy Handleson", "Nicole Sullivan", "Haley Strode"], "character": ["Vinnie Bassett", "Wendell Bassett", "Wilma Bassett", "Taryn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64911   Expand Wendell and Vinnie   (2013) User Score  Play Trailer Overview The series follows Vinnie Bassett, proprietor of a pop culture memorabilia store who only takes breaks to read comic books and play video games. His bachelor life comes to a halt when he assumes guardianship of his incredibly intelligent and mature nephew, Wendell. They soon find that 12-year-old Wendell may be just the parent Vinnie needs. Featured Crew Jay Kogen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jerry Trainor Vinnie Bassett Buddy Handleson Wendell Bassett Nicole Sullivan Wilma Bassett Haley Strode Taryn Full Cast & Crew Last Season Season 1 2013 | 20 Episodes Season 1 of Wendell and Vinnie premiered on February 16, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Wendell and Vinnie. You can help by rating TV shows you've seen. Facts Status  Cancelled Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Comedy Drama Family Keywords uncle nephew relationship kid genius Content Score 100 Yes! Looking good! Top Contributors 25 Mikedeth5 4 Michael 2 tigru89 TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}