{"link": "https://www.themoviedb.org/tv/33094?language=en", "title": "Stand Up for the Week", "resume": "Stand Up for the Week is a British television comedy series shown on Channel 4, featuring stand-up comedy performances reflecting topical events. The show began in June 2010 with a six-episode series aired on Friday nights, moving to Saturday nights for the second series which began in March 2011. The first series was hosted by Patrick Kielty, with regular performers Jack Whitehall, Kevin Bridges, Andi Osho and Rich Hall. Bridges replaced Kielty as host for the second series, with Jon Richardson joining as a regular performer. Richardson took over as host of the show for the third series which aired in late 2011, and aside from Rich Hall returning, an otherwise entirely new group of regular performers joined the show: Seann Walsh, Sara Pascoe, Josh Widdicombe and Paul Chowdhry. For the fourth series Andrew Lawrence replaced Rich Hall. For the fifth series, Chowdhry will take over as host but it is unknown who will replace him or if any other regulars have been replaced.", "rate": 0, "genre": ["Comedy"], "cast": ["Jon Richardson", "Kevin Bridges"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33094   Expand Stand Up for the Week   (2010) User Score Overview Stand Up for the Week is a British television comedy series shown on Channel 4, featuring stand-up comedy performances reflecting topical events. The show began in June 2010 with a six-episode series aired on Friday nights, moving to Saturday nights for the second series which began in March 2011. The first series was hosted by Patrick Kielty, with regular performers Jack Whitehall, Kevin Bridges, Andi Osho and Rich Hall. Bridges replaced Kielty as host for the second series, with Jon Richardson joining as a regular performer. Richardson took over as host of the show for the third series which aired in late 2011, and aside from Rich Hall returning, an otherwise entirely new group of regular performers joined the show: Seann Walsh, Sara Pascoe, Josh Widdicombe and Paul Chowdhry. For the fourth series Andrew Lawrence replaced Rich Hall. For the fifth series, Chowdhry will take over as host but it is unknown who will replace him or if any other regulars have been replaced. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jon Richardson Kevin Bridges Full Cast & Crew Last Season Season 4 2012 | 10 Episodes Season 4 of Stand Up for the Week premiered on April 27, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Stand Up for the Week. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  50m Homepage   http://www.channel4.com/programmes/stand-up-for-the-week Genres Comedy Keywords stand-up comedy stand-up comedian Content Score 56 We're so close, yet so far. Top Contributors C 43 Conjuro 4 Elizabeth Jennings 3 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}