{"link": "https://www.themoviedb.org/tv/4686?language=en", "title": "Ben 10", "resume": "Ben 10 was an American animated series created by Man of Action, and produced by Cartoon Network Studios. The series is about a 10 year old boy named Ben Tennyson who gets a watch-like alien device called the \"Omnitrix\". Attached to his wrist, this allows him to transform into various alien creatures.\nThe pilot episode aired on December 27, 2005, as part of a sneak peek of Cartoon Network's Saturday morning lineup. The second episode was shown as a special on Cartoon Network's Fridays on January 13, 2006, and the final regular episode aired on April 15, 2008.\nThe series gradually became popular among audiences, evolving into a franchise, being nominated for two Emmy Awards, winning one for \"Outstanding Individual Achievement in Animation\". Ben 10 was succeeded by Ben 10: Alien Force, which itself was succeeded in April 2010 by Ben 10: Ultimate Alien. A new series called Ben 10: Omniverse premiered in September 2012.", "rate": 67, "genre": ["Animation", "Action", "Adventure", "Comedy", "Kids"], "cast": ["Tara Strong", "Claudia Schmidt", "Ashley Johnson", "Meagan Smith", "Paul Eiding"], "character": ["Ben Tennyson", "Ben Tennyson", "Gwen Tennyson", "Gwen Tennyson", "Grandpa Max"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4686   Expand Ben 10   (2005) User Score Overview Ben 10 was an American animated series created by Man of Action, and produced by Cartoon Network Studios. The series is about a 10 year old boy named Ben Tennyson who gets a watch-like alien device called the \"Omnitrix\". Attached to his wrist, this allows him to transform into various alien creatures. The pilot episode aired on December 27, 2005, as part of a sneak peek of Cartoon Network's Saturday morning lineup. The second episode was shown as a special on Cartoon Network's Fridays on January 13, 2006, and the final regular episode aired on April 15, 2008. The series gradually became popular among audiences, evolving into a franchise, being nominated for two Emmy Awards, winning one for \"Outstanding Individual Achievement in Animation\". Ben 10 was succeeded by Ben 10: Alien Force, which itself was succeeded in April 2010 by Ben 10: Ultimate Alien. A new series called Ben 10: Omniverse premiered in September 2012. Featured Crew Duncan Rouleau Creator Steven T. Seagle Creator Joe Casey Creator Joe Kelly Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Tara Strong Ben Tennyson Claudia Schmidt Ben Tennyson Ashley Johnson Gwen Tennyson Meagan Smith Gwen Tennyson Paul Eiding Grandpa Max Full Cast & Crew Last Season Season 4 2007 | 10 Episodes Season 4 of Ben 10 premiered on July 14, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2008-04-18 Ben 10: Alien Force 6.1    2010-04-23 Ben 10: Ultimate Alien 6.1    2002-12-06 Codename: Kids Next Door 6.5    2003-11-01 Xiaolin Showdown 6.9    2004-08-13 Foster's Home for Imaginary Friends 6.8    2001-08-24 The Grim Adventures of Billy and Mandy 7.3    1998-11-18 The Powerpuff Girls 7.0    2003-07-19 Teen Titans 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.ben10.net/ Genres Animation Action & Adventure Comedy Kids Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 5 Travis Bell w 4 winhacker 4 niqo19 S 3 Sokarius  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}