{"link": "https://www.themoviedb.org/tv/8999?language=en", "title": "Posh Nosh", "resume": "Posh Nosh is a 2003 BBC television programme parodying television chefs; the title and basic outline a reference to a cooking show pilot pitched by Neil Hamilton and Christine Hamilton. Written by Jon Canter and Arabella Weir from an idea by Weir, and directed and script edited by Chris Langham, the programme stars Arabella Weir and Richard E. Grant as chefs the Hon. Simon and Minty Marchmont, owners of a very posh restaurant called \"The Quill & Tassel\". There were eight nine-minute episodes, in which the chefs carry out their mission to bring \"extraordinary food\" to \"ordinary people\".\nSimon and Minty prepare various dishes ranging from architect's fish and chips to bread AND butter pudding, offering snooty and frequently surreal commentary along the way. For instance, they employ words in odd ways in parody of specific culinary terminology, such as \"interrogate a lemon\"; and their cooked vegetables are not peeled but \"embarrassed\", after which they might be \"annoyed\" instead of boiled. They also frequently insist on ultra-specific, often prohibitively expensive, ingredients—such as Greek currants that you actually have to fly to Greece to buy.\nAt the same time, a thread of increasing domestic tension runs beneath the surface of every exchange between Simon and Minty, like Simon frequently rolling his eyes at Minty's malapropisms or Simon sarcastically commenting on Minty's cooking skills, along with some not-so-subtle hints about Simon's repressed sexual orientation. The couple illustrate aspects of the British class divide, with Minty as a middle-class social climber who married Simon for his status. She constantly brags about her high station in life, while also seeming to run \"The Quill and Tassel\" kitchens single-handed. A running joke in the series is Simon's crush on his tennis instructor José Luis. José Luis dies before episode 8, and Simon and Minty cook a meal to remember him in this episode. At the dinner, Simon is introduced to a new tennis coach, also played by David Tennant. Both Marchmonts are obsessed with their dog, Sam, going so far as to throw a birthday party for him. The birthday cake prepared for the party contains huge amounts of chocolate, which would kill dogs, a rather macabre joke.", "rate": 40, "genre": ["Comedy"], "cast": ["Arabella Weir", "Richard E. Grant"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8999   Expand Posh Nosh   (2003) User Score Overview Posh Nosh is a 2003 BBC television programme parodying television chefs; the title and basic outline a reference to a cooking show pilot pitched by Neil Hamilton and Christine Hamilton. Written by Jon Canter and Arabella Weir from an idea by Weir, and directed and script edited by Chris Langham, the programme stars Arabella Weir and Richard E. Grant as chefs the Hon. Simon and Minty Marchmont, owners of a very posh restaurant called \"The Quill & Tassel\". There were eight nine-minute episodes, in which the chefs carry out their mission to bring \"extraordinary food\" to \"ordinary people\". Simon and Minty prepare various dishes ranging from architect's fish and chips to bread AND butter pudding, offering snooty and frequently surreal commentary along the way. For instance, they employ words in odd ways in parody of specific culinary terminology, such as \"interrogate a lemon\"; and their cooked vegetables are not peeled but \"embarrassed\", after which they might be \"annoyed\" instead of boiled. They also frequently insist on ultra-specific, often prohibitively expensive, ingredients—such as Greek currants that you actually have to fly to Greece to buy. At the same time, a thread of increasing domestic tension runs beneath the surface of every exchange between Simon and Minty, like Simon frequently rolling his eyes at Minty's malapropisms or Simon sarcastically commenting on Minty's cooking skills, along with some not-so-subtle hints about Simon's repressed sexual orientation. The couple illustrate aspects of the British class divide, with Minty as a middle-class social climber who married Simon for his status. She constantly brags about her high station in life, while also seeming to run \"The Quill and Tassel\" kitchens single-handed. A running joke in the series is Simon's crush on his tennis instructor José Luis. José Luis dies before episode 8, and Simon and Minty cook a meal to remember him in this episode. At the dinner, Simon is introduced to a new tennis coach, also played by David Tennant. Both Marchmonts are obsessed with their dog, Sam, going so far as to throw a birthday party for him. The birthday cake prepared for the party contains huge amounts of chocolate, which would kill dogs, a rather macabre joke. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Arabella Weir Richard E. Grant Full Cast & Crew Last Season Season 1 2003 | 9 Episodes Season 1 of Posh Nosh premiered on February  4, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Posh Nosh. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  9m, 10m, 30m Homepage   http://www.bbc.co.uk/comedy/poshnosh/ Genres Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}