{"link": "https://www.themoviedb.org/tv/1875?language=en", "title": "Sons & Daughters", "resume": "Sons & Daughters is an American situation comedy about an extended blended family living close together in a neighborhood. The producers, creator Fred Goss, Lorne Michaels, and Nick Holly, flavored the show with a mixed atmosphere of improvisational and scripted humor. The show premiered on March 7, 2006 on ABC. The show is produced by Broadway Video and NBC Universal Television. It was canceled in late April 2006 after 10 episodes aired, leaving one unaired episode.\nThe whole series was aired on the Seven Network in Australia, including the final previously unaired episode, ending on August 6, 2007. Coincidentally, the Seven Network also screened the earlier Australian soap opera of the same name. In December 2010, ITV1 started showing the series in the United Kingdom for the first time, over four years since its American showing. The show has also been aired on TV3 in Ireland.\nThere are currently no plans to release Sons & Daughters on DVD from Universal Studios Home Entertainment.", "rate": 0, "genre": ["Comedy"], "cast": ["Fred Goss", "Gillian Vigman", "Jerry Lambert", "Alison Quinn", "Desmond Harrington"], "character": ["Cameron Walker", "Liz Walker", "Don Fenton", "Sharon Fenton", "Wylie Blake"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1875   Expand Sons & Daughters   (2006) User Score Overview Sons & Daughters is an American situation comedy about an extended blended family living close together in a neighborhood. The producers, creator Fred Goss, Lorne Michaels, and Nick Holly, flavored the show with a mixed atmosphere of improvisational and scripted humor. The show premiered on March 7, 2006 on ABC. The show is produced by Broadway Video and NBC Universal Television. It was canceled in late April 2006 after 10 episodes aired, leaving one unaired episode. The whole series was aired on the Seven Network in Australia, including the final previously unaired episode, ending on August 6, 2007. Coincidentally, the Seven Network also screened the earlier Australian soap opera of the same name. In December 2010, ITV1 started showing the series in the United Kingdom for the first time, over four years since its American showing. The show has also been aired on TV3 in Ireland. There are currently no plans to release Sons & Daughters on DVD from Universal Studios Home Entertainment. Featured Crew Lorne Michaels Creator Fred Goss Creator Nick Holly Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Goss Cameron Walker Gillian Vigman Liz Walker Jerry Lambert Don Fenton Alison Quinn Sharon Fenton Desmond Harrington Wylie Blake Full Cast & Crew Last Season Season 1 2006 | 11 Episodes Season 1 of Sons & Daughters premiered on March  7, 2006. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sons & Daughters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m, 20m Homepage  - Genres Comedy Keywords big family family sitcom blended family Content Score 93 Almost there... Top Contributors 36 United600 8 Banana D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}