{"link": "https://www.themoviedb.org/tv/24667?language=en", "title": "Shadow Star Narutaru", "resume": "Shadow Star, known in Japan as Narutaru, which comes from the abbreviation of \"Mukuro Naru Hoshi, Tama Taru Ko\", is the name of a Japanese manga and of the anime series which was based on the manga. The series was created by Mohiro Kitoh and was originally serialized in the magazine Afternoon. When asked about the manga, Mohiro Kitoh stated that he had about 80% of the entire story planned out from the beginning. When he was asked about the anime series, he stated he was grateful it was made. In the United States, it was licensed by Dark Horse and serialized in Super Manga Blast!\nThe 13-episode anime adaptation was broadcast in 2003 on the Japanese television station Kids Station. The anime was licensed by Central Park Media and released as Shadow Star Narutaru, and has played on Comcast's Anime Selects multiple times. In 2007 it ran on the Illusion on Demand television network. Central Park Media released the title under their \"U.S. Manga Corps\" line, on 4 DVDs, and later re-released the DVDs in a box set. Central Park Media filed for bankruptcy in 2009, and the DVDs have since been out of print.\nThe protagonist of the series is a twelve-year-old girl named Shiina Tamai. She bonds with a starfish-shaped \"dragonchild\" whom she calls Hoshimaru. The series is mainly about the interaction between Shiina and other young people who have also bonded with dragons.", "rate": 0, "genre": ["Drama", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Asami Sanada", "Mamiko Noto", "Sakura Nogawa", "Satsuki Yukino", "Akira Ishida"], "character": ["Shiina Tamai", "Akira Sakura", "Hiroko Kaizuka", "Hoshimaru", "Akinori Komori"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 24667   Expand Shadow Star Narutaru   (2003) User Score Overview Shadow Star, known in Japan as Narutaru, which comes from the abbreviation of \"Mukuro Naru Hoshi, Tama Taru Ko\", is the name of a Japanese manga and of the anime series which was based on the manga. The series was created by Mohiro Kitoh and was originally serialized in the magazine Afternoon. When asked about the manga, Mohiro Kitoh stated that he had about 80% of the entire story planned out from the beginning. When he was asked about the anime series, he stated he was grateful it was made. In the United States, it was licensed by Dark Horse and serialized in Super Manga Blast! The 13-episode anime adaptation was broadcast in 2003 on the Japanese television station Kids Station. The anime was licensed by Central Park Media and released as Shadow Star Narutaru, and has played on Comcast's Anime Selects multiple times. In 2007 it ran on the Illusion on Demand television network. Central Park Media released the title under their \"U.S. Manga Corps\" line, on 4 DVDs, and later re-released the DVDs in a box set. Central Park Media filed for bankruptcy in 2009, and the DVDs have since been out of print. The protagonist of the series is a twelve-year-old girl named Shiina Tamai. She bonds with a starfish-shaped \"dragonchild\" whom she calls Hoshimaru. The series is mainly about the interaction between Shiina and other young people who have also bonded with dragons. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Asami Sanada Shiina Tamai Mamiko Noto Akira Sakura Sakura Nogawa Hiroko Kaizuka Satsuki Yukino Hoshimaru Akira Ishida Akinori Komori Full Cast & Crew Last Season Season 1 2003 | 13 Episodes Season 1 of Shadow Star Narutaru premiered on July  7, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Shadow Star Narutaru. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Drama Animation Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}