{"link": "https://www.themoviedb.org/tv/52919?language=en", "title": "The Island Teacher", "resume": "Students who have previous troubles in the city's schools are sent to a small school on an island. \nWarm-hearted people on this remote island change them and they can grow. Chihiro Natsumura, who is a teacher on the remote island, struggles to solve the problems her students have.", "rate": 0, "genre": ["Drama", "Family"], "cast": ["Ishimoto Dronz", "Yukie Nakama", "Kôji Ishizaka", "Arata Iura", "Yasuo Daichi"], "character": ["Ryotaro Hino", "Chihiro Natsumura", "Bunza Tajima", "Akiyoshi Tajima", "Ittetsu Sonoda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 52919   Expand The Island Teacher   (2013) User Score Overview Students who have previous troubles in the city's schools are sent to a small school on an island.  Warm-hearted people on this remote island change them and they can grow. Chihiro Natsumura, who is a teacher on the remote island, struggles to solve the problems her students have. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ishimoto Dronz Ryotaro Hino Yukie Nakama Chihiro Natsumura Kôji Ishizaka Bunza Tajima Arata Iura Akiyoshi Tajima Yasuo Daichi Ittetsu Sonoda Full Cast & Crew Last Season Season 1 2013 | 6 Episodes Season 1 of The Island Teacher premiered on May 25, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Island Teacher. You can help by rating TV shows you've seen. Facts Original Name  島の先生 Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  58m Homepage  - Genres Drama Family Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors A 25 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}