{"link": "https://www.themoviedb.org/tv/11949?language=en", "title": "E.A.R.T.H. Force", "resume": "E.A.R.T.H. Force is an American action adventure television series starring Gil Gerard. The series aired 3 episodes on CBS from September 16, 1990, to September 29, 1990, before being canceled due to low ratings. The show is about an elite group, the Earth Alert Research Tactical Headquarters, that was brought together by a dying millionaire to prevent environmental disasters around the world.", "rate": 0, "genre": ["Action", "Adventure"], "cast": ["Gil Gerard", "Robert Knepper", "Clayton Rohner", "Joanna Pacula", "Stewart Finlay-McLennan"], "character": ["Dr. John Harding", "Dr. Peter Roland", "Carl Dana", "Diana Randall", "Chuck Dillon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11949   Expand E.A.R.T.H. Force   (1990) User Score Overview E.A.R.T.H. Force is an American action adventure television series starring Gil Gerard. The series aired 3 episodes on CBS from September 16, 1990, to September 29, 1990, before being canceled due to low ratings. The show is about an elite group, the Earth Alert Research Tactical Headquarters, that was brought together by a dying millionaire to prevent environmental disasters around the world. Featured Crew Bill Dial Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gil Gerard Dr. John Harding Robert Knepper Dr. Peter Roland Clayton Rohner Carl Dana Joanna Pacula Diana Randall Stewart Finlay-McLennan Chuck Dillon Full Cast & Crew Last Season Season 1 1990 | 6 Episodes Season 1 of E.A.R.T.H. Force premiered on September 16, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on E.A.R.T.H. Force. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Action & Adventure Keywords scientist environment environmental disaster Content Score 79 Pump it up! We're close now. Top Contributors 11 Banana o 4 olili  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}