{"link": "https://www.themoviedb.org/tv/11844?language=en", "title": "The New Adventures of Flash Gordon", "resume": "The New Adventures of Flash Gordon, also known as The Adventures of Flash Gordon, is an animated television series. The series is actually called Flash Gordon but the expanded title is used in official records to distinguish it from previous versions. Filmation produced the series in 1979, partly as a reaction to the mammoth success of Star Wars Episode IV: A New Hope in 1977. The series was a homage to the original Flash Gordon comic strip and featured most of the original characters, including Flash's girlfriend Dale Arden, and the scientist Hans Zarkov. The series is still regarded as one of the most faithful adaptations, and one of Filmation's finest overall efforts.\nThe basic story follows Flash and his companions as they travel to Mongo, where they are forced into battle by its ruler, Ming the Merciless, his daughter Princess Aura, and his army of Metal Men. To help their cause the heroes lead the formation of an alliance beginning with King Thun, leader of the Lion People; Prince Barin, ruler of Arboria; and King Vultan, leader of the Hawkmen.\nThe original project was produced as a made-for-television feature film. When NBC saw the finished work, it was decided to turn the work into an animated TV series. The change in format resulted in the story being significantly expanded with a subplot of Ming secretly giving military technology to Hitler being dropped, as well as being set in the present day rather during World War II. When the series was cancelled after its 2nd season, the original footage was reassembled with the original soundtrack, including the final role of Ted Cassidy, and aired on primetime in 1982 as a TV movie, Flash Gordon: The Greatest Adventure of All.", "rate": 73, "genre": ["Animation"], "cast": ["Robert Ridgely", "Vic Perrin", "Bob Holt", "Alan Oppenheimer", "Diane Pershing"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11844   Expand The New Adventures of Flash Gordon   (1979) User Score Overview The New Adventures of Flash Gordon, also known as The Adventures of Flash Gordon, is an animated television series. The series is actually called Flash Gordon but the expanded title is used in official records to distinguish it from previous versions. Filmation produced the series in 1979, partly as a reaction to the mammoth success of Star Wars Episode IV: A New Hope in 1977. The series was a homage to the original Flash Gordon comic strip and featured most of the original characters, including Flash's girlfriend Dale Arden, and the scientist Hans Zarkov. The series is still regarded as one of the most faithful adaptations, and one of Filmation's finest overall efforts. The basic story follows Flash and his companions as they travel to Mongo, where they are forced into battle by its ruler, Ming the Merciless, his daughter Princess Aura, and his army of Metal Men. To help their cause the heroes lead the formation of an alliance beginning with King Thun, leader of the Lion People; Prince Barin, ruler of Arboria; and King Vultan, leader of the Hawkmen. The original project was produced as a made-for-television feature film. When NBC saw the finished work, it was decided to turn the work into an animated TV series. The change in format resulted in the story being significantly expanded with a subplot of Ming secretly giving military technology to Hitler being dropped, as well as being set in the present day rather during World War II. When the series was cancelled after its 2nd season, the original footage was reassembled with the original soundtrack, including the final role of Ted Cassidy, and aired on primetime in 1982 as a TV movie, Flash Gordon: The Greatest Adventure of All. Featured Crew Alex Raymond Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Ridgely Vic Perrin Bob Holt Alan Oppenheimer Diane Pershing Full Cast & Crew Last Season Season 2 — | 16 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The New Adventures of Flash Gordon. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hearstent.com/flashgordon.html Genres Animation Keywords flash gordon Content Score 93 Almost there... Top Contributors 7 Banana d 4 docgonzo 2 minhus j 1 jco666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}