{"link": "https://www.themoviedb.org/tv/1663?language=en", "title": "The Six Million Dollar Man", "resume": "The Six Million Dollar Man is an American television series about a former astronaut with bionic implants working for a fictional government office known as OSI. The series is based on the Martin Caidin novel Cyborg, which was the series's proposed title during pre-production. Following three television movies aired in 1973, The Six Million Dollar Man aired on the ABC network as a regular series for five seasons from 1974 to 1978. The title role of Steve Austin was played by Lee Majors, who subsequently became a pop culture icon of the 1970s. A spin-off series, The Bionic Woman, ran from 1976-78. Several television movies featuring both eponymous characters were also produced between 1987 and 1994.", "rate": 67, "genre": ["Sci-Fi", "Fantasy", "Action", "Adventure", "Drama"], "cast": ["Lee Majors", "Martin E. Brooks", "Richard Anderson"], "character": ["Steve Austin", "Dr. Rudy Wells", "Oscar Goldman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1663   Expand The Six Million Dollar Man   (1974) User Score Overview The Six Million Dollar Man is an American television series about a former astronaut with bionic implants working for a fictional government office known as OSI. The series is based on the Martin Caidin novel Cyborg, which was the series's proposed title during pre-production. Following three television movies aired in 1973, The Six Million Dollar Man aired on the ABC network as a regular series for five seasons from 1974 to 1978. The title role of Steve Austin was played by Lee Majors, who subsequently became a pop culture icon of the 1970s. A spin-off series, The Bionic Woman, ran from 1976-78. Several television movies featuring both eponymous characters were also produced between 1987 and 1994. Featured Crew Kenneth Johnson Creator Martin Caidin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  4 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Lee Majors Steve Austin Martin E. Brooks Dr. Rudy Wells Richard Anderson Oscar Goldman Full Cast & Crew Last Season Season 5 1977 | 21 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply w Oscar Goldman: Richard Andrson R.I.P. Open 1 by  Dark_Sithlord vrs bigfoot Open 1 by  Moonglum9 Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   1976-01-14 The Bionic Woman 6.2    1977-01-14 Fantasy Island 6.5    1976-03-21 Charlie's Angels 5.9    1979-09-20 Buck Rogers in the 25th Century 6.9    1979-09-22 Hart to Hart 6.5    1977-09-24 The Love Boat 5.8    1973-10-24 Kojak 7.4    1970-09-16 McCloud 7.0  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  43m, 60m Homepage  - Genres Sci-Fi & Fantasy Action & Adventure Drama Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 23 juzza D 13 Decaliax 11 Elizabeth Jennings o 10 olgenia  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}