{"link": "https://www.themoviedb.org/tv/4114?language=en", "title": "Forensic Heroes", "resume": "Forensic Heroes is a TVB modern suspense series broadcast in June 2006 and the first installment of the Forensic Heroes series.\nA direct sequel, Forensic Heroes II was produced and broadcast in 2008 continued with the same cast, alongside Kevin Cheng and Charmaine Sheh. Forensic Heroes III was broadcast in October in 2011. The artors and actresses are totally different from the former two TV plays. It has achieved a great success and won the highest audience rating among all plays.", "rate": 0, "genre": ["Drama"], "cast": ["Yoyo Mung", "Bobby Au-Yeung", "Linda Chung", "Raymond Cho"], "character": ["Leung Siu-yau", "Ko Yin Bok", "Lam Ding-ding"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4114   Expand Forensic Heroes   (2006) User Score Overview Forensic Heroes is a TVB modern suspense series broadcast in June 2006 and the first installment of the Forensic Heroes series. A direct sequel, Forensic Heroes II was produced and broadcast in 2008 continued with the same cast, alongside Kevin Cheng and Charmaine Sheh. Forensic Heroes III was broadcast in October in 2011. The artors and actresses are totally different from the former two TV plays. It has achieved a great success and won the highest audience rating among all plays. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yoyo Mung Leung Siu-yau Bobby Au-Yeung Ko Yin Bok Linda Chung Lam Ding-ding Raymond Cho Full Cast & Crew  Create Episode Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Forensic Heroes. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.tvcity.tvb.com/drama/forensic_heroes Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}