{"link": "https://www.themoviedb.org/tv/4626?language=en", "title": "Ugly Betty", "resume": "Smart but wholesome Betty embraces her unique appearance and independent attitude in the cutthroat world of New York fashion. With the help of her proud yet far-from-glamorous family from Queens, Betty will continue to have big dreams and deal with any obstacle in her own unique style.", "rate": 57, "genre": ["Drama", "Comedy"], "cast": ["Eric Mabius", "Vanessa Williams", "America Ferrera", "Ashley Jensen", "Tony Plana"], "character": ["Daniel Meade", "Willhelmina Slater", "Betty Suarez", "Christina McKinney", "Ignacio Suarez"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4626   Expand Ugly Betty   (2006) User Score  Play Trailer Overview Smart but wholesome Betty embraces her unique appearance and independent attitude in the cutthroat world of New York fashion. With the help of her proud yet far-from-glamorous family from Queens, Betty will continue to have big dreams and deal with any obstacle in her own unique style. Featured Crew Fernando Gaitán Creator Silvio Horta Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  17 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Mabius Daniel Meade Vanessa Williams Willhelmina Slater America Ferrera Betty Suarez Ashley Jensen Christina McKinney Tony Plana Ignacio Suarez Full Cast & Crew Last Season Season 4 2009 | 20 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  17 Posters  8 Recommendations   1997-09-08 Ally McBeal 5.9    1998-06-06 Sex and the City 5.5    2004-10-03 Desperate Housewives 6.6    1998-09-21 Will & Grace 6.5    2005-09-23 Ghost Whisperer 5.6    1997-09-24 Dharma & Greg 5.9    1996-09-27 Sabrina, the Teenage Witch 6.3    1996-08-26 7th Heaven 5.2  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  42m Homepage   http://abc.go.com/shows/ugly-betty Genres Drama Comedy Keywords new york latinx lead fashion mexican american fashion magazine Content Score 100 Yes! Looking good! Top Contributors 22 Banana M 13 Mec!as R 10 Rebecca 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}