{"link": "https://www.themoviedb.org/tv/37631?language=en", "title": "Main Abdul Qadir Hoon", "resume": "Main Abdul Qadir Hoon is a Pakistani drama serial that aired on Hum TV every Saturday from December 18, 2010 to May 21, 2011. It is written by Serwat Nazir and directed by Babar Javed . Fahad Mustafa is featured in the lead role while Faisal Qureshi, Aamina Sheikh, Alishba Yousuf, Saba Hameed and Asif Raza Mir portray supporting roles. The drama started airing on December 18, 2010. It is a weekly television serial that airs every Saturday.", "rate": 0, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37631   Expand Main Abdul Qadir Hoon User Score Overview Main Abdul Qadir Hoon is a Pakistani drama serial that aired on Hum TV every Saturday from December 18, 2010 to May 21, 2011. It is written by Serwat Nazir and directed by Babar Javed . Fahad Mustafa is featured in the lead role while Faisal Qureshi, Aamina Sheikh, Alishba Yousuf, Saba Hameed and Asif Raza Mir portray supporting roles. The drama started airing on December 18, 2010. It is a weekly television serial that airs every Saturday. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew  Create Season Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.Hum.TV Genres No genres have been added. Keywords No keywords have been added. Content Score 28 Rome wasn't built in a day... Top Contributors a 1 aslam196  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}