{"link": "https://www.themoviedb.org/tv/68202?language=en", "title": "Me Chama de Bruna", "resume": "Raquel is a girl, adopted by an upper-middle-class family, who rebelled at 17 and left her family and studies at a traditional college in São Paulo to become a prostitute.", "rate": 41, "genre": ["Drama"], "cast": ["Maria Bopp", "Suzana Kruger", "Luciana Paes", "Carla Ribas", "Jonathan Haagensen"], "character": ["Raquel Pacheco", "Nancy", "Mônica", "Stella", "JR"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68202   Expand Me Chama de Bruna   (2016) User Score Overview Raquel is a girl, adopted by an upper-middle-class family, who rebelled at 17 and left her family and studies at a traditional college in São Paulo to become a prostitute. Featured Crew Márcia Faria Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maria Bopp Raquel Pacheco Suzana Kruger Nancy Luciana Paes Mônica Carla Ribas Stella Jonathan Haagensen JR Full Cast & Crew Current Season Season 2 2017 | 8 Episodes Season 2 of Me Chama de Bruna premiered on October 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Me Chama de Bruna. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 18 Meaning Content suitable for viewers over the age of 18. Type  Scripted Original Language  Portuguese Runtime  45m Homepage   http://www.foxplaybrasil.com.br/show/13203-Me-Chama-de-Bruna Genres Drama Keywords erotism Content Score 100 Yes! Looking good! Top Contributors AL 36 André Lanzellotti I 25 Iscoh H 9 Halima 5 hackwik  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}