{"link": "https://www.themoviedb.org/tv/74140?language=en", "title": "Waco", "resume": "The harrowing true story of the 1993 standoff between the FBI, ATF and the Branch Davidians, a spiritual sect led by David Koresh in Waco, TX that resulted in a deadly shootout and fire.", "rate": 70, "genre": ["Drama"], "cast": ["Michael Shannon", "Taylor Kitsch", "Andrea Riseborough", "John Leguizamo", "Rory Culkin"], "character": ["Gary Noesner", "David Koresh", "Judy Schneider", "Robert Rodriguez", "David Thibodeau"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74140   Expand Waco   (2018) User Score Overview The harrowing true story of the 1993 standoff between the FBI, ATF and the Branch Davidians, a spiritual sect led by David Koresh in Waco, TX that resulted in a deadly shootout and fire. Featured Crew John Erick Dowdle Creator Drew Dowdle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Shannon Gary Noesner Taylor Kitsch David Koresh Andrea Riseborough Judy Schneider John Leguizamo Robert Rodriguez Rory Culkin David Thibodeau Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Waco premiered on January 24, 2018. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Clearly biased but... Open 1 by  Oldnewbie S Very Good Show Open 0 by Salt-and-Limes\n      \n     Is this going to be on Netflix? Open 1 J an 31, 2018 at 11:49AM by  J Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   2017-10-13 Lore 6.1    2018-01-22 Mosaic 8.0    2017-09-07 Tin Star 7.3    2017-10-01 Ten Days in the Valley 6.0    2017-06-15 Riviera 5.4    2017-08-25 Disjointed 5.3    2017-06-30 Gypsy 6.0    2017-07-24 Midnight, Texas 6.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  42m Homepage   http://www.paramountnetwork.com/shows/waco Genres Drama Keywords fbi cult standoff waco texas branch davidian atf Content Score 100 Yes! Looking good! Top Contributors 82 Elizabeth Jennings D 15 DorianP D 5 Destr0y C 5 Chunk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}