{"link": "https://www.themoviedb.org/tv/2344?language=en", "title": "My Secret Identity", "resume": "My Secret Identity was a Canadian television series starring Jerry O'Connell and Derek McGrath. Originally broadcast from October 9, 1988 – May 25, 1991 on CTV in Canada, the series also aired in syndication in the United States. The series won the 1989 International Emmy Award for Outstanding Achievement in Programming for Children and Young People.", "rate": 73, "genre": ["Action", "Adventure", "Comedy", "Family"], "cast": ["Wanda Cannon", "Marsha Moreau", "Jerry O'Connell", "Derek McGrath", "Christopher Bolton"], "character": ["Andrew Clements"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2344   Expand My Secret Identity   (1988) User Score Overview My Secret Identity was a Canadian television series starring Jerry O'Connell and Derek McGrath. Originally broadcast from October 9, 1988 – May 25, 1991 on CTV in Canada, the series also aired in syndication in the United States. The series won the 1989 International Emmy Award for Outstanding Achievement in Programming for Children and Young People. Featured Crew Chuck Lorre Creator Brian Levant Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wanda Cannon Marsha Moreau Jerry O'Connell Andrew Clements Derek McGrath Christopher Bolton Full Cast & Crew Last Season Season 3 1990 | 24 Episodes Season 3 of My Secret Identity premiered on September 29, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1985-09-07 Small Wonder 7.0    1986-09-13 Pee-wee's Playhouse 7.9    1984-01-04 Night Court 6.9    1984-09-18 Punky Brewster 6.8    1977-03-15 Three's Company 7.3    1986-03-25 Perfect Strangers 6.6    1983-01-10 Fraggle Rock 7.7    1974-01-15 Happy Days 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Action & Adventure Comedy Family Keywords superhero Content Score 93 Almost there... Top Contributors M 5 Migi D 2 Daniel 2 BigMad 1 Joe Carson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}