{"link": "https://www.themoviedb.org/tv/78476?language=en", "title": "MAJOR 2nd", "resume": "Shigeno Daigo is an elementary student whose father, Goro, is a professional baseball player. Inspired by his father, who was once a Major League player, Daigo started playing baseball with the Mifune Dolphins, a youth team. However, he was unable to live up to the expectations of being the son of a professional, and quit baseball after less than a year. Then, in the spring of his sixth-grade year, Daigo's school welcomes a transfer student, Sato Hikaru, whose father is Sato Toshiya, a former Major League player and Goro's close friend. The fate of these two young men begins to move forward!", "rate": 70, "genre": ["Animation", "Drama"], "cast": ["Natsumi Fujiwara", "Koutarou Nishiyama", "Kana Hanazawa", "Natsumi Takamori"], "character": ["Daigo Shigeno (voice)", "Hikaru Satō (voice)", "Mutsuko Sakura (voice)", "Izumi Shigeno (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78476   Expand MAJOR 2nd   (2018) User Score Overview Shigeno Daigo is an elementary student whose father, Goro, is a professional baseball player. Inspired by his father, who was once a Major League player, Daigo started playing baseball with the Mifune Dolphins, a youth team. However, he was unable to live up to the expectations of being the son of a professional, and quit baseball after less than a year. Then, in the spring of his sixth-grade year, Daigo's school welcomes a transfer student, Sato Hikaru, whose father is Sato Toshiya, a former Major League player and Goro's close friend. The fate of these two young men begins to move forward! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natsumi Fujiwara Daigo Shigeno (voice) Koutarou Nishiyama Hikaru Satō (voice) Kana Hanazawa Mutsuko Sakura (voice) Natsumi Takamori Izumi Shigeno (voice) Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of MAJOR 2nd premiered on April  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on MAJOR 2nd. You can help by rating TV shows you've seen. Facts Original Name  メジャーセカンド Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.shopro.co.jp/tv/major2nd/ Genres Animation Drama Keywords baseball anime sports Content Score 86 Almost there... Top Contributors 11 United600 6 sp1ti M 5 Migi 5 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}