{"link": "https://www.themoviedb.org/tv/61706?language=en", "title": "Rosy Lovers", "resume": "A family drama about a college student couple who unintentionally becomes parents and realize the true meaning of love and life. Jang Mi is an immature mama’s girl who grew without experiencing any hardship in life. Unlike her parents’ will to marry her off to a promising man they choose for her, Jang Mi has the hope to marry someone she falls madly in love with. As she dates healthy and innocent engineering student Cha Dol, she slowly begins to realize the meaning of love.", "rate": 0, "genre": ["Drama", "Family", "Romance"], "cast": ["Han Sun-hwa", "Lee Jang-woo", "Lee Mi-sook", "Ban Hyo-jung", "Moon Hee-kyung"], "character": ["Baek Jang-mi", "Park Cha-dol", "Jung Shi-nae", "Ma Pil-soon", "Emma Lee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61706   Expand Rosy Lovers   (2014) User Score Overview A family drama about a college student couple who unintentionally becomes parents and realize the true meaning of love and life. Jang Mi is an immature mama’s girl who grew without experiencing any hardship in life. Unlike her parents’ will to marry her off to a promising man they choose for her, Jang Mi has the hope to marry someone she falls madly in love with. As she dates healthy and innocent engineering student Cha Dol, she slowly begins to realize the meaning of love. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Han Sun-hwa Baek Jang-mi Lee Jang-woo Park Cha-dol Lee Mi-sook Jung Shi-nae Ban Hyo-jung Ma Pil-soon Moon Hee-kyung Emma Lee Full Cast & Crew Last Season Season 1 2014 | 52 Episodes Season 1 of Rosy Lovers premiered on October 18, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Rosy Lovers. You can help by rating TV shows you've seen. Facts Original Name  장미빛 연인들 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  70m Homepage   http://www.imbc.com/broad/tv/drama/rose/ Genres Drama Family Romance Keywords korea Content Score 86 Almost there... Top Contributors M 31 Maria180493 t 2 tmdb38202327 2 Elizabeth Jennings R 1 RJ_F13  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}