{"link": "https://www.themoviedb.org/tv/63419?language=en", "title": "Villiany Ganbo", "resume": "When Kanzaki Kaoru was young, her mother operated an Okonomiyaki restaurant. However, in just a day, her entire life as she knew it turned upside down. Her mother was declared a bankrupt, and they were plunged into a life of poverty. Moving from place to place, Kaoru started working the minute she graduated from middle high school. By scrimping and saving, today, Kaoru finally has 1 million yen in her savings account. Since she understood fully what it felt like to be poor, Kaoru lends her money to her colleague who is in financial trouble. She finds herself moneyless again, and under strange circumstances, she comes to know of someone who works for the company \"Koshimizu Consultant\"... and thus begins her journey into a world where betrayals are the norm, and everyone is trying to outwit the other; a world full of sly and cunning people. With her indomitable spirit, Kaoru claws her way.", "rate": 75, "genre": ["Drama", "Comedy", "Crime", "Action", "Adventure"], "cast": ["Machiko Ono", "Tomokazu Miura", "Kippei Shiina", "Shohei Miura", "Riisa Naka"], "character": ["Kaoru Kanzaki", "Chiaki Kaneko", "Hiraku Fuyutsuki", "Kazuma Takemoto", "Kiriko Mayakashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63419   Expand Villiany Ganbo   (2014) User Score Overview When Kanzaki Kaoru was young, her mother operated an Okonomiyaki restaurant. However, in just a day, her entire life as she knew it turned upside down. Her mother was declared a bankrupt, and they were plunged into a life of poverty. Moving from place to place, Kaoru started working the minute she graduated from middle high school. By scrimping and saving, today, Kaoru finally has 1 million yen in her savings account. Since she understood fully what it felt like to be poor, Kaoru lends her money to her colleague who is in financial trouble. She finds herself moneyless again, and under strange circumstances, she comes to know of someone who works for the company \"Koshimizu Consultant\"... and thus begins her journey into a world where betrayals are the norm, and everyone is trying to outwit the other; a world full of sly and cunning people. With her indomitable spirit, Kaoru claws her way. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Machiko Ono Kaoru Kanzaki Tomokazu Miura Chiaki Kaneko Kippei Shiina Hiraku Fuyutsuki Shohei Miura Kazuma Takemoto Riisa Naka Kiriko Mayakashi Full Cast & Crew Last Season Season 1 2014 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Villiany Ganbo. You can help by rating TV shows you've seen. Facts Original Name  極悪がんぼ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  - Homepage   http://www.fujitv.co.jp/ganbo/index.html Genres Drama Comedy Crime Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors a 41 anojoe 7 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}