{"link": "https://www.themoviedb.org/tv/44242?language=en", "title": "Devious Maids", "resume": "The series centers on four Latina maids working in the homes of Beverly Hills’ wealthiest and most powerful families, and a newcomer who made it personal after a maid was murdered and determined to uncover the truth behind her demise, and in the process become an ally in their lives.", "rate": 64, "genre": ["Drama", "Mystery"], "cast": ["Ana Ortiz", "Dania Ramirez", "Grant Show", "Roselyn Sánchez", "Rebecca Wisocky"], "character": ["Marisol Suarez", "Rosie Falta", "Spence Westmore", "Carmen Luna", "Evelyn Powell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44242   Expand Devious Maids   (2013) User Score Overview The series centers on four Latina maids working in the homes of Beverly Hills’ wealthiest and most powerful families, and a newcomer who made it personal after a maid was murdered and determined to uncover the truth behind her demise, and in the process become an ally in their lives. Featured Crew Marc Cherry Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  11 Posters  14 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ana Ortiz Marisol Suarez Dania Ramirez Rosie Falta Grant Show Spence Westmore Roselyn Sánchez Carmen Luna Rebecca Wisocky Evelyn Powell Full Cast & Crew Last Season Season 4 2016 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Rosie: Happy Birthday Dania Ramirez! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  11 Posters  14 Recommendations   2012-01-03 Jane by Design 4.8    2011-09-28 Suburgatory 6.8    2013-06-03 Mistresses 4.6    2012-09-12 Guys with Kids 5.5    2015-12-07 Telenovela 7.2    2012-09-11 The New Normal 5.2    2013-01-14 The Carrie Diaries 4.9    2017-04-25 Great News 6.5  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  43m, 60m Homepage   http://www.mylifetime.com/shows/devious-maids Genres Drama Mystery Keywords secret latinx lead wealthy maid beverly hills upstairs downstairs Content Score 100 Yes! Looking good! Top Contributors s 25 shiff7 23 Travis Bell 23 Elizabeth Jennings 20 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}