{"link": "https://www.themoviedb.org/tv/38655?language=en", "title": "Brødrene Dal og legenden om Atlant-is", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 83, "genre": ["Action", "Adventure", "Comedy", "Drama"], "cast": ["Knut Lystad", "Trond Kirkvaag", "Bjørn Sundquist", "Hilde Lyrån", "Nils Ole Oftebro"], "character": ["Roms Dal", "Bumund Dal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38655   Expand Brødrene Dal og legenden om Atlant-is   (1994) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Knut Lystad Roms Dal Trond Kirkvaag Bumund Dal Bjørn Sundquist Hilde Lyrån Nils Ole Oftebro Full Cast & Crew Last Season Season 1 1994 | 12 Episodes Season 1 of Brødrene Dal og legenden om Atlant-is premiered on September 24, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  2 Recommendations   1982-02-06 Brødrene Dal og Spektralsteinene 8.2    1979-01-27 Brødrene Dal og Professor Drøvels hemmelighet 8.2  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  Norwegian Runtime  21m Homepage  - Genres Action & Adventure Comedy Drama Keywords sibling relationship miniseries Content Score 64 We're so close, yet so far. Top Contributors 24 d00ziie R 8 Rebecca TB 8 TMDb Bot 5 Lars the Alien  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}