{"link": "https://www.themoviedb.org/tv/62076?language=en", "title": "Saintly Woman", "resume": "When I was 17-years-old, Maria was a college student and worked as a private tutor. Her student was me. She left a last message to me, \"when you graduate from college and become an adult, can you become my lover?,\" and then she disappeared. 10 years later, I meet her again. She is now a suspect in a serial murder case and I am a lawyer.", "rate": 0, "genre": ["Drama", "Mystery"], "cast": ["Ryoko Hirosue", "Kento Nagayama", "Misako Renbutsu"], "character": ["Motoko Hijii / Maria Ozawa", "Haruki Nakamura", "Izumi Motomiya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62076   Expand Saintly Woman   (2014) User Score Overview When I was 17-years-old, Maria was a college student and worked as a private tutor. Her student was me. She left a last message to me, \"when you graduate from college and become an adult, can you become my lover?,\" and then she disappeared. 10 years later, I meet her again. She is now a suspect in a serial murder case and I am a lawyer. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryoko Hirosue Motoko Hijii / Maria Ozawa Kento Nagayama Haruki Nakamura Misako Renbutsu Izumi Motomiya Full Cast & Crew Last Season Season 1 2014 | 7 Episodes Season 1 of Saintly Woman premiered on August 19, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Saintly Woman. You can help by rating TV shows you've seen. Facts Original Name  聖女 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  50m Homepage   http://www.nhk.or.jp/drama10/seijo/ Genres Drama Mystery Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 23 kappa-papa 10 Elizabeth Jennings CM 6 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}