{"link": "https://www.themoviedb.org/tv/3428?language=en", "title": "Super Robot Monkey Team Hyperforce Go!", "resume": "Super Robot Monkey Team Hyperforce Go! is an American/Japanese animated television series, and was created by Ciro Nieli, one of the directors of Teen Titans, with animation being done by a Japanese studio known as The Answer Studio. Set mainly on the fictional planet of Shuggazoom, the series follows the adventures of five cyborg monkeys and a human boy named Chiro as they struggle to protect their planet - and the rest of the universe - from the forces of evil.\nAs is obvious from the visual appearance of the show, there is a significant anime influence present, despite being produced for American television. It was also influenced by Star Trek, Super Sentai, Voltron and Star Wars. The show also contains various references to pop culture, a notable example being the episode \"Season of the Skull\", which is a parody of the 1970s thriller The Wicker Man.", "rate": 65, "genre": ["Animation"], "cast": ["Greg Cipes", "Kevin Michael Richardson", "Corey Feldman", "Mark Hamill"], "character": ["SPRX-77"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3428   Expand Super Robot Monkey Team Hyperforce Go!   (2004) User Score Overview Super Robot Monkey Team Hyperforce Go! is an American/Japanese animated television series, and was created by Ciro Nieli, one of the directors of Teen Titans, with animation being done by a Japanese studio known as The Answer Studio. Set mainly on the fictional planet of Shuggazoom, the series follows the adventures of five cyborg monkeys and a human boy named Chiro as they struggle to protect their planet - and the rest of the universe - from the forces of evil. As is obvious from the visual appearance of the show, there is a significant anime influence present, despite being produced for American television. It was also influenced by Star Trek, Super Sentai, Voltron and Star Wars. The show also contains various references to pop culture, a notable example being the episode \"Season of the Skull\", which is a parody of the 1970s thriller The Wicker Man. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Greg Cipes Kevin Michael Richardson Corey Feldman SPRX-77 Mark Hamill Full Cast & Crew Last Season Season 4 — | 13 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2005-05-30 The Life and Times of Juniper Lee 4.2    2006-10-02 Yin Yang Yo! 4.8    2000-09-30 George Shrinks 4.3    2001-08-11 Cubix 4.3    2004-01-23 Dave the Barbarian 4.8    2005-07-08 Camp Lazlo 5.6    2004-11-19 Hi Hi Puffy AmiYumi 4.0    2001-02-03 Lloyd in Space 4.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors s 2 speedycars w 2 whitetigerx8  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}