{"link": "https://www.themoviedb.org/tv/73994?language=en", "title": "Street Justice: The Bronx", "resume": "With over 2000 arrests to his name, Ralph Friedman is the most decorated detective in NYPD history. Detective Friedman takes viewers inside the high profile cases he investigated while working the mean streets of the Bronx.", "rate": 0, "genre": ["Documentary", "Crime"], "cast": ["Ralph Friedman"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73994   Expand Street Justice: The Bronx   (2017) User Score Overview With over 2000 arrests to his name, Ralph Friedman is the most decorated detective in NYPD history. Detective Friedman takes viewers inside the high profile cases he investigated while working the mean streets of the Bronx. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ralph Friedman Himself Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of Street Justice: The Bronx premiered on September 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Street Justice: The Bronx. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  60m Homepage   https://www.discovery.com/tv-shows/street-justice-the-bronx/ Genres Documentary Crime Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 20 Elizabeth Jennings 10 Ellin W. Eva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}