{"link": "https://www.themoviedb.org/tv/34742?language=en", "title": "To Love-Ru", "resume": "To Love-Ru is a Japanese manga series written by Saki Hasemi, and illustrated by Kentaro Yabuki, creator of Black Cat. The manga was serialized in Shueisha's manga magazine Weekly Shōnen Jump between April 24, 2006 and August 31, 2009; 18 tankōbon volumes have been published in Japan. A drama CD was released in February 2008 with an original story. A 26-episode anime series adaptation by Xebec aired in Japan between April and September 2008. Six original video animation episodes were produced by Xebec between April 2009 and April 2010. A 12-episode second season by Xebec titled Motto To-Love Ru aired between October and December 2010. A video game was released on the Nintendo DS in August 2008, and another game for the PlayStation Portable was released in October 2008.\nA continuation of the manga called To Love-Ru Darkness began serialization in Shueisha's Jump Square magazine on October 4, 2010. An anime TV series adaptation for To-Love Ru Darkness produced by Xebec began airing in October 2012. The title, とらぶる, is the English gairaigo \"trouble\" and \"rabu\" is the English loan word \"love\". The title is a pun on the words \"love trouble\", which describes the harem aspect of the series.", "rate": 93, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Kanae Itou", "Aki Toyosaki", "Kaori Nazuka", "Ayako Kawasumi", "Ryoka Yuzuki"], "character": ["Nana Astar Deviluke", "Momo Belia Deviluke", "Yui Kotegawa", "Saki Tenjōin", "Celine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34742   Expand To Love-Ru   (2008) User Score Overview To Love-Ru is a Japanese manga series written by Saki Hasemi, and illustrated by Kentaro Yabuki, creator of Black Cat. The manga was serialized in Shueisha's manga magazine Weekly Shōnen Jump between April 24, 2006 and August 31, 2009; 18 tankōbon volumes have been published in Japan. A drama CD was released in February 2008 with an original story. A 26-episode anime series adaptation by Xebec aired in Japan between April and September 2008. Six original video animation episodes were produced by Xebec between April 2009 and April 2010. A 12-episode second season by Xebec titled Motto To-Love Ru aired between October and December 2010. A video game was released on the Nintendo DS in August 2008, and another game for the PlayStation Portable was released in October 2008. A continuation of the manga called To Love-Ru Darkness began serialization in Shueisha's Jump Square magazine on October 4, 2010. An anime TV series adaptation for To-Love Ru Darkness produced by Xebec began airing in October 2012. The title, とらぶる, is the English gairaigo \"trouble\" and \"rabu\" is the English loan word \"love\". The title is a pun on the words \"love trouble\", which describes the harem aspect of the series. Featured Crew Takao Kato Creator Yuichi Oka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  13 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kanae Itou Nana Astar Deviluke Aki Toyosaki Momo Belia Deviluke Kaori Nazuka Yui Kotegawa Ayako Kawasumi Saki Tenjōin Ryoka Yuzuki Celine Full Cast & Crew Last Season To Love-Ru Darkness 2nd 2015 | 14 Episodes Season 4 of To Love-Ru premiered on July  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  13 Recommendations We don't have enough data to suggest any TV shows based on To Love-Ru. You can help by rating TV shows you've seen. Facts Original Name  To LOVEる -とらぶる- Status  Ended Networks BS-i Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.j-toloveru.com/ Genres Animation Comedy Sci-Fi & Fantasy Keywords harem school based on manga ecchi shounen anime Content Score 100 Yes! Looking good! Top Contributors R 34 Rochus 26 Marr 🇳🇱 t 18 theusedversion 15 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}