{"link": "https://www.themoviedb.org/tv/2777?language=en", "title": "Oggy and the Cockroaches", "resume": "Oggy and the Cockroaches is a French animated comedy series produced by Xilam and Gaumont Film Company.", "rate": 63, "genre": ["Animation", "Comedy"], "cast": ["Greg Eagles"], "character": ["Jack (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2777   Expand Oggy and the Cockroaches   (1998) User Score Overview Oggy and the Cockroaches is a French animated comedy series produced by Xilam and Gaumont Film Company. Featured Crew Jean-Yves Raimbaud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Greg Eagles Jack (voice) Full Cast & Crew Last Season Season 5 2017 | 8 Episodes Season 5 of Oggy and the Cockroaches premiered on June 30, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   1992-07-20 Bananas in Pyjamas 3.3    1986-05-28 Pingu 6.5    2007-06-09 Ergo Proxy 7.3    2000-09-09 Jackie Chan Adventures 7.1    1993-09-12 Lois & Clark: The New Adventures of Superman 6.6    1992-10-03 Highlander: The Series 6.9    1999-12-24 Happy Tree Friends 6.8    1984-10-06 The Transformers 7.4  Facts Original Name  Oggy et les Cafards Status  Returning Series Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  French Runtime  8m Homepage   http://www.oggy.com Genres Animation Comedy Keywords cockroach rivalry slapstick cartoon cat annoying Content Score 71 Just a little bit more... Top Contributors R 22 Rebecca 16 Banana 8 MrDCamargo 4 Maikkoum  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}