{"link": "https://www.themoviedb.org/tv/73382?language=en", "title": "Inhuman Condition", "resume": "In a world where the supernatural is known but scorned, werewolves, \"walkers\" and beings with supernatural afflictions attempt to live normal lives in human society. Many are closeted. Few are accepted. To help them fit in, and to navigate the problems in their lives, they come to Dr. Michelle Kessler. A therapist by trade, Kessler is equal parts strong and empathetic, providing her patients a safe space to explore and understand themselves in a world where losing grip could put their families at risk. Self-hatred, alienation. The burdens of carrying impossible secrets. The struggle to feel human.", "rate": 0, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Torri Higginson"], "character": ["Dr. Michelle Kessler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73382   Expand Inhuman Condition   (2016) User Score  Play Trailer Overview In a world where the supernatural is known but scorned, werewolves, \"walkers\" and beings with supernatural afflictions attempt to live normal lives in human society. Many are closeted. Few are accepted. To help them fit in, and to navigate the problems in their lives, they come to Dr. Michelle Kessler. A therapist by trade, Kessler is equal parts strong and empathetic, providing her patients a safe space to explore and understand themselves in a world where losing grip could put their families at risk. Self-hatred, alienation. The burdens of carrying impossible secrets. The struggle to feel human. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Torri Higginson Dr. Michelle Kessler Full Cast & Crew Last Season Season 1 2016 | 1 Episode Season 1 of Inhuman Condition premiered on July  4, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Inhuman Condition. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors Y 8 YouShouldKnow 3 Elizabeth Jennings TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}