{"link": "https://www.themoviedb.org/tv/37873?language=en", "title": "Darwin's Brave New World", "resume": "Darwin's Brave New World is a three-part drama-documentary TV series about Charles Darwin's evolution by means of natural selection. It uses reconstruction with present day documentary between the 19th century and present day. The series was developed to coincide with the 150th anniversary of the publication of Darwin's On the Origin of Species.\nIt was produced with the assistance of the Canadian Television Fund in association with the Canadian Broadcasting Corporation and the Australian Broadcasting Corporation. Produced in association with the New South Wales Film and Television Office. It screened on ABC Australia in November 2009, and on CBC as part of the show The Nature of Things in November 2009.\nDARWIN'S BRAVE NEW WORLD:  EXPANDED EDITION\nThe Expanded Edition of Darwin’s Brave New World is the basis of the Arte/ZDF version as shown in France and Germany. This edition features extended interview segments with scientific contributors.\nThe episodes also include drama sequences  not seen by North American audiences. The Expanded Edition is the definitive version of the miniseries about how the Southern Hemisphere inspired the most controversial idea in science.", "rate": 0, "genre": ["Documentary"], "cast": ["Paul Gleeson", "Mathew Waters", "Socratis Otto", "Joe Manning", "Anthony Simcoe"], "character": ["Charles Lyell", "Syms Covington", "Charles Darwin", "Sir Joseph Hooker", "Richard Owen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37873   Expand Darwin's Brave New World   (2009) User Score Overview Darwin's Brave New World is a three-part drama-documentary TV series about Charles Darwin's evolution by means of natural selection. It uses reconstruction with present day documentary between the 19th century and present day. The series was developed to coincide with the 150th anniversary of the publication of Darwin's On the Origin of Species. It was produced with the assistance of the Canadian Television Fund in association with the Canadian Broadcasting Corporation and the Australian Broadcasting Corporation. Produced in association with the New South Wales Film and Television Office. It screened on ABC Australia in November 2009, and on CBC as part of the show The Nature of Things in November 2009. DARWIN'S BRAVE NEW WORLD:  EXPANDED EDITION The Expanded Edition of Darwin’s Brave New World is the basis of the Arte/ZDF version as shown in France and Germany. This edition features extended interview segments with scientific contributors. The episodes also include drama sequences  not seen by North American audiences. The Expanded Edition is the definitive version of the miniseries about how the Southern Hemisphere inspired the most controversial idea in science. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Gleeson Charles Lyell Mathew Waters Syms Covington Socratis Otto Charles Darwin Joe Manning Sir Joseph Hooker Anthony Simcoe Richard Owen Full Cast & Crew Last Season Season 1 2009 | 5 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Darwin's Brave New World. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Documentary Original Language  English Runtime  45m, 60m Homepage   http://www.fernsproductions.com/Store.html# Genres Documentary Keywords history naturalist genealogy Content Score 86 Almost there... Top Contributors 49 waaw 1 Rug  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}