{"link": "https://www.themoviedb.org/tv/45502?language=en", "title": "Queen's Blade", "resume": "Leina is walking outside of town when she encounters Melona, and tells her she is going to defeat her for attacking travellers. Melona taunts Leina for being such a weak fighter, and says she only wants to fight decent warriors as she is a participant in the Queen's Blade, a tournament held every four years to decide who is going to be the next Queen. Risty is watching the battle from the sidelines, and just as Melona is about to kill Leina, Risty intervenes and saves her life. Soon after, Nanael appears on the battlefield, hoping she found a potential battle, only to find the place deserted. Risty tends to Leina until she recovers and takes her as a prisoner back to Vance Castle to recover the bounty on her head. When Risty arrives at the castle, Claudette appears and arrests Risty for being a thief and imprisons her in the castle's dungeon. However, Risty escapes and steals the Vance Family's heirloom breastplate. She hides in Leina's room and gives Leina the armor, then leaves, encountering Claudette outside and they fight. Meanwhile, Melona appears at Leina's window. They fight, and Leina defeats Melona by stopping her from shooting acid from her breasts, causing her to explode.", "rate": 78, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Mamiko Noto", "Atsuko Tanaka", "Aya Hirano", "Yuki Kaida", "Kaori Mizuhashi"], "character": ["Tomoe", "Claudette", "Nanael", "Echidna", "Elina"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45502   Expand Queen's Blade   (2009) User Score Overview Leina is walking outside of town when she encounters Melona, and tells her she is going to defeat her for attacking travellers. Melona taunts Leina for being such a weak fighter, and says she only wants to fight decent warriors as she is a participant in the Queen's Blade, a tournament held every four years to decide who is going to be the next Queen. Risty is watching the battle from the sidelines, and just as Melona is about to kill Leina, Risty intervenes and saves her life. Soon after, Nanael appears on the battlefield, hoping she found a potential battle, only to find the place deserted. Risty tends to Leina until she recovers and takes her as a prisoner back to Vance Castle to recover the bounty on her head. When Risty arrives at the castle, Claudette appears and arrests Risty for being a thief and imprisons her in the castle's dungeon. However, Risty escapes and steals the Vance Family's heirloom breastplate. She hides in Leina's room and gives Leina the armor, then leaves, encountering Claudette outside and they fight. Meanwhile, Melona appears at Leina's window. They fight, and Leina defeats Melona by stopping her from shooting acid from her breasts, causing her to explode. Featured Crew Kinji Yoshimoto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mamiko Noto Tomoe Atsuko Tanaka Claudette Aya Hirano Nanael Yuki Kaida Echidna Kaori Mizuhashi Elina Full Cast & Crew Last Season Season 3 2012 | 12 Episodes Season 3 of Queen's Blade premiered on April  2, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Queen's Blade. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  12 Recommendations We don't have enough data to suggest any TV shows based on Queen's Blade. You can help by rating TV shows you've seen. Facts Original Name  クイーンズブレイド Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://queensblade.tv/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords sword fight ecchi fan service Content Score 100 Yes! Looking good! Top Contributors C 122 Chasil t 20 theusedversion 12 shizuku R 7 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}