{"link": "https://www.themoviedb.org/tv/7266?language=en", "title": "Speed Racer: The Next Generation", "resume": "Speed Racer: The Next Generation is an American animated television series based on the classic Japanese Speed Racer franchise, in which the internal events take place decades after those in the 1967 Japanese series. It is the fourth television adaptation of the franchise, and is executive produced by Lions Gate Entertainment, Larry Schwarz, and Ken Katsumoto. It is the first Nicktoon not to be based on an original property. Animation Collective produced the series, while the Flash character animation was handled by the now-defunct Collideascope Studios as their very last project. The last episode of Season 1 features the voice of NASCAR racer Jeff Gordon, who plays Turbo McCalister.\nThis series was partly made to promote the live-action film, and the pilot movie premiered on Nicktoons Network on May 2, 2008, a week before the feature film adaptation was released in theatres. However, both projects were produced independently from one another and featured different generations of \"Speed Racers\", though both featured a Mach 6. Five three-part specials aired on Nickelodeon from March 14, 2009 to April 11, 2009.\nA second season began airing on March 24, 2011. The animation, layout, and 3D effects were outsourced to Toonz Entertainment in India for this season. After his death, Peter Fernandez's roles were replaced by Greg Abbey.", "rate": 0, "genre": ["Animation"], "cast": ["Peter Fernandez", "Michael Sinterniklaas", "Robbie Sublett", "Sahra Mellesse", "Kurt Csolak"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7266   Expand Speed Racer: The Next Generation   (2008) User Score Overview Speed Racer: The Next Generation is an American animated television series based on the classic Japanese Speed Racer franchise, in which the internal events take place decades after those in the 1967 Japanese series. It is the fourth television adaptation of the franchise, and is executive produced by Lions Gate Entertainment, Larry Schwarz, and Ken Katsumoto. It is the first Nicktoon not to be based on an original property. Animation Collective produced the series, while the Flash character animation was handled by the now-defunct Collideascope Studios as their very last project. The last episode of Season 1 features the voice of NASCAR racer Jeff Gordon, who plays Turbo McCalister. This series was partly made to promote the live-action film, and the pilot movie premiered on Nicktoons Network on May 2, 2008, a week before the feature film adaptation was released in theatres. However, both projects were produced independently from one another and featured different generations of \"Speed Racers\", though both featured a Mach 6. Five three-part specials aired on Nickelodeon from March 14, 2009 to April 11, 2009. A second season began airing on March 24, 2011. The animation, layout, and 3D effects were outsourced to Toonz Entertainment in India for this season. After his death, Peter Fernandez's roles were replaced by Greg Abbey. Featured Crew Larry Schwarz Creator Tatsuo Yoshida Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Fernandez Michael Sinterniklaas Robbie Sublett Sahra Mellesse Kurt Csolak Full Cast & Crew Last Season Season 2 2011 | 9 Episodes Season 2 of Speed Racer: The Next Generation premiered on March 24, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Speed Racer: The Next Generation. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.lionsgate.com/speedracer/ Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors T 2 TankGirl72  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}