{"link": "https://www.themoviedb.org/tv/40715?language=en", "title": "Der kleine Vampir – Neue Abenteuer", "resume": "Der kleine Vampir – Neue Abenteuer is a German children's television series made in 1993. The series counts 13 episodes and is based upon the books The little vampire travels and The little vampire at the farm which are part of Der kleine Vampir written by German author Angela Sommer-Bodenburg.\nIn 1986 another series was aired: Der kleine Vampir which was based upon other books. In the new series, other actors were used as the originals were now eight years older. The new series is neither a successor concerning the story. Furthermore, the new series introduce Anna and Rüdigers parents. Also, uncle Theodor is not present as he is dead whereas Theodor was a main character in the first series.", "rate": 0, "genre": ["Adventure", "Family"], "cast": ["Jan Steilen", "Matthias Ruschke", "Lena Krüper", "Dominique Horwitz", "Dietrich Mattausch"], "character": ["Rüdiger, der kleine Vampir", "Anton Bohnsack", "Anna", "Stöbermann", "Ludwig der Fürchterliche"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40715   Expand Der kleine Vampir – Neue Abenteuer   (1993) User Score Overview Der kleine Vampir – Neue Abenteuer is a German children's television series made in 1993. The series counts 13 episodes and is based upon the books The little vampire travels and The little vampire at the farm which are part of Der kleine Vampir written by German author Angela Sommer-Bodenburg. In 1986 another series was aired: Der kleine Vampir which was based upon other books. In the new series, other actors were used as the originals were now eight years older. The new series is neither a successor concerning the story. Furthermore, the new series introduce Anna and Rüdigers parents. Also, uncle Theodor is not present as he is dead whereas Theodor was a main character in the first series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jan Steilen Rüdiger, der kleine Vampir Matthias Ruschke Anton Bohnsack Lena Krüper Anna Dominique Horwitz Stöbermann Dietrich Mattausch Ludwig der Fürchterliche Full Cast & Crew Last Season Season 1 1993 | 13 Episodes Season 1 of Der kleine Vampir – Neue Abenteuer premiered on December  5, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Der kleine Vampir – Neue Abenteuer. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  30m Homepage  - Genres Adventure Family Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors S 30 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}