{"link": "https://www.themoviedb.org/tv/19869?language=en", "title": "La Seine no Hoshi", "resume": "La Seine no Hoshi is an anime series by Sunrise, which premiered in Japan on Fuji TV from April 4, 1975 and finished its run on December 26, 1975, spanning a total of 39 episodes. The title translates to English as \"Star of the Seine\" or \"The Seine's Stars.\" It is based on Alain Delon's 1963 movie La Tulipe noire.\nIt was created by Mitsuru Kaneko, and was directed by Masaaki Ōsumi and Yoshiyuki Tomino. It was written by Sōji Yoshikawa, while the character designer was Akio Sugino. The music for the series was composed by Shunsuke Kikuchi.", "rate": 0, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["Masako Nozawa", "Taichirō Hirokawa", "Terumi Niki", "Jōji Yanami", "Kei Tomiyama"], "character": ["Danton", "Robert de Forge", "Simone", "Marquess de Moralle", "Milan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19869   Expand La Seine no Hoshi   (1975) User Score Overview La Seine no Hoshi is an anime series by Sunrise, which premiered in Japan on Fuji TV from April 4, 1975 and finished its run on December 26, 1975, spanning a total of 39 episodes. The title translates to English as \"Star of the Seine\" or \"The Seine's Stars.\" It is based on Alain Delon's 1963 movie La Tulipe noire. It was created by Mitsuru Kaneko, and was directed by Masaaki Ōsumi and Yoshiyuki Tomino. It was written by Sōji Yoshikawa, while the character designer was Akio Sugino. The music for the series was composed by Shunsuke Kikuchi. Featured Crew Mitsuru Kaneko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masako Nozawa Danton Taichirō Hirokawa Robert de Forge Terumi Niki Simone Jōji Yanami Marquess de Moralle Kei Tomiyama Milan Full Cast & Crew Last Season Season 1 1975 | 39 Episodes Season 1 of La Seine no Hoshi premiered on April  4, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on La Seine no Hoshi. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Animation Drama Keywords cartoon anime Content Score 93 Almost there... Top Contributors CN 26 Carmelo Nicolosi 4 BigMad D 3 Deepjungle TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}