{"link": "https://www.themoviedb.org/tv/16766?language=en", "title": "Sex: The Revolution", "resume": "Sex: The Revolution was a four-part 2008 American documentary miniseries that aired on VH1 and The Sundance Channel. It chronicled the rise of American interest in sexuality from the 1950s through the 1990s.\nThe version shown on VH1 was pixelated to censor nudity including in discussions of censorship of nudity. VH1 Latin America aired the uncensored version.", "rate": 70, "genre": ["Documentary"], "cast": ["Tab Hunter", "Randy Jones", "Gay Talese", "Phil Donahue", "Larry Flynt"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16766   Expand Sex: The Revolution   (2008) User Score Overview Sex: The Revolution was a four-part 2008 American documentary miniseries that aired on VH1 and The Sundance Channel. It chronicled the rise of American interest in sexuality from the 1950s through the 1990s. The version shown on VH1 was pixelated to censor nudity including in discussions of censorship of nudity. VH1 Latin America aired the uncensored version. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tab Hunter Randy Jones Gay Talese Phil Donahue Larry Flynt Full Cast & Crew Last Season Season 1 2008 | 4 Episodes Season 1 of Sex: The Revolution premiered on May 12, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sex: The Revolution. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Documentary Original Language  English Runtime  60m Homepage  - Genres Documentary Keywords sexual revolution sex education american history sexual attitudes Content Score 86 Almost there... Top Contributors 10 Banana W 1 WaLLY  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}