{"link": "https://www.themoviedb.org/tv/3543?language=en", "title": "Graffiti Rock", "resume": "Graffiti Rock was a hip-hop based television program, originally screened June 29, 1984. Intended as an on-going series, the show only received one pilot episode and aired on WPIX channel 11 in New York City and 88 markets around the country, to good Nielsen ratings.\nGraffiti Rock resembled a hip hop version of the popular television dance shows at the time such as Soul Train and American Bandstand. The show was created and hosted by Michael Holman, who was the manager of the popular break-dancing crew, the New York City Breakers.\nThe episode features Run D.M.C., Shannon, The New York City Breakers, DJ Jimmie Jazz and Kool Moe Dee and Special K of the Treacherous Three. The New York City Breakers, who were fresh off of their success from the movie, Beat Street, made a showcase appearance. The episode also features television and film actress, Debi Mazar and actor/director Vincent Gallo as dancers on the show.\nA segment of the show was sampled on The Beastie Boys' LP Ill Communication. \"[...] alright, you're scratchin it right now, cut the record back and forth against the needle, back and forth, back and forth, make it scratch, but let me tell you something don't try this at home on your dad's stereo only under hiphop supervision, alright ?\" The show has since become an important 'must-see' for hip-hop enthusiasts, alongside such titles as Wild Style and Beat Street.", "rate": 55, "genre": ["Music"], "cast": ["Michael Holman", "Debi Mazar", "Vincent Gallo", "Kool Moe Dee"], "character": ["Himself - Host", "Herself", "Himself - \"Prince Vince\"", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3543   Expand Graffiti Rock   (1984) User Score Overview Graffiti Rock was a hip-hop based television program, originally screened June 29, 1984. Intended as an on-going series, the show only received one pilot episode and aired on WPIX channel 11 in New York City and 88 markets around the country, to good Nielsen ratings. Graffiti Rock resembled a hip hop version of the popular television dance shows at the time such as Soul Train and American Bandstand. The show was created and hosted by Michael Holman, who was the manager of the popular break-dancing crew, the New York City Breakers. The episode features Run D.M.C., Shannon, The New York City Breakers, DJ Jimmie Jazz and Kool Moe Dee and Special K of the Treacherous Three. The New York City Breakers, who were fresh off of their success from the movie, Beat Street, made a showcase appearance. The episode also features television and film actress, Debi Mazar and actor/director Vincent Gallo as dancers on the show. A segment of the show was sampled on The Beastie Boys' LP Ill Communication. \"[...] alright, you're scratchin it right now, cut the record back and forth against the needle, back and forth, back and forth, make it scratch, but let me tell you something don't try this at home on your dad's stereo only under hiphop supervision, alright ?\" The show has since become an important 'must-see' for hip-hop enthusiasts, alongside such titles as Wild Style and Beat Street. Featured Crew Michael Holman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  1 Top Billed Cast Michael Holman Himself - Host Debi Mazar Herself Vincent Gallo Himself - \"Prince Vince\" Kool Moe Dee Himself Full Cast & Crew Last Season Graffiti Rock 1984 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Graffiti Rock. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification NR Meaning No rating information Type  Video Original Language  English Runtime  23m Homepage  - Genres Music Keywords rap music hip-hop breakdance variety show Content Score 100 Yes! Looking good! Top Contributors 24 Mikedeth5 17 jessek s 3 six  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}