{"link": "https://www.themoviedb.org/tv/8083?language=en", "title": "Crossballs: The Debate Show", "resume": "Crossballs: The Debate Show is a Comedy Central television show which poked fun at cable news networks' political debate shows, especially CNN's Crossfire and MSNBC's Hardball with Chris Matthews. In each episode, comedians posing as experts on a particular subject would debate two real commentators. The true experts were unaware that the show was a sham. Topics ranged from reality television to religion to violence in video games.\nIt debuted on July 6, 2004 and ran for eight weeks. It aired Tuesday-Friday at 7:30 p.m. ET. The twenty-third and final episode aired on August 24, 2004. Show number 24 was taped but never aired, after one of the unsuspecting guests, James March, threatened to sue Comedy Central.", "rate": 0, "genre": ["Comedy"], "cast": ["Mary Birdsong", "Paul Scheer", "Rich Fulcher", "Dannah Phirman", "Andrew Daly"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8083   Expand Crossballs: The Debate Show   (2004) User Score Overview Crossballs: The Debate Show is a Comedy Central television show which poked fun at cable news networks' political debate shows, especially CNN's Crossfire and MSNBC's Hardball with Chris Matthews. In each episode, comedians posing as experts on a particular subject would debate two real commentators. The true experts were unaware that the show was a sham. Topics ranged from reality television to religion to violence in video games. It debuted on July 6, 2004 and ran for eight weeks. It aired Tuesday-Friday at 7:30 p.m. ET. The twenty-third and final episode aired on August 24, 2004. Show number 24 was taped but never aired, after one of the unsuspecting guests, James March, threatened to sue Comedy Central. Featured Crew Matt Besser Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mary Birdsong Paul Scheer Rich Fulcher Dannah Phirman Andrew Daly Full Cast & Crew Last Season Crossballs season 1 2004 | 24 Episodes Season 1 of Crossballs: The Debate Show premiered on July  6, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Crossballs: The Debate Show. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors No contributors found. Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}