{"link": "https://www.themoviedb.org/tv/37647?language=en", "title": "Beautiful Charm", "resume": "Cazibe, an Azerbaijani immigrant, marries Kemal to become a Turkish citizen. Ms. Gül who deals with illegal marriages arranges this marriage which will last for 3 years according to the agreement. Kemal receives 10,000 Turkish liras from Cazibe. But Kemal has a girlfriend, Simge, who is the daughter of Kemal's boss. Kemal's boss does not know that Kemal and his daughter are in a relationship. Simge thinks that Cazibe is Kemal's maid. However, Ejder is the foreign marriage detective and he is trying to find proof that Cazibe only married Kemal to become a Turkish Citizen.\nThe word \"Yahşi\" comes from Azerbaijani and means \"beautiful, nice, attractive\". \"Cazibe\" means seduction.", "rate": 30, "genre": ["Family", "Comedy"], "cast": ["Hakan Yılmaz", "Aslihan Gurbuz", "Gökçe Özyol", "Hande Katipoglu", "Sezai Aydın"], "character": ["Kemal Kükreyen", "Cazibe Abbasova", "Barış Apaydın", "Simge Özkantarcı", "Hulusi Özkantarcı"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37647   Expand Beautiful Charm   (2010) User Score Overview Cazibe, an Azerbaijani immigrant, marries Kemal to become a Turkish citizen. Ms. Gül who deals with illegal marriages arranges this marriage which will last for 3 years according to the agreement. Kemal receives 10,000 Turkish liras from Cazibe. But Kemal has a girlfriend, Simge, who is the daughter of Kemal's boss. Kemal's boss does not know that Kemal and his daughter are in a relationship. Simge thinks that Cazibe is Kemal's maid. However, Ejder is the foreign marriage detective and he is trying to find proof that Cazibe only married Kemal to become a Turkish Citizen. The word \"Yahşi\" comes from Azerbaijani and means \"beautiful, nice, attractive\". \"Cazibe\" means seduction. Featured Crew Gani Müjde Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hakan Yılmaz Kemal Kükreyen Aslihan Gurbuz Cazibe Abbasova Gökçe Özyol Barış Apaydın Hande Katipoglu Simge Özkantarcı Sezai Aydın Hulusi Özkantarcı Full Cast & Crew Last Season Season 2 2011 | 42 Episodes Season 2 of Beautiful Charm premiered on September  3, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Beautiful Charm. You can help by rating TV shows you've seen. Facts Original Name  Yahşi Cazibe Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  90m Homepage  - Genres Family Comedy Keywords fictitious marriage sitcom azerbaijani Content Score 93 Almost there... Top Contributors 28 purplelammashta b 19 bluwy u 11 ugurnazli  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}