{"link": "https://www.themoviedb.org/tv/12479?language=en", "title": "Pink Panther and Sons", "resume": "Pink Panther and Sons is an American animated Pink Panther television series produced by Hanna-Barbera Productions and MGM/UA Television. The series was originally broadcast on NBC from 1984 to 1985 and moved to ABC in 1986. The original Pink Panther cartoons were produced by DePatie-Freleng Enterprises, is in the TV animation industry, but in 1981, the studio was sold to Marvel Comics and renamed Marvel Productions. David DePatie and Friz Freleng served as producers for the series.", "rate": 50, "genre": ["Animation", "Comedy"], "cast": ["Frank Welker", "B. J. Ward", "Jeannie Elias", "Sherry Lynn", "Sonny Melendrez"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12479   Expand Pink Panther and Sons   (1984) User Score Overview Pink Panther and Sons is an American animated Pink Panther television series produced by Hanna-Barbera Productions and MGM/UA Television. The series was originally broadcast on NBC from 1984 to 1985 and moved to ABC in 1986. The original Pink Panther cartoons were produced by DePatie-Freleng Enterprises, is in the TV animation industry, but in 1981, the studio was sold to Marvel Comics and renamed Marvel Productions. David DePatie and Friz Freleng served as producers for the series. Featured Crew DePatie-Freleng Enterprises Creator Friz Freleng Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Welker B. J. Ward Jeannie Elias Sherry Lynn Sonny Melendrez Full Cast & Crew Last Season Season 1 1984 | 26 Episodes Season 1 of Pink Panther and Sons premiered on September  8, 1984. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Pink Panther and Sons. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 8 zurman1 k 5 kaxhy 2 BigMad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}