{"link": "https://www.themoviedb.org/tv/2897?language=en", "title": "La vie devant nous", "resume": "La vie devant nous was the most popular teenage drama in France about a group of high school friends growing up, falling in love, fighting, dealing with troubles, exploring their sexuality and more.", "rate": 0, "genre": ["Family", "Drama", "Comedy"], "cast": ["Gianni Giardinelli", "Guillaume Delorme", "Marie Mouté", "Camille De Pazzis", "Samuel Perche"], "character": ["Stanislas de Courbel", "Barthélémy Berger", "Alizée Guillaume", "Inés", "Constant de Courbel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2897   Expand La vie devant nous   (2002) User Score Overview La vie devant nous was the most popular teenage drama in France about a group of high school friends growing up, falling in love, fighting, dealing with troubles, exploring their sexuality and more. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gianni Giardinelli Stanislas de Courbel Guillaume Delorme Barthélémy Berger Marie Mouté Alizée Guillaume Camille De Pazzis Inés Samuel Perche Constant de Courbel Full Cast & Crew Last Season Season 1 2002 | 52 Episodes Season 1 of La vie devant nous premiered on July  6, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on La vie devant nous. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  French Runtime  45m Homepage  - Genres Family Drama Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 5 35 5lucina5  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}