{"link": "https://www.themoviedb.org/tv/61457?language=en", "title": "Grantchester", "resume": "Drama series set in 1953, against the backdrop of the real hamlet of Grantchester. The drama focuses upon the life of Sidney Chambers, a charismatic, charming clergyman who turns investigative vicar when one of his parishioners dies in suspicious circumstances.", "rate": 74, "genre": ["Mystery", "Crime", "Drama"], "cast": ["James Norton", "Robson Green", "Morven Christie", "Tessa Peake-Jones", "Al Weaver"], "character": ["Sidney Chambers", "Geordie Keating", "Amanda Kendall", "Mrs. Maguire", "Leonard Finch"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61457   Expand Grantchester   (2014) User Score  Play Trailer Overview Drama series set in 1953, against the backdrop of the real hamlet of Grantchester. The drama focuses upon the life of Sidney Chambers, a charismatic, charming clergyman who turns investigative vicar when one of his parishioners dies in suspicious circumstances. Featured Crew Daisy Coulam Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  2 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Norton Sidney Chambers Robson Green Geordie Keating Morven Christie Amanda Kendall Tessa Peake-Jones Mrs. Maguire Al Weaver Leonard Finch Full Cast & Crew Last Season Season 3 2017 | 6 Episodes Season 3 of Grantchester premiered on April 23, 2017. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply t leonard Open 1 by  TrentTX b I say,,,poor Amanda Open 2 by  TrentTX t poor leonard... Open 3 by  TrentTX Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2012-01-02 Endeavour 8.1    2011-06-05 Case Histories 8.2    2015-05-05 No Offence 7.8    2011-09-16 DCI Banks 7.9    2012-08-30 Good Cop 6.6    2015-10-08 Unforgotten 7.7    2014-11-23 Remember Me 6.7    2006-01-01 In Justice 6.8  Facts Status  Returning Series Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   https://www.itv.com/itvplayer/grantchester Genres Mystery Crime Drama Keywords detective village priest period drama police detective united kingdom vicar murder investigation 1950s Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings 22 Steve 13 Banana t 7 tmdb80496521  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}