{"link": "https://www.themoviedb.org/tv/3319?language=en", "title": "Darkwing Duck", "resume": "Darkwing Duck is an American animated action-adventure television series produced by The Walt Disney Company that ran from 1991–1995 on both the syndicated programming block The Disney Afternoon and Saturday mornings on ABC. It featured the eponymous anthropomorphic duck superhero whose alter ego is mild-mannered single quacker Drake Mallard. It is the only direct spin-off of DuckTales.", "rate": 74, "genre": ["Action", "Adventure", "Animation", "Comedy", "Family"], "cast": ["Terence McGovern", "Jim Cummings", "Christine Cavanaugh"], "character": ["Launchpad McQuack (voice)", "Darkwing Duck (voice)", "Gosalyn Waddlemeyer-Mallard (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3319   Expand Darkwing Duck   (1991) User Score Overview Darkwing Duck is an American animated action-adventure television series produced by The Walt Disney Company that ran from 1991–1995 on both the syndicated programming block The Disney Afternoon and Saturday mornings on ABC. It featured the eponymous anthropomorphic duck superhero whose alter ego is mild-mannered single quacker Drake Mallard. It is the only direct spin-off of DuckTales. Featured Crew Tad Stones Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Terence McGovern Launchpad McQuack (voice) Jim Cummings Darkwing Duck (voice) Christine Cavanaugh Gosalyn Waddlemeyer-Mallard (voice) Full Cast & Crew Last Season Season 3 1992 | 13 Episodes Season 3 of Darkwing Duck premiered on September 12, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  3 Recommendations   1987-09-18 DuckTales 7.6    1989-03-05 Chip 'n Dale Rescue Rangers 7.1    1994-10-24 Gargoyles 8.0    1993-09-13 Animaniacs 7.6    1994-09-05 Aladdin 6.2    1987-09-10 Teenage Mutant Ninja Turtles 7.3    1992-09-05 Goof Troop 6.5    1992-07-25 TaleSpin 7.3  Facts Status  Ended Networks Broadcast Syndication Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m Homepage  - Genres Action & Adventure Animation Comedy Family Keywords superhero cartoon duck Content Score 64 We're so close, yet so far. Top Contributors 30 Banana S 11 Smiddy17 z 8 zurman1 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}