{"link": "https://www.themoviedb.org/tv/964?language=en", "title": "The Ghost Busters", "resume": "The Ghost Busters was a live-action children's television series that ran in 1975, about a team of bumbling detectives who would investigate ghostly occurrences. Only 15 episodes were created.\nThis series reunited Forrest Tucker and Larry Storch in roles similar to their characters in F Troop. Tucker played Jake Kong, and Storch played zoot suit-wearing Eddie Spencer. The third member of the trio was Tracy the Gorilla, played by actor Bob Burns.\nThe series was unrelated to the 1984 film Ghostbusters.", "rate": 0, "genre": ["Sci-Fi", "Fantasy", "Family", "Comedy"], "cast": ["Larry Storch", "Forrest Tucker", "Linda Gary", "Susan Blu", "Pat Fraley"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 964   Expand The Ghost Busters   (1975) User Score Overview The Ghost Busters was a live-action children's television series that ran in 1975, about a team of bumbling detectives who would investigate ghostly occurrences. Only 15 episodes were created. This series reunited Forrest Tucker and Larry Storch in roles similar to their characters in F Troop. Tucker played Jake Kong, and Storch played zoot suit-wearing Eddie Spencer. The third member of the trio was Tracy the Gorilla, played by actor Bob Burns. The series was unrelated to the 1984 film Ghostbusters. Featured Crew Marc Richards Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Larry Storch Forrest Tucker Linda Gary Susan Blu Pat Fraley Full Cast & Crew Last Season Season 1 1975 | 15 Episodes Season 1 of The Ghost Busters premiered on September  6, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Ghost Busters. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Family Comedy Keywords detective paranormal phenomena ghost sitcom Content Score 93 Almost there... Top Contributors 9 Banana 3 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}