{"link": "https://www.themoviedb.org/tv/77216?language=en", "title": "Conspiracy of Silence", "resume": "The tragic and troubling true story which made headlines across the nation. Helen Betty Osborne, a young Aboriginal student who was brutally beaten and slain in a The Pas, Manitoba town in 1971. Her murder remained unsolved for nearly 16 years, despite the fact that within days of the tragedy, rumours began circulating of the identity of the men involved.", "rate": 80, "genre": ["Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77216   Expand Conspiracy of Silence   (1991) User Score Overview The tragic and troubling true story which made headlines across the nation. Helen Betty Osborne, a young Aboriginal student who was brutally beaten and slain in a The Pas, Manitoba town in 1971. Her murder remained unsolved for nearly 16 years, despite the fact that within days of the tragedy, rumours began circulating of the identity of the men involved. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Miniseries 1991 | 2 Episodes Season 1 of Conspiracy of Silence premiered on November 30, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Conspiracy of Silence. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Drama Keywords canada based on a true story murder miniseries racism native canadian Content Score 43 There's no 'I' in team... Top Contributors 22 Banana TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}