{"link": "https://www.themoviedb.org/tv/73098?language=en", "title": "Turbofire", "resume": "TurboFire is the intense cardio conditioning program from fitness innovator Chalene Johnson. This 90-day weight loss and body slimming program will help you get that leaner, sexier body you've always wanted by burning up to 9x more fat and calories than regular cardio.", "rate": 0, "genre": [], "cast": ["Chalene Johnson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73098   Expand Turbofire   (2017) User Score Overview TurboFire is the intense cardio conditioning program from fitness innovator Chalene Johnson. This 90-day weight loss and body slimming program will help you get that leaner, sexier body you've always wanted by burning up to 9x more fat and calories than regular cardio. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chalene Johnson Full Cast & Crew Last Season Workout 2017 | 18 Episodes Season 1 of Turbofire premiered on August  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Turbofire. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 36 There's no 'I' in team... Top Contributors d 5 duk81 2 rustymyers  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}