{"link": "https://www.themoviedb.org/tv/9659?language=en", "title": "Maeterlinck's Blue Bird: Tyltyl and Mytyl's Adventurous Journey", "resume": "Maeterlinck's Blue Bird: Tyltyl and Mytyl's Adventurous Journey is a 1980 Japanese animated television series directed by Hiroshi Sasagawa, with character designs from Leiji Matsumoto. It is based on the play by Maurice Maeterlinck. The series was 26-episodes long when aired on Japanese television. An Office Academy production in association with Toei Animation, the series was produced by Yoshinobu Nishizaki and used many of the staff from Nishizaki's earlier Space Battleship Yamato.", "rate": 0, "genre": ["Animation"], "cast": ["Mami Koyama", "Tōru Furuya", "Akihiro Miwa", "Fusako Amachi", "Fuyumi Shiraishi"], "character": ["Mytyl", "Tyltyl", "Queen of the Night", "Berylune", "Chiretto"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9659   Expand Maeterlinck's Blue Bird: Tyltyl and Mytyl's Adventurous Journey   (1980) User Score Overview Maeterlinck's Blue Bird: Tyltyl and Mytyl's Adventurous Journey is a 1980 Japanese animated television series directed by Hiroshi Sasagawa, with character designs from Leiji Matsumoto. It is based on the play by Maurice Maeterlinck. The series was 26-episodes long when aired on Japanese television. An Office Academy production in association with Toei Animation, the series was produced by Yoshinobu Nishizaki and used many of the staff from Nishizaki's earlier Space Battleship Yamato. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mami Koyama Mytyl Tōru Furuya Tyltyl Akihiro Miwa Queen of the Night Fusako Amachi Berylune Fuyumi Shiraishi Chiretto Full Cast & Crew Last Season Maeterlinck's blue bird season 1 1980 | 26 Episodes Season 1 of Maeterlinck's Blue Bird: Tyltyl and Mytyl's Adventurous Journey premiered on January  9, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Maeterlinck's Blue Bird: Tyltyl and Mytyl's Adventurous Journey. You can help by rating TV shows you've seen. Facts Original Name  メーテルリンクの青い鳥 チルチルミチルの冒険旅行 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 4 Banana 1 Forrest73  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}