{"link": "https://www.themoviedb.org/tv/11127?language=en", "title": "George Shrinks", "resume": "George Shrinks is a French-Canadian/American/Chinese animated television series. It is based on the children's book by William Joyce, produced in China by Jade Animation and in Canada by Nelvana, in association with Public Broadcasting Service. It tells the story of a ten-year-old boy named George who, one night dreams that he is three inches tall, only to wake up and discover that it is true. The show details his adventures with his friends and family going all through his adventures on his mini machine's that George and his musical father have created.\nThe series started on September 30, 2000 on PBS Kids as part of PBS Kids Bookworm Bunch. The Bookworm Bunch disbanded in 2004, but George Shrinks was given an individual PBS debut on January 6, 2003, along with The Berenstain Bears and Seven Little Monsters. The first season consisted of forty episodes, targeted at children five years old and under. The final show aired in mid-2004, though it is still in syndication. The original book version had a younger boy who awakes one morning to find himself tiny. He has an encounter with a cat, flies a miniature plane, sails in an ocean-sized tub, eats gigantic food, and rides on top of his giant sized toddler brother before he abruptly grows back to normal size.", "rate": 57, "genre": ["Family", "Animation"], "cast": ["Tracey Moore", "Bryn McAuley", "Kathleen Laskey"], "character": ["George Bernard Shrinks (voice)", "Becky Lopez (voice)", "Perdita Shrinks (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11127   Expand George Shrinks   (2000) User Score Overview George Shrinks is a French-Canadian/American/Chinese animated television series. It is based on the children's book by William Joyce, produced in China by Jade Animation and in Canada by Nelvana, in association with Public Broadcasting Service. It tells the story of a ten-year-old boy named George who, one night dreams that he is three inches tall, only to wake up and discover that it is true. The show details his adventures with his friends and family going all through his adventures on his mini machine's that George and his musical father have created. The series started on September 30, 2000 on PBS Kids as part of PBS Kids Bookworm Bunch. The Bookworm Bunch disbanded in 2004, but George Shrinks was given an individual PBS debut on January 6, 2003, along with The Berenstain Bears and Seven Little Monsters. The first season consisted of forty episodes, targeted at children five years old and under. The final show aired in mid-2004, though it is still in syndication. The original book version had a younger boy who awakes one morning to find himself tiny. He has an encounter with a cat, flies a miniature plane, sails in an ocean-sized tub, eats gigantic food, and rides on top of his giant sized toddler brother before he abruptly grows back to normal size. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tracey Moore George Bernard Shrinks (voice) Bryn McAuley Becky Lopez (voice) Kathleen Laskey Perdita Shrinks (voice) Full Cast & Crew Last Season Season 1 2003 | 40 Episodes Season 1 of George Shrinks premiered on January  6, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   2005-05-30 The Life and Times of Juniper Lee 4.2    2006-10-02 Yin Yang Yo! 4.8    2004-09-18 Super Robot Monkey Team Hyperforce Go! 5.2    2003-08-23 Sonic X 5.5    1997-11-03 Franklin 6.6    2001-06-02 Braceface 6.1    2008-10-25 Kid vs. Kat 4.5    2003-11-01 Xiaolin Showdown 6.9  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Family Animation Keywords kids tiny Content Score 43 There's no 'I' in team... Top Contributors 16 Banana s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}