{"link": "https://www.themoviedb.org/tv/3902?language=en", "title": "Shaun the Sheep", "resume": "Shaun the Sheep is a British stop-motion animated children's television series produced by Aardman Animations, and commissioned by the British Broadcasting Corporation and Westdeutscher Rundfunk, a constituent member of the consortium of German public-broadcasting institutions, ARD. It is a spin-off of the Wallace and Gromit franchise, starring Shaun from A Close Shave as its main protagonist. It first aired in the UK on CBBC in March 2007. The series has also inspired its own spin-off show, Timmy Time, which is aimed at younger viewers. The show has been broadcast in 180 countries around the world.", "rate": 77, "genre": ["Animation", "Comedy", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3902   Expand Shaun the Sheep   (2007) User Score  Play Trailer Overview Shaun the Sheep is a British stop-motion animated children's television series produced by Aardman Animations, and commissioned by the British Broadcasting Corporation and Westdeutscher Rundfunk, a constituent member of the consortium of German public-broadcasting institutions, ARD. It is a spin-off of the Wallace and Gromit franchise, starring Shaun from A Close Shave as its main protagonist. It first aired in the UK on CBBC in March 2007. The series has also inspired its own spin-off show, Timmy Time, which is aimed at younger viewers. The show has been broadcast in 180 countries around the world. Featured Crew Nick Park Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  15 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2016 | 20 Episodes Season 5 of Shaun the Sheep premiered on September  5, 2016. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for Shaun the Sheep. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  15 Posters  14 Recommendations   2005-01-18 My Super Sweet 16 1.0    2010-09-03 Fish Hooks 4.3    1998-08-31 Hercules 5.3    2010-02-15 Funny or Die Presents 5.6    1969-11-10 Sesame Street 7.4    2011-01-13 Human Planet 8.2    1997-03-31 Teletubbies 2.8    1983-09-10 Inspector Gadget 6.6  Facts Status  Returning Series Networks Certification G Meaning For general exhibition; all ages are permitted to watch programming with this rating. Type  Scripted Original Language  English Runtime  7m, 15m, 5m Homepage   http://www.shaunthesheep.com Genres Animation Comedy Kids Keywords farm secret sheep countryside pig stop motion dog animal farmer no dialogue claymation sheep dog sheep farm simplicity Content Score 71 Just a little bit more... Top Contributors 27 BryGur n 12 naka D 12 Decaliax 11 david8s95  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}