{"link": "https://www.themoviedb.org/tv/65491?language=en", "title": "Vikings: Athelstan's Journal", "resume": "Viking culture is seen from a first-hand experience through Athelstan's perspective. Athelstan reflects his inner thoughts on the ways of the Northmen including all their customs, values, and morals. Watch the young priest struggle with an emotional and psychological turmoil as he balances his faith in both God and Odin, revels in bloodshed then is haunted by memories of combat, and then recognizes the personalities of his barbarian family and understands that they, though pagan, are human beings.", "rate": 5, "genre": ["Action", "Adventure", "Drama"], "cast": ["George Blagden"], "character": ["Athelstan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65491   Expand Vikings: Athelstan's Journal   (2015) User Score Overview Viking culture is seen from a first-hand experience through Athelstan's perspective. Athelstan reflects his inner thoughts on the ways of the Northmen including all their customs, values, and morals. Watch the young priest struggle with an emotional and psychological turmoil as he balances his faith in both God and Odin, revels in bloodshed then is haunted by memories of combat, and then recognizes the personalities of his barbarian family and understands that they, though pagan, are human beings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Blagden Athelstan Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of Vikings: Athelstan's Journal premiered on January 30, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Vikings: Athelstan's Journal. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  4m Homepage  - Genres Action & Adventure Drama Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors VA 10 Viktor Andersson 5 theefallen TB 2 TMDb Bot f 2 flyergremlin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}