{"link": "https://www.themoviedb.org/tv/38891?language=en", "title": "Jamie's Dream School", "resume": "Jamie's Dream School is a seven-part British television documentary series made by Fresh One Productions, first aired on Channel 4. In it, Jamie Oliver enrols a group of teenagers with fewer than five GCSEs into his \"Dream School\" - a school in which lessons are taught by celebrities who are specialists in particular subjects. Participants, both pupils and teachers, gave evidence to the Education Select Committee in June 2011.\nThe lessons from Jamie’s Dream School are available on-line a dedicated YouTube channel, including David Starkey's history course and Simon Callow's drama lessons. Many are full-length videos as well as shorter clips and other interactive elements.", "rate": 0, "genre": ["Documentary"], "cast": ["Jamie Oliver"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38891   Expand Jamie's Dream School   (2011) User Score Overview Jamie's Dream School is a seven-part British television documentary series made by Fresh One Productions, first aired on Channel 4. In it, Jamie Oliver enrols a group of teenagers with fewer than five GCSEs into his \"Dream School\" - a school in which lessons are taught by celebrities who are specialists in particular subjects. Participants, both pupils and teachers, gave evidence to the Education Select Committee in June 2011. The lessons from Jamie’s Dream School are available on-line a dedicated YouTube channel, including David Starkey's history course and Simon Callow's drama lessons. Many are full-length videos as well as shorter clips and other interactive elements. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jamie Oliver Full Cast & Crew Last Season Season 1 2011 | 7 Episodes Season 1 of Jamie's Dream School premiered on March  2, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Jamie's Dream School. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/jamies-dream-school Genres Documentary Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors a 3 asusar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}