{"link": "https://www.themoviedb.org/tv/67047?language=en", "title": "Tsubasa: Spring Thunder", "resume": "The group tries to find a way out of a world trying to keep them there. They managed to get away, but not without a few sacrifices. They end up in Kurogane's home world. Sakura-hime is trapped in the dream world. When Real Syaoran goes to save her Clone Syaoran appears.", "rate": 80, "genre": ["Animation"], "cast": ["Miyu Irino", "Yui Makino", "Namikawa Daisuke", "Tetsu Inada", "Mika Kikuchi"], "character": ["Syaoran (voice)", "Sakura (voice)", "Fai D. Flowright (voice)", "Kurogane (voice)", "Mokona (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67047   Expand Tsubasa: Spring Thunder   (2009) User Score Overview The group tries to find a way out of a world trying to keep them there. They managed to get away, but not without a few sacrifices. They end up in Kurogane's home world. Sakura-hime is trapped in the dream world. When Real Syaoran goes to save her Clone Syaoran appears. Featured Crew Nanase Ohkawa Creator Satsuki Igarashi Creator Mokona Apapa Creator Tsubaki Nekoi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyu Irino Syaoran (voice) Yui Makino Sakura (voice) Namikawa Daisuke Fai D. Flowright (voice) Tetsu Inada Kurogane (voice) Mika Kikuchi Mokona (voice) Full Cast & Crew Last Season Tsubasa: Spring Thunder 2009 | 2 Episodes Season 1 of Tsubasa: Spring Thunder premiered on March 15, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Tsubasa: Spring Thunder. You can help by rating TV shows you've seen. Facts Original Name  ツバサ 春雷記 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  29m Homepage  - Genres Animation Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors t 40 tmdb983464  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}