{"link": "https://www.themoviedb.org/tv/66859?language=en", "title": "Better Things", "resume": "Sam Fox is a single, working actor with no filter trying to raise her three daughters – Max, Frankie and Duke – in Los Angeles. She is mom, dad, referee and the cops.", "rate": 67, "genre": ["Comedy"], "cast": ["Pamela Adlon", "Celia Imrie", "Mikey Madison", "Hannah Alligood", "Olivia Edward"], "character": ["Sam Fox", "Phil", "Max", "Frankie", "Duke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66859   Expand Better Things   (2016) User Score Overview Sam Fox is a single, working actor with no filter trying to raise her three daughters – Max, Frankie and Duke – in Los Angeles. She is mom, dad, referee and the cops. Featured Crew Louis C.K. Creator Pamela Adlon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pamela Adlon Sam Fox Celia Imrie Phil Mikey Madison Max Hannah Alligood Frankie Olivia Edward Duke Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of Better Things premiered on September 14, 2017. View All Seasons Social Reviews  2 Discussions  3 Featured Review A review by Reno Written by  Reno  on August 18, 2017 Mother, daughter, granddaughters. The story of women. SEASON 01: Not realistic, but very close to one than any other series I have seen. Most importantly, it was focused on the softer side. That does not mean there's no issues in the story, and with its characters. Well, it's about a single mother with three daughters, who is an actress of small roles. Adding her mother to the list who lives in the next door, it is about four women and their lives. A pure, women oriented tale, focused on the things what every woman, young, old, middle-aged go through in their lives. A short and swe...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   2015-08-05 Difficult People 7.4    2016-01-21 Baskets 7.2    2014-06-04 Jennifer Falls 3.2    2017-11-05 SMILF 6.7    2011-09-29 How to Be a Gentleman 5.3    2011-10-17 Threesome 6.3    2016-03-01 Loosely Exactly Nicole 5.8    2012-02-20 The Bleak Old Shop of Stuff 6.7  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  23m Homepage   http://www.fxnetworks.com/shows/better-things Genres Comedy Keywords single parent parent child relationship single mother Content Score 100 Yes! Looking good! Top Contributors 48 Elizabeth Jennings p 24 plumpro a 6 adambakir92 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}