{"link": "https://www.themoviedb.org/tv/63296?language=en", "title": "D-Day Sacrifice", "resume": "It was the biggest air and naval fleet in history to take off for France to free Europe from Nazi Germany’s clutches. As World War II entered its fifth year of combat, and despite set-backs in Russia, the power of Germany remained so strong that the Anglo American Allies had to recruit 2 million men all ready to sacrifice their lives. From the Battle of Normandy to the Liberation of Paris, tens of thousands of lives were lost; D-Day Sacrifice recounts the story of the D-Day Landings on 6 June 1944 through the testimonies of those who lived it. Comprised entirely of re-mastered and colourised archive footage, much of it never before seen, the remarkable testimonies of famous individuals like Dwight D. Eisenhower and Erwin Rommel are intertwined with those of anonymous soldiers and citizens, such as film director Samuel Fuller and Eisenhower’s chauffeur, Kay Summersby.", "rate": 80, "genre": ["Documentary"], "cast": ["Jay O. Sanders", "Winston Churchill", "Dwight D. Eisenhower", "Bernard Montgomery", "Adolf Hitler"], "character": ["Himself - Host", "Himself (archive footage)", "Himself (archive footage)", "Himslef (archive footage)", "Himself (archive footage)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63296   Expand D-Day Sacrifice   (2014) User Score  Play Trailer Overview It was the biggest air and naval fleet in history to take off for France to free Europe from Nazi Germany’s clutches. As World War II entered its fifth year of combat, and despite set-backs in Russia, the power of Germany remained so strong that the Anglo American Allies had to recruit 2 million men all ready to sacrifice their lives. From the Battle of Normandy to the Liberation of Paris, tens of thousands of lives were lost; D-Day Sacrifice recounts the story of the D-Day Landings on 6 June 1944 through the testimonies of those who lived it. Comprised entirely of re-mastered and colourised archive footage, much of it never before seen, the remarkable testimonies of famous individuals like Dwight D. Eisenhower and Erwin Rommel are intertwined with those of anonymous soldiers and citizens, such as film director Samuel Fuller and Eisenhower’s chauffeur, Kay Summersby. Featured Crew Frederic Lumiere Creator Daniel Costelle Creator Isabelle Clarke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay O. Sanders Himself - Host Winston Churchill Himself (archive footage) Dwight D. Eisenhower Himself (archive footage) Bernard Montgomery Himslef (archive footage) Adolf Hitler Himself (archive footage) Full Cast & Crew Last Season Season 1 2014 | 2 Episodes Season 1 of D-Day Sacrifice premiered on June  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on D-Day Sacrifice. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage  - Genres Documentary Keywords war nazi world war ii history Content Score 100 Yes! Looking good! Top Contributors 56 Claudio 29 Elizabeth Jennings 21 Banana z 10 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}