{"link": "https://www.themoviedb.org/tv/61337?language=en", "title": "Orphen", "resume": "Krylancelo Finrandi once attended the most prestigious school of sorcery on Kiesalhima continent, the Tower of Fang. He was sent there as a young child from an orphanage, along with another orphan girl called Azalie. Throughout the years, the two were very close, with Azalie becoming more and more powerful and Krylancelo looking up to her as a sister/mother figure and a best friend. It isn't until one day, Azalie's thirst for knowledge and extracurricular experimentation backfire, and she is horribly transfigured into a hideous creature, a dragon-like beast that departs the Tower in an animal fury, leaving Krylancelo behind. The Fang Tower, however, is unsympathetic. They promote the belief that Azalie is dead in order to cover the grievous error that resulted in her unimaginable transformation, a terrible scandal that would surely destroy the school's reputation and authority. People whom Krylancelo thought were his friends suddenly seem as though they are strangers, even enemies, going along with the Tower's pretense rather than challenge their authority. Furious that they will do nothing to help her and are instead determined track down the Bloody August and destroy it before the truth can come to light, Krylancelo renounces his former self, declaring Krylancelo to be dead and that he is, instead, Orphen.\nAfter five years, he finds himself living in the quiet town of Totokanta and taking on a student - Majic Lin, his landlord's son. Life is quiet and fairly lazy until the day Cleao Everlasting comes home from boarding school, and stumbles into Orphen's quietly laid plans for the sword that sits on her family's mantle: the Sword Of Baltanders. It turns out that the sword is actually one of three magical artifacts that Orphen will need if he is to save Azalie, and, in fact, was the very sword Azalie used in her experiment that ended with her unfortunate transformation. Before he can obtain it, however, the Bloody August assaults the town looking for the sword, and soon after, Tower's forces show up as well.\nTo find the other Baltander's relics, Orphen sets off with his apprentice, little miss Everlasting and two short-statured misfits, but at all times they need to stay ahead of the Tower of Fang and its sorcerers, who all believe that bringing Azalie back to her former state would reveal their oversight in containing her increasingly dangerous magic, a mistake so great it could bring the Tower down - and, of course, ahead of Azalie herself who, as the dragon is more powerful than both Orphen and the Tower. Orphen is driven solely by the need to transform Azalie back into her human self at even the cost of his life. But restoring Azalie ends up being only the beginning...", "rate": 55, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61337   Expand Orphen   (1998) User Score Overview Krylancelo Finrandi once attended the most prestigious school of sorcery on Kiesalhima continent, the Tower of Fang. He was sent there as a young child from an orphanage, along with another orphan girl called Azalie. Throughout the years, the two were very close, with Azalie becoming more and more powerful and Krylancelo looking up to her as a sister/mother figure and a best friend. It isn't until one day, Azalie's thirst for knowledge and extracurricular experimentation backfire, and she is horribly transfigured into a hideous creature, a dragon-like beast that departs the Tower in an animal fury, leaving Krylancelo behind. The Fang Tower, however, is unsympathetic. They promote the belief that Azalie is dead in order to cover the grievous error that resulted in her unimaginable transformation, a terrible scandal that would surely destroy the school's reputation and authority. People whom Krylancelo thought were his friends suddenly seem as though they are strangers, even enemies, going along with the Tower's pretense rather than challenge their authority. Furious that they will do nothing to help her and are instead determined track down the Bloody August and destroy it before the truth can come to light, Krylancelo renounces his former self, declaring Krylancelo to be dead and that he is, instead, Orphen. After five years, he finds himself living in the quiet town of Totokanta and taking on a student - Majic Lin, his landlord's son. Life is quiet and fairly lazy until the day Cleao Everlasting comes home from boarding school, and stumbles into Orphen's quietly laid plans for the sword that sits on her family's mantle: the Sword Of Baltanders. It turns out that the sword is actually one of three magical artifacts that Orphen will need if he is to save Azalie, and, in fact, was the very sword Azalie used in her experiment that ended with her unfortunate transformation. Before he can obtain it, however, the Bloody August assaults the town looking for the sword, and soon after, Tower's forces show up as well. To find the other Baltander's relics, Orphen sets off with his apprentice, little miss Everlasting and two short-statured misfits, but at all times they need to stay ahead of the Tower of Fang and its sorcerers, who all believe that bringing Azalie back to her former state would reveal their oversight in containing her increasingly dangerous magic, a mistake so great it could bring the Tower down - and, of course, ahead of Azalie herself who, as the dragon is more powerful than both Orphen and the Tower. Orphen is driven solely by the need to transform Azalie back into her human self at even the cost of his life. But restoring Azalie ends up being only the beginning... Featured Crew Hiroshi Watanabe Creator Iku Suzuki Creator Masakazu Amiya Creator Jirô Fujimoto Creator Makoto Sokuza Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1998 | 24 Episodes Season 1 of Orphen premiered on October  3, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Orphen. You can help by rating TV shows you've seen. Facts Original Name  Majutsushi Orphen Mubouhen Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 43 There's no 'I' in team... Top Contributors 13 Sergiojamon b 7 bonjour1992 6 alexboom31 m 3 magoozin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}