{"link": "https://www.themoviedb.org/tv/60712?language=en", "title": "Cálico Electrónico", "resume": "Cálico Electrónico: La Serie Flash was a series of Flash animations created by Nikodemo Animation in 2004.\nSet in 'Electronic City', its protagonist is a superhero far from the 'classic' hero profile: a short, chubby and not-powered Spanish man ('aspañol' as is called in the series). He risks his life time and again to save the city, using gadgets picked up at the Electronicaweb store.\nA chapter usually develops this way: a monster or a criminal attacks the city, Cálico tries to stop it (always unsuccessfully), goes to Electronicaweb, gets a new gadget and saves the day. Some \"bloopers\" are displayed during the credits, at the end of the episode.\nAlthough the series displays many humorous events, the episodes include much Spanish foul language, so viewer discretion is advised.\nEven though Cálico is the main character, many side series have run with it, featuring many characters from the original series.", "rate": 80, "genre": ["Comedy", "Animation"], "cast": ["Nikodemo", "Santiago Riscos", "Khris Cembellin", "Rafael Cano", "Manuel Muzas"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60712   Expand Cálico Electrónico   (2004) User Score Overview Cálico Electrónico: La Serie Flash was a series of Flash animations created by Nikodemo Animation in 2004. Set in 'Electronic City', its protagonist is a superhero far from the 'classic' hero profile: a short, chubby and not-powered Spanish man ('aspañol' as is called in the series). He risks his life time and again to save the city, using gadgets picked up at the Electronicaweb store. A chapter usually develops this way: a monster or a criminal attacks the city, Cálico tries to stop it (always unsuccessfully), goes to Electronicaweb, gets a new gadget and saves the day. Some \"bloopers\" are displayed during the credits, at the end of the episode. Although the series displays many humorous events, the episodes include much Spanish foul language, so viewer discretion is advised. Even though Cálico is the main character, many side series have run with it, featuring many characters from the original series. Featured Crew Nikodemo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nikodemo Santiago Riscos Khris Cembellin Rafael Cano Manuel Muzas Full Cast & Crew Last Season Season 5 2013 | 6 Episodes Season 5 of Cálico Electrónico premiered on August 31, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cálico Electrónico. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.calicoelectronico.com/ Genres Comedy Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 38 ejcortes 5 Fivergalien TB 1 TMDb Bot 1 Ovokx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}