{"link": "https://www.themoviedb.org/tv/45890?language=en", "title": "The Hero Yoshihiko", "resume": "The story is set in an ancient time, when the whole country was covered in thick forests. A mysterious plague breaks out, resulting in countless deaths. A pure young man named Yoshihiko becomes chosen as a hero, and he sets out on a journey in order to save a village. He has two goals – to bring back the legendary plant that can cure the plague, and to rescue his father Teruhiko who left to find the plant but never returned.", "rate": 5, "genre": ["Drama", "Action", "Adventure", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Takayuki Yamada", "Tsuyoshi Muro", "Haruka Kinami", "Shin Takuma", "Ryusei Nakao"], "character": ["Yoshihiko", "Merebu", "Purple", "Danjo", "Gariasu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45890   Expand The Hero Yoshihiko   (2011) User Score  Play Trailer Overview The story is set in an ancient time, when the whole country was covered in thick forests. A mysterious plague breaks out, resulting in countless deaths. A pure young man named Yoshihiko becomes chosen as a hero, and he sets out on a journey in order to save a village. He has two goals – to bring back the legendary plant that can cure the plague, and to rescue his father Teruhiko who left to find the plant but never returned. Featured Crew Yuichi Fukuda Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Takayuki Yamada Yoshihiko Tsuyoshi Muro Merebu Haruka Kinami Purple Shin Takuma Danjo Ryusei Nakao Gariasu Full Cast & Crew Last Season and the Seven Chosen Ones 2016 | 12 Episodes Season 3 of The Hero Yoshihiko premiered on October  7, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on The Hero Yoshihiko. You can help by rating TV shows you've seen. Facts Original Name  勇者ヨシヒコと魔王の城 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  30m, 41m Homepage  - Genres Drama Action & Adventure Comedy Sci-Fi & Fantasy Keywords role playing game Content Score 100 Yes! Looking good! Top Contributors 34 m17 o 32 okaime 12 Elizabeth Jennings a 11 asura766  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}