{"link": "https://www.themoviedb.org/tv/66586?language=en", "title": "Dov'è Mario?", "resume": "Mario Bambea, an italian Intellectual, after a car accident begins to suffer of double personality. In the day, Mario is an intellectual while in the night, becomes a rude comedian.", "rate": 100, "genre": ["War", "Politics", "Comedy"], "cast": ["Lucrezia Guidone", "Corrado Guzzanti", "Rosanna Gentili", "Nicola Rignanese", "Emanuela Fanelli"], "character": ["Silvia", "Mario Bambea", "Camilla Bambea", "Gianfranco Fraglia", "Cinzia"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66586   Expand Dov'è Mario?   (2016) User Score Overview Mario Bambea, an italian Intellectual, after a car accident begins to suffer of double personality. In the day, Mario is an intellectual while in the night, becomes a rude comedian. Featured Crew Mattia Torre Creator Corrado Guzzanti Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lucrezia Guidone Silvia Corrado Guzzanti Mario Bambea Rosanna Gentili Camilla Bambea Nicola Rignanese Gianfranco Fraglia Emanuela Fanelli Cinzia Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Dov'è Mario? premiered on May 25, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Dov'è Mario?. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dov'è Mario?. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  Italian Runtime  40m Homepage   http://tv8.it/programmi/dov_e_mario.html Genres War & Politics Comedy Keywords politician satire social satire political satire Content Score 93 Almost there... Top Contributors C 37 Cataloguer f 14 frankmontana 8 Elizabeth Jennings 4 abcd  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}