{"link": "https://www.themoviedb.org/tv/72165?language=en", "title": "Sirius", "resume": "A drama about an investigation of a drug case by policeman, Do Shin Woo, who bring him meet his twin brother Do Eun Chang. It will tell the story about the tense brain play between two twin brothers whose fates changed in a day and the love and hatred between them which they have kept in their hearts so long.", "rate": 0, "genre": [], "cast": ["Seo Jun-young", "Ryu Seung-su", "Park Hyung-sik", "Uhm Hyun-kyung", "Shin Jung-geun"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72165   Expand Sirius   (2013) User Score Overview A drama about an investigation of a drug case by policeman, Do Shin Woo, who bring him meet his twin brother Do Eun Chang. It will tell the story about the tense brain play between two twin brothers whose fates changed in a day and the love and hatred between them which they have kept in their hearts so long. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Seo Jun-young Ryu Seung-su Park Hyung-sik Uhm Hyun-kyung Shin Jung-geun Full Cast & Crew Last Season Season 1 2013 | 4 Episodes Season 1 of Sirius premiered on January  6, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Sirius. You can help by rating TV shows you've seen. Facts Original Name  시리우스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors R 19 RJ_F13 A 2 Aka75  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}