{"link": "https://www.themoviedb.org/tv/3775?language=en", "title": "Get Some In!", "resume": "Get Some In! is a British comedy series set in the 1950's that focused on the Royal Air Force National Service. The show was broadcast between 1975 and 1978 by Thames Television. Scripts were by John Esmonde and Bob Larbey, the team behind the BBC TV sitcom The Good Life.\nThe programme drew its inspiration from late 1950s/early 1960s National Service situation-comedy The Army Game, and from nostalgic BBC TV sitcom Dad's Army, but the RAF setting gave it enough originality not to seem formulaic. Thirty-four half-hour episodes were made.\nThe series has never been repeated in full on terrestrial TV, although the UKTV Gold cable channel has aired the episodes uncut.", "rate": 75, "genre": ["Comedy"], "cast": ["Tony Selby", "David Janson", "Robert Lindsay", "Brian Pettifer", "Karl Howman"], "character": ["Jakey Smith"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3775   Expand Get Some In!   (1975) User Score Overview Get Some In! is a British comedy series set in the 1950's that focused on the Royal Air Force National Service. The show was broadcast between 1975 and 1978 by Thames Television. Scripts were by John Esmonde and Bob Larbey, the team behind the BBC TV sitcom The Good Life. The programme drew its inspiration from late 1950s/early 1960s National Service situation-comedy The Army Game, and from nostalgic BBC TV sitcom Dad's Army, but the RAF setting gave it enough originality not to seem formulaic. Thirty-four half-hour episodes were made. The series has never been repeated in full on terrestrial TV, although the UKTV Gold cable channel has aired the episodes uncut. Featured Crew Esmonde and Larbey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tony Selby David Janson Robert Lindsay Jakey Smith Brian Pettifer Karl Howman Full Cast & Crew Last Season Season 5 1978 | 7 Episodes Season 5 of Get Some In! premiered on April  6, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Get Some In!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords royal air force sitcom 1950s british humour period sitcom Content Score 79 Pump it up! We're close now. Top Contributors O 13 Ozbourne 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}