{"link": "https://www.themoviedb.org/tv/4571?language=en", "title": "Hunter", "resume": "Hunter is an American police drama television series created by Frank Lupo, and starring Fred Dryer as Sgt. Rick Hunter and Stepfanie Kramer as Sgt. Dee Dee McCall, which ran on NBC from 1984 to 1991. However, Kramer left after the sixth season to pursue other acting and musical opportunities. In the seventh season, Hunter partnered with two different women officers. The titular character, Sgt. Rick Hunter, was a wily, physically imposing, and often rule-breaking homicide detective with the Los Angeles Police Department. The show's main characters, Hunter and McCall, resolve many of their cases by shooting dead the perpetrators.\nThe show's executive producer during the first season was Stephen J. Cannell, whose company produced the series.", "rate": 71, "genre": ["Action", "Adventure", "Drama"], "cast": ["Fred Dryer", "Stepfanie Kramer", "Charles Hallahan", "Robert Newman", "Darlanne Fluegel"], "character": ["Det. Sgt. Rick Hunter", "Det. Sgt. Dee Dee McCall", "Capt. Charles \"Charile\" Devane", "Dr. Alex Turner", "Officer \"Joanne Molenski\""], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4571   Expand Hunter   (1984) User Score Overview Hunter is an American police drama television series created by Frank Lupo, and starring Fred Dryer as Sgt. Rick Hunter and Stepfanie Kramer as Sgt. Dee Dee McCall, which ran on NBC from 1984 to 1991. However, Kramer left after the sixth season to pursue other acting and musical opportunities. In the seventh season, Hunter partnered with two different women officers. The titular character, Sgt. Rick Hunter, was a wily, physically imposing, and often rule-breaking homicide detective with the Los Angeles Police Department. The show's main characters, Hunter and McCall, resolve many of their cases by shooting dead the perpetrators. The show's executive producer during the first season was Stephen J. Cannell, whose company produced the series. Featured Crew Frank Lupo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  44 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Dryer Det. Sgt. Rick Hunter Stepfanie Kramer Det. Sgt. Dee Dee McCall Charles Hallahan Capt. Charles \"Charile\" Devane Robert Newman Dr. Alex Turner Darlanne Fluegel Officer \"Joanne Molenski\" Full Cast & Crew Last Season Season 7 1990 | 22 Episodes Season 7 of Hunter premiered on September 19, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   1982-09-26 Matt Houston 6.6    1978-11-10 Butterflies 6.9    1973-09-25 Police Story 6.4    1983-09-18 Hardcastle and McCormick 6.1    1987-09-26 Jake and the Fatman 4.9    1982-03-13 T. J. Hooker 6.1    1968-09-22 Land of the Giants 6.3    1976-10-22 The New Avengers 7.6  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords police detective lapd homicide detective Content Score 93 Almost there... Top Contributors d 15 denis 13 Banana 6 TheOneManBoxOffice D 4 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}