{"link": "https://www.themoviedb.org/tv/66824?language=en", "title": "INXS : Never Tear Us Apart", "resume": "The uncensored story of one of Australia's most successful bands, INXS. A story of mateship, a story of success and excess, talent and sheer bloody will, set to a pulsating soundtrack including all of INXSs greatest hits.", "rate": 58, "genre": ["Documentary", "Drama"], "cast": ["Luke Arnold", "Damon Herriman", "Hugh Sheridan", "Andrew Ryan", "Alex Williams"], "character": ["Michael Hutchence", "Chris Murphy", "Garry Gary Beers", "Andrew Farris", "Kirk Pengilly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66824   Expand INXS : Never Tear Us Apart   (2014) User Score  Play Trailer Overview The uncensored story of one of Australia's most successful bands, INXS. A story of mateship, a story of success and excess, talent and sheer bloody will, set to a pulsating soundtrack including all of INXSs greatest hits. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Arnold Michael Hutchence Damon Herriman Chris Murphy Hugh Sheridan Garry Gary Beers Andrew Ryan Andrew Farris Alex Williams Kirk Pengilly Full Cast & Crew Last Season Season 1 2014 | 2 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  15 Posters  4 Recommendations   1988-02-15 Red Dwarf 8.0  Facts Status  Ended Network Certification M Meaning Recommended for mature audiences; M-rated content may only be broadcast between 8:30 p.m. and 5:00 a.m. on any day, and additionally between 12:00 p.m. and 3:00 p.m. on schooldays. Type  Miniseries Original Language  English Runtime  86m Homepage   https://au.tv.yahoo.com/plus7/inxs/ Genres Documentary Drama Keywords australia music biography based on a true story woman director Content Score 93 Almost there... Top Contributors 28 OzDrDj 26 Elizabeth Jennings TB 24 TMDb Bot 9 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}