{"link": "https://www.themoviedb.org/tv/46578?language=en", "title": "New Tales of Gisaeng", "resume": "New Tales of Gisaeng is a 2011 South Korean television series starring Im Soo-hyang, Sung Hoon and Han Hye-rin. Written by Im Sung-han and directed by Son Moon-kwon, it aired on SBS from January 23 to July 17, 2011 on Saturdays and Sundays at 21:45 for 52 episodes.", "rate": 0, "genre": ["Drama", "Romance"], "cast": ["Im Soo-hyang", "Sung Hoon", "Han Hye-rin", "Han Jin-hee", "Seo Woo-rim"], "character": ["Dan Sa-ran", "Ah Da-mo", "Geum Ra-ra", "Geum Eo-san", "Lee Hong-ah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46578   Expand New Tales of Gisaeng   (2011) User Score Overview New Tales of Gisaeng is a 2011 South Korean television series starring Im Soo-hyang, Sung Hoon and Han Hye-rin. Written by Im Sung-han and directed by Son Moon-kwon, it aired on SBS from January 23 to July 17, 2011 on Saturdays and Sundays at 21:45 for 52 episodes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Im Soo-hyang Dan Sa-ran Sung Hoon Ah Da-mo Han Hye-rin Geum Ra-ra Han Jin-hee Geum Eo-san Seo Woo-rim Lee Hong-ah Full Cast & Crew Last Season Season 1 2011 | 52 Episodes Season 1 of New Tales of Gisaeng premiered on January 23, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on New Tales of Gisaeng. You can help by rating TV shows you've seen. Facts Original Name  신기생뎐 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://tv.sbs.co.kr/gisaeng/ Genres Drama Romance Keywords korea Content Score 86 Almost there... Top Contributors M 26 Maria180493 s 5 sheva_vitali 1 Vali82 t 1 tmdb38202327  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}