{"link": "https://www.themoviedb.org/tv/47321?language=en", "title": "All About My Romance", "resume": "All About My Romance is a 2013 South Korean television series starring Shin Ha-kyun, Lee Min-jung, Park Hee-soon and Han Chae-ah. It aired on SBS from April 4 to May 29, 2013, on Wednesdays and Thursdays at 21:55 for 16 episodes.\nThe political-romantic comedy series was written by Kwon Ki-young and directed by Son Jung-hyun, who previously worked together on 2011's Protect the Boss.", "rate": 70, "genre": ["Comedy"], "cast": ["Shin Ha-kyun", "Lee Min-jung", "Park Hee-soon", "Han Chae-ah", "Kim Jeong-Nan"], "character": ["Kim Soo-young", "Noh Min-young", "Song Joon-ha", "Ahn Hee-sun", "Go Dong-sook"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47321   Expand All About My Romance   (2013) User Score Overview All About My Romance is a 2013 South Korean television series starring Shin Ha-kyun, Lee Min-jung, Park Hee-soon and Han Chae-ah. It aired on SBS from April 4 to May 29, 2013, on Wednesdays and Thursdays at 21:55 for 16 episodes. The political-romantic comedy series was written by Kwon Ki-young and directed by Son Jung-hyun, who previously worked together on 2011's Protect the Boss. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shin Ha-kyun Kim Soo-young Lee Min-jung Noh Min-young Park Hee-soon Song Joon-ha Han Chae-ah Ahn Hee-sun Kim Jeong-Nan Go Dong-sook Full Cast & Crew Last Season Season 1 2013 | 16 Episodes Season 1 of All About My Romance premiered on April  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on All About My Romance. You can help by rating TV shows you've seen. Facts Original Name  내 연애의 모든 것 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://myromance.sbs.co.kr/ Genres Comedy Keywords korea Content Score 93 Almost there... Top Contributors M 22 Maria180493 N 18 Nightowl.Kr 5 lareina123 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}