{"link": "https://www.themoviedb.org/tv/44082?language=en", "title": "First Life", "resume": "First Life is a 2010 British nature documentary series written and presented by David Attenborough, also known by the expanded titles David Attenborough's First Life and First Life with David Attenborough. It was first broadcast in the USA as a two-hour special on the Discovery Channel on 24 October 2010. In the United Kingdom it was broadcast as a two-part series on BBC Two on 5 November 2010.First Life sees Attenborough tackle the subject of the origin of life on Earth. He investigates the evidence from the earliest fossils, which suggest that complex animals first appeared in the oceans around 500 million years ago, an event known as the Cambrian Explosion. Trace fossils of multicellular organisms from an even earlier period, the Ediacaran biota, are also examined. The naturalist travels to Canada, Morocco and Australia, using some of the latest fossil discoveries and their nearest equivalents amongst living species to reveal what life may have been like at that time. Visual effects and computer animation are used to reconstruct and animate the extinct life forms. Attenborough's Journey, a documentary film profiling the presenter as he journeyed around the globe filming First Life, was shown on BBC Two on 24 October 2010. A hardback book to accompany the series, authored by Matt Kaplan with a foreword by Attenborough, was published in September 2010.", "rate": 72, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44082   Expand First Life   (2010) User Score Overview First Life is a 2010 British nature documentary series written and presented by David Attenborough, also known by the expanded titles David Attenborough's First Life and First Life with David Attenborough. It was first broadcast in the USA as a two-hour special on the Discovery Channel on 24 October 2010. In the United Kingdom it was broadcast as a two-part series on BBC Two on 5 November 2010.First Life sees Attenborough tackle the subject of the origin of life on Earth. He investigates the evidence from the earliest fossils, which suggest that complex animals first appeared in the oceans around 500 million years ago, an event known as the Cambrian Explosion. Trace fossils of multicellular organisms from an even earlier period, the Ediacaran biota, are also examined. The naturalist travels to Canada, Morocco and Australia, using some of the latest fossil discoveries and their nearest equivalents amongst living species to reveal what life may have been like at that time. Visual effects and computer animation are used to reconstruct and animate the extinct life forms. Attenborough's Journey, a documentary film profiling the presenter as he journeyed around the globe filming First Life, was shown on BBC Two on 24 October 2010. A hardback book to accompany the series, authored by Matt Kaplan with a foreword by Attenborough, was published in September 2010. Featured Crew David Attenborough Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Miniseries 2010 | 2 Episodes Season 1 of First Life premiered on November  5, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations   2001-09-12 The Blue Planet 8.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  173m, 60m Homepage  - Genres Documentary Keywords biology animal species natural history miniseries animal evolution science natural selection fossil life prehistoric animal nature documentary Content Score 64 We're so close, yet so far. Top Contributors TB 26 TMDb Bot R 13 Rebecca 5 buby SC 2 Stephen Cotton  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}