{"link": "https://www.themoviedb.org/tv/46252?language=en", "title": "UFO Robo Grendizer", "resume": "UFO Robot Grendizer is a Super Robot TV anime and manga created by manga artist Go Nagai. It is the third entry in the Mazinger trilogy. It was broadcast on Japanese television from October 5, 1975, to February 27, 1977, and lasted 74 episodes. The robot's first appearance in the United States was as a part of the Shogun Warriors line of super robot toys imported in the late 1970s by Mattel, then in Jim Terry's Force Five series, both under the title Grandizer. It is still widely popular in the Middle East, and it was especially popular in France and Quebec, as well as among French speaking Canadians in the province of New Brunswick, where it was aired under the title Goldorak. In Italy, the series was as popular and known as Goldrake.", "rate": 66, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Banjou Ginga", "Hiroya Ishimaru", "Chiyoko Kawashima", "Kenichi Ogata", "Kei Tomiyama"], "character": ["Zuril", "Kouji Kabuto", "Makiba Hikaru", "Banta", "Daisuke Umon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46252   Expand UFO Robo Grendizer   (1975) User Score Overview UFO Robot Grendizer is a Super Robot TV anime and manga created by manga artist Go Nagai. It is the third entry in the Mazinger trilogy. It was broadcast on Japanese television from October 5, 1975, to February 27, 1977, and lasted 74 episodes. The robot's first appearance in the United States was as a part of the Shogun Warriors line of super robot toys imported in the late 1970s by Mattel, then in Jim Terry's Force Five series, both under the title Grandizer. It is still widely popular in the Middle East, and it was especially popular in France and Quebec, as well as among French speaking Canadians in the province of New Brunswick, where it was aired under the title Goldorak. In Italy, the series was as popular and known as Goldrake. Featured Crew Gou Nagai Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Banjou Ginga Zuril Hiroya Ishimaru Kouji Kabuto Chiyoko Kawashima Makiba Hikaru Kenichi Ogata Banta Kei Tomiyama Daisuke Umon Full Cast & Crew Last Season Ufo robot  season 1 1975 | 74 Episodes Season 1 of UFO Robo Grendizer premiered on October  5, 1975. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  8 Recommendations   1981-04-07 Meiken Jolie 7.3    1983-10-13 Captain Tsubasa 7.0    1997-11-03 I'm Alan Partridge 6.9    1995-06-18 Life with Louie 5.9    2015-02-24 The Ministry of Time 6.8    1974-03-03 NOVA 6.8    2013-06-16 The White Queen 6.5    2015-01-13 Schitt's Creek 6.8  Facts Original Name  ＵＦＯロボグレンダイザー Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords mecha Content Score 93 Almost there... Top Contributors a 73 arceri J 24 JamesTexWestern t 17 tmdb983464 CM 10 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}