{"link": "https://www.themoviedb.org/tv/6223?language=en", "title": "Flipper", "resume": "Flipper, is an American revival television series of the original 1964 Flipper television series. The first two seasons aired in first-run syndication; seasons 3 and 4 aired on the PAX network.\nThe 1995 version brought back Bud Ricks as a scientist doing marine research in Florida. The dolphin Flipper was one with whom Dr. Ricks was working. This TV show is available for online viewing on hulu in the United States and at Rogers On Demand in Canada.\nAlthough the show was set in Bal Harbour, Florida, it was largely filmed in Gold Coast, Queensland, Australia. However three episodes during the first season, including the pilot, were filmed in Pigeon Key, Florida and at the Dolphin Research Center in Grassy Key, Florida.", "rate": 61, "genre": ["Action", "Adventure", "Drama"], "cast": ["Whip Hubley", "Gus Mercurio", "Elizabeth Morehead", "Jessica Alba", "Anja Coleby"], "character": ["Maya Graham"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6223   Expand Flipper   (1995) User Score Overview Flipper, is an American revival television series of the original 1964 Flipper television series. The first two seasons aired in first-run syndication; seasons 3 and 4 aired on the PAX network. The 1995 version brought back Bud Ricks as a scientist doing marine research in Florida. The dolphin Flipper was one with whom Dr. Ricks was working. This TV show is available for online viewing on hulu in the United States and at Rogers On Demand in Canada. Although the show was set in Bal Harbour, Florida, it was largely filmed in Gold Coast, Queensland, Australia. However three episodes during the first season, including the pilot, were filmed in Pigeon Key, Florida and at the Dolphin Research Center in Grassy Key, Florida. Featured Crew Jack Cowden Creator Ricou Browdning Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Whip Hubley Gus Mercurio Elizabeth Morehead Jessica Alba Maya Graham Anja Coleby Full Cast & Crew Last Season Season 4 1999 | 26 Episodes Season 4 of Flipper premiered on August 28, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Flipper. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords dolphin animal actor Content Score 93 Almost there... Top Contributors 7 AxeL Wave BA 5 Barbara Ann O'Leary 5 Elizabeth Jennings s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}