{"link": "https://www.themoviedb.org/tv/27467?language=en", "title": "How Art Made The World", "resume": "Why does our world look like it does? That great modern mystery is spectacularly unraveled in this international landmark series and epic quest across five continents and 100,000 years, via some of the greatest treasures of the ancient world -- to the heart of human creativity. Encompassing everything from cave paintings to ceramics and pyramids to palaces, How Art Made the World probes the global trend for unrealistic depictions of the human body; the secret powers of the feature film; how politicians manage to manipulate people so easily; visions of death and the afterlife; and, crucially, why we use imagery at all.", "rate": 83, "genre": ["Documentary"], "cast": ["Nigel Spivey"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 27467   Expand How Art Made The World   (2006) User Score Overview Why does our world look like it does? That great modern mystery is spectacularly unraveled in this international landmark series and epic quest across five continents and 100,000 years, via some of the greatest treasures of the ancient world -- to the heart of human creativity. Encompassing everything from cave paintings to ceramics and pyramids to palaces, How Art Made the World probes the global trend for unrealistic depictions of the human body; the secret powers of the feature film; how politicians manage to manipulate people so easily; visions of death and the afterlife; and, crucially, why we use imagery at all. Featured Crew Nigel Spivey Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nigel Spivey Himself Full Cast & Crew Last Season Season 1 2005 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on How Art Made The World. You can help by rating TV shows you've seen. Facts Status  Ended Networks BBC Certification  - Type  Documentary Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/sn/tvradio/programmes/howart/ Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors b 20 b4s1c m 4 morrison 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}