{"link": "https://www.themoviedb.org/tv/57616?language=en", "title": "Dad! Where Are We Going?", "resume": "Dad! Where Are We Going? is a South Korean reality show featuring celebrity fathers and their small children as they travel to rural places and undertake camping \"missions\". \nOther versions of the show have since been made in China, Vietnam, Russia, and Japan.", "rate": 0, "genre": ["Reality"], "cast": ["Kim Sung-joo", "Ahn Jung-hwan", "Sung Dong-il", "Yoon Min-soo", "Ryu Jin"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57616   Expand Dad! Where Are We Going?   (2013) User Score Overview Dad! Where Are We Going? is a South Korean reality show featuring celebrity fathers and their small children as they travel to rural places and undertake camping \"missions\".  Other versions of the show have since been made in China, Vietnam, Russia, and Japan. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Sung-joo Himself Ahn Jung-hwan Himself Sung Dong-il Himself Yoon Min-soo Himself Ryu Jin Himself Full Cast & Crew Last Season Season 2 2014 | 1 Episode Season 2 of Dad! Where Are We Going? premiered on January 26, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dad! Where Are We Going?. You can help by rating TV shows you've seen. Facts Original Name  아빠 어디가? Status  Ended Network Certification 12 Meaning This rating is for programs that may deemed inappropriate for those younger than 12, and parental discretion should be used. Usually used for animations that have stronger themes or violence then those designed for children, or for reality shows that have mild violence, themes, or language. Type  Scripted Original Language  Korean Runtime  - Homepage  - Genres Reality Keywords children family Content Score 86 Almost there... Top Contributors t 25 tmdb983464 t 5 tmdb38202327 N 4 Nightowl.Kr e 2 eMo318  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}