{"link": "https://www.themoviedb.org/tv/42280?language=en", "title": "Abyss of Passion", "resume": "Abismo de pasión is a Mexican telenovela produced by Angelli Nesma Medina and written by Caridad Bravo Adams for Televisa. It is a remake of Cañaveral de Pasiones, produced by Humberto Zurita and Christian Bach in 1996. Both telenovelas are based on Caridad Bravo Adams's original story, divided into two novels, and published in 1959: Una sombra entre los dos and Al pie del altar.\nAngelique Boyer, David Zepeda, Livia Brito and Mark Tacher star as the protagonists, while Sabine Moussier, Salvador Zerboni and Altair Jarabo star as the antagonists.", "rate": 0, "genre": ["Drama"], "cast": ["Angelique Boyer", "David Zepeda", "Sabine Moussier", "Blanca Guerra", "Alejandro Camacho"], "character": ["Elisa Castañón Bouvier", "Damian Arango Mondragón", "Carmina Bouvier de Castañón", "Alfonsina Mondragón de Arango", "Augusto Castañón"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42280   Expand Abyss of Passion   (2012) User Score Overview Abismo de pasión is a Mexican telenovela produced by Angelli Nesma Medina and written by Caridad Bravo Adams for Televisa. It is a remake of Cañaveral de Pasiones, produced by Humberto Zurita and Christian Bach in 1996. Both telenovelas are based on Caridad Bravo Adams's original story, divided into two novels, and published in 1959: Una sombra entre los dos and Al pie del altar. Angelique Boyer, David Zepeda, Livia Brito and Mark Tacher star as the protagonists, while Sabine Moussier, Salvador Zerboni and Altair Jarabo star as the antagonists. Featured Crew Caridad Bravo Adams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angelique Boyer Elisa Castañón Bouvier David Zepeda Damian Arango Mondragón Sabine Moussier Carmina Bouvier de Castañón Blanca Guerra Alfonsina Mondragón de Arango Alejandro Camacho Augusto Castañón Full Cast & Crew Last Season Season 1 2012 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Abyss of Passion. You can help by rating TV shows you've seen. Facts Original Name  Abismo de pasión Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  41m Homepage   http://televisa.esmas.com/entretenimiento/telenovelas/abismo-de-pasion/ Genres Drama Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors s 20 shiff7 2 Amanda  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}