{"link": "https://www.themoviedb.org/tv/9105?language=en", "title": "The Keith Barret Show", "resume": "The Keith Barret Show is a spoof BBC chat show hosted by Keith Barret who interviews celebrity couples in the hope of finding the secret to a successful marriage. It was devised by Paul Duddridge and co written with Rob Brydon. In each programme, there are a selection of clips from venues such as speed dating or interviews with relationship experts.\nRob Brydon's character Keith first appeared on TV in the cult comedy series Marion and Geoff where, for most of the first series, he was oblivious to the affair between the title characters.\nThis was not the first BBC interview programme to be hosted by a fictional character - Brydon's close collaborator, Steve Coogan used the character of Alan Partridge with much more disastrous on-screen effects several years earlier.", "rate": 80, "genre": ["Comedy"], "cast": ["Rob Brydon"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9105   Expand The Keith Barret Show   (2004) User Score Overview The Keith Barret Show is a spoof BBC chat show hosted by Keith Barret who interviews celebrity couples in the hope of finding the secret to a successful marriage. It was devised by Paul Duddridge and co written with Rob Brydon. In each programme, there are a selection of clips from venues such as speed dating or interviews with relationship experts. Rob Brydon's character Keith first appeared on TV in the cult comedy series Marion and Geoff where, for most of the first series, he was oblivious to the affair between the title characters. This was not the first BBC interview programme to be hosted by a fictional character - Brydon's close collaborator, Steve Coogan used the character of Alan Partridge with much more disastrous on-screen effects several years earlier. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rob Brydon Full Cast & Crew Last Season Season 2 2005 | 6 Episodes Season 2 of The Keith Barret Show premiered on January  7, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Keith Barret Show. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00pgvph Genres Comedy Keywords talk show guest celebrity british humour Content Score 43 There's no 'I' in team... Top Contributors O 6 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}