{"link": "https://www.themoviedb.org/tv/2261?language=en", "title": "The Tonight Show Starring Johnny Carson", "resume": "The Tonight Show Starring Johnny Carson is a talk show hosted by Johnny Carson under The Tonight Show franchise from 1962 to 1992. It originally aired during late-night.\nFor its first ten years, Carson's Tonight Show was based in New York City with occasional trips to Burbank, California; in May 1972, the show moved permanently to Burbank, California.\nIn 2002, The Tonight Show Starring Johnny Carson was ranked #12 on TV Guide's 50 Greatest TV Shows of All Time.", "rate": 85, "genre": ["Talk"], "cast": ["Johnny Carson"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2261   Expand The Tonight Show Starring Johnny Carson   (1962) User Score  Play Trailer Overview The Tonight Show Starring Johnny Carson is a talk show hosted by Johnny Carson under The Tonight Show franchise from 1962 to 1992. It originally aired during late-night. For its first ten years, Carson's Tonight Show was based in New York City with occasional trips to Burbank, California; in May 1972, the show moved permanently to Burbank, California. In 2002, The Tonight Show Starring Johnny Carson was ranked #12 on TV Guide's 50 Greatest TV Shows of All Time. Featured Crew Steve Allen Creator Sylvester Weaver Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Johnny Carson Host Full Cast & Crew Last Season Season 30 1991 | 120 Episodes Season 30 of The Tonight Show Starring Johnny Carson premiered on October  1, 1991. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply The best late night talk show Open 0 by write2topcat\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1982-02-01 Late Night with David Letterman 7.2    2015-01-19 The Nightly Show with Larry Wilmore 6.4    1999-04-07 Strangers with Candy 7.0    1986-09-13 At the Movies 5.9    1992-05-25 The Tonight Show with Jay Leno 5.0    2005-01-03 The Late Late Show with Craig Ferguson 7.5    1999-08-16 Who Wants to Be a Millionaire? (US) 7.0    1995-09-09 Earthworm Jim 6.6  Facts Status  Ended Network Certification  - Type  Talk Show Original Language  English Runtime  60m Homepage  - Genres Talk Keywords talk show Content Score 71 Just a little bit more... Top Contributors 8 Banana P 3 Provencal 2 Drek D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}