{"link": "https://www.themoviedb.org/tv/2239?language=en", "title": "Dead Head", "resume": "London based petty crook, Eddie Cass agrees to pick up a package and courier it across the capital. When nobody answers the door at the drop off address Eddie opens the package and finds a woman’s severed head in a hatbox. He panics and dumps it in the River Thames. Returning home Cass is kidnapped by the mysterious Eldridge and his heavies who inform Eddie that he has been framed for the murder.", "rate": 90, "genre": ["Drama"], "cast": ["Denis Lawson", "George Baker", "Simon Callow", "Lindsay Duncan"], "character": ["Eddie Cass", "Eldridge", "Hugo Silver", "Dana Cass"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2239   Expand Dead Head   (1986) User Score Overview London based petty crook, Eddie Cass agrees to pick up a package and courier it across the capital. When nobody answers the door at the drop off address Eddie opens the package and finds a woman’s severed head in a hatbox. He panics and dumps it in the River Thames. Returning home Cass is kidnapped by the mysterious Eldridge and his heavies who inform Eddie that he has been framed for the murder. Featured Crew Howard Brenton Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Denis Lawson Eddie Cass George Baker Eldridge Simon Callow Hugo Silver Lindsay Duncan Dana Cass Full Cast & Crew Last Season Miniseries 1986 | 4 Episodes Season 1 of Dead Head premiered on January 15, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Dead Head. You can help by rating TV shows you've seen. Facts Status  Ended Network BBC Certification  - Type  Miniseries Original Language  English Runtime  50m Homepage  - Genres Drama Keywords miniseries Content Score 79 Pump it up! We're close now. Top Contributors TB 10 TMDb Bot R 8 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}