{"link": "https://www.themoviedb.org/tv/73051?language=en", "title": "Frozen Sky", "resume": "Fighting against the prejudices of late 1960s Germany, a mother will stop at nothing to find her son a proper psychiatric diagnosis. To society, he is a problem child; to his mother, he is gifted. Doctor Zhivago meets The A Word... an exquisite, arresting tale of love and hope.", "rate": 0, "genre": [], "cast": ["Christine Neubauer", "Eric Hermann", "Marc Hermann", "Marcus Mittermeier"], "character": ["Marie Moosbacher", "Felix Moosbacher", "Felix Moosbacher", "Paul Moosbacher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73051   Expand Frozen Sky   (2011) User Score Overview Fighting against the prejudices of late 1960s Germany, a mother will stop at nothing to find her son a proper psychiatric diagnosis. To society, he is a problem child; to his mother, he is gifted. Doctor Zhivago meets The A Word... an exquisite, arresting tale of love and hope. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christine Neubauer Marie Moosbacher Eric Hermann Felix Moosbacher Marc Hermann Felix Moosbacher Marcus Mittermeier Paul Moosbacher Full Cast & Crew Last Season Season 1 2011 | 2 Episodes Season 1 of Frozen Sky premiered on January  1, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Frozen Sky. You can help by rating TV shows you've seen. Facts Original Name  Der kalte Himmel Status  Returning Series Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 79 Pump it up! We're close now. Top Contributors 13 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}