{"link": "https://www.themoviedb.org/tv/77658?language=en", "title": "Fringe Man", "resume": "Tasai, Mitsushima and Ango are all married, but they want to have a girlfriend. They know that is not right, but they still want a girlfriend because they are not happy with their marriage life. Their problem is that they don't know how to find a girlfriend. Mitsushima then brings Ibuse Masumi who teaches men how to make girlfriends. Ibuse Masumi first had a girlfriend at the age of 22 and healso has experience having 11 girlfriends at the same time. ~~ Based on the manga series \"Furinji Man\" by Aoki Uhei.", "rate": 0, "genre": ["Drama"], "cast": ["Itsuji Itao", "Shunsuke Daitô", "Yasushi Fuchikami", "Tomomi Itano", "Mitsu Dan"], "character": ["Ibuse Masumi", "Tasai", "Mitsushima Yukio", "Agawa", "Miyabe Yuki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77658   Expand Fringe Man   (2017) User Score Overview Tasai, Mitsushima and Ango are all married, but they want to have a girlfriend. They know that is not right, but they still want a girlfriend because they are not happy with their marriage life. Their problem is that they don't know how to find a girlfriend. Mitsushima then brings Ibuse Masumi who teaches men how to make girlfriends. Ibuse Masumi first had a girlfriend at the age of 22 and healso has experience having 11 girlfriends at the same time. ~~ Based on the manga series \"Furinji Man\" by Aoki Uhei. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Itsuji Itao Ibuse Masumi Shunsuke Daitô Tasai Yasushi Fuchikami Mitsushima Yukio Tomomi Itano Agawa Mitsu Dan Miyabe Yuki Full Cast & Crew Current Season Season 1 2017 | 12 Episodes Season 1 of Fringe Man premiered on October  8, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Fringe Man. You can help by rating TV shows you've seen. Facts Original Name  フリンジマン～愛人の作り方教えます～ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors c 30 ctchim 2 rchrdyan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}