{"link": "https://www.themoviedb.org/tv/2407?language=en", "title": "Dark Angel", "resume": "Super soldier Max Guevera tries to live a normal life in post-apocalyptic Seattle while eluding capture by government agents from the covert biotech facility she escaped from as a child and searching for her genetically-enhanced brothers and sisters who have dispersed after escape.", "rate": 72, "genre": ["Action", "Adventure", "Drama"], "cast": ["Jessica Alba", "Michael Weatherly", "Valarie Rae Miller", "J.C. MacKenzie", "Jensen Ackles"], "character": ["Max Guevara", "Logan Cale", "Cynthia 'Original Cindy' McEachin", "Reagan 'Normal' Ronald", "Alec McDowell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2407   Expand Dark Angel   (2000) User Score  Play Trailer Overview Super soldier Max Guevera tries to live a normal life in post-apocalyptic Seattle while eluding capture by government agents from the covert biotech facility she escaped from as a child and searching for her genetically-enhanced brothers and sisters who have dispersed after escape. Featured Crew James Cameron Creator Charles H. Eglee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  19 Posters  9 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessica Alba Max Guevara Michael Weatherly Logan Cale Valarie Rae Miller Cynthia 'Original Cindy' McEachin J.C. MacKenzie Reagan 'Normal' Ronald Jensen Ackles Alec McDowell Full Cast & Crew Last Season Original Air Date Original Air Date Production Order (Production) Season 2 2001 | 21 Episodes Season 2 of Dark Angel premiered on September 27, 2001. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Season 1 vs Season 2 Open 0 by Parallaxe\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  19 Posters  9 Recommendations   2011-07-11 Alphas 6.5    2003-10-30 Tru Calling 6.9    2009-02-13 Dollhouse 7.2    1999-10-05 Angel 7.6    2002-06-16 The Dead Zone 6.5    1996-09-19 The Pretender 7.3    1999-10-06 Roswell 7.0    1997-03-10 Buffy the Vampire Slayer 8.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords strong woman post-apocalyptic secret government organization superhuman super soldier female protagonist dystopian future genetic engineering hunted child soldier action heroine bike messenger Content Score 100 Yes! Looking good! Top Contributors J 120 Jenn 51 Banana AK 7 Avshalom Kor NN 7 Nomo Naut  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}