{"link": "https://www.themoviedb.org/tv/65249?language=en", "title": "ERASED", "resume": "Satoru Fujinuma is a struggling manga artist who has the ability to turn back time and prevent deaths. When his mother is killed he turns back time to solve the mystery, but ends up back in elementary school, just before the disappearance of his classmate Kayo.", "rate": 79, "genre": ["Animation", "Drama", "Mystery"], "cast": ["Shinnosuke Mitsushima", "Tao Tsuchiya", "Minami Takayama", "Chinatsu Akasaki", "Aoi Yuki"], "character": ["29-year-old Satoru Fujinuma (voice)", "10-year-old Satoru Fujinuma (voice)", "Sachiko Fujinuma (voice)", "Airi Katagiri (voice)", "Kayo Hinazuki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65249   Expand ERASED   (2016) User Score  Play Trailer Overview Satoru Fujinuma is a struggling manga artist who has the ability to turn back time and prevent deaths. When his mother is killed he turns back time to solve the mystery, but ends up back in elementary school, just before the disappearance of his classmate Kayo. Featured Crew Keigo Sasaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  8 Posters  12 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shinnosuke Mitsushima 29-year-old Satoru Fujinuma (voice) Tao Tsuchiya 10-year-old Satoru Fujinuma (voice) Minami Takayama Sachiko Fujinuma (voice) Chinatsu Akasaki Airi Katagiri (voice) Aoi Yuki Kayo Hinazuki (voice) Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of ERASED premiered on January  8, 2016. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for ERASED. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  8 Posters  12 Recommendations   2015-01-10 Death Parade 7.3    2016-07-02 ReLIFE 7.0    2013-04-05 My Teen Romantic Comedy SNAFU 7.4    2011-04-06 Steins;Gate 8.2    2014-01-05 Noragami 7.4    2016-10-09 Poco's Udon World 8.3    2014-10-08 Parasyte -the maxim- 7.5    2016-07-12 Mob Psycho 100 8.1  Facts Original Name  僕だけがいない街 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://erasedusa.com/ Genres Animation Drama Mystery Keywords child abuse kidnapping detective supernatural time travel murder based on manga death psychological seinen anime abusive mother butterfly effect Content Score 100 Yes! Looking good! Top Contributors 79 Marr 🇳🇱 T 17 Tinobe 16 Levi Seguel 15 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}