{"link": "https://www.themoviedb.org/tv/51388?language=en", "title": "About a Boy", "resume": "Will Freeman lives a charmed existence as the ultimate man-child. After writing a hit song, he was granted a life of free time, free love and freedom from financial woes. He's single, unemployed and loving it. So imagine his surprise when Fiona, a needy single mom and her oddly charming 11-year-old son, Marcus, move in next door and disrupt his perfect world. When Marcus begins dropping by his home unannounced, Will's not so sure about being a kid's new best friend, until, of course, Will discovers that women find single dads irresistible. That changes everything and a deal is struck: Marcus will pretend to be Will's son and, in return, Marcus is allowed to chill at Will's house. Before he realizes it, Will starts to enjoy the visits and even finds himself looking out for the kid. In fact, this newfound friendship may very well teach him a thing or two that he never imagined possible - about himself and caring for others.", "rate": 64, "genre": ["Comedy", "Drama"], "cast": ["David Walton", "Minnie Driver", "Benjamin Stockham", "Al Madrigal", "Annie Mumolo"], "character": ["Will", "Fiona", "Marcus", "Andy", "Laurie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51388   Expand About a Boy   (2014) User Score Overview Will Freeman lives a charmed existence as the ultimate man-child. After writing a hit song, he was granted a life of free time, free love and freedom from financial woes. He's single, unemployed and loving it. So imagine his surprise when Fiona, a needy single mom and her oddly charming 11-year-old son, Marcus, move in next door and disrupt his perfect world. When Marcus begins dropping by his home unannounced, Will's not so sure about being a kid's new best friend, until, of course, Will discovers that women find single dads irresistible. That changes everything and a deal is struck: Marcus will pretend to be Will's son and, in return, Marcus is allowed to chill at Will's house. Before he realizes it, Will starts to enjoy the visits and even finds himself looking out for the kid. In fact, this newfound friendship may very well teach him a thing or two that he never imagined possible - about himself and caring for others. Featured Crew Nick Hornby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Walton Will Minnie Driver Fiona Benjamin Stockham Marcus Al Madrigal Andy Annie Mumolo Laurie Full Cast & Crew Last Season Season 2 2014 | 20 Episodes Season 2 of About a Boy premiered on October 14, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2016-08-02 Borderline 7.1    2013-11-14 Ground Floor 6.1    2014-03-27 Surviving Jack 7.3    2014-06-29 Reckless 5.5    2015-04-15 The Delivery Man 6.5    2015-03-31 Weird Loners 5.8    2015-08-25 Fried 6.0    2011-02-08 Traffic Light 7.2  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m, 20m Homepage   http://www.nbc.com/about-a-boy Genres Comedy Drama Keywords based on novel or book womanizer neighbor single mother Content Score 100 Yes! Looking good! Top Contributors 33 Stuart Boston 19 Travis Bell 18 Elizabeth Jennings 18 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}