{"link": "https://www.themoviedb.org/tv/494?language=en", "title": "Alice", "resume": "Alice is an American sitcom television series that ran from August 31, 1976 to March 19, 1985 on CBS. The series is based on the 1974 film Alice Doesn't Live Here Anymore. The show stars Linda Lavin in the title role, a widow who moves with her young son to start her life over again, and finds a job working at a roadside diner on the outskirts of Phoenix, Arizona. Most of the episodes revolve around events at Mel's Diner.", "rate": 61, "genre": ["Comedy"], "cast": ["Linda Lavin", "Beth Howland", "Vic Tayback", "Philip McKeon", "Polly Holliday"], "character": ["Alice Hyatt", "Vera Louise Gorman-Novak", "Mel Sharples", "Tommy Hyatt", "Florence Jean Castleberry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 494   Expand Alice   (1976) User Score Overview Alice is an American sitcom television series that ran from August 31, 1976 to March 19, 1985 on CBS. The series is based on the 1974 film Alice Doesn't Live Here Anymore. The show stars Linda Lavin in the title role, a widow who moves with her young son to start her life over again, and finds a job working at a roadside diner on the outskirts of Phoenix, Arizona. Most of the episodes revolve around events at Mel's Diner. Featured Crew Robert Getchell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Linda Lavin Alice Hyatt Beth Howland Vera Louise Gorman-Novak Vic Tayback Mel Sharples Philip McKeon Tommy Hyatt Polly Holliday Florence Jean Castleberry Full Cast & Crew Last Season Season 9 1984 | 16 Episodes Season 9 of Alice premiered on October 14, 1984. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply good 70s show Open 1 by  VinTinKin Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations   1975-01-18 The Jeffersons 6.7    1975-12-16 One Day at a Time 6.6    1981-10-29 Gimme a Break! 5.7    1980-10-30 It's a Living 6.3    1969-09-11 Room 222 5.8    1984-03-19 Kate & Allie 5.3    1976-08-05 What's Happening!! 8.0    1951-12-16 Dragnet 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords restaurant single mother sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors 10 Banana 2 Steve 2 Joe Carson 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}