{"link": "https://www.themoviedb.org/tv/1918?language=en", "title": "The Twilight Zone", "resume": "The Twilight Zone is the first of two revivals of Rod Serling's acclaimed 1950/60s television series of the same name. It ran for two seasons on CBS before producing a final season for syndication.", "rate": 74, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1918   Expand The Twilight Zone   (1985) User Score  Play Trailer Overview The Twilight Zone is the first of two revivals of Rod Serling's acclaimed 1950/60s television series of the same name. It ran for two seasons on CBS before producing a final season for syndication. Featured Crew Rod Serling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  15 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 1988 | 32 Episodes Season 3 of The Twilight Zone premiered on September 24, 1988. View All Seasons Social Reviews  0 Discussions  15 Subject Status Replies Last Reply S Rendezvous in a dark place Open 0 by Strannger18\n      \n     S The mind of Simon Foster Open 0 by Strannger18\n      \n     S The wall Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  2 Posters  3 Recommendations   2002-09-18 The Twilight Zone 7.5    1995-03-26 The Outer Limits 8.0    1963-09-16 The Outer Limits 7.8    1955-10-02 Alfred Hitchcock Presents 7.8    1959-10-02 The Twilight Zone 8.2    1993-09-21 NYPD Blue 6.5    1982-10-02 Newhart 7.4    1989-06-10 Tales from the Crypt 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Drama Keywords anthology Content Score 71 Just a little bit more... Top Contributors 9 Steve m 8 mctm d 7 denis 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}