{"link": "https://www.themoviedb.org/tv/51345?language=en", "title": "Undateable", "resume": "Whether it's due to a lack of style, the wrong job, or even just a bad haircut, everyone goes through a time in their lives when they're undateable. Most of us eventually grow out of it, but some people need a little more help than others. Enter Danny Burton. Confident, attractive and impervious to outside opinions, 29-year-old Danny – who may be in a state of arrested development himself – decides to help out his new roommate, Justin Kearney, the owner of an unsuccessful bar and a chronic overthinker, and Justin's group of oddball friends – Shelly, Burski and Brett. Danny introduces the gang to his recently divorced older sister, Leslie, who immediately bonds with this group of guys, as she feels a little stuck in her own life as well. The gang spends most of their time at Justin's bar, helping solve each other's respective problems over beers, and while they love to give each other a hard time, they always have each other's back.\nPlot Summary:\nDanny Burton is a 30-ish carefree single guy who has watched most of his friends move on to serious relationships. When his last remaining friend Shannon moves out to get married, Danny searches for a new roommate. A promising candidate is Justin, the owner of Black Eyes Bar in Detroit (frequently mispronounced \"Black Guys Bar\"). Justin and his friends - the nerdy Burski, oddball Shelly, and recently out-of-the-closet gay guy Brett - all have certain qualities that make them appear \"undateable\". While Danny himself has good luck getting women into bed, he is unable or unwilling to form a lasting commitment with any of them. Danny's attractive sister, Leslie, has similar fears about being undateable, having the \"baggage\" of being a mid-30s divorcee.", "rate": 62, "genre": ["Comedy"], "cast": ["Chris D'Elia", "Brent Morin", "Ron Funches", "Bianca Kajlich", "David Fynn"], "character": ["Danny Burton", "Justin Kearney", "Shelly", "Leslie", "Brett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51345   Expand Undateable   (2014) User Score Overview Whether it's due to a lack of style, the wrong job, or even just a bad haircut, everyone goes through a time in their lives when they're undateable. Most of us eventually grow out of it, but some people need a little more help than others. Enter Danny Burton. Confident, attractive and impervious to outside opinions, 29-year-old Danny – who may be in a state of arrested development himself – decides to help out his new roommate, Justin Kearney, the owner of an unsuccessful bar and a chronic overthinker, and Justin's group of oddball friends – Shelly, Burski and Brett. Danny introduces the gang to his recently divorced older sister, Leslie, who immediately bonds with this group of guys, as she feels a little stuck in her own life as well. The gang spends most of their time at Justin's bar, helping solve each other's respective problems over beers, and while they love to give each other a hard time, they always have each other's back. Plot Summary: Danny Burton is a 30-ish carefree single guy who has watched most of his friends move on to serious relationships. When his last remaining friend Shannon moves out to get married, Danny searches for a new roommate. A promising candidate is Justin, the owner of Black Eyes Bar in Detroit (frequently mispronounced \"Black Guys Bar\"). Justin and his friends - the nerdy Burski, oddball Shelly, and recently out-of-the-closet gay guy Brett - all have certain qualities that make them appear \"undateable\". While Danny himself has good luck getting women into bed, he is unable or unwilling to form a lasting commitment with any of them. Danny's attractive sister, Leslie, has similar fears about being undateable, having the \"baggage\" of being a mid-30s divorcee. Featured Crew Adam Sztykiel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris D'Elia Danny Burton Brent Morin Justin Kearney Ron Funches Shelly Bianca Kajlich Leslie David Fynn Brett Full Cast & Crew Last Season Season 3 2015 | 12 Episodes Season 3 of Undateable premiered on October  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2013-11-14 Ground Floor 6.1    2015-03-31 Weird Loners 5.8    2015-03-17 One Big Happy 6.0    2015-04-08 Your Family or Mine 4.6    2014-07-17 Married 6.3    2016-03-15 Crowded 6.4    2014-03-31 Friends with Better Lives 5.4    2015-02-19 The Odd Couple 5.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.nbc.com/undateable Genres Comedy Keywords bar friends dating sitcom Content Score 93 Almost there... Top Contributors 22 Elizabeth Jennings K 20 Knightmare TB 14 TMDb Bot OB 8 Omkar Balgobin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}