{"link": "https://www.themoviedb.org/tv/74313?language=en", "title": "Blue Planet II", "resume": "There is nowhere more powerful and unforgiving yet more beautiful and compelling than the ocean. Join us and explore the greatest yet least known parts of our planet.", "rate": 76, "genre": ["Documentary"], "cast": ["David Attenborough"], "character": ["Himself - Presenter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74313   Expand Blue Planet II   (2017) User Score  Play Trailer Overview There is nowhere more powerful and unforgiving yet more beautiful and compelling than the ocean. Join us and explore the greatest yet least known parts of our planet. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  9 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  2 Opening Credits  0 Top Billed Cast David Attenborough Himself - Presenter Full Cast & Crew Current Season Season 1 2017 | 7 Episodes Season 1 of Blue Planet II premiered on October 29, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Episode 1 on Sunday Open 0 by rudely_murray\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  9 Posters  5 Recommendations   2017-09-26 Law & Order True Crime 6.1    2016-10-31 Dark Angel 6.3    2015-11-11 The Frankenstein Chronicles 6.9    2016-10-16 Berlin Station 7.4    1994-10-24 Gargoyles 8.0    2017-05-19 The Keepers 7.6    2017-01-25 Cardinal 6.9    2017-08-09 Mr. Mercedes 7.1  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p04tjbtx Genres Documentary Keywords fish sea ocean nature documentary Content Score 64 We're so close, yet so far. Top Contributors 73 Elizabeth Jennings 28 PNO Movies TB 15 TMDb Bot z 12 zolenka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}