{"link": "https://www.themoviedb.org/tv/1181?language=en", "title": "American Experience", "resume": "TV's most-watched history series, brings to life the compelling stories from our past that inform our understanding of the world today.", "rate": 87, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1181   Expand American Experience   (1988) User Score  Play Trailer Overview TV's most-watched history series, brings to life the compelling stories from our past that inform our understanding of the world today. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  3 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 30 2018 | 5 Episodes Season 30 of American Experience premiered on January  9, 2018. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply \"The Gilded Age\" (S30, E3) Open 0 by genplant29\n      \n     \"The Great War\" (WWI) 6 hrs. documentary (S29, E8-10) Open 2 by  genplant29 Ruby Ridge Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1983-01-17 Frontline 8.1    60 Minutes 7.5  Facts Status  Returning Series Network Certification NR Meaning No rating information Type  Documentary Original Language  English Runtime  55m Homepage   http://www.pbs.org/show/american-experience/ Genres Documentary Keywords biography history science american history current events Content Score 64 We're so close, yet so far. Top Contributors 59 cjcspam 32 Bryan Bortz 25 Elizabeth Jennings 12 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}