{"link": "https://www.themoviedb.org/tv/72339?language=en", "title": "HAPPY!", "resume": "Corrupt ex-cop turned hitman Nick Sax's life is changed forever by a relentlessly positive, imaginary blue winged horse named Happy.", "rate": 75, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Christopher Meloni", "Patton Oswalt", "Lili Mirojnick", "Medina Senghore", "Ritchie Coster"], "character": ["Nick Sax", "Happy (voice)", "Det. Meredith McCarthy", "Amanda Hansen", "Francisco Scaramucci"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72339   Expand HAPPY!   (2017) User Score  Play Trailer Overview Corrupt ex-cop turned hitman Nick Sax's life is changed forever by a relentlessly positive, imaginary blue winged horse named Happy. Featured Crew Grant Morrison Creator Darick Robertson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  4 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Meloni Nick Sax Patton Oswalt Happy (voice) Lili Mirojnick Det. Meredith McCarthy Medina Senghore Amanda Hansen Ritchie Coster Francisco Scaramucci Full Cast & Crew Current Season Season 1 2017 | 8 Episodes Season 1 of HAPPY! premiered on December  6, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply This show isn’t twistedly awesome! Open 2 by  tristavv Go to Discussions Media Most Popular Videos  5 Backdrops  4 Posters  4 Recommendations   2017-10-01 Ten Days in the Valley 6.0    2017-09-26 Law & Order True Crime 6.1    2017-10-03 The Mayor 6.7    2017-11-14 Future Man 7.4    2018-02-11 Here and Now 7.7    2017-08-04 Wet Hot American Summer: 10 Years Later 6.8    2017-10-05 Ghost Wars 6.0    2017-11-21 Marvel's Runaways 7.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  42m Homepage   http://www.syfy.com/happy Genres Sci-Fi & Fantasy Keywords imaginary friend Content Score 100 Yes! Looking good! Top Contributors 57 Elizabeth Jennings 6 express TB 5 TMDb Bot N 5 Nemesis63  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}