{"link": "https://www.themoviedb.org/tv/64783?language=en", "title": "Dawn of the Croods", "resume": "The world's first family is back for more laughs as they discover sports, sleepovers and other wonders in a world of exotic creatures and adventures. This 2D animated cartoon is based on the 3D animated feature film, \"The Croods\".", "rate": 66, "genre": ["Animation", "Family"], "cast": ["A.J. LoCascio", "Stephanie Lemelin", "Dan Milano", "Laraine Newman", "Cree Summer"], "character": ["Thunk (voice)", "Eep (voice)", "Grug / Bud / Womp (voice)", "Gran", "Ugga"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64783   Expand Dawn of the Croods   (2015) User Score  Play Trailer Overview The world's first family is back for more laughs as they discover sports, sleepovers and other wonders in a world of exotic creatures and adventures. This 2D animated cartoon is based on the 3D animated feature film, \"The Croods\". Featured Crew Senja jingga Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast A.J. LoCascio Thunk (voice) Stephanie Lemelin Eep (voice) Dan Milano Grug / Bud / Womp (voice) Laraine Newman Gran Cree Summer Ugga Full Cast & Crew Last Season Season 2 2016 | 13 Episodes Season 2 of Dawn of the Croods premiered on August 25, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Dawn of the Croods. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   2016-03-11 Netflix Presents: The Characters 5.0    2016-11-07 The Sound of Your Heart 8.0    2011-02-08 Traffic Light 7.2    2014-04-28 Heartless 5.9    2017-03-10 Buddy Thunderstruck 8.0    2015-06-18 Hoff the Record 6.0    2015-12-01 Real Rob 5.8    2017-01-01 Beau Séjour 7.9  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage  - Genres Animation Family Keywords family relationships prehistoric based on movie ancient times Content Score 100 Yes! Looking good! Top Contributors 27 Elizabeth Jennings b 21 bangcaw 16 Banana c 9 coltongsmith  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}