{"title": "Malcolm in the Middle", "link": "https://trakt.tv/shows/malcolm-in-the-middle", "genre": ["Comedy"], "rate": 82, "resume": "Created and executive-produced by Emmy Award-winning writer Linwood Boomer, this inventive half-hour series is seen through the eyes of Malcolm (Frankie Muniz), a regular high school kid trying to navigate his way through life despite the various obstacles thrown in his way a complete misunderstanding of girls, the constant burden of masterminding plans to get himself and his brothers into or out of trouble, and a miserable job at the Lucky Aide not to mention a severe case of teen angst. Although Malcolm has a genius IQ, he can't seem to make sense of the opposite sex, much less his embarrassing family. Lois (Jane Kaczmarek) is the outspoken, opinionated mom, who still manages to rule the roost even though her boys are growing wise to her crafty ways. Hal (Bryan Cranston), a dad who is just a bumbling, big kid at heart, often finds himself creating more chaos than his five boys combined. Reese (Justin Berfield) has mastered the art of a perfect blank stare, and makes up for his lack of intelligence with deviance. Francis (Christopher Masterson), Malcolm's oldest and favorite brother, is willing to move from Alabama to Alaska to New Mexico – as long as its keeps him from moving back home. Dewey (Erik Per Sullivan), no longer the youngest, has learned his tricks from the best and often pulls the wool right over his brothers' eyes. And then there's Jamie, the newest member … and family scapegoat.", "cast": ["Frankie Muniz", "Bryan Cranston", "Justin Berfield", "Erik Per Sullivan", "Jane Kaczmarek", "Christopher Masterson", "Craig Lamar Traylor", "David Anthony Higgins", "Emy Coligado", "Eric Nenninger", "Kenneth Mars", "Evan Matthew Cohen", "Kyle Sullivan", "Gary Anthony Williams", "Cloris Leachman", "James Rodriguez", "Lukas Rodriguez"], "character": ["Malcolm", "Hal", "Reese", "Dewey", "Lois", "Francis", "Stevie Kenarban", "Craig Feldspar", "Piama Tananahaakna", "Cadet Eric Hansen", "Otto Mannkusser", "Lloyd", "Dabney Hooper", "Abraham 'Abe' Kenarban", "Ida", "Jamie", "Jamie"]}