{"link": "https://www.themoviedb.org/tv/5895?language=en", "title": "FLCL", "resume": "A 12-year old boy named Naota one day meets a strange woman, riding a Vespa and wielding a big guitar.  As soon as she appears, mysterious things start happening.", "rate": 81, "genre": ["Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5895   Expand FLCL   (2000) User Score  Play Trailer Overview A 12-year old boy named Naota one day meets a strange woman, riding a Vespa and wielding a big guitar.  As soon as she appears, mysterious things start happening. Featured Crew Yōji Enokido Creator Kazuya Tsurumaki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  10 Posters  18 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season FLCL Progressive 2018 | 4 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for FLCL. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  10 Posters  18 Recommendations   2007-07-27 Baccano! 8.4    2004-07-25 Elfen Lied 7.6    1995-10-04 Neon Genesis Evangelion 8.0    1998-04-03 Cowboy Bebop 8.2    2011-01-07 Puella Magi Madoka Magica 7.9    2013-10-04 Kill la Kill 7.7    1998-07-06 Serial Experiments Lain 8.2    2007-04-01 Gurren Lagann 7.9  Facts Original Name  フリクリ Status  In Production Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Animation Comedy Drama Sci-Fi & Fantasy Keywords fantasy boy guitar parody alien coming of age robot vespa tomboy psychedelic bass innuendo anime post modernism Content Score 71 Just a little bit more... Top Contributors TB 40 TMDb Bot 18 Razze m 17 movie28 a 15 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}