{"link": "https://www.themoviedb.org/tv/713?language=en", "title": "Chappelle's Show", "resume": "Chappelle's Show is an American sketch comedy television series created by comedians Dave Chappelle and Neal Brennan, with Chappelle hosting the show as well as starring in various sketches. Chappelle, Brennan and Michele Armour were the show's executive producers. The series premiered on January 22, 2003, on the American cable television network Comedy Central. The show ran for two complete seasons and a third, truncated season.\nAfter numerous delays, production of the third season of the show was abruptly ended when Chappelle left the show. Three episodes were compiled from the completed work and these episodes aired from July 9 to July 23, 2006. Re-runs frequently air on Comedy Central and around the world on MTV in Germany, Comedy Central in Brazil, The Comedy Network in Canada, The Comedy Channel and 7mate in Australia and FX in the United Kingdom.\nChappelle's Show was also shown on WGN America and was syndicated to various television stations across the U.S. including MyNetworkTV. TV Guide ranked it #31 on their list of \"TV's Top 100 Shows\".", "rate": 82, "genre": ["Comedy"], "cast": ["Dave Chappelle"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 713   Expand Chappelle's Show   (2003) User Score Overview Chappelle's Show is an American sketch comedy television series created by comedians Dave Chappelle and Neal Brennan, with Chappelle hosting the show as well as starring in various sketches. Chappelle, Brennan and Michele Armour were the show's executive producers. The series premiered on January 22, 2003, on the American cable television network Comedy Central. The show ran for two complete seasons and a third, truncated season. After numerous delays, production of the third season of the show was abruptly ended when Chappelle left the show. Three episodes were compiled from the completed work and these episodes aired from July 9 to July 23, 2006. Re-runs frequently air on Comedy Central and around the world on MTV in Germany, Comedy Central in Brazil, The Comedy Network in Canada, The Comedy Channel and 7mate in Australia and FX in the United Kingdom. Chappelle's Show was also shown on WGN America and was syndicated to various television stations across the U.S. including MyNetworkTV. TV Guide ranked it #31 on their list of \"TV's Top 100 Shows\". Featured Crew Neal Brennan Creator Dave Chappelle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Chappelle Full Cast & Crew Last Season The Lost Episodes 2006 | 3 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Happy Birthday Dave Chappelle! Open 0 by wonder2wonder\n      \n     g Favorite sketch besides Rick James ? Open 0 by gspgreases\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  4 Recommendations   2000-12-30 Aqua Teen Hunger Force 7.2    2005-08-04 It's Always Sunny in Philadelphia 8.2    2005-10-17 The Colbert Report 7.0    2000-10-15 Curb Your Enthusiasm 8.1    1998-05-14 Celebrity Deathmatch 6.7    2010-06-29 Louie 7.7    1998-08-05 Whose Line Is It Anyway? 7.8    2007-06-17 Flight of the Conchords 7.9  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.comedycentral.com/shows/chappelles_show/index.jhtml Genres Comedy Keywords sketch comedy Content Score 64 We're so close, yet so far. Top Contributors 14 Banana D 7 Digityle 4 Elizabeth Jennings u 3 uaxpasha  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}