{"link": "https://www.themoviedb.org/tv/67118?language=en", "title": "Conviction", "resume": "A brilliant young attorney, who is also the daughter of a former U.S. president, is blackmailed to head up LA's new Conviction Integrity Unit. She and her team investigate cases where people may have been wrongly convicted.", "rate": 63, "genre": ["Drama"], "cast": ["Hayley Atwell", "Eddie Cahill", "Emily Kinney", "Shawn Ashmore", "Merrin Dungey"], "character": ["Hayes Morrison", "Conner Wallace", "Tess Larson", "Sam Spencer", "Maxine Bohen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67118   Expand Conviction   (2016) User Score  Play Trailer Overview A brilliant young attorney, who is also the daughter of a former U.S. president, is blackmailed to head up LA's new Conviction Integrity Unit. She and her team investigate cases where people may have been wrongly convicted. Featured Crew Liz Friedman Creator Liz Friedlander Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hayley Atwell Hayes Morrison Eddie Cahill Conner Wallace Emily Kinney Tess Larson Shawn Ashmore Sam Spencer Merrin Dungey Maxine Bohen Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Conviction premiered on October  3, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Too alpha female Open 1 by  K7T345 Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2013-10-02 Cleaners 7.4    2016-09-22 Notorious 5.8    2016-10-27 Pure Genius 6.7    2015-06-02 Stitchers 6.3    2016-11-30 Incorporated 6.1    2016-09-22 Pitch 5.1    2015-11-08 Agent X 4.3    2017-02-27 When We Rise 6.7  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://abc.go.com/shows/conviction Genres Drama Keywords law case review Content Score 100 Yes! Looking good! Top Contributors p 27 plumpro 13 Elizabeth Jennings 13 Imzadi 10 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}