{"link": "https://www.themoviedb.org/tv/79321?language=en", "title": "Secret Mother", "resume": "Story of a mysterious surrogate mother who enters the home of a woman holding the secret behind her child's death.", "rate": 38, "genre": ["Mystery"], "cast": ["Song Yun-ah", "Kim So-yeon", "Kim Tae-woo", "Song Jae-rim", "Kim Byeong-ok"], "character": ["Kim Yoon-Jin", "Lisa Kim", "Han Jae-Yeol", "Ha Jung-Wan", "Lee Byung-Hak"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79321   Expand Secret Mother   (2018) User Score Overview Story of a mysterious surrogate mother who enters the home of a woman holding the secret behind her child's death. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Song Yun-ah Kim Yoon-Jin Kim So-yeon Lisa Kim Kim Tae-woo Han Jae-Yeol Song Jae-rim Ha Jung-Wan Kim Byeong-ok Lee Byung-Hak Full Cast & Crew Current Season Season 1 2018 | 40 Episodes Season 1 of Secret Mother premiered on May 12, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Secret Mother. You can help by rating TV shows you've seen. Facts Original Name  시크릿 마더 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  35m Homepage   http://programs.sbs.co.kr/drama/secretmother/ Genres Mystery Keywords thriller Content Score 86 Almost there... Top Contributors M 34 Maria180493 3 huggi h 3 huestory 2 Otgoo  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}