{"link": "https://www.themoviedb.org/tv/66911?language=en", "title": "Quarry", "resume": "The story of Mac Conway, a Marine who returns home to Memphis from Vietnam in 1972 and finds himself shunned by those he loves and demonized by the public. As he struggles to cope with his experiences at war, Conway is drawn into a network of killing and corruption that spans the length of the Mississippi River.", "rate": 77, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["Logan Marshall-Green", "Jodi Balfour", "Peter Mullan", "Damon Herriman", "Edoardo Ballerini"], "character": ["Quarry", "Joni", "The Broker", "Buddy", "Karl"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66911   Expand Quarry   (2016) User Score  Play Trailer Overview The story of Mac Conway, a Marine who returns home to Memphis from Vietnam in 1972 and finds himself shunned by those he loves and demonized by the public. As he struggles to cope with his experiences at war, Conway is drawn into a network of killing and corruption that spans the length of the Mississippi River. Featured Crew Michael D. Fuller Creator Graham Gordy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Logan Marshall-Green Quarry Jodi Balfour Joni Peter Mullan The Broker Damon Herriman Buddy Edoardo Ballerini Karl Full Cast & Crew Last Season Season 1 2016 | 8 Episodes Season 1 of Quarry premiered on September  9, 2016. View All Seasons Social Reviews  1 Discussions  3 A review by Jeff_34  8.0 Written by  Jeff_34  on February  7, 2017 Fun Stuff If you liked True Detective (season 1) \nhttps://www.themoviedb.org/tv/46648-true-detective/season/1\nyou'll like this. It's gritty, edgy, dirty and hits you just right. Read All Reviews Media Most Popular Videos  3 Backdrops  6 Posters  5 Recommendations   2016-10-19 Chance 7.3    2016-10-16 Berlin Station 7.4    2006-07-09 Brotherhood 7.4    2017-11-05 SMILF 6.7    2017-02-19 Crashing 7.7    2016-11-15 Good Behavior 6.9    2016-01-22 Stan Lee's Lucky Man 7.3    2015-03-20 Bloodline 7.5  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  52m Homepage   http://www.cinemax.com/quarry/ Genres Action & Adventure Crime Drama Keywords vietnam veteran corruption mississippi 1970s soldier crime Content Score 100 Yes! Looking good! Top Contributors p 42 plumpro 17 United600 12 Elizabeth Jennings a 11 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}