{"link": "https://www.themoviedb.org/tv/2685?language=en", "title": "Family Matters", "resume": "A long-running dramedy centering on the Winslow family, a middle-class African American family living in Chicago, and their pesky next-door neighbor, ultra-nerd Steve Urkel. A spin-off of Perfect Strangers.", "rate": 63, "genre": ["Comedy"], "cast": ["Reginald VelJohnson", "Darius McCrary", "Jaleel White", "Rosetta LeNoire", "Bryton James"], "character": ["Carl Winslow", "Eddie Winslow", "Steve Urkel", "Estelle Winslow", "Richie Crawford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2685   Expand Family Matters   (1989) User Score Overview A long-running dramedy centering on the Winslow family, a middle-class African American family living in Chicago, and their pesky next-door neighbor, ultra-nerd Steve Urkel. A spin-off of Perfect Strangers. Featured Crew Michael Warren Creator William Bickley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Reginald VelJohnson Carl Winslow Darius McCrary Eddie Winslow Jaleel White Steve Urkel Rosetta LeNoire Estelle Winslow Bryton James Richie Crawford Full Cast & Crew Last Season Season 9 1997 | 22 Episodes Season 9 of Family Matters premiered on September 19, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   1991-09-17 Home Improvement 7.0    1984-09-20 The Cosby Show 6.8    1991-09-20 Step by Step 6.1    1987-09-22 Full House 5.9    1989-08-20 Saved by the Bell 6.2    1993-09-24 Boy Meets World 7.5    1995-09-13 The Drew Carey Show 6.4    1985-09-24 Growing Pains 6.1  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Comedy Keywords middle class spin off black family black sitcom Content Score 100 Yes! Looking good! Top Contributors CN 19 Carmelo Nicolosi S 10 Smiddy17 7 Banana 5 HDZeroCool  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}