{"link": "https://www.themoviedb.org/tv/49010?language=en", "title": "The Fall", "resume": "When the Police Service of Northern Ireland are unable to close a case after 28 days, Detective Superintendent Stella Gibson of the Metropolitan Police Service is called in to review the case. Under her new leadership, the local detectives must track down and stop a serial killer who is terrorising the city of Belfast.", "rate": 78, "genre": ["Drama", "Crime"], "cast": ["Gillian Anderson", "Jamie Dornan", "Aisling Franciosi", "Niamh McGrady", "John Lynch"], "character": ["Stella Gibson", "Paul Spector", "Katie Benedetto", "Danielle \"Dani\" Ferrington", "Jim Burns"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49010   Expand The Fall   (2013) User Score  Play Trailer Overview When the Police Service of Northern Ireland are unable to close a case after 28 days, Detective Superintendent Stella Gibson of the Metropolitan Police Service is called in to review the case. Under her new leadership, the local detectives must track down and stop a serial killer who is terrorising the city of Belfast. Featured Crew Allan Cubitt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  12 Posters  6 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gillian Anderson Stella Gibson Jamie Dornan Paul Spector Aisling Franciosi Katie Benedetto Niamh McGrady Danielle \"Dani\" Ferrington John Lynch Jim Burns Full Cast & Crew Last Season Series 3 2016 | 6 Episodes Season 3 of The Fall premiered on September 25, 2016. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply What is in Me Dark Illumine, Stella reveals her negative view of men Open 5 by  mechajutaro 😻 Did Spector actually love Sally Ann? Open 7 by  write2topcat W What do you all think about season 3 and it's finale? Open 13 by  write2topcat Go to Discussions Media Most Popular Videos  2 Backdrops  12 Posters  6 Recommendations   2013-03-04 Broadchurch 8.1    2011-04-03 The Killing 7.5    2010-05-04 Luther 7.9    2014-04-29 Happy Valley 7.7    2013-01-21 The Following 6.2    2013-04-22 Rectify 7.6    2008-11-30 Wallander 7.6    2013-04-04 Hannibal 7.7  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  57m Homepage   http://www.rte.ie/drama/tv/featured/thefall/ Genres Drama Crime Keywords detective serial killer psychological thriller police detective belfast united kingdom female detective Content Score 100 Yes! Looking good! Top Contributors 119 Marr 🇳🇱 61 Elizabeth Jennings 25 Travis Bell 19 EveDemocracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}