{"link": "https://www.themoviedb.org/tv/14509?language=en", "title": "In aller Freundschaft", "resume": "In aller Freundschaft is the title of a German television soap opera which has been on TV since 1998. The series is about the staff of the fictional hospital \"Sachsenklinik\" in the city of Leipzig.\nThe series is produced by Degeto and by the Saxonia Media Filmproduktion GmbH in the studios of the Media City Leipzig.\nThe programme's first broadcast was on 26 October 1998. In the meantime, about 600 episodes have been broadcast.\nInitially, the focus was on Dr. Roland Heilmann, Dr. Achim Kreutzer as well as on Dr. Maia Dietz who were good friends. Nowadays there is a growing cast of 15-20 characters who arrange the story line.\nMany actors were already acting on the German Democratic Republic television and cinema as well as the directors of photography like Celino Bleiweiß, Klaus Gendries, Peter Hill.\nEven though the series plays in the city of Leipzig, the characters rarely use the Upper Saxon German dialect in order to make it easier for the rest of the German population to understand them. Furthermore, this dialect is one of the least favoured dialects in Germany due to the association with the GDR regime.", "rate": 0, "genre": ["Drama"], "cast": ["Thomas Rühmann", "Ursula Karusseit", "Andrea-Kathrin Loewig", "Alexa Maria Surholt", "Uta Schorn"], "character": ["Dr. Roland Heilmann", "Charlotte Gauss", "Dr. Kathrin Globisch", "Sarah Marquardt", "Barbara Grigoleit"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14509   Expand In aller Freundschaft   (1998) User Score Overview In aller Freundschaft is the title of a German television soap opera which has been on TV since 1998. The series is about the staff of the fictional hospital \"Sachsenklinik\" in the city of Leipzig. The series is produced by Degeto and by the Saxonia Media Filmproduktion GmbH in the studios of the Media City Leipzig. The programme's first broadcast was on 26 October 1998. In the meantime, about 600 episodes have been broadcast. Initially, the focus was on Dr. Roland Heilmann, Dr. Achim Kreutzer as well as on Dr. Maia Dietz who were good friends. Nowadays there is a growing cast of 15-20 characters who arrange the story line. Many actors were already acting on the German Democratic Republic television and cinema as well as the directors of photography like Celino Bleiweiß, Klaus Gendries, Peter Hill. Even though the series plays in the city of Leipzig, the characters rarely use the Upper Saxon German dialect in order to make it easier for the rest of the German population to understand them. Furthermore, this dialect is one of the least favoured dialects in Germany due to the association with the GDR regime. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thomas Rühmann Dr. Roland Heilmann Ursula Karusseit Charlotte Gauss Andrea-Kathrin Loewig Dr. Kathrin Globisch Alexa Maria Surholt Sarah Marquardt Uta Schorn Barbara Grigoleit Full Cast & Crew Last Season Season 20 2017 | 33 Episodes Season 20 of In aller Freundschaft premiered on January  3, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on In aller Freundschaft. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  45m Homepage   http://www.mdr.de/in-aller-freundschaft/index.html Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 434 Samara TB 7 TMDb Bot p 1 patrickmoelleken PS 1 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}