{"link": "https://www.themoviedb.org/tv/64203?language=en", "title": "MasterChef Brasil", "resume": "Brazilian version of the competitive cooking reality show where amateur and home chefs compete for the title of MasterChef.", "rate": 75, "genre": ["Reality"], "cast": ["Ana Paula Padrão", "Érick Jacquin", "Paola Carosella", "Henrique Fogaça"], "character": ["Apresentadora", "Jurado", "Jurada", "Jurado"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64203   Expand MasterChef Brasil   (2014) User Score Overview Brazilian version of the competitive cooking reality show where amateur and home chefs compete for the title of MasterChef. Featured Crew Franc Roddam Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  2 Top Billed Cast Ana Paula Padrão Apresentadora Érick Jacquin Jurado Paola Carosella Jurada Henrique Fogaça Jurado Full Cast & Crew Last Season Season 4 2017 | 25 Episodes Season 4 of MasterChef Brasil premiered on March  7, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on MasterChef Brasil. You can help by rating TV shows you've seen. Facts Original Name  MasterChef Status  Returning Series Network Certification L Meaning Content is suitable for all audiences. Type  Reality Original Language  Portuguese Runtime  125m Homepage   http://band.com.br/masterchef Genres Reality Keywords culinary Content Score 100 Yes! Looking good! Top Contributors f 55 felipescavo 24 thecrgs 24 Alexandre Gomes 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}