{"link": "https://www.themoviedb.org/tv/670?language=en", "title": "Baby Looney Tunes", "resume": "Baby Looney Tunes is an American animated television series showing the Looney Tunes characters as babies. It was produced by Warner Bros. Animation.\nThe show premiered on WB stations usually before or after the Kids' WB! block on September 7, 2002 and continued to air on Cartoon Network until 2006. The show is similar to Muppet Babies, with the main characters taken care of by Granny.", "rate": 52, "genre": ["Animation"], "cast": ["Ian James Corlett", "Brian Drummond", "June Foray", "Sam Vincent", "Janyse Jaud"], "character": ["Tasmanian Devil", "Granny", "Daffy Duck", "Melissa Duck"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 670   Expand Baby Looney Tunes   (2002) User Score  Play Trailer Overview Baby Looney Tunes is an American animated television series showing the Looney Tunes characters as babies. It was produced by Warner Bros. Animation. The show premiered on WB stations usually before or after the Kids' WB! block on September 7, 2002 and continued to air on Cartoon Network until 2006. The show is similar to Muppet Babies, with the main characters taken care of by Granny. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ian James Corlett Tasmanian Devil Brian Drummond June Foray Granny Sam Vincent Daffy Duck Janyse Jaud Melissa Duck Full Cast & Crew Last Season Season 2 2005 | 26 Episodes Season 2 of Baby Looney Tunes premiered on April  4, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   Rupert 7.4    2003-08-23 Duck Dodgers 7.4    1983-09-10 The New Scooby and Scrappy-Doo Show 6.4    1995-12-09 Ace Ventura Pet Detective: The Series 5.0    1991-09-07 Taz-Mania 6.3    1993-09-11 The Pink Panther 6.5    1995-09-09 The Sylvester & Tweety Mysteries 7.3    2002-09-14 What's New, Scooby-Doo? 7.0  Facts Status  Ended Networks Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  30m Homepage   http://looneytunes.warnerbros.com/babylooneytunes/ Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors z 15 zurman1 TB 5 TMDb Bot D 4 DracoAn 3 TheOneManBoxOffice  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}