{"link": "https://www.themoviedb.org/tv/636?language=en", "title": "Kung Fu: The Legend Continues", "resume": "Kung Fu: The Legend Continues is a spin-off of the 1972–1975 television series Kung Fu. David Carradine and Chris Potter starred as a father and son trained in kung fu - Carradine playing a Shaolin monk, Potter a police detective. This series aired in syndication for four seasons, from January 27, 1993 to January 1, 1997, and was broadcast in over 70 countries. Filming took place in Toronto, Ontario, Canada. Reruns of the show have been aired on TNT.\nThe show was canceled when its producer, Prime Time Entertainment Network, ceased operations and no other network opted to continue the series.", "rate": 56, "genre": ["Action", "Adventure", "Drama"], "cast": ["David Carradine", "Chris Potter", "Kim Chan", "Nathaniel Moreau", "David Hewlett"], "character": ["Kwai Chang Caine", "Peter Caine", "Lo Si", "Young Peter Caine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 636   Expand Kung Fu: The Legend Continues   (1993) User Score Overview Kung Fu: The Legend Continues is a spin-off of the 1972–1975 television series Kung Fu. David Carradine and Chris Potter starred as a father and son trained in kung fu - Carradine playing a Shaolin monk, Potter a police detective. This series aired in syndication for four seasons, from January 27, 1993 to January 1, 1997, and was broadcast in over 70 countries. Filming took place in Toronto, Ontario, Canada. Reruns of the show have been aired on TNT. The show was canceled when its producer, Prime Time Entertainment Network, ceased operations and no other network opted to continue the series. Featured Crew Ed Spielman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast David Carradine Kwai Chang Caine Chris Potter Peter Caine Kim Chan Lo Si Nathaniel Moreau Young Peter Caine David Hewlett Full Cast & Crew Last Season Season 4 1996 | 22 Episodes Season 4 of Kung Fu: The Legend Continues premiered on January 31, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1978-10-01 Centennial 7.7    1982-03-23 Joanie Loves Chachi 2.4    1989-09-19 Doogie Howser, M.D. 5.7    1998-10-23 Brimstone 7.6    1994-09-21 Touched by an Angel 5.3    1999-04-03 The Lost World 7.4    1977-03-15 Eight Is Enough 5.9    1983-10-03 Scarecrow and Mrs. King 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  44m Homepage   http://www.imdb.com/title/tt0103460/ Genres Action & Adventure Drama Keywords martial arts kung fu Content Score 100 Yes! Looking good! Top Contributors d 9 denis z 6 zurman1 x 6 xPR 4 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}