{"link": "https://www.themoviedb.org/tv/65367?language=en", "title": "Rush Hour", "resume": "The series follows Detective Carter, a radical LAPD detective, and Detective Lee, a by-the-book detective from Hong Kong, as they are forced into forming an unlikely partnership", "rate": 48, "genre": ["Crime", "Comedy", "Action", "Adventure"], "cast": ["Justin Hires", "Jon Foo", "Aimee Garcia", "Page Kennedy", "Wendie Malick"], "character": ["Detective Carter", "Detective Lee", "Sergeant Didi Diaz", "Gerald", "Captain Lindsay Cole"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65367   Expand Rush Hour   (2016) User Score Overview The series follows Detective Carter, a radical LAPD detective, and Detective Lee, a by-the-book detective from Hong Kong, as they are forced into forming an unlikely partnership Featured Crew Bill Lawrence Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Justin Hires Detective Carter Jon Foo Detective Lee Aimee Garcia Sergeant Didi Diaz Page Kennedy Gerald Wendie Malick Captain Lindsay Cole Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of Rush Hour premiered on March 31, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   2018-02-01 A.P. Bio 5.8    2014-09-17 Red Band Society 6.4    2016-05-26 Private Eyes 6.0    2016-06-28 Dead of Summer 5.3    2014-06-29 Reckless 5.5    2014-08-04 Partners 5.1    2016-12-07 Shut Eye 6.3    2018-02-26 Final Space 7.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://cbs.com/shows/rush-hour/ Genres Crime Comedy Action & Adventure Keywords police detective based on movie buddy cop lapd Content Score 93 Almost there... Top Contributors 34 Banana 29 Warpath 17 zerotaichou 8 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}