{"link": "https://www.themoviedb.org/tv/1964?language=en", "title": "The Jeffersons", "resume": "The Jeffersons is an American sitcom that was broadcast on CBS from January 18, 1975, through July 2, 1985, lasting 11 seasons and a total of 253 episodes. The show was produced by the T.A.T. Communications Company from 1975–1982 and by Embassy Television from 1982–1985. The Jeffersons is one of the longest-running sitcoms in the history of American television.\nThe show focuses on George and Louise Jefferson, an affluent Black couple living in New York City. The show was launched as the second spin-off of All in the Family, on which the Jeffersons had been the neighbors of Archie and Edith Bunker.\nThe show was the creation of prolific television producer Norman Lear. However, it was less sharply political in tone than some of his shows. The Jeffersons evolved into more of a traditional sitcom, relying more on the characters' interactions with one another than on explicitly political dialogue or storylines. It did, however, tackle a few controversial topics, including racism, suicide, gun control and adult illiteracy. Also, the words \"nigger\" and \"honky\" were used occasionally, especially during the earlier seasons.\nThe Jeffersons had one spin-off, titled Checking In. The short-lived series was centered around the Jeffersons' housekeeper, Florence. Checking In only lasted four episodes, after which Florence returned to The Jeffersons.", "rate": 70, "genre": ["Comedy"], "cast": ["Paul Benedict", "Franklin Cover", "Roxie Roker", "Sherman Hemsley", "Isabel Sanford"], "character": ["Harry Bentley", "George Jefferson", "Louise Jefferson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1964   Expand The Jeffersons   (1975) User Score Overview The Jeffersons is an American sitcom that was broadcast on CBS from January 18, 1975, through July 2, 1985, lasting 11 seasons and a total of 253 episodes. The show was produced by the T.A.T. Communications Company from 1975–1982 and by Embassy Television from 1982–1985. The Jeffersons is one of the longest-running sitcoms in the history of American television. The show focuses on George and Louise Jefferson, an affluent Black couple living in New York City. The show was launched as the second spin-off of All in the Family, on which the Jeffersons had been the neighbors of Archie and Edith Bunker. The show was the creation of prolific television producer Norman Lear. However, it was less sharply political in tone than some of his shows. The Jeffersons evolved into more of a traditional sitcom, relying more on the characters' interactions with one another than on explicitly political dialogue or storylines. It did, however, tackle a few controversial topics, including racism, suicide, gun control and adult illiteracy. Also, the words \"nigger\" and \"honky\" were used occasionally, especially during the earlier seasons. The Jeffersons had one spin-off, titled Checking In. The short-lived series was centered around the Jeffersons' housekeeper, Florence. Checking In only lasted four episodes, after which Florence returned to The Jeffersons. Featured Crew Norman Lear Creator Michael Ross Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Benedict Harry Bentley Franklin Cover Roxie Roker Sherman Hemsley George Jefferson Isabel Sanford Louise Jefferson Full Cast & Crew Last Season Season 11 1984 | 24 Episodes Season 11 of The Jeffersons premiered on October 14, 1984. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Florence: Happy Birthday Marla Gibbs! Open 0 by wonder2wonder\n      \n     Cap Scanlon Open 0 by McGannahan Skyjellyfetti\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1975-12-16 One Day at a Time 6.6    1984-01-04 Night Court 6.9    1982-10-02 Newhart 7.4    1976-08-31 Alice 5.9    1975-09-09 Welcome Back, Kotter 7.2    1970-09-24 The Odd Couple 7.1    1974-02-08 Good Times 7.3    1979-08-24 The Facts of Life 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords new york sitcom black sitcom Content Score 93 Almost there... Top Contributors 14 Banana 7 lineker 4 t0by 2 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}