{"link": "https://www.themoviedb.org/tv/75782?language=en", "title": "One Strange Rock", "resume": "A mind-bending, thrilling journey exploring the fragility and wonder of planet Earth, one of the most peculiar, unique places in the entire universe, brought to life by the only people to have left it behind – the world’s most well known and leading astronauts.", "rate": 80, "genre": ["Documentary"], "cast": ["Will Smith"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75782   Expand One Strange Rock   (2018) User Score Overview A mind-bending, thrilling journey exploring the fragility and wonder of planet Earth, one of the most peculiar, unique places in the entire universe, brought to life by the only people to have left it behind – the world’s most well known and leading astronauts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  12 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will Smith Himself - Host Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of One Strange Rock premiered on March 26, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  12 Recommendations We don't have enough data to suggest any TV shows based on One Strange Rock. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  English Runtime  47m Homepage   http://channel.nationalgeographic.com/one-strange-rock/ Genres Documentary Keywords earth Content Score 64 We're so close, yet so far. Top Contributors 66 Elizabeth Jennings 31 davekeys o 15 orhan_yümücly r 7 robko22  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}