{"link": "https://www.themoviedb.org/tv/78976?language=en", "title": "Ex on the Beach", "resume": "Can you ever really be over your ex? In this social experiment, 10 smoking-hot celebrity singles think they're running away to a tropical island for a once-in-a-lifetime romantic vacation full of fun and sun. But just as the party is getting started, unwanted guests arrive to break up their good time. Paradise turns into a nightmare when their exes start emerging, and everyone is left wondering whose ex will be next. Caught in a complicated web of hookups, deceit and revenge, will old loves reignite? Or will the flame of romance be gone for good? Welcome to Ex on the Beach.", "rate": 100, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78976   Expand Ex on the Beach (US)   (2018) User Score Overview Can you ever really be over your ex? In this social experiment, 10 smoking-hot celebrity singles think they're running away to a tropical island for a once-in-a-lifetime romantic vacation full of fun and sun. But just as the party is getting started, unwanted guests arrive to break up their good time. Paradise turns into a nightmare when their exes start emerging, and everyone is left wondering whose ex will be next. Caught in a complicated web of hookups, deceit and revenge, will old loves reignite? Or will the flame of romance be gone for good? Welcome to Ex on the Beach. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 1 2018 | 11 Episodes Season 1 of Ex on the Beach (US) premiered on April 19, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ex on the Beach (US). You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  45m Homepage   http://www.mtv.com/shows/ex-on-the-beach Genres Reality Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 16 Bendik 13 oldboy3 b 1 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}