{"link": "https://www.themoviedb.org/tv/64835?language=en", "title": "Hap and Leonard", "resume": "A darkly comic swamp noir story of two best friends set in the late 1980s. Based on the novels by Joe R. Lansdale, the series follows Hap Collins, an East Texas white boy with a weakness for Southern women, and Leonard Pine, a gay, black Vietnam vet with a hot temper.", "rate": 73, "genre": ["Action", "Adventure", "Drama"], "cast": ["James Purefoy", "Michael Kenneth Williams"], "character": ["Hap Collins", "Leonard Pine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64835   Expand Hap and Leonard   (2016) User Score  Play Trailer Overview A darkly comic swamp noir story of two best friends set in the late 1980s. Based on the novels by Joe R. Lansdale, the series follows Hap Collins, an East Texas white boy with a weakness for Southern women, and Leonard Pine, a gay, black Vietnam vet with a hot temper. Featured Crew Jim Mickle Creator Nick Damici Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  23 Posters  5 Videos Trailers  2 Teasers  1 Clips  1 Featurettes  0 Opening Credits  1 Top Billed Cast James Purefoy Hap Collins Michael Kenneth Williams Leonard Pine Full Cast & Crew Current Season The Two-Bear Mambo 2018 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply One of the BEST Shows on T.V., HANDS DOWN!  ~SPOILERS~ Open 4 by  ScorpionQ2 Go to Discussions Media Most Popular Videos  5 Backdrops  23 Posters  5 Recommendations   2006-10-10 Intelligence 8.3    2014-02-27 The Red Road 6.0    2014-04-21 Jamaica Inn 5.5    2014-09-21 The Code 7.4    2014-10-05 Mulaney 2.4    2015-04-26 HAPPYish 6.9    2015-01-15 Mad Dogs 6.8    2013-04-19 Alpha House 7.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m Homepage   http://www.sundance.tv/series/hap-and-leonard Genres Action & Adventure Drama Keywords based on novel or book texas noir ex-wife get rich quick scheme 1980s swamp noir Content Score 71 Just a little bit more... Top Contributors 128 Elizabeth Jennings t 8 tmdb42368388 7 Banana TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}