{"link": "https://www.themoviedb.org/tv/33922?language=en", "title": "Portlandia", "resume": "Satirical sketch comedy set and filmed in Portland, Oregon that explores the eccentric misfits who embody the foibles of modern culture.", "rate": 65, "genre": ["Comedy"], "cast": ["Fred Armisen", "Carrie Brownstein"], "character": ["Various Characters", "Various Characters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33922   Expand Portlandia   (2011) User Score  Play Trailer Overview Satirical sketch comedy set and filmed in Portland, Oregon that explores the eccentric misfits who embody the foibles of modern culture. Featured Crew Jonathan Krisel Creator Fred Armisen Creator Carrie Brownstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  14 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fred Armisen Various Characters Carrie Brownstein Various Characters Full Cast & Crew Current Season Season 8 2018 | 10 Episodes Season 8 of Portlandia premiered on January 18, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Portlandia. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  10 Recommendations   2014-08-07 Garfunkel and Oates 7.5    2005-09-19 Out of Practice 6.7    2015-03-30  Fartsa 6.3    2006-08-07 Gene Simmons Family Jewels 4.4    2011-10-17 Threesome 6.3    2015-02-20 Richie Rich 3.0    2010-06-28 Huge 5.5    2011-02-08 Traffic Light 7.2  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.ifc.com/portlandia/ Genres Comedy Keywords satire sketch comedy Content Score 71 Just a little bit more... Top Contributors 42 Elizabeth Jennings 9 niqo19 TB 6 TMDb Bot 6 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}