{"link": "https://www.themoviedb.org/tv/2303?language=en", "title": "Hawaii Five-O", "resume": "Hawaii Five-O is an American police procedural drama series produced by CBS Productions and Leonard Freeman. Set in Hawaii, the show originally aired for 12 seasons from 1968 to 1980, and continues in reruns. Jack Lord portrayed Detective Lieutenant Steve McGarrett, the head of a special state police task force which was based on an actual unit that existed under martial law in the 1940s. The theme music composed by Morton Stevens became especially popular. Many episodes would end with McGarrett instructing his subordinate to \"Book 'em, Danno!\", sometimes specifying a charge such as \"murder one\".", "rate": 69, "genre": ["Action", "Adventure", "Drama"], "cast": ["Jack Lord", "Herman Wedemeyer", "Kam Fong Chun", "Zulu", "Al Harrington"], "character": ["Det. Steve McGarrett", "Duke"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2303   Expand Hawaii Five-O   (1968) User Score Overview Hawaii Five-O is an American police procedural drama series produced by CBS Productions and Leonard Freeman. Set in Hawaii, the show originally aired for 12 seasons from 1968 to 1980, and continues in reruns. Jack Lord portrayed Detective Lieutenant Steve McGarrett, the head of a special state police task force which was based on an actual unit that existed under martial law in the 1940s. The theme music composed by Morton Stevens became especially popular. Many episodes would end with McGarrett instructing his subordinate to \"Book 'em, Danno!\", sometimes specifying a charge such as \"murder one\". Featured Crew Leonard Freeman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jack Lord Det. Steve McGarrett Herman Wedemeyer Duke Kam Fong Chun Zulu Al Harrington Full Cast & Crew Last Season Season 12 1979 | 20 Episodes Season 12 of Hawaii Five-O premiered on October  4, 1979. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply book em dano Open 1 by  Gary O. Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1981-11-24 Simon & Simon 6.6    1951-12-16 Dragnet 7.0    1966-09-09 The Time Tunnel 7.0    1976-10-03 Quincy, M.E. 7.0    1971-09-14 Cannon 5.6    1966-09-17 Mission: Impossible 7.3    1954-09-12 Lassie 5.3    1983-09-18 Hardcastle and McCormick 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords police hawaii car chase wo fat Content Score 93 Almost there... Top Contributors 17 lineker m 12 mode2 9 Elizabeth Jennings 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}