{"link": "https://www.themoviedb.org/tv/42916?language=en", "title": "Toradora!", "resume": "It’s Ryuji’s first day as a junior in high school and it seems as if things are looking up. He gets to sit in between his only friend, Yusaku, and, more importantly, the girl he’s secretly crushing on, Minori Kushieda. But just when he thinks the stars are aligned in his favor, he unwittingly crosses the most feared girl in school, Taiga Aisaku, making her onto his arch enemy. To top it off, Taiga has moved in right next door to Ryuji and happens to be Minori’s best friend! Can this school year possibly get any worse?!", "rate": 78, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Yui Horie", "Rie Tanaka", "Hiroyuki Yoshino", "Eri Kitamura", "Hirofumi Nojima"], "character": ["Ami Kawashima"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42916   Expand Toradora!   (2008) User Score  Play Trailer Overview It’s Ryuji’s first day as a junior in high school and it seems as if things are looking up. He gets to sit in between his only friend, Yusaku, and, more importantly, the girl he’s secretly crushing on, Minori Kushieda. But just when he thinks the stars are aligned in his favor, he unwittingly crosses the most feared girl in school, Taiga Aisaku, making her onto his arch enemy. To top it off, Taiga has moved in right next door to Ryuji and happens to be Minori’s best friend! Can this school year possibly get any worse?! Featured Crew Yuyuko Takemiya Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yui Horie Rie Tanaka Hiroyuki Yoshino Eri Kitamura Ami Kawashima Hirofumi Nojima Full Cast & Crew Last Season Season 1 2008 | 25 Episodes Season 1 of Toradora! premiered on October  1, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2014-07-06 Monthly Girls' Nozaki-kun 7.7    2008-01-08 Spice and Wolf 7.3    2012-04-22 Hyouka 8.3    2011-04-15 Anohana: The Flower We Saw That Day 7.6    2013-03-31 Date a Live 7.9    2011-04-14 Aria the Scarlet Ammo 6.4    2015-10-07 Beautiful Bones: Sakurako’s Investigation 6.3    2012-04-05 Sankarea: Undying Love 7.0  Facts Original Name  とらドラ！ Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tv-tokyo.co.jp/anime/toradora/ Genres Animation Comedy Drama Keywords romance slice of life school schoolgirl seinen anime shojo Content Score 100 Yes! Looking good! Top Contributors k 31 kirath 15 WillofOwn V 12 Viamaster 11 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}