{"link": "https://www.themoviedb.org/tv/79775?language=en", "title": "Cults and Extreme Belief", "resume": "Elizabeth Vargas, alongside former members of controversial organizations, goes on a search to uncover how these sects use their influence to prey upon people's desperation to create powerful and often destructive belief systems. Each episode will take an immersive look at one currently active group through the eyes of past devotees and get perspective from believers and leaders that are still inside.", "rate": 0, "genre": ["Documentary"], "cast": ["Elizabeth Vargas"], "character": ["Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79775   Expand Cults and Extreme Belief   (2018) User Score  Play Trailer Overview Elizabeth Vargas, alongside former members of controversial organizations, goes on a search to uncover how these sects use their influence to prey upon people's desperation to create powerful and often destructive belief systems. Each episode will take an immersive look at one currently active group through the eyes of past devotees and get perspective from believers and leaders that are still inside. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elizabeth Vargas Herself Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Cults and Extreme Belief premiered on May 28, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Cults and Extreme Belief. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Cults and Extreme Belief. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Miniseries Original Language  English Runtime  42m Homepage   https://www.aetv.com/shows/cults-and-extreme-belief Genres Documentary Keywords cult Content Score 64 We're so close, yet so far. Top Contributors 23 Elizabeth Jennings 1 Alexandria  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}