{"title": "Big Time Rush", "link": "https://trakt.tv/shows/big-time-rush", "genre": ["Comedy"], "rate": 74, "resume": "Big Time Rush is a series about friendship and brotherhood that chronicles the finding, making and breaking – of a potential chart-topping music group. Each of the guys brings something different to the group as they figure out their place in the crazy business of music and entertainment. A naturally gifted singer, Kendall never planned on becoming famous but definitely has the swagger of a music star. After seizing this opportunity of a lifetime, he leads his friends on an exciting comedy and music-filled journey. James has big dreams for himself and his pals and his confidence in their potential for success helps the other guys deal with the more difficult moments. Carlos looks at life as a big playground and this foray into music as an awesome ride that he is on with his buddies. The brains of the operation, Logan is the voice of reason and his sharp wit gives everyone the perspective they need to stay true to themselves and their goals. Life in the business is not easy and their antics often get them in trouble with the record label. From falling for the same girl to redecorating their apartment at the Palm Woods to misbehaving with a new school teacher at the recording studio -- the group learns that success comes with hard work and dedication – and the support of one another.", "cast": ["Kendall Schmidt", "Logan Henderson", "James Maslow", "Carlos PenaVega", "Challen Cates", "Tanya Chisholm", "Erin Sanders", "Spencer Locke", "Ciara Bravo", "Stephen Kramer Glickman", "Rachel Quaintance", "Bobby Lee", "Katelyn Tarver", "Tom Kenny", "Kelli Goss", "Matt Riedy", "David Anthony Higgins", "Denyse Tontz", "Tucker Albrizzi"], "character": ["Kendall Knight", "Logan Mitchell", "James Diamond", "Carlos Garcia", "Jennifer Knight", "Kelly Wainwright", "Camille Roberts", "Jennifer 2", "Katie Knight", "Gustavo Rocque", "Roberta", "T.J.", "Jo Taylor", "Patchy the Pirate", "Jennifer 2", "Arthur Griffin", "Reginald Bitters", "Jennifer 1", "Tyler Duncan"]}