{"link": "https://www.themoviedb.org/tv/64836?language=en", "title": "Good Behavior", "resume": "Letty Dobesh is a thief and con artist fresh out of prison whose life is always one wrong turn and bad decision from implosions — just how she likes it. But when she overhears a hitman being hired to kill a man’s wife, she sets out to derail the job, launching her on a collision course with the killer, entangling them in a dangerous and seductive relationship.", "rate": 71, "genre": ["Drama"], "cast": ["Michelle Dockery", "Juan Diego Botto", "Lusia Strus", "Terry Kinney"], "character": ["Letty Dobesh", "Javier", "Estelle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64836   Expand Good Behavior   (2016) User Score  Play Trailer Overview Letty Dobesh is a thief and con artist fresh out of prison whose life is always one wrong turn and bad decision from implosions — just how she likes it. But when she overhears a hitman being hired to kill a man’s wife, she sets out to derail the job, launching her on a collision course with the killer, entangling them in a dangerous and seductive relationship. Featured Crew Chad Hodge Creator Blake Crouch Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michelle Dockery Letty Dobesh Juan Diego Botto Javier Lusia Strus Estelle Terry Kinney Full Cast & Crew Current Season Season 2 2017 | 10 Episodes Season 2 of Good Behavior premiered on October 15, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Good Behavior has premiered in Canada (Feb. 13) Open 0 by LucusNon\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  5 Recommendations   2017-02-07 Imposters 7.6    2016-10-19 Chance 7.3    2012-03-04 GCB 5.3    2015-11-24 Capital 7.5    2017-01-25 Cardinal 6.9    2016-10-16 Berlin Station 7.4    2013-10-22 Ravenswood 4.5    2018-06-04 Dietland 8.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  59m Homepage   http://www.tntdrama.com/shows/good-behavior Genres Drama Keywords ex-con Content Score 100 Yes! Looking good! Top Contributors 60 Elizabeth Jennings a 10 adambakir92 M 6 Megacine 4 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}