{"link": "https://www.themoviedb.org/tv/1660?language=en", "title": "I Dream of Jeannie", "resume": "I Dream of Jeannie is an American sitcom with a fantasy premise. The show starred Barbara Eden as a 2,000-year-old genie, and Larry Hagman as an astronaut who becomes her master, with whom she falls in love and eventually marries. Produced by Screen Gems, the show originally aired from September 1965 to May 1970 with new episodes, and through September 1970 with season repeats, on NBC. The show ran for five seasons and produced 139 episodes. The first season consisted of 30 episodes filmed in black and white.", "rate": 72, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Barbara Eden", "Larry Hagman", "Bill Daily", "Hayden Rorke", "Vinton Hayworth"], "character": ["Jeannie", "Tony Nelson", "Roger Healey", "Alfred Bellows", "Gen. Schaeffer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1660   Expand I Dream of Jeannie   (1965) User Score  Play Trailer Overview I Dream of Jeannie is an American sitcom with a fantasy premise. The show starred Barbara Eden as a 2,000-year-old genie, and Larry Hagman as an astronaut who becomes her master, with whom she falls in love and eventually marries. Produced by Screen Gems, the show originally aired from September 1965 to May 1970 with new episodes, and through September 1970 with season repeats, on NBC. The show ran for five seasons and produced 139 episodes. The first season consisted of 30 episodes filmed in black and white. Featured Crew Sidney Sheldon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  14 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Barbara Eden Jeannie Larry Hagman Tony Nelson Bill Daily Roger Healey Hayden Rorke Alfred Bellows Vinton Hayworth Gen. Schaeffer Full Cast & Crew Last Season Season 5 1969 | 26 Episodes Season 5 of I Dream of Jeannie premiered on September 16, 1969. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Jeannie: Happy Birthday Barbara Eden! Open 0 by wonder2wonder\n      \n     w Your wish... Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  5 Recommendations   1964-09-17 Bewitched 7.1    1964-09-24 The Munsters 7.1    1964-09-26 Gilligan's Island 6.6    1964-09-18 The Addams Family 7.5    1962-09-26 The Beverly Hillbillies 6.6    1969-09-26 The Brady Bunch 6.5    1978-09-12 Taxi 7.2    1976-01-27 Laverne & Shirley 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords magic wish astronaut genie sitcom Content Score 100 Yes! Looking good! Top Contributors 19 Banana S 8 Samara b 8 batzemeister81 8 waaw  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}