{"title": "History's Strongest Disciple Kenichi", "link": "https://trakt.tv/shows/history-s-strongest-disciple-kenichi", "genre": ["Comedy", "Action", "Adventure", "Anime", "Romance"], "rate": 85, "resume": "The story focuses on Kenichi Shirahama, an average 16-year-old high school student who has been picked on his whole life. However, on his first day of class, he meets and befriends the mysterious transfer student, Miu Fūrinji. Driven by his desire to become stronger, he follows her to Ryōzanpaku, a dojo housing several masters of diverse martial arts, led by her grandfather Hayato Fūrinji, who is known as the strongest man on Earth. After learning basics from Miu, Kenichi is able to beat a high-ranking member of the school's karate club, and becomes a target for all the delinquents in the school. While initially training to get stronger and protect himself, Kenichi eventually becomes a full-fledged disciple of Ryōzanpaku, working hard to fulfill his oath to protect the ones in need, especially Miu, with whom he falls in love. Subsequently, Kenichi's daily routine is divided between hellish training under the six masters of Ryōzanpaku, and his fights against the members of Ragnarok, a gang that views him as either a possible ally or an impending threat to their plans.", "cast": ["Hiroshi Arikawa", "Tomokazu Seki", "Unsho Ishizuka", "Mamiko Noto", "Tomoko Kawakami", "Hiroya Ishimaru", "Issei Futamata", "Jūrōta Kosugi", "Ai Orikasa", "Akio Otsuka", "Atsuko Tanaka", "Aya Hisakawa", "Daisuke Gouri", "Namikawa Daisuke", "Houko Kuwashima", "Isshin Chiba", "Jouji Nakata", "Junko Minagawa", "Kaoru Shimamura", "Ken Narita"], "character": ["Hayato Fūrinji", "Kenichi Shirahama", "Shio Sakaki", "Shigure Kōsaka", "Miu Fūrinji", "Apachai Hopachai", "Kensei Ma", "Akisame Kōetsuji", "Saori Shirahama", "Isshinsai Ogata", "Kaname Kugatachi", "Chihiro Takashima", "Mototsugu Shirahama", "Kōan Shokatsu", "Kaede Tanimoto", "Takashi Furukawa", "Shogo Kikkawa", "Shiratori", "Kyōko Ono", "Ryūto Asamiya"]}