{"link": "https://www.themoviedb.org/tv/30669?language=en", "title": "Yu Yu Hakusho", "resume": "One day, 14-year-old Yusuke Urameshi suddenly finds himself dead, having died pushing a child out of the way of oncoming traffic. Since he has such a bad personality, even the Spirit World was caught by surprise that he would sacrifice himself. Yusuke soon finds out he wasn't supposed to die and has a chance for resurrection and bringing his body back to life. After being resurrected, Yusuke becomes a Spirit Detective, along with his comrades, and one adventure after another happens, whether it be an investigation or a fighting tournament.", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Nozomu Sasaki", "Shigeru Chiba", "Megumi Ogata", "Nobuyuki Hiyama", "Yuri Amano"], "character": ["Yūsuke Urameshi (voice)", "Kazuma Kuwabara (voice)", "Kurama/Shūichi Minamino (voice)", "Hiei (voice)", "Keiko Yukimura (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30669   Expand Yu Yu Hakusho   (1992) User Score Overview One day, 14-year-old Yusuke Urameshi suddenly finds himself dead, having died pushing a child out of the way of oncoming traffic. Since he has such a bad personality, even the Spirit World was caught by surprise that he would sacrifice himself. Yusuke soon finds out he wasn't supposed to die and has a chance for resurrection and bringing his body back to life. After being resurrected, Yusuke becomes a Spirit Detective, along with his comrades, and one adventure after another happens, whether it be an investigation or a fighting tournament. Featured Crew Yoshihiro Togashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Nozomu Sasaki Yūsuke Urameshi (voice) Shigeru Chiba Kazuma Kuwabara (voice) Megumi Ogata Kurama/Shūichi Minamino (voice) Nobuyuki Hiyama Hiei (voice) Yuri Amano Keiko Yukimura (voice) Full Cast & Crew Last Season Season 2 1993 | 41 Episodes Season 2 of Yu Yu Hakusho premiered on April 17, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2000-10-15 InuYasha 7.4    1995-04-10 Street Fighter II: V 7.0    2012-04-01 Marvel's Ultimate Spider-Man 6.6    2003-07-19 Teen Titans 7.6    1994-10-24 Gargoyles 8.0    2001-01-13 Disney's House of Mouse 7.6    2006-04-06 xxxHOLiC 7.7    2009-04-24 Iron Man: Armored Adventures 7.1  Facts Original Name  幽☆遊☆白書 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords martial arts school demon anime Content Score 100 Yes! Looking good! Top Contributors t 111 tmdb983464 95 RubeensVinicius P 25 PC 13 Renato  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}