{"link": "https://www.themoviedb.org/tv/45322?language=en", "title": "Long Island Medium", "resume": "Theresa Caputo is an average mom from Long Island in every way except one: she talks to the dead. Theresa spends her days with her loving family and helping individuals connect to the spirits of their departed loved ones. This is not her job…this is her life.", "rate": 52, "genre": ["Reality"], "cast": ["Theresa Caputo"], "character": ["Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45322   Expand Long Island Medium   (2011) User Score  Play Trailer Overview Theresa Caputo is an average mom from Long Island in every way except one: she talks to the dead. Theresa spends her days with her loving family and helping individuals connect to the spirits of their departed loved ones. This is not her job…this is her life. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Theresa Caputo Herself Full Cast & Crew Current Season Season 11 2018 | 6 Episodes Season 11 of Long Island Medium premiered on April  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2009-04-19 Cake Boss 5.7  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Reality Original Language  English Runtime  30m Homepage   https://www.tlc.com/tv-shows/long-island-medium/ Genres Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 13 Elizabeth Jennings 7 szab b 6 basher 4 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}