{"title": "Breaking Amish", "link": "https://trakt.tv/shows/breaking-amish", "genre": ["Documentary", "Reality"], "rate": 59, "resume": "In a world where \"plain\" is considered a compliment, TLC will pull back the curtains to reveal the strict traditions of the Amish/Mennonite religion and lifestyle as cameras follow five people who have chosen to leave it behind and explore the world outside of their community.Breaking Amish, premiering Sunday, Sept. 9 at 10|9c, provides a never-before-seen look inside the lives of young men and women as they, for the first time, trade horse and buggy with taxi cabs to break out from their respective Amish/Mennonite communities in their pursuit to chase big dreams in the Big Apple. The groundbreaking series features nine hour-long episodes.Breaking Amish will shed light on many firsts for the cast members. From flying in a plane and wearing jeans, to using a cell phone and electricity, the show will highlight their transition into city culture and the basic amenities that come with it.Unlike Rumspringa, these young men and women get serious about the possibility of committing to careers, lives and options for living indefinitely on the outside. But after these new experiences and the opportunity to live out dreams take flight, will they take advantage of New York and carry out their newfound lives while leaving behind the Amish/Mennonite community and their families forever?The decision to pack up their bags and leave town does not come without a hefty price. Breaking Amish will unveil the disenchantment of family members who are forced to shun their own children, siblings and grandchildren as they decide to explore a world beyond the limitations of their simple upbringing. Should these \"rebellious\" Amish/Mennonite members decide to forgo Western luxuries and return to their previous lifestyles, they risk the probability of being shunned by their community altogether -- including the family, friends and life they once knew so well.", "cast": [], "character": []}