{"link": "https://www.themoviedb.org/tv/3163?language=en", "title": "Foyle's War", "resume": "As WW2 rages around the world, DCS Foyle fights his own war on the home-front as he investigates crimes on the south coast of England. Foyle's War opens in southern England in the year 1940. Later series sees the retired detective working as an MI5 agent operating in the aftermath of the war.", "rate": 81, "genre": ["Drama"], "cast": ["Michael Kitchen", "Honeysuckle Weeks"], "character": ["DCS Foyle", "Samantha Stewart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3163   Expand Foyle's War   (2002) User Score  Play Trailer Overview As WW2 rages around the world, DCS Foyle fights his own war on the home-front as he investigates crimes on the south coast of England. Foyle's War opens in southern England in the year 1940. Later series sees the retired detective working as an MI5 agent operating in the aftermath of the war. Featured Crew Anthony Horowitz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  7 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Kitchen DCS Foyle Honeysuckle Weeks Samantha Stewart Full Cast & Crew Last Season Series 9 2015 | 3 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Foyle's War. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  9 Recommendations   2008-11-30 Wallander 7.6    1987-01-06 Inspector Morse 7.7    2000-09-04 Waking the Dead 7.9    2007-02-18 Inspector Lewis 7.6    2000-10-01 Unit One 6.9    2007-01-01 Single-Handed 7.0    1983-09-05 Reilly, Ace of Spies 6.8    1996-03-16 Dalziel and Pascoe 7.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage   http://www.itv.com/drama/classiccrime/foyleswar/ Genres Drama Keywords war world war ii police detective 1940s Content Score 71 Just a little bit more... Top Contributors 27 Elizabeth Jennings 14 Steve 10 edyzaharia 10 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}