{"link": "https://www.themoviedb.org/tv/10938?language=en", "title": "Bob the Builder", "resume": "Bob the Builder is a British children's animated television show created by Keith Chapman. In the original series Bob appears as a building contractor specializing in masonry in a stop motion animated programme with his colleague Wendy, various neighbours and friends, and their gang of anthropomorphised work-vehicles and equipment. The show is broadcast in many countries, but originates from the United Kingdom where Bob is voiced by English actor Neil Morrissey. The show was later created using CGI animation starting with the spin-off series Ready, Steady, Build!.\nIn each episode, Bob and his group help with renovations, construction, and repairs and with other projects as needed. The show emphasizes conflict resolution, co-operation, socialization and various learning skills. Bob's catchphrase is \"Can we fix it?\", to which the other characters respond with \"Yes we can!\" This phrase is also the title of the show's theme song, which was a million-selling number one hit in the UK.", "rate": 54, "genre": ["Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10938   Expand Bob the Builder   (1999) User Score Overview Bob the Builder is a British children's animated television show created by Keith Chapman. In the original series Bob appears as a building contractor specializing in masonry in a stop motion animated programme with his colleague Wendy, various neighbours and friends, and their gang of anthropomorphised work-vehicles and equipment. The show is broadcast in many countries, but originates from the United Kingdom where Bob is voiced by English actor Neil Morrissey. The show was later created using CGI animation starting with the spin-off series Ready, Steady, Build!. In each episode, Bob and his group help with renovations, construction, and repairs and with other projects as needed. The show emphasizes conflict resolution, co-operation, socialization and various learning skills. Bob's catchphrase is \"Can we fix it?\", to which the other characters respond with \"Yes we can!\" This phrase is also the title of the show's theme song, which was a million-selling number one hit in the UK. Featured Crew Keith Chapman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 19 2015 | 1 Episode Season 19 of Bob the Builder premiered on September  1, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  5 Recommendations   1998-08-31 Noddy 5.9    1997-03-31 Teletubbies 2.8    1981-09-16 Postman Pat 6.0    1992-07-20 Bananas in Pyjamas 3.3    1984-10-09 Thomas & Friends 5.3    1991-09-26 Brum 5.2    1986-05-28 Pingu 6.5    1997-10-20 Bear in the Big Blue House 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   http://www.bobthebuilder.com/ Genres Animation Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors R 44 RicoT z 5 zurman1 l 5 longwoo 4 gulon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}