{"link": "https://www.themoviedb.org/tv/40?language=en", "title": "Dallas", "resume": "The world's first mega-soap, and one of the most popular ever produced, Dallas had it all. Beautiful women, expensive cars, and men playing Monopoly with real buildings. Famous for one of the best cliffhangers in TV history, as the world asked \"Who shot J.R.?\" A slow-burner to begin with, Dallas hit its stride in the 2nd season, with long storylines and expert character development. Dallas ruled the airwaves in the 1980's.", "rate": 63, "genre": ["Soap", "Drama"], "cast": ["Larry Hagman", "Patrick Duffy", "Ken Kercheval", "Howard Keel", "Sheree J. Wilson"], "character": ["J.R. Ewing", "Bobby Ewing", "Cliff Barnes", "Clayton Farlow", "April Stevens Ewing"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 40   Expand Dallas   (1978) User Score Overview The world's first mega-soap, and one of the most popular ever produced, Dallas had it all. Beautiful women, expensive cars, and men playing Monopoly with real buildings. Famous for one of the best cliffhangers in TV history, as the world asked \"Who shot J.R.?\" A slow-burner to begin with, Dallas hit its stride in the 2nd season, with long storylines and expert character development. Dallas ruled the airwaves in the 1980's. Featured Crew David Jacobs Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Larry Hagman J.R. Ewing Patrick Duffy Bobby Ewing Ken Kercheval Cliff Barnes Howard Keel Clayton Farlow Sheree J. Wilson April Stevens Ewing Full Cast & Crew Last Season Season 14 1990 | 23 Episodes Season 14 of Dallas premiered on November  2, 1990. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Afton Cooper: Happy Birthday Audrey Landers! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  10 Posters  3 Recommendations   1981-01-12 Dynasty 6.0    1984-09-16 Miami Vice 7.1    1984-09-18 Hunter 7.1    2012-06-13 Dallas 5.8    1974-09-11 Little House on the Prairie 7.0    1974-09-11 Petrocelli 7.8    1979-12-27 Knots Landing 7.7    1976-03-21 Charlie's Angels 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Soap Drama Keywords southern usa texas ranch oil industry Content Score 93 Almost there... Top Contributors 126 Banana 24 Steve d 19 denis 16 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}