{"link": "https://www.themoviedb.org/tv/42253?language=en", "title": "K-ON!", "resume": "Rock n' Roll may never die, but the Sakuragoaka Girl's High School Light Music Club might not be here to stay unless would-be drummer Ritsu Tainaka can find three more members to replace the graduated seniors. Determined to see that the beat goes on, Ritsu can get a little help from her friend Mio Akiyama on bass, and together they might be able to convince choir-inclined Tsumugi Kotobuki to join on the keyboards. But even then, they'll still need a hero, preferably of the juke-box variety with stars in her eyes. Instead they find Yui Hirasawa, who's looking for a club to join and who's never held a guitar in her life. But when Yui does pick up a beat-up six-string, it feels good in her hands, and it doesn't take long to understand that maybe she's finally found a place where she belongs. Because you can't stop the music when four girls share a dream, even if it's something as crazy as someday playing at the famous Budokan. It's going to be a long and winding road, but if they find their passion and follow their muse, they could go anywhere in K-ON!", "rate": 81, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Aki Toyosaki", "Youko Hikasa", "Minako Kotobuki", "Satomi Satou", "Ayana Taketatsu"], "character": ["Yui Hirasawa", "Mio Akiyama", "Tsumugi Kotobuki", "Ritsu Tainaka", "Azusa Nakano"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42253   Expand K-ON!   (2009) User Score Overview Rock n' Roll may never die, but the Sakuragoaka Girl's High School Light Music Club might not be here to stay unless would-be drummer Ritsu Tainaka can find three more members to replace the graduated seniors. Determined to see that the beat goes on, Ritsu can get a little help from her friend Mio Akiyama on bass, and together they might be able to convince choir-inclined Tsumugi Kotobuki to join on the keyboards. But even then, they'll still need a hero, preferably of the juke-box variety with stars in her eyes. Instead they find Yui Hirasawa, who's looking for a club to join and who's never held a guitar in her life. But when Yui does pick up a beat-up six-string, it feels good in her hands, and it doesn't take long to understand that maybe she's finally found a place where she belongs. Because you can't stop the music when four girls share a dream, even if it's something as crazy as someday playing at the famous Budokan. It's going to be a long and winding road, but if they find their passion and follow their muse, they could go anywhere in K-ON! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aki Toyosaki Yui Hirasawa Youko Hikasa Mio Akiyama Minako Kotobuki Tsumugi Kotobuki Satomi Satou Ritsu Tainaka Ayana Taketatsu Azusa Nakano Full Cast & Crew Last Season Season 2 2010 | 27 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  7 Recommendations   2007-04-08 Lucky Star 5.0    2006-04-03 The Melancholy of Haruhi Suzumiya 7.6    2004-10-06 Beck: Mongolian Chop Squad 7.9    2010-10-03 Oreimo 7.1    2011-10-08 Ben-To 7.2    2004-07-10 DearS 5.0    2012-10-09  Girls und Panzer 6.4    2008-10-04 A Certain Magical Index 7.4  Facts Original Name  けいおん! Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.tbs.co.jp/anime/k-on/ Genres Animation Comedy Drama Keywords music slice of life school band music band anime school club iyashikei based on 4-koma Content Score 86 Almost there... Top Contributors 33 WillofOwn t 12 theusedversion 7 sp1ti BA 7 Barbara Ann O'Leary  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}