{"link": "https://www.themoviedb.org/tv/39758?language=en", "title": "Bag of Bones", "resume": "Bestselling novelist Mike Noonan, unable to cope after his wife's sudden death, returns to the couple's lakeside retreat in Maine, where he becomes involved in a custody battle between a young widow and her child's enormously wealthy grandfather. Mike inexplicably receives mysterious ghostly visitations, escalating nightmares and the realization that his late wife still has something to tell him.", "rate": 58, "genre": ["Drama", "Mystery"], "cast": ["Pierce Brosnan", "Melissa George", "Annabeth Gish", "Anika Noni Rose", "Matt Frewer"], "character": ["Mike Noonan", "Mattie Devore", "Jo Noonan", "Sara Tidwell", "Sid Noonan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39758   Expand Bag of Bones   (2011) User Score  Play Trailer Overview Bestselling novelist Mike Noonan, unable to cope after his wife's sudden death, returns to the couple's lakeside retreat in Maine, where he becomes involved in a custody battle between a young widow and her child's enormously wealthy grandfather. Mike inexplicably receives mysterious ghostly visitations, escalating nightmares and the realization that his late wife still has something to tell him. Featured Crew Stephen King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  14 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pierce Brosnan Mike Noonan Melissa George Mattie Devore Annabeth Gish Jo Noonan Anika Noni Rose Sara Tidwell Matt Frewer Sid Noonan Full Cast & Crew Last Season Season 1 2011 | 2 Episodes Season 1 of Bag of Bones premiered on December 11, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  14 Posters  15 Recommendations   1993-05-09 The Tommyknockers 5.1    2008-06-05 Fear Itself 6.9    2001-07-12 Night Visions 6.6    Dennis Miller Live 7.3    2005-10-28 Masters of Horror 6.9    2008-10-09 Life on Mars 6.4    1994-05-08 The Stand 6.8    1999-02-14 Storm of the Century 6.8  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  80m Homepage   http://www.aetv.com/bag-of-bones/ Genres Drama Mystery Keywords lake rape drowning based on novel or book supernatural grave singer murder curse miniseries writer lye novelist ghost Content Score 100 Yes! Looking good! Top Contributors TB 55 TMDb Bot 24 Banana S 20 Spy27 L 17 Lysator  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}