{"link": "https://www.themoviedb.org/tv/75506?language=en", "title": "Here and Now", "resume": "A provocative and darkly comic meditation on the disparate forces polarizing present-day American culture, as experienced by the members of a progressive multi-ethnic family — a philosophy professor and his wife, their adopted children from Vietnam, Liberia and Colombia and their sole biological child — and a contemporary Muslim family, headed by a psychiatrist who is treating one of their children.", "rate": 79, "genre": ["Drama"], "cast": ["Tim Robbins", "Holly Hunter", "Jerrika Hinton", "Daniel Zovatto", "Raymond Lee"], "character": ["Greg", "Audrey Bayer-Boatwright", "Ashley", "Ramón", "Duc"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75506   Expand Here and Now   (2018) User Score  Play Trailer Overview A provocative and darkly comic meditation on the disparate forces polarizing present-day American culture, as experienced by the members of a progressive multi-ethnic family — a philosophy professor and his wife, their adopted children from Vietnam, Liberia and Colombia and their sole biological child — and a contemporary Muslim family, headed by a psychiatrist who is treating one of their children. Featured Crew Alan Ball Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Tim Robbins Greg Holly Hunter Audrey Bayer-Boatwright Jerrika Hinton Ashley Daniel Zovatto Ramón Raymond Lee Duc Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Here and Now premiered on February 11, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply a This show is terrible Open 10 by  Jana Go to Discussions Media Most Popular Videos  3 Backdrops  2 Posters  4 Recommendations   2016-10-16 Eyewitness 7.4    2018-01-02 LA to Vegas 7.0    2016-06-17 The Last Tycoon 7.6    2017-01-25 Mary Kills People 7.5    2016-09-09 One Mississippi 8.1    2018-01-07 The Chi 7.0    2018-01-21 The Resident 7.0    2017-07-05 Snowfall 7.5  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   https://www.hbo.com/here-and-now Genres Drama Keywords dark comedy blended family Content Score 100 Yes! Looking good! Top Contributors 75 Elizabeth Jennings 8 Micael Lopes s 5 speedycars AK 5 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}