{"link": "https://www.themoviedb.org/tv/4493?language=en", "title": "Absolutely Fabulous", "resume": "Set in the world of fashion and PR, immature fun-loving mother Edina Monsoon and her best friend Patsy drive Eddie's sensible daughter, Saffron, up the wall with their constant drug abuse and outrageous selfishness. Numerous in-jokes and heavy doses of cruel humour have made this series a cult hit in the UK and abroad.", "rate": 77, "genre": ["Comedy"], "cast": ["Jennifer Saunders", "Joanna Lumley", "Julia Sawalha", "June Whitfield", "Jane Horrocks"], "character": ["Edina Monsoon", "Patsy", "Saffron", "Mother", "Bubble"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4493   Expand Absolutely Fabulous   (1992) User Score Overview Set in the world of fashion and PR, immature fun-loving mother Edina Monsoon and her best friend Patsy drive Eddie's sensible daughter, Saffron, up the wall with their constant drug abuse and outrageous selfishness. Numerous in-jokes and heavy doses of cruel humour have made this series a cult hit in the UK and abroad. Featured Crew Jennifer Saunders Creator Dawn French Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Saunders Edina Monsoon Joanna Lumley Patsy Julia Sawalha Saffron June Whitfield Mother Jane Horrocks Bubble Full Cast & Crew Last Season Season 6 2011 | 3 Episodes Season 6 of Absolutely Fabulous premiered on December 25, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Patsy Stone: Happy Birthday Joanna Lumley! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations   2004-09-03 Green Wing 8.0    1994-11-10 The Vicar of Dibley 7.3    1987-03-09 French & Saunders 7.4    2008-10-12 Stephen Fry in America 8.0    1999-04-07 Strangers with Candy 7.0    2004-02-16 The Catherine Tate Show 5.5    1987-01-07 Filthy Rich & Catflap 6.7    1996-01-09 3rd Rock from the Sun 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b00jm3ms Genres Comedy Keywords london england self-destruction career woman satire drugs fashion middle age sitcom british humour Content Score 93 Almost there... Top Contributors 20 Banana 9 MrSwift 8 muku555 O 6 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}