{"link": "https://www.themoviedb.org/tv/66939?language=en", "title": "Gypsy", "resume": "The journey of Jean Holloway – a therapist who begins to develop dangerous and intimate relationships with the people in her patients' lives.", "rate": 60, "genre": ["Drama"], "cast": ["Naomi Watts", "Billy Crudup", "Sophie Cookson", "Karl Glusman", "Lucy Boynton"], "character": ["Jean Holloway", "Michael Holloway", "Sidney Pierce", "Sam Duffy", "Allison Adams"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66939   Expand Gypsy   (2017) User Score  Play Trailer Overview The journey of Jean Holloway – a therapist who begins to develop dangerous and intimate relationships with the people in her patients' lives. Featured Crew Lisa Rubin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Naomi Watts Jean Holloway Billy Crudup Michael Holloway Sophie Cookson Sidney Pierce Karl Glusman Sam Duffy Lucy Boynton Allison Adams Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Gypsy premiered on June 30, 2017. View All Seasons Social Reviews  1 Discussions  1 C A review by CourtneyM17  1.0 Written by  CourtneyM17  on August  2, 2017 I feel like this show tried too hard to be edgy. A majority of the show was boring and had uninteresting content. The main character is extremely unlikable and her motives for her actions don't make sense. I wouldn't recommend this show to anyone I know. Read All Reviews Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   2015-09-09 Historia de un Clan 7.6    2016-05-11 Killer Women with Piers Morgan 7.5    2011-08-05 Friends with Benefits 6.1    2017-07-14 Friends from College 6.8    2017-10-13 Lore 6.1    2017-11-05 SMILF 6.7    2017-09-10 The Deuce 7.9    2017-06-15 Riviera 5.4  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  51m Homepage   https://www.netflix.com/title/80095411 Genres Drama Keywords thriller bisexual psychotherapist Content Score 100 Yes! Looking good! Top Contributors 41 Elizabeth Jennings Y 9 YJ 7 joeynotjoe DN 6 Dr No  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}