{"link": "https://www.themoviedb.org/tv/64680?language=en", "title": "The Restoration Man", "resume": "Presented by George Clarke, this series travels up and down the UK to new locations, new restorations and amazing stories of people who have gone to extraordinary lengths to build their dream homes.", "rate": 80, "genre": [], "cast": ["George Clarke"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64680   Expand The Restoration Man   (2010) User Score Overview Presented by George Clarke, this series travels up and down the UK to new locations, new restorations and amazing stories of people who have gone to extraordinary lengths to build their dream homes. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast George Clarke Himself Full Cast & Crew Last Season Season 4 2015 | 10 Episodes Season 4 of The Restoration Man premiered on January  7, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Restoration Man. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.channel4.com/programmes/the-restoration-man/ Genres No genres have been added. Keywords home renovation Content Score 50 Still needs a little work. Top Contributors 18 United600 o 6 obishiro M 4 Maik 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}