{"title": "Perry Mason", "link": "https://trakt.tv/shows/perry-mason", "genre": ["Drama", "Mystery", "Crime", "Family"], "rate": 80, "resume": "There are few actors so closely tied to a persona than Raymond Burr as Perry Mason. This long-running series was built upon Erle Stanley Gardner´s many novels about a brilliant defense lawyer and his staff, that solved many a crime with surprise witnesses and stern cross-examinations.It was the first mystery series to feature chalk or tape outlines to mark the spots where bodies were found. Filmed almost exclusively in the Los Angeles area, Raymond Burr had Gardner's seal of approval in the role. The cases were usually won by way of pivotal confessions of witnesses, solicited by Perry Mason (Burr's) surgeon-like examination or with last-minute, key evidence brought into the courtroom by private investigator, Paul Drake (William Hopper). Della Street (Barbara Hale), Perry´s faithful secretary, was always at Perry's side in the courtroom where hapless Hamilton Burger (William Tallman) was the Los Angeles District Attorney who never seemed to win. As to the myth that Perry Mason never lost, there were 2 episodes where it did occur... but you'll have to watch to find out.The show was revived in 1973-74, with other actors in the familiar roles (Monte Markham as Mason), and then again with the some of the original cast, in a string of feature length TV films from 1985 until Raymond Burr´s death in 1993.", "cast": ["Raymond Burr", "Barbara Hale", "William Hopper", "William Talman", "Ray Collins", "Wesley Lau", "Lee Miller", "George E. Stone", "Don Anderson", "Robert Wegner", "S. John Launer", "Kenneth MacDonald", "Bert Stevens", "Michael Fox", "Pitt Herbert", "Jack Gargan", "Jon Lormer", "Ralph Brooks", "H.M. Wynant", "Karl Held", "Chuck Hamilton", "Les Tremayne", "Dabbs Greer", "Frank Wilcox", "Richard Anderson", "Willis Bouchey"], "character": ["Perry Mason", "Della Street", "Paul Drake", "Hamilton Burger", "Lt. Tragg", "Lt. Andy Anderson", "Sgt. Brice", "Court Clerk", "Courtroom Spectator", "Courtroom Spectator", "Judge", "Judge", "Courtroom Spectator", "Autopsy Surgeon", "Autopsy Surgeon", "Court Clerk", "Autopsy Surgeon", "Courtroom Spectator", "Deputy D.A. Sampson", "David Gideon", "Court Bailiff", "Bernard Daniels", "Bill Cotton", "Judge", "Lt. Steve Drumm", "Judge"]}