{"link": "https://www.themoviedb.org/tv/64710?language=en", "title": "Noragami", "resume": "The world consists of two parts: the near shore and far shore. The near shore is the place where people reside, while the far shore is the place for deities and ayakashi, which are emotional fragments that can posses humans and cause trouble. So it is a deity's responsibility to remove those ayakashi from the near shore with the help of weapons called Shinki, made from the spirits of dead people.\nYato is a minor deity of war without shrine. Together with his Shinki, Tomone, he runs a Delivery Wish Granting Service, granting wishes for only 5 yen. After his Shinki leaves him on less than agreeable terms, he decides to run simple errands that do not involve ayakashi-related matters. While on a mission to find a lost kitten, he is nearly hit by a bus, but saved by a girl named Iki Hiyori. Hiyori dies for a moment, but then comes back to life. This, however, causes Hiyori's soul to become unstable, leaving her body frequently. So by offering 5 yen, she asks Yato to fix her body... but Yato cannot help without a Shinki, so Hiyori accompanies him on his journey to find one, in the hopes of becoming normal again. But behind Yato's kind-hearted face lies a twisted past...", "rate": 74, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Hiroshi Kamiya", "Yuuki Kaji", "Maaya Uchida", "Miyuki Sawashiro", "Aki Toyosaki"], "character": ["Yato (voice)", "Yukine (voice)", "Hiyori Iki (voice)", "Bishamon (voice)", "Kofuku (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64710   Expand Noragami   (2014) User Score Overview The world consists of two parts: the near shore and far shore. The near shore is the place where people reside, while the far shore is the place for deities and ayakashi, which are emotional fragments that can posses humans and cause trouble. So it is a deity's responsibility to remove those ayakashi from the near shore with the help of weapons called Shinki, made from the spirits of dead people. Yato is a minor deity of war without shrine. Together with his Shinki, Tomone, he runs a Delivery Wish Granting Service, granting wishes for only 5 yen. After his Shinki leaves him on less than agreeable terms, he decides to run simple errands that do not involve ayakashi-related matters. While on a mission to find a lost kitten, he is nearly hit by a bus, but saved by a girl named Iki Hiyori. Hiyori dies for a moment, but then comes back to life. This, however, causes Hiyori's soul to become unstable, leaving her body frequently. So by offering 5 yen, she asks Yato to fix her body... but Yato cannot help without a Shinki, so Hiyori accompanies him on his journey to find one, in the hopes of becoming normal again. But behind Yato's kind-hearted face lies a twisted past... Featured Crew Koutarou Tamura Creator 黄向阳 Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hiroshi Kamiya Yato (voice) Yuuki Kaji Yukine (voice) Maaya Uchida Hiyori Iki (voice) Miyuki Sawashiro Bishamon (voice) Aki Toyosaki Kofuku (voice) Full Cast & Crew Last Season Noragami Aragoto 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2015-10-07 Beautiful Bones: Sakurako’s Investigation 6.3    2011-04-17 Blue Exorcist 7.7    2016-04-01 The Lost Village 4.3    2010-01-08 Durarara!! 7.4    2016-07-02 ReLIFE 7.0    2015-01-10 Death Parade 7.3    2016-01-16 Ajin 6.4    2008-10-02 Toradora! 7.5  Facts Original Name  ノラガミ Status  Ended Networks Certification 14 Meaning Content suitable for viewers over the age of 14. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://noragami-anime.net/ Genres Animation Sci-Fi & Fantasy Keywords japan based on manga Content Score 93 Almost there... Top Contributors 24 deibiddochan 15 Flexx7000 J 13 JessicaBeatriz 11 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}