{"title": "The Professionals", "link": "https://trakt.tv/shows/the-professionals", "genre": ["Drama", "Action", "Adventure", "Crime"], "rate": 83, "resume": "The Professionals (1977 - 1983) - \"Anarchy, acts of terror, crimes against the public. To combat it I've got special men - experts from the Army, the Police - from every service. These are The Professionals.\" - George Cowley.The Professionals was one of British television's most popular and successful action series of the 1970s and 80s. At their peak in 1980 The Pros were earning as many as 17.6 million viewers. The Professionals began life in early 1977, provisionally titled The A-Squad, in an idea conceived by Brian Clemens, the then head of the independent TV company Avengers Mark I Productions. His aim was to create a rival for Thames television's hugely successful long-running police series The Sweeney. Bodie, Doyle and Cowley could have looked very different to how we remember them as. A number of very different actors were considered for the three central roles, with neither of the final chosen team being the original choices. The final three were more or less drafted in when the first choice stars either declined or were axed. Gordon Jackson (formerly the distinctly unmenacing Butler Hudson in Upstairs Downstairs) and Martin Shaw (whose first TV appearance was as a hippie in 1960s Coronation Street) were first to be cast. During the filming of the first episode, Old Dog with New Tricks Bodie was in fact played by Anthony Andrews. Unfortunately, old mates Shaw and Andrews spent much of the time cracking up with laughter - hardly a recipe for ensuring the renowned edgy banter between the two leads. Lewis Collins (best known by this time as Gavin Rumsey in comedy series The Cuckoo Waltz) was brought in to play Bodie, with Andrews being given the heave-ho. Collins and Shaw had previously worked together just months earlier in an episode of The New Avengers, and were cast alongside each other again thanks to the 'sparky, abrasive' on-screen partnership that they generated. In other words, they didn't particularly like each other! But with the central cast complete, filming began on 20 June 1977, with the first episode Private Madness Public Danger debuting on Friday 30 December 1977. Criminal Intelligence 5 The basis of The Professionals was CI5 - Criminal Intelligence 5 - an organisation lead by surly Scotsman George Cowley (played by Gordon Jackson), a former MI5 head who founded the team as an 'umbrella organisation' to help alleviate London's ever-increasing level of criminal activity. CI5 consisted of up to forty men and women agents, but the main action was centred around Cowley's two top operatives; William Andrew Philip Bodie (Agent 3.7) and Raymond Doyle (4.5). Bodie (Lewis Collins) - he of the close-cropped hair, polo necks and smart suits - was a mercenary in Africa, who deserted the Merchant Navy to join the Paras and later the SAS, before being signed up to CI5 by Cowley. He was, on the surface, an uncompromising thug with a penchant for the 'hit first, ask questions later' theory - thinking nothing of causing 'damage' to a suspect if it meant getting the right results. Doyle (Martin Shaw) was a former Docklands Police Constable, and his more placid nature was reflected in his memorable bubble-perm hairstyle and casual clothing attire (i.e. old plaid jackets and skintight jeans). However, he possessed a tougher streak to match that of Bodie if ever riled by a particularly awkward suspect. Chalk and Cheese The show's major appeal lay in its well-balanced mix of strong acting and direction, coupled with Bodie and Doyle's sparky partnership and chalk-and-cheese personalities. Cowley's preoccupation with pure malt scotch and occasional bullet-wound limp were also a source of amusement for the Lads, but overall they each viewed one another with a great mutual respect. The fifty-seven episode run produced a great variety of gripping plots, most notably the destruction of a German terrorist group in Close Quarters, the testing of a potentially deadly laser gun in Hunter Hunted, a supposed crime-free town masking a squad of corrupt policeman in In the Public Interest and the trial of CI5 in The Rack to name but a few. Like any show, however, there were a number of dodgy episodes to contend with, the chief honour going to The Gun and Blood Sports during the generally below-par fourth season. Banned! The Professionals wasn't without controversy, though - and no, we don't mean Martin Shaw's hair (which was, amazingly, his own idea!). Klansmen, the thirteenth (unlucky for some?) and final episode was banned and remains unaired in the UK even to this day because it dealt with the subject of racism. Only now with the DVD release will British fans be able to see the episode for themselves. Eventually Lewis and Martin quit the series in 1981 when their four-year contracts expired and although Gordon was said to have been happy to continue, it was decided not to cast a set of new characters because of Lewis and Martin's popularity. However, both had become tired of the monotony of playing their characters - least of all Martin, who had begun to express his dislike of playing 'violent puppet' Doyle at approximately six weeks into the role! Filming was quickly wrapped up with Spy Probe in mid-1981, but due to several ITV strike disputes in the late 1970s, several episodes were held back and the fifth season did not begin transmission until November 1982. The final edition, No Stone was broadcast on Sunday 6 February 1983. Martin allegedly barred any further repeats being broadcast on British terrestrial TV until 1992 and now the only UK-based channel that regularly screens re-runs is satellite station Granada Plus, albeit with a ridiculous series of censorship rules in place (of course, to conceal unnecessary violence we assume, not to make way for more washing powder adverts). Then and Now The Professionals will forever be remembered for sparking such hard-hitting debate as: who was the best looking, Bodie or Doyle? (for the women), who had the smartest motor? (for the blokes) and who was going to be the first victim to be injured by Doyle's erupting perm? (for those mourning the demise of decent hairstyles as the Seventies kicked in). Since the series ended more than twenty years ago, the cast have had mixed fortunes in their careers. Gordon Jackson continued to work successfully in a number of high-profile film and TV roles until he very sadly passed away in 1990, at the age of 66. Martin Shaw appeared in The Chief and Rhodes in the mid-1990s, and has recently made a comeback to prime-time television, with starring roles in A&E and Judge John Deed. In 2003 he became the new face of P.D James' long-running detective, Adam Dalgliesh. Lewis Collins unfortunately fell victim to the dreaded typecasting, appearing in a series of ill-advised foreign action movies in the 1980s (although we rather liked Who Dares Wins!) His most recent UK TV appearances were in Cluedo - a thankfully now defunct quiz show presented by the likes of Richard Madeley - in 1991 and a cameo appearance in the dodgy ITV1 'comedy' series The Grimleys in 1999. He has spent the past few years concentrating on theatre work, including a role in the thriller Dangerous Corner, also in 1999. In 2002 Lewis guest-starred in an episode of police series The Bill. The New Professionals The series was revived in 1999, now under the very imaginative alias of The New Professionals. At first it was thought Lewis Collins would be making a comeback appearance, with Bodie being elevated to the position vacated by Cowley, but negotiations for this later fell through. Martin Shaw, on the other hand, was 'not invited' to reprise his role. Interest in the show was less than forthcoming; the first series being pushed into a rather unsociable time slot on the satellite channel Sky One. It now seems unlikely that another season will be made. Over the past decade there has been a renewed interest for The Professionals and all things retro. The memorable 1996 Nissan Car advertisement (\"This car's well-sprung\" / \"A bit like your hair!\") and the release of all 57 episodes on DVD in 2002, will ensure that the show is likely to gain a whole new generation of fans following its Silver Jubilee year.", "cast": ["Martin Shaw", "Gordon Jackson", "Lewis Collins", "Bridget Brice", "Steve Alder", "Patrick Gorman"], "character": ["Doyle", "George Cowley", "Bodie", "Betty, Cowley's secretary", "Murphy", "CI5 Agent"]}