{"link": "https://www.themoviedb.org/tv/11370?language=en", "title": "Britain's Got Talent", "resume": "Britain's Got Talent is a reality talent show hosted by Ant and Dec. Anyone of any age with some sort of talent can audition for the show. Throughout the show, contestants must perform in front of the judges. Acts compete against each other in order to gain the audience support while trying to win the title of \"The winner of Britain's Got Talent\". The winner is given the opportunity to perform at the Royal Variety Performance in front of members of the British Royal Family. The winner also receives a cash prize, which from series 1 to 5 was £100,000, but was increased to £500,000 in series 6 and then lowered to £250,000 in series 7.", "rate": 45, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11370   Expand Britain's Got Talent   (2007) User Score  Play Trailer Overview Britain's Got Talent is a reality talent show hosted by Ant and Dec. Anyone of any age with some sort of talent can audition for the show. Throughout the show, contestants must perform in front of the judges. Acts compete against each other in order to gain the audience support while trying to win the title of \"The winner of Britain's Got Talent\". The winner is given the opportunity to perform at the Royal Variety Performance in front of members of the British Royal Family. The winner also receives a cash prize, which from series 1 to 5 was £100,000, but was increased to £500,000 in series 6 and then lowered to £250,000 in series 7. Featured Crew Simon Cowell Creator Ken Warwick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 12 2018 | 18 Episodes Season 12 of Britain's Got Talent premiered on April 14, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   Soccer Saturday 6.5    2009-08-24 Pointless 6.9    2004-09-04 The X Factor 4.1    1982-11-02 Countdown 5.4    1979-03-24 Tales of the Unexpected 6.8    1973-02-15 Some Mothers Do 'Ave 'Em 7.8    2011-09-21 Fresh Meat 7.2    2012-08-14 Bad Education 7.5  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.itv.com/talent Genres Reality Keywords No keywords have been added. Content Score 71 Just a little bit more... Top Contributors 19 klubesocial 10 Ash 8 oldboy3 5 szab  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}