{"link": "https://www.themoviedb.org/tv/10620?language=en", "title": "The Adventures of Maya the Honey Bee", "resume": "Maya the Bee is an anime television series produced by Zuiyo Enterprise in Japan. The series consisted of 52 episodes and was originally telecast across Japan from April 1975 to April 1976 on the TV Asahi network. Based on the classic children's book Maya the Bee by Waldemar Bonsels, the anime series has become extremely popular in Europe and has been rebroadcast in countries and languages all around the world since its premiere.\nTwo English-dubbed versions of the series exist, a British version, using a translated version of the original theme tune, and featuring British accents for the characters; and a United States version with an entirely new theme tune, produced by Saban Entertainment, which was broadcast from January 1, 1990 to December 31, 1992 on the children's television channel Nickelodeon. Maya the Bee aired alongside other juvenile-targeted anime such as Adventures of the Little Koala, Noozles and The Littl' Bits as part of Nickelodeon's Nick Jr. block of programming for young children.\nA second Maya the Bee series, Shin Mitsubachi Māya no Bōken, was a co-production made in 1979 by Wako Productions and Austrian/German Apollo Film, Wien. The second series first premiered in Germany from September 1979 to September 1980. The very different and cartoon-like second series, which lasted for 52 episodes, wasn't very popular and did not premiere in Japan until October 1982, on TV Osaka, and aired through September 1983. Ten episodes from this series were added to 45 from the original for the U.S. broadcast run, bringing the total of Maya episodes aired on Nickelodeon in the U.S. to 55.", "rate": 70, "genre": ["Action", "Adventure", "Animation"], "cast": ["Lorley Katz", "Scarlet Cavadenti", "Eberhard Storeck", "Tilli Breidenbach", "Harald Baerow"], "character": ["Kassandra, Fräulein Nelly, die Grille", "Maja", "Willi", "Spinne Thekla", "Stubenfliege Puck"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10620   Expand The Adventures of Maya the Honey Bee   (1975) User Score Overview Maya the Bee is an anime television series produced by Zuiyo Enterprise in Japan. The series consisted of 52 episodes and was originally telecast across Japan from April 1975 to April 1976 on the TV Asahi network. Based on the classic children's book Maya the Bee by Waldemar Bonsels, the anime series has become extremely popular in Europe and has been rebroadcast in countries and languages all around the world since its premiere. Two English-dubbed versions of the series exist, a British version, using a translated version of the original theme tune, and featuring British accents for the characters; and a United States version with an entirely new theme tune, produced by Saban Entertainment, which was broadcast from January 1, 1990 to December 31, 1992 on the children's television channel Nickelodeon. Maya the Bee aired alongside other juvenile-targeted anime such as Adventures of the Little Koala, Noozles and The Littl' Bits as part of Nickelodeon's Nick Jr. block of programming for young children. A second Maya the Bee series, Shin Mitsubachi Māya no Bōken, was a co-production made in 1979 by Wako Productions and Austrian/German Apollo Film, Wien. The second series first premiered in Germany from September 1979 to September 1980. The very different and cartoon-like second series, which lasted for 52 episodes, wasn't very popular and did not premiere in Japan until October 1982, on TV Osaka, and aired through September 1983. Ten episodes from this series were added to 45 from the original for the U.S. broadcast run, bringing the total of Maya episodes aired on Nickelodeon in the U.S. to 55. Featured Crew Waldemar Bonsels Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  4 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lorley Katz Kassandra, Fräulein Nelly, die Grille Scarlet Cavadenti Maja Eberhard Storeck Willi Tilli Breidenbach Spinne Thekla Harald Baerow Stubenfliege Puck Full Cast & Crew Last Season Season 2 1979 | 52 Episodes Season 2 of The Adventures of Maya the Honey Bee premiered on September  1, 1979. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for The Adventures of Maya the Honey Bee. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  10 Recommendations   1974-01-06 Heidi, Girl of the Alps 7.3    1983-10-10 Alice in Wonderland 5.6    1974-04-03 Vicky the Viking 6.1    1971-03-07 Die Sendung mit der Maus 6.4    1986-05-28 Pingu 6.5    1983-10-13 Captain Tsubasa 7.0    1999-09-06 Sabrina: The Animated Series 5.5    1975-09-06 The Tom and Jerry Show 7.6  Facts Original Name  みつばちマーヤの冒険 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.nippon-animation.co.jp/work/907/ Genres Action & Adventure Animation Keywords animation Content Score 93 Almost there... Top Contributors 36 SuperMario 14 Elizabeth Jennings d 8 denis P 8 Prototyp206  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}