{"link": "https://www.themoviedb.org/tv/4232?language=en", "title": "Top Cat", "resume": "Top Cat is a Hanna-Barbera prime time animated television series which ran from November 26, 1961 to April 18, 1962 for a run of 30 episodes on the ABC network. Reruns are played on Cartoon Network's classic animation network Boomerang.", "rate": 71, "genre": ["Animation", "Family", "Comedy"], "cast": ["Leo De Lyon", "Allen Jenkins", "Arnold Stang", "Maurice Gosfield", "Marvin Kaplan"], "character": ["Spook", "Officer Charlie Dibble", "Top Cat", "Benny the Ball", "Choo Choo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4232   Expand Top Cat   (1961) User Score Overview Top Cat is a Hanna-Barbera prime time animated television series which ran from November 26, 1961 to April 18, 1962 for a run of 30 episodes on the ABC network. Reruns are played on Cartoon Network's classic animation network Boomerang. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  1 Top Billed Cast Leo De Lyon Spook Allen Jenkins Officer Charlie Dibble Arnold Stang Top Cat Maurice Gosfield Benny the Ball Marvin Kaplan Choo Choo Full Cast & Crew Last Season Season 1 1961 | 30 Episodes Season 1 of Top Cat premiered on September 27, 1961. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply M Officer Dibble...Officer Dib-buulllllllllll Open 1 by  genplant29 Go to Discussions Media Most Popular Videos  2 Backdrops  4 Posters  5 Recommendations   1962-09-23 The Jetsons 6.6    1968-09-14 Wacky Races 7.1    1960-11-14 Popeye the Sailor 5.8    1964-12-18 The Pink Panther Show 7.0    1958-10-02 The Huckleberry Hound Show 7.0    1960-09-30 The Flintstones 7.0    1983-09-10 Inspector Gadget 6.6    1988-09-17 Garfield and Friends 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Animation Family Comedy Keywords police cat surrealism police officer cartoon cat tip top tolek cacek Content Score 100 Yes! Looking good! Top Contributors 25 erikraul31 17 Konrad 14 Banana 10 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}