{"link": "https://www.themoviedb.org/tv/57706?language=en", "title": "Ranma ½", "resume": "Saotome Ranma, a teenage martial artist, and his father Genma travel to the 'cursed training ground' of Jusenkyo in China. There, despite the warnings of the Chinese guard, they fall into the cursed springs. From now on, whenever Ranma is doused in cold water, he turns in to a girl, and a cute, well-built red-head at that. Hot water changes him back into a man again, but only until the next time. To make matters worse, his father engages him to Tendo Akane, a girl who hates boys.", "rate": 78, "genre": ["Comedy", "Action", "Adventure", "Animation"], "cast": ["Miyoko Asō", "Minami Takayama", "Noriko Hidaka", "Kouichi Yamadera", "Saeko Shimazu"], "character": ["Cologne", "Nabiki Tendo", "Akane Tendo", "Ryoga Hibiki", "Kodachi Kuno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 57706   Expand Ranma ½   (1989) User Score Overview Saotome Ranma, a teenage martial artist, and his father Genma travel to the 'cursed training ground' of Jusenkyo in China. There, despite the warnings of the Chinese guard, they fall into the cursed springs. From now on, whenever Ranma is doused in cold water, he turns in to a girl, and a cute, well-built red-head at that. Hot water changes him back into a man again, but only until the next time. To make matters worse, his father engages him to Tendo Akane, a girl who hates boys. Featured Crew Rumiko Takahashi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  10 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyoko Asō Cologne Minami Takayama Nabiki Tendo Noriko Hidaka Akane Tendo Kouichi Yamadera Ryoga Hibiki Saeko Shimazu Kodachi Kuno Full Cast & Crew Last Season Season 7 1992 | 25 Episodes Season 7 of Ranma ½ premiered on April 10, 1992. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  2 Recommendations   2003-10-04 Rumbling Hearts 8.0    2011-04-15 Anohana: The Flower We Saw That Day 7.6    2000-10-15 InuYasha 7.4    2010-04-22 The Tatami Galaxy 8.7    1964-12-18 The Pink Panther Show 7.0    1991-04-26 Dinosaurs 7.2    2009-07-03 Monogatari 7.7    2008-10-02 Toradora! 7.5  Facts Original Name  らんま½ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.furinkan.com/ranma/ Genres Comedy Action & Adventure Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors r 20 rakrak123 d 16 denis p 11 psy4trik 10 Kijung Kim  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}