{"link": "https://www.themoviedb.org/tv/3162?language=en", "title": "Hart to Hart", "resume": "Hart to Hart is an American television series, starring Robert Wagner and Stefanie Powers as Jonathan and Jennifer Hart, a wealthy couple who moonlight as amateur detectives. The series was created by writer Sidney Sheldon and produced by Aaron Spelling and Leonard Goldberg. It ran from 1979 to 1984 on the ABC Television Network.", "rate": 70, "genre": ["Action", "Adventure", "Drama", "Mystery"], "cast": ["Lionel Stander", "Stefanie Powers", "Robert Wagner"], "character": ["Max the butler", "Jennifer Hart", "Jonathan Hart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3162   Expand Hart to Hart   (1979) User Score Overview Hart to Hart is an American television series, starring Robert Wagner and Stefanie Powers as Jonathan and Jennifer Hart, a wealthy couple who moonlight as amateur detectives. The series was created by writer Sidney Sheldon and produced by Aaron Spelling and Leonard Goldberg. It ran from 1979 to 1984 on the ABC Television Network. Featured Crew Sidney Sheldon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lionel Stander Max the butler Stefanie Powers Jennifer Hart Robert Wagner Jonathan Hart Full Cast & Crew Last Season Season 5 1983 | 22 Episodes Season 5 of Hart to Hart premiered on September 27, 1983. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1970-09-16 McCloud 7.0    1973-10-24 Kojak 7.4    1967-03-28 Ironside 6.8    1974-01-18 The Six Million Dollar Man 6.6    1976-10-03 Quincy, M.E. 7.0    1981-11-24 Simon & Simon 6.6    1976-01-14 The Bionic Woman 6.2    1971-01-05 Alias Smith and Jones 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Mystery Keywords amateur detective Content Score 64 We're so close, yet so far. Top Contributors 15 lineker 7 Banana m 5 mode2 m 4 mccalimero62  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}