{"link": "https://www.themoviedb.org/tv/903?language=en", "title": "Black Books", "resume": "Black Books centres around the foul tempered and wildly eccentric bookshop owner Bernard Black. Bernard’s devotion to the twin pleasures of drunkenness and wilful antagonism deepens and enriches both his life and that of Manny, his assistant. Bearded, sweet and good, Manny is everything that Bernard isn’t and is punished by Bernard relentlessly just for the crime of existing. They depend on each other for meaning as Fran, their oldest friend, depends on them for distraction.\nBlack Books is a haven of books, wine and conversation, the only threat to the group’s peace and prosperity is their own limitless stupidity.", "rate": 82, "genre": ["Comedy"], "cast": ["Dylan Moran", "Bill Bailey", "Tamsin Greig"], "character": ["Bernard", "Manny", "Fran"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 903   Expand Black Books   (2000) User Score  Play Trailer Overview Black Books centres around the foul tempered and wildly eccentric bookshop owner Bernard Black. Bernard’s devotion to the twin pleasures of drunkenness and wilful antagonism deepens and enriches both his life and that of Manny, his assistant. Bearded, sweet and good, Manny is everything that Bernard isn’t and is punished by Bernard relentlessly just for the crime of existing. They depend on each other for meaning as Fran, their oldest friend, depends on them for distraction. Black Books is a haven of books, wine and conversation, the only threat to the group’s peace and prosperity is their own limitless stupidity. Featured Crew Dylan Moran Creator Graham Linehan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  1 Teasers  1 Clips  5 Featurettes  0 Opening Credits  0 Top Billed Cast Dylan Moran Bernard Bill Bailey Manny Tamsin Greig Fran Full Cast & Crew Last Season Season 3 2004 | 6 Episodes Season 3 of Black Books premiered on March 11, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  7 Backdrops  9 Posters  5 Recommendations   1999-09-24 Spaced 8.1    1995-04-21 Father Ted 7.9    2006-02-03 The IT Crowd 8.2    2004-05-18 The Mighty Boosh 7.5    2005-07-21 Extras 7.8    1975-09-19 Fawlty Towers 8.1    2001-07-09 The Office 8.1    2004-09-03 Green Wing 8.0  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.channel4.com/programmes/black-books/ Genres Comedy Keywords london england surreal eccentric book store british comedy sitcom british humour workplace comedy Content Score 71 Just a little bit more... Top Contributors 21 gravypod M 16 MAthePA 11 Banana TB 7 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}