{"link": "https://www.themoviedb.org/tv/68901?language=en", "title": "Leah Remini: Scientology and the Aftermath", "resume": "Leah Remini, along with high level former Scientology executives and Church members, explores individual accounts from ex-Church members and their families through meetings and interviews with Leah. Each episode features stories from former members whose lives have been affected by the Church's harmful practices, even well after they left the organization.", "rate": 82, "genre": ["Documentary"], "cast": ["Leah Remini", "Mike Rinder"], "character": ["Herself - Host", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68901   Expand Leah Remini: Scientology and the Aftermath   (2016) User Score  Play Trailer Overview Leah Remini, along with high level former Scientology executives and Church members, explores individual accounts from ex-Church members and their families through meetings and interviews with Leah. Each episode features stories from former members whose lives have been affected by the Church's harmful practices, even well after they left the organization. Featured Crew Leah Remini Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Leah Remini Herself - Host Mike Rinder Himself Full Cast & Crew Last Season Season 2 2017 | 13 Episodes Season 2 of Leah Remini: Scientology and the Aftermath premiered on August 15, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply The more I watch, the more horrific stories.  Season 2 Open 1 by  Horus Mazinga Leah is such a fake person Open 2 by  AusFem Two-hour  special Monday, May 29 from 9 pm to 11 pm ET/PT,  A&E Network Open 2 by  AusFem Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations   2011-05-07 My Cat from Hell 6.4    2014-09-28 This Is Life with Lisa Ling 6.4    2006-03-12 Big Love 7.6    1997-03-04 Just Shoot Me! 6.4    2002-09-26 Without a Trace 6.8    1988-10-18 Roseanne 6.7    2010-09-20 The Event 6.2    2017-03-05 FEUD 7.9  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Documentary Original Language  English Runtime  47m Homepage   http://www.aetv.com/shows/leah-remini-scientology-and-the-aftermath Genres Documentary Keywords investigation scientology Content Score 71 Just a little bit more... Top Contributors 43 Elizabeth Jennings 27 animerika 6 BlackDelivery AD 5 Alfredo Doglas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}