{"link": "https://www.themoviedb.org/tv/634?language=en", "title": "Who's the Boss?", "resume": "Who's the Boss? is an American sitcom created by Martin Cohan and Blake Hunter, which aired on ABC from September 20, 1984 to April 25, 1992. Produced by Embassy Television, in association with Hunter-Cohan Productions, and Columbia Pictures Television, the series starred Tony Danza as a retired major league baseball player who relocates to Fairfield, Connecticut to work as a live-in housekeeper for a divorced advertising executive, played by Judith Light. Also featured were Alyssa Milano, Danny Pintauro, and Katherine Helmond.\nThe show received positive reviews throughout most of its run, becoming one of the most popular sitcoms of the mid-to-late-1980s. The series was nominated for more than forty awards, including ten Primetime Emmy Award and five Golden Globe Award nominations, winning each one. Also very successful in the ratings, Who's the Boss? consistently ranked in the top ten in the final primetime ratings between the years of 1985 and 1989, and has since continued in syndication worldwide.", "rate": 67, "genre": ["Comedy"], "cast": ["Alyssa Milano", "Katherine Helmond", "Danny Pintauro", "Judith Light", "Tony Danza"], "character": ["Samantha Micelli", "Mona Robinson", "Jonathan Bower", "Angela Bower", "Tony Micelli"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 634   Expand Who's the Boss?   (1984) User Score Overview Who's the Boss? is an American sitcom created by Martin Cohan and Blake Hunter, which aired on ABC from September 20, 1984 to April 25, 1992. Produced by Embassy Television, in association with Hunter-Cohan Productions, and Columbia Pictures Television, the series starred Tony Danza as a retired major league baseball player who relocates to Fairfield, Connecticut to work as a live-in housekeeper for a divorced advertising executive, played by Judith Light. Also featured were Alyssa Milano, Danny Pintauro, and Katherine Helmond. The show received positive reviews throughout most of its run, becoming one of the most popular sitcoms of the mid-to-late-1980s. The series was nominated for more than forty awards, including ten Primetime Emmy Award and five Golden Globe Award nominations, winning each one. Also very successful in the ratings, Who's the Boss? consistently ranked in the top ten in the final primetime ratings between the years of 1985 and 1989, and has since continued in syndication worldwide. Featured Crew Blake Hunter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  6 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alyssa Milano Samantha Micelli Katherine Helmond Mona Robinson Danny Pintauro Jonathan Bower Judith Light Angela Bower Tony Danza Tony Micelli Full Cast & Crew Last Season Season 8 1991 | 24 Episodes Season 8 of Who's the Boss? premiered on September 28, 1991. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Mona Robinson: Happy Birthday Katherine Helmond! Open 0 by wonder2wonder\n      \n     M Jonathan Open 0 by MoviesBringUsTogether\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   1982-09-22 Family Ties 7.0    1970-09-16 McCloud 7.0    1984-09-20 The Cosby Show 6.8    1979-08-24 The Facts of Life 5.8    1984-09-19 Highway to Heaven 6.1    1986-03-25 Perfect Strangers 6.6    1983-09-16 Webster 4.9    1989-02-28 Coach 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors b 11 bugfix 10 Elizabeth Jennings w 4 waterhorse s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}