{"link": "https://www.themoviedb.org/tv/12888?language=en", "title": "Italian Bride", "resume": "Muchacha italiana viene a casarse is a 1971 Mexican telenovela by Televisa produced by Ernesto Alonso and directed by Alfredo Saldaña, starring Angélica María and Ricardo Blume. Writing credits belong to Delia González Marquez, Fernanda Villeli, Marissa Garrido, Miguel Sabido and Carlos Lozano Dana\nThe series featured two theme songs: \"A dónde va nuestro amor\" and \"Lo que sabemos del amor\". Both songs were written by Eduardo Magallanes and performed by Angélica María.", "rate": 72, "genre": ["Drama"], "cast": ["Livia Brito Pestana", "José Ron", "Ela Velden", "Mike Biaggio", "José Pablo Minor"], "character": ["Fiorella Bianchi", "Pedro Ángeles", "Gianna Bianchi", "Osvaldo Ángeles", "Gael Ángeles"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12888   Expand Italian Bride   (2014) User Score  Play Trailer Overview Muchacha italiana viene a casarse is a 1971 Mexican telenovela by Televisa produced by Ernesto Alonso and directed by Alfredo Saldaña, starring Angélica María and Ricardo Blume. Writing credits belong to Delia González Marquez, Fernanda Villeli, Marissa Garrido, Miguel Sabido and Carlos Lozano Dana The series featured two theme songs: \"A dónde va nuestro amor\" and \"Lo que sabemos del amor\". Both songs were written by Eduardo Magallanes and performed by Angélica María. Featured Crew Delia González Márquez Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Livia Brito Pestana Fiorella Bianchi José Ron Pedro Ángeles Ela Velden Gianna Bianchi Mike Biaggio Osvaldo Ángeles José Pablo Minor Gael Ángeles Full Cast & Crew Last Season Muchacha italiana viene a casarse 2014 | 89 Episodes Season 1 of Italian Bride premiered on October 20, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Italian Bride. You can help by rating TV shows you've seen. Facts Original Name  Muchacha italiana viene a casarse Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 45m Homepage   http://www.televisa.com/telenovelas/muchacha-italiana-viene-a-casarse/ Genres Drama Keywords love telenovela Content Score 100 Yes! Looking good! Top Contributors V 52 Vaine z 10 zurman1 s 5 shiff7 CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}