{"link": "https://www.themoviedb.org/tv/1777?language=en", "title": "Boy Meets World", "resume": "Boy Meets World is an American television sitcom that chronicles the coming of age events and everyday life-lessons of Cory Matthews, a Philadelphian who grows up from a young boy to a married man. The show aired for seven seasons from 1993 to 2000 on ABC, part of the network's TGIF lineup. The entire series has been released on DVD, as well as on iTunes.", "rate": 77, "genre": ["Drama", "Comedy"], "cast": ["Ben Savage", "William Daniels", "Rider Strong", "Betsy Randle", "Will Friedle"], "character": ["Cory Matthews", "George Feeny", "Shawn Hunter", "Amy Matthews", "Eric Matthews"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1777   Expand Boy Meets World   (1993) User Score Overview Boy Meets World is an American television sitcom that chronicles the coming of age events and everyday life-lessons of Cory Matthews, a Philadelphian who grows up from a young boy to a married man. The show aired for seven seasons from 1993 to 2000 on ABC, part of the network's TGIF lineup. The entire series has been released on DVD, as well as on iTunes. Featured Crew Michael Jacobs Creator April Kelly Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ben Savage Cory Matthews William Daniels George Feeny Rider Strong Shawn Hunter Betsy Randle Amy Matthews Will Friedle Eric Matthews Full Cast & Crew Last Season Season 7 1999 | 23 Episodes View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply g Savages Wonder Years or Boy meets world ? Open 0 by gspgreases\n      \n     w Cory: Happy birthday Ben Savage! Open 0 by wonder2wonder\n      \n     w Eric Matthews: Happy Birthday Will Friedle! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1989-09-22 Family Matters 6.2    1991-09-17 Home Improvement 7.0    1989-08-20 Saved by the Bell 6.2    1985-09-24 Growing Pains 6.1    1987-09-22 Full House 5.9    1995-09-13 The Drew Carey Show 6.4    2001-11-14 The Bernie Mac Show 5.7    1994-04-01 Sister, Sister 5.9  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m, 30m, 24m Homepage  - Genres Drama Comedy Keywords philadelphia family relationships coming of age growing up school sitcom life lessons Content Score 93 Almost there... Top Contributors R 7 Rebecca m 7 mode2 5 Banana 5 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}