{"link": "https://www.themoviedb.org/tv/1895?language=en", "title": "Jonathan Creek", "resume": "Jonathan Creek follows the story of Madeline Magellan, an investigative journalist. Like most journalists, she sticks her nose in where it isn't wanted, but this is what makes her such a great journalist! While writing a piece about the death of a prominent artist, she happens across a man named Jonathan Creek. Jonathan makes a living inventing magical tricks for magician Adam Klaus, and has a brilliantly lateral mind.", "rate": 77, "genre": ["Comedy", "Drama", "Mystery"], "cast": ["Alan Davies", "Caroline Quentin", "Stuart Milligan", "Julia Sawalha"], "character": ["Jonathan Creek", "Maddie Magellan", "Adam Klaus"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1895   Expand Jonathan Creek   (1997) User Score  Play Trailer Overview Jonathan Creek follows the story of Madeline Magellan, an investigative journalist. Like most journalists, she sticks her nose in where it isn't wanted, but this is what makes her such a great journalist! While writing a piece about the death of a prominent artist, she happens across a man named Jonathan Creek. Jonathan makes a living inventing magical tricks for magician Adam Klaus, and has a brilliantly lateral mind. Featured Crew David Renwick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Davies Jonathan Creek Caroline Quentin Maddie Magellan Stuart Milligan Adam Klaus Julia Sawalha Full Cast & Crew Last Season Season 5 2014 | 4 Episodes Season 5 of Jonathan Creek premiered on February 28, 2014. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Who wants a new series? Open 0 by Benedict\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   1993-09-27 Cracker 8.5    2012-09-06 The Bletchley Circle 7.8    2010-08-15 Vexed 7.2    2010-07-05 Identity 7.0    2011-05-08 The Field of Blood 5.0    2001-01-09 Judge John Deed 6.0    1987-01-06 Inspector Morse 7.7    2001-09-24 Murphy's Law 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 60m Homepage   http://www.bbc.co.uk/programmes/b008jg9q Genres Comedy Drama Mystery Keywords journalist detective british humour investigative journalist Content Score 100 Yes! Looking good! Top Contributors 29 Elizabeth Jennings l 10 lostarchitect I 10 Ingwar O 8 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}