{"link": "https://www.themoviedb.org/tv/2693?language=en", "title": "Extras", "resume": "Andy Millman gave up his day job five years ago in the hope of achieving the big time, but he’s yet to land a speaking part, let alone saunter down the red carpet to pick up an Oscar. He remains optimistic however, as rubbing shoulders with the A-list on-set only serves to reinforce his belief that the big time is just a job or two away.", "rate": 79, "genre": ["Comedy"], "cast": ["Ricky Gervais", "Ashley Jensen", "Stephen Merchant", "Shaun Williamson", "Shaun Pye"], "character": ["Andy Millman", "Maggie Jacobs", "Darren Lamb", "\"Barry\" / Shaun", "Greg Lindley-Jones"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2693   Expand Extras   (2005) User Score Overview Andy Millman gave up his day job five years ago in the hope of achieving the big time, but he’s yet to land a speaking part, let alone saunter down the red carpet to pick up an Oscar. He remains optimistic however, as rubbing shoulders with the A-list on-set only serves to reinforce his belief that the big time is just a job or two away. Featured Crew Ricky Gervais Creator Stephen Merchant Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ricky Gervais Andy Millman Ashley Jensen Maggie Jacobs Stephen Merchant Darren Lamb Shaun Williamson \"Barry\" / Shaun Shaun Pye Greg Lindley-Jones Full Cast & Crew Last Season Season 2 2006 | 6 Episodes Season 2 of Extras premiered on September 14, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Favourite Episode? Open 0 by Drooch\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations   2001-07-09 The Office 8.1    1999-09-24 Spaced 8.1    2011-11-10 Life's Too Short 7.1    2010-02-19 The Ricky Gervais Show 7.9    2012-04-12 Derek 7.1    2008-05-01 The Inbetweeners 7.7    2007-06-17 Flight of the Conchords 7.9    2003-09-19 Peep Show 8.2  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://bbc.co.uk/programmes/b0070rj8 Genres Comedy Keywords satire celebrity british comedy movie star aspiring actor sitcom british humour Content Score 93 Almost there... Top Contributors 9 Banana 7 Travis Bell 6 United600 E 6 EightNine  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}