{"link": "https://www.themoviedb.org/tv/72597?language=en", "title": "Manhunt: Unabomber", "resume": "Follow Jim Fitzgerald, the FBI agent who tracked down Ted Kaczynksi, aka the “Unabomber,” and brought him to justice through his expertise in profiling and linguistics.", "rate": 77, "genre": ["Crime", "Drama"], "cast": ["Sam Worthington", "Paul Bettany", "Lynn Collins", "Jeremy Bobb", "Ben Weber"], "character": ["Jim \"Fitz\" Fitzgerald", "Ted Kaczynski", "Natalie", "Stan Cole", "Andy Genelli"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72597   Expand Manhunt: Unabomber   (2017) User Score  Play Trailer Overview Follow Jim Fitzgerald, the FBI agent who tracked down Ted Kaczynksi, aka the “Unabomber,” and brought him to justice through his expertise in profiling and linguistics. Featured Crew Andrew Sodroski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sam Worthington Jim \"Fitz\" Fitzgerald Paul Bettany Ted Kaczynski Lynn Collins Natalie Jeremy Bobb Stan Cole Ben Weber Andy Genelli Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Manhunt: Unabomber premiered on August  1, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Career bests Open 1 by  cpheonix Did anyone else... Open 3 by  Marty So far a must see series, Sam Worthington and Paul Bettany are both incredibly engaging. Open 3 by  PT 100 Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  5 Recommendations   2014-09-27 The Lava Field 6.4    2017-12-22 The Toys That Made Us 7.5    2018-05-10 Safe 7.1    2017-02-08 Alias J.J. 7.8    2015-09-22 Sea of Plastic 6.8    2015-05-24 Tales by Light 7.8    2017-07-21 Ozark 8.0    2016-07-10 The Night Of 7.7  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  44m Homepage   https://www.discovery.com/tv-shows/manhunt-unabomber/ Genres Crime Drama Keywords fbi bomber serial killer bombas Content Score 100 Yes! Looking good! Top Contributors l 23 lexura 17 Elizabeth Jennings 13 Marso R 8 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}