{"link": "https://www.themoviedb.org/tv/2467?language=en", "title": "Disney's House of Mouse", "resume": "Disney's House of Mouse is an American animated television series, produced by Walt Disney Television Animation, that originally aired from 2001 to 2003. On September 2, 2002, an all night marathon of this show titled \"Night of 1000 Toons\" aired on Toon Disney.", "rate": 76, "genre": ["Animation"], "cast": ["Wayne Allwine", "Bill Farmer", "Russi Taylor", "Tress MacNeille", "Tony Anselmo"], "character": ["Mickey Mouse", "Goofy", "Minnie Mouse", "Daisy Duck", "Donald Duck"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2467   Expand Disney's House of Mouse   (2001) User Score Overview Disney's House of Mouse is an American animated television series, produced by Walt Disney Television Animation, that originally aired from 2001 to 2003. On September 2, 2002, an all night marathon of this show titled \"Night of 1000 Toons\" aired on Toon Disney. Featured Crew Tony Craig Creator Roberts Gannaway Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wayne Allwine Mickey Mouse Bill Farmer Goofy Russi Taylor Minnie Mouse Tress MacNeille Daisy Duck Tony Anselmo Donald Duck Full Cast & Crew Last Season House of mouse season 3 2002 | 18 Episodes Season 3 of Disney's House of Mouse premiered on September  2, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   2003-07-11 Spider-Man: The New Animated Series 6.5    2003-08-23 Duck Dodgers 7.4    1998-08-31 Hercules 5.3    2005-01-21 American Dragon: Jake Long 5.9    2002-06-07 Kim Possible 6.7    2003-09-20 Lilo & Stitch: The Series 6.0    1994-10-24 Gargoyles 8.0    1992-10-10 Yu Yu Hakusho 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://disney.go.com/disneytelevision/disney1/index2.html?characters/houseofmouse/houseofmouse%2Cback=main&submenu=shows#restart=yes Genres Animation Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 7 t0by a 5 adltata s 3 speedycars c 3 chloris77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}