{"link": "https://www.themoviedb.org/tv/63535?language=en", "title": "Vinyl", "resume": "Set in 1970s New York, Vinyl is a ride through the sex- and drug-addled music business at the dawn of punk, disco, and hip-hop. The show is seen through the eyes of a record label president, Richie Finestra, who is trying to save his company and his soul without destroying everyone in his path.", "rate": 72, "genre": ["Drama", "Music"], "cast": ["Bobby Cannavale", "Olivia Wilde", "Ray Romano", "Ato Essandoh", "Max Casella"], "character": ["Richie Finestra", "Devon Finestra", "Zak Yankovich", "Lester Grimes", "Julie Silver"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63535   Expand Vinyl   (2016) User Score  Play Trailer Overview Set in 1970s New York, Vinyl is a ride through the sex- and drug-addled music business at the dawn of punk, disco, and hip-hop. The show is seen through the eyes of a record label president, Richie Finestra, who is trying to save his company and his soul without destroying everyone in his path. Featured Crew Martin Scorsese Creator Mick Jagger Creator Terence Winter Creator Rich Cohen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bobby Cannavale Richie Finestra Olivia Wilde Devon Finestra Ray Romano Zak Yankovich Ato Essandoh Lester Grimes Max Casella Julie Silver Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Vinyl premiered on February 14, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply What went wrong? Open 7 by  MongoLloyd Cancelled Open 6 by  mechajutaro Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations   2010-09-19 Boardwalk Empire 7.7    2012-01-29 Luck 7.8    2017-11-05 SMILF 6.7    2007-07-19 Mad Men 8.0    2015-08-22 Blunt Talk 6.3    2013-11-24 Getting On 6.8    2016-08-18 I Love Dick 5.2    2014-08-08 The Knick 7.5  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.hbo.com/vinyl Genres Drama Music Keywords rock and roll 1970s music business new york city Content Score 100 Yes! Looking good! Top Contributors 106 Elizabeth Jennings 8 Banana z 4 zurman1 s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}