{"link": "https://www.themoviedb.org/tv/32829?language=en", "title": "Happy Endings", "resume": "Happy Endings is an American television sitcom that ran on ABC from April 13, 2011 to May 3, 2013. The show follows the dysfunctional adventures of six best friends living in Chicago.", "rate": 73, "genre": ["Comedy"], "cast": ["Eliza Coupe", "Elisha Cuthbert", "Zachary Knighton", "Adam Pally", "Damon Wayans Jr."], "character": ["Jane Williams", "Alex Kerkovich", "Dave Rose", "Max Blum", "Brad Williams"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32829   Expand Happy Endings   (2011) User Score  Play Trailer Overview Happy Endings is an American television sitcom that ran on ABC from April 13, 2011 to May 3, 2013. The show follows the dysfunctional adventures of six best friends living in Chicago. Featured Crew David Caspe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  11 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eliza Coupe Jane Williams Elisha Cuthbert Alex Kerkovich Zachary Knighton Dave Rose Adam Pally Max Blum Damon Wayans Jr. Brad Williams Full Cast & Crew Last Season Season 3 2012 | 23 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Happy Endings. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  7 Recommendations   2011-09-22 Whitney 3.8    2011-02-09 Mr. Sunshine 6.4    2011-09-14 Up All Night 6.2    2012-04-11 Don't Trust the B---- in Apartment 23 6.7    2011-10-18 Man Up! 6.2    2011-09-28 Suburgatory 6.8    2013-09-26 The Crazy Ones 5.8    2012-08-08 Go On 6.2  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.abc.go.com/shows/happy-endings Genres Comedy Keywords friendship wife husband relationship sibling relationship group of friends lgbt interracial couple sitcom Content Score 100 Yes! Looking good! Top Contributors F 16 Fayu 15 Travis Bell j 15 jnylen 8 spaceship broken  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}