{"link": "https://www.themoviedb.org/tv/34860?language=en", "title": "Nintama Rantarō", "resume": "Rantarō, Shinbei and Kirimaru are ninja  apprentices in the Ninja Gakuen, where first grade ones are called  \"Nintamas\". They must learn  everything a ninja must know, but as for our heroes, money, food or  playing are more interesting. The series show the everyday adventures of  our heroes.", "rate": 0, "genre": ["Comedy", "Action", "Adventure"], "cast": ["Mahito Tsujimura", "Minami Takayama", "Mayumi Tanaka", "Chikao Ohtsuka", "Teiyū Ichiryūsai"], "character": ["Headmaster", "Rantarō Inadera", "Kirimaru Settsuno", "Denzo Yamada", "Shinbei Fukutomi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34860   Expand Nintama Rantarō   (1993) User Score Overview Rantarō, Shinbei and Kirimaru are ninja  apprentices in the Ninja Gakuen, where first grade ones are called  \"Nintamas\". They must learn  everything a ninja must know, but as for our heroes, money, food or  playing are more interesting. The series show the everyday adventures of  our heroes. Featured Crew Soubee Amako Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mahito Tsujimura Headmaster Minami Takayama Rantarō Inadera Mayumi Tanaka Kirimaru Settsuno Chikao Ohtsuka Denzo Yamada Teiyū Ichiryūsai Shinbei Fukutomi Full Cast & Crew Last Season Season 6 2004 | 131 Episodes Season 6 of Nintama Rantarō premiered on April 19, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Nintama Rantarō. You can help by rating TV shows you've seen. Facts Original Name  忍たま乱太郎 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Comedy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors R 6 Rebecca t 6 tmdb983464 c 5 colon 2 CrewMdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}