{"link": "https://www.themoviedb.org/tv/2423?language=en", "title": "Celebrity Deathmatch", "resume": "Celebrity Deathmatch is a claymation television show that depicts celebrities against each other in a wrestling ring, almost always ending in the loser's gruesome death. It was known for its excessive amount of blood used in every match and exaggerated physical injuries.\nThe series was created by Eric Fogel; with the pilots airing on MTV on January 1 & 25 1998. The initial series ran from May 14, 1998 to October 20, 2002, and lasted for a 75-episode run. There was one special that did not contribute to the final episode total, entitled \"Celebrity Deathmatch Hits Germany\", which aired on June 21, 2001. Professional wrestler Stone Cold Steve Austin gave voice to his animated form as the guest commentator. Early in 2003, a film based on the series was announced by MTV to be in the making, but the project was canceled by the end of that year.\nIn 2005, MTV2 announced the revival of the show as part of their \"Sic 'Em Friday\" programming block. Originally set to return in November 2005, the premiere was pushed back to June 10, 2006 as part of a new \"Sic'emation\" block with two other animated shows, Where My Dogs At and The Adventures of Chico and Guapo. The show's fifth season was produced by Cuppa Coffee Studios and the premiere drew over 2.5 million viewers, becoming MTV2's highest rated season premiere ever.", "rate": 67, "genre": ["Comedy", "Animation"], "cast": ["Chris Edgerly", "Maurice Schlafer", "Len Maxwell", "Debbie Matenopoulos", "Stephanie Courtney"], "character": ["Tina Fey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2423   Expand Celebrity Deathmatch   (1998) User Score Overview Celebrity Deathmatch is a claymation television show that depicts celebrities against each other in a wrestling ring, almost always ending in the loser's gruesome death. It was known for its excessive amount of blood used in every match and exaggerated physical injuries. The series was created by Eric Fogel; with the pilots airing on MTV on January 1 & 25 1998. The initial series ran from May 14, 1998 to October 20, 2002, and lasted for a 75-episode run. There was one special that did not contribute to the final episode total, entitled \"Celebrity Deathmatch Hits Germany\", which aired on June 21, 2001. Professional wrestler Stone Cold Steve Austin gave voice to his animated form as the guest commentator. Early in 2003, a film based on the series was announced by MTV to be in the making, but the project was canceled by the end of that year. In 2005, MTV2 announced the revival of the show as part of their \"Sic 'Em Friday\" programming block. Originally set to return in November 2005, the premiere was pushed back to June 10, 2006 as part of a new \"Sic'emation\" block with two other animated shows, Where My Dogs At and The Adventures of Chico and Guapo. The show's fifth season was produced by Cuppa Coffee Studios and the premiere drew over 2.5 million viewers, becoming MTV2's highest rated season premiere ever. Featured Crew Eric Fogel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Edgerly Maurice Schlafer Len Maxwell Debbie Matenopoulos Stephanie Courtney Tina Fey Full Cast & Crew Last Season Season 6 2007 | 8 Episodes Season 6 of Celebrity Deathmatch premiered on February  9, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1994-01-26 The Critic 7.7    1991-08-11 The Ren & Stimpy Show 7.2    1992-09-22 Beavis and Butt-head 6.9    2007-08-06 Drunk History 6.6    1986-09-15 Rambo 5.7    1977-02-10 The New Adventures of Batman 6.0    1966-09-10 Space Ghost and Dino Boy 7.2    2005-02-20 Robot Chicken 7.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  21m, 30m Homepage   http://www.mtv.com/shows/celebrity_deathmatch/series.jhtml Genres Comedy Animation Keywords wrestling celebrity claymation Content Score 93 Almost there... Top Contributors 12 Banana A 5 AnthonyAtkins232 4 TheOneManBoxOffice 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}