{"link": "https://www.themoviedb.org/tv/70882?language=en", "title": "Armed Girl's Machiavellism", "resume": "The Private Aichi Symbiosis Academy was originally a high school for high-class girls. When it became co-ed, the girls, out of fear, asked to be permitted to bring weapons to school. When that was enforced, a five-member vigilante corps-like organization called the \"Supreme Five Swords\" was also formed.\nAfter many generations, the five swords eventually became a group which corrected problematic students, and the academy started proactively accepting such students in order to correct them.\nNomura Fudou was sent to this school after being part of a huge brawl. What will he do when the only options he has after enrolling are being expelled from that school or being corrected the way the rest of the male students there were...by being forced to dress and act like a girl!\n(Source: Batoto, MAL)", "rate": 86, "genre": ["Animation", "Comedy"], "cast": ["Tasuku Hatanaka", "Yuuki Takada", "Nozomi Nishida", "Sayaka Kitahara", "Eriko Matsui"], "character": ["Fudō Nomura", "Rin Onigawara", "Satori Tamaba", "Mary Kikakujō", "Kirukiru Amō"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70882   Expand Armed Girl's Machiavellism   (2017) User Score Overview The Private Aichi Symbiosis Academy was originally a high school for high-class girls. When it became co-ed, the girls, out of fear, asked to be permitted to bring weapons to school. When that was enforced, a five-member vigilante corps-like organization called the \"Supreme Five Swords\" was also formed. After many generations, the five swords eventually became a group which corrected problematic students, and the academy started proactively accepting such students in order to correct them. Nomura Fudou was sent to this school after being part of a huge brawl. What will he do when the only options he has after enrolling are being expelled from that school or being corrected the way the rest of the male students there were...by being forced to dress and act like a girl! (Source: Batoto, MAL) Featured Crew Hideki Tachibana Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tasuku Hatanaka Fudō Nomura Yuuki Takada Rin Onigawara Nozomi Nishida Satori Tamaba Sayaka Kitahara Mary Kikakujō Eriko Matsui Kirukiru Amō Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Armed Girl's Machiavellism premiered on April  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   2017-04-07 Love Tyrant 7.3    2006-01-07 Fate/stay night 7.2    2016-04-06 Twin Star Exorcists 8.4    2012-01-06 High School DxD 6.3  Facts Original Name  武装少女マキャヴェリズム Status  Planned Networks - Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://machiavellism-anime.jp/ Genres Animation Comedy Keywords based on manga anime Content Score 100 Yes! Looking good! Top Contributors 20 Despair-Paradise 13 TripleZGamer 12 sp1ti 11 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}