{"link": "https://www.themoviedb.org/tv/1310?language=en", "title": "Sanctuary", "resume": "The adventures of the beautiful, enigmatic and always surprising Dr. Helen Magnus, a brilliant scientist who holds the secrets of a clandestine population called Abnormals - a group of strange and sometimes terrifying beings that hide among humans. Magnus seeks to protect this threatened phenomena as well as unlock the mysteries behind their existence.", "rate": 67, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Amanda Tapping", "Robin Dunne", "Christopher Heyerdahl", "Ryan Robbins", "Agam Darshi"], "character": ["Dr. Helen Magnus", "Dr. Will Zimmerman", "John Druitt / Bigfoot", "Henry Foss", "Kate Freelander"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1310   Expand Sanctuary   (2008) User Score  Play Trailer Overview The adventures of the beautiful, enigmatic and always surprising Dr. Helen Magnus, a brilliant scientist who holds the secrets of a clandestine population called Abnormals - a group of strange and sometimes terrifying beings that hide among humans. Magnus seeks to protect this threatened phenomena as well as unlock the mysteries behind their existence. Featured Crew Damian Kindler Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  16 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Amanda Tapping Dr. Helen Magnus Robin Dunne Dr. Will Zimmerman Christopher Heyerdahl John Druitt / Bigfoot Ryan Robbins Henry Foss Agam Darshi Kate Freelander Full Cast & Crew Last Season Season 4 2011 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  16 Posters  6 Recommendations   2006-10-22 Torchwood 7.4    2009-07-07 Warehouse 13 7.2    2011-07-11 Alphas 6.5    2007-02-10 Primeval 6.6    2000-10-02 Andromeda 7.1    2010-07-09 Haven 7.0    1992-10-03 Highlander: The Series 6.9    2006-07-18 Eureka 7.4  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  42m, 60m, 43m Homepage   http://www.sanctuaryforall.com/ Genres Action & Adventure Sci-Fi & Fantasy Keywords future mutant superhuman scientist recruiting Content Score 100 Yes! Looking good! Top Contributors 39 TonAngel 3 18 38956 s 16 stingray23 S 9 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}