{"link": "https://www.themoviedb.org/tv/65353?language=en", "title": "Carmilla", "resume": "Laura Hollis, a newly enrolled college student at Silas University, shares a room with Betty, who mysteriously disappears all of a sudden. Little does Laura know that after this fateful night, nothing will be the same in her life, starting with meeting her new roommate from hell, Carmilla Karnstein.\n\"Carmilla\" is a single-camera, scripted transmedia series that puts a modern spin on the cult classic Gothic vampire novella by Joseph Sheridan Le Fanu. It's a story of a young woman’s susceptibility to the attentions of a female vampire.", "rate": 76, "genre": ["Drama", "Comedy"], "cast": ["Elise Bauman", "Natasha Negovanlis", "Annie Briggs", "Kaitlyn Alexander", "Sophia Walker"], "character": ["Laura Eileen Hollis", "Carmilla \"Carm\" Karnstein", "Lola \"Perr\" Perry / Lilita Morgan (The Dean)", "S. \"LaF\" LaFontaine", "Matska \"Mattie\" Belmonde"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65353   Expand Carmilla   (2014) User Score  Play Trailer Overview Laura Hollis, a newly enrolled college student at Silas University, shares a room with Betty, who mysteriously disappears all of a sudden. Little does Laura know that after this fateful night, nothing will be the same in her life, starting with meeting her new roommate from hell, Carmilla Karnstein. \"Carmilla\" is a single-camera, scripted transmedia series that puts a modern spin on the cult classic Gothic vampire novella by Joseph Sheridan Le Fanu. It's a story of a young woman’s susceptibility to the attentions of a female vampire. Featured Crew Jay Bennett Creator Jordan Hall Creator Steph Ouaknine Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  20 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Elise Bauman Laura Eileen Hollis Natasha Negovanlis Carmilla \"Carm\" Karnstein Annie Briggs Lola \"Perr\" Perry / Lilita Morgan (The Dean) Kaitlyn Alexander S. \"LaF\" LaFontaine Sophia Walker Matska \"Mattie\" Belmonde Full Cast & Crew Last Season Season III 2016 | 36 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Preview Of The Movie Open 0 by janar\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  20 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Carmilla. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  5m Homepage   http://www.carmillatheseries.com/ Genres Drama Comedy Keywords based on novel or book vampire roommate supernatural powers lesbian relationship university supernatural creature supernatural phenomena Content Score 100 Yes! Looking good! Top Contributors 219 janar R 43 Rebecca g 24 greeceinvein 3 thelword  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}