{"link": "https://www.themoviedb.org/tv/65300?language=en", "title": "The Real Housewives of Potomac", "resume": "Just up the river from our nation’s capital lies a hidden gem—Potomac, Maryland. Its rolling hills, gated mansions, sophisticated prep schools, and exclusive country clubs all serve to keep the area invitation-only. Sprinkled throughout this community are a handful of old-line, wealthy African-American families who have historically broken racial barriers to provide a life of privilege for their children. In a town where entry is granted only through class, pedigree, and lineage, how far will the ladies go to secure their spot at the top of this prestigious circle?", "rate": 47, "genre": ["Reality"], "cast": ["Ashley Darby", "Gizelle Bryant", "Karen Huger", "Monique Samuels", "Robyn Dixon"], "character": ["Herself", "Herself", "Herself", "Herself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65300   Expand The Real Housewives of Potomac   (2016) User Score Overview Just up the river from our nation’s capital lies a hidden gem—Potomac, Maryland. Its rolling hills, gated mansions, sophisticated prep schools, and exclusive country clubs all serve to keep the area invitation-only. Sprinkled throughout this community are a handful of old-line, wealthy African-American families who have historically broken racial barriers to provide a life of privilege for their children. In a town where entry is granted only through class, pedigree, and lineage, how far will the ladies go to secure their spot at the top of this prestigious circle? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashley Darby Herself Gizelle Bryant Herself Karen Huger Herself Monique Samuels Herself Robyn Dixon Herself Full Cast & Crew Current Season Season 3 2018 | 13 Episodes Season 3 of The Real Housewives of Potomac premiered on April  1, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2015-01-12 The Real Housewives of Cheshire 6.6    2009-05-12 The Real Housewives of New Jersey 5.1    2006-03-21 The Real Housewives of Orange County 5.1    2008-10-07 The Real Housewives of Atlanta 5.4    2010-10-14 The Real Housewives of Beverly Hills 6.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Reality Original Language  English Runtime  42m Homepage   http://www.bravotv.com/the-real-housewives-of-potomac Genres Reality Keywords housewife black woman Content Score 86 Almost there... Top Contributors 24 Elizabeth Jennings 19 Banana 9 oldboy3 6 jkellar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}