{"link": "https://www.themoviedb.org/tv/73550?language=en", "title": "Gunpowder", "resume": "London, 1605. Robert Catesby, a 33-year old Warwickshire gentleman, devises a plot to blow up Parliament and kill the King.", "rate": 68, "genre": ["Drama", "War", "Politics"], "cast": ["Kit Harington", "Mark Gatiss", "Edward Holcroft", "Tom Cullen", "Peter Mullan"], "character": ["Robert Catesby", "Sir Robert Cecil", "Thomas Wintour", "Guy Fawkes", "Father Henry Garnet"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 73550   Expand Gunpowder   (2017) User Score  Play Trailer Overview London, 1605. Robert Catesby, a 33-year old Warwickshire gentleman, devises a plot to blow up Parliament and kill the King. Featured Crew Ronan Bennett Creator Daniel West Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  7 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kit Harington Robert Catesby Mark Gatiss Sir Robert Cecil Edward Holcroft Thomas Wintour Tom Cullen Guy Fawkes Peter Mullan Father Henry Garnet Full Cast & Crew Current Season Season 1 2017 | 3 Episodes Season 1 of Gunpowder premiered on October 21, 2017. View All Seasons Social Reviews  1 Discussions  2 Js A review by Jon saunders Written by  Jon saunders  on November  6, 2017 Absolutely amazing show, detail is amazing brings home to you how dark and terrifying it would of been to live in the 1600 if you where a catholic... Read All Reviews Media Most Popular Videos  1 Backdrops  7 Posters  6 Recommendations   2017-10-01 The Last Post 6.7    2017-09-26 Law & Order True Crime 6.1    2017-09-25 The Brave 6.6    2017-10-01 Ten Days in the Valley 6.0    2017-09-10 The Deuce 7.9    2017-11-07 Damnation 7.2    2007-04-08 Inspector George Gently 8.3    2017-06-11 The Loch 5.9  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p05j1bc9 Genres Drama War & Politics Keywords england scotland planned murder religion miniseries period drama catholic priest gunpowder plot 17th century activist Content Score 100 Yes! Looking good! Top Contributors 39 Hevinalle TB 29 TMDb Bot 27 Elizabeth Jennings O 8 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}