{"link": "https://www.themoviedb.org/tv/16118?language=en", "title": "Salem's Lot", "resume": "Salem's Lot is a 1979 American television adaptation of the novel of the same name by Stephen King. Directed by Tobe Hooper and starring David Soul and James Mason, the plot revolves around a writer returning to his home town and discovers the citizens are turning into vampires. It combines elements of both the vampire film and haunted house subgenres.", "rate": 65, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["James Mason", "David Soul", "Kenneth McMillan", "Bonnie Bedelia", "Reggie Nalder"], "character": ["Richard K. Straker", "Ben Mears", "Constable Parkins Gillespie", "Susan Norton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16118   Expand Salem's Lot   (1979) User Score  Play Trailer Overview Salem's Lot is a 1979 American television adaptation of the novel of the same name by Stephen King. Directed by Tobe Hooper and starring David Soul and James Mason, the plot revolves around a writer returning to his home town and discovers the citizens are turning into vampires. It combines elements of both the vampire film and haunted house subgenres. Featured Crew Tobe Hooper Creator Stephen King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  8 Content Issues  1 Images Backdrops  8 Posters  24 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Mason Richard K. Straker David Soul Ben Mears Kenneth McMillan Constable Parkins Gillespie Bonnie Bedelia Susan Norton Reggie Nalder Full Cast & Crew Last Season Season 1 1979 | 2 Episodes Season 1 of Salem's Lot premiered on November 17, 1979. View All Seasons Social Reviews  0 Discussions  9 Subject Status Replies Last Reply Saw this on TV when it first aired in 1979 Open 10 by  Gus Gorman The 2nd greatest Stephen King adaptation of all time IMO Open 0 by Gus Gorman\n      \n     S Invitation Open 1 by  Gary O. Go to Discussions Media Most Popular Videos  3 Backdrops  8 Posters  24 Recommendations   1993-05-09 The Tommyknockers 5.1    1994-05-08 The Stand 6.8    2004-06-20 Salem's Lot 5.5    1995-05-14 The Langoliers 5.9    2002-01-27 Rose Red 6.6    2005-10-28 Masters of Horror 6.9    1999-02-14 Storm of the Century 6.8    Wedlock 5.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  240m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords vampire home return menace antiquary house miniseries writer new england hometown Content Score 100 Yes! Looking good! Top Contributors TB 95 TMDb Bot 22 Banana V 17 Vince 5 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}