{"link": "https://www.themoviedb.org/tv/76759?language=en", "title": "GeGeGe no Kitaro", "resume": "In the Japanese modern era, almost every people has forgotten about Youkai.", "rate": 90, "genre": ["Comedy", "Sci-Fi", "Fantasy", "Animation"], "cast": ["Yukiyo Fujii", "Miyuki Sawashiro", "Masako Nozawa", "Umeka Shouji", "Toshio Furukawa"], "character": ["Inuyama Mana", "Kitarou", "Medama-oyaji", "Neko Musume", "Nezumi Otoko"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76759   Expand GeGeGe no Kitaro   (2018) User Score Overview In the Japanese modern era, almost every people has forgotten about Youkai. Featured Crew Hiroshi Ônogi Creator Kouji Ogawa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yukiyo Fujii Inuyama Mana Miyuki Sawashiro Kitarou Masako Nozawa Medama-oyaji Umeka Shouji Neko Musume Toshio Furukawa Nezumi Otoko Full Cast & Crew Current Season Season 1 2018 | 14 Episodes Season 1 of GeGeGe no Kitaro premiered on April  1, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for GeGeGe no Kitaro. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on GeGeGe no Kitaro. You can help by rating TV shows you've seen. Facts Original Name  ゲゲゲの鬼太郎 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.toei-anim.co.jp/kitaro/ Genres Comedy Sci-Fi & Fantasy Animation Keywords supernatural remake based on manga demon youkai shounen anime Content Score 93 Almost there... Top Contributors 28 sp1ti 18 neonime D 14 Destr0y d 7 dbplay  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}