{"link": "https://www.themoviedb.org/tv/34638?language=en", "title": "Canada's Worst Driver", "resume": "Canada's Worst Driver is a Canadian television series on Discovery Channel, based on Britain's Worst Driver, and is part of the Worst Driver television franchise. It and sister series Canada's Worst Handyman are the two highest-rated programs on Discovery Channel. The series is produced by Proper Television, whose president, Guy O'Sullivan, was the director for the original Britain's Worst Driver series; as such, Canada's Worst Driver is considered to be the production company's flagship show.\nUnlike other Worst series around the world, the Canadian version emphasizes the learning process of the contestants and the science of driving, and as such is often more serious than the other Worst shows around the world, which are mainly played for laughs. It is the longest running of any Worst series to date.\nThe series is also aired dubbed in French in Canada, as the Les zéros de conduite on Canal D.", "rate": 68, "genre": ["Comedy", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34638   Expand Canada's Worst Driver   (2005) User Score Overview Canada's Worst Driver is a Canadian television series on Discovery Channel, based on Britain's Worst Driver, and is part of the Worst Driver television franchise. It and sister series Canada's Worst Handyman are the two highest-rated programs on Discovery Channel. The series is produced by Proper Television, whose president, Guy O'Sullivan, was the director for the original Britain's Worst Driver series; as such, Canada's Worst Driver is considered to be the production company's flagship show. Unlike other Worst series around the world, the Canadian version emphasizes the learning process of the contestants and the science of driving, and as such is often more serious than the other Worst shows around the world, which are mainly played for laughs. It is the longest running of any Worst series to date. The series is also aired dubbed in French in Canada, as the Les zéros de conduite on Canal D. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 12 2016 | 5 Episodes Season 12 of Canada's Worst Driver premiered on October 24, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Canada's Worst Driver. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2017-11-17 Shot in the Dark 7.4    2006-03-13 Canada's Worst Handyman 5.0    2014-01-14 Friday Night Tykes 6.8    2012-09-04 Highway Thru Hell 7.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.worstdriver.ca Genres Comedy Reality Keywords bad driver unskilled Content Score 64 We're so close, yet so far. Top Contributors 9 Banana 8 trusselo 4 SWFT S 2 Salvinio28  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}