{"link": "https://www.themoviedb.org/tv/12551?language=en", "title": "Jon & Kate Plus 8", "resume": "Jon & Kate Plus 8, renamed Kate Plus 8 for the sixth and seventh seasons, is an American reality television series which aired from April 4, 2007 until September 12, 2011. After the success of two one-hour specials, Surviving Sextuplets and Twins and Sextuplets and Twins: One Year Later, the series aired on the Discovery Health Channel for the first two seasons before being moved to TLC. It follows the daily lives and challenges of the Gosselin family, consisting of parents Jon and Kate and their eight children: fraternal twins and sextuplets.\nDuring its run, the series was one of the network's highest-rated programs, with the fifth season premiere seen by a record 9.8 million viewers, the most watched show of that evening including broadcast television, twice as many viewers as the show’s previous series high.\nAfter the Gosselins' divorce in 2009, the final episode of Jon & Kate Plus 8 aired on November 23, 2009, announced by TLC three days earlier. The series was later renamed Kate Plus 8 on June 6, 2010, focusing on Kate as a divorced mother raising the children, with Jon appearing less frequently. However, filming was later suspended due to Jon's lawyers delivering letters to TLC demanding that they cease and desist production and barred production crews from the couple's Pennsylvania property on October 1, 2009. This led to putting the show's revamping on hold. TLC planned for \"a series of specials\" if the series did not go into production.", "rate": 48, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12551   Expand Jon & Kate Plus 8   (2007) User Score Overview Jon & Kate Plus 8, renamed Kate Plus 8 for the sixth and seventh seasons, is an American reality television series which aired from April 4, 2007 until September 12, 2011. After the success of two one-hour specials, Surviving Sextuplets and Twins and Sextuplets and Twins: One Year Later, the series aired on the Discovery Health Channel for the first two seasons before being moved to TLC. It follows the daily lives and challenges of the Gosselin family, consisting of parents Jon and Kate and their eight children: fraternal twins and sextuplets. During its run, the series was one of the network's highest-rated programs, with the fifth season premiere seen by a record 9.8 million viewers, the most watched show of that evening including broadcast television, twice as many viewers as the show’s previous series high. After the Gosselins' divorce in 2009, the final episode of Jon & Kate Plus 8 aired on November 23, 2009, announced by TLC three days earlier. The series was later renamed Kate Plus 8 on June 6, 2010, focusing on Kate as a divorced mother raising the children, with Jon appearing less frequently. However, filming was later suspended due to Jon's lawyers delivering letters to TLC demanding that they cease and desist production and barred production crews from the couple's Pennsylvania property on October 1, 2009. This led to putting the show's revamping on hold. TLC planned for \"a series of specials\" if the series did not go into production. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2009 | 24 Episodes Season 5 of Jon & Kate Plus 8 premiered on May 25, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1999-02-14 Storm of the Century 6.8    1999-11-12 Courage the Cowardly Dog 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m Homepage   http://tlc.discovery.com/tv/jon-and-kate/jon-and-kate.html Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}