{"link": "https://www.themoviedb.org/tv/67593?language=en", "title": "District 31", "resume": "After years of keeping his detectives at the headquarters, the Montreal PD has decided to reassign them to neighbourhood precincts in an effort to get closer to the population. Nadine Legrand and Patrick Bissonnette have to find their footing in their new work place: District 31.", "rate": 31, "genre": ["Crime", "Drama"], "cast": ["Magalie Lépine-Blondeau", "Vincent-Guillaume Otis", "Luc Picard", "Sébastien Delorme", "Gildor Roy "], "character": ["Nadine Legrand", "Patrick Bissonnette", "Geoffroy Morin", "Stéphane Pouliot", "Daniel Chiasson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67593   Expand District 31   (2016) User Score Overview After years of keeping his detectives at the headquarters, the Montreal PD has decided to reassign them to neighbourhood precincts in an effort to get closer to the population. Nadine Legrand and Patrick Bissonnette have to find their footing in their new work place: District 31. Featured Crew Luc Dionne Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Magalie Lépine-Blondeau Nadine Legrand Vincent-Guillaume Otis Patrick Bissonnette Luc Picard Geoffroy Morin Sébastien Delorme Stéphane Pouliot Gildor Roy  Daniel Chiasson Full Cast & Crew Last Season Season 2 2017 | 120 Episodes Season 2 of District 31 premiered on September 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on District 31. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification C8 Meaning Suitable for children ages 8+. Low level violence and fantasy horror is allowed. No foul language is allowed, but occasional \"socially offensive and discriminatory\" language is allowed if in the context of the story. No sexual content of any level allowed. Type  Scripted Original Language  French Runtime  22m Homepage   http://district31.radio-canada.ca Genres Crime Drama Keywords montreal police detective Content Score 100 Yes! Looking good! Top Contributors 95 Banana 89 Lewis 27 Guipat 3 Serge  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}