{"link": "https://www.themoviedb.org/tv/6516?language=en", "title": "The Bugs Bunny Show", "resume": "The Bugs Bunny Show is an Animated television anthology series hosted by Bugs Bunny, that was mainly composed of Looney Tunes and Merrie Melodies cartoons released by Warner Bros. between August 1, 1948 and the end of 1969. The show originally debuted as a primetime half-hour program on ABC in 1960, featuring three theatrical Warner Bros. Cartoons with new linking sequences produced by the Warner Bros. Cartoons staff.\nAfter three seasons, The Bugs Bunny Show moved to Saturday mornings, where it remained in one format or another for nearly four decades. The show's title and length changed regularly over the years, as did the network: both ABC and CBS broadcast versions of The Bugs Bunny Show. In 2000, the series, by then known as The Bugs Bunny & Tweety Show, was canceled after the Looney Tunes and Merrie Melodies libraries became the exclusive property of the Cartoon Network family of cable TV networks in the United States. Reruns of The Bugs Bunny and Tweety Show are still aired on the Canadian channels Teletoon and Teletoon Retro.", "rate": 80, "genre": ["Animation", "Comedy"], "cast": ["Hal Smith", "June Foray", "Stan Freberg", "Mel Blanc", "Arthur Q. Bryan"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6516   Expand The Bugs Bunny Show   (1960) User Score Overview The Bugs Bunny Show is an Animated television anthology series hosted by Bugs Bunny, that was mainly composed of Looney Tunes and Merrie Melodies cartoons released by Warner Bros. between August 1, 1948 and the end of 1969. The show originally debuted as a primetime half-hour program on ABC in 1960, featuring three theatrical Warner Bros. Cartoons with new linking sequences produced by the Warner Bros. Cartoons staff. After three seasons, The Bugs Bunny Show moved to Saturday mornings, where it remained in one format or another for nearly four decades. The show's title and length changed regularly over the years, as did the network: both ABC and CBS broadcast versions of The Bugs Bunny Show. In 2000, the series, by then known as The Bugs Bunny & Tweety Show, was canceled after the Looney Tunes and Merrie Melodies libraries became the exclusive property of the Cartoon Network family of cable TV networks in the United States. Reruns of The Bugs Bunny and Tweety Show are still aired on the Canadian channels Teletoon and Teletoon Retro. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  15 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hal Smith June Foray Stan Freberg Mel Blanc Arthur Q. Bryan Full Cast & Crew Last Season Season 3 1971 | 26 Episodes Season 3 of The Bugs Bunny Show premiered on September 11, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1960-09-30 The Flintstones 7.0    1962-09-23 The Jetsons 6.6    1995-09-09 Pinky and the Brain 7.7    1964-12-18 The Pink Panther Show 7.0    1983-09-10 Inspector Gadget 6.6    1960-11-14 Popeye the Sailor 5.8    1969-09-13 Scooby-Doo, Where Are You! 7.5    1987-09-18 DuckTales 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Animation Comedy Keywords cartoon Content Score 93 Almost there... Top Contributors PE 8 Patrick E. Abe t 7 toam 5 felectronika 4 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}