{"link": "https://www.themoviedb.org/tv/30977?language=en", "title": "A Certain Scientific Railgun", "resume": "Misaka’s electro-manipulation abilities – and delightfully destructive Railgun projectile move – make her a rock star in Academy City. The techno-metropolis is packed with supernaturally powered students known as espers, including Misaka’s flirty friend and roommate, Kuroko. She uses her teleportation skills as a member of the Judgment law enforcement team, fighting crime alongside her fellow agent Uiharu. Joined by their friend Saten, a spunky Level 0 esper, Misaka, Kuroko, and Uiharu have a blast taking on danger whenever and wherever it arises. Luckily, in a city full of super-powered gangs, mad scientists, and the occasional weird monster, the girls have no problem finding plenty of excitement, action, and adventure! From the director of Toradora!, take another explosively fun trip into the world of A Certain Magical Index with A Certain Scientific Railgun!", "rate": 63, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Aki Toyosaki", "Satomi Arai", "Atsushi Abe", "Minako Kotobuki", "Kana Ueda"], "character": ["Kazari Uiharu", "Kuroko Shirai", "Toma Kamijo", "Mitsuko Kongo", "Mii Konori"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30977   Expand A Certain Scientific Railgun   (2009) User Score Overview Misaka’s electro-manipulation abilities – and delightfully destructive Railgun projectile move – make her a rock star in Academy City. The techno-metropolis is packed with supernaturally powered students known as espers, including Misaka’s flirty friend and roommate, Kuroko. She uses her teleportation skills as a member of the Judgment law enforcement team, fighting crime alongside her fellow agent Uiharu. Joined by their friend Saten, a spunky Level 0 esper, Misaka, Kuroko, and Uiharu have a blast taking on danger whenever and wherever it arises. Luckily, in a city full of super-powered gangs, mad scientists, and the occasional weird monster, the girls have no problem finding plenty of excitement, action, and adventure! From the director of Toradora!, take another explosively fun trip into the world of A Certain Magical Index with A Certain Scientific Railgun! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  13 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aki Toyosaki Kazari Uiharu Satomi Arai Kuroko Shirai Atsushi Abe Toma Kamijo Minako Kotobuki Mitsuko Kongo Kana Ueda Mii Konori Full Cast & Crew Last Season Season 2 2013 | 24 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for A Certain Scientific Railgun. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  13 Posters  9 Recommendations   2006-04-04 Air Gear 5.3    2011-10-07 Haganai: I Don't Have Many Friends 7.7    2012-10-12 Robotics;Notes 4.7    2006-10-05 Kanon 8.0    2011-04-14 Aria the Scarlet Ammo 6.4    2006-10-03 Ghost Hunt 7.4    2008-07-02 Sekirei 7.7    2012-04-05 Sankarea: Undying Love 7.0  Facts Original Name  とある科学の超電磁砲 Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.project-railgun.net/ Genres Action & Adventure Animation Comedy Drama Sci-Fi & Fantasy Keywords supernatural school supernatural ability anime Content Score 86 Almost there... Top Contributors 20 WillofOwn G 15 Giaten 10 Dreydor 8 BrerFox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}