{"link": "https://www.themoviedb.org/tv/8872?language=en", "title": "Aquarion", "resume": "Genesis of Aquarion is an anime TV series written and directed by Shoji Kawamori, produced by Satelight.\nThe science fiction series is a homage to the Super Robot shows of the 1970s and 1980s, executed with modern animation techniques and aesthetics. Set in the future, a giant fighting machine called the Aquarion is humanity's only effective weapon in the fight against the technologically advanced species called the Shadow Angels.\nAquarion aired from April 4, 2005, to September 26, 2005, on TV Tokyo. An alternate retelling of the television series, the Genesis of Aquarion OVA, premiered on May 25, 2007. The television series is licensed in North America by Funimation while on the 14 February 2006 it aired on MTV Italia.\nOn April 27, 2009, the series made its North American television debut on the Funimation Channel.\nA sequel to the series titled Aquarion Evol was announced on February 25, 2011, and aired in 2012.", "rate": 58, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Yuuichirou Umehara", "Takayuki Asai", "Adachi Yuto", "Saima Nakano", "Nobunaga Shimazaki"], "character": ["Kujou Hayato", "Domon Tsutomu", "Kenzaki Subete", "Iwagami Shouko", "Kaibuki Akira"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8872   Expand Aquarion   (2005) User Score Overview Genesis of Aquarion is an anime TV series written and directed by Shoji Kawamori, produced by Satelight. The science fiction series is a homage to the Super Robot shows of the 1970s and 1980s, executed with modern animation techniques and aesthetics. Set in the future, a giant fighting machine called the Aquarion is humanity's only effective weapon in the fight against the technologically advanced species called the Shadow Angels. Aquarion aired from April 4, 2005, to September 26, 2005, on TV Tokyo. An alternate retelling of the television series, the Genesis of Aquarion OVA, premiered on May 25, 2007. The television series is licensed in North America by Funimation while on the 14 February 2006 it aired on MTV Italia. On April 27, 2009, the series made its North American television debut on the Funimation Channel. A sequel to the series titled Aquarion Evol was announced on February 25, 2011, and aired in 2012. Featured Crew Shoji Kawamori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Yuuichirou Umehara Kujou Hayato Takayuki Asai Domon Tsutomu Adachi Yuto Kenzaki Subete Saima Nakano Iwagami Shouko Nobunaga Shimazaki Kaibuki Akira Full Cast & Crew Last Season Aquarion Logos 2015 | 26 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  13 Posters  4 Recommendations   2007-04-13 Stigma of the Wind 8.1    2014-10-07 Yona of the Dawn 7.5  Facts Original Name  創聖のアクエリオン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://www.aquarion.info/ Genres Action & Adventure Animation Comedy Drama Sci-Fi & Fantasy Keywords anime watercolour style Content Score 93 Almost there... Top Contributors j 30 jnylen 20 miryoku 13 kappa-papa 11 Marr 🇳🇱  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}