{"link": "https://www.themoviedb.org/tv/33234?language=en", "title": "The Pillars of the Earth", "resume": "A sweeping epic of good and evil, treachery and intrigue, violence and beauty, a sensuous, spirited story set against a backdrop of war, religious strife and power struggles in 12th Century England.", "rate": 79, "genre": ["Drama"], "cast": ["Robert Bathurst", "Donald Sutherland", "Matthew Macfadyen", "Rufus Sewell", "Ian McShane"], "character": ["Percy Hamleigh", "Earl Bartholomew", "Prior Phillip", "Tom Builder", "Waleran Bigod"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33234   Expand The Pillars of the Earth   (2010) User Score Overview A sweeping epic of good and evil, treachery and intrigue, violence and beauty, a sensuous, spirited story set against a backdrop of war, religious strife and power struggles in 12th Century England. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  17 Posters  22 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Robert Bathurst Percy Hamleigh Donald Sutherland Earl Bartholomew Matthew Macfadyen Prior Phillip Rufus Sewell Tom Builder Ian McShane Waleran Bigod Full Cast & Crew Last Season Season 1 2010 | 8 Episodes Season 1 of The Pillars of the Earth premiered on July 23, 2010. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply f King Henry I's daughter Open 1 by  bratface Go to Discussions Media Most Popular Videos  0 Backdrops  17 Posters  22 Recommendations   2012-09-04 World Without End 6.8    2005-08-28 Rome 8.2    2005-06-10 Into the West 7.8    2011-06-24 The Borgias 7.5    2009-10-04 Emma 7.7    2010-09-26 Downton Abbey 8.0    2013-11-07 Folkets främsta företrädare 5.0    2016-04-25 After the Thrones 4.6  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Miniseries Original Language  English Runtime  60m Homepage   http://www.the-pillars-of-the-earth.tv/ Genres Drama Keywords based on novel or book england kingdom royalty religion miniseries middle ages historical drama 12th century Content Score 86 Almost there... Top Contributors TB 123 TMDb Bot 23 Banana R 12 Rebecca LB 11 Laszlo Balogh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}