{"link": "https://www.themoviedb.org/tv/246?language=en", "title": "Avatar: The Last Airbender", "resume": "In a war-torn world of elemental magic, a young boy reawakens to undertake a dangerous mystic quest to fulfill his destiny as the Avatar, and bring peace to the world.", "rate": 82, "genre": ["Action", "Adventure", "Animation", "Fantasy"], "cast": ["Zach Tyler", "Dante Basco", "Mae Whitman", "Jack De Sena", "Jessie Flower"], "character": ["Aang", "Zuko", "Katara", "Sokka", "Toph Beifong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 246   Expand Avatar: The Last Airbender   (2005) User Score Overview In a war-torn world of elemental magic, a young boy reawakens to undertake a dangerous mystic quest to fulfill his destiny as the Avatar, and bring peace to the world. Featured Crew Michael Dante DiMartino Creator Bryan Konietzko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  20 Posters  15 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Zach Tyler Aang Dante Basco Zuko Mae Whitman Katara Jack De Sena Sokka Jessie Flower Toph Beifong Full Cast & Crew Last Season Book Three: Fire 2007 | 21 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Which episode was the one that hooked you? Open 3 by  Tanguy Sayboot Go to Discussions Media Most Popular Videos  1 Backdrops  20 Posters  15 Recommendations   2012-04-14 The Legend of Korra 7.9    2009-04-05 Fullmetal Alchemist: Brotherhood 8.3    2003-10-04 Fullmetal Alchemist 8.0    2003-07-19 Teen Titans 7.6    2000-09-09 Jackie Chan Adventures 7.1    1999-03-28 Futurama 8.2    2015-10-04 One-Punch Man 8.2    2013-04-06 Attack on Titan 7.6  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  25m Homepage   http://www.nick.com/avatar-the-last-airbender/ Genres Action Adventure Animation Fantasy Keywords friendship fantasy martial arts saving the world magic monk asia child hero reincarnation honor destiny Content Score 100 Yes! Looking good! Top Contributors 36 rtentser 24 Elizabeth Jennings 17 Claudio AK 17 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}