{"link": "https://www.themoviedb.org/tv/19092?language=en", "title": "FlashForward", "resume": "When the entire world blacks out for two minutes and seventeen seconds, everyone sees a flash of their own future 6 months from the present. For some, the future is hopeful, while for others, it is unexpected. For a few, it doesn't seem to exist. Knowing their fate will alter each person's life, destinies will be changed.", "rate": 69, "genre": ["Drama"], "cast": ["Courtney B. Vance", "Jack Davenport", "Sonya Walger", "John Cho", "Brían F. O'Byrne"], "character": ["Stanford Wedeck", "Lloyd Simcoe", "Olivia Benford", "Demetri Noh", "Aaron Stark"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19092   Expand FlashForward   (2009) User Score Overview When the entire world blacks out for two minutes and seventeen seconds, everyone sees a flash of their own future 6 months from the present. For some, the future is hopeful, while for others, it is unexpected. For a few, it doesn't seem to exist. Knowing their fate will alter each person's life, destinies will be changed. Featured Crew David S. Goyer Creator Brannon Braga Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  19 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Courtney B. Vance Stanford Wedeck Jack Davenport Lloyd Simcoe Sonya Walger Olivia Benford John Cho Demetri Noh Brían F. O'Byrne Aaron Stark Full Cast & Crew Last Season Season 1 2009 | 22 Episodes Season 1 of FlashForward premiered on September 24, 2009. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply R Another great show cancelled Open 0 by Rickers\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  19 Posters  8 Recommendations   2009-11-03 V 6.2    2010-09-20 The Event 6.2    2006-09-20 Jericho 7.5    2006-09-25 Heroes 6.9    2010-01-22 Caprica 6.7    2004-07-11 The 4400 6.9    2011-09-26 Terra Nova 6.3    2008-11-23 Survivors 7.2  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://abc.go.com/shows/flashforward Genres Drama Keywords fbi blackout future vision strange event Content Score 100 Yes! Looking good! Top Contributors 28 lineker 17 Banana 7 Atanas M 5 Maria180493  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}