{"link": "https://www.themoviedb.org/tv/2188?language=en", "title": "Tru Calling", "resume": "Tru Calling is an American television supernatural drama series that was shown on the Fox Network from 2003 to 2005. Created by Jon Harmon Feldman, the series was produced by Original Film, Oh That Gus!, Inc., and 20th Century Fox Television.\nThe show starred Eliza Dushku as Tru Davies, a woman who works at the city morgue. In the course of her job, the bodies of dead people start talking to Tru, asking her for help. Tru then finds herself reliving their last day alive, trying to keep their death from happening.", "rate": 72, "genre": ["Drama", "Sci-Fi", "Fantasy", "Mystery"], "cast": ["Eliza Dushku", "Zach Galifianakis", "Shawn Reaves", "Jason Priestley"], "character": ["Tru Davies", "Davis", "Harrison Davies", "Jack Harper"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2188   Expand Tru Calling   (2003) User Score Overview Tru Calling is an American television supernatural drama series that was shown on the Fox Network from 2003 to 2005. Created by Jon Harmon Feldman, the series was produced by Original Film, Oh That Gus!, Inc., and 20th Century Fox Television. The show starred Eliza Dushku as Tru Davies, a woman who works at the city morgue. In the course of her job, the bodies of dead people start talking to Tru, asking her for help. Tru then finds herself reliving their last day alive, trying to keep their death from happening. Featured Crew Jon Harmon Feldman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eliza Dushku Tru Davies Zach Galifianakis Davis Shawn Reaves Harrison Davies Jason Priestley Jack Harper Full Cast & Crew Last Season Season 2 2005 | 6 Episodes Season 2 of Tru Calling premiered on March 31, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  5 Recommendations   1999-10-06 Roswell 7.0    2002-06-16 The Dead Zone 6.5    1999-10-05 Angel 7.6    2000-10-03 Dark Angel 7.2    2005-09-19 Invasion 6.9    2001-03-04 The Lone Gunmen 6.9    2004-07-11 The 4400 6.9    1985-03-03 Moonlighting 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage  - Genres Drama Sci-Fi & Fantasy Mystery Keywords morgue psychic power saving lives Content Score 93 Almost there... Top Contributors 20 United600 T 14 Thuresson 10 Banana 7 AxeL Wave  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}