{"link": "https://www.themoviedb.org/tv/78475?language=en", "title": "The Scales of Nil Admirari ~The Mysterious Story of Teito~", "resume": "It's the 25th year of the Taisho Era in Imperial Tokyo.  Kuze Tsugumi, daughter of aristocrats, agrees to be married to save her family from decline. But before she goes through with it, her younger brother Hitaki gets her involved in an incident caused by a \"maremono,\" a type of book that casts a great influence on whoever reads it.  As a result, Tsugumi gains the power to see \"aura,\" a light that represents the emotions that dwell within a maremono.  This is the story of a woman whose destiny seems to sway up and down, as if on the delicate balance of a scale.", "rate": 80, "genre": ["Animation"], "cast": ["Ryota Ohsaka", "Nobuhiko Okamoto", "Juri Kimura", "Kenichi Suzumura", "Yuuki Kaji"], "character": ["Hisui Hoshikawa", "Akira Kougami", "Tsugumi Kuze", "Shizuru Migiwa", "Hayato Ozaki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78475   Expand The Scales of Nil Admirari ~The Mysterious Story of Teito~   (2018) User Score Overview It's the 25th year of the Taisho Era in Imperial Tokyo.  Kuze Tsugumi, daughter of aristocrats, agrees to be married to save her family from decline. But before she goes through with it, her younger brother Hitaki gets her involved in an incident caused by a \"maremono,\" a type of book that casts a great influence on whoever reads it.  As a result, Tsugumi gains the power to see \"aura,\" a light that represents the emotions that dwell within a maremono.  This is the story of a woman whose destiny seems to sway up and down, as if on the delicate balance of a scale. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ryota Ohsaka Hisui Hoshikawa Nobuhiko Okamoto Akira Kougami Juri Kimura Tsugumi Kuze Kenichi Suzumura Shizuru Migiwa Yuuki Kaji Hayato Ozaki Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of The Scales of Nil Admirari ~The Mysterious Story of Teito~ premiered on April  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Scales of Nil Admirari ~The Mysterious Story of Teito~. You can help by rating TV shows you've seen. Facts Original Name  ニル・アドミラリの天秤 帝都幻惑綺譚 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://nilad-anime.com/ Genres Animation Keywords fantasy romance historical game based on visual novel Content Score 86 Almost there... Top Contributors 32 neonime 8 sp1ti 5 Despair-Paradise 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}