{"link": "https://www.themoviedb.org/tv/4582?language=en", "title": "Ironside", "resume": "Ironside is a Universal television series that ran on NBC from September 14, 1967 to January 16, 1975. The show starred Raymond Burr as a paraplegic Chief of Detectives, Robert T. Ironside. The character debuted on March 28, 1967 in a TV movie. When broadcast in the United Kingdom the show was initially titled A Man Called Ironside. The show earned Burr six Emmy and two Golden Globe nominations.\nA new television series having the same name, Ironside is currently under development and is scheduled to debut on October 2, 2013.", "rate": 76, "genre": ["Drama"], "cast": ["Raymond Burr", "Don Galloway", "Don Mitchell", "Barbara Anderson", "Elizabeth Baur"], "character": ["Eve Whitfield", "Fran Belding"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4582   Expand Ironside   (1967) User Score Overview Ironside is a Universal television series that ran on NBC from September 14, 1967 to January 16, 1975. The show starred Raymond Burr as a paraplegic Chief of Detectives, Robert T. Ironside. The character debuted on March 28, 1967 in a TV movie. When broadcast in the United Kingdom the show was initially titled A Man Called Ironside. The show earned Burr six Emmy and two Golden Globe nominations. A new television series having the same name, Ironside is currently under development and is scheduled to debut on October 2, 2013. Featured Crew Collier Young Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Raymond Burr Don Galloway Don Mitchell Barbara Anderson Eve Whitfield Elizabeth Baur Fran Belding Full Cast & Crew Last Season Season 8 1974 | 19 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1970-09-16 McCloud 7.0    1979-09-22 Hart to Hart 6.5    1973-10-24 Kojak 7.4    1968-01-09 It Takes a Thief 7.4    1971-09-17 McMillan & Wife 7.2    1976-10-03 Quincy, M.E. 7.0    1972-09-16 The Streets of San Francisco 7.1    1965-09-17 The Wild Wild West 7.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords police san francisco police detective disabled Content Score 93 Almost there... Top Contributors 11 Banana m 9 mode2 6 jack denis S 4 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}