{"link": "https://www.themoviedb.org/tv/7831?language=en", "title": "Dead Set", "resume": "Dead Set is a critically acclaimed BAFTA-nominated British television black comic horror drama created by Charlie Brooker.\nThe show takes place primarily on the set of a fictional series of the real television show Big Brother. The five episodes, aired over five consecutive nights, chronicle a zombie outbreak that strands the housemates and production staff inside the Big Brother House, which quickly becomes a shelter from the undead.\nDead Set is a production of Zeppotron, part of the Endemol group of production and distribution companies that produces the actual Big Brother. Dead Set first aired on E4 starting on 27 October 2008, just six weeks after the end of Big Brother 2008 on that same channel.", "rate": 75, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Kevin Eldon", "Beth Cordingly", "Warren Brown", "Riz Ahmed", "Elyes Gabel"], "character": ["Joplin", "Veronica", "Marky", "Riq", "Danny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7831   Expand Dead Set   (2008) User Score  Play Trailer Overview Dead Set is a critically acclaimed BAFTA-nominated British television black comic horror drama created by Charlie Brooker. The show takes place primarily on the set of a fictional series of the real television show Big Brother. The five episodes, aired over five consecutive nights, chronicle a zombie outbreak that strands the housemates and production staff inside the Big Brother House, which quickly becomes a shelter from the undead. Dead Set is a production of Zeppotron, part of the Endemol group of production and distribution companies that produces the actual Big Brother. Dead Set first aired on E4 starting on 27 October 2008, just six weeks after the end of Big Brother 2008 on that same channel. Featured Crew Charlie Brooker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  14 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Eldon Joplin Beth Cordingly Veronica Warren Brown Marky Riz Ahmed Riq Elyes Gabel Danny Full Cast & Crew Last Season Season 1 2008 | 5 Episodes Season 1 of Dead Set premiered on October 27, 2008. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Dead Set. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  14 Posters  9 Recommendations   1981-09-10 The Day of the Triffids 6.7    2006-12-11 The Lost Room 7.7    1994-05-08 The Stand 6.8    2009-12-28 The Day of the Triffids 5.6    2009-08-02 Defying Gravity 6.6    2009-04-09 Harper's Island 6.9    2015-09-30 You, Me and the Apocalypse 7.2    2004-07-19 The Grid 7.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  25m, 45m Homepage   http://www.e4.com/deadset/ Genres Comedy Drama Sci-Fi & Fantasy Keywords dark comedy reality tv satire big brother social commentary miniseries zombie producer Content Score 100 Yes! Looking good! Top Contributors 37 Banana TB 15 TMDb Bot O 10 Ozbourne CM 8 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}