{"link": "https://www.themoviedb.org/tv/64101?language=en", "title": "The Block NZ", "resume": "The Block NZ is the first local version of an international hit renovation-reality series in which four couples compete to renovate four dilapidated houses in a very upmarket suburb – room by room, week by week, challenge by challenge – and sell them at auction for the highest price.\nThe teams can be couples, family members, or friends, and do not need any DIY experience. Once selected, the contestants live and breathe their DIY project for the nine week shoot, living on site in The Block NZ houses. There are no further eliminations, and the winning couple is decided by the toughest judge of all, the real estate market!\nAll four renovated houses go to a live TV auction, with The Block NZ crown going to the couple whose house fetches the highest price on the night!. All the couples receive profits from the sale of their house at the televised auction, and the winners will take home an additional cash prize of $80,000.", "rate": 43, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64101   Expand The Block NZ   (2012) User Score Overview The Block NZ is the first local version of an international hit renovation-reality series in which four couples compete to renovate four dilapidated houses in a very upmarket suburb – room by room, week by week, challenge by challenge – and sell them at auction for the highest price. The teams can be couples, family members, or friends, and do not need any DIY experience. Once selected, the contestants live and breathe their DIY project for the nine week shoot, living on site in The Block NZ houses. There are no further eliminations, and the winning couple is decided by the toughest judge of all, the real estate market! All four renovated houses go to a live TV auction, with The Block NZ crown going to the couple whose house fetches the highest price on the night!. All the couples receive profits from the sale of their house at the televised auction, and the winners will take home an additional cash prize of $80,000. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 5 2016 | 3 Episodes Season 5 of The Block NZ premiered on May 29, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Block NZ. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.tv3.co.nz/Shows/TheBlockNZVillaWars.aspx Genres Reality Keywords renovation Content Score 56 We're so close, yet so far. Top Contributors g 25 gallagher 2 Banana EL 2 Erica L Thompson 2 kzhu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}