{"link": "https://www.themoviedb.org/tv/7087?language=en", "title": "Being Human", "resume": "The central premise of Being Human is that various types of supernatural beings exist alongside human beings, with varying degrees of menace; that three of these supernatural beings are opting to live amongst human beings rather than apart from them; and that these three characters are attempting (as much as is possible) to live ordinary human lives despite the pressures and dangers of their situations. They are constantly threatened with exposure or persecution, with pressure from other supernatural creatures, and with problems caused by their attempts to deal with their own natures.", "rate": 70, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Jason Watkins", "Sinead Keenan", "Amy Manson", "Annabel Scholey", "Michael Socha"], "character": ["William Herrick", "Nina Pickering", "Daisy", "Tom"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7087   Expand Being Human   (2009) User Score  Play Trailer Overview The central premise of Being Human is that various types of supernatural beings exist alongside human beings, with varying degrees of menace; that three of these supernatural beings are opting to live amongst human beings rather than apart from them; and that these three characters are attempting (as much as is possible) to live ordinary human lives despite the pressures and dangers of their situations. They are constantly threatened with exposure or persecution, with pressure from other supernatural creatures, and with problems caused by their attempts to deal with their own natures. Featured Crew Toby Whithouse Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  11 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Watkins William Herrick Sinead Keenan Nina Pickering Amy Manson Daisy Annabel Scholey Michael Socha Tom Full Cast & Crew Last Season Season 5 2013 | 6 Episodes Season 5 of Being Human premiered on February  3, 2013. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Just started watching. Open 8 by  write2topcat The books Open 0 by ApathyandBeyond\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  10 Recommendations   2011-01-17 Being Human 5.8    2007-09-25 Reaper 7.0    2006-09-28 Ugly Betty 5.5    2006-10-22 Torchwood 7.4    2009-02-13 Dollhouse 7.2    2003-06-27 Dead Like Me 7.8    2007-10-02 Pushing Daisies 7.8    2009-11-24 Paradox 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00hqlc4 Genres Drama Mystery Sci-Fi & Fantasy Keywords wales vampire roommate supernatural supernatural powers house europe hospital best friend werewolf united kingdom ghost bristol roommate relationship 21st century Content Score 100 Yes! Looking good! Top Contributors 35 Elizabeth Jennings L 22 Law 20 david8s95 8 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}