{"link": "https://www.themoviedb.org/tv/7677?language=en", "title": "We Got Married", "resume": "We Got Married is a South Korean reality variety show, one segment of the Sunday Sunday Night program. First broadcast in 2008, the show pairs up Korean celebrities to show what life would be like if they were married. Each week, couples are assigned missions to complete, with candid interviews of the participants to reveal their thoughts and feelings.", "rate": 33, "genre": ["Reality"], "cast": ["Eric Nam", "Solar", "Jo Se-ho", "Cao Lu", "Kwak Si-yang"], "character": ["Himself", "Herself", "Himself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7677   Expand We Got Married   (2008) User Score Overview We Got Married is a South Korean reality variety show, one segment of the Sunday Sunday Night program. First broadcast in 2008, the show pairs up Korean celebrities to show what life would be like if they were married. Each week, couples are assigned missions to complete, with candid interviews of the participants to reveal their thoughts and feelings. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Nam Himself Solar Herself Jo Se-ho Himself Cao Lu Herself Kwak Si-yang Himself Full Cast & Crew Last Season Season 4 2012 | 241 Episodes Season 4 of We Got Married premiered on September  1, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on We Got Married. You can help by rating TV shows you've seen. Facts Original Name  우리 결혼했어요 Status  Returning Series Network Certification  - Type  Reality Original Language  Korean Runtime  85m Homepage   http://www.imbc.com/broad/tv/ent/wedding Genres Reality Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 114 Ly t 11 tmdb983464 3 Elizabeth Jennings TB 2 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}