{"link": "https://www.themoviedb.org/tv/6172?language=en", "title": "The Scooby-Doo Show", "resume": "The Scooby-Doo Show is the blanket name for the episodes from the third incarnation of the Hanna-Barbera Saturday morning cartoon Scooby-Doo. A total of 40 episodes ran for three seasons, from 1976 to 1978, on ABC, marking the first Scooby series to appear on the network. Sixteen episodes were produced as segments of The Scooby-Doo/Dynomutt Hour in 1976, eight episodes were produced as segments of Scooby's All-Star Laff-A-Lympics in 1977 and sixteen episodes were produced in 1978, with nine of them running by themselves under the Scooby-Doo, Where Are You! name and the final seven as segments of Scooby's All-Stars.\nDespite the yearly changes in the way they were broadcast, the 1976–1978 stretch of Scooby episodes represents, at three seasons, the longest-running format of the original show before the addition of Scrappy-Doo. The episodes from all three seasons have been rerun under the title The Scooby-Doo Show since 1980; these Scooby episodes did not originally air under this title. The credits on these syndicated versions all feature a 1976 copyright date, even though some were originally produced in 1977 and 1978. Reruns are currently air on Boomerang.\nLike many animated series created by Hanna-Barbera in the 1970s, the show contained a laugh track created by the studio.", "rate": 78, "genre": ["Animation", "Mystery", "Comedy"], "cast": ["Casey Kasem", "Heather North", "Pat Stevens", "Don Messick", "Daws Butler"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6172   Expand The Scooby-Doo Show   (1976) User Score Overview The Scooby-Doo Show is the blanket name for the episodes from the third incarnation of the Hanna-Barbera Saturday morning cartoon Scooby-Doo. A total of 40 episodes ran for three seasons, from 1976 to 1978, on ABC, marking the first Scooby series to appear on the network. Sixteen episodes were produced as segments of The Scooby-Doo/Dynomutt Hour in 1976, eight episodes were produced as segments of Scooby's All-Star Laff-A-Lympics in 1977 and sixteen episodes were produced in 1978, with nine of them running by themselves under the Scooby-Doo, Where Are You! name and the final seven as segments of Scooby's All-Stars. Despite the yearly changes in the way they were broadcast, the 1976–1978 stretch of Scooby episodes represents, at three seasons, the longest-running format of the original show before the addition of Scrappy-Doo. The episodes from all three seasons have been rerun under the title The Scooby-Doo Show since 1980; these Scooby episodes did not originally air under this title. The credits on these syndicated versions all feature a 1976 copyright date, even though some were originally produced in 1977 and 1978. Reruns are currently air on Boomerang. Like many animated series created by Hanna-Barbera in the 1970s, the show contained a laugh track created by the studio. Featured Crew Ken Spears Creator Joe Ruby Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Casey Kasem Heather North Pat Stevens Don Messick Daws Butler Full Cast & Crew Last Season Season 3 1978 | 16 Episodes Season 3 of The Scooby-Doo Show premiered on September  9, 1978. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   1979-09-22 Scooby-Doo and Scrappy-Doo 7.0  Facts Status  Ended Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  - Homepage  - Genres Animation Mystery Comedy Keywords cartoon dog classic tv crime solving Content Score 93 Almost there... Top Contributors m 11 miroslav.kakas@gmail.com 7 Banana 6 Ibuddy66 6 guyltlh  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}