{"link": "https://www.themoviedb.org/tv/609?language=en", "title": "Green Acres", "resume": "Green Acres is an American sitcom starring Eddie Albert and Eva Gabor as a couple who move from New York City to a rural country farm. Produced by Filmways as a sister show to Petticoat Junction, the series was first broadcast on CBS, from September 15, 1965 to April 27, 1971.\nReceiving solid ratings during its six-year run, Green Acres was cancelled in 1971 as part of the \"rural purge\" by CBS. The sitcom has been in syndication and is available in DVD and VHS releases. In 1997, the two-part episode \"A Star Named Arnold is Born\" was ranked #59 on TV Guide's 100 Greatest Episodes of All Time.", "rate": 72, "genre": ["Comedy"], "cast": ["Eddie Albert", "Eva Gabor", "Tom Lester", "Frank Cady"], "character": ["Oliver Wendell Douglas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 609   Expand Green Acres   (1965) User Score Overview Green Acres is an American sitcom starring Eddie Albert and Eva Gabor as a couple who move from New York City to a rural country farm. Produced by Filmways as a sister show to Petticoat Junction, the series was first broadcast on CBS, from September 15, 1965 to April 27, 1971. Receiving solid ratings during its six-year run, Green Acres was cancelled in 1971 as part of the \"rural purge\" by CBS. The sitcom has been in syndication and is available in DVD and VHS releases. In 1997, the two-part episode \"A Star Named Arnold is Born\" was ranked #59 on TV Guide's 100 Greatest Episodes of All Time. Featured Crew Jay Sommers Creator Paul Henning Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  8 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eddie Albert Oliver Wendell Douglas Eva Gabor Tom Lester Frank Cady Full Cast & Crew Last Season Season 6 1970 | 26 Episodes Season 6 of Green Acres premiered on September 15, 1970. View All Seasons Social Reviews  1 Discussions  9 A review by safeinsanity  10.0 Written by  safeinsanity  on March 25, 2017 Weren't we so lucky to grow up having shows like  Green Acres  to watch everyday when we were kids? This show was truly funny and everytime I watch it now it gives me that warm feeling of being a kid sitting on the floor in front of the TV and laughing at these amazing character actors who we were also blessed to have like Eddie Albert as  Oliver Douglas  and  Eva Gabor as  Lisa Douglas . Nobody today could ever be as funny as they were together playing this role. The show itself was also amazingly written and a totally different kind of situation comedy for it's time. We never seen anyth...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   1970-09-24 The Odd Couple 7.1    1960-09-29 My Three Sons 6.0    1957-10-04 Leave It to Beaver 7.1    1968-09-21 Adam-12 6.7    1963-09-24 Petticoat Junction 5.7    1967-09-11 The Carol Burnett Show 7.8    1976-01-27 Laverne & Shirley 6.7    1959-10-04 Dennis, The Menace 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Keywords farm country life sitcom simpler life Content Score 93 Almost there... Top Contributors 11 Banana 4 lineker m 3 morrison 3 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}