{"link": "https://www.themoviedb.org/tv/6467?language=en", "title": "Chicago Hope", "resume": "Chicago Hope is an American medical drama television series, created by David E. Kelley. It ran on CBS from September 18, 1994, to May 4, 2000. The series is set in a fictional private charity hospital in Chicago, Illinois. The show is set to return in the fall of 2013 on TVGN in reruns.", "rate": 73, "genre": ["Soap", "Drama"], "cast": ["Jayne Brook", "Christine Lahti", "Mandy Patinkin", "Adam Arkin", "Mark Harmon"], "character": ["Dr. Diane Grad", "Dr. Kathryn Austin", "Dr. Jeffrey Geiger", "Dr. Aaron Shutt", "Dr. Jack McNeil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6467   Expand Chicago Hope   (1994) User Score Overview Chicago Hope is an American medical drama television series, created by David E. Kelley. It ran on CBS from September 18, 1994, to May 4, 2000. The series is set in a fictional private charity hospital in Chicago, Illinois. The show is set to return in the fall of 2013 on TVGN in reruns. Featured Crew David E. Kelley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jayne Brook Dr. Diane Grad Christine Lahti Dr. Kathryn Austin Mandy Patinkin Dr. Jeffrey Geiger Adam Arkin Dr. Aaron Shutt Mark Harmon Dr. Jack McNeil Full Cast & Crew Last Season Season 6 1999 | 22 Episodes Season 6 of Chicago Hope premiered on September 23, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1972-09-09 Fat Albert and the Cosby Kids 8.0    2000-10-08 Ed 7.7    1994-09-21 Touched by an Angel 5.3    1996-09-16 Judge Judy 5.0    1995-09-21 Caroline in the City 6.7    1993-01-01 Dr. Quinn, Medicine Woman 6.2    2005-06-13 The Closer 7.0    1993-09-21 NYPD Blue 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Soap Drama Keywords chicago medicine hospital doctor medical drama Content Score 93 Almost there... Top Contributors 24 Banana 12 uforock m 9 mode2 7 tbonus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}