{"link": "https://www.themoviedb.org/tv/5028?language=en", "title": "Storm of the Century", "resume": "Storm of the Century, alternatively known as Stephen King's Storm of the Century, is a 1999 horror TV miniseries written by Stephen King and directed by Craig R. Baxley. Unlike many other King mini-series, Storm of the Century was not based upon a Stephen King novel—King wrote it as a screenplay from the beginning. The screenplay was published in February 1999.", "rate": 70, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Debrah Farentino", "Tim Daly", "Colm Feore", "Casey Siemaszko", "Jeffrey DeMunn"], "character": ["Molly Anderson", "Constable Mike Anderson", "Andre Linoge (Human & Monster Form)", "Alton 'Hatch' Hatcher", "Town Manager Robbie Beals"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5028   Expand Storm of the Century   (1999) User Score  Play Trailer Overview Storm of the Century, alternatively known as Stephen King's Storm of the Century, is a 1999 horror TV miniseries written by Stephen King and directed by Craig R. Baxley. Unlike many other King mini-series, Storm of the Century was not based upon a Stephen King novel—King wrote it as a screenplay from the beginning. The screenplay was published in February 1999. Featured Crew Stephen King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  3 Posters  10 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Debrah Farentino Molly Anderson Tim Daly Constable Mike Anderson Colm Feore Andre Linoge (Human & Monster Form) Casey Siemaszko Alton 'Hatch' Hatcher Jeffrey DeMunn Town Manager Robbie Beals Full Cast & Crew Last Season Season 1 1999 | 3 Episodes Season 1 of Storm of the Century premiered on February 14, 1999. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply S Why did he target Martha Clarendon first? Open 0 by Strannger18\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  10 Recommendations   2002-01-27 Rose Red 6.6    1993-05-09 The Tommyknockers 5.1    1994-05-08 The Stand 6.8    1997-04-27 The Shining 6.0    1995-05-14 The Langoliers 5.9    2004-06-20 Salem's Lot 5.5    1989-06-10 Tales from the Crypt 7.7    Stephen King's Desperation 5.7  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  256m, 240m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords secret suicide island based on novel or book sacrifice parent child relationship winter village snow storm cane murder jail snow miniseries voting storm demon blizzard mysterious stranger Content Score 100 Yes! Looking good! Top Contributors 24 Negan TB 22 TMDb Bot PS 14 P. Snoopy c 6 crazymouse  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}