{"link": "https://www.themoviedb.org/tv/64958?language=en", "title": "MasterChef Canada", "resume": "Amateur chefs compete in this Canadian version of the reality-cooking series.Thousands of cooks from across the country apply, but only the Top contenders are asked to audition for the MasterChef Canada judges. Each participant presents their signature dish in hopes of earning a coveted white apron. Only the most talented and creative home cooks will move forward to the MasterChef Canada Kitchen. Each week, the MasterChef Canada judges inspire the home cooks to grow and evolve, pushing them toward culinary greatness. Internationally-acclaimed chefs and restaurateurs Michael Bonacini (co-owner of the Oliver & Bonacini restaurant empire), Claudio Aprile (chef/owner of the celebrated Origin restaurants) and Alvin Leung (owner of the Michelin-starred Bo Innovation in Hong Kong) are the firm-but-fair mentors who take these amateurs on a journey from home cook to haute cuisine.", "rate": 50, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64958   Expand MasterChef Canada   (2014) User Score  Play Trailer Overview Amateur chefs compete in this Canadian version of the reality-cooking series.Thousands of cooks from across the country apply, but only the Top contenders are asked to audition for the MasterChef Canada judges. Each participant presents their signature dish in hopes of earning a coveted white apron. Only the most talented and creative home cooks will move forward to the MasterChef Canada Kitchen. Each week, the MasterChef Canada judges inspire the home cooks to grow and evolve, pushing them toward culinary greatness. Internationally-acclaimed chefs and restaurateurs Michael Bonacini (co-owner of the Oliver & Bonacini restaurant empire), Claudio Aprile (chef/owner of the celebrated Origin restaurants) and Alvin Leung (owner of the Michelin-starred Bo Innovation in Hong Kong) are the firm-but-fair mentors who take these amateurs on a journey from home cook to haute cuisine. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 5 2018 | 12 Episodes Season 5 of MasterChef Canada premiered on April  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on MasterChef Canada. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://masterchefcanada.ctv.ca/ Genres Reality Keywords cooking food Content Score 64 We're so close, yet so far. Top Contributors 22 szab 10 oldboy3 4 Michael d 4 diwasta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}