{"link": "https://www.themoviedb.org/tv/60557?language=en", "title": "Witches of East End", "resume": "Based on Melissa de la Cruz's best-selling novel, \"Witches of East End\" centers on the adventures of Joanna Beauchamp and her two adult daughters Freya and Ingrid -- both of whom unknowingly are their family's next generation of witches -- who lead seemingly quiet, uneventful modern day lives in Long Island's secluded seaside town of East Haven. When Freya becomes engaged to a young, wealthy newcomer, a series of events forces Joanna to admit to her daughters they are, in fact, powerful and immortal witches.", "rate": 68, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Julia Ormond", "Jenna Dewan", "Eric Winter", "Rachel Boston", "Daniel DiTomasso"], "character": ["Joanna Beauchamp", "Freya Beauchamp", "Dash Gardiner", "Ingrid Beauchamp", "Killian Gardiner (as Daniel Di Tomasso)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60557   Expand Witches of East End   (2013) User Score  Play Trailer Overview Based on Melissa de la Cruz's best-selling novel, \"Witches of East End\" centers on the adventures of Joanna Beauchamp and her two adult daughters Freya and Ingrid -- both of whom unknowingly are their family's next generation of witches -- who lead seemingly quiet, uneventful modern day lives in Long Island's secluded seaside town of East Haven. When Freya becomes engaged to a young, wealthy newcomer, a series of events forces Joanna to admit to her daughters they are, in fact, powerful and immortal witches. Featured Crew Mark S. Waters Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Julia Ormond Joanna Beauchamp Jenna Dewan Freya Beauchamp Eric Winter Dash Gardiner Rachel Boston Ingrid Beauchamp Daniel DiTomasso Killian Gardiner (as Daniel Di Tomasso) Full Cast & Crew Last Season Season 2 2014 | 13 Episodes Season 2 of Witches of East End premiered on July  6, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations   2011-09-15 The Secret Circle 6.6    2013-10-25 Dracula 5.9    2014-02-17 Star-Crossed 5.6    2013-10-09 The Tomorrow People 6.6    2013-09-16 Sleepy Hollow 6.4    2010-09-12 Lost Girl 6.7    2015-06-02 Stitchers 6.3    2014-03-10 Believe 6.3  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.mylifetime.com/shows/witches-of-east-end Genres Drama Sci-Fi & Fantasy Keywords witch good vs evil magic immortality spell star crossed lovers family curse Content Score 100 Yes! Looking good! Top Contributors 247 seawolf 15 Elizabeth Jennings 11 CouchTater 8 Medianoche  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}