{"link": "https://www.themoviedb.org/tv/39362?language=en", "title": "Alphas", "resume": "Five ordinary people with superhuman physical and mental abilities are brought together to form one extraordinary team of Alphas. Operating within the U.S. Department of Defense, the team investigates cases that point to others with Alpha abilities.", "rate": 67, "genre": ["Sci-Fi", "Fantasy", "Drama", "Action", "Adventure"], "cast": ["Warren Christie", "Azita Ghanizada", "Malik Yoba", "Laura Mennell", "Ryan Cartwright"], "character": ["Cameron Hicks", "Rachel Pirzad", "Bill Harken", "Nina Theroux", "Gary Bell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39362   Expand Alphas   (2011) User Score  Play Trailer Overview Five ordinary people with superhuman physical and mental abilities are brought together to form one extraordinary team of Alphas. Operating within the U.S. Department of Defense, the team investigates cases that point to others with Alpha abilities. Featured Crew Zak Penn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  18 Posters  17 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Warren Christie Cameron Hicks Azita Ghanizada Rachel Pirzad Malik Yoba Bill Harken Laura Mennell Nina Theroux Ryan Cartwright Gary Bell Full Cast & Crew Last Season Season 2 2012 | 13 Episodes Season 2 of Alphas premiered on July 23, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Alphas. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  18 Posters  17 Recommendations   2009-07-07 Warehouse 13 7.2    2013-10-09 The Tomorrow People 6.6    2000-10-03 Dark Angel 7.2    2012-05-27 Continuum 7.1    2004-07-11 The 4400 6.9    2010-07-09 Haven 7.0    2006-07-18 Eureka 7.4    2008-10-03 Sanctuary 6.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.syfy.com/alphasseries Genres Sci-Fi & Fantasy Drama Action & Adventure Keywords superhuman criminal investigation Content Score 100 Yes! Looking good! Top Contributors t 12 tmdb91800355 10 Victor 10 Banana 6 Atanas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}