{"link": "https://www.themoviedb.org/tv/500?language=en", "title": "Mad About You", "resume": "Mad About You is an American sitcom that aired on NBC from September 23, 1992 to May 24, 1999. The show stars Paul Reiser and Helen Hunt as a newly married couple in New York City. Reiser played Paul Buchman, a documentary film maker. Hunt played Jamie Stemple Buchman, a public relations specialist. Near the end of the show's run, the couple had a baby daughter, whom they named Mabel.\nThe series focuses mainly on the newlyweds while they dealt with everything from humorous daily minutiae to major struggles. The show's willingness to find comedy in realistic situations and observational dialogue garnered it comparisons to Seinfeld, another NBC comedy about thirty-somethings in New York City.\nHelen Hunt and Paul Reiser were paid $1 million per episode for the last season. However, ratings fell sharply that year as the series was shuffled away from its Tuesday slot to prop up a fledgling Monday night line-up of comedies on NBC. The final episode of the series was \"The Final Frontier\".\nThe show's theme song, \"Final Frontier\", was composed by Reiser and Don Was. The theme was originally performed by Andrew Gold, but a version performed by Anita Baker made its debut midway through the 1997 season. Baker's version was used for the rest of the show's run and appears on the show's soundtrack album. Gold's version is available on the collection Thank You for Being a Friend: The Best of Andrew Gold.", "rate": 61, "genre": ["Comedy"], "cast": ["Helen Hunt", "Anne Ramsay", "John Pankow", "Paul Reiser", "Leila Kenzle"], "character": ["Jamie Stemple Buchman", "Lisa Stemple", "Ira Buchman", "Paul Buchman", "Fran Devanow"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 500   Expand Mad About You   (1992) User Score Overview Mad About You is an American sitcom that aired on NBC from September 23, 1992 to May 24, 1999. The show stars Paul Reiser and Helen Hunt as a newly married couple in New York City. Reiser played Paul Buchman, a documentary film maker. Hunt played Jamie Stemple Buchman, a public relations specialist. Near the end of the show's run, the couple had a baby daughter, whom they named Mabel. The series focuses mainly on the newlyweds while they dealt with everything from humorous daily minutiae to major struggles. The show's willingness to find comedy in realistic situations and observational dialogue garnered it comparisons to Seinfeld, another NBC comedy about thirty-somethings in New York City. Helen Hunt and Paul Reiser were paid $1 million per episode for the last season. However, ratings fell sharply that year as the series was shuffled away from its Tuesday slot to prop up a fledgling Monday night line-up of comedies on NBC. The final episode of the series was \"The Final Frontier\". The show's theme song, \"Final Frontier\", was composed by Reiser and Don Was. The theme was originally performed by Andrew Gold, but a version performed by Anita Baker made its debut midway through the 1997 season. Baker's version was used for the rest of the show's run and appears on the show's soundtrack album. Gold's version is available on the collection Thank You for Being a Friend: The Best of Andrew Gold. Featured Crew Paul Reiser Creator Danny Jacobson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  7 Images Backdrops  3 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Helen Hunt Jamie Stemple Buchman Anne Ramsay Lisa Stemple John Pankow Ira Buchman Paul Reiser Paul Buchman Leila Kenzle Fran Devanow Full Cast & Crew Last Season Season 7 1998 | 22 Episodes Season 7 of Mad About You premiered on September 22, 1998. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Jamie: Happy Birthday Helen Hunt! Open 0 by wonder2wonder\n      \n     L Jamie was a saint for putting up with Paul's mother. Open 0 by Lloyd\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  10 Recommendations   1997-09-24 Dharma & Greg 5.9    1998-09-21 Will & Grace 6.5    1996-09-13 Everybody Loves Raymond 6.3    1995-03-21 NewsRadio 7.3    1996-01-09 3rd Rock from the Sun 7.3    1997-09-08 Ally McBeal 5.9    1984-09-20 The Cosby Show 6.8    1996-09-17 Spin City 7.0  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  20m, 30m Homepage  - Genres Comedy Keywords new york marriage just married newlywed sitcom Content Score 93 Almost there... Top Contributors 16 Banana r 14 rick555 4 dzero 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}