{"link": "https://www.themoviedb.org/tv/47990?language=en", "title": "Grand Hotel", "resume": "Grand Hotel is a Spanish drama television series directed by Carlos Sedes and starring Yon Gonzalez and Amaia Salamanca. It first aired on Antena 3 in Spain on 11 October 2011 and on Sky Arts 1 in the UK on 18 November 2012.\nThe series, filmed at the Palacio de la Magdalena in Santander, is set in an early 20th century aristocratic hotel during the reign of King Alfonso XIII and is centered on the mysteries that involve the owner family and the hotel servants. Grand Hotel has received critical acclaim from television critics and won numerous accolades.", "rate": 74, "genre": ["Drama"], "cast": ["Adriana Ozores", "Amaia Salamanca", "Yon González", "Eloy Azorín", "Fele Martínez"], "character": ["Doña Teresa", "Alicia Alarcón", "Julio Olmedo", "Javier Alarcón", "Alfredo Vergara"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47990   Expand Grand Hotel   (2011) User Score  Play Trailer Overview Grand Hotel is a Spanish drama television series directed by Carlos Sedes and starring Yon Gonzalez and Amaia Salamanca. It first aired on Antena 3 in Spain on 11 October 2011 and on Sky Arts 1 in the UK on 18 November 2012. The series, filmed at the Palacio de la Magdalena in Santander, is set in an early 20th century aristocratic hotel during the reign of King Alfonso XIII and is centered on the mysteries that involve the owner family and the hotel servants. Grand Hotel has received critical acclaim from television critics and won numerous accolades. Featured Crew Carlos Sedes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  16 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adriana Ozores Doña Teresa Amaia Salamanca Alicia Alarcón Yon González Julio Olmedo Eloy Azorín Javier Alarcón Fele Martínez Alfredo Vergara Full Cast & Crew Last Season Season 3 2013 | 22 Episodes Season 3 of Grand Hotel premiered on January 22, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  16 Recommendations   2007-05-24 El internado 6.3    2003-07-06 Pasión de gavilanes 5.6    2013-10-21 The Time in Between 8.5    2011-03-07 Crematorio 7.7    2014-02-17 Velvet 5.5  Facts Original Name  Gran Hotel Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage  - Genres Drama Keywords hotel spain Content Score 100 Yes! Looking good! Top Contributors 61 jgcllp@gmail.com 28 Steve l 22 lucybenson 14 prm96  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}