{"link": "https://www.themoviedb.org/tv/484?language=en", "title": "Murder, She Wrote", "resume": "An unassuming mystery writer turned sleuth uses her professional insight to help solve real-life homicide cases.", "rate": 70, "genre": ["Mystery", "Crime", "Drama"], "cast": ["Angela Lansbury"], "character": ["Jessica Fletcher"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 484   Expand Murder, She Wrote   (1984) User Score  Play Trailer Overview An unassuming mystery writer turned sleuth uses her professional insight to help solve real-life homicide cases. Featured Crew Richard Levinson Creator William Link Creator Peter S. Fischer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  1 Images Backdrops  4 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Angela Lansbury Jessica Fletcher Full Cast & Crew Last Season Season 12 1995 | 24 Episodes Season 12 of Murder, She Wrote premiered on September 21, 1995. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply V 2017 in Memoriam of Guest Stars... Open 0 by VinTinKin\n      \n     w Jessica Fletcher: Happy Birthday Angela Lansbury! Open 0 by wonder2wonder\n      \n     Favourite seasons? Open 2 by  AusFem Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  8 Recommendations   1993-10-29 Diagnosis: Murder 6.5    1964-09-17 Bewitched 7.1    1971-09-15 Columbo 7.8    1974-01-15 Happy Days 7.3    1962-09-23 The Jetsons 6.6    1976-09-18 The Muppet Show 7.8    1986-03-03 Matlock 6.9    1983-10-03 Scarecrow and Mrs. King 5.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Mystery Crime Drama Keywords detective amateur detective writer elderly mystery writer criminal consultant Content Score 71 Just a little bit more... Top Contributors 33 Banana 23 DarkMan c 9 coffinbearer 7 bernadette5961  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}