{"link": "https://www.themoviedb.org/tv/5475?language=en", "title": "Türkisch für Anfänger", "resume": "Türkisch für Anfänger is a critically acclaimed German television comedy-drama series, which premiered on March 14, 2006 on Das Erste. It was created by Bora Dağtekin and produced by Hoffmann & Voges Ent.\nThe show focuses on the German-Turkish stepfamily Schneider-Öztürk, their everyday lives and particularly on the eldest daughter Lena, who narrates the show. During the show's run of 52 episodes, topics covered included both typical problems of teenagers and cross-cultural experiences.\nDue to popular demand, the crew shot a third season consisting of 16 episodes, which were aired in Fall 2008.\nThe show was also successful on foreign markets and got sold to and broadcast in more than 70 countries.", "rate": 73, "genre": ["Comedy"], "cast": ["Adnan Maral", "Josefine Preuß", "Anna Stieblich", "Emil Reinke", "Pegah Ferydoni"], "character": ["Metin Öztürk", "Helena „Lena“ Claudette Schneider", "Doris Schneider", "Nils Schneider", "Yağmur Öztürk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5475   Expand Türkisch für Anfänger   (2006) User Score Overview Türkisch für Anfänger is a critically acclaimed German television comedy-drama series, which premiered on March 14, 2006 on Das Erste. It was created by Bora Dağtekin and produced by Hoffmann & Voges Ent. The show focuses on the German-Turkish stepfamily Schneider-Öztürk, their everyday lives and particularly on the eldest daughter Lena, who narrates the show. During the show's run of 52 episodes, topics covered included both typical problems of teenagers and cross-cultural experiences. Due to popular demand, the crew shot a third season consisting of 16 episodes, which were aired in Fall 2008. The show was also successful on foreign markets and got sold to and broadcast in more than 70 countries. Featured Crew Bora Dağtekin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adnan Maral Metin Öztürk Josefine Preuß Helena „Lena“ Claudette Schneider Anna Stieblich Doris Schneider Emil Reinke Nils Schneider Pegah Ferydoni Yağmur Öztürk Full Cast & Crew Last Season Season 3 2008 | 16 Episodes Season 3 of Türkisch für Anfänger premiered on November 18, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2005-09-09 Pastewka 8.0  Facts Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  25m Homepage   http://www.daserste.de/unterhaltung/serie/tuerkisch-fuer-anfaenger/index.html Genres Comedy Keywords germany turkey multiculturalism cultural difference teenager teenage love comedy of situation Content Score 93 Almost there... Top Contributors S 21 Samara 19 bstarko z 10 zurman1 8 prm96  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}