{"link": "https://www.themoviedb.org/tv/30623?language=en", "title": "Crayon Shin-chan", "resume": "Shin-chan, the boy next door, is a walking disaster, creating chaos wherever he goes. With the body of a child and the mind of an adult, Shinchan is wreaking more havoc than any child before. Shin-chan is carefree, optimistic and gets excited about everything. This 5 year-old likes to do things his way.", "rate": 74, "genre": ["Animation", "Comedy"], "cast": ["Akiko Yajima", "Satomi Kōrogi", "Keiji Fujiwara", "Miki Narahashi"], "character": ["Shinnosuke Nohara (voice)", "Himawari Nohara (voice)", "Hiroshi Nohara (voice)", "Misae Nohara (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30623   Expand Crayon Shin-chan   (1992) User Score Overview Shin-chan, the boy next door, is a walking disaster, creating chaos wherever he goes. With the body of a child and the mind of an adult, Shinchan is wreaking more havoc than any child before. Shin-chan is carefree, optimistic and gets excited about everything. This 5 year-old likes to do things his way. Featured Crew Yoshito Usui Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Akiko Yajima Shinnosuke Nohara (voice) Satomi Kōrogi Himawari Nohara (voice) Keiji Fujiwara Hiroshi Nohara (voice) Miki Narahashi Misae Nohara (voice) Full Cast & Crew Last Season Season 11 2015 | 1 Episode Season 11 of Crayon Shin-chan premiered on August 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  1 Recommendations   1999-01-17 7 vidas 5.9    2005-01-16 Aída 4.0    2003-09-07 Aquí no hay quien viva 7.1    2001-09-13 Cuéntame cómo pasó 6.6    2003-04-22 Los Serrano 5.1    2005-01-21 American Dragon: Jake Long 5.9    2015-10-19 Miraculous: Tales of Ladybug & Cat Noir 8.1    2005-12-13 Moral Orel 7.5  Facts Original Name  クレヨンしんちゃん Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  26m Homepage   http://shinchanweb.com/pt/ Genres Animation Comedy Keywords based on manga anime Content Score 93 Almost there... Top Contributors 22 Mikedeth5 a 19 aballester 18 United600 9 CrewMdk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}