{"link": "https://www.themoviedb.org/tv/71024?language=en", "title": "Castlevania", "resume": "A dark medieval fantasy following the last surviving member of the disgraced Belmont clan, trying to save Eastern Europe from extinction at the hand of Vlad Dracula Tepe himself. Inspired by the classic video game series.", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Graham McTavish", "Richard Armitage", "Emily Swallow", "Alejandra Reynoso", "James Callis"], "character": ["Dracula", "Trevor Belmont", "Lisa Tepes"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71024   Expand Castlevania   (2017) User Score  Play Trailer Overview A dark medieval fantasy following the last surviving member of the disgraced Belmont clan, trying to save Eastern Europe from extinction at the hand of Vlad Dracula Tepe himself. Inspired by the classic video game series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Graham McTavish Dracula Richard Armitage Trevor Belmont Emily Swallow Lisa Tepes Alejandra Reynoso James Callis Full Cast & Crew Last Season Season 1 2017 | 4 Episodes Season 1 of Castlevania premiered on July  7, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Made me want Dracula to win (Spoilers). Open 10 by  movie_nazi P Short Open 1 by  JustinJackFlash Damn good! Open 7 by  movie_nazi Go to Discussions Media Most Popular Videos  3 Backdrops  7 Posters  4 Recommendations   2015-09-08 Apaches 7.3    2016-07-05 Fangbone! 6.7    2016-12-08 The Cuba Libre Story 7.7    2015-06-12 Conspiracy 5.7    2015-12-13 LEGO Nexo Knights 6.0    2017-09-20 Tiempos de guerra 7.0    2015-11-10 My Little Lover 6.3    2003-10-04 Fullmetal Alchemist 8.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  24m Homepage   https://www.netflix.com/title/80095241 Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords magic vampire dracula vampire hunter demon based on video game medieval dark fantasy adaptation plague corrupt church Content Score 93 Almost there... Top Contributors 31 Elizabeth Jennings 20 RubeensVinicius 20 Mustafa s 14 shjakk  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}