{"link": "https://www.themoviedb.org/tv/67725?language=en", "title": "Famous in Love", "resume": "Ordinary college student Paige gets her big break after auditioning for the starring role in a Hollywood blockbuster. She must now navigate her new star-studded life and the highs and lows that come with being the new It Girl in town as well as balancing her college workload.", "rate": 54, "genre": ["Soap", "Drama"], "cast": ["Bella Thorne", "Charlie DePew", "Carter Jenkins", "Niki Koss", "Pepi Sonuga"], "character": ["Paige Townsend", "Jake Salt", "Rainer Devon", "Alexis Glenn", "Tangey Turner"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67725   Expand Famous in Love   (2017) User Score  Play Trailer Overview Ordinary college student Paige gets her big break after auditioning for the starring role in a Hollywood blockbuster. She must now navigate her new star-studded life and the highs and lows that come with being the new It Girl in town as well as balancing her college workload. Featured Crew Rebecca Serle Creator I. Marlene King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bella Thorne Paige Townsend Charlie DePew Jake Salt Carter Jenkins Rainer Devon Niki Koss Alexis Glenn Pepi Sonuga Tangey Turner Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of Famous in Love premiered on April  3, 2018. View All Seasons Social Reviews  1 Discussions  4 Featured Review A review by Reno Written by  Reno  on August 10, 2017 Fame. Jealousy. Controversies. The tales of filmdom. SEASON 01: Most surprising series of the year. It's shocking to know it did not get the recognition it deserved. Yes, it was not like you have never heard the story before. The same old film industry formula. How things work, particularly what are all the trouble the newcomers would face stepping inside the studio. Besides, scams, controversies, personal feud, broken friendship, business deal, press meet, public appearance and many more it covers. I am a film fanatic that I only started to watch the television series in the recen...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  7 Posters  6 Recommendations   2014-09-30 Happyland 3.3    2018-03-13 For The People 6.5    2011-06-06 Switched at Birth 6.1    2017-10-11 Dynasty 6.8    2013-10-22 Ravenswood 4.5    2018-01-21 The Resident 7.0    2017-10-01 Ten Days in the Valley 6.0    2018-02-01 A.P. Bio 5.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://freeform.go.com/shows/famous-in-love Genres Soap Drama Keywords fame hollywood young adult based on young adult novel Content Score 100 Yes! Looking good! Top Contributors 70 Banana 11 Elizabeth Jennings G 6 GraemePage 6 movietvhub  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}