{"link": "https://www.themoviedb.org/tv/10020?language=en", "title": "Police Woman", "resume": "Sergeant “Pepper\"” Anderson, an undercover cop for the Criminal Conspiracy Unit of the Los Angeles Police Department, poses undercover from mob girl to prostitute.", "rate": 75, "genre": ["Action", "Adventure", "Drama"], "cast": ["Charles Dierkop", "Angie Dickinson", "Earl Holliman", "Ed Bernard", "Susan Gailey"], "character": ["Det. Pete Royster", "Sgt. Suzanne 'Pepper' Anderson", "Lt. Bill Crowley", "Det. Joe Styles", "Rosie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10020   Expand Police Woman   (1974) User Score Overview Sergeant “Pepper\"” Anderson, an undercover cop for the Criminal Conspiracy Unit of the Los Angeles Police Department, poses undercover from mob girl to prostitute. Featured Crew Robert L. Collins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charles Dierkop Det. Pete Royster Angie Dickinson Sgt. Suzanne 'Pepper' Anderson Earl Holliman Lt. Bill Crowley Ed Bernard Det. Joe Styles Susan Gailey Rosie Full Cast & Crew Last Season Season 4 1977 | 22 Episodes Season 4 of Police Woman premiered on October 25, 1977. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1971-09-17 McMillan & Wife 7.2    1968-09-21 Adam-12 6.7    1964-09-25 Gomer Pyle, U.S.M.C. 6.8    1957-09-18 Wagon Train 6.3    1966-09-08 Tarzan 5.5    1969-09-23 Marcus Welby, M.D. 6.8    1949-09-15 The Lone Ranger 5.4    1970-09-16 McCloud 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords undercover agent police los angeles female cop lapd Content Score 93 Almost there... Top Contributors 26 Banana o 12 ogen 3 Ulf Kjell Gür 3 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}