{"link": "https://www.themoviedb.org/tv/14315?language=en", "title": "Secret Diary of a Call Girl", "resume": "It's her business doing pleasure with you. A witty and provocative series based on the real-life adventures of a high-class escort. Juggling her own reality with her clients' fantasies can be difficult, but this savvy sweetheart knows every trick in the book, and she's doing it in style.", "rate": 69, "genre": ["Drama"], "cast": ["Billie Piper", "Iddo Goldberg", "Lily James", "Cherie Lunghi", "Gemma Chan"], "character": ["Hannah 'Belle' Baxter", "Ben", "Poppy", "Stephanie Charlton", "Charlotte"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14315   Expand Secret Diary of a Call Girl   (2007) User Score  Play Trailer Overview It's her business doing pleasure with you. A witty and provocative series based on the real-life adventures of a high-class escort. Juggling her own reality with her clients' fantasies can be difficult, but this savvy sweetheart knows every trick in the book, and she's doing it in style. Featured Crew Lucy Prebble Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  24 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Billie Piper Hannah 'Belle' Baxter Iddo Goldberg Ben Lily James Poppy Cherie Lunghi Stephanie Charlton Gemma Chan Charlotte Full Cast & Crew Last Season Season 4 2011 | 8 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Belle: Happy Birthday Billie Piper! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  24 Posters  6 Recommendations   2009-11-09 Miranda 7.3    2012-02-20 The Bleak Old Shop of Stuff 6.7    2010-06-28 Huge 5.5    2013-09-23 Trophy Wife 5.7    2009-09-23 Cougar Town 5.8    2011-09-26 Hart of Dixie 6.9    2008-10-03 Sanctuary 6.8    2007-10-15 Samantha Who? 6.5  Facts Status  Ended Networks Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  23m, 22m Homepage   http://www.sho.com/secret-diary-of-a-call-girl Genres Drama Keywords london england sex sex worker Content Score 100 Yes! Looking good! Top Contributors 18 Elizabeth Jennings w 8 wonder2wonder 8 Banana PO 8 Pete Owen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}