{"link": "https://www.themoviedb.org/tv/61259?language=en", "title": "Aldnoah.Zero", "resume": "In 1972, the Apollo 17 mission discovered a hypergate to Mars on the surface of the moon. Soon a war breaks out between Earth and Mars, and Martian soldiers begin to descend from the sky, riding steel giants, intent on exterminating humanity.", "rate": 72, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61259   Expand Aldnoah.Zero   (2014) User Score Overview In 1972, the Apollo 17 mission discovered a hypergate to Mars on the surface of the moon. Soon a war breaks out between Earth and Mars, and Martian soldiers begin to descend from the sky, riding steel giants, intent on exterminating humanity. Featured Crew Ei Aoki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  3 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2015 | 12 Episodes Season 2 of Aldnoah.Zero premiered on January 10, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Show numbering Open 0 by irkillroy\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  5 Recommendations   2013-04-07 Gargantia on the Verdurous Planet 6.8    2016-04-08 Kuromukuro 7.2    2017-08-16 The Many Faces of Ito 7.0    2016-03-21 72 Dangerous Places to Live 6.0    2013-12-24 Turbo FAST 4.7    2017-12-15 Erased 8.2    2014-05-16 Magi: Adventure of Sinbad 6.7    2011-01-11 Is This a Zombie? 7.7  Facts Original Name  アルドノア・ゼロ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.aldnoahzero.com/ Genres No genres have been added. Keywords mecha anime Content Score 64 We're so close, yet so far. Top Contributors 31 Elizabeth Jennings 13 sp1ti 12 irkillroy CM 10 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}