{"link": "https://www.themoviedb.org/tv/62914?language=en", "title": "Merlí", "resume": "TV series about a high school philosophy teacher, Merlí, who teaches in an original way, and about the students of his class, including his own son, and the relationship, friendship, love, and problems between the students of the class.", "rate": 85, "genre": ["Comedy", "Drama"], "cast": ["Francesc Orella", "David Solans", "Carlos Cuevas", "Elisabet Casanovas", "Adrian Grösser"], "character": ["Merlí", "Bruno", "Pol", "Tània", "Marc"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62914   Expand Merlí   (2015) User Score  Play Trailer Overview TV series about a high school philosophy teacher, Merlí, who teaches in an original way, and about the students of his class, including his own son, and the relationship, friendship, love, and problems between the students of the class. Featured Crew Héctor Lozano Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Francesc Orella Merlí David Solans Bruno Carlos Cuevas Pol Elisabet Casanovas Tània Adrian Grösser Marc Full Cast & Crew Last Season Season 3 2017 | 14 Episodes Season 3 of Merlí premiered on September 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations   2016-07-15 Stranger Things 8.4    2011-12-04 Black Mirror 8.2    2008-01-19 Breaking Bad 8.3  Facts Status  Planned Networks Certification  - Type  Scripted Original Language  Catalan; Valencian Runtime  40m Homepage   http://ccma.cat/tv3/merli Genres Comedy Drama Keywords high school philosophy teacher homosexuality teenager teenage love teenage sexuality young Content Score 100 Yes! Looking good! Top Contributors 72 prm96 23 gayso 9 cucuxenxo 9 felectronika  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}