{"link": "https://www.themoviedb.org/tv/70384?language=en", "title": "Tin Star", "resume": "The story of Jim Worth, an expat British police officer starting a new life with his family as police chief in Little Big Bear, an idyllic town near the Rocky Mountains. When his small town is overrun by migrant workers from a massive new oil refinery – the wave of drugs, prostitution and organised crime that follows them threatens to sweep away everything in its wake.", "rate": 73, "genre": ["Crime", "Drama"], "cast": ["Tim Roth", "Genevieve O'Reilly", "Abigail Lawrie", "Oliver Coopersmith", "Christina Hendricks"], "character": ["Jim Worth", "Angela Worth", "Anna Worth", "Whitey Brown", "Elizabeth Bradshaw"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70384   Expand Tin Star   (2017) User Score  Play Trailer Overview The story of Jim Worth, an expat British police officer starting a new life with his family as police chief in Little Big Bear, an idyllic town near the Rocky Mountains. When his small town is overrun by migrant workers from a massive new oil refinery – the wave of drugs, prostitution and organised crime that follows them threatens to sweep away everything in its wake. Featured Crew Rowan Joffe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Roth Jim Worth Genevieve O'Reilly Angela Worth Abigail Lawrie Anna Worth Oliver Coopersmith Whitey Brown Christina Hendricks Elizabeth Bradshaw Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Tin Star premiered on September  7, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Surreal Open 1 by  Melanie SB one episode Open 0 by Glen Griffiths\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  6 Posters  6 Recommendations   2017-11-07 Damnation 7.2    2017-09-26 Law & Order True Crime 6.1    2017-07-24 Somewhere Between 5.9    2017-09-11 Liar 6.8    2017-10-01 Ten Days in the Valley 6.0    2017-11-05 SMILF 6.7    2017-10-01 Ghosted 6.2    2017-10-01 Wisdom of the Crowd 7.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   https://www.sky.com/watch/title/series/2aaa81bb-facc-44cb-87b4-819b386a65f0/tin-star Genres Crime Drama Keywords rocky mountains revenge motive policeman Content Score 100 Yes! Looking good! Top Contributors 52 Elizabeth Jennings 10 Bendik S 6 Slevin 6 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}