{"link": "https://www.themoviedb.org/tv/13862?language=en", "title": "Shogun", "resume": "A English navigator becomes both a player and pawn in the complex political games in feudal Japan.", "rate": 75, "genre": ["Action", "Adventure", "Drama"], "cast": ["Richard Chamberlain", "John Rhys-Davies", "Orson Welles", "Alan Badel", "Vladek Sheybal"], "character": ["Pilot-Major John Blackthorne / Anjin-san", "Vasco Rodrigues", "Narrator", "Father Dell'Aqua", "Captain Ferriera"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13862   Expand Shogun   (1980) User Score  Play Trailer Overview A English navigator becomes both a player and pawn in the complex political games in feudal Japan. Featured Crew James Clavell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  8 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Chamberlain Pilot-Major John Blackthorne / Anjin-san John Rhys-Davies Vasco Rodrigues Orson Welles Narrator Alan Badel Father Dell'Aqua Vladek Sheybal Captain Ferriera Full Cast & Crew Last Season Original Air Date Original Air Date Blu-ray Disc 1 (DVD) Blu-ray Disc 2 (DVD) Blu-ray Disc 3 (DVD) Season 1 1980 | 5 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Shogun. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  5 Recommendations   1971-09-17 The Persuaders! 8.0    2000-10-01 Unit One 6.9    1983-10-03 Scarecrow and Mrs. King 5.5    1978-04-25 Vega$ 7.5    1983-09-05 Reilly, Ace of Spies 6.8    1982-01-31 World War III 5.2    1982-09-20 Smiley's People 7.9    1985-11-03 North and South 7.2  Facts Original Name  Shōgun Status  Ended Network Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Miniseries Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords japan samurai asia miniseries period drama sengoku period 17th century Content Score 100 Yes! Looking good! Top Contributors TB 34 TMDb Bot 21 Banana P 11 Piti8576 t 10 thermo6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}