{"link": "https://www.themoviedb.org/tv/4507?language=en", "title": "The Thick of It", "resume": "Set in the corridors of power and spin, the Minister for Social Affairs is continually harassed by Number 10's policy enforcer and dependent on his not-so-reliable team of civil servants.", "rate": 80, "genre": ["Comedy"], "cast": ["Chris Addison", "Peter Capaldi", "Paul Higgins", "Rebecca Front", "Roger Allam"], "character": ["Oliver Reeder", "Malcolm Tucker", "Jamie MacDonald", "Nicola Murray"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4507   Expand The Thick of It   (2005) User Score Overview Set in the corridors of power and spin, the Minister for Social Affairs is continually harassed by Number 10's policy enforcer and dependent on his not-so-reliable team of civil servants. Featured Crew Armando Iannucci Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Addison Oliver Reeder Peter Capaldi Malcolm Tucker Paul Higgins Jamie MacDonald Rebecca Front Nicola Murray Roger Allam Full Cast & Crew Last Season Season 4 2012 | 7 Episodes Season 4 of The Thick of It premiered on September  8, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Thick of It. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  4 Recommendations   2003-09-19 Peep Show 8.2    1997-11-03 I'm Alan Partridge 6.9    1998-11-09 Big Train 7.5    2004-05-18 The Mighty Boosh 7.5    1999-09-24 Spaced 8.1    2006-09-14 That Mitchell and Webb Look 8.0    1994-01-19 The Day Today 8.3    1995-04-21 Father Ted 7.9  Facts Status  Ended Networks Certification 18 Meaning Films rated 18 are for adults. No-one under 18 is allowed to see an 18 film at the cinema or buy / rent an 18 rated video. No 18 rated works are suitable for children. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006qgrd Genres Comedy Keywords politics satire british politics political satire sitcom british humour workplace comedy Content Score 93 Almost there... Top Contributors 10 Elizabeth Jennings 9 Banana 4 AyACZE O 3 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}