{"link": "https://www.themoviedb.org/tv/61871?language=en", "title": "Man Seeking Woman", "resume": "Josh Greenberg is a naive romantic on a desperate quest for love. When his longtime girlfriend dumps him, Josh enters the dating scene, a nightmarish hellscape of untold horror. Despite the agony, Josh continues his search in the hopes of finding someone who will make all the misery worth it.", "rate": 66, "genre": ["Comedy"], "cast": ["Jay Baruchel", "Eric André", "Britt Lower", "Maya Erskine"], "character": ["Josh Greenberg", "Mike Bunk", "Liz Greenberg", "Maggie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61871   Expand Man Seeking Woman   (2015) User Score Overview Josh Greenberg is a naive romantic on a desperate quest for love. When his longtime girlfriend dumps him, Josh enters the dating scene, a nightmarish hellscape of untold horror. Despite the agony, Josh continues his search in the hopes of finding someone who will make all the misery worth it. Featured Crew Simon Rich Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jay Baruchel Josh Greenberg Eric André Mike Bunk Britt Lower Liz Greenberg Maya Erskine Maggie Full Cast & Crew Last Season Season 3 2017 | 10 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Final Season?? Open 9 by  Halberstram Wild Things Open 0 by bestdayever\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2012-12-06 A Young Doctor's Notebook 6.8    2016-08-18 I Love Dick 5.2    2014-10-05 Mulaney 2.4    2017-11-05 SMILF 6.7    2002-09-18 The Twilight Zone 7.5    2015-03-03 Billy & Billie 7.9    1985-09-27 The Twilight Zone 7.4    2016-03-15 Crowded 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.fxnetworks.com/shows/man-seeking-woman/episodes Genres Comedy Keywords romantic comedy dating sitcom absurdist Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings TB 6 TMDb Bot s 6 speedycars 5 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}