{"link": "https://www.themoviedb.org/tv/19758?language=en", "title": "SOKO Leipzig", "resume": "SOKO Leipzig is a German police procedural television programme, a spin-off of the earlier German police programme SOKO 5113. It was first broadcast on 31 January 2001, on German television channel ZDF. On 12 November 2008, the first part of a two-part crossover between SOKO Leipzig and British police procedural The Bill was aired, with the same version being shown on both ZDF and British television channel ITV1.", "rate": 0, "genre": ["Crime", "Drama"], "cast": ["Andreas Schmidt-Schaller", "Melanie Marschke", "Marco Girnth", "Caroline Scholze", "Maximilian Klas"], "character": ["Kriminalhauptkommissar Hajo Trautzschke", "Kriminaloberkommissarin Ina Zimmermann", "Kriminaloberkommissar Jan Maybach", "Leni Trautzschke", "Benni Maybach"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19758   Expand SOKO Leipzig   (2001) User Score Overview SOKO Leipzig is a German police procedural television programme, a spin-off of the earlier German police programme SOKO 5113. It was first broadcast on 31 January 2001, on German television channel ZDF. On 12 November 2008, the first part of a two-part crossover between SOKO Leipzig and British police procedural The Bill was aired, with the same version being shown on both ZDF and British television channel ITV1. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andreas Schmidt-Schaller Kriminalhauptkommissar Hajo Trautzschke Melanie Marschke Kriminaloberkommissarin Ina Zimmermann Marco Girnth Kriminaloberkommissar Jan Maybach Caroline Scholze Leni Trautzschke Maximilian Klas Benni Maybach Full Cast & Crew Current Season Season 17 2017 | 16 Episodes Season 17 of SOKO Leipzig premiered on October 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on SOKO Leipzig. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  45m Homepage  - Genres Crime Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors S 306 Samara 7 Elizabeth Jennings TB 6 TMDb Bot 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}