{"link": "https://www.themoviedb.org/tv/3793?language=en", "title": "Invader Zim", "resume": "Invader Zim is an American animated television series created by Jhonen Vasquez. The show premiered on Nickelodeon on March 30, 2001. The series involves an extraterrestrial named Zim who originates from a planet called Irk, and his ongoing mission to conquer and destroy Earth. His various attempts to subjugate and destroy the human race are invariably undermined by some combination of his own ineptitude, his malfunctioning robot servant GIR, and a young paranormal investigator named Dib, one of the very few people attentive enough to be aware of Zim's identity.\nInvader Zim was targeted at children in their early teens, and met with critical acclaim, but after the first season, the show's ratings began to decline. Before the second season was completed, Nickelodeon cancelled the series, leaving at least twenty-three episodes and a planned television movie series finale unfinished. The show has maintained a cult following since the series' cancellation with a pilot, forty-six aired episodes, and about seventeen episodes that were in production around the time the series was cancelled. On August 19, 2006, all forty-six episodes have aired on television. Nineteen of the episodes are split into two individual stories, each lasting about twelve minutes. There are eight double-length episodes. All of the episodes were directed by Steve Ressel except for the pilot which was directed by Jordan Reichek.", "rate": 78, "genre": ["Animation", "Drama"], "cast": ["Andy Berman", "Richard Steven Horvitz", "Rosearik Rikki Simons", "Melissa Fahn", "Lucille Bliss"], "character": ["Dib", "Zim", "GIR", "Gaz", "Ms. Bitters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3793   Expand Invader Zim   (2001) User Score  Play Trailer Overview Invader Zim is an American animated television series created by Jhonen Vasquez. The show premiered on Nickelodeon on March 30, 2001. The series involves an extraterrestrial named Zim who originates from a planet called Irk, and his ongoing mission to conquer and destroy Earth. His various attempts to subjugate and destroy the human race are invariably undermined by some combination of his own ineptitude, his malfunctioning robot servant GIR, and a young paranormal investigator named Dib, one of the very few people attentive enough to be aware of Zim's identity. Invader Zim was targeted at children in their early teens, and met with critical acclaim, but after the first season, the show's ratings began to decline. Before the second season was completed, Nickelodeon cancelled the series, leaving at least twenty-three episodes and a planned television movie series finale unfinished. The show has maintained a cult following since the series' cancellation with a pilot, forty-six aired episodes, and about seventeen episodes that were in production around the time the series was cancelled. On August 19, 2006, all forty-six episodes have aired on television. Nineteen of the episodes are split into two individual stories, each lasting about twelve minutes. There are eight double-length episodes. All of the episodes were directed by Steve Ressel except for the pilot which was directed by Jordan Reichek. Featured Crew Jhonen Vasquez Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  9 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andy Berman Dib Richard Steven Horvitz Zim Rosearik Rikki Simons GIR Melissa Fahn Gaz Lucille Bliss Ms. Bitters Full Cast & Crew Last Season Season 2 2006 | 10 Episodes Season 2 of Invader Zim premiered on June 10, 2006. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply No love for Zim? Open 0 by GrandTardigrade\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  6 Recommendations   1993-09-18 Rocko's Modern Life 7.7    1991-08-11 The Ren & Stimpy Show 7.2    1997-04-20 The Angry Beavers 6.9    2004-04-03 Danny Phantom 6.5    2001-04-01 The Oblongs 6.7    1994-04-15 Space Ghost Coast to Coast 8.3    2001-08-10 Samurai Jack 7.8    2003-08-01 My Life as a Teenage Robot 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  11m Homepage   http://www.nick.com/invader-zim/ Genres Animation Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors s 3 slartus A 3 AnthonyAtkins232 2 Animexla 2 titantelo15  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}