{"link": "https://www.themoviedb.org/tv/1532?language=en", "title": "Starsky & Hutch", "resume": "Starsky & Hutch is a 1970s American cop thriller television series, which consisted of a 70-minute pilot movie and 92 episodes of 50 minutes each. The show was created by William Blinn, produced by Spelling-Goldberg Productions, and broadcast between April 30, 1975 and May 15, 1979 on the ABC network. It was distributed by Columbia Pictures Television in the United States and, originally, Metromedia Producers Corporation in Canada and some other parts of the world. Sony Pictures Television is now the worldwide distributor for the series. The series also inspired a theatrical film and a video game.", "rate": 71, "genre": ["Action", "Adventure", "Drama"], "cast": ["David Soul", "Paul Michael Glaser", "Antonio Fargas", "Bernie Hamilton", "Susan Gailey"], "character": ["Kenneth Hutchinson", "David Starsky", "Huggy Bear Brown", "Harold Dobey", "Karel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1532   Expand Starsky & Hutch   (1975) User Score Overview Starsky & Hutch is a 1970s American cop thriller television series, which consisted of a 70-minute pilot movie and 92 episodes of 50 minutes each. The show was created by William Blinn, produced by Spelling-Goldberg Productions, and broadcast between April 30, 1975 and May 15, 1979 on the ABC network. It was distributed by Columbia Pictures Television in the United States and, originally, Metromedia Producers Corporation in Canada and some other parts of the world. Sony Pictures Television is now the worldwide distributor for the series. The series also inspired a theatrical film and a video game. Featured Crew William Blinn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Soul Kenneth Hutchinson Paul Michael Glaser David Starsky Antonio Fargas Huggy Bear Brown Bernie Hamilton Harold Dobey Susan Gailey Karel Full Cast & Crew Last Season Season 4 1978 | 22 Episodes Season 4 of Starsky & Hutch premiered on September 12, 1978. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply The  car Open 0 by manfromatlantis\n      \n     w Hutch: Happy Birthday David Soul! Open 0 by wonder2wonder\n      \n     pilot Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  4 Recommendations   1976-03-21 Charlie's Angels 5.9    1973-10-24 Kojak 7.4    1972-09-16 The Streets of San Francisco 7.1    1970-09-16 McCloud 7.0    1978-11-03 Diff'rent Strokes 5.7    1976-01-27 Laverne & Shirley 6.7    1970-09-24 The Odd Couple 7.1    1977-01-14 Fantasy Island 6.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords police crime Content Score 93 Almost there... Top Contributors a 7 al-b-other 7 nycos R 6 Rebecca D 5 Decaliax  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}