{"link": "https://www.themoviedb.org/tv/65945?language=en", "title": "Kabaneri of the Iron Fortress", "resume": "As the world is in the middle of an industrial revolution, a monster appears that cannot be defeated unless its heart, which is protected by a layer of iron, is pierced. By infecting humans with its bite, the monster can create aggressive and undead creatures known as Kabane. On the island Hinomoto, located in the far east, people have built stations to shelter themselves from these creatures. People access the station, as well as transport wares between them, with the help of a locomotive running on steam, called Hayajiro. Ikoma, a boy who lives in the Aragane station and helps to build Hayajiro, creates his own weapon called Tsuranukizutsu in order to defeat the creatures. One day, as he waits for an opportunity to use his weapon, he meets a girl named Mumei, who is excused from the mandatory Kabane inspection. During the night, Ikuma meets Mumei again as he sees Hayajiro going out of control. The staff on the locomotive has turned into the creatures. The station, now under attack by Kabane, is the opportunity Ikoma has been looking for.", "rate": 64, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Tasuku Hatanaka", "Tasuku Hatanaka", "Maaya Uchida", "Yuuki Kaji", "Toshiki Masuda"], "character": ["Ikoma", "Mumei", "Ayame", "Takumi", "Kurusu"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65945   Expand Kabaneri of the Iron Fortress   (2016) User Score  Play Trailer Overview As the world is in the middle of an industrial revolution, a monster appears that cannot be defeated unless its heart, which is protected by a layer of iron, is pierced. By infecting humans with its bite, the monster can create aggressive and undead creatures known as Kabane. On the island Hinomoto, located in the far east, people have built stations to shelter themselves from these creatures. People access the station, as well as transport wares between them, with the help of a locomotive running on steam, called Hayajiro. Ikoma, a boy who lives in the Aragane station and helps to build Hayajiro, creates his own weapon called Tsuranukizutsu in order to defeat the creatures. One day, as he waits for an opportunity to use his weapon, he meets a girl named Mumei, who is excused from the mandatory Kabane inspection. During the night, Ikuma meets Mumei again as he sees Hayajiro going out of control. The staff on the locomotive has turned into the creatures. The station, now under attack by Kabane, is the opportunity Ikoma has been looking for. Featured Crew Tetsuro Araki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tasuku Hatanaka Ikoma Tasuku Hatanaka Mumei Maaya Uchida Ayame Yuuki Kaji Takumi Toshiki Masuda Kurusu Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Kabaneri of the Iron Fortress premiered on April  8, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Kabaneri of the Iron Fortress. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2015-07-12 God Eater 6.4    2016-04-09 Tanaka-kun is Always Listless 8.0    2015-07-05 Rokka: Braves of the Six Flowers 5.9    2012-10-07 Say \"I love you.\" 7.6    2011-07-08 No. 6 7.5    2016-04-04 Re:ZERO -Starting Life in Another World- 7.4    2015-07-04 GATE 7.2    2015-10-07 Beautiful Bones: Sakurako’s Investigation 6.3  Facts Original Name  甲鉄城のカバネリ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://kabaneri.com/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords steampunk anime Content Score 100 Yes! Looking good! Top Contributors 26 deanzel 19 sp1ti c 12 caselgard 8 karaa  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}