{"link": "https://www.themoviedb.org/tv/668?language=en", "title": "X-Men: Evolution", "resume": "X-Men: Evolution is an American animated television series about the Marvel Comics superhero team X-Men. In this incarnation, many of the characters are teenagers rather than adults. The series ran for a total of four seasons from November 2000 until October 2003 on Kids' WB, which has made it the third longest-running Marvel Comics animated series, behind only Fox Kids' X-Men and Spider-Man animated series. The series began running on Disney XD on June 15, 2009.", "rate": 76, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Meghan Black", "Michael Dobson", "Alexandra Carter", "Christopher Gray", "Michael Kopsa"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 668   Expand X-Men: Evolution   (2000) User Score Overview X-Men: Evolution is an American animated television series about the Marvel Comics superhero team X-Men. In this incarnation, many of the characters are teenagers rather than adults. The series ran for a total of four seasons from November 2000 until October 2003 on Kids' WB, which has made it the third longest-running Marvel Comics animated series, behind only Fox Kids' X-Men and Spider-Man animated series. The series began running on Disney XD on June 15, 2009. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Meghan Black Michael Dobson Alexandra Carter Christopher Gray Michael Kopsa Full Cast & Crew Last Season Season 4 2003 | 9 Episodes Season 4 of X-Men: Evolution premiered on August 30, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  4 Recommendations   2009-01-23 Wolverine and the X-Men 7.0    2001-11-17 Justice League 8.2    2012-04-01 Marvel's Ultimate Spider-Man 6.6    1999-01-10 Batman Beyond 7.8    1992-10-31 X-Men 7.9    1996-09-06 Superman: The Animated Series 7.3    2000-09-23 Static Shock 7.1    2008-03-08 The Spectacular Spider-Man 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords mutant Content Score 86 Almost there... Top Contributors 7 Banana R 6 Rebecca W 5 Wiruss z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}