{"link": "https://www.themoviedb.org/tv/63647?language=en", "title": "Childhood's End", "resume": "The peaceful alien invasion of Earth by the mysterious “Overlords,” whose arrival begins decades of apparent utopia under indirect alien rule, at the cost of human identity and culture.", "rate": 67, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Lachlan Roland-Kenn", "Colm Meaney", "Mike Vogel", "Julian McMahon", "Charles Dance"], "character": ["Tommy", "Wainwright", "Ricky Stormgren", "Dr. Rupert Boyce", "Karellen"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63647   Expand Childhood's End   (2015) User Score Overview The peaceful alien invasion of Earth by the mysterious “Overlords,” whose arrival begins decades of apparent utopia under indirect alien rule, at the cost of human identity and culture. Featured Crew Matthew Graham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  9 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lachlan Roland-Kenn Tommy Colm Meaney Wainwright Mike Vogel Ricky Stormgren Julian McMahon Dr. Rupert Boyce Charles Dance Karellen Full Cast & Crew Last Season Season 1 2015 | 3 Episodes Season 1 of Childhood's End premiered on December 14, 2015. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Worth reading the book? Open 2 by  batdroid Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  8 Recommendations   2013-11-17 Almost Human 7.0    2010-06-07 Persons Unknown 6.4    2011-02-03 Marchlands 7.4    2007-08-05 The Company 7.0    2009-01-12 Unforgiven 7.4    2006-12-11 The Lost Room 7.7    2015-09-30 You, Me and the Apocalypse 7.2    2015-01-15 The Man in the High Castle 7.5  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Miniseries Original Language  English Runtime  85m Homepage   http://www.syfy.com/childhoodsend Genres Drama Sci-Fi & Fantasy Keywords utopia alien invasion Content Score 100 Yes! Looking good! Top Contributors 54 Elizabeth Jennings 12 StrannikM 7 Zlogorek CM 4 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}