{"link": "https://www.themoviedb.org/tv/46930?language=en", "title": "Ripper Street", "resume": "A drama set in the East End of London in 1889, during the aftermath of the \"Ripper\" murders. The action centres around the notorious H Division – the police precinct from hell – which is charged with keeping order in the chaotic streets of Whitechapel. Ripper Street explores the lives of characters trying to recover from the Ripper's legacy, from crimes that have not only irretrievably altered their lives, but the very fabric of their city. At the drama's heart our detectives try to bring a little light into the dark world they inhabit.", "rate": 73, "genre": ["Drama", "Mystery"], "cast": ["Matthew Macfadyen", "Jerome Flynn", "Adam Rothenberg", "MyAnna Buring", "Charlene McKenna"], "character": ["L'inspecteur Edmund Reid", "Le sergent Bennet Drake", "Le capitaine Homer Jackson", "Long Susan Hart", "Rose Erskine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46930   Expand Ripper Street   (2012) User Score  Play Trailer Overview A drama set in the East End of London in 1889, during the aftermath of the \"Ripper\" murders. The action centres around the notorious H Division – the police precinct from hell – which is charged with keeping order in the chaotic streets of Whitechapel. Ripper Street explores the lives of characters trying to recover from the Ripper's legacy, from crimes that have not only irretrievably altered their lives, but the very fabric of their city. At the drama's heart our detectives try to bring a little light into the dark world they inhabit. Featured Crew Richard Warlow Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  1 Images Backdrops  11 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matthew Macfadyen L'inspecteur Edmund Reid Jerome Flynn Le sergent Bennet Drake Adam Rothenberg Le capitaine Homer Jackson MyAnna Buring Long Susan Hart Charlene McKenna Rose Erskine Full Cast & Crew Last Season Season 5 2016 | 6 Episodes Season 5 of Ripper Street premiered on October 12, 2016. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Sad that no one here discussing the show Open 6 by  DRDMovieMusings How is Shine Alive *and* put in charge? Open 0 by WalkGood\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  11 Posters  8 Recommendations   2010-08-15 Vexed 7.2    2012-06-26 Line of Duty 8.0    2015-06-10 The Interceptor 5.7    2012-10-11 Copper 6.0    2007-04-08 Inspector George Gently 8.3    2009-02-02 Whitechapel 7.5    2015-04-05 American Odyssey 6.7    2011-04-20 XIII: The Series 6.1  Facts Status  Ended Networks Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Mystery Keywords london england period drama police detective 19th century Content Score 100 Yes! Looking good! Top Contributors 17 Elizabeth Jennings M 16 Manu 14 Banana 9 SuperMario  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}