{"link": "https://www.themoviedb.org/tv/43078?language=en", "title": "Miss Fisher's Murder Mysteries", "resume": "Our lady sleuth sashays through the back lanes and jazz clubs of late 1920’s Melbourne, fighting injustice with her pearl handled pistol and her dagger sharp wit. Leaving a trail of admirers in her wake, our thoroughly modern heroine makes sure she enjoys every moment of her lucky life. Based on author Kerry Greenwood's Phryne Fisher Murder Mystery novels.", "rate": 72, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Essie Davis", "Miriam Margolyes", "Ashleigh Cummings", "Nathan Page", "Richard Bligh"], "character": ["Phryne Fisher", "Aunt Prudence", "Dorothy 'Dot' Williams", "Detective John 'Jack' Robinson", "Mr. Butler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43078   Expand Miss Fisher's Murder Mysteries   (2012) User Score  Play Trailer Overview Our lady sleuth sashays through the back lanes and jazz clubs of late 1920’s Melbourne, fighting injustice with her pearl handled pistol and her dagger sharp wit. Leaving a trail of admirers in her wake, our thoroughly modern heroine makes sure she enjoys every moment of her lucky life. Based on author Kerry Greenwood's Phryne Fisher Murder Mystery novels. Featured Crew Fiona Eagger Creator Deborah Cox Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  27 Posters  17 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Essie Davis Phryne Fisher Miriam Margolyes Aunt Prudence Ashleigh Cummings Dorothy 'Dot' Williams Nathan Page Detective John 'Jack' Robinson Richard Bligh Mr. Butler Full Cast & Crew Last Season Series 3 2015 | 8 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Aussie female sleuth.. Open 3 by  tmdb89189586 Go to Discussions Media Most Popular Videos  2 Backdrops  27 Posters  17 Recommendations   2009-09-07 Land Girls 6.7    2011-08-05 Friends with Benefits 6.1    2014-12-02 Girlfriends' Guide to Divorce 5.1    2012-09-06 The Bletchley Circle 7.8    2013-02-01 The Doctor Blake Mysteries 7.6    2015-07-26 Partners in Crime 6.9    2009-02-25 Burnistoun 7.8    2011-07-27 The Code 6.7  Facts Status  Returning Series Network Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  English Runtime  53m Homepage   http://www.abc.net.au/tv/programs/miss-fishers-murder-mysteries/ Genres Crime Drama Mystery Keywords australia based on novel or book private investigator private detective female detective costume drama 1920s Content Score 100 Yes! Looking good! Top Contributors 107 Nike 97 Elizabeth Jennings 36 Banana t 10 tmdb42368388  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}