{"link": "https://www.themoviedb.org/tv/78309?language=en", "title": "The Chalet", "resume": "Friends gathered at a remote chalet in the French Alps for a summer getaway are caught in a deadly trap as a dark secret from the past comes to light.", "rate": 76, "genre": ["Crime", "Mystery"], "cast": ["Mia Delmae", "Marc Ruchmann", "Emilie de Preissac", "Agnès Delachair", "Nicolas Gob"], "character": ["Françoise Rodier", "Manu Laverne", "Adèle", "Alice Bordaz", "Sébasttien Genesta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78309   Expand The Chalet   (2018) User Score  Play Trailer Overview Friends gathered at a remote chalet in the French Alps for a summer getaway are caught in a deadly trap as a dark secret from the past comes to light. Featured Crew Camille Bordes-Resnais Creator Alexis Lecaye Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mia Delmae Françoise Rodier Marc Ruchmann Manu Laverne Emilie de Preissac Adèle Agnès Delachair Alice Bordaz Nicolas Gob Sébasttien Genesta Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of The Chalet premiered on March 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2017-11-02 Borderliner 6.7    2017-10-29 Tabula Rasa 7.8    2018-02-02 Requiem 6.4    2018-05-10 Safe 7.1    1987-09-25 Beauty and the Beast 7.4    1986-03-03 Matlock 6.9    2017-09-25 Alias Grace 7.5    2018-02-12 Collateral 6.0  Facts Original Name  Le Chalet Status  Ended Network Certification 10 Meaning Not recommended for children under 10. Not allowed in children's television series. Type  Miniseries Original Language  French Runtime  52m Homepage   https://www.france.tv/france-2/le-chalet/ Genres Crime Mystery Keywords thriller Content Score 100 Yes! Looking good! Top Contributors y 24 yoooov m 14 michael47 9 Banana Y 6 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}