{"link": "https://www.themoviedb.org/tv/19654?language=en", "title": "Rose Red", "resume": "Rose Red is a television miniseries scripted by horror novelist Stephen King. The series was premiered in the United States on ABC on January 27, 2002. The story involves a cavernous Seattle mansion called Rose Red, which is investigated by parapsychologist Dr. Joyce Reardon and a team of psychics.", "rate": 67, "genre": ["Mystery", "Sci-Fi", "Fantasy"], "cast": ["Nancy Travis", "Matt Keeslar", "Kimberly J. Brown", "David Dukes", "Judith Ivey"], "character": ["Prof. Joyce Reardon", "Steve Rimbauer", "Annie Wheaton", "Professor Carl Miller", "Cathy Kramer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19654   Expand Rose Red   (2002) User Score  Play Trailer Overview Rose Red is a television miniseries scripted by horror novelist Stephen King. The series was premiered in the United States on ABC on January 27, 2002. The story involves a cavernous Seattle mansion called Rose Red, which is investigated by parapsychologist Dr. Joyce Reardon and a team of psychics. Featured Crew Stephen King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  7 Posters  16 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Nancy Travis Prof. Joyce Reardon Matt Keeslar Steve Rimbauer Kimberly J. Brown Annie Wheaton David Dukes Professor Carl Miller Judith Ivey Cathy Kramer Full Cast & Crew Last Season Season 1 2002 | 3 Episodes Season 1 of Rose Red premiered on January 27, 2002. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply N Originally Miller was supposed to kill Hardaway Open 0 by Notamymerrick\n      \n     P Finding the bathroom in this house must have been a bitch. Open 0 by Paulinemoran\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  16 Recommendations   1999-02-14 Storm of the Century 6.8    1993-05-09 The Tommyknockers 5.1    1997-04-27 The Shining 6.0    1994-05-08 The Stand 6.8    1995-05-14 The Langoliers 5.9    2004-06-20 Salem's Lot 5.5    Stephen King's Desperation 5.7    1979-11-17 Salem's Lot 6.4  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m, 240m Homepage  - Genres Mystery Sci-Fi & Fantasy Keywords upper class professor haunted house psychic power miniseries paranormal investigation haunted manor Content Score 100 Yes! Looking good! Top Contributors 82 Amanda TB 64 TMDb Bot 10 Banana Z 7 ZFE  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}