{"link": "https://www.themoviedb.org/tv/2589?language=en", "title": "Head of the Class", "resume": "Head of the Class is an American sitcom that ran from 1986 to 1991 on the ABC television network.\nThe series follows a group of gifted students in the Individualized Honors Program at the fictional Monroe High School in Manhattan, and their history teacher Charlie Moore. The program was ostensibly a vehicle for Hesseman, best known for his role as radio DJ Dr. Johnny Fever in the sitcom WKRP in Cincinnati. Hesseman left Head of the Class in 1990 and was replaced by Billy Connolly as teacher Billy MacGregor for the final season. After the series ended, Connolly appeared in a short-lived spin-off titled Billy.\nThe series was created and executive produced by Rich Eustis and Michael Elias. Rich Eustis had previously worked as a New York City substitute teacher while hoping to become an actor.", "rate": 63, "genre": ["Comedy"], "cast": ["Michael DeLorenzo", "Rain Pryor", "Billy Connolly", "Jeannetta Arnette", "Khrystyne Haje"], "character": ["Alex Torres", "Theola June 'T.J.' Jones", "Billy MacGregor", "Bernadette Meara", "Simone Foster"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2589   Expand Head of the Class   (1986) User Score Overview Head of the Class is an American sitcom that ran from 1986 to 1991 on the ABC television network. The series follows a group of gifted students in the Individualized Honors Program at the fictional Monroe High School in Manhattan, and their history teacher Charlie Moore. The program was ostensibly a vehicle for Hesseman, best known for his role as radio DJ Dr. Johnny Fever in the sitcom WKRP in Cincinnati. Hesseman left Head of the Class in 1990 and was replaced by Billy Connolly as teacher Billy MacGregor for the final season. After the series ended, Connolly appeared in a short-lived spin-off titled Billy. The series was created and executive produced by Rich Eustis and Michael Elias. Rich Eustis had previously worked as a New York City substitute teacher while hoping to become an actor. Featured Crew Rich Eustis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael DeLorenzo Alex Torres Rain Pryor Theola June 'T.J.' Jones Billy Connolly Billy MacGregor Jeannetta Arnette Bernadette Meara Khrystyne Haje Simone Foster Full Cast & Crew Last Season Season 5 1990 | 22 Episodes Season 5 of Head of the Class premiered on September 11, 1990. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply funny Open 1 by  Patrick E. Abe Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1983-09-16 Webster 4.9    1984-09-25 Three's a Crowd 6.7    1980-10-30 It's a Living 6.3    1984-03-19 Kate & Allie 5.3    1984-09-18 Punky Brewster 6.8    1982-09-25 Silver Spoons 5.1    1985-03-15 Mr. Belvedere 6.8    1987-09-20 My Two Dads 5.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Comedy Keywords high school teen comedy manhattan, new york city sitcom Content Score 93 Almost there... Top Contributors 58 Banana s 3 speedycars 2 Zlogorek 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}