{"link": "https://www.themoviedb.org/tv/65555?language=en", "title": "Endless Love", "resume": "Two separate worlds lie on two sides of the road in a seaside town. Both too close and way too far from each other. What happens when two young people from these worlds fall in love?  Kemal is one of the three children of a moderate family that lives in one of the inner neighborhoods of the town. His hand to mouth world has pinned all hopes on him. The motive of this world is not high aims, it’s to make a living and survive. It’s Kemal’s last year in mine engineering. His dreams are restricted with the truth and he doesn’t believe in miracles. Especially in miracles like love.  Kemal is soon tested with his disbelief and Nihan hops into his monotonous life. After that day Kemal’s world turns upside down and he loses control.  Nihan is the girl from the glamorous part of the town. She’s distant to the values of her environment; she’s actually distant to her own world. Kemal and Nihan’s love is as distant as a poor guy and a rich girl. But their love ignores the distance between them and they somehow manage to stay together until the day that Kemal has to leave Istanbul to work in a mine. That day will be a crossroad for Kemal and Nihan, a moment of a tough decision.", "rate": 73, "genre": ["Drama"], "cast": ["Burak Özçivit", "Neslihan Atagül", "Kaan Urgancıoğlu", "Zerrin Tekindor", "Ruzgar Aksoy"], "character": ["Kemal Soydere", "Nihan", "Emir", "Leyla", "Tarik"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65555   Expand Endless Love   (2015) User Score Overview Two separate worlds lie on two sides of the road in a seaside town. Both too close and way too far from each other. What happens when two young people from these worlds fall in love?  Kemal is one of the three children of a moderate family that lives in one of the inner neighborhoods of the town. His hand to mouth world has pinned all hopes on him. The motive of this world is not high aims, it’s to make a living and survive. It’s Kemal’s last year in mine engineering. His dreams are restricted with the truth and he doesn’t believe in miracles. Especially in miracles like love.  Kemal is soon tested with his disbelief and Nihan hops into his monotonous life. After that day Kemal’s world turns upside down and he loses control.  Nihan is the girl from the glamorous part of the town. She’s distant to the values of her environment; she’s actually distant to her own world. Kemal and Nihan’s love is as distant as a poor guy and a rich girl. But their love ignores the distance between them and they somehow manage to stay together until the day that Kemal has to leave Istanbul to work in a mine. That day will be a crossroad for Kemal and Nihan, a moment of a tough decision. Featured Crew Hilal Saral Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Burak Özçivit Kemal Soydere Neslihan Atagül Nihan Kaan Urgancıoğlu Emir Zerrin Tekindor Leyla Ruzgar Aksoy Tarik Full Cast & Crew Last Season Season 2 — | 39 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Endless Love. You can help by rating TV shows you've seen. Facts Original Name  Kara Sevda Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  120m Homepage   http://www.ayyapim.com/kara-sevda Genres Drama Keywords kara sevda Content Score 100 Yes! Looking good! Top Contributors b 46 bluwy M 8 Mylie 7 Maikkoum 5 peterpony  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}