{"link": "https://www.themoviedb.org/tv/66803?language=en", "title": "Falling Water", "resume": "The story of three unrelated people, who slowly realize that they are dreaming separate parts of a single common dream.", "rate": 65, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Lizzie Brocheré", "David Ajala", "Will Yun Lee", "Sepideh Moafi", "Kai Lennox"], "character": ["Tess", "Burton", "Taka", "Alexis Simms", "Woody Hammond"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66803   Expand Falling Water   (2016) User Score  Play Trailer Overview The story of three unrelated people, who slowly realize that they are dreaming separate parts of a single common dream. Featured Crew Blake Masters Creator Henry Bromell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lizzie Brocheré Tess David Ajala Burton Will Yun Lee Taka Sepideh Moafi Alexis Simms Kai Lennox Woody Hammond Full Cast & Crew Current Season Season 2 2018 | 10 Episodes Season 2 of Falling Water premiered on January  6, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply On Amazon Open 2 by  lantzn Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  5 Recommendations   2017-01-25 Mary Kills People 7.5    2016-12-07 Shut Eye 6.3    2016-10-16 Eyewitness 7.4    2017-10-01 Ten Days in the Valley 6.0    2016-07-05 Cyberwar 7.4    2012-10-04 Hunted 7.1    2018-05-30 Reverie 7.0    2018-01-06 Hard Sun 7.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://www.usanetwork.com/fallingwater Genres Drama Mystery Sci-Fi & Fantasy Keywords dream sleep subconsciousness supernatural thriller Content Score 100 Yes! Looking good! Top Contributors 38 henriquesene 27 Marso 24 Elizabeth Jennings m 16 misfit_noel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}