{"link": "https://www.themoviedb.org/tv/10918?language=en", "title": "Wanna bet, that..?", "resume": "Wetten, dass..? was a long-running German-language entertainment television show. It is the most successful Saturday television show in Europe. Its format was the basis for the British show You Bet! and the American show Wanna Bet?.\nThe shows were broadcast live six to seven times a year from different cities in Germany, Austria, and Switzerland. There have also been seven open-air summer shows, broadcast from Amphitheatre Xanten, Plaça de Toros de Palma de Mallorca, Disneyland Paris, Waldbühne Berlin, and Aspendos Roman Theatre. Each of the shows, which were shown without commercial interruption, were usually scheduled to last for about two hours, but it was not uncommon for a show to run as much as 45 minutes longer.", "rate": 50, "genre": ["Reality"], "cast": ["Markus Lanz"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10918   Expand Wanna bet, that..?   (1981) User Score Overview Wetten, dass..? was a long-running German-language entertainment television show. It is the most successful Saturday television show in Europe. Its format was the basis for the British show You Bet! and the American show Wanna Bet?. The shows were broadcast live six to seven times a year from different cities in Germany, Austria, and Switzerland. There have also been seven open-air summer shows, broadcast from Amphitheatre Xanten, Plaça de Toros de Palma de Mallorca, Disneyland Paris, Waldbühne Berlin, and Aspendos Roman Theatre. Each of the shows, which were shown without commercial interruption, were usually scheduled to last for about two hours, but it was not uncommon for a show to run as much as 45 minutes longer. Featured Crew Frank Elstner Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Markus Lanz Full Cast & Crew Last Season ? season 33 2013 | 3 Episodes Season 33 of Wanna bet, that..? premiered on February 23, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1971-03-07 Die Sendung mit der Maus 6.4    1999-03-08 TV Total 3.3    1983-10-10 Alice in Wonderland 5.6    1982-09-24 Meister Eder und sein Pumuckl 5.6    1989-04-03 Alfred J. Kwak 7.7    2002-01-25 Mr. Bean: The Animated Series 5.4  Facts Original Name  Wetten, dass..? Status  Ended Networks Certification  - Type  Scripted Original Language  German Runtime  135m Homepage  - Genres Reality Keywords game show Content Score 64 We're so close, yet so far. Top Contributors S 88 Samara M 3 Megachip a 2 alexmate 2 triplesam  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}