{"link": "https://www.themoviedb.org/tv/462?language=en", "title": "Most Haunted", "resume": "Most Haunted is a British paranormal mystery documentary reality television series. The series was first shown on 25 May, 2002 and ended on 21 July, 2010. Led by Yvette Fielding, the programme investigated purported paranormal activity in many locations in the United Kingdom, Republic of Ireland and other countries. It was produced by Antix Productions and broadcast on the satellite and cable channels Living TV, Livingit, and Channel One. In the United States it was broadcast on the Travel Channel.", "rate": 63, "genre": ["Documentary", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 462   Expand Most Haunted   (2002) User Score  Play Trailer Overview Most Haunted is a British paranormal mystery documentary reality television series. The series was first shown on 25 May, 2002 and ended on 21 July, 2010. Led by Yvette Fielding, the programme investigated purported paranormal activity in many locations in the United Kingdom, Republic of Ireland and other countries. It was produced by Antix Productions and broadcast on the satellite and cable channels Living TV, Livingit, and Channel One. In the United States it was broadcast on the Travel Channel. Featured Crew Yvette Fielding Creator Karl Beattie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 21 2018 | 10 Episodes Season 21 of Most Haunted premiered on January 19, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Most Haunted. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2015-09-28 Danger Mouse 7.4    2015-05-29 Paranormal Survivor 4.8    2002-10-14 Escape to the Country 6.3    2014-10-16 Homes By the Sea 7.0    2014-07-20 People Just Do Nothing 8.0    2009-03-16 Stewart Lee's Comedy Vehicle 8.6    2014-10-04 The Pinkertons 6.9    2012-09-17 Unsealed: Alien Files 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.livingtv.co.uk/shows/mosthaunted11/ Genres Documentary Mystery Keywords paranormal show Content Score 71 Just a little bit more... Top Contributors 19 Banana S 16 ShadowMask0324 ea 9 elizabeth aden 3 amian123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}