{"link": "https://www.themoviedb.org/tv/10268?language=en", "title": "Primeval", "resume": "When strange anomalies start to appear all over England, Professor Cutter and his team must track down and capture all sorts of dangerous prehistoric creatures from Earth's distant past and near future.", "rate": 68, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Ciarán McMenamin", "Ben Mansfield", "Andrew-Lee Potts", "Hannah Spearritt", "Alexander Siddig"], "character": ["Matt Anderson", "Hilary Becker", "Connor Temple", "Abby Maitland", "Philip Burton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10268   Expand Primeval   (2007) User Score  Play Trailer Overview When strange anomalies start to appear all over England, Professor Cutter and his team must track down and capture all sorts of dangerous prehistoric creatures from Earth's distant past and near future. Featured Crew Adrian Hodges Creator Tim Haines Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  23 Posters  14 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ciarán McMenamin Matt Anderson Ben Mansfield Hilary Becker Andrew-Lee Potts Connor Temple Hannah Spearritt Abby Maitland Alexander Siddig Philip Burton Full Cast & Crew Last Season Season 5 2007 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Primeval. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  23 Posters  14 Recommendations   2012-10-29 Primeval: New World 6.1    2008-10-03 Sanctuary 6.8    2006-10-22 Torchwood 7.4    1994-11-06 Earth 2 7.4    2009-10-02 Stargate Universe 7.1    2000-10-02 Andromeda 7.1    1979-09-30 To the Manor Born 7.1    2009-07-07 Warehouse 13 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Action & Adventure Sci-Fi & Fantasy Keywords monster dinosaur team time portal anomaly jurassic Content Score 100 Yes! Looking good! Top Contributors 235 Atanas b 31 brkulin S 14 Spyke.fr S 8 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}