{"link": "https://www.themoviedb.org/tv/70744?language=en", "title": "My Secret Romance", "resume": "Cha Jin-Wook is a son from a wealthy family. His family runs a large company. Cha Jin-Wook only pursues short term love. He meets Lee Yoo-Mi and changes. Lee Yoo-Mi has never had a boyfriend before.", "rate": 76, "genre": ["Comedy"], "cast": ["Sung Hoon", "Song Ji-Eun", "Kim Jae-young", "Jeong Da-Sol", "Kim Si-Young"], "character": ["Cha Jin-Wook", "Lee Yoo-Mi", "Jung Hyun-Tae", "Joo Hye-Ri", "Wang Bok-Ja"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70744   Expand My Secret Romance   (2017) User Score Overview Cha Jin-Wook is a son from a wealthy family. His family runs a large company. Cha Jin-Wook only pursues short term love. He meets Lee Yoo-Mi and changes. Lee Yoo-Mi has never had a boyfriend before. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sung Hoon Cha Jin-Wook Song Ji-Eun Lee Yoo-Mi Kim Jae-young Jung Hyun-Tae Jeong Da-Sol Joo Hye-Ri Kim Si-Young Wang Bok-Ja Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of My Secret Romance premiered on April 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2017-03-15 Radiant Office 6.9    2017-10-11 Mad Dog 8.0    2017-11-11 Money Flower 8.0    2017-01-16 Introverted Boss 8.7    2017-10-09 Witch's Court 9.3    2015-05-15 The Producers 7.3    2017-07-03 Bride of the Water God 5.4    2015-06-08 High Society 8.3  Facts Original Name  애타는 로맨스 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  55m Homepage   http://program.tving.com/ocn/mysecretromance Genres Comedy Keywords romance korea Content Score 86 Almost there... Top Contributors M 43 Maria180493 4 Ankhaanaa 4 andermairena y 4 yudati  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}