{"link": "https://www.themoviedb.org/tv/2625?language=en", "title": "Diagnosis: Murder", "resume": "Dr. Mark Sloan is a good-natured, offbeat physician who is called upon to solve murders.", "rate": 67, "genre": ["Drama"], "cast": ["Charlie Schlatter", "Dick Van Dyke", "Michael Tucci", "Barry Van Dyke", "Victoria Rowell"], "character": ["Dr. Jesse Travis", "Dr. Mark Sloan", "Norman Briggs", "Steve Sloan", "Amanda Bentley-Livingston"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2625   Expand Diagnosis: Murder   (1993) User Score Overview Dr. Mark Sloan is a good-natured, offbeat physician who is called upon to solve murders. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Schlatter Dr. Jesse Travis Dick Van Dyke Dr. Mark Sloan Michael Tucci Norman Briggs Barry Van Dyke Steve Sloan Victoria Rowell Amanda Bentley-Livingston Full Cast & Crew Last Season Season 8 2000 | 22 Episodes Season 8 of Diagnosis: Murder premiered on October 12, 2000. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Jack or Jesse? Open 7 by  DarkMan Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  3 Recommendations   1984-09-30 Murder, She Wrote 6.5    1986-03-03 Matlock 6.9    1974-09-07 Hong Kong Phooey 6.1    1985-09-18 The Equalizer 6.3    1971-09-14 Cannon 5.6    1967-03-28 Ironside 6.8    1987-09-26 Jake and the Fatman 4.9    1982-09-26 Matt Houston 6.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Drama Keywords police parent child relationship doctor homicide detective criminal consultant Content Score 86 Almost there... Top Contributors R 34 Rebafan23 30 Banana 8 lineker 7 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}