{"link": "https://www.themoviedb.org/tv/1802?language=en", "title": "America's Most Wanted", "resume": "America's Most Wanted is an American television program produced by 20th Television, and was the longest-running program of any kind in the history of the Fox Television Network until it was announced on May 16, 2011 that the series was canceled after twenty-three years, with the final episode airing on June 18, 2011. The following September, America's Most Wanted's host, John Walsh, announced that the program would resume on the cable network Lifetime later that year.\nPresented by Walsh, the show's purpose is to profile and assist law enforcement in the apprehension of fugitives wanted for numerous crimes, including murder, rape, kidnapping, child molestation, white-collar crime, organized crime, armed robbery, gang violence, and terrorism, and also many of whom are currently on the FBI Ten Most Wanted Fugitives list. On May 2, 2008, the program's website announced its 1,000th capture; as of March 30, 2013, 1,202 people have been captured because of AMW. Many of the series' cases have some connection outside the United States or have not taken place in the United States at all. The series' first international capture was in Nova Scotia in 1989.\nThe show's nature does not allow repeats, except for updates on convicted criminals, and is preempted a maximum of eight times during the year; however, if a fugitive featured on the show is not captured, their profile may be aired again. However, since moving to Lifetime, the show aired several repeats with updates if the fugitive/missing person was captured/recovered.", "rate": 70, "genre": ["News"], "cast": ["Luis Da Silva Jr.", "Mario E. Garcia", "Lorenzo Toledo", "Dennis Garr"], "character": ["Francisco Azarte", "Lead SWAT Officer", "PREDATOR", "Lead swat"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1802   Expand America's Most Wanted   (1988) User Score Overview America's Most Wanted is an American television program produced by 20th Television, and was the longest-running program of any kind in the history of the Fox Television Network until it was announced on May 16, 2011 that the series was canceled after twenty-three years, with the final episode airing on June 18, 2011. The following September, America's Most Wanted's host, John Walsh, announced that the program would resume on the cable network Lifetime later that year. Presented by Walsh, the show's purpose is to profile and assist law enforcement in the apprehension of fugitives wanted for numerous crimes, including murder, rape, kidnapping, child molestation, white-collar crime, organized crime, armed robbery, gang violence, and terrorism, and also many of whom are currently on the FBI Ten Most Wanted Fugitives list. On May 2, 2008, the program's website announced its 1,000th capture; as of March 30, 2013, 1,202 people have been captured because of AMW. Many of the series' cases have some connection outside the United States or have not taken place in the United States at all. The series' first international capture was in Nova Scotia in 1989. The show's nature does not allow repeats, except for updates on convicted criminals, and is preempted a maximum of eight times during the year; however, if a fugitive featured on the show is not captured, their profile may be aired again. However, since moving to Lifetime, the show aired several repeats with updates if the fugitive/missing person was captured/recovered. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luis Da Silva Jr. Francisco Azarte Mario E. Garcia Lead SWAT Officer Lorenzo Toledo PREDATOR Dennis Garr Lead swat Full Cast & Crew Last Season Season 25 — | 6 Episodes We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on America's Most Wanted. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.amw.com Genres News Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors z 5 zurman1 1 gianpoker 1 SWFT  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}