{"link": "https://www.themoviedb.org/tv/443?language=en", "title": "Ghost Hunters", "resume": "Ghost Hunters is an American paranormal reality television series that premiered on October 6, 2004, on Syfy. The program features paranormal investigators Jason Hawes and Grant Wilson who investigate places that are reported to be haunted. The two originally worked as plumbers for Roto-Rooter as a day job while investigating locations at night. Since the show's success, the series now takes precedence in their lives, but they are still honorary employees with the company and continue to do jobs for them if time permits.\nThe show is unrelated to the original 1996 Inca Productions show Ghosthunters produced for the Discovery Channel. The format was sold to Pilgrim Films & Television in the United States to become Ghost Hunters. The only link between the two shows is presenter Ian Cashmore who anchored the UK/Europe show. Cashmore piloted the U.S. show, but chose not to remain part of the U.S. venture after he filmed the promos.", "rate": 47, "genre": ["Sci-Fi", "Fantasy", "Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 443   Expand Ghost Hunters   (2004) User Score  Play Trailer Overview Ghost Hunters is an American paranormal reality television series that premiered on October 6, 2004, on Syfy. The program features paranormal investigators Jason Hawes and Grant Wilson who investigate places that are reported to be haunted. The two originally worked as plumbers for Roto-Rooter as a day job while investigating locations at night. Since the show's success, the series now takes precedence in their lives, but they are still honorary employees with the company and continue to do jobs for them if time permits. The show is unrelated to the original 1996 Inca Productions show Ghosthunters produced for the Discovery Channel. The format was sold to Pilgrim Films & Television in the United States to become Ghost Hunters. The only link between the two shows is presenter Ian Cashmore who anchored the UK/Europe show. Cashmore piloted the U.S. show, but chose not to remain part of the U.S. venture after he filmed the promos. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 11 2016 | 13 Episodes Season 11 of Ghost Hunters premiered on August  3, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  12 Posters  15 Recommendations   2007-12-10 Paranormal State 5.7    BBC News 24 6.8    2005-06-05 Mock the Week 7.0    1992-08-27 Martin 7.3  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://www.syfy.com/ghosthunters/ Genres Sci-Fi & Fantasy Reality Keywords paranormal show Content Score 64 We're so close, yet so far. Top Contributors AD 10 Amerikkkan Dreme 4 Elizabeth Jennings 3 Banana s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}