{"link": "https://www.themoviedb.org/tv/3414?language=en", "title": "Scarecrow and Mrs. King", "resume": "Scarecrow and Mrs. King is an American television series that aired from October 3, 1983, to May 28, 1987 on CBS. The show stars Kate Jackson and Bruce Boxleitner as divorced housewife Amanda King and top-level \"Agency\" operative Lee Stetson who begin a strange association, and eventual romance, after encountering one another in a train station.", "rate": 61, "genre": ["Action", "Adventure", "Drama"], "cast": ["Bruce Boxleitner", "Kate Jackson", "Martha Smith", "Beverly Garland", "Mel Stewart"], "character": ["Lee Stetson", "Dotty West"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3414   Expand Scarecrow and Mrs. King   (1983) User Score Overview Scarecrow and Mrs. King is an American television series that aired from October 3, 1983, to May 28, 1987 on CBS. The show stars Kate Jackson and Bruce Boxleitner as divorced housewife Amanda King and top-level \"Agency\" operative Lee Stetson who begin a strange association, and eventual romance, after encountering one another in a train station. Featured Crew Brad Buckner Creator Eugenie Ross-Leming Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bruce Boxleitner Lee Stetson Kate Jackson Martha Smith Beverly Garland Dotty West Mel Stewart Full Cast & Crew Last Season Season 4 1986 | 22 Episodes Season 4 of Scarecrow and Mrs. King premiered on September 19, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  6 Recommendations   1984-03-19 Kate & Allie 5.3    1987-09-26 Jake and the Fatman 4.9    1986-09-17 Head of the Class 6.3    1981-11-24 Simon & Simon 6.6    1982-10-01 Remington Steele 6.9    1986-03-03 Matlock 6.9    1977-03-15 Eight Is Enough 5.9    1974-09-07 Land of the Lost 6.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords spy Content Score 93 Almost there... Top Contributors 8 Banana 7 lineker m 5 mEDI m 3 mccalimero62  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}