{"link": "https://www.themoviedb.org/tv/69701?language=en", "title": "Sim, Chef!", "resume": "Vítor Guerreiro, the authoritarian and eccentric Chef of the uber-chic Lisbon restaurant “Divina Comédia” hires Manuel, a bumbling interviewee from Braga, in order to irritate the manager Kika.", "rate": 100, "genre": ["Comedy"], "cast": ["Benedita Pereira", "Tiago Retrê", "Luís Barros", "Eric Santos", "Ivo Lucas"], "character": ["Kika, a Gerente", "Samu", "Fanã", "Bruno Falcão, o Boss", "Carlos, o Barman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69701   Expand Sim, Chef!   (2017) User Score Overview Vítor Guerreiro, the authoritarian and eccentric Chef of the uber-chic Lisbon restaurant “Divina Comédia” hires Manuel, a bumbling interviewee from Braga, in order to irritate the manager Kika. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Benedita Pereira Kika, a Gerente Tiago Retrê Samu Luís Barros Fanã Eric Santos Bruno Falcão, o Boss Ivo Lucas Carlos, o Barman Full Cast & Crew Last Season Season 2 2017 | 20 Episodes Season 2 of Sim, Chef! premiered on July  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Sim, Chef!. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  Portuguese Runtime  30m Homepage   http://media.rtp.pt/simchef/ Genres Comedy Keywords chef Content Score 86 Almost there... Top Contributors HS 95 Hugo S. 18 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}