{"link": "https://www.themoviedb.org/tv/62146?language=en", "title": "100 Code", "resume": "New York, USA. Stockholm, Sweden. Over the past twelve months young, blonde, blue-eyed women have been found dead in a meadow where Asphodel flowers grow. New York Detective Tommy Conley gets a special dispensation from the NYPD to go observe and act as an adviser to the Stockholm Police Department in order to help solve these crimes.", "rate": 61, "genre": ["Crime"], "cast": ["Michael Nyqvist", "Dominic Monaghan"], "character": ["Mikael Eklund", "Tommy Conley"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62146   Expand 100 Code   (2015) User Score  Play Trailer Overview New York, USA. Stockholm, Sweden. Over the past twelve months young, blonde, blue-eyed women have been found dead in a meadow where Asphodel flowers grow. New York Detective Tommy Conley gets a special dispensation from the NYPD to go observe and act as an adviser to the Stockholm Police Department in order to help solve these crimes. Featured Crew Robert Moresco Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Michael Nyqvist Mikael Eklund Dominic Monaghan Tommy Conley Full Cast & Crew Last Season Season 1 2015 | 12 Episodes Season 1 of 100 Code premiered on March  6, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply SB almost 100% Open 0 by Glen Griffiths\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  3 Recommendations   2016-09-25 Nobel 8.5    2015-01-22 Backstrom 6.4    2014-10-02 Gracepoint 6.5    2010-07-11 The Glades 6.3    2017-09-25 Absentia 7.3    2011-10-25 Death in Paradise 7.6    2010-06-24 Rookie Blue 7.0    2007-09-28 Moonlight 7.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  43m Homepage  - Genres Crime Keywords stockholm murder crime crime investigation criminology international crime Content Score 71 Just a little bit more... Top Contributors j 43 jnylen V 35 Vionel 7 Elizabeth Jennings i 7 ilan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}