{"link": "https://www.themoviedb.org/tv/8895?language=en", "title": "Our Gang", "resume": "Our Gang is a series of American comedy short films about a group of poor neighborhood children and their adventures. Created by comedy producer Hal Roach, the series is noted for showing children behaving in a relatively natural way, as Roach and original director Robert F. McGowan worked to film the unaffected, raw nuances apparent in regular children rather than have them imitate adult acting styles.\nIn addition, Our Gang notably put boys, girls, whites and blacks together as equals, something that \"broke new ground,\" according to film historian Leonard Maltin. That had never been done before in cinema, but has since been repeated after the success of Our Gang.\nThe first production at the Roach studio in 1922 was a series of silent short subjects. When Roach changed distributors from Pathé to Metro-Goldwyn-Mayer in 1927, and converted the series to sound in 1929, the series took off. Production continued at the Roach studio until 1938, when the series was sold to MGM, continuing to produce the comedies until 1944. The Our Gang series includes 220 shorts and one feature film, General Spanky, featuring over forty-one child actors. As MGM retained the rights to the Our Gang trademark following their purchase of the production rights, the 80 Roach-produced \"talkies\" were syndicated for television under the title The Little Rascals beginning in 1955. Both Roach's The Little Rascals package and MGM's Our Gang package have since remained in syndication, with periodic new productions based on the shorts surfacing over the years, including a 1994 Little Rascals feature film released by Universal Pictures.", "rate": 76, "genre": ["Family", "Comedy"], "cast": ["Pete the Pup", "Jackie Cooper", "Robert Blake", "Leonard Kibrick", "Tommy Bond"], "character": ["Tommy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8895   Expand Our Gang   (1922) User Score Overview Our Gang is a series of American comedy short films about a group of poor neighborhood children and their adventures. Created by comedy producer Hal Roach, the series is noted for showing children behaving in a relatively natural way, as Roach and original director Robert F. McGowan worked to film the unaffected, raw nuances apparent in regular children rather than have them imitate adult acting styles. In addition, Our Gang notably put boys, girls, whites and blacks together as equals, something that \"broke new ground,\" according to film historian Leonard Maltin. That had never been done before in cinema, but has since been repeated after the success of Our Gang. The first production at the Roach studio in 1922 was a series of silent short subjects. When Roach changed distributors from Pathé to Metro-Goldwyn-Mayer in 1927, and converted the series to sound in 1929, the series took off. Production continued at the Roach studio until 1938, when the series was sold to MGM, continuing to produce the comedies until 1944. The Our Gang series includes 220 shorts and one feature film, General Spanky, featuring over forty-one child actors. As MGM retained the rights to the Our Gang trademark following their purchase of the production rights, the 80 Roach-produced \"talkies\" were syndicated for television under the title The Little Rascals beginning in 1955. Both Roach's The Little Rascals package and MGM's Our Gang package have since remained in syndication, with periodic new productions based on the shorts surfacing over the years, including a 1994 Little Rascals feature film released by Universal Pictures. Featured Crew Hal Roach Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pete the Pup Jackie Cooper Robert Blake Leonard Kibrick Tommy Bond Tommy Full Cast & Crew Last Season Season 22 1943 | 5 Episodes Season 22 of Our Gang premiered on September 18, 1943. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1990-09-23 The Civil War 8.9    1954-09-12 Lassie 5.3  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Family Comedy Keywords children Content Score 93 Almost there... Top Contributors 22 lineker 10 Elizabeth Jennings CN 5 Carmelo Nicolosi S 2 Samara  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}