{"link": "https://www.themoviedb.org/tv/62433?language=en", "title": "Between", "resume": "Between is the story of a town under siege from a mysterious disease that has wiped out everybody except those 21 years old and under. The series explores the power vacuum that results when a government has quarantined a 10-mile diameter area and left the inhabitants to fend for themselves.", "rate": 54, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Jennette McCurdy", "Jesse Carere", "Ryan Allen", "Justin Kelly", "Kyle Mac"], "character": ["Wiley Day", "Adam Jones", "Gord", "Chuck Lott", "Ronnie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62433   Expand Between   (2015) User Score  Play Trailer Overview Between is the story of a town under siege from a mysterious disease that has wiped out everybody except those 21 years old and under. The series explores the power vacuum that results when a government has quarantined a 10-mile diameter area and left the inhabitants to fend for themselves. Featured Crew Michael McGowan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennette McCurdy Wiley Day Jesse Carere Adam Jones Ryan Allen Gord Justin Kelly Chuck Lott Kyle Mac Ronnie Full Cast & Crew Last Season Season 2 2016 | 6 Episodes Season 2 of Between premiered on June 30, 2016. View All Seasons Social Reviews  1 Discussions  1 A review by Girl lost in seriation  2.0 Written by  Girl lost in seriation  on June  3, 2018 S01: Honestly I was glad that I only had 6 episodes and they did not force me anymore. To the actors: it is worth to represent more things than a single facial expression and classic adolescent stereotypes, although the latter is actually the fault of the lousy writers. Try to be obscure and conspirative and end up being the worst of clichés. Save yourself the trouble. S02: While Netflix saw potential, the low audience shows the low arrival to the public that has the series. Lack of tension, the series fails to captivate as it should. I support what was said about the first season. I do not...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2015-07-09 Glitch 6.6    2013-02-19 Cult 4.2    2015-06-12 Conspiracy 5.7    2016-08-19 Fearless 7.0    2011-01-11 Lights Out 8.1    2015-08-07 Project Mc² 4.7    2011-09-05 Zig and Sharko 5.3    2014-08-23 Intruders 6.5  Facts Status  Returning Series Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  44m Homepage   http://between.citytv.com/ Genres Sci-Fi & Fantasy Drama Keywords quarantine isolation survivor disease trapped virus no adults Content Score 100 Yes! Looking good! Top Contributors 57 Banana 29 Nero Kosonen VF 18 Vitor Fernandes 15 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}