{"link": "https://www.themoviedb.org/tv/67210?language=en", "title": "Like-moi!", "resume": "In a series of savage, often offbeat, comedic sketches, Like Me! illustrates the myriad facets—emotions, friendships and sex lives—of the Millennial generation. A mixed bag of absurd send-ups, laser-sharp observations and raw dialogue, the show explores a world where relationships are disposable, sentiment is recyclable, and pleasure is marketable.", "rate": 10, "genre": ["Comedy"], "cast": ["Philippe-Audrey Larrue-St-Jacques", "Florence Longpré", "Karine Gonthier-Hyndman", "Katherine Levac", "Adib Alkhalidey"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67210   Expand Like-moi!   (2015) User Score Overview In a series of savage, often offbeat, comedic sketches, Like Me! illustrates the myriad facets—emotions, friendships and sex lives—of the Millennial generation. A mixed bag of absurd send-ups, laser-sharp observations and raw dialogue, the show explores a world where relationships are disposable, sentiment is recyclable, and pleasure is marketable. Featured Crew Marc Brunet Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philippe-Audrey Larrue-St-Jacques Florence Longpré Karine Gonthier-Hyndman Katherine Levac Adib Alkhalidey Full Cast & Crew Current Season Season 3 2018 | 11 Episodes Season 3 of Like-moi! premiered on January  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Like-moi!. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification C8 Meaning Suitable for children ages 8+. Low level violence and fantasy horror is allowed. No foul language is allowed, but occasional \"socially offensive and discriminatory\" language is allowed if in the context of the story. No sexual content of any level allowed. Type  Scripted Original Language  French Runtime  23m Homepage   http://likemoi.telequebec.tv Genres Comedy Keywords technology relationship sketch comedy millennials Content Score 100 Yes! Looking good! Top Contributors 77 Banana m 2 marcdede 2 karaa TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}