{"link": "https://www.themoviedb.org/tv/67391?language=en", "title": "The K2", "resume": "Drama about a patriotic bodyguard who was abandoned by his country and colleagues, a hidden daughter of leading Presidential candidate who regards love as a tool for revenge, and the First Lady contender who hides her ambition and charisma behind a kind and friendly personality.", "rate": 51, "genre": ["Action", "Adventure", "Drama", "War", "Politics"], "cast": ["Ji Chang-wook", "Song Yun-ah", "Im Yoona", "Cho Seong-ha", "Lee Jung-Jin"], "character": ["Kim Je-Ha", "Choi Yoo-Jin", "Ko An-Na", "Jang Se-Joon", "Choi Sung-Won"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67391   Expand The K2   (2016) User Score  Play Trailer Overview Drama about a patriotic bodyguard who was abandoned by his country and colleagues, a hidden daughter of leading Presidential candidate who regards love as a tool for revenge, and the First Lady contender who hides her ambition and charisma behind a kind and friendly personality. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ji Chang-wook Kim Je-Ha Song Yun-ah Choi Yoo-Jin Im Yoona Ko An-Na Cho Seong-ha Jang Se-Joon Lee Jung-Jin Choi Sung-Won Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of The K2 premiered on September 23, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2016-08-27 Our Gap Soon 9.3    2016-09-21 On the Way to the Airport 8.7    2016-09-26 Woman with a Suitcase 7.1    2016-11-16 Oh My Geum Bi 8.7    2016-09-21 Shopping King Louie 6.7    2016-08-27 Blow Breeze 6.6    2016-09-05 Drinking Solo 8.1    2016-03-18 Ms. Temper & Nam Jung Gi 6.0  Facts Original Name  더 케이투 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.interest.me/tvn/thek2/ Genres Action & Adventure Drama War & Politics Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors M 45 Maria180493 19 daliasued 9 Elizabeth Jennings z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}