{"link": "https://www.themoviedb.org/tv/70390?language=en", "title": "Somewhere Between", "resume": "Laura Price, a local news producer in San Francisco, is helping the police to hunt down a serial killer. After the killer strikes close to home, a twist of fate allows a “Groundhog Day”-type reset, and Laura relives the week prior to the string of murders. Can she change fate and stop the killer?", "rate": 59, "genre": ["Crime", "Drama"], "cast": ["Paula Patton", "Devon Sawa", "JR Bourne", "Aria Birch"], "character": ["Laura Price", "Nico Jackson", "Tom Price", "Serena Price"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70390   Expand Somewhere Between   (2017) User Score  Play Trailer Overview Laura Price, a local news producer in San Francisco, is helping the police to hunt down a serial killer. After the killer strikes close to home, a twist of fate allows a “Groundhog Day”-type reset, and Laura relives the week prior to the string of murders. Can she change fate and stop the killer? Featured Crew Stephen Tolkin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paula Patton Laura Price Devon Sawa Nico Jackson JR Bourne Tom Price Aria Birch Serena Price Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Somewhere Between premiered on July 24, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply b Paula Patton Open 11 by  Jana Did she just... [Minor spoiler 1x9] Open 0 by Jana\n      \n     this is so bad Open 22 by  ScorpionQ2 Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  1 Recommendations   2017-10-01 Ten Days in the Valley 6.0    2017-10-01 Wisdom of the Crowd 7.1    2017-02-27 When We Rise 6.7    2017-10-01 Ghosted 6.2    2017-11-07 Damnation 7.2    2017-09-07 Tin Star 7.3    2017-09-25 The Brave 6.6    2016-09-22 Pitch 5.1  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  41m Homepage   http://abc.go.com/shows/somewhere-between Genres Crime Drama Keywords san francisco remake murder serial killer changing the past or future Content Score 100 Yes! Looking good! Top Contributors 92 Banana 23 Warpath 9 Elizabeth Jennings t 5 tmdb42368388  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}