{"link": "https://www.themoviedb.org/tv/3172?language=en", "title": "Private Practice", "resume": "Having left behind Seattle Grace Hospital, renowned surgeon Addison Forbes Montgomery moves to Los Angeles for sunnier weather and happier possibilities. She reunites with her friends from medical school, joining them at their chic, co-op, Oceanside Wellness Center in Santa Monica.", "rate": 63, "genre": ["Drama"], "cast": ["Kate Walsh", "Benjamin Bratt", "Paul Adelstein", "KaDee Strickland", "Caterina Scorsone"], "character": ["Dr. Addison Montgomery", "Dr. Jake Reilly", "Cooper Freedman", "Charlotte King", "Amelia Shepherd"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3172   Expand Private Practice   (2007) User Score Overview Having left behind Seattle Grace Hospital, renowned surgeon Addison Forbes Montgomery moves to Los Angeles for sunnier weather and happier possibilities. She reunites with her friends from medical school, joining them at their chic, co-op, Oceanside Wellness Center in Santa Monica. Featured Crew Shonda Rhimes Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  27 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Walsh Dr. Addison Montgomery Benjamin Bratt Dr. Jake Reilly Paul Adelstein Cooper Freedman KaDee Strickland Charlotte King Caterina Scorsone Amelia Shepherd Full Cast & Crew Last Season Season 6 2012 | 13 Episodes View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Amelia Shepherd: Happy Birthday Caterina Scorsone! Open 0 by wonder2wonder\n      \n     w Dr. Addison Montgomery: Happy Birthday Kate Walsh! Open 0 by wonder2wonder\n      \n     w Dr. Naomi Bennett: Happy Birthday Audra McDonald! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  27 Posters  7 Recommendations   2001-09-24 Crossing Jordan 6.8    2006-09-24 Brothers and Sisters 6.8    2002-09-26 Without a Trace 6.8    2006-03-05 Numb3rs 6.5    2005-01-03 Medium 6.4    2005-07-20 So You Think You Can Dance 6.5    1994-09-18 Chicago Hope 7.3    1992-09-23 Mad About You 6.0  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m, 60m, 43m Homepage   http://abc.go.com/primetime/privatepractice/index Genres Drama Keywords doctor spin off medical drama Content Score 93 Almost there... Top Contributors 51 prm96 31 Elizabeth Jennings R 20 Rebecca s 11 shiff7  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}