{"link": "https://www.themoviedb.org/tv/1527?language=en", "title": "Due South", "resume": "Due South is a Canadian crime drama series with elements of comedy. The series was created by Paul Haggis, produced by Alliance Communications, and stars Paul Gross, David Marciano, Gordon Pinsent, Beau Starr, Camilla Scott, Ramona Milano, and latterly Callum Keith Rennie. It ran for 68 episodes over four seasons, from 1994 to 1999.\nSet in Chicago, the show follows the adventures of Constable Benton Fraser, an officer of the Royal Canadian Mounted Police, who is attached to the Canadian consulate but works with Detective Raymond Vecchio of the Chicago Police Department to solve crimes, assisted by Fraser's companion Diefenbaker, a deaf white wolfdog. From season three, Fraser works with a Detective Stanley Kowalski, who is placed in the department to impersonate Detective Vecchio, who goes on an undercover assignment.\nThe premise of such a working relationship is established in the pilot episode when Fraser is temporarily posted to Chicago to assist Vecchio in the investigation of the murder of Fraser's father, who was also of the RCMP. In the process of finding them, he also exposes an environmental corruption scandal involving some members of the RCMP, causing much embarrassment and loss of jobs in his native Northwest Territories, which leaves him persona non grata in Canada and within the RCMP and posted permanently to Chicago.", "rate": 75, "genre": ["Action", "Adventure"], "cast": ["Paul Gross", "Paul Gross", "David Marciano", "Beau Starr", "Catherine Bruhier"], "character": ["Benton Fraser", "Constable Benton Fraser", "Lt. Harding Welsh", "Elaine Besbriss"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1527   Expand Due South   (1994) User Score  Play Trailer Overview Due South is a Canadian crime drama series with elements of comedy. The series was created by Paul Haggis, produced by Alliance Communications, and stars Paul Gross, David Marciano, Gordon Pinsent, Beau Starr, Camilla Scott, Ramona Milano, and latterly Callum Keith Rennie. It ran for 68 episodes over four seasons, from 1994 to 1999. Set in Chicago, the show follows the adventures of Constable Benton Fraser, an officer of the Royal Canadian Mounted Police, who is attached to the Canadian consulate but works with Detective Raymond Vecchio of the Chicago Police Department to solve crimes, assisted by Fraser's companion Diefenbaker, a deaf white wolfdog. From season three, Fraser works with a Detective Stanley Kowalski, who is placed in the department to impersonate Detective Vecchio, who goes on an undercover assignment. The premise of such a working relationship is established in the pilot episode when Fraser is temporarily posted to Chicago to assist Vecchio in the investigation of the murder of Fraser's father, who was also of the RCMP. In the process of finding them, he also exposes an environmental corruption scandal involving some members of the RCMP, causing much embarrassment and loss of jobs in his native Northwest Territories, which leaves him persona non grata in Canada and within the RCMP and posted permanently to Chicago. Featured Crew Paul Haggis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  7 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Gross Benton Fraser Paul Gross Constable Benton Fraser David Marciano Beau Starr Lt. Harding Welsh Catherine Bruhier Elaine Besbriss Full Cast & Crew Last Season Season 3 1997 | 13 Episodes Season 3 of Due South premiered on September 14, 1997. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply h Due south Open 0 by holdme\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  7 Recommendations   1996-09-21 Profiler 6.5    1998-10-07 Seven Days 7.5    2011-10-14 Spy 7.6    1994-09-18 Chicago Hope 7.3    1993-01-01 Dr. Quinn, Medicine Woman 6.2    2001-09-24 Crossing Jordan 6.8    1982-09-20 Smiley's People 7.9    1996-03-29 Nash Bridges 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m Homepage  - Genres Action & Adventure Keywords canadian stereotype crime investigation royal canadian mounted police (rcmp) Content Score 100 Yes! Looking good! Top Contributors 18 Banana d 10 denis 7 chris55204 Z 6 Zerstin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}