{"link": "https://www.themoviedb.org/tv/10219?language=en", "title": "Handy Manny", "resume": "Handy Manny is a Disney animated children's television program that premiered on September 16, 2006. The program was originally part of the Playhouse Disney daily block intended for preschoolers. On February 14, 2011, it was moved to the Disney Junior block, serving as Playhouse Disney's replacement.\nThe show features Wilmer Valderrama who plays Manny Garcia. Children aged 4–8 are usually the show's audience.\nThe show was created by Roger Bollen, Marilyn Sadler and Emmy Award-winning writer and producer Rick Gitelson. The animation is produced by Toronto-based Nelvana and features the voice performances of Wilmer Valderrama, Dee Bradley Baker, Tom Kenny, Fred Stoller, Nika Futterman, Kath Soucie, Carlos Alazraqui, and Grey DeLisle. Special guest stars in the series have included Lance Bass, Kurtwood Smith, Shelley Morrison, Fred Willard, Penn Jillette, Jane Lynch, Jon Polito, Ashley Parker Angel, Brian George, Snoop Dogg, Shannon Durig, Marion Ross, Chris Rock, James Belushi, Ice-T, Henry Winkler, Dale Earnhardt, Jr., Freddy Rodriguez, Ed O'Neil, Denzel Whitaker, Zachary Gordon, Lauren Tom, Rosario Dawson, and Bob Glouberman. The theme song is performed by Los Lobos. Reruns are being shown at 6 AM on the Disney Junior block.", "rate": 60, "genre": ["Animation", "Comedy"], "cast": ["Wilmer Valderrama"], "character": ["Manny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10219   Expand Handy Manny   (2006) User Score Overview Handy Manny is a Disney animated children's television program that premiered on September 16, 2006. The program was originally part of the Playhouse Disney daily block intended for preschoolers. On February 14, 2011, it was moved to the Disney Junior block, serving as Playhouse Disney's replacement. The show features Wilmer Valderrama who plays Manny Garcia. Children aged 4–8 are usually the show's audience. The show was created by Roger Bollen, Marilyn Sadler and Emmy Award-winning writer and producer Rick Gitelson. The animation is produced by Toronto-based Nelvana and features the voice performances of Wilmer Valderrama, Dee Bradley Baker, Tom Kenny, Fred Stoller, Nika Futterman, Kath Soucie, Carlos Alazraqui, and Grey DeLisle. Special guest stars in the series have included Lance Bass, Kurtwood Smith, Shelley Morrison, Fred Willard, Penn Jillette, Jane Lynch, Jon Polito, Ashley Parker Angel, Brian George, Snoop Dogg, Shannon Durig, Marion Ross, Chris Rock, James Belushi, Ice-T, Henry Winkler, Dale Earnhardt, Jr., Freddy Rodriguez, Ed O'Neil, Denzel Whitaker, Zachary Gordon, Lauren Tom, Rosario Dawson, and Bob Glouberman. The theme song is performed by Los Lobos. Reruns are being shown at 6 AM on the Disney Junior block. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wilmer Valderrama Manny Full Cast & Crew Last Season Season 3 2010 | 81 Episodes Season 3 of Handy Manny premiered on September 11, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1999-04-12 Bob the Builder 5.5    2000-08-13 Dora the Explorer 4.2    1999-05-01 SpongeBob SquarePants 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://disneyjunior.com/handy-manny Genres Animation Comedy Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors c 6 christra v 6 vinser 3 Elizabeth Jennings c 3 chloris77  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}