{"link": "https://www.themoviedb.org/tv/66090?language=en", "title": "Wolf Creek", "resume": "An anthology series which centers on different characters being targeted by crazed serial killer Mick Taylor in the Australian outback.", "rate": 66, "genre": ["Action", "Adventure", "Crime", "Drama"], "cast": ["John Jarratt", "Tess Haubrich", "Matt Day"], "character": ["Mick Taylor", "Rebecca", "Brian"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66090   Expand Wolf Creek   (2016) User Score  Play Trailer Overview An anthology series which centers on different characters being targeted by crazed serial killer Mick Taylor in the Australian outback. Featured Crew Greg McLean Creator Tony Tilse Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Jarratt Mick Taylor Tess Haubrich Rebecca Matt Day Brian Full Cast & Crew Current Season Season 2 2017 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Wolf Creek. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  7 Posters  3 Recommendations   2017-03-05 Making History 6.5    1968-09-20 Hawaii Five-O 6.7    2015-10-07 Casual 6.5    2013-04-14 Anthony Bourdain: Parts Unknown 6.8    2016-10-11 Channel Zero 6.6    2016-03-04 Slasher 6.0    2014-01-22 Broad City 7.6    2015-11-15 Into the Badlands 7.4  Facts Status  Returning Series Network Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.wolfcreek.com.au Genres Action & Adventure Crime Drama Keywords horror revenge thriller outback australian outback Content Score 71 Just a little bit more... Top Contributors 36 Rug 17 Elizabeth Jennings c 15 courtneysmith86 a 8 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}