{"link": "https://www.themoviedb.org/tv/12433?language=en", "title": "A case for two", "resume": "Ein Fall für zwei is a German television series, which premiered on September 11, 1981 on ZDF. The series, located in Frankfurt am Main, features two main characters who solve crimes: a defense attorney and a private investigator.\nJosef Matula, a former German police officer, has gone into private business. His method of investigation is very effective and direct, and he sometimes even resorts to dirty tricks. Claus Theo Gärtner has portrayed the role since the start of the series.\nIn contrast, the attorney character has changed several times. The first attorney was Dr. Dieter Renz. Dr. Renz retired in episode #60 and was replaced by Dr. Rainer Franck. In episode #149, Dr. Franck took a job as a law school teacher, and was replaced by Dr. Johannes Voss. In episode #182, Dr. Voss was shot dead by an escaping criminal, and was in turn replaced by Dr. Markus Lessing.\nMost of the episodes follow a simple pattern. Someone is murdered, and the police arrest the most likely suspect. The suspect, claiming to be innocent, hires the attorney in the series as his lawyer. The attorney does all the paperwork, talks with the police and attends court. Meanwhile, Matula does all the actual research and detective work - \"gets his hands dirty\", so to speak. Matula often gets into fights, and even though he is in his early sixties, he often knocks out the bad guys. In the end, the original suspect usually turns out to be innocent after all, and the real culprit is found.", "rate": 65, "genre": ["Drama", "Crime"], "cast": ["Antoine Monot Jr.", "Wanja Mues"], "character": ["Benni Hornberg", "Leo Oswald"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12433   Expand A case for two   (1981) User Score Overview Ein Fall für zwei is a German television series, which premiered on September 11, 1981 on ZDF. The series, located in Frankfurt am Main, features two main characters who solve crimes: a defense attorney and a private investigator. Josef Matula, a former German police officer, has gone into private business. His method of investigation is very effective and direct, and he sometimes even resorts to dirty tricks. Claus Theo Gärtner has portrayed the role since the start of the series. In contrast, the attorney character has changed several times. The first attorney was Dr. Dieter Renz. Dr. Renz retired in episode #60 and was replaced by Dr. Rainer Franck. In episode #149, Dr. Franck took a job as a law school teacher, and was replaced by Dr. Johannes Voss. In episode #182, Dr. Voss was shot dead by an escaping criminal, and was in turn replaced by Dr. Markus Lessing. Most of the episodes follow a simple pattern. Someone is murdered, and the police arrest the most likely suspect. The suspect, claiming to be innocent, hires the attorney in the series as his lawyer. The attorney does all the paperwork, talks with the police and attends court. Meanwhile, Matula does all the actual research and detective work - \"gets his hands dirty\", so to speak. Matula often gets into fights, and even though he is in his early sixties, he often knocks out the bad guys. In the end, the original suspect usually turns out to be innocent after all, and the real culprit is found. Featured Crew Karl Heinz Willschrei Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antoine Monot Jr. Benni Hornberg Wanja Mues Leo Oswald Full Cast & Crew Current Season Season 37 2017 | 4 Episodes Season 37 of A case for two premiered on October 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   1974-10-20 Derrick 5.1  Facts Original Name  Ein Fall für zwei Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  60m Homepage   http://einfallfuerzwei.zdf.de/ Genres Drama Crime Keywords lawyer private detective Content Score 64 We're so close, yet so far. Top Contributors S 328 Samara TS 16 Tony S. r 6 rhin_tin s 5 stesme  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}