{"link": "https://www.themoviedb.org/tv/5084?language=en", "title": "Kolchak: The Night Stalker", "resume": "Kolchak: The Night Stalker is an American television series that aired on ABC during the 1974–1975 season. It featured a fictional Chicago newspaper reporter—Carl Kolchak, played by Darren McGavin—who investigated mysterious crimes with unlikely causes, particularly those that law enforcement authorities would not follow up. These often involved the supernatural or even science fiction, including fantastic creatures.\nThe series was preceded by two television movies, The Night Stalker and The Night Strangler. The series only lasted a single season, it remains popular in syndication; it is often cited as the inspiration for the popular series The X-Files. Following the success of The X-Files, the franchise was resurrected in 2005 in a second television series with a new cast and characters, as well as subsequent in novels and comic books.\nThe entire series is available in syndication and is occasionally rerun on the Sci-Fi Channel under an expanded title, Kolchak: The Night Stalker. In 2008, it was aired on Chiller. It is also available on DVD and streaming from Netflix.", "rate": 81, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Darren McGavin", "Simon Oakland", "Jack Grinnage", "Ruth McDevitt"], "character": ["Carl Kolchak", "Tony Vincenzo", "Ron Updyke", "Emily Cowles"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5084   Expand Kolchak: The Night Stalker   (1974) User Score  Play Trailer Overview Kolchak: The Night Stalker is an American television series that aired on ABC during the 1974–1975 season. It featured a fictional Chicago newspaper reporter—Carl Kolchak, played by Darren McGavin—who investigated mysterious crimes with unlikely causes, particularly those that law enforcement authorities would not follow up. These often involved the supernatural or even science fiction, including fantastic creatures. The series was preceded by two television movies, The Night Stalker and The Night Strangler. The series only lasted a single season, it remains popular in syndication; it is often cited as the inspiration for the popular series The X-Files. Following the success of The X-Files, the franchise was resurrected in 2005 in a second television series with a new cast and characters, as well as subsequent in novels and comic books. The entire series is available in syndication and is occasionally rerun on the Sci-Fi Channel under an expanded title, Kolchak: The Night Stalker. In 2008, it was aired on Chiller. It is also available on DVD and streaming from Netflix. Featured Crew Jeff Rice Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  37 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Darren McGavin Carl Kolchak Simon Oakland Tony Vincenzo Jack Grinnage Ron Updyke Ruth McDevitt Emily Cowles Full Cast & Crew Last Season Season 1 1974 | 20 Episodes View All Seasons Social Reviews  1 Discussions  38 A review by Wuchak  7.0 Written by  Wuchak  on April 26, 2018 The influential Kolchak TV series from 1974-1975 The TV series Kolchak: The Night Stalker ran for one season in 1974-1975, consisting of 20 episodes. Two additional episodes were scheduled to be filmed, but star Darren McGavin was becoming disillusioned with due to an exhausting schedule and the fact that he was rewriting scripts plus doing much of the production work without compensation.  The ratings were mediocre so he asked to be released from his contract with two episodes yet to be shot. The network granted his request in light of the ratings. I wish Darren would’ve persevered and fini...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations   1961-01-07 The Avengers 7.6    1949-09-15 The Lone Ranger 5.4    1957-09-18 Wagon Train 6.3    1963-09-24 Petticoat Junction 5.7    1965-02-20 Sherlock Holmes 7.1    1960-09-29 My Three Sons 6.0    1958-09-22 Peter Gunn 8.3    1975-01-02 The Sweeney 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords monster news reporter official cover-up Content Score 100 Yes! Looking good! Top Contributors j 10 jpowell180 PE 7 Patrick E. Abe 2 brimfin 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}