{"link": "https://www.themoviedb.org/tv/45909?language=en", "title": "Daddy's Daughters", "resume": "\"Daddy's Daughters\" is a Russian TV series produced in 2007—2012. Made by \"Kinokonstanta\" and \"Kostafilm\" film companies. It characterized the various aspects of life — there are themes of family, love, work, study, and friendship. The series has very high television ratings and many awards. This is an original sitcom, and is not an adaptation of a foreign show.", "rate": 48, "genre": [], "cast": ["Andrey Leonov", "Nonna Grishaeva", "Miroslava Karpovich", "Anastasia Sivayeva", "Ekaterina Starshova"], "character": ["Sergej Vasnetsov", "Ljudmila Vasnetsova", "Masha Vasnetsova", "Dasha Vasnetsova", "Polina Vasnetsova"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45909   Expand Daddy's Daughters   (2007) User Score Overview \"Daddy's Daughters\" is a Russian TV series produced in 2007—2012. Made by \"Kinokonstanta\" and \"Kostafilm\" film companies. It characterized the various aspects of life — there are themes of family, love, work, study, and friendship. The series has very high television ratings and many awards. This is an original sitcom, and is not an adaptation of a foreign show. Featured Crew Vyacheslav Murugov Creator Alexandr Rodnyansky Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrey Leonov Sergej Vasnetsov Nonna Grishaeva Ljudmila Vasnetsova Miroslava Karpovich Masha Vasnetsova Anastasia Sivayeva Dasha Vasnetsova Ekaterina Starshova Polina Vasnetsova Full Cast & Crew Last Season Season 15 2011 | 20 Episodes Season 15 of Daddy's Daughters premiered on March 28, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   2013-10-27 Ashes 5.0    2004-09-07 Diversant 5.0    2010-03-29 Interny 5.7    2011-03-29 Body of Proof 6.7  Facts Original Name  Папины дочки Status  Returning Series Network Certification  - Type  Scripted Original Language  Russian Runtime  24m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 37 mrtextortexel 6 Mark Gubarenko L 6 LordKIN 5 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}