{"link": "https://www.themoviedb.org/tv/1578?language=en", "title": "Out of This World", "resume": "Out Of This World is an American fantasy sitcom about a teenage girl who is half alien, which gives her unique supernatural powers. It first aired in syndication from September 17, 1987 and ended on May 25, 1991.\nDuring its first season, the series was originally part of NBC's Prime Time Begins at 7:30 campaign, in which the network's owned-and-operated stations would run first-run sitcoms in the 7:30-8 pm time slot to counterprogram competing stations' game shows, sitcom reruns and other offerings. Out of This World was rotated with the original series Marblehead Manor and She's the Sheriff, a syndicated revival of the 1983 sitcom We Got It Made, and a television adaptation of the play You Can't Take It With You. NBC ended the experiment after the 1987-88 season due to the low ratings put up by three of the series, with Out of This World being one of the two that was renewed. After its first season the series was largely moved to weekend time slots, where it remained until its cancellation following the fourth season.", "rate": 78, "genre": ["Sci-Fi", "Fantasy", "Comedy"], "cast": ["Maureen Flannigan", "Donna Pescow", "Doug McClure", "Joe Alaskey", "Steve Burton"], "character": ["Evie Ethel Garland", "Donna Garland", "Kyle X. Applegate", "Beano Froelich", "Chris Fuller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1578   Expand Out of This World   (1987) User Score Overview Out Of This World is an American fantasy sitcom about a teenage girl who is half alien, which gives her unique supernatural powers. It first aired in syndication from September 17, 1987 and ended on May 25, 1991. During its first season, the series was originally part of NBC's Prime Time Begins at 7:30 campaign, in which the network's owned-and-operated stations would run first-run sitcoms in the 7:30-8 pm time slot to counterprogram competing stations' game shows, sitcom reruns and other offerings. Out of This World was rotated with the original series Marblehead Manor and She's the Sheriff, a syndicated revival of the 1983 sitcom We Got It Made, and a television adaptation of the play You Can't Take It With You. NBC ended the experiment after the 1987-88 season due to the low ratings put up by three of the series, with Out of This World being one of the two that was renewed. After its first season the series was largely moved to weekend time slots, where it remained until its cancellation following the fourth season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maureen Flannigan Evie Ethel Garland Donna Pescow Donna Garland Doug McClure Kyle X. Applegate Joe Alaskey Beano Froelich Steve Burton Chris Fuller Full Cast & Crew Last Season Season 4 1990 | 24 Episodes Season 4 of Out of This World premiered on October  6, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Out of This World. You can help by rating TV shows you've seen. Facts Status  Ended Network Broadcast Syndication Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  25m, 30m, 22m Homepage  - Genres Sci-Fi & Fantasy Comedy Keywords alien teenage girl time freeze  special powers Content Score 86 Almost there... Top Contributors t 11 tmdb64845936 MT 6 Michael Thiel 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}