{"link": "https://www.themoviedb.org/tv/47320?language=en", "title": "Cedar Cove", "resume": "Judge Olivia Lockhart is considered the community's guiding light in the picturesque, coastal town of Cedar Cove, Washington. But like everyone else, Olivia fights the uphill battle of balancing career with family and finding love, all the while doing her best to care for the township she calls home. Based on best-selling author Debbie Macomber’s beloved book series.", "rate": 67, "genre": ["Drama"], "cast": ["Andie MacDowell", "Dylan Neal", "Teryl Rothery", "Brennan Elliott", "Timothy Webber"], "character": ["Olivia Lockhart", "Jack Griffith", "Grace Sherman", "Warren Saget", "Moon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47320   Expand Cedar Cove   (2013) User Score Overview Judge Olivia Lockhart is considered the community's guiding light in the picturesque, coastal town of Cedar Cove, Washington. But like everyone else, Olivia fights the uphill battle of balancing career with family and finding love, all the while doing her best to care for the township she calls home. Based on best-selling author Debbie Macomber’s beloved book series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andie MacDowell Olivia Lockhart Dylan Neal Jack Griffith Teryl Rothery Grace Sherman Brennan Elliott Warren Saget Timothy Webber Moon Full Cast & Crew Last Season Season 3 2015 | 11 Episodes Season 3 of Cedar Cove premiered on July 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2011-08-05 Friends with Benefits 6.1    2015-09-27 Blood & Oil 6.4    1985-03-03 Moonlighting 7.2  Facts Status  Returning Series Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.hallmarkchannel.com/cedar-cove Genres Drama Keywords small town career woman coastal town finding love Content Score 86 Almost there... Top Contributors 52 Elizabeth Jennings 9 Banana S 8 Shady12 z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}