{"link": "https://www.themoviedb.org/tv/76582?language=en", "title": "Unsolved: The Murders of Tupac and The Notorious B.I.G.", "resume": "A chronicle of the two major police investigations by LAPD Detective Greg Kading into the deaths of Tupac and The Notorious B.I.G.", "rate": 68, "genre": ["Drama"], "cast": ["Josh Duhamel", "Jimmi Simpson", "Bokeem Woodbine", "Jamie McShane", "Marcc Rose"], "character": ["Detective Greg Kading", "Detective Russell Poole", "Officer Daryn Dupree", "Detective Fred Miller", "Tupac Shakur"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76582   Expand Unsolved: The Murders of Tupac and The Notorious B.I.G.   (2018) User Score  Play Trailer Overview A chronicle of the two major police investigations by LAPD Detective Greg Kading into the deaths of Tupac and The Notorious B.I.G. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Duhamel Detective Greg Kading Jimmi Simpson Detective Russell Poole Bokeem Woodbine Officer Daryn Dupree Jamie McShane Detective Fred Miller Marcc Rose Tupac Shakur Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Unsolved: The Murders of Tupac and The Notorious B.I.G. premiered on February 27, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply J average show Open 0 by J\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2016-02-02 American Crime Story 7.0    2017-01-07 Taboo 8.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  42m Homepage   http://www.usanetwork.com/unsolved Genres Drama Keywords tupac shakur Content Score 93 Almost there... Top Contributors 28 Elizabeth Jennings 27 loyis77 AK 5 Avshalom Kor O 5 OnNeVitQue2FoisJB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}