{"link": "https://www.themoviedb.org/tv/42531?language=en", "title": "Powers", "resume": "Two homicide detectives, Christian Walker and Deena Pilgrim, are assigned to investigate cases involving people with superhuman abilities, referred to as “Powers.” Set amidst today’s paparazzi culture, Powers asks the questions, what if the world was full of superheroes who aren't actually heroic at all? What if all that power was just one more excuse for mischief, mayhem, murder, and endorsement deals?", "rate": 65, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Sharlto Copley", "Susan Heyward", "Noah Taylor", "Eddie Izzard", "Michelle Forbes"], "character": ["Christian Walker", "Deena Pilgrim", "Johnny Royalle", "Wolfe", "Retro Girl"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42531   Expand Powers   (2015) User Score  Play Trailer Overview Two homicide detectives, Christian Walker and Deena Pilgrim, are assigned to investigate cases involving people with superhuman abilities, referred to as “Powers.” Set amidst today’s paparazzi culture, Powers asks the questions, what if the world was full of superheroes who aren't actually heroic at all? What if all that power was just one more excuse for mischief, mayhem, murder, and endorsement deals? Featured Crew Brian Michael Bendis Creator Charlie Huston Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sharlto Copley Christian Walker Susan Heyward Deena Pilgrim Noah Taylor Johnny Royalle Eddie Izzard Wolfe Michelle Forbes Retro Girl Full Cast & Crew Last Season Season 2 2016 | 10 Episodes Season 2 of Powers premiered on May 31, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  3 Recommendations   2014-08-13 Legends 6.6    2014-06-19 Dominion 5.9    2015-03-05 Dig 6.4    2012-10-11 Copper 6.0    2009-06-14 Alan Carr: Chatty Man 5.0    2016-09-11 Son of Zorn 5.6    1999-06-09 Crusade 6.6    2013-04-19 Hemlock Grove 6.4  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.playstation.com/en-us/explore/playstation-plus/powers/ Genres Drama Sci-Fi & Fantasy Keywords hero superhero villain based on comic superhuman super power homicide detective Content Score 100 Yes! Looking good! Top Contributors 34 Elizabeth Jennings 9 Banana M 9 Manu 6 Tifar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}