{"link": "https://www.themoviedb.org/tv/4775?language=en", "title": "Would I Lie to You?", "resume": "A comedic panel show featuring team captains Lee Mack and David Mitchell plus two guests per side, hosted by Rob Brydon (formerly Angus Deayton). Each person must reveal embarrassing facts and outrageous lies during a series of different rounds including \"Home Truths\", \"This Is My...\" and \"Quickfire Lies\". It is up to the opposing team to tell tall tales from fantastic facts.", "rate": 78, "genre": ["Comedy"], "cast": ["David Mitchell", "Rob Brydon", "Lee Mack"], "character": ["Himself", "Himself - Host", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4775   Expand Would I Lie to You?   (2007) User Score Overview A comedic panel show featuring team captains Lee Mack and David Mitchell plus two guests per side, hosted by Rob Brydon (formerly Angus Deayton). Each person must reveal embarrassing facts and outrageous lies during a series of different rounds including \"Home Truths\", \"This Is My...\" and \"Quickfire Lies\". It is up to the opposing team to tell tall tales from fantastic facts. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Mitchell Himself Rob Brydon Himself - Host Lee Mack Himself Full Cast & Crew Current Season Series 11 2017 | 7 Episodes Season 11 of Would I Lie to You? premiered on November 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Recommendations   1990-09-28 Have I Got News for You 7.6    1996-11-12 Never Mind the Buzzcocks 7.5    2013-04-12 8 Out of 10 Cats Does Countdown 7.3    2005-06-05 Mock the Week 7.0    2003-09-11 QI 8.2    2013-10-06 Was It Something I Said? 7.6    1999-04-07 Strangers with Candy 7.0    2010-02-15 Funny or Die Presents 5.6  Facts Status  Returning Series Network Certification PG Meaning Parental guidance is recommended for young viewers; PG-rated content may air at any time on digital-only channels, otherwise, it should only be broadcast between 8:30 a.m. and 4:00 p.m. and between 7:00 p.m. and 6:00 a.m. on weekdays, and between 10:00 a.m. and 6:00 a.m. on weekends. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b04mh6x6 Genres Comedy Keywords truth game show lying panel show british humour Content Score 56 We're so close, yet so far. Top Contributors 51 RobotoRaccoon 22 Elizabeth Jennings a 6 alexmate 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}