{"link": "https://www.themoviedb.org/tv/62195?language=en", "title": "The Whispers", "resume": "We love to play games with our children. But what happens when someone else starts to play with them too? Someone we don't know. Can't see. Can't hear. In The Whispers, someone or something -- is manipulating the ones we love most to accomplish the unthinkable. An unseen alien force has figured this human weakness out. They have invaded earth and are using our most unlikely resource to achieve world domination – our children.", "rate": 60, "genre": ["Mystery", "Sci-Fi", "Fantasy"], "cast": ["Lily Rabe", "Barry Sloane", "Milo Ventimiglia", "Derek Webster", "Kristen Connolly"], "character": ["Claire Bennigan", "Wes Lawrence", "John Doe", "Jessup Rollins", "Lena Lawrence"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62195   Expand The Whispers   (2015) User Score Overview We love to play games with our children. But what happens when someone else starts to play with them too? Someone we don't know. Can't see. Can't hear. In The Whispers, someone or something -- is manipulating the ones we love most to accomplish the unthinkable. An unseen alien force has figured this human weakness out. They have invaded earth and are using our most unlikely resource to achieve world domination – our children. Featured Crew Soo Hugh Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lily Rabe Claire Bennigan Barry Sloane Wes Lawrence Milo Ventimiglia John Doe Derek Webster Jessup Rollins Kristen Connolly Lena Lawrence Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of The Whispers premiered on June  1, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2015-04-17 The Messengers 6.1    2015-06-16 Proof 5.7    2014-06-19 Dominion 5.9    2014-07-09 Extant 6.1    2015-05-14 Wayward Pines 6.5    2013-10-06 Witches of East End 6.6    2015-06-02 Stitchers 6.3    2016-01-13 Second Chance 6.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/the-whispers Genres Mystery Sci-Fi & Fantasy Keywords alien Content Score 100 Yes! Looking good! Top Contributors 50 Elizabeth Jennings t 7 taces2 w 6 webmaster M 6 Manu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}