{"link": "https://www.themoviedb.org/tv/47318?language=en", "title": "Graceland", "resume": "Somewhere in Southern California, in a drug raid run by the US government, a beachfront property was seized and turned into a residence for undercover cops. They are all top agents of the DEA, FBI, and Customs and they are living in this house unofficially known as \"Graceland\". \"Graceland\" is a place full of secrets, and bad, good, and blurred moments too. The only idyllic thing is its outside look, but the lives of its residents are nothing like it. The lies which are in the base of their undercover work, are formed a web of lies that pervades everything. Coming of a new graduating at the top of his class, FBI rookie, Mike Warren, could make the life of a legendary FBI agent Paul Briggs and the others, more complicated or it could reveal the truth. It is based upon actual events.", "rate": 73, "genre": ["Crime", "Drama", "Action", "Adventure"], "cast": ["Daniel Sunjata", "Aaron Tveit", "Vanessa Ferlito", "Brandon Jay McLaren", "Manny Montana"], "character": ["Paul Briggs", "Mike Warren", "Catherine \"Charlie\" DeMarco", "Dale \"DJ\" Jakes", "Joe \"Johnny\" Tuturro"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47318   Expand Graceland   (2013) User Score  Play Trailer Overview Somewhere in Southern California, in a drug raid run by the US government, a beachfront property was seized and turned into a residence for undercover cops. They are all top agents of the DEA, FBI, and Customs and they are living in this house unofficially known as \"Graceland\". \"Graceland\" is a place full of secrets, and bad, good, and blurred moments too. The only idyllic thing is its outside look, but the lives of its residents are nothing like it. The lies which are in the base of their undercover work, are formed a web of lies that pervades everything. Coming of a new graduating at the top of his class, FBI rookie, Mike Warren, could make the life of a legendary FBI agent Paul Briggs and the others, more complicated or it could reveal the truth. It is based upon actual events.  Featured Crew Jeff Eastin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Daniel Sunjata Paul Briggs Aaron Tveit Mike Warren Vanessa Ferlito Catherine \"Charlie\" DeMarco Brandon Jay McLaren Dale \"DJ\" Jakes Manny Montana Joe \"Johnny\" Tuturro Full Cast & Crew Last Season Season 3 2015 | 13 Episodes Season 3 of Graceland premiered on June 25, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  9 Posters  5 Recommendations   2010-06-24 Rookie Blue 7.0    2014-08-07 Our World War 7.2    2015-01-27 Stalker 5.8    2014-08-13 Legends 6.6    2013-04-03 Rogue 7.1    2013-02-19 Cult 4.2    2013-09-16 Sleepy Hollow 6.4    2014-06-09 Murder in the First 5.0  Facts Status  Cancelled Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.usanetwork.com/series/graceland/ Genres Crime Drama Action & Adventure Keywords drug dealer california undercover agent undercover fbi criminal criminal investigation coworker relationship Content Score 100 Yes! Looking good! Top Contributors R 47 Rebecca 25 Elizabeth Jennings 18 Bohdan Shtepan 14 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}