{"link": "https://www.themoviedb.org/tv/67915?language=en", "title": "Goblin", "resume": "Kim Shin is an immortal “goblin,” and has the rather honorable title of being the Protector of Souls. His roommate Wang Yeo also happens to have the equally lofty, if thoroughly opposing, title of Angel of Death, and he acts as the storied grim reaper that claims souls. However, both these devilishly handsome angels have a problem: Wang Yeo has amnesia and Kim Shin wants to end his own (immortal) life. Unfortunately for goblins, the only way to defeat immortality is to marry a human bride. For that purpose, Kim Shin decides to win over Ji Eun Tak an optimistic high school girl who he thinks will be the priestess that ends his cursed existence. Now, once responsible for protecting souls and watching them pass, Kim Shin now tries to send his own to the afterlife. But when a slightly complicated method of suicide starts turning into true love, will our immortal goblin begin to regret his decision--where acting on that very love ultimately means the end of his life?", "rate": 72, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Gong Yoo", "Kim Go-eun", "Lee Dong-wook", "Yoo In-na", "Yook Sung-jae"], "character": ["Kim Shin", "Ji Eun-Tak", "Grim Reaper", "Sunny", "Yoo Deok-Hwa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67915   Expand Goblin   (2016) User Score  Play Trailer Overview Kim Shin is an immortal “goblin,” and has the rather honorable title of being the Protector of Souls. His roommate Wang Yeo also happens to have the equally lofty, if thoroughly opposing, title of Angel of Death, and he acts as the storied grim reaper that claims souls. However, both these devilishly handsome angels have a problem: Wang Yeo has amnesia and Kim Shin wants to end his own (immortal) life. Unfortunately for goblins, the only way to defeat immortality is to marry a human bride. For that purpose, Kim Shin decides to win over Ji Eun Tak an optimistic high school girl who he thinks will be the priestess that ends his cursed existence. Now, once responsible for protecting souls and watching them pass, Kim Shin now tries to send his own to the afterlife. But when a slightly complicated method of suicide starts turning into true love, will our immortal goblin begin to regret his decision--where acting on that very love ultimately means the end of his life? Featured Crew Lee Eung Bok Creator Kim Eun-sook Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gong Yoo Kim Shin Kim Go-eun Ji Eun-Tak Lee Dong-wook Grim Reaper Yoo In-na Sunny Yook Sung-jae Yoo Deok-Hwa Full Cast & Crew Last Season Season 1 2016 | 16 Episodes Season 1 of Goblin premiered on December  2, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  6 Recommendations   2016-01-04 Cheese in the Trap 7.0    2016-12-19 Hwarang: The Poet Warrior Youth 6.7    2015-06-08 High Society 8.3    2016-06-17 Squad 38 7.7    2006-01-11 Princess Hours 6.7    2009-08-19 My Fair Lady 7.0    2016-07-20 W: Two Worlds 7.8    2016-11-16 Weightlifting Fairy Kim Bok-Joo 8.9  Facts Original Name  쓸쓸하고 찬란하神-도깨비 Status  Ended Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/dokebi/ Genres Drama Sci-Fi & Fantasy Keywords supernatural powers romance past life immortal Content Score 100 Yes! Looking good! Top Contributors M 72 Maria180493 18 Kyuhwan Kim 17 thirstyhippo 12 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}