{"link": "https://www.themoviedb.org/tv/71737?language=en", "title": "A.P. Bio", "resume": "When Harvard philosophy scholar Jack Griffin finds himself teaching high school in Toledo, Ohio, he tosses the syllabus and recruits his students to help enact revenge on his rival.", "rate": 56, "genre": ["Comedy"], "cast": ["Glenn Howerton", "Patton Oswalt", "Tucker Albrizzi", "Mary Sohn", "Aparna Brielle"], "character": ["Jack Griffin", "Principal Durbin", "Colin McConnell", "Mary", "Sarika"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71737   Expand A.P. Bio   (2018) User Score  Play Trailer Overview When Harvard philosophy scholar Jack Griffin finds himself teaching high school in Toledo, Ohio, he tosses the syllabus and recruits his students to help enact revenge on his rival. Featured Crew Michael Patrick O'Brien Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Glenn Howerton Jack Griffin Patton Oswalt Principal Durbin Tucker Albrizzi Colin McConnell Mary Sohn Mary Aparna Brielle Sarika Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of A.P. Bio premiered on January 31, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for A.P. Bio. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  3 Posters  4 Recommendations   2016-04-10 The Other Kingdom 5.8    2014-09-30 Happyland 3.3    2014-07-17 Satisfaction 5.0    2014-10-02 Bad Judge 6.1    2016-05-26 Private Eyes 6.0    2016-03-15 Crowded 6.4    2016-03-31 Rush Hour 4.7    2014-09-17 Red Band Society 6.4  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   https://www.nbc.com/ap-bio Genres Comedy Keywords high school classroom revenge high school teacher sitcom biology teacher Content Score 100 Yes! Looking good! Top Contributors 34 Warpath 13 Elizabeth Jennings m 13 misfit_noel 11 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}