{"link": "https://www.themoviedb.org/tv/66633?language=en", "title": "Cleverman", "resume": "In the near future, creatures from ancient Aboriginal mythology endowed with extraordinary physical traits have emerged and must coexist with humans. Known as 'Hairypeople' they battle for survival in a world that wants to exploit and destroy them. One young man – The Cleverman – struggles with his own power and the responsibility to unite this divided world, but he must first overcome a deep estrangement from his older brother.", "rate": 57, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Hunter Page-Lochard", "Iain Glen", "Frances O'Connor", "Deborah Mailman", "Rob Collins"], "character": ["Koen West", "Jarrod Slade", "Charlotte Cleary", "Aunty Linda", "Waruu West"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66633   Expand Cleverman   (2016) User Score  Play Trailer Overview In the near future, creatures from ancient Aboriginal mythology endowed with extraordinary physical traits have emerged and must coexist with humans. Known as 'Hairypeople' they battle for survival in a world that wants to exploit and destroy them. One young man – The Cleverman – struggles with his own power and the responsibility to unite this divided world, but he must first overcome a deep estrangement from his older brother. Featured Crew Wayne Blair Creator Leah Purcell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Hunter Page-Lochard Koen West Iain Glen Jarrod Slade Frances O'Connor Charlotte Cleary Deborah Mailman Aunty Linda Rob Collins Waruu West Full Cast & Crew Last Season Season 2 2017 | 6 Episodes Season 2 of Cleverman premiered on June 28, 2017. View All Seasons Social Reviews  1 Discussions  1 A review by Girl lost in seriation  6.0 Written by  Girl lost in seriation  on June  3, 2018 S01: In a world where xenophobia, fear and the idea of ​​walls begin to resurface with more and more force,  Cleverman  explores the perspectives of social identity and integration in a supernatural context that reimagines traditional Australian aboriginal tales. While I think  Cleverman  is an excellent recommendation, I sincerely believe that 6 episodes were not enough to cover the complexity of the lines and characters that they deployed, which is why the series' renewal is excellent news. S02: With reality getting closer and closer to fiction,  Cleverman  immerses us in the struggl...  read the rest. Read All Reviews Media Most Popular Videos  2 Backdrops  3 Posters  3 Recommendations   2016-03-07 Damien 6.5    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1    2015-08-25 Fried 6.0    2015-05-21 Between 5.4    2015-04-17 The Messengers 6.1    2013-02-19 Cult 4.2    2015-09-02 Atelier 7.2    2015-01-07 Underworld, Inc. 7.3  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  52m Homepage   http://www.abc.net.au/tv/programs/cleverman/ Genres Drama Mystery Sci-Fi & Fantasy Keywords future dystopia xenophobia aboriginal indigenous peoples aboriginal mythology Content Score 100 Yes! Looking good! Top Contributors 70 MrRadical 43 Elizabeth Jennings 25 United600 11 Mitsarinho  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}