{"link": "https://www.themoviedb.org/tv/68997?language=en", "title": "Valkyrien", "resume": "Ravn, a respected physician, is desperately seeking a cure for his dying wife, Vilma. When the hospital stops her further treatment, Ravn continues working in secret. He is aided by the corrupt civil defence man Leif, a doomsday prepper and former patient of his. Deep underground, Ravn and Leif open an illegal clinic for treating off-the-grid patients. The clinic finances Ravn’s research into a cure for Vilma, while Leif increases his position among the criminal and the paranoid who live outside the welfare state. As Ravn has to cross more and more ethical lines, he frequently clashes with Leif, but clings to the hope of bringing his beloved Vilma back. Will love prevail? Or will Leif’s fantasy of society collapsing become a reality?", "rate": 68, "genre": ["Crime", "Drama"], "cast": ["Sven Nordin", "Pål Sverre Hagen", "Pia Halvorsen", "Mikkel Bratt Silset", "Ellen Birgitte Winther"], "character": ["Ravn", "Leif", "Vilma", "Teo", "Unn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68997   Expand Valkyrien   (2017) User Score  Play Trailer Overview Ravn, a respected physician, is desperately seeking a cure for his dying wife, Vilma. When the hospital stops her further treatment, Ravn continues working in secret. He is aided by the corrupt civil defence man Leif, a doomsday prepper and former patient of his. Deep underground, Ravn and Leif open an illegal clinic for treating off-the-grid patients. The clinic finances Ravn’s research into a cure for Vilma, while Leif increases his position among the criminal and the paranoid who live outside the welfare state. As Ravn has to cross more and more ethical lines, he frequently clashes with Leif, but clings to the hope of bringing his beloved Vilma back. Will love prevail? Or will Leif’s fantasy of society collapsing become a reality? Featured Crew Thomas Torjussen Creator Lars Gudmestad Creator Simen Svale Skogsrud Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sven Nordin Ravn Pål Sverre Hagen Leif Pia Halvorsen Vilma Mikkel Bratt Silset Teo Ellen Birgitte Winther Unn Full Cast & Crew Last Season Season 1 2017 | 8 Episodes Season 1 of Valkyrien premiered on January  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Valkyrien. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Norwegian Runtime  45m Homepage   https://tv.nrk.no/serie/valkyrien Genres Crime Drama Keywords norway Content Score 100 Yes! Looking good! Top Contributors 54 Bendik 4 zoulnix 3 Razorback121 2 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}