{"link": "https://www.themoviedb.org/tv/1921?language=en", "title": "Gilligan's Island", "resume": "Gilligan's Island is an American sitcom created and produced by Sherwood Schwartz and originally produced by United Artists Television. The situation comedy series featured Bob Denver; Alan Hale, Jr.; Jim Backus; Natalie Schafer; Tina Louise; Russell Johnson; and Dawn Wells. It aired for three seasons on the CBS network from September 26, 1964, to September 4, 1967. Originally sponsored by Philip Morris & Company and Procter & Gamble, the show followed the comic adventures of seven castaways as they attempted to survive the island on which they had been shipwrecked. Most episodes revolve around the dissimilar castaways' conflicts and their failed attempts to escape their plight.\nGilligan's Island ran for a total of 98 episodes. The first season, consisting of 36 episodes, was filmed in black-and-white. These episodes were later colorized for syndication. The show's second and third seasons and the three television movie sequels were filmed in color.\nThe show enjoyed solid ratings during its original run, then grew in popularity during decades of syndication, especially in the 1970s and 1980s when many markets ran the show in the late afternoon after school. Today, the title character of Gilligan is widely recognized as an American cultural icon.", "rate": 67, "genre": ["Comedy", "Family"], "cast": ["Bob Denver", "Alan Hale Jr.", "Russell Johnson", "Jim Backus", "Natalie Schafer"], "character": ["Gilligan", "The Skipper", "The Professor", "Thurston Howell, III", "Eunice \"Lovey\" Wentworth Howell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1921   Expand Gilligan's Island   (1964) User Score Overview Gilligan's Island is an American sitcom created and produced by Sherwood Schwartz and originally produced by United Artists Television. The situation comedy series featured Bob Denver; Alan Hale, Jr.; Jim Backus; Natalie Schafer; Tina Louise; Russell Johnson; and Dawn Wells. It aired for three seasons on the CBS network from September 26, 1964, to September 4, 1967. Originally sponsored by Philip Morris & Company and Procter & Gamble, the show followed the comic adventures of seven castaways as they attempted to survive the island on which they had been shipwrecked. Most episodes revolve around the dissimilar castaways' conflicts and their failed attempts to escape their plight. Gilligan's Island ran for a total of 98 episodes. The first season, consisting of 36 episodes, was filmed in black-and-white. These episodes were later colorized for syndication. The show's second and third seasons and the three television movie sequels were filmed in color. The show enjoyed solid ratings during its original run, then grew in popularity during decades of syndication, especially in the 1970s and 1980s when many markets ran the show in the late afternoon after school. Today, the title character of Gilligan is widely recognized as an American cultural icon. Featured Crew Sherwood Schwartz Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  13 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bob Denver Gilligan Alan Hale Jr. The Skipper Russell Johnson The Professor Jim Backus Thurston Howell, III Natalie Schafer Eunice \"Lovey\" Wentworth Howell Full Cast & Crew Last Season Season 3 1966 | 30 Episodes View All Seasons Social Reviews  0 Discussions  13 Subject Status Replies Last Reply Same ending as Lost? Open 0 by shallowhal\n      \n     Giligan and j.f.k Open 1 by  Dark_Sithlord S Ginger or Marianne Open 3 by  Strannger18 Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1969-09-26 The Brady Bunch 6.5    1965-09-18 I Dream of Jeannie 7.1    1962-09-26 The Beverly Hillbillies 6.6    1960-10-03 The Andy Griffith Show 7.4    1964-09-24 The Munsters 7.1    1964-09-17 Bewitched 7.1    1951-06-15 I Love Lucy 7.6    1957-10-04 Leave It to Beaver 7.1  Facts Status  Ended Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m, 25m Homepage  - Genres Comedy Family Keywords island shipwreck survivor uncharted Content Score 93 Almost there... Top Contributors 13 Banana 8 dgw 2 lineker 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}