{"link": "https://www.themoviedb.org/tv/67993?language=en", "title": "Chicago Justice", "resume": "The State's Attorney's dedicated team of prosecutors and investigators navigates heated city politics and controversy head-on, while fearlessly pursuing justice.", "rate": 49, "genre": ["Crime", "Drama"], "cast": ["Philip Winchester", "Jon Seda", "Joelle Carter", "Monica Barbaro", "Carl Weathers"], "character": ["Peter Stone", "Antonio Dawson", "Laura Nagel", "Anna Valdez", "Mark Jefferies"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67993   Expand Chicago Justice   (2017) User Score  Play Trailer Overview The State's Attorney's dedicated team of prosecutors and investigators navigates heated city politics and controversy head-on, while fearlessly pursuing justice. Featured Crew Dick Wolf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  2 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Philip Winchester Peter Stone Jon Seda Antonio Dawson Joelle Carter Laura Nagel Monica Barbaro Anna Valdez Carl Weathers Mark Jefferies Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Chicago Justice premiered on March  1, 2017. View All Seasons Social Reviews  0 Discussions  7 Subject Status Replies Last Reply The verdict is in... Open 0 by Heidi\n      \n     b Decent Open 6 by  bgirlmagic b Antonio Open 1 by  Xcalat3 Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2017-09-26 Law & Order True Crime 6.1    2015-11-17 Chicago Med 6.7    2017-08-08 Trust Me 6.5    2017-02-27 When We Rise 6.7    2016-01-07 Shades of Blue 6.2    2014-01-08 Chicago P.D. 6.9    2012-08-13 Major Crimes 6.7    2013-04-03 Rogue 7.1  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.nbc.com/chicago-justice Genres Crime Drama Keywords chicago spin off legal drama Content Score 100 Yes! Looking good! Top Contributors p 29 paf69 22 Banana 11 Imzadi c 9 castacasta  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}