{"link": "https://www.themoviedb.org/tv/60730?language=en", "title": "Haganai: I Don't Have Many Friends", "resume": "Kodaka Hasegawa has just transferred to St. Chronica's Academy and he's having a hard time making friends. With his naturally blond hair and fierce looking eyes, people constantly mistake him for a delinquent. One day, he runs into his bad-tempered loner of a classmate, Yozora, while she's talking to her imaginary friend, Tomo. Since neither of them have any friends, they decide to form a club and start recruiting some. Little by little, lonely classmates join their club to learn how to build friendships through cooking together, playing games, and other group activities. But, with so many misfits, will the club members really be able to get along?", "rate": 75, "genre": ["Comedy", "Animation"], "cast": ["Mariya Ise", "Youko Hikasa", "Emiri Kato", "Ryohei Kimura", "Marina Inoue"], "character": ["Aoi Yusa", "Hinata Hidaka", "Keit Takayama", "Kodaka Hasegawa (voice)", "Yozora Mikazuki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60730   Expand Haganai: I Don't Have Many Friends   (2011) User Score  Play Trailer Overview Kodaka Hasegawa has just transferred to St. Chronica's Academy and he's having a hard time making friends. With his naturally blond hair and fierce looking eyes, people constantly mistake him for a delinquent. One day, he runs into his bad-tempered loner of a classmate, Yozora, while she's talking to her imaginary friend, Tomo. Since neither of them have any friends, they decide to form a club and start recruiting some. Little by little, lonely classmates join their club to learn how to build friendships through cooking together, playing games, and other group activities. But, with so many misfits, will the club members really be able to get along? Featured Crew Yomi Hirasaka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  3 Videos Trailers  1 Teasers  0 Clips  1 Featurettes  0 Opening Credits  0 Top Billed Cast Mariya Ise Aoi Yusa Youko Hikasa Hinata Hidaka Emiri Kato Keit Takayama Ryohei Kimura Kodaka Hasegawa (voice) Marina Inoue Yozora Mikazuki (voice) Full Cast & Crew Last Season NEXT 2013 | 12 Episodes Season 2 of Haganai: I Don't Have Many Friends premiered on January 11, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Haganai: I Don't Have Many Friends. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  6 Posters  3 Recommendations   2011-10-08 Ben-To 7.2    2012-10-04 Love, Chunibyo & Other Delusions 7.6    2010-01-07 Baka and Test: Summon the Beasts 6.4    2008-10-04 A Certain Magical Index 7.4    2012-01-10 Another 7.2    2010-04-02 Yamada's First Time: B Gata H Kei 7.5    2011-04-14 Aria the Scarlet Ammo 6.4    2004-07-10 DearS 5.0  Facts Original Name  僕は友達が少ない Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.funimation.com/shows/haganai/home Genres Comedy Animation Keywords harem romance school club anime fan service school club Content Score 100 Yes! Looking good! Top Contributors 61 WillofOwn t 42 tmdb983464 A 26 Anlothen 18 Levi Seguel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}