{"link": "https://www.themoviedb.org/tv/12584?language=en", "title": "Tin Man", "resume": "Tin Man is a 2007 four and a half hour miniseries co-produced by RHI Entertainment and Sci Fi Channel original pictures that was broadcast in the United States on the Sci Fi Channel in three parts. The first part aired on December 2, and the remaining two parts airing on the following nights. It was released to DVD on March 11, 2008; the same year it was rebroadcast in the United Kingdom, Australia, and New Zealand. Starring Zooey Deschanel, Neal McDonough, Alan Cumming, Raoul Trujillo, Kathleen Robertson, and Richard Dreyfuss, the miniseries is a continuation of the classic story The Wonderful Wizard of Oz, with science fiction and additional fantasy elements added. It focuses on the adventures of a small-town waitress named DG who is pulled into a magical realm called the O.Z., ruled by the tyrannical sorceress Azkadellia. Together with her companions Glitch, Raw, and Cain, DG journeys to uncover her lost memories, find her true parents, and foil Azkadellia's plot to trap the O.Z. in eternal darkness.\nCosting $20 million to produce, the first part of miniseries was the highest-rated program in its timeslot, with 6.4 million viewers; the miniseries itself would be the highest-rated miniseries of 2007. It was nominated for nine Emmy awards, winning one, and was also nominated for a Critics' Choice Award. Critics gave it mixed reviews, with some praising the acting, soundtrack, and visual effects, while others found it overly grim and bleak.", "rate": 66, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Raoul Max Trujillo", "Neal McDonough", "Richard Dreyfuss", "Zooey Deschanel", "Alan Cumming"], "character": ["Raw", "Wyatt Cain", "Mystic Man", "DG", "Glitch"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12584   Expand Tin Man   (2007) User Score  Play Trailer Overview Tin Man is a 2007 four and a half hour miniseries co-produced by RHI Entertainment and Sci Fi Channel original pictures that was broadcast in the United States on the Sci Fi Channel in three parts. The first part aired on December 2, and the remaining two parts airing on the following nights. It was released to DVD on March 11, 2008; the same year it was rebroadcast in the United Kingdom, Australia, and New Zealand. Starring Zooey Deschanel, Neal McDonough, Alan Cumming, Raoul Trujillo, Kathleen Robertson, and Richard Dreyfuss, the miniseries is a continuation of the classic story The Wonderful Wizard of Oz, with science fiction and additional fantasy elements added. It focuses on the adventures of a small-town waitress named DG who is pulled into a magical realm called the O.Z., ruled by the tyrannical sorceress Azkadellia. Together with her companions Glitch, Raw, and Cain, DG journeys to uncover her lost memories, find her true parents, and foil Azkadellia's plot to trap the O.Z. in eternal darkness. Costing $20 million to produce, the first part of miniseries was the highest-rated program in its timeslot, with 6.4 million viewers; the miniseries itself would be the highest-rated miniseries of 2007. It was nominated for nine Emmy awards, winning one, and was also nominated for a Critics' Choice Award. Critics gave it mixed reviews, with some praising the acting, soundtrack, and visual effects, while others found it overly grim and bleak. Featured Crew Craig W. Van Sickle Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  15 Posters  11 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Raoul Max Trujillo Raw Neal McDonough Wyatt Cain Richard Dreyfuss Mystic Man Zooey Deschanel DG Alan Cumming Glitch Full Cast & Crew Last Season Season 1 2007 | 3 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  15 Posters  11 Recommendations   2004-07-19 The Grid 7.0    2005-04-13 Revelations 6.0    2015-04-15 The Delivery Man 6.5    2008-11-13 Apparitions 7.9    1998-09-12 Young Hercules 6.5    2010-07-12 The Silence 6.8    2013-09-05 The Guilty 7.0    2004-10-24 ReGenesis 7.0  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.scifi.com/tinman/ Genres Action & Adventure Sci-Fi & Fantasy Keywords mystic miniseries fantasy world wizard of oz Content Score 100 Yes! Looking good! Top Contributors E 34 Elky TB 28 TMDb Bot 11 Banana 8 daplon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}