{"link": "https://www.themoviedb.org/tv/46129?language=en", "title": "Löwenzahn", "resume": "Löwenzahn is a children's television series produced and aired by German public broadcaster ZDF on German television. Originally conceived and hosted by Peter Lustig the first episode aired on January 7, 1979 then titled Pusteblume. The first episode of the retitled series Löwenzahn aired on March 24, 1981. After Lustig's health-related retirement, the show was taken over by actor Guido Hammesfahr in October 2006.\nEach 30 minute episode is dedicated to a separate issue or theme and consists mainly of related short featurettes, which explain, explore and educate how things of everyday life and even complex systems work. It spans a wide variety of topics from technology and industry to something as mundane as how the postal service works.", "rate": 100, "genre": ["Family"], "cast": ["Peter Lustig", "Helmut Krauss", "Guido Hammesfahr", "Sanam Afrashteh", "Eva Mannschott"], "character": ["sich selbst", "Nachbar Paschulke", "Fritz Fuchs", "Yasemin Saidi", "Suse Fuchs-Liebig"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46129   Expand Löwenzahn   (1981) User Score Overview Löwenzahn is a children's television series produced and aired by German public broadcaster ZDF on German television. Originally conceived and hosted by Peter Lustig the first episode aired on January 7, 1979 then titled Pusteblume. The first episode of the retitled series Löwenzahn aired on March 24, 1981. After Lustig's health-related retirement, the show was taken over by actor Guido Hammesfahr in October 2006. Each 30 minute episode is dedicated to a separate issue or theme and consists mainly of related short featurettes, which explain, explore and educate how things of everyday life and even complex systems work. It spans a wide variety of topics from technology and industry to something as mundane as how the postal service works. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Lustig sich selbst Helmut Krauss Nachbar Paschulke Guido Hammesfahr Fritz Fuchs Sanam Afrashteh Yasemin Saidi Eva Mannschott Suse Fuchs-Liebig Full Cast & Crew Current Season Season 37 2017 | 14 Episodes Season 37 of Löwenzahn premiered on October 15, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for Löwenzahn. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Löwenzahn. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  German Runtime  30m Homepage   https://www.zdf.de/kinder/loewenzahn Genres Family Keywords children education Content Score 86 Almost there... Top Contributors S 92 Samara p 53 pfeifenheini f 39 fita24 7 janar  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}