{"link": "https://www.themoviedb.org/tv/72061?language=en", "title": "The Loch", "resume": "The search for a serial killer becomes a matter of life and death for detective Annie Redford, who is trying to cope with her first murder case.", "rate": 63, "genre": ["Crime", "Drama"], "cast": ["Laura Fraser", "Siobhan Finneran", "Don Gilet", "John Sessions", "William Ash"], "character": ["DS Annie Redford", "DCI Lauren Quigley", "Dr. Blake Albrighton", "CI Frank Smilie", "Leighton Thomas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72061   Expand The Loch   (2017) User Score  Play Trailer Overview The search for a serial killer becomes a matter of life and death for detective Annie Redford, who is trying to cope with her first murder case. Featured Crew Brian Kelly Creator Cilla Ware Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Laura Fraser DS Annie Redford Siobhan Finneran DCI Lauren Quigley Don Gilet Dr. Blake Albrighton John Sessions CI Frank Smilie William Ash Leighton Thomas Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of The Loch premiered on June 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  4 Recommendations   2017-06-12 Fearless 6.2    2017-10-21 Gunpowder 6.8    2016-10-16 Graves 5.4    2017-04-16 The White Princess 8.0    2017-09-07 Tin Star 7.3    2017-10-11 Dynasty 6.8    2017-12-06 Knightfall 6.2    2012-06-26 Line of Duty 8.0  Facts Status  In Production Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  45m Homepage   https://www.itv.com/hub/the-loch/ Genres Crime Drama Keywords scotland murder investigation Content Score 100 Yes! Looking good! Top Contributors TB 40 TMDb Bot 31 Bendik 15 Elizabeth Jennings S 5 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}