{"link": "https://www.themoviedb.org/tv/31783?language=en", "title": "Worst Cooks in America", "resume": "Worst Cooks in America is a reality competition show on the Food Network. The show takes 12 to 16 contestants with poor cooking skills through an eight-week culinary boot camp, to earn a cash prize of $25,000. The recruits are trained on the various basic cooking techniques including: baking, knife skills, temperature, seasoning and preparation. The final challenge is to cook a restaurant quality three-course meal for three food critics.", "rate": 55, "genre": ["Reality"], "cast": ["Anne Burrell"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31783   Expand Worst Cooks in America   (2010) User Score Overview Worst Cooks in America is a reality competition show on the Food Network. The show takes 12 to 16 contestants with poor cooking skills through an eight-week culinary boot camp, to earn a cash prize of $25,000. The recruits are trained on the various basic cooking techniques including: baking, knife skills, temperature, seasoning and preparation. The final challenge is to cook a restaurant quality three-course meal for three food critics. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anne Burrell Host Full Cast & Crew Current Season Season 13 2018 | 6 Episodes Season 13 of Worst Cooks in America premiered on April 15, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Worst Cooks in America. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 15 Meaning This rating is for programs that contain material that may be inappropriate for children under 15, and that parental discretion should be used. Examples include most dramas, and talk shows on OTA (over-the-air) TV (KBS, MBC, SBS), and many American TV shows/dramas on Cable TV channels like OCN and OnStyle. The programs that have this rating may include moderate or strong adult themes, language, sexual inference, and violence. As with the TV-MA rating in North America, this rating is commonly applied to live events where the occurrence of inappropriate dialogue is unpredictable. Since 2007, this rating is the most used rating for TV. Type  Reality Original Language  English Runtime  60m, 42m Homepage   http://www.foodnetwork.com/worst-cooks-in-america Genres Reality Keywords cooking reality competition unskilled Content Score 56 We're so close, yet so far. Top Contributors b 20 basher 19 Banana 15 Elizabeth Jennings Y 7 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}