{"link": "https://www.themoviedb.org/tv/14766?language=en", "title": "Super Why!", "resume": "Super Why! or The Reading Adventures of Super Why! is a CGI animated show developed by Angela C. Santomero and Samantha Freeman Alpert. The TV series is produced by New York City-based Out of the Blue Enterprises and Toronto-based DHX Media through its Decode Entertainment division. The show debuted on PBS stations on September 3, 2007. The series airs on PBS Kids and PBS Kids Sprout in the USA, Kids' CBC in Canada. Thai PBS from Thailand broadcasts the shortened version, the episodes are 5 years behind the U.S.", "rate": 57, "genre": ["Animation", "Family", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14766   Expand Super Why!   (2007) User Score Overview Super Why! or The Reading Adventures of Super Why! is a CGI animated show developed by Angela C. Santomero and Samantha Freeman Alpert. The TV series is produced by New York City-based Out of the Blue Enterprises and Toronto-based DHX Media through its Decode Entertainment division. The show debuted on PBS stations on September 3, 2007. The series airs on PBS Kids and PBS Kids Sprout in the USA, Kids' CBC in Canada. Thai PBS from Thailand broadcasts the shortened version, the episodes are 5 years behind the U.S. Featured Crew Angela Santomero Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 2015 | 23 Episodes Season 6 of Super Why! premiered on August 17, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2008-09-01 Sid the Science Kid 6.1    2009-06-25 Stoked 6.3    2009-04-04 Special Agent Oso 4.3    2013-02-18 Sarah & Duck 6.0    2010-10-15 The Adventures of Chuck and Friends 6.0    2008-09-22 Chuggington 6.0    2010-10-04 The Octonauts 6.3    2012-02-18 Transformers: Rescue Bots 6.8  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m, 25m Homepage   http://www.pbskids.org/superwhy Genres Animation Family Kids Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors d 6 dwkodi15 b 5 bkbroiler72 A 4 AnthonyAtkins232 i 3 ianan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}