{"link": "https://www.themoviedb.org/tv/4464?language=en", "title": "Homicide: Life on the Street", "resume": "Homicide: Life on the Street is an American police procedural television series chronicling the work of a fictional version of the Baltimore Police Department's Homicide Unit. It ran for seven seasons on NBC from 1993 to 1999, and was succeeded by a TV movie, which also acted as the de facto series finale. The series was originally based on David Simon's book Homicide: A Year on the Killing Streets. Many of the characters and stories used throughout the show were based on events depicted in the book, which was also part of the basis for Simon's own series, The Wire on HBO.\nAlthough Homicide featured an ensemble cast, Andre Braugher emerged as the series' breakout star through his portrayal of Frank Pembleton. The show won Television Critics Association Awards for Outstanding Achievement in Drama in 1996, 1997, and 1998. It also became the first drama ever to win three Peabody Awards for best drama in 1993, 1995, and 1997. In 1997, the episode \"Prison Riot\" was ranked No. 32 on TV Guide's 100 Greatest Episodes of All Time. In 2007, it was listed as one of Time magazine's \"Best TV Shows of All-TIME.\" In 1996 TV Guide named the series 'The Best Show You're Not Watching'. The show placed #46 on Entertainment Weekly's \"New TV Classics\" list.", "rate": 77, "genre": ["Mystery", "Drama", "Crime"], "cast": ["Richard Belzer", "Giancarlo Esposito", "Peter Gerety", "Clark Johnson", "Yaphet Kotto"], "character": ["John Munch", "Michael Giardello", "Stuart Gharty", "Meldrick Lewis", "Al Giardello"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4464   Expand Homicide: Life on the Street   (1993) User Score Overview Homicide: Life on the Street is an American police procedural television series chronicling the work of a fictional version of the Baltimore Police Department's Homicide Unit. It ran for seven seasons on NBC from 1993 to 1999, and was succeeded by a TV movie, which also acted as the de facto series finale. The series was originally based on David Simon's book Homicide: A Year on the Killing Streets. Many of the characters and stories used throughout the show were based on events depicted in the book, which was also part of the basis for Simon's own series, The Wire on HBO. Although Homicide featured an ensemble cast, Andre Braugher emerged as the series' breakout star through his portrayal of Frank Pembleton. The show won Television Critics Association Awards for Outstanding Achievement in Drama in 1996, 1997, and 1998. It also became the first drama ever to win three Peabody Awards for best drama in 1993, 1995, and 1997. In 1997, the episode \"Prison Riot\" was ranked No. 32 on TV Guide's 100 Greatest Episodes of All Time. In 2007, it was listed as one of Time magazine's \"Best TV Shows of All-TIME.\" In 1996 TV Guide named the series 'The Best Show You're Not Watching'. The show placed #46 on Entertainment Weekly's \"New TV Classics\" list. Featured Crew Paul Attanasio Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Belzer John Munch Giancarlo Esposito Michael Giardello Peter Gerety Stuart Gharty Clark Johnson Meldrick Lewis Yaphet Kotto Al Giardello Full Cast & Crew Last Season Season 7 1998 | 22 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations   1993-09-21 NYPD Blue 6.5    2001-09-30 Law & Order: Criminal Intent 7.1    2010-04-11 Treme 8.1    1987-04-06 Biography 7.5    1981-01-15 Hill Street Blues 7.4    1998-08-19 Upright Citizens Brigade 8.0    The Children's Hour 8.3    1999-04-11 The Awful Truth 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage  - Genres Mystery Drama Crime Keywords based on novel or book police baltimore murder police detective baltimore maryland homicide detective police department police protagonist Content Score 93 Almost there... Top Contributors 66 United600 w 33 wheelpoint 17 Banana 10 spaceship broken  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}