{"link": "https://www.themoviedb.org/tv/60796?language=en", "title": "Stalker", "resume": "A pair of detectives investigate stalkers in Los Angeles.\nStrong and focused, Lt. Beth Davis is an expert in the field of repeated harassment, driven by personal experience of being a victim. She heads the LAPD's Threat Assessment Unit, which investigates cases of stalking -- including voyeurism, cyberharassment and romantic fixation. The history of recent transfer Jack Larsen -- whose personality and questionable behavior have been an issue in the past -- may help him in his assignment to her team. Her other detectives are young but eager Ben Caldwell and deceptively intelligent Janice Lawrence. Together they try to stop situations from spinning out of control -- and to keep their personal obsessions at bay.", "rate": 61, "genre": ["Crime", "Drama"], "cast": ["Maggie Q", "Dylan McDermott", "Victor Rasuk", "Elisabeth Röhm", "Mariana Klaveno"], "character": ["Beth Davis", "Jack Larsen", "Detective Ben Caldwell", "Amanda Taylor", "Janice Lawrence"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60796   Expand Stalker   (2015) User Score Overview A pair of detectives investigate stalkers in Los Angeles. Strong and focused, Lt. Beth Davis is an expert in the field of repeated harassment, driven by personal experience of being a victim. She heads the LAPD's Threat Assessment Unit, which investigates cases of stalking -- including voyeurism, cyberharassment and romantic fixation. The history of recent transfer Jack Larsen -- whose personality and questionable behavior have been an issue in the past -- may help him in his assignment to her team. Her other detectives are young but eager Ben Caldwell and deceptively intelligent Janice Lawrence. Together they try to stop situations from spinning out of control -- and to keep their personal obsessions at bay. Featured Crew Kevin Williamson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Maggie Q Beth Davis Dylan McDermott Jack Larsen Victor Rasuk Detective Ben Caldwell Elisabeth Röhm Amanda Taylor Mariana Klaveno Janice Lawrence Full Cast & Crew Last Season Season 1 2015 | 20 Episodes Season 1 of Stalker premiered on January 27, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2014-09-17 The Mysteries of Laura 6.3    2017-03-30 Hindsight 6.5    2014-08-23 Intruders 6.5    2013-02-03 Motive 5.9    2014-03-16 Crisis 5.9    2015-06-16 Proof 5.7    2014-03-10 Believe 6.3    2012-07-09 Perception 6.7  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.cbs.com/shows/stalker/ Genres Crime Drama Keywords police stalking los angeles lapd crime investigation Content Score 93 Almost there... Top Contributors 30 Elizabeth Jennings 20 benf45 TB 10 TMDb Bot 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}