{"link": "https://www.themoviedb.org/tv/64163?language=en", "title": "The Testament of Sister New Devil", "resume": "Basara Toujou met his two cute little sisters, Mio Naruse and Maria Naruse. The two sisters revealed themselves as a member of the demon clan and Basara as a member of hero clan, demon clan's enemy, and is not related by family. Mio is the future Demon Lord and since Mio's power is not fully awakened, Basara will protect her from the demons who are after the power she inherited from her deceased father, Demon Lord Wilbert.", "rate": 70, "genre": ["Animation", "Family", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64163   Expand The Testament of Sister New Devil   (2015) User Score  Play Trailer Overview Basara Toujou met his two cute little sisters, Mio Naruse and Maria Naruse. The two sisters revealed themselves as a member of the demon clan and Basara as a member of hero clan, demon clan's enemy, and is not related by family. Mio is the future Demon Lord and since Mio's power is not fully awakened, Basara will protect her from the demons who are after the power she inherited from her deceased father, Demon Lord Wilbert. Featured Crew Hisashi Saito Creator Takao Yoshioka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2015 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   2014-10-08 Trinity Seven 8.0    2012-04-05 Sankarea: Undying Love 7.0    2012-07-06 Aesthetica of a Rogue Hero 7.1    2012-10-09 Sakurasou no Pet na Kanojo 6.5    2013-10-02 Beyond the Boundary 7.0    2013-03-31 Date a Live 7.9    2015-07-05 Charlotte 6.8    2013-04-05 My Teen Romantic Comedy SNAFU 7.4  Facts Original Name  新妹魔王の契約者 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://anime-shinmaimaou.com/ Genres Animation Family Sci-Fi & Fantasy Keywords harem demon ecchi Content Score 71 Just a little bit more... Top Contributors p 55 pedafok 12 Banana c 8 coffinbearer 7 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}