{"link": "https://www.themoviedb.org/tv/321?language=en", "title": "Voyage to the Bottom of the Sea", "resume": "Voyage to the Bottom of the Sea is a 1960s American science fiction television series based on the 1961 film of the same name. Both were created by Irwin Allen, which enabled the movie's sets, costumes, props, special effects models, and sometimes footage, to be used in the production of the television series. Voyage to the Bottom of the Sea was the first of Irwin Allen's four science fiction television series as well as the longest running. The show's main theme was underwater adventure.\nVoyage was broadcast on ABC from September 14, 1964 to March 31, 1968, and was the decade's longest-running American science fiction television series with continuing characters. The 110 episodes produced included 32 shot in black and white, and 78 filmed in color. The first two seasons took place in the then future of the 1970s. The final two seasons took place in the 1980s. The show starred Richard Basehart and David Hedison.", "rate": 74, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Richard Basehart", "David Hedison", "Robert Duvall", "Terry Becker", "Del Monroe"], "character": ["Adm. Harriman Nelson", "Captain Crane", "Zar", "Chief Francis Ethelbert Sharkey", "Kowalski"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 321   Expand Voyage to the Bottom of the Sea   (1964) User Score  Play Trailer Overview Voyage to the Bottom of the Sea is a 1960s American science fiction television series based on the 1961 film of the same name. Both were created by Irwin Allen, which enabled the movie's sets, costumes, props, special effects models, and sometimes footage, to be used in the production of the television series. Voyage to the Bottom of the Sea was the first of Irwin Allen's four science fiction television series as well as the longest running. The show's main theme was underwater adventure. Voyage was broadcast on ABC from September 14, 1964 to March 31, 1968, and was the decade's longest-running American science fiction television series with continuing characters. The 110 episodes produced included 32 shot in black and white, and 78 filmed in color. The first two seasons took place in the then future of the 1970s. The final two seasons took place in the 1980s. The show starred Richard Basehart and David Hedison. Featured Crew Irwin Allen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Basehart Adm. Harriman Nelson David Hedison Captain Crane Robert Duvall Zar Terry Becker Chief Francis Ethelbert Sharkey Del Monroe Kowalski Full Cast & Crew Last Season Season 4 1967 | 26 Episodes Season 4 of Voyage to the Bottom of the Sea premiered on September 17, 1967. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply cross  over Open 0 by manfromatlantis\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   1979-09-20 Buck Rogers in the 25th Century 6.9    1970-09-16 McCloud 7.0    1961-01-05 Mister Ed 7.4    1962-10-02 Combat! 7.1    1973-10-24 Kojak 7.4    1967-09-07 The Flying Nun 5.0    1964-09-22 The Man from U.N.C.L.E. 7.2    1963-09-29 My Favorite Martian 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords submarine underwater Content Score 100 Yes! Looking good! Top Contributors WS 7 Walter Szczerski 7 Elizabeth Jennings PE 5 Patrick E. Abe 4 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}