{"link": "https://www.themoviedb.org/tv/72615?language=en", "title": "Alias Grace", "resume": "Based on the true story of Grace Marks, a housemaid and immigrant from Ireland who was imprisoned in 1843, perhaps wrongly, for the murder of her employer Thomas Kinnear. Grace claims to have no memory of the murder yet the facts are irrefutable. A decade after, Dr. Simon Jordan tries to help Grace recall her past.", "rate": 75, "genre": ["Crime", "Drama"], "cast": ["Sarah Gadon", "Edward Holcroft", "Rebecca Liddiard", "Zachary Levi", "Kerr Logan"], "character": ["Grace Marks", "Dr. Simon Jordan", "Mary Whitney", "Jeremiah/Jerome Dupont", "James McDermott"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72615   Expand Alias Grace   (2017) User Score  Play Trailer Overview Based on the true story of Grace Marks, a housemaid and immigrant from Ireland who was imprisoned in 1843, perhaps wrongly, for the murder of her employer Thomas Kinnear. Grace claims to have no memory of the murder yet the facts are irrefutable. A decade after, Dr. Simon Jordan tries to help Grace recall her past. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  2 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Gadon Grace Marks Edward Holcroft Dr. Simon Jordan Rebecca Liddiard Mary Whitney Zachary Levi Jeremiah/Jerome Dupont Kerr Logan James McDermott Full Cast & Crew Last Season Season 1 2017 | 6 Episodes Season 1 of Alias Grace premiered on September 25, 2017. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply b Interesting Open 8 by  Strange Bedfellows FASINATING Open 0 by Anna\n      \n     Not just a pretty face.. Open 0 by Renovatio\n      \n     Go to Discussions Media Most Popular Videos  3 Backdrops  3 Posters  5 Recommendations   2017-05-05 Spirit: Riding Free 6.3    2017-01-06 One Day at a Time 6.6    2014-12-02 Girlfriends' Guide to Divorce 5.1    2008-10-12 Stephen Fry in America 8.0    2015-10-06 Chewing Gum 7.0    2014-01-07 Being Mary Jane 7.7    2011-08-05 Friends with Benefits 6.1    2016-03-14 Nightmare Teacher 7.5  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  45m Homepage   http://www.cbc.ca/aliasgrace/ Genres Crime Drama Keywords canada based on novel or book miniseries historical fiction 19th century Content Score 93 Almost there... Top Contributors 38 NathanChampion R 35 Rebecca 22 Elizabeth Jennings a 6 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}