{"link": "https://www.themoviedb.org/tv/2179?language=en", "title": "Quincy, M.E.", "resume": "Quincy, M.E. is an American television series from Universal Studios that aired from October 3, 1976, to September 5, 1983, on NBC. It stars Jack Klugman in the title role, a Los Angeles County medical examiner.\nInspired by the book Where Death Delights by Marshall Houts, a former FBI agent, the show also resembled the earlier Canadian television series Wojeck, broadcast by CBC Television. John Vernon, who played the Wojeck title role, later guest starred in the third-season episode \"Requiem For The Living\". Quincy's character is loosely modelled on Los Angeles' \"Coroner to the Stars\" Thomas Noguchi.\nThe first half of the first season of Quincy was broadcast as 90-minute telefilms as part of the NBC Sunday Mystery Movie rotation in the fall of 1976 alongside Columbo, McCloud, and McMillan. The series proved popular enough that midway through the 1976–1977 season, Quincy was spun off into its own weekly one-hour series. The Mystery Movie format was discontinued in the spring of 1977.\nIn 1978, writers Tony Lawrence and Lou Shaw received an Edgar Award from the Mystery Writers of America for the second-season episode \"...The Thighbone's Connected to the Knee Bone...\". Many of the episodes used the same actors for different roles in various episodes. For example, an actor who plays a crooked Navy captain also plays a ballistics expert in several of the later episodes. Using a small \"pool\" of actors was a common production trait of many Glen A. Larson TV programs. Before becoming a regular cast member as Quincy's girlfriend-wife Dr. Emily Hanover in the 1982-1983 season, Anita Gillette had portrayed Quincy's deceased first wife Helen Quincy in a flashback in a 1979 episode \"Promises to Keep\".", "rate": 75, "genre": ["Drama", "Crime"], "cast": ["Jack Klugman", "Robert Ito", "Val Bisoglio", "John S. Ragin", "Garry Walberg"], "character": ["Dr. R. Quincy, M.E.", "Sam Fujiyama", "Danny Tovo", "Dr. Robert Asten", "Lt. Frank Monahan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2179   Expand Quincy, M.E.   (1976) User Score  Play Trailer Overview Quincy, M.E. is an American television series from Universal Studios that aired from October 3, 1976, to September 5, 1983, on NBC. It stars Jack Klugman in the title role, a Los Angeles County medical examiner. Inspired by the book Where Death Delights by Marshall Houts, a former FBI agent, the show also resembled the earlier Canadian television series Wojeck, broadcast by CBC Television. John Vernon, who played the Wojeck title role, later guest starred in the third-season episode \"Requiem For The Living\". Quincy's character is loosely modelled on Los Angeles' \"Coroner to the Stars\" Thomas Noguchi. The first half of the first season of Quincy was broadcast as 90-minute telefilms as part of the NBC Sunday Mystery Movie rotation in the fall of 1976 alongside Columbo, McCloud, and McMillan. The series proved popular enough that midway through the 1976–1977 season, Quincy was spun off into its own weekly one-hour series. The Mystery Movie format was discontinued in the spring of 1977. In 1978, writers Tony Lawrence and Lou Shaw received an Edgar Award from the Mystery Writers of America for the second-season episode \"...The Thighbone's Connected to the Knee Bone...\". Many of the episodes used the same actors for different roles in various episodes. For example, an actor who plays a crooked Navy captain also plays a ballistics expert in several of the later episodes. Using a small \"pool\" of actors was a common production trait of many Glen A. Larson TV programs. Before becoming a regular cast member as Quincy's girlfriend-wife Dr. Emily Hanover in the 1982-1983 season, Anita Gillette had portrayed Quincy's deceased first wife Helen Quincy in a flashback in a 1979 episode \"Promises to Keep\". Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Jack Klugman Dr. R. Quincy, M.E. Robert Ito Sam Fujiyama Val Bisoglio Danny Tovo John S. Ragin Dr. Robert Asten Garry Walberg Lt. Frank Monahan Full Cast & Crew Last Season Season 8 1982 | 24 Episodes Season 8 of Quincy, M.E. premiered on September 29, 1982. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply anti  punk epsiode Open 1 by  Jayhn1111 Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations   1973-10-24 Kojak 7.4    1970-09-24 The Odd Couple 7.1    1974-03-27 The Rockford Files 7.2    1970-09-16 McCloud 7.0    1981-11-24 Simon & Simon 6.6    1967-03-28 Ironside 6.8    1964-09-22 The Man from U.N.C.L.E. 7.2    1963-09-29 My Favorite Martian 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Crime Keywords los angeles doctor coroner murder investigation medical examination Content Score 100 Yes! Looking good! Top Contributors 54 Steve 11 Banana CN 9 Carmelo Nicolosi m 8 mode2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}