{"link": "https://www.themoviedb.org/tv/72752?language=en", "title": "Ghost Wars", "resume": "Set in a remote Alaskan town that has been overrun by paranormal forces, the series focuses on local outcast Roman Mercer who must overcome the town’s prejudices and his own personal demons if he’s to harness his repressed psychic powers and save everyone from the mass haunting that’s threatening to destroy them all.", "rate": 60, "genre": ["Mystery", "Sci-Fi", "Fantasy"], "cast": ["Vincent D'Onofrio", "Kim Coates", "Philip Granger", "Kristin Lehman", "Avan Jogia"], "character": ["Winston", "Roman Mercer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72752   Expand Ghost Wars   (2017) User Score  Play Trailer Overview Set in a remote Alaskan town that has been overrun by paranormal forces, the series focuses on local outcast Roman Mercer who must overcome the town’s prejudices and his own personal demons if he’s to harness his repressed psychic powers and save everyone from the mass haunting that’s threatening to destroy them all. Featured Crew Simon Barry Creator Mathias Herndl Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Vincent D'Onofrio Kim Coates Philip Granger Winston Kristin Lehman Avan Jogia Roman Mercer Full Cast & Crew Current Season Season 1 2017 | 13 Episodes Season 1 of Ghost Wars premiered on October  5, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply What a crappy rip-off of *Midnight Texas* Open 7 by  ScorpionQ2 Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  2 Recommendations   2017-10-02 The Gifted 7.0    2016-09-27 Aftermath 6.1    2017-09-27 SEAL Team 6.6    2017-10-21 Gunpowder 6.8    2017-10-09 Valor 6.3    2014-08-23 Intruders 6.5    2017-12-06 HAPPY! 7.4    2018-04-02 The Crossing 7.8  Facts Status  Cancelled Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.syfy.com/ghostwars Genres Mystery Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors t 21 tmdb42368388 20 Elizabeth Jennings 7 Mitsarinho k 6 ktoswang  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}