{"link": "https://www.themoviedb.org/tv/42671?language=en", "title": "Elfen Lied", "resume": "The Diclonius, a mutated homo sapien that is said to be selected by God and will eventually become the destruction of mankind, possesses two horns in their heads, and has a \"sixth sense\" which gives it telekinetic abilities. Due to this dangerous power, they have been captured and isolated in laboratories by the government. Lucy, a young and psychotic Diclonius, manages to break free of her confines and brutally murder most of the guards in the laboratory, only to get shot in the head as she makes her escape. She survives and manages to drift along to a beach, where two teenagers named Kouta and Yuka discovers her. Having lost her memories, she was named after the only thing that she can now say, \"Nyuu,\" and the two allow her to stay at Kouta's home. However, it appears that the evil \"Lucy\" is not dead just yet...", "rate": 77, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Chihiro Suzuki", "Sanae Kobayashi", "Emiko Hagiwara", "Hiroaki Hirata", "Hitomi Nabatame"], "character": ["Kouta", "Lucy / Nyuu", "Mayu", "Professor Kakuzawa Yu", "Kouta (child) / Shirakawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 42671   Expand Elfen Lied   (2004) User Score  Play Trailer Overview The Diclonius, a mutated homo sapien that is said to be selected by God and will eventually become the destruction of mankind, possesses two horns in their heads, and has a \"sixth sense\" which gives it telekinetic abilities. Due to this dangerous power, they have been captured and isolated in laboratories by the government. Lucy, a young and psychotic Diclonius, manages to break free of her confines and brutally murder most of the guards in the laboratory, only to get shot in the head as she makes her escape. She survives and manages to drift along to a beach, where two teenagers named Kouta and Yuka discovers her. Having lost her memories, she was named after the only thing that she can now say, \"Nyuu,\" and the two allow her to stay at Kouta's home. However, it appears that the evil \"Lucy\" is not dead just yet... Featured Crew Lynn Okamoto Creator Mamoru Kanbe Creator Takao Yoshioka Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chihiro Suzuki Kouta Sanae Kobayashi Lucy / Nyuu Emiko Hagiwara Mayu Hiroaki Hirata Professor Kakuzawa Yu Hitomi Nabatame Kouta (child) / Shirakawa Full Cast & Crew Last Season Season 1 2004 | 14 Episodes Season 1 of Elfen Lied premiered on July 25, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  8 Recommendations   2006-10-04 Death Note 8.2    2007-06-09 Ergo Proxy 7.3    2004-05-20 Samurai Champloo 8.0    1995-10-04 Neon Genesis Evangelion 8.0    2001-10-10 Hellsing 7.2    1997-10-07 Berserk 8.1    2006-04-08 Black Lagoon 7.9    2007-07-27 Baccano! 8.4  Facts Original Name  エルフェンリート Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  Japanese Runtime  25m Homepage   http://www.vap.co.jp/elfenlied/ Genres Animation Sci-Fi & Fantasy Keywords pedophilia amnesia blood splatter gore childhood trauma female killer decapitation blood evil bloodbath anime Content Score 100 Yes! Looking good! Top Contributors s 45 sandriondark 25 WillofOwn 21 Tira d 19 disturbD  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}