{"link": "https://www.themoviedb.org/tv/46923?language=en", "title": "Shetland", "resume": "Created from the novels by award winning crime writer Ann Cleeves, Shetland follows DI Jimmy Perez and his team as they investigate crime within the close knit island community. In this isolated and sometimes inhospitable environment, the team have to rely on a uniquely resourceful style of policing.", "rate": 75, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Douglas Henshall", "Mark Bonnar", "Julie Graham", "Erin Armstrong", "Julia Brown"], "character": ["D.I. Jimmy Perez", "Duncan Hunter", "Rhona Kelly", "Cassie Perez", "Molly Kilmuir"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46923   Expand Shetland   (2013) User Score  Play Trailer Overview Created from the novels by award winning crime writer Ann Cleeves, Shetland follows DI Jimmy Perez and his team as they investigate crime within the close knit island community. In this isolated and sometimes inhospitable environment, the team have to rely on a uniquely resourceful style of policing. Featured Crew Ann Cleeves Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Douglas Henshall D.I. Jimmy Perez Mark Bonnar Duncan Hunter Julie Graham Rhona Kelly Erin Armstrong Cassie Perez Julia Brown Molly Kilmuir Full Cast & Crew Current Season Series 4 2018 | 6 Episodes Season 4 of Shetland premiered on February 13, 2018. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w **SPOILERS**: Series 4 Open 0 by wonder2wonder\n      \n     I really like this show......but why won't Perez use force? Open 3 by  LizDuv Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  2 Recommendations   2013-10-29 Hinterland 7.5    2013-02-01 The Doctor Blake Mysteries 7.6    2006-01-01 In Justice 6.8    2011-05-01 Vera 6.8    2011-09-16 DCI Banks 7.9    2011-06-05 Case Histories 8.2    2015-05-05 No Offence 7.8    2011-01-13 Kidnap and Ransom 7.6  Facts Status  Returning Series Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/p01s711r Genres Crime Drama Mystery Keywords island parent child relationship scotland police detective murder investigation small community Content Score 100 Yes! Looking good! Top Contributors 114 Marr 🇳🇱 25 Elizabeth Jennings 15 Steve 10 NanaSanchez  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}