{"link": "https://www.themoviedb.org/tv/17035?language=en", "title": "Generation Kill", "resume": "The first 40 days of the war in Iraq as seen through the eyes of an elite group of U.S. Marines who spearheaded the invasion along with an embedded Rolling Stone reporter. A vivid account of the soldiers and of the forces that guided them in an often-improvised initiative.", "rate": 81, "genre": ["War", "Politics", "Drama", "Action", "Adventure"], "cast": ["Alexander Skarsgård", "James Ransone", "Lee Tergesen", "Jon Huertas", "Stark Sands"], "character": ["Sgt. Brad 'Iceman' Colbert", "Cpl. Josh Ray Person", "Evan 'Scribe' Wright", "Sgt. Antonio Espera", "Lt. Nathaniel Fick"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17035   Expand Generation Kill   (2008) User Score  Play Trailer Overview The first 40 days of the war in Iraq as seen through the eyes of an elite group of U.S. Marines who spearheaded the invasion along with an embedded Rolling Stone reporter. A vivid account of the soldiers and of the forces that guided them in an often-improvised initiative. Featured Crew David Simon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  16 Posters  24 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexander Skarsgård Sgt. Brad 'Iceman' Colbert James Ransone Cpl. Josh Ray Person Lee Tergesen Evan 'Scribe' Wright Jon Huertas Sgt. Antonio Espera Stark Sands Lt. Nathaniel Fick Full Cast & Crew Last Season Season 1 2008 | 7 Episodes Season 1 of Generation Kill premiered on July 13, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply R No gays? Open 2 by  RingaDeGong Go to Discussions Media Most Popular Videos  1 Backdrops  16 Posters  24 Recommendations   2010-03-14 The Pacific 7.9    2005-08-28 Rome 8.2    2010-09-19 Boardwalk Empire 7.7    1997-07-12 Oz 8.1    2002-03-12 The Shield 8.1    2010-03-16 Justified 7.9    2010-04-11 Treme 8.1    2004-03-21 Deadwood 8.1  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  65m Homepage   http://www.hbo.com/generation-kill Genres War & Politics Drama Action & Adventure Keywords war miniseries iraq war u.s. military Content Score 100 Yes! Looking good! Top Contributors 36 Elizabeth Jennings 21 Banana TB 16 TMDb Bot 11 SeenIt  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}