{"link": "https://www.themoviedb.org/tv/54?language=en", "title": "Growing Pains", "resume": "Growing Pains is an American television sitcom about an affluent family, residing in Huntington, Long Island, New York, with a working mother and a stay-at-home psychiatrist father raising three children together, which aired on ABC from September 24, 1985, to April 25, 1992.", "rate": 61, "genre": ["Comedy"], "cast": ["Alan Thicke", "Joanna Kerns", "Kirk Cameron", "Jeremy Miller", "Tracey Gold"], "character": ["Dr. Jason Seaver", "Margaret \"Maggie\" Malone Seaver", "Mike Seaver", "Ben Seaver", "Carol Seaver"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 54   Expand Growing Pains   (1985) User Score Overview Growing Pains is an American television sitcom about an affluent family, residing in Huntington, Long Island, New York, with a working mother and a stay-at-home psychiatrist father raising three children together, which aired on ABC from September 24, 1985, to April 25, 1992. Featured Crew Neal Marlens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Alan Thicke Dr. Jason Seaver Joanna Kerns Margaret \"Maggie\" Malone Seaver Kirk Cameron Mike Seaver Jeremy Miller Ben Seaver Tracey Gold Carol Seaver Full Cast & Crew Last Season Season 7 1991 | 24 Episodes Season 7 of Growing Pains premiered on September 18, 1991. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply In the Pilot, Maggie is humming the theme to Who's the Boss. Open 0 by JarekReanimated\n      \n     w Mike Seaver: Happy Birthday Kirk Cameron! Open 0 by wonder2wonder\n      \n     It is really sad to think Alan Thick is gone. Open 0 by Olivergbyrne\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  1 Recommendations   1989-02-28 Coach 6.8    1977-03-15 Three's Company 7.3    1982-09-22 Family Ties 7.0    1983-09-16 Webster 4.9    1978-11-03 Diff'rent Strokes 5.7    1991-09-17 Home Improvement 7.0    1984-10-03 Charles in Charge 5.1    1969-09-26 The Brady Bunch 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords family sitcom Content Score 100 Yes! Looking good! Top Contributors z 4 zurman1 w 4 webmaster f 4 fer__mero 4 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}