{"link": "https://www.themoviedb.org/tv/21421?language=en", "title": "The Staircase", "resume": "Academy Award-winning documentary filmmaker, Jean-Xavier de Lestrade, presents a gripping courtroom thriller, offering a rare and revealing inside look at a high-profile murder trial. In 2001, author Michael Peterson was arraigned for the murder of his wife Kathleen, whose body was discovered lying in a pool of blood on the stairway of their home. Granted unusual access to Peterson's lawyers, home and immediate family, de Lestrade's cameras capture the defense team as it considers its strategic options. \"The staircase\" is an engrossing look at contemporary American justice that features more twists than a legal bestseller.", "rate": 79, "genre": ["Documentary", "Crime"], "cast": ["Michael Peterson", "David Rudolf", "Ron Guerette", "Tom Maher", "Bill Peterson"], "character": ["Himself", "Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21421   Expand The Staircase   (2005) User Score  Play Trailer Overview Academy Award-winning documentary filmmaker, Jean-Xavier de Lestrade, presents a gripping courtroom thriller, offering a rare and revealing inside look at a high-profile murder trial. In 2001, author Michael Peterson was arraigned for the murder of his wife Kathleen, whose body was discovered lying in a pool of blood on the stairway of their home. Granted unusual access to Peterson's lawyers, home and immediate family, de Lestrade's cameras capture the defense team as it considers its strategic options. \"The staircase\" is an engrossing look at contemporary American justice that features more twists than a legal bestseller. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Michael Peterson Himself David Rudolf Himself Ron Guerette Himself Tom Maher Himself Bill Peterson Himself Full Cast & Crew Last Season Original Air Date Original Air Date Part I (Original Air Date) Season 1 2005 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Staircase. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  7 Posters  8 Recommendations   Paradise Lost 2: Revelations 7.9    2013-04-11 The Killer Speaks 7.5    Jonestown: The Life and Death of Peoples Temple 8.2    2011-05-22 Louis Theroux: Miami Mega-Jail 8.2    Roman Polanski: Wanted and Desired 6.4    1969-07-25 Louis Malle's India 5.4    2015-02-08 The Jinx: The Life and Deaths of Robert Durst 8.4    1999-01-01 Cold Case Files 5.9  Facts Original Name  Soupçons Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  625m Homepage  - Genres Documentary Crime Keywords true crime falling down stairs wife murder murder trial mysterious death Content Score 93 Almost there... Top Contributors 23 Elizabeth Jennings 15 nicobene TB 11 TMDb Bot Y 10 YJ  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}