{"link": "https://www.themoviedb.org/tv/43865?language=en", "title": "Psycho-Pass", "resume": "Psycho-Pass is a Japanese anime television series that takes place in the future where it is possible to instantaneously measure a person's mental state, personality, and the probability that a person will commit crimes with a device installed on each citizen's body called the Psycho-Pass. It follows members of Unit One of the Public Safety Bureau's Criminal Investigation Division and the crimes they investigate.", "rate": 78, "genre": ["Sci-Fi", "Fantasy", "Animation", "Action", "Adventure"], "cast": ["Kana Hanazawa", "Kenji Nomura", "Keiji Fujiwara", "Ayane Sakura", "Takahiro Sakurai"], "character": ["Akane Tsunemori (voice)", "Nobuchika Ginoza (voice)", "Sakuya Tougane (voice)", "Mika Shimotsuki (voice)", "Sho Hinakawa (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43865   Expand Psycho-Pass   (2012) User Score Overview Psycho-Pass is a Japanese anime television series that takes place in the future where it is possible to instantaneously measure a person's mental state, personality, and the probability that a person will commit crimes with a device installed on each citizen's body called the Psycho-Pass. It follows members of Unit One of the Public Safety Bureau's Criminal Investigation Division and the crimes they investigate. Featured Crew Naoyoshi Shiotani Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Akane Tsunemori (voice) Kenji Nomura Nobuchika Ginoza (voice) Keiji Fujiwara Sakuya Tougane (voice) Ayane Sakura Mika Shimotsuki (voice) Takahiro Sakurai Sho Hinakawa (voice) Full Cast & Crew Last Season Psycho-Pass 2 2014 | 11 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  7 Recommendations   2007-04-06 Darker than Black 7.7    2014-07-03 Tokyo Ghoul 7.2    2011-04-06 Steins;Gate 8.2    2014-10-08 Parasyte -the maxim- 7.5    2007-06-09 Ergo Proxy 7.3    2015-07-12 God Eater 6.4    2014-07-06 Akame ga Kill! 7.0    2014-07-11 Terror in Resonance 6.7  Facts Original Name  PSYCHO-PASS サイコパス Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://psycho-pass.com/ Genres Sci-Fi & Fantasy Animation Action & Adventure Keywords future japan police criminal Content Score 93 Almost there... Top Contributors 82 Marr 🇳🇱 TB 12 TMDb Bot G 11 Giaten c 7 coffinbearer  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}