{"link": "https://www.themoviedb.org/tv/69998?language=en", "title": "Hugo Chávez, El Comandante", "resume": "The life of Hugo Chavez; from childhood, his arrival to power, confrontations, and loves to his last days as president.", "rate": 88, "genre": ["Documentary", "Drama"], "cast": ["Andrés Parra", "Julián Román", "José Narvaez", "Stephanie Cayo", "César Manzano"], "character": ["Hugo Chávez", "Carlos Uzcátegui", "Iván Fonseca", "Mónica Zavaleta", "Manuel Centeno"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69998   Expand Hugo Chávez, El Comandante   (2017) User Score Overview The life of Hugo Chavez; from childhood, his arrival to power, confrontations, and loves to his last days as president. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrés Parra Hugo Chávez Julián Román Carlos Uzcátegui José Narvaez Iván Fonseca Stephanie Cayo Mónica Zavaleta César Manzano Manuel Centeno Full Cast & Crew Last Season Season 1 2017 | 66 Episodes Season 1 of Hugo Chávez, El Comandante premiered on January 31, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Hugo Chávez, El Comandante. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  50m Homepage   http://elcomandante.tntla.com/ Genres Documentary Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 27 Elizabeth Jennings 12 araque9604 l 5 lanci112 jp 5 juan perez  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}