{"link": "https://www.themoviedb.org/tv/79875?language=en", "title": "I'm a Mother, Too", "resume": "A family drama about a surrogate mother and her client.", "rate": 70, "genre": ["Family"], "cast": ["Moon Bo Ryung", "Lee In-hye", "Woo Hee-jin", "Park Jun-hyuk", "Park Geun-hyung"], "character": ["Oh Hye-Rim", "Yoon Ji-Young", "Choi Kyung-Shin", "Shin Hyun-Joon", "Shin Tae-Jong"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79875   Expand I'm a Mother, Too   (2018) User Score Overview A family drama about a surrogate mother and her client. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Moon Bo Ryung Oh Hye-Rim Lee In-hye Yoon Ji-Young Woo Hee-jin Choi Kyung-Shin Park Jun-hyuk Shin Hyun-Joon Park Geun-hyung Shin Tae-Jong Full Cast & Crew Current Season Season 1 2018 | 30 Episodes Season 1 of I'm a Mother, Too premiered on May 28, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on I'm a Mother, Too. You can help by rating TV shows you've seen. Facts Original Name  나도 엄마야 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  40m Homepage   http://programs.sbs.co.kr/drama/2mom Genres Family Keywords family Content Score 86 Almost there... Top Contributors 18 friend-series.com V 10 Violsa 8 Elizabeth Jennings j 4 jimy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}