{"link": "https://www.themoviedb.org/tv/39373?language=en", "title": "Red vs. Blue", "resume": "Red vs. Blue, often abbreviated as RvB, is a comic science fiction video web series created by Rooster Teeth Productions and distributed through the Internet and on DVD. The story centers on two opposing teams of soldiers fighting a civil war in the middle of a desolate box canyon, in a parody of first-person shooter games, military life, and science fiction films.", "rate": 65, "genre": ["Animation", "Comedy"], "cast": ["Matt Hullum", "Jason Saldaña", "Gus Sorola", "Burnie Burns", "Joel Heyman"], "character": ["Sarge", "Pvt. Lavernius Tucker", "Pvt. Dick Simmons", "Pvt. Leonard Chruch", "Pvt. Micheal J. Caboose"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39373   Expand Red vs. Blue   (2003) User Score  Play Trailer Overview Red vs. Blue, often abbreviated as RvB, is a comic science fiction video web series created by Rooster Teeth Productions and distributed through the Internet and on DVD. The story centers on two opposing teams of soldiers fighting a civil war in the middle of a desolate box canyon, in a parody of first-person shooter games, military life, and science fiction films. Featured Crew Burnie Burns Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matt Hullum Sarge Jason Saldaña Pvt. Lavernius Tucker Gus Sorola Pvt. Dick Simmons Burnie Burns Pvt. Leonard Chruch Joel Heyman Pvt. Micheal J. Caboose Full Cast & Crew Last Season Original Air Date Original Air Date Story Arcs (Story Arc) Season 15 2017 | 1 Episode Season 15 of Red vs. Blue premiered on April  2, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Red vs. Blue. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  7 Recommendations   2007-06-16 Would I Lie to You? 7.8    2015-12-26 And Then There Were None 7.7    2009-09-17 Community 7.9  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  8m Homepage   http://www.roosterteeth.com/ Genres Animation Comedy Keywords video game Content Score 100 Yes! Looking good! Top Contributors 76 Sc00ge 26 Banana J 17 Jake_F 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}