{"link": "https://www.themoviedb.org/tv/43016?language=en", "title": "Hatfields & McCoys", "resume": "It’s the true American story of a legendary family feud—one that spanned decades and nearly launched a war between Kentucky and West Virginia. The Hatfield-McCoy saga begins with Devil Anse Hatfield and Randall McCoy.. Close friends and comrades until near the end of the Civil War, they return to their neighboring homes—Hatfield in West Virginia, McCoy just across the Tug River border in Kentucky—to increasing tensions, misunderstandings and resentments that soon explode into all-out warfare between their families. As hostilities grow, friends, neighbors and outside forces join the fight, bringing the two states to the brink of another civil war.", "rate": 75, "genre": ["Drama", "Western"], "cast": ["Kevin Costner", "Bill Paxton", "Matt Barr", "Tom Berenger", "Powers Boothe"], "character": ["'Devil' Anse Hatfield", "Randall McCoy", "Johnse Hatfield", "Jim Vance", "Judge Valentine 'Wall' Hatfield"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43016   Expand Hatfields & McCoys   (2012) User Score  Play Trailer Overview It’s the true American story of a legendary family feud—one that spanned decades and nearly launched a war between Kentucky and West Virginia. The Hatfield-McCoy saga begins with Devil Anse Hatfield and Randall McCoy.. Close friends and comrades until near the end of the Civil War, they return to their neighboring homes—Hatfield in West Virginia, McCoy just across the Tug River border in Kentucky—to increasing tensions, misunderstandings and resentments that soon explode into all-out warfare between their families. As hostilities grow, friends, neighbors and outside forces join the fight, bringing the two states to the brink of another civil war. Featured Crew Ted Mann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Costner 'Devil' Anse Hatfield Bill Paxton Randall McCoy Matt Barr Johnse Hatfield Tom Berenger Jim Vance Powers Boothe Judge Valentine 'Wall' Hatfield Full Cast & Crew Last Season Season 1 2012 | 3 Episodes Season 1 of Hatfields & McCoys premiered on May 28, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  11 Recommendations   1998-10-23 Brimstone 7.6    2003-02-02 Kingpin 6.9    1989-01-19 Carrusel 7.2    2004-03-21 Deadwood 8.1    2006-06-25 Broken Trail 7.3    2014-09-21 The Code 7.4    2010-09-19 Boardwalk Empire 7.7    2004-07-21 Rescue Me 7.6  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  100m Homepage   http://www.history.com/shows/hatfields-and-mccoys Genres Drama Western Keywords civil war kentucky west virginia feud miniseries american civil war blood feud 19th century Content Score 100 Yes! Looking good! Top Contributors TB 36 TMDb Bot 21 Elizabeth Jennings T 17 Tobby 17 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}