{"link": "https://www.themoviedb.org/tv/4496?language=en", "title": "Meet the Press", "resume": "Meet the Press is a weekly American television news/interview program airing on NBC. It is the longest-running television series in American broadcasting history, despite bearing little resemblance to the original format of the program seen in its television debut on November 6, 1947. Meet the Press is the highest-rated of the American television Sunday morning talk shows.\nIt has been hosted by 11 moderators, beginning with Martha Rountree. The current host is David Gregory, who assumed the role in December 2008. The show began using a new set on May 2, 2010, with video screens and a library-style set with bookshelves, and different, modified intro music, with David Gregory previewing the guests using a large video screen, and with the Meet the Press theme music in a shorter \"modernized [style]... the beginning repeated with drum beats\". Meet the Press and similar shows specialize in interviewing national leaders on issues of politics, economics, foreign policy and other public affairs.\nOver the past few years, the program's usual time slot over the NBC network is between 9-10 a.m. local time in most markets, though this may vary by markets due to commitments by affiliates to religious, E/I or local news and public affairs programming. It also varies several weeks in the summer due to morning coverage of French Open tennis or the Monaco Grand Prix by NBC Sports. In earlier years, the program would air at noon every Sunday. The program also re-airs Sunday afternoons at 2 p.m. ET and early Monday mornings at 4 a.m. ET on MSNBC, along with an early Monday morning replay as part of NBC's \"All Night\" lineup. The program is also distributed to radio stations via syndication by Dial Global, and aired as part of C-SPAN Radio's replay of the Sunday morning talk shows.", "rate": 50, "genre": ["News"], "cast": ["Tim Russert"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4496   Expand Meet the Press   (1947) User Score Overview Meet the Press is a weekly American television news/interview program airing on NBC. It is the longest-running television series in American broadcasting history, despite bearing little resemblance to the original format of the program seen in its television debut on November 6, 1947. Meet the Press is the highest-rated of the American television Sunday morning talk shows. It has been hosted by 11 moderators, beginning with Martha Rountree. The current host is David Gregory, who assumed the role in December 2008. The show began using a new set on May 2, 2010, with video screens and a library-style set with bookshelves, and different, modified intro music, with David Gregory previewing the guests using a large video screen, and with the Meet the Press theme music in a shorter \"modernized [style]... the beginning repeated with drum beats\". Meet the Press and similar shows specialize in interviewing national leaders on issues of politics, economics, foreign policy and other public affairs. Over the past few years, the program's usual time slot over the NBC network is between 9-10 a.m. local time in most markets, though this may vary by markets due to commitments by affiliates to religious, E/I or local news and public affairs programming. It also varies several weeks in the summer due to morning coverage of French Open tennis or the Monaco Grand Prix by NBC Sports. In earlier years, the program would air at noon every Sunday. The program also re-airs Sunday afternoons at 2 p.m. ET and early Monday mornings at 4 a.m. ET on MSNBC, along with an early Monday morning replay as part of NBC's \"All Night\" lineup. The program is also distributed to radio stations via syndication by Dial Global, and aired as part of C-SPAN Radio's replay of the Sunday morning talk shows. Featured Crew Martha Rountree Creator Lawrence E. Spivak Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tim Russert Host Full Cast & Crew Last Season Season 61 2007 | 48 Episodes Season 61 of Meet the Press premiered on January  7, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Meet the Press. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  News Original Language  English Runtime  53m, 60m Homepage   http://www.msnbc.msn.com/id/3032608 Genres News Keywords news broadcast Content Score 64 We're so close, yet so far. Top Contributors 144 Banana k 3 ktulu666 D 2 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}