{"link": "https://www.themoviedb.org/tv/501?language=en", "title": "Battlestar Galactica", "resume": "When the 12 Colonies of Man are wiped out by a cybernetic race called the Cylons, Commander Adama and the crew of the battlestar Galactica lead a ragtag fleet of human survivors in search of a \"mythical planet\" called Earth.", "rate": 69, "genre": ["Drama", "Science", "Fiction"], "cast": ["Lorne Greene", "Richard Hatch", "Dirk Benedict", "Terry Carter", "John Colicos"], "character": ["Commander Adama", "Capt. Apollo", "Lt. Starbuck", "Colonel Tigh", "Count Baltar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 501   Expand Battlestar Galactica   (1978) User Score  Play Trailer Overview When the 12 Colonies of Man are wiped out by a cybernetic race called the Cylons, Commander Adama and the crew of the battlestar Galactica lead a ragtag fleet of human survivors in search of a \"mythical planet\" called Earth. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  2 Images Backdrops  11 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Lorne Greene Commander Adama Richard Hatch Capt. Apollo Dirk Benedict Lt. Starbuck Terry Carter Colonel Tigh John Colicos Count Baltar Full Cast & Crew Last Season Season 1 1978 | 24 Episodes Season 1 of Battlestar Galactica premiered on September 17, 1978. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Jolly Vs Porkins Open 1 by  Nexus71 there are those who believe Open 3 by  Nexus71 w Captain Apollo: Richard Hatch R.I.P. Open 2 by  Invidia Go to Discussions Media Most Popular Videos  2 Backdrops  11 Posters  11 Recommendations   1979-09-20 Buck Rogers in the 25th Century 6.9    1980-01-27 Galactica 1980 5.5    1974-01-18 The Six Million Dollar Man 6.6    1989-09-18 Alien Nation 6.9    1976-01-14 The Bionic Woman 6.2    1975-09-04 Space: 1999 7.3    1976-03-21 Charlie's Angels 5.9    1982-03-13 T. J. Hooker 6.1  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Science Fiction Keywords space opera Content Score 100 Yes! Looking good! Top Contributors 36 Steve 35 Elizabeth Jennings 17 MidnightBlues 12 Baloralys  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}