{"link": "https://www.themoviedb.org/tv/64550?language=en", "title": "American Gothic", "resume": "A prominent Boston family attempts to redefine itself in the wake of a chilling discovery that links their recently deceased patriarch to a string of murders spanning decades — amid the mounting suspicion that one of them may have been his accomplice.", "rate": 47, "genre": ["Drama", "Mystery"], "cast": ["Juliet Rylance", "Antony Starr", "Virginia Madsen", "Justin Chatwin", "Megan Ketch"], "character": ["Alison Hawthorne-Price", "Garrett Hawthorne", "Madeline Hawthorne", "Cam Hawhorne", "Tessa Ross"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64550   Expand American Gothic   (2016) User Score Overview A prominent Boston family attempts to redefine itself in the wake of a chilling discovery that links their recently deceased patriarch to a string of murders spanning decades — amid the mounting suspicion that one of them may have been his accomplice. Featured Crew Corinne Brinkerhoff Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Juliet Rylance Alison Hawthorne-Price Antony Starr Garrett Hawthorne Virginia Madsen Madeline Hawthorne Justin Chatwin Cam Hawhorne Megan Ketch Tessa Ross Full Cast & Crew Last Season Season 1 2016 | 13 Episodes Season 1 of American Gothic premiered on June 22, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2016-06-13 BrainDead 7.1    2016-06-14 Uncle Buck 5.7    2015-10-27 Wicked City 5.4    2016-06-28 Dead of Summer 5.3    2016-06-28 The Living and the Dead 6.5    2017-01-06 One Day at a Time 6.6    2011-10-10 Enlightened 7.1    2015-01-11 Togetherness 6.0  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  41m Homepage   http://www.cbs.com/shows/american-gothic/ Genres Drama Mystery Keywords secret boston family secret murder serial killer Content Score 93 Almost there... Top Contributors 37 Banana 34 Elizabeth Jennings 5 felectronika 4 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}