{"link": "https://www.themoviedb.org/tv/34014?language=en", "title": "An Idiot Abroad", "resume": "An Idiot Abroad is a British travel documentary television series broadcast on Sky1 and Science, as well as spin-off books published by Canongate Books, created by Ricky Gervais and Stephen Merchant and starring Karl Pilkington. The ongoing theme of both the television series and the books is that Pilkington has no interest in global travel, so Merchant and Gervais make him travel while they stay in the United Kingdom and monitor his progress.", "rate": 79, "genre": ["Comedy", "Documentary"], "cast": ["Karl Pilkington", "Ricky Gervais", "Stephen Merchant", "Warwick Davis"], "character": ["Himself", "Himself", "Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34014   Expand An Idiot Abroad   (2010) User Score  Play Trailer Overview An Idiot Abroad is a British travel documentary television series broadcast on Sky1 and Science, as well as spin-off books published by Canongate Books, created by Ricky Gervais and Stephen Merchant and starring Karl Pilkington. The ongoing theme of both the television series and the books is that Pilkington has no interest in global travel, so Merchant and Gervais make him travel while they stay in the United Kingdom and monitor his progress. Featured Crew Ricky Gervais Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Karl Pilkington Himself Ricky Gervais Himself Stephen Merchant Himself Warwick Davis Himself Full Cast & Crew Last Season Season 3 2012 | 3 Episodes Season 3 of An Idiot Abroad premiered on November 30, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  9 Recommendations   2010-02-19 The Ricky Gervais Show 7.9    2013-10-20 The Moaning of Life 8.2    2005-07-21 Extras 7.8    2011-11-10 Life's Too Short 7.1    2012-04-12 Derek 7.1    2001-07-09 The Office 8.1    2004-09-03 Green Wing 8.0    2010-12-25 Come Fly With Me 6.6  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Documentary Original Language  English Runtime  60m Homepage   http://www.anidiotabroad.com Genres Comedy Documentary Keywords travel british humour Content Score 100 Yes! Looking good! Top Contributors 22 Banana z 5 zurman1 O 5 Ozbourne 4 -BioHaZard-  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}