{"link": "https://www.themoviedb.org/tv/243?language=en", "title": "Penn & Teller: Bullshit!", "resume": "This daring original series stars postmodern bad boys of magic Penn & Teller as they question many of our culture's most cherished and widely held beliefs. From the truth about palm readings and TV psychics to the reality behind Feng Shui and Ouija boards, the archly comic masters of misdirection host this eye-opening analysis of the middle-ground between perception and reality.", "rate": 79, "genre": ["Comedy", "Documentary"], "cast": ["Teller", "Penn Jillette"], "character": ["Himself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 243   Expand Penn & Teller: Bullshit!   (2003) User Score Overview This daring original series stars postmodern bad boys of magic Penn & Teller as they question many of our culture's most cherished and widely held beliefs. From the truth about palm readings and TV psychics to the reality behind Feng Shui and Ouija boards, the archly comic masters of misdirection host this eye-opening analysis of the middle-ground between perception and reality. Featured Crew Eric Small Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  9 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Teller Himself Penn Jillette Himself Full Cast & Crew Last Season Season 8 2010 | 10 Episodes Season 8 of Penn & Teller: Bullshit! premiered on June 10, 2010. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Penn & Teller: Bullshit!. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  9 Posters  3 Recommendations   1999-04-07 Strangers with Candy 7.0    1995-11-03 Mr. Show with Bob and David 8.1    2006-10-16 Frisky Dingo 8.1    1998-05-14 Celebrity Deathmatch 6.7    1998-08-19 Upright Citizens Brigade 8.0    1994-04-15 Space Ghost Coast to Coast 8.3    2003-11-13 Brainiac: Science Abuse 7.1    2006-08-06 Metalocalypse 6.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.sho.com/sho/penn-and-teller-bullshit/home Genres Comedy Documentary Keywords skepticism culture Content Score 64 We're so close, yet so far. Top Contributors l 20 lostarchitect 8 Elizabeth Jennings 5 Patrik Selin s 4 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}