{"link": "https://www.themoviedb.org/tv/31343?language=en", "title": "Jersey Shore", "resume": "Jersey Shore is an American reality television series which ran on MTV from December 3, 2009 to December 20, 2012 in the United States. The series follows the lives of eight housemates spending their summer at the Jersey Shore in the U.S. state of New Jersey. Season 2 followed the cast escaping the cold northeast winter to Miami Beach, with Season 3 returning to the Jersey Shore. The fourth season, filmed in Italy, premiered on August 4, 2011. The show returned for a fifth season, at Seaside Heights on January 5, 2012. The fifth season finale aired on March 15, 2012. On March 19, 2012, MTV confirmed that the series would return for their sixth season. On August 30, 2012, MTV announced that the Jersey Shore would end after the sixth season, which premiered on October 4. The series finale aired on December 20, 2012.\nThe show debuted amid large amounts of controversy regarding the use of the words \"Guido/Guidette,\" portrayals of Italian-American stereotypes, and scrutiny from locals because the cast members were not residents of the area.\nThe series garnered record ratings for MTV, making it the network's most viewed series telecast ever. The series' cast have also been credited with introducing unique lexicon and phrases into American popular culture.", "rate": 36, "genre": ["Reality"], "cast": ["Paul 'Pauly D' DelVecchio", "Sammi 'Sweetheart' Giancola", "Vinny Guadagnino", "Nicole 'Snooki' Polizzi", "Mike Sorrentino"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31343   Expand Jersey Shore   (2009) User Score  Play Trailer Overview Jersey Shore is an American reality television series which ran on MTV from December 3, 2009 to December 20, 2012 in the United States. The series follows the lives of eight housemates spending their summer at the Jersey Shore in the U.S. state of New Jersey. Season 2 followed the cast escaping the cold northeast winter to Miami Beach, with Season 3 returning to the Jersey Shore. The fourth season, filmed in Italy, premiered on August 4, 2011. The show returned for a fifth season, at Seaside Heights on January 5, 2012. The fifth season finale aired on March 15, 2012. On March 19, 2012, MTV confirmed that the series would return for their sixth season. On August 30, 2012, MTV announced that the Jersey Shore would end after the sixth season, which premiered on October 4. The series finale aired on December 20, 2012. The show debuted amid large amounts of controversy regarding the use of the words \"Guido/Guidette,\" portrayals of Italian-American stereotypes, and scrutiny from locals because the cast members were not residents of the area. The series garnered record ratings for MTV, making it the network's most viewed series telecast ever. The series' cast have also been credited with introducing unique lexicon and phrases into American popular culture. Featured Crew SallyAnn Salsano Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  13 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul 'Pauly D' DelVecchio Sammi 'Sweetheart' Giancola Vinny Guadagnino Nicole 'Snooki' Polizzi Mike Sorrentino Full Cast & Crew Last Season Season 6 2012 | 14 Episodes Season 6 of Jersey Shore premiered on October  4, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  13 Posters  2 Recommendations   2012-08-08 Here Comes Honey Boo Boo 1.9    1995-10-14 MADtv 5.7    2004-10-19 The Biggest Loser 4.6    Scooby-Doo! and the Monster of Mexico 4.5    1969-09-26 The Brady Bunch 6.5    2008-12-03 Man v. Food 6.7    2001-11-14 The Bernie Mac Show 5.7    2006-05-31 The Hills 2.7  Facts Status  Ended Network Certification  - Type  Reality Original Language  English Runtime  60m, 42m Homepage   http://www.mtv.com/shows/jersey_shore/series.jhtml Genres Reality Keywords new jersey italian american group of friends housemates Content Score 100 Yes! Looking good! Top Contributors 12 Banana c 10 courtneysmith86 3 kuzronk m 3 michl  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}