{"link": "https://www.themoviedb.org/tv/21116?language=en", "title": "Das Traumschiff", "resume": "Das Traumschiff is a West German-German television series by ZDF.\nThe series, about a cruise ship that travels to places around the world, debuted in 1981 and became one of the most-watched television shows in Germany. A 2007 Variety article described the series as a '\"Love Boat\"-like cruise liner skein.'", "rate": 55, "genre": ["Comedy", "Drama"], "cast": ["Heide Keller", "Horst Naumann", "Siegfried Rauch", "Heinz Weiss", "Sascha Hehn"], "character": ["Chefhostess Beatrice von Ledebur", "Schiffsarzt Dr. Horst Schröder", "Kapitän Paulsen", "Kapitän Heinz Hansen", "Chefsteward Victor/Kapitän Victor Burger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21116   Expand Das Traumschiff   (1981) User Score Overview Das Traumschiff is a West German-German television series by ZDF. The series, about a cruise ship that travels to places around the world, debuted in 1981 and became one of the most-watched television shows in Germany. A 2007 Variety article described the series as a '\"Love Boat\"-like cruise liner skein.' Featured Crew Wolfgang Rademann Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Heide Keller Chefhostess Beatrice von Ledebur Horst Naumann Schiffsarzt Dr. Horst Schröder Siegfried Rauch Kapitän Paulsen Heinz Weiss Kapitän Heinz Hansen Sascha Hehn Chefsteward Victor/Kapitän Victor Burger Full Cast & Crew Last Season Season 1 1981 | 81 Episodes Season 1 of Das Traumschiff premiered on November 22, 1981. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Das Traumschiff. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  German Runtime  90m Homepage   http://traumschiff.zdf.de/das-traumschiff/das-traumschiff-5988794.html Genres Comedy Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors S 29 Samara S 5 SunHomeMovie 6 3 62achab c 3 creact  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}