{"link": "https://www.themoviedb.org/tv/43513?language=en", "title": "The Adventures of Tom Sawyer", "resume": "The Adventures of Tom Sawyer is a Japanese anime series, directed by Hiroshi Saitô which was aired in 1980. It is based on the well-known and popular novel The Adventures of Tom Sawyer by Mark Twain. The series was broadcast on the World Masterpiece Theater, an animation staple on Fuji TV that showcased each year an animated version of a different classical book or story of Western literature, and was originally titled \"Tom Sawyer no Bōken\". It was the second installment of the series, after 1977's Rascal the Raccoon, to feature the work of an American author. This series was also dubbed to English by Saban International and aired on HBO circa 1988 under the title \"The Adventures of Tom Sawyer.\" It aired during the 7:30AM time slot and alternated with the later WMT version of \"Little Women.\" Celebrity Home Entertainment released videos in the United States under the title \"All New Adventures of Tom Sawyer\". As of January 2011, the anime is airing in the United States on the NHK's cable channel TV Japan.", "rate": 89, "genre": ["Action", "Adventure", "Animation", "Drama"], "cast": ["Masako Nozawa", "Kazuyo Aoki", "Keiko Han", "Ichirō Nagai", "Ikuo Nishikawa"], "character": ["Tom Sawyer", "Huckleberry Finn", "Becky Thatcher", "Prof. Dobbins", "Jim Hollis"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43513   Expand The Adventures of Tom Sawyer   (1980) User Score Overview The Adventures of Tom Sawyer is a Japanese anime series, directed by Hiroshi Saitô which was aired in 1980. It is based on the well-known and popular novel The Adventures of Tom Sawyer by Mark Twain. The series was broadcast on the World Masterpiece Theater, an animation staple on Fuji TV that showcased each year an animated version of a different classical book or story of Western literature, and was originally titled \"Tom Sawyer no Bōken\". It was the second installment of the series, after 1977's Rascal the Raccoon, to feature the work of an American author. This series was also dubbed to English by Saban International and aired on HBO circa 1988 under the title \"The Adventures of Tom Sawyer.\" It aired during the 7:30AM time slot and alternated with the later WMT version of \"Little Women.\" Celebrity Home Entertainment released videos in the United States under the title \"All New Adventures of Tom Sawyer\". As of January 2011, the anime is airing in the United States on the NHK's cable channel TV Japan. Featured Crew Hiroshi Saitou Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masako Nozawa Tom Sawyer Kazuyo Aoki Huckleberry Finn Keiko Han Becky Thatcher Ichirō Nagai Prof. Dobbins Ikuo Nishikawa Jim Hollis Full Cast & Crew Last Season Season 1 1980 | 49 Episodes Season 1 of The Adventures of Tom Sawyer premiered on January  6, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  6 Recommendations   2016-06-08 Power Monkeys 7.0    2006-01-01 In Justice 6.8    2011-01-13 Kidnap and Ransom 7.6    2004-07-19 The Grid 7.0    2015-04-15 The Delivery Man 6.5    2010-07-12 The Silence 6.8    2011-05-02 Case Sensitive 5.4    2013-09-05 The Guilty 7.0  Facts Original Name  トム・ソーヤーの冒険 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 17 BrerFox 14 Elizabeth Jennings d 6 dune2000 b 6 baux  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}