{"link": "https://www.themoviedb.org/tv/211?language=en", "title": "The Game", "resume": "The Game is an American comedy-drama television series created by Mara Brock Akil. Premiering on October 1, 2006, the series debuted as the only new comedy series chosen for The CW's primetime schedule. Along with Runaway, it was one of only two series on the new network not to be inherited from either of its predecessor networks, The WB and UPN, during the network's first season. The series is a spinoff of the long-running UPN/CW sitcom, Girlfriends.\nAfter three seasons, the series was canceled by The CW in May 2009. BET struck a deal with The Game's parent company CBS to develop new episodes of the series, relocating taping of the show from Los Angeles to Atlanta, and announcing its renewal at the April 2010 upfronts. The Game returned to the air for a fourth season on January 11, 2011, with a record breaking 7.7 million viewers. The series was renewed for a fifth season, and premiered on January 10, 2012. Tia Mowry-Hardrict announced on her Twitter that she will not be returning to the series. In June 2012, it was confirmed that actress Lauren London and actor Jay Ellis had joined the cast as series regulars.\nIn April 2013, it was announced that The Game has been renewed for a seventh season that is set to premiere in 2014.", "rate": 74, "genre": ["Drama", "Comedy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 211   Expand The Game   (2006) User Score Overview The Game is an American comedy-drama television series created by Mara Brock Akil. Premiering on October 1, 2006, the series debuted as the only new comedy series chosen for The CW's primetime schedule. Along with Runaway, it was one of only two series on the new network not to be inherited from either of its predecessor networks, The WB and UPN, during the network's first season. The series is a spinoff of the long-running UPN/CW sitcom, Girlfriends. After three seasons, the series was canceled by The CW in May 2009. BET struck a deal with The Game's parent company CBS to develop new episodes of the series, relocating taping of the show from Los Angeles to Atlanta, and announcing its renewal at the April 2010 upfronts. The Game returned to the air for a fourth season on January 11, 2011, with a record breaking 7.7 million viewers. The series was renewed for a fifth season, and premiered on January 10, 2012. Tia Mowry-Hardrict announced on her Twitter that she will not be returning to the series. In June 2012, it was confirmed that actress Lauren London and actor Jay Ellis had joined the cast as series regulars. In April 2013, it was announced that The Game has been renewed for a seventh season that is set to premiere in 2014. Featured Crew Mara Brock Akil Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 9 2015 | 10 Episodes Season 9 of The Game premiered on June  3, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Tasha: Happy Birthday Wendy Raquel Robinson! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  9 Recommendations We don't have enough data to suggest any TV shows based on The Game. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bet.com/shows/the-game.html Genres Drama Comedy Keywords american football black sitcom Content Score 64 We're so close, yet so far. Top Contributors t 82 tmdb98495582 15 Elizabeth Jennings n 5 norman2016 s 5 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}