{"link": "https://www.themoviedb.org/tv/63130?language=en", "title": "Red Oaks", "resume": "A coming-of-age comedy set in the \"go-go\" 80s  that is equal parts hijinks and heartfelt about a college student enjoying a last hurrah before summer comes to an end--and the future begins. \nDavid Myers, an assistant tennis pro at the Red Oaks Country Club in suburban New Jersey in 1985, is both reeling from his father's heart attack and conflicted about what major to declare in the fall. While there, he meets a colorful cast of misfit co-workers and wealthy club members including an alluring art student named Skye and her corporate raider father Getty.", "rate": 76, "genre": ["Comedy"], "cast": ["Craig Roberts", "Alexandra Socha", "Paul Reiser", "Oliver Cooper", "Josh Meyers"], "character": ["David", "Skye", "Getty", "Wheeler", "Barry"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63130   Expand Red Oaks   (2014) User Score  Play Trailer Overview A coming-of-age comedy set in the \"go-go\" 80s  that is equal parts hijinks and heartfelt about a college student enjoying a last hurrah before summer comes to an end--and the future begins.  David Myers, an assistant tennis pro at the Red Oaks Country Club in suburban New Jersey in 1985, is both reeling from his father's heart attack and conflicted about what major to declare in the fall. While there, he meets a colorful cast of misfit co-workers and wealthy club members including an alluring art student named Skye and her corporate raider father Getty. Featured Crew David Gordon Green Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig Roberts David Alexandra Socha Skye Paul Reiser Getty Oliver Cooper Wheeler Josh Meyers Barry Full Cast & Crew Current Season Season 3 2017 | 6 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Awesome Open 0 by Anwest\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   2014-02-18 Doll & Em 6.9    2016-06-26 Roadies 5.7    2014-01-13 Uncle 7.3    2016-08-18 I Love Dick 5.2    2015-04-26 HAPPYish 6.9    2014-02-06 Mozart in the Jungle 7.8    2015-07-16 Sex&Drugs&Rock&Roll 4.8    2015-01-11 Togetherness 6.0  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   https://www.amazon.com/dp/B00MR9VX8U Genres Comedy Keywords nostalgia family relationships coming of age growing up 1980s Content Score 100 Yes! Looking good! Top Contributors 43 Elizabeth Jennings 28 Jay Webster 7 lineker s 4 swinkworld  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}