{"link": "https://www.themoviedb.org/tv/4250?language=en", "title": "Last of the Summer Wine", "resume": "Unencumbered by wives, jobs or any other responsibilities, three senior citizens who've never really grown up explore their world in the Yorkshire Dales. They spend their days speculating about their fellow townsfolk and thinking up adventures not usually favored by the elderly.  Last of the Summer Wine premiered as an episode of Comedy Playhouse in 1973. The show ran for 295 episodes until 2010. It is the longest running comedy Britain has produced and the longest running sitcom in the world.", "rate": 65, "genre": ["Comedy", "Drama"], "cast": ["Peter Sallis", "Frank Thornton", "Brian Murphy", "Russ Abbot", "Burt Kwouk"], "character": ["Norman \"Cleggy\" Clegg", "Herbert \"Truly\" Truelove", "Alvin Smedley", "Luther 'Hobbo' Hobdyke", "Entwistle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4250   Expand Last of the Summer Wine   (1973) User Score Overview Unencumbered by wives, jobs or any other responsibilities, three senior citizens who've never really grown up explore their world in the Yorkshire Dales. They spend their days speculating about their fellow townsfolk and thinking up adventures not usually favored by the elderly.  Last of the Summer Wine premiered as an episode of Comedy Playhouse in 1973. The show ran for 295 episodes until 2010. It is the longest running comedy Britain has produced and the longest running sitcom in the world. Featured Crew Roy Clarke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  11 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Peter Sallis Norman \"Cleggy\" Clegg Frank Thornton Herbert \"Truly\" Truelove Brian Murphy Alvin Smedley Russ Abbot Luther 'Hobbo' Hobdyke Burt Kwouk Entwistle Full Cast & Crew Last Season Season 31 2010 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   1984-01-29 Ever Decreasing Circles 6.5    1986-09-01 Brush Strokes 7.8    1981-12-24 The Kenny Everett Television Show 7.0    1993-09-21 The Smell of Reeves and Mortimer 7.7    1986-01-14 Boon 4.8    1978-11-10 Butterflies 6.9    1977-04-12 Citizen Smith 7.6    1993-01-27 The Detectives 7.1  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006q3h0 Genres Comedy Drama Keywords northern england village retirement yorkshire rural setting english countryside sitcom british humour Content Score 93 Almost there... Top Contributors A 275 AndyGoddard 23 lineker O 21 Ozbourne 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}