{"link": "https://www.themoviedb.org/tv/943?language=en", "title": "Robot Wars", "resume": "Robot Wars was a British game show modelled on a US-based competition of the same name. It was broadcast on BBC Two from 1998 until 2003, with its final series broadcast on Channel 5 in 2003 and 2004. Additional series were filmed for specific sectors of the global market, including two series of Robot Wars Extreme Warriors with U.S. competitors for the TNN network, and two of Dutch Robot Wars for distribution in the Netherlands. The fourth series of the UK Robot Wars was brought to the United States on TNN as Robot Wars: Grand Champions in 2002, and hosted by Joanie Laurer. In 2003, the roboteers themselves formed The Fighting Robot Association and with their associated event organisers, carry on participating in competitions for new audiences.\nThe series involved teams of amateur and professional roboteers who made their own robots to fight against each other in both friendly and tournament matches. As well as fighting each other, they had to avoid the \"House Robots\", which were not bound by the same weight or weapon limits as the contestants. Robot Wars had peak audiences of 4 million, and was commercially successful in its merchandising.", "rate": 66, "genre": [], "cast": ["Craig Charles", "Jayne Middlemiss"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 943   Expand Robot Wars   (1998) User Score  Play Trailer Overview Robot Wars was a British game show modelled on a US-based competition of the same name. It was broadcast on BBC Two from 1998 until 2003, with its final series broadcast on Channel 5 in 2003 and 2004. Additional series were filmed for specific sectors of the global market, including two series of Robot Wars Extreme Warriors with U.S. competitors for the TNN network, and two of Dutch Robot Wars for distribution in the Netherlands. The fourth series of the UK Robot Wars was brought to the United States on TNN as Robot Wars: Grand Champions in 2002, and hosted by Joanie Laurer. In 2003, the roboteers themselves formed The Fighting Robot Association and with their associated event organisers, carry on participating in competitions for new audiences. The series involved teams of amateur and professional roboteers who made their own robots to fight against each other in both friendly and tournament matches. As well as fighting each other, they had to avoid the \"House Robots\", which were not bound by the same weight or weapon limits as the contestants. Robot Wars had peak audiences of 4 million, and was commercially successful in its merchandising. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig Charles Jayne Middlemiss Full Cast & Crew Last Season Season 7 2003 | 22 Episodes Season 7 of Robot Wars premiered on November  2, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1998-04-12 Scrapheap Challenge 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres No genres have been added. Keywords robot fighting Content Score 56 We're so close, yet so far. Top Contributors R 4 Rebecca 2 Chiall 2 tigru89 Y 2 YRV  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}