{"link": "https://www.themoviedb.org/tv/2543?language=en", "title": "The Persuaders!", "resume": "The Persuaders! is a 1971 action/adventure series, produced by ITC Entertainment for initial broadcast on ITV and ABC. It has been called \"the last major entry in the cycle of adventure series that had begun eleven years earlier with Danger Man in 1960\", as well as \"the most ambitious and most expensive of Sir Lew Grade's international action adventure series\". The Persuaders Series was filmed in France, Italy and England between May 1970 and June 1971.\nDespite its focus on the British and American markets, the show was popular elsewhere. It won its highest awards from Australia and Spain, while Roger Moore and Tony Curtis were decorated in Germany and France for their acting. It persists in the memory of European filmmakers and audiences, having been casually referenced in 21st century productions from Sweden, France, Britain and Germany.", "rate": 80, "genre": ["Action", "Adventure", "Comedy"], "cast": ["Tony Curtis", "Roger Moore", "Laurence Naismith"], "character": ["Danny Wilde", "Lord Brett Sinclair", "Judge Fulton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2543   Expand The Persuaders!   (1971) User Score Overview The Persuaders! is a 1971 action/adventure series, produced by ITC Entertainment for initial broadcast on ITV and ABC. It has been called \"the last major entry in the cycle of adventure series that had begun eleven years earlier with Danger Man in 1960\", as well as \"the most ambitious and most expensive of Sir Lew Grade's international action adventure series\". The Persuaders Series was filmed in France, Italy and England between May 1970 and June 1971. Despite its focus on the British and American markets, the show was popular elsewhere. It won its highest awards from Australia and Spain, while Roger Moore and Tony Curtis were decorated in Germany and France for their acting. It persists in the memory of European filmmakers and audiences, having been casually referenced in 21st century productions from Sweden, France, Britain and Germany. Featured Crew Robert S. Baker Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tony Curtis Danny Wilde Roger Moore Lord Brett Sinclair Laurence Naismith Judge Fulton Full Cast & Crew Last Season Season 1 1971 | 24 Episodes Season 1 of The Persuaders! premiered on September 17, 1971. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  7 Recommendations   1962-10-04 The Saint 7.2    1974-09-11 Petrocelli 7.8    1982-09-26 Matt Houston 6.6    1979-10-29 Minder 8.6    1967-09-10 The High Chaparral 8.3    1973-02-05 The Wombles 8.7    1976-10-22 The New Avengers 7.6    1968-09-22 Land of the Giants 6.3  Facts Status  Ended Networks Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  English Runtime  50m, 60m, 49m Homepage  - Genres Action & Adventure Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 15 rcorra68 M 8 Mistaya 6 zoltan140 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}