{"link": "https://www.themoviedb.org/tv/31677?language=en", "title": "30 for 30", "resume": "30 for 30 is the umbrella title for a series of documentary films airing on ESPN and its sister networks and online properties. The series, which highlights people and events in the sports world that have generally received small amounts of attention, has featured two \"volumes\" of 30 episodes each, a 13-episode series under the ESPN Films Presents title in 2011-2012, and a series of 30 for 30 Shorts shown through the ESPN.com website.", "rate": 75, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31677   Expand 30 for 30   (2009) User Score Overview 30 for 30 is the umbrella title for a series of documentary films airing on ESPN and its sister networks and online properties. The series, which highlights people and events in the sports world that have generally received small amounts of attention, has featured two \"volumes\" of 30 episodes each, a 13-episode series under the ESPN Films Presents title in 2011-2012, and a series of 30 for 30 Shorts shown through the ESPN.com website. Featured Crew Bill Simmons Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Volume 3 2015 | 31 Episodes Season 3 of 30 for 30 premiered on October 13, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for 30 for 30. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  5 Recommendations   2013-11-12 A Crime to Remember 5.9    1998-09-22 Sports Night 7.1    2008-06-28 Wipeout 5.5    2011-01-19 Restaurant: Impossible 5.7    2000-12-30 Harvey Birdman, Attorney at Law 7.7    2008-06-08 When We Left Earth: The NASA Missions 8.4    2001-11-08 The Tick 7.4    2008-12-03 Man v. Food 6.7  Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  60m, 90m, 120m Homepage   http://www.espn.com/30for30/ Genres Documentary Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 5 United600 TB 5 TMDb Bot MG 4 Melanie Guevara r 4 rodin  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}