{"link": "https://www.themoviedb.org/tv/66389?language=en", "title": "Submission", "resume": "This tantalizing new series chronicles the sexual awakening of the beautiful but unfulfilled Ashley, when she discovers the popular erotic novel \"SLAVE\" by Nolan Keats. However, her fascination with the mysterious Mr. Keats leads her into a sexy but dangerous love triangle, where not everyone is who they appear to be and where fantasies are no longer just words in a book.\nPart romantic drama, part mystery, this tale of seduction, obsession and sexual power from acclaimed writer/director Jacky St. James will leave you breathless and begging for more.\nWhat's your safeword?", "rate": 54, "genre": ["Drama", "Mystery"], "cast": ["Ashlynn Yennie", "Justin Berti", "Skin Diamond", "Victoria Levine", "Kevin Nelson"], "character": ["Ashley", "Elliott", "Dylan", "Jules", "Raif"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 66389   Expand Submission   (2016) User Score Overview This tantalizing new series chronicles the sexual awakening of the beautiful but unfulfilled Ashley, when she discovers the popular erotic novel \"SLAVE\" by Nolan Keats. However, her fascination with the mysterious Mr. Keats leads her into a sexy but dangerous love triangle, where not everyone is who they appear to be and where fantasies are no longer just words in a book. Part romantic drama, part mystery, this tale of seduction, obsession and sexual power from acclaimed writer/director Jacky St. James will leave you breathless and begging for more. What's your safeword? Featured Crew Jacky St. James Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  14 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ashlynn Yennie Ashley Justin Berti Elliott Skin Diamond Dylan Victoria Levine Jules Kevin Nelson Raif Full Cast & Crew Last Season Season 1 2016 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  14 Posters  11 Recommendations   2017-11-05 SMILF 6.7    2018-02-16 Everything Sucks! 7.8    2016-03-07 Damien 6.5    2007-09-19 Gossip Girl 6.3    2012-04-14 The Legend of Korra 7.9    2013-04-12 Da Vinci's Demons 7.2    2016-09-19 The Good Place 7.8    2013-09-16 Sleepy Hollow 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://www.sho.com/sho/submission/home Genres Drama Mystery Keywords sex nudity adult bdsm Content Score 93 Almost there... Top Contributors D 33 Dirk1313 b 26 broccoli7 14 Elizabeth Jennings H 11 Halima  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}