{"link": "https://www.themoviedb.org/tv/10309?language=en", "title": "McCloud", "resume": "McCloud is an American television police drama that aired on NBC from 1970 to 1977. The title role is played by Dennis Weaver as Marshal Sam McCloud, a law officer from Taos, New Mexico, on semi-permanent \"special assignment\" with the New York City Police Department.", "rate": 73, "genre": ["Drama"], "cast": ["Dennis Weaver", "J. D. Cannon", "Terry Carter", "Ken Lynch"], "character": ["Sam McCloud"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10309   Expand McCloud   (1970) User Score Overview McCloud is an American television police drama that aired on NBC from 1970 to 1977. The title role is played by Dennis Weaver as Marshal Sam McCloud, a law officer from Taos, New Mexico, on semi-permanent \"special assignment\" with the New York City Police Department. Featured Crew Herman Miller Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dennis Weaver Sam McCloud J. D. Cannon Terry Carter Ken Lynch Full Cast & Crew Last Season Season 7 1976 | 6 Episodes Season 7 of McCloud premiered on October 24, 1976. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1973-10-24 Kojak 7.4    1967-03-28 Ironside 6.8    1972-09-16 The Streets of San Francisco 7.1    1968-01-09 It Takes a Thief 7.4    1979-09-22 Hart to Hart 6.5    1962-10-04 The Saint 7.2    1971-09-17 McMillan & Wife 7.2    1967-09-16 Mannix 6.5  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Drama Keywords new york police u.s. marshal nypd Content Score 93 Almost there... Top Contributors 12 Banana 3 Daemon S 2 Samara 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}