{"link": "https://www.themoviedb.org/tv/17287?language=en", "title": "Party Down", "resume": "Party Down is an American comedy television series that follows a Los Angeles, California, catering team for the titular company. The sextet of aspiring Hollywood actors and writers, as well as drifting lost souls, work small-time catering gigs while hoping for their break or some positive change in their lives.", "rate": 76, "genre": ["Comedy"], "cast": ["Ken Marino", "Adam Scott", "Lizzy Caplan", "Ryan Hansen", "Martin Starr"], "character": ["Ron Donald", "Henry Pollard", "Casey Klein", "Kyle Bradway", "Roman DeBeers"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 17287   Expand Party Down   (2009) User Score  Play Trailer Overview Party Down is an American comedy television series that follows a Los Angeles, California, catering team for the titular company. The sextet of aspiring Hollywood actors and writers, as well as drifting lost souls, work small-time catering gigs while hoping for their break or some positive change in their lives. Featured Crew Paul Rudd Creator John Enbom Creator Dan Etheridge Creator Rob Thomas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Marino Ron Donald Adam Scott Henry Pollard Lizzy Caplan Casey Klein Ryan Hansen Kyle Bradway Martin Starr Roman DeBeers Full Cast & Crew Last Season Season 2 2010 | 10 Episodes Season 2 of Party Down premiered on April 22, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  8 Recommendations   2009-09-20 Bored to Death 7.4    2009-02-15 Eastbound & Down 7.4    2001-09-25 Undeclared 7.2    2010-10-01 The Increasingly Poor Decisions of Todd Margaret 7.0    2010-06-29 Louie 7.7    2009-10-29 The League 7.1    2009-04-09 Parks and Recreation 7.9    2005-08-04 It's Always Sunny in Philadelphia 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.starz.com/originals/PartyDown Genres Comedy Keywords hollywood food industry caterer aspiring actor sitcom workplace comedy Content Score 100 Yes! Looking good! Top Contributors 20 Banana 10 United600 s 3 speedycars z 3 zeil  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}