{"link": "https://www.themoviedb.org/tv/63328?language=en", "title": "Grandfathered", "resume": "A comedy about coming of age - at any age - Grandfathered stars John Stamos as the ultimate bachelor whose life is turned upside down when he discovers he's not only a father, but a grandfather.", "rate": 70, "genre": ["Comedy"], "cast": ["John Stamos", "Josh Peck", "Paget Brewster", "Kelly Jenrette", "Ravi Patel"], "character": ["Jimmy Martino", "Gerald", "Sara", "Annelise", "Chef Ken"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63328   Expand Grandfathered   (2015) User Score Overview A comedy about coming of age - at any age - Grandfathered stars John Stamos as the ultimate bachelor whose life is turned upside down when he discovers he's not only a father, but a grandfather. Featured Crew Daniel Chun Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Stamos Jimmy Martino Josh Peck Gerald Paget Brewster Sara Kelly Jenrette Annelise Ravi Patel Chef Ken Full Cast & Crew Last Season Season 1 2015 | 22 Episodes Season 1 of Grandfathered premiered on September 29, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2015-01-13 Cockroaches 6.0    2016-03-01 Loosely Exactly Nicole 5.8    2005-06-05 The Comeback 7.6    2015-12-07 Telenovela 7.2    2015-08-05 Difficult People 7.4    2013-09-26 The Michael J. Fox Show 5.6    2016-06-14 Uncle Buck 5.7    2016-01-03 Cooper Barrett's Guide to Surviving Life 5.1  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.fox.com/grandfathered Genres Comedy Keywords parent child relationship grandfather coming of age confirmed bachelor sitcom Content Score 93 Almost there... Top Contributors 42 Elizabeth Jennings 11 Banana z 9 zyck 4 Jaime Neto  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}