{"link": "https://www.themoviedb.org/tv/38967?language=en", "title": "Magic City", "resume": "Set in 1959 Miami, Florida shortly after the Cuban Revolution, Magic City tells the story of Ike Evans, the owner of Miami's most glamorous hotel, the Miramar Playa. Evans is forced to make an ill-fated deal with Miami mob boss Ben Diamond to ensure the success of his glitzy establishment.", "rate": 71, "genre": ["Drama"], "cast": ["Jeffrey Dean Morgan", "Olga Kurylenko", "Steven Strait", "Jessica Marais", "Christian Cooke"], "character": ["Ike Evans", "Vera Evans", "Stevie Evans", "Lily Diamond", "Danny Evans"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38967   Expand Magic City   (2012) User Score  Play Trailer Overview Set in 1959 Miami, Florida shortly after the Cuban Revolution, Magic City tells the story of Ike Evans, the owner of Miami's most glamorous hotel, the Miramar Playa. Evans is forced to make an ill-fated deal with Miami mob boss Ben Diamond to ensure the success of his glitzy establishment. Featured Crew Mitch Glazer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  17 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jeffrey Dean Morgan Ike Evans Olga Kurylenko Vera Evans Steven Strait Stevie Evans Jessica Marais Lily Diamond Christian Cooke Danny Evans Full Cast & Crew Last Season Season 2 2013 | 8 Episodes Season 2 of Magic City premiered on June 14, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  17 Posters  8 Recommendations   2015-05-25 Texas Rising 6.4    2012-09-25 Vegas 7.4    2016-10-16 Bordertown 7.5    2015-04-05 American Odyssey 6.7    2014-03-10 Believe 6.3    2010-09-21 Detroit 1-8-7 7.2    2007-03-15 Raines 7.3    2015-03-25 Big Time in Hollywood, Fl 5.7  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  50m Homepage   http://www.starz.com/originals/magiccity Genres Drama Keywords hotel miami gangster organized crime period drama 1960s Content Score 100 Yes! Looking good! Top Contributors 68 Marr 🇳🇱 45 Elizabeth Jennings 21 Banana 5 rantamplan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}