{"link": "https://www.themoviedb.org/tv/60846?language=en", "title": "Log Horizon", "resume": "The story begins when 30,000 Japanese gamers are trapped in the fantasy online game world Elder Tale. What was once a sword-and-sorcery world is now the real world. The main lead Shiroe attempts to survive with his old friend Naotsugu and the beautiful assassin Akatsuki.", "rate": 82, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Takuma Terashima", "Tomoaki Maeno", "Emiri Kato", "Jouji Nakata", "Daiki Yamashita"], "character": ["Shiroe", "Naotsugu", "Akatsuki", "Nyanta", "Tohya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60846   Expand Log Horizon   (2013) User Score Overview The story begins when 30,000 Japanese gamers are trapped in the fantasy online game world Elder Tale. What was once a sword-and-sorcery world is now the real world. The main lead Shiroe attempts to survive with his old friend Naotsugu and the beautiful assassin Akatsuki. Featured Crew Mamare Touno Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Takuma Terashima Shiroe Tomoaki Maeno Naotsugu Emiri Kato Akatsuki Jouji Nakata Nyanta Daiki Yamashita Tohya Full Cast & Crew Last Season Season 2 2014 | 25 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  3 Recommendations   2015-07-05 Charlotte 6.8    2011-01-11 Is This a Zombie? 7.7    2012-10-12 Robotics;Notes 4.7    2014-04-05 The Irregular at Magic High School 6.8    2014-10-07 Yona of the Dawn 7.5    2017-07-11 In Another World With My Smartphone 9.2    2013-04-07 Gargantia on the Verdurous Planet 6.8    2008-07-02 Sekirei 7.7  Facts Original Name  ログ・ホライズン Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://mamare.net/works/loghorizon/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords fantasy virtual reality alternate world rpg shounen based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 44 sp1ti 33 benf45 29 WillofOwn 20 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}