{"link": "https://www.themoviedb.org/tv/2286?language=en", "title": "The Real Ghostbusters", "resume": "The Real Ghostbusters is an American animated television series spun-off from the Ghostbusters franchise. The series ran from 1986 to 1991, and was produced by Columbia Pictures Television, DiC Enterprises, and Coca-Cola Telecommunications. \"The Real\" was added to the title after a dispute with Filmation and its Ghost Busters properties. The series continues the adventures of paranormal investigators Dr. Peter Venkman, Dr. Egon Spengler, Dr. Ray Stantz, Winston Zeddemore, their secretary Janine Melnitz and their mascot ghost Slimer.\nThere also were two ongoing Real Ghostbusters comics, one published monthly by Now Comics in USA and the other published weekly by Marvel Comics in the United Kingdom, and a popular toy line manufactured by Kenner.", "rate": 71, "genre": ["Action", "Adventure", "Animation", "Comedy", "Mystery"], "cast": ["Arsenio Hall", "Dave Coulier", "Kath Soucie", "Buster Jones", "Rodger Bumpass"], "character": ["Winston Zeddemore", "Peter Venkman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2286   Expand The Real Ghostbusters   (1986) User Score Overview The Real Ghostbusters is an American animated television series spun-off from the Ghostbusters franchise. The series ran from 1986 to 1991, and was produced by Columbia Pictures Television, DiC Enterprises, and Coca-Cola Telecommunications. \"The Real\" was added to the title after a dispute with Filmation and its Ghost Busters properties. The series continues the adventures of paranormal investigators Dr. Peter Venkman, Dr. Egon Spengler, Dr. Ray Stantz, Winston Zeddemore, their secretary Janine Melnitz and their mascot ghost Slimer. There also were two ongoing Real Ghostbusters comics, one published monthly by Now Comics in USA and the other published weekly by Marvel Comics in the United Kingdom, and a popular toy line manufactured by Kenner. Featured Crew Harold Ramis Creator Dan Aykroyd Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  10 Posters  9 Videos Trailers  0 Teasers  0 Clips  1 Featurettes  0 Opening Credits  1 Top Billed Cast Arsenio Hall Winston Zeddemore Dave Coulier Peter Venkman Kath Soucie Buster Jones Rodger Bumpass Full Cast & Crew Last Season Season 7 1991 | 4 Episodes Season 7 of The Real Ghostbusters premiered on September 14, 1991. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Real Ghostbusters. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  10 Posters  9 Recommendations   1985-09-09 She-Ra: Princess of Power 6.2    1990-09-10 Captain Planet and the Planeteers 5.9    1983-09-05 He-Man and the Masters of the Universe 7.1    1991-09-07 Taz-Mania 6.3    1997-09-01 Extreme Ghostbusters 6.0    1986-09-17 Filmation's Ghostbusters 5.7    1989-03-05 Chip 'n Dale Rescue Rangers 7.1    1987-09-10 Teenage Mutant Ninja Turtles 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage  - Genres Action & Adventure Animation Comedy Mystery Keywords ghostbuster paranormal paranormal investigation ghost based on movie Content Score 100 Yes! Looking good! Top Contributors R 30 Rebecca t 14 tmdb493763 9 BlackDelivery 8 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}