{"link": "https://www.themoviedb.org/tv/30901?language=en", "title": "I'm a Celebrity Get Me Out of Here!", "resume": "I'm a Celebrity...Get Me Out of Here! is a British reality television show, first screened in 2002, in which celebrities live in jungle conditions with few creature comforts. The show has been hosted by Ant & Dec since its inception. It is filmed in Murwillumbah, New South Wales, Australia and broadcast on ITV in the UK and on 3e in Ireland. The show is one of the largest in the world, with more than 700 staff working on the show 24 hours a day for three weeks. It is sponsored in the UK by supermarket chain Iceland and in Ireland by MultiTrip.com.", "rate": 50, "genre": ["Comedy"], "cast": ["Anthony McPartlin", "Declan Donnelly"], "character": ["Himself - Co-Host", "Himself - Co-Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 30901   Expand I'm a Celebrity Get Me Out of Here!   (2002) User Score  Play Trailer Overview I'm a Celebrity...Get Me Out of Here! is a British reality television show, first screened in 2002, in which celebrities live in jungle conditions with few creature comforts. The show has been hosted by Ant & Dec since its inception. It is filmed in Murwillumbah, New South Wales, Australia and broadcast on ITV in the UK and on 3e in Ireland. The show is one of the largest in the world, with more than 700 staff working on the show 24 hours a day for three weeks. It is sponsored in the UK by supermarket chain Iceland and in Ireland by MultiTrip.com. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Anthony McPartlin Himself - Co-Host Declan Donnelly Himself - Co-Host Full Cast & Crew Current Season Season 17 2017 | 23 Episodes Season 17 of I'm a Celebrity Get Me Out of Here! premiered on November 19, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations   1987-09-26 ChuckleVision 6.3    2009-12-02 Steven Seagal: Lawman 5.8    1993-12-27 Shooting Stars 6.7  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.itv.com/celebrity Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors c 44 courtneysmith86 L 36 Leah 6 ancamikos 5 Victor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}