{"link": "https://www.themoviedb.org/tv/7171?language=en", "title": "Going Postal", "resume": "Moist von Lipwig is a con-man with a particular talent-- he is utterly unremarkable. When his execution is stayed in Terry Pratchett's remarkable Discworld, he must work off his debt to society as the land's head Postman. Things are not always as they seem, and soon Lipwig is delivering mail for his very life!", "rate": 73, "genre": ["Comedy"], "cast": ["Richard Coyle", "Tamsin Greig", "Charles Dance", "Andrew Sachs", "Steve Pemberton"], "character": ["Moist Von Lipwig", "Miss Cripslock", "Lord Vetinari", "Groat", "Drumknott"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7171   Expand Going Postal   (2010) User Score  Play Trailer Overview Moist von Lipwig is a con-man with a particular talent-- he is utterly unremarkable. When his execution is stayed in Terry Pratchett's remarkable Discworld, he must work off his debt to society as the land's head Postman. Things are not always as they seem, and soon Lipwig is delivering mail for his very life! Featured Crew Terry Pratchett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  13 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Coyle Moist Von Lipwig Tamsin Greig Miss Cripslock Charles Dance Lord Vetinari Andrew Sachs Groat Steve Pemberton Drumknott Full Cast & Crew Last Season Miniseries 2010 | 2 Episodes Season 1 of Going Postal premiered on May 30, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  11 Posters  13 Recommendations   2008-03-23 The Colour of Magic 6.5    2010-07-12 The Silence 6.8    2004-07-19 The Grid 7.0    2011-06-06 Injustice 7.3    2006-01-01 In Justice 6.8    2015-04-15 The Delivery Man 6.5    2013-09-05 The Guilty 7.0    30 Days of Night: Blood Trails 5.0  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Miniseries Original Language  English Runtime  90m Homepage   http://www.sky1.sky.com/going-postal Genres Comedy Keywords based on novel or book con man postman miniseries fantasy world discworld Content Score 100 Yes! Looking good! Top Contributors TB 60 TMDb Bot 20 Banana A 10 ADASI5001 10 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}