{"link": "https://www.themoviedb.org/tv/1482?language=en", "title": "Spider-Man", "resume": "Spider-Man is an animated television series that ran from September 9, 1967 to June 14, 1970. It was jointly produced in Canada and the United States and was the first animated adaptation of the Spider-Man comic book series, created by writer Stan Lee and artist Steve Ditko. It first aired on the ABC television network in the United States but went into syndication at the start of the third season. Grantray-Lawrence Animation produced the first season. Seasons 2 and 3 were crafted by producer Ralph Bakshi in New York City. In Canada, it is currently airing on Teletoon Retro. An internet meme, commonly known as 1960s Spiderman, regarding the series has received an overwhelming amount of popularity. The meme consists of a screenshot taken at a random part of the series and adding an inappropriate and/or witty text. Since the death of Max Ferguson on March 7 2013, there are only three surviving members from the cast. Those three being Paul Soles the voice of Spider-Man, Chris Wiggins the voice of Mysterio and Carl Banas the voice of the Scorpion.", "rate": 73, "genre": ["Animation", "Action", "Adventure"], "cast": ["Alfie Scopp", "Billie Mae Richards", "Corinne Conley", "Larry D. Mann", "Len Carlson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1482   Expand Spider-Man   (1967) User Score Overview Spider-Man is an animated television series that ran from September 9, 1967 to June 14, 1970. It was jointly produced in Canada and the United States and was the first animated adaptation of the Spider-Man comic book series, created by writer Stan Lee and artist Steve Ditko. It first aired on the ABC television network in the United States but went into syndication at the start of the third season. Grantray-Lawrence Animation produced the first season. Seasons 2 and 3 were crafted by producer Ralph Bakshi in New York City. In Canada, it is currently airing on Teletoon Retro. An internet meme, commonly known as 1960s Spiderman, regarding the series has received an overwhelming amount of popularity. The meme consists of a screenshot taken at a random part of the series and adding an inappropriate and/or witty text. Since the death of Max Ferguson on March 7 2013, there are only three surviving members from the cast. Those three being Paul Soles the voice of Spider-Man, Chris Wiggins the voice of Mysterio and Carl Banas the voice of the Scorpion. Featured Crew Krantz Films, Inc. Creator Steve Ditko Creator Stan Lee Creator Grantray-Lawrence Animation Creator Ralph Bakshi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alfie Scopp Billie Mae Richards Corinne Conley Larry D. Mann Len Carlson Full Cast & Crew Last Season (1967) season 3 1970 | 13 Episodes Season 3 of Spider-Man premiered on March 22, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1979-09-22 Spider-Woman 6.7    1981-09-12 Spider-Man and His Amazing Friends 6.7    Silver Surfer: The Animated Series 7.7    1991-09-14 Captain N and the New Super Mario World 4.7    1977-02-10 The New Adventures of Batman 6.0    1982-09-18 The Incredible Hulk 8.2    2003-07-11 Spider-Man: The New Animated Series 6.5    1988-10-01 Dino-Riders 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://marvel.toonzone.net/spidey67/ Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 4 Jaime Neto D 2 Daniel 2 BlackDelivery N 1 Notamymerrick  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}