{"link": "https://www.themoviedb.org/tv/61263?language=en", "title": "Hand of God", "resume": "A morally corrupt judge suffers a breakdown and believes that God is speaking directly to him, compelling him onto a path of vigilante justice.", "rate": 68, "genre": ["Drama"], "cast": ["Ron Perlman", "Dana Delany", "Garret Dillahunt", "Elizabeth McLaughlin"], "character": ["Judge Pernell Harris", "Crystal Harris", "KD", "Alicia Hopkins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61263   Expand Hand of God   (2014) User Score  Play Trailer Overview A morally corrupt judge suffers a breakdown and believes that God is speaking directly to him, compelling him onto a path of vigilante justice. Featured Crew Ben Watkins Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  4 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ron Perlman Judge Pernell Harris Dana Delany Crystal Harris Garret Dillahunt KD Elizabeth McLaughlin Alicia Hopkins Full Cast & Crew Last Season Season 2 2017 | 10 Episodes Season 2 of Hand of God premiered on March 10, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply great show! Open 5 by  rumble88 Go to Discussions Media Most Popular Videos  2 Backdrops  4 Posters  3 Recommendations   2016-01-22 Stan Lee's Lucky Man 7.3    2011-06-06 Injustice 7.3    2011-09-14 Free Agents 4.8    2006-01-01 In Justice 6.8    2014-02-06 Bosch 7.9    2017-01-25 Mary Kills People 7.5    2015-08-07 Sneaky Pete 7.9    2011-01-13 Kidnap and Ransom 7.6  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m Homepage   http://www.amazon.com/Pilot-HD/dp/B00MR9UWVO Genres Drama Keywords corruption judge god Content Score 100 Yes! Looking good! Top Contributors 35 Elizabeth Jennings 13 lewisq94 z 5 zurman1 R 4 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}