{"link": "https://www.themoviedb.org/tv/5885?language=en", "title": "The Colour of Magic", "resume": "Terry Pratchett's The Colour of Magic is a two-part television adaptation of the bestselling novels The Colour of Magic and The Light Fantastic by Terry Pratchett. The fantasy film was produced for Sky One by The Mob, a small British studio, starring David Jason, Sean Astin, Tim Curry and Christopher Lee as the voice of Death. Vadim Jean both adapted the screenplay from Pratchett's original novels, and served as director.\nTerry Pratchett's The Colour of Magic was broadcast on Sky One, and in High Definition on Sky One HD, on Easter Sunday and 24 March 2008. The first part drew audiences of 1.5 million, with the second part attracting up to 1.1 million viewers. The film was well received by fans, but drew mixed reviews from critics, who generally praised the acting talent of the all-star cast, but criticised the film's script and direction.\nThe production is the second adaptation of Pratchett's novels as a live-action film, following the successful release of Hogfather on Sky One over Christmas 2006. A third adaptation, Going Postal, followed in 2010 with more planned for the future.", "rate": 67, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy", "Comedy"], "cast": ["David Jason", "Sean Astin", "Christopher Lee", "Tim Curry", "Jeremy Irons"], "character": ["Rincewind", "Zweiblum", "Tod (Sprechrolle)", "Trymon", "Patrizier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5885   Expand The Colour of Magic   (2008) User Score Overview Terry Pratchett's The Colour of Magic is a two-part television adaptation of the bestselling novels The Colour of Magic and The Light Fantastic by Terry Pratchett. The fantasy film was produced for Sky One by The Mob, a small British studio, starring David Jason, Sean Astin, Tim Curry and Christopher Lee as the voice of Death. Vadim Jean both adapted the screenplay from Pratchett's original novels, and served as director. Terry Pratchett's The Colour of Magic was broadcast on Sky One, and in High Definition on Sky One HD, on Easter Sunday and 24 March 2008. The first part drew audiences of 1.5 million, with the second part attracting up to 1.1 million viewers. The film was well received by fans, but drew mixed reviews from critics, who generally praised the acting talent of the all-star cast, but criticised the film's script and direction. The production is the second adaptation of Pratchett's novels as a live-action film, following the successful release of Hogfather on Sky One over Christmas 2006. A third adaptation, Going Postal, followed in 2010 with more planned for the future. Featured Crew Terry Pratchett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  12 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Jason Rincewind Sean Astin Zweiblum Christopher Lee Tod (Sprechrolle) Tim Curry Trymon Jeremy Irons Patrizier Full Cast & Crew Last Season Miniseries 2008 | 2 Episodes Season 1 of The Colour of Magic premiered on March 23, 2008. View All Seasons Social Reviews  1 Discussions  0 Featured Review A review by Reno  7.0 Written by  Reno  on June 14, 2016 A Discworld adventure: Beyond space and imagination! It is a 2 episode television mini-series adapted from a fantasy novel of the same name. If you have already seen 'The Lord of the Rings' and 'Harry Potter' films, then won't get excited while watching it. But it is not a bad film, that made par with the television quality. Visually acceptable, but the performances and locations were good. It was a decent story, but mostly cliched. Inspired by middle age about the understanding of the earth and the universe. The world is flat and circular, where different kingdoms across all the contin...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  6 Posters  12 Recommendations   2010-05-30 Going Postal 7.0    1997-05-18 Wyrd Sisters 6.2    2009-04-19 La prophétie de l'Oracle 4.8    2002-10-31 Värsta språket 6.0    1999-01-18 Parlamentet 3.0    2013-11-07 Folkets främsta företrädare 5.0    2011-01-06 The Reckoning 3.7    2016-04-25 After the Thrones 4.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  189m Homepage   http://www.skyoneonline.co.uk/tcom/index.html Genres Action & Adventure Sci-Fi & Fantasy Comedy Keywords based on novel or book magic dragon university discworld Content Score 93 Almost there... Top Contributors TB 50 TMDb Bot DS 37 Dominik Stolz t 7 tmdb45070722 t 6 tmdb42368388  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}