{"link": "https://www.themoviedb.org/tv/318?language=en", "title": "American Gothic", "resume": "American Gothic is an American horror series created by Shaun Cassidy and executive produced by Sam Raimi. The show first aired on CBS on September 22, 1995, and was canceled after a single season on July 11, 1996.", "rate": 77, "genre": ["Sci-Fi", "Fantasy", "Drama", "Horror"], "cast": ["Gary Cole", "Lucas Black", "Paige Turco", "Brenda Bakke", "Sarah Paulson"], "character": ["Sheriff Lucas Buck", "Caleb Temple", "Gail Emory", "Selena Coombs", "Merlyn Temple"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 318   Expand American Gothic   (1995) User Score Overview American Gothic is an American horror series created by Shaun Cassidy and executive produced by Sam Raimi. The show first aired on CBS on September 22, 1995, and was canceled after a single season on July 11, 1996. Featured Crew Shaun Cassidy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gary Cole Sheriff Lucas Buck Lucas Black Caleb Temple Paige Turco Gail Emory Brenda Bakke Selena Coombs Sarah Paulson Merlyn Temple Full Cast & Crew Last Season Season 1 1995 | 22 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply American Gothic Fans - Hello! Open 0 by Maureen Mobbs\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  1 Recommendations   2005-09-29 Night Stalker 2.7    1996-09-21 Dark Skies 7.6    2002-09-29 Boomtown 8.4    2003-12-03 Extreme Makeover: Home Edition 4.6    1986-10-06 The Trap Door 7.3    2003-07-11 Spider-Man: The New Animated Series 6.5    1987-09-25 Beauty and the Beast 7.4    2004-08-31 Dog the Bounty Hunter 3.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage   http://www.americangothicdvd.com/ Genres Sci-Fi & Fantasy Drama Horror Keywords small town serial killer rapist evil ghost small town sheriff Content Score 93 Almost there... Top Contributors 15 Banana 11 OzDrDj 4 efeka S 4 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}