{"link": "https://www.themoviedb.org/tv/1574?language=en", "title": "Four Tank-Men and a Dog", "resume": "Czterej pancerni i pies was a Polish black and white TV series based on the book by Janusz Przymanowski. Made between 1966 and 1970, the series is composed of 21 episodes of 55 minutes each, divided into three seasons. It is set in 1944 and 1945, during World War II, and follows the adventures of a tank crew and their T-34 tank in the 1st Polish Army. Although both the book and the TV series contain elements of pro-Soviet propaganda, they have achieved and retain a cult series status in Poland, Soviet Union and other Eastern Bloc countries.\nThe T-34 tank Rudy with the identifying number \"102\", a German Shepherd dog from Siberia Szarik and to a lesser extent the crew Jan Kos, Gustaw Jeleń, Grigorij Saakaszwili, Tomasz Czereśniak, and their commander and mentor Olgierd Jarosz, as well as other heroes of the series, have become icons in Polish popular culture.", "rate": 78, "genre": ["Action", "Adventure", "War", "Politics"], "cast": ["Janusz Gajos", "Franciszek Pieczka", "Wlodzimierz Press", "Wieslaw Golas", "Witold Pyrkosz"], "character": ["Janek", "Gustlik", "Sgt. Grigorij Saakaszwili", "Pvt. Tomek Czeresniak", "Cpl. Franek Wichura"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1574   Expand Four Tank-Men and a Dog   (1966) User Score Overview Czterej pancerni i pies was a Polish black and white TV series based on the book by Janusz Przymanowski. Made between 1966 and 1970, the series is composed of 21 episodes of 55 minutes each, divided into three seasons. It is set in 1944 and 1945, during World War II, and follows the adventures of a tank crew and their T-34 tank in the 1st Polish Army. Although both the book and the TV series contain elements of pro-Soviet propaganda, they have achieved and retain a cult series status in Poland, Soviet Union and other Eastern Bloc countries. The T-34 tank Rudy with the identifying number \"102\", a German Shepherd dog from Siberia Szarik and to a lesser extent the crew Jan Kos, Gustaw Jeleń, Grigorij Saakaszwili, Tomasz Czereśniak, and their commander and mentor Olgierd Jarosz, as well as other heroes of the series, have become icons in Polish popular culture. Featured Crew Andrzej Czekalski Creator Konrad Nałęcki Creator Janusz Przymanowski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Janusz Gajos Janek Franciszek Pieczka Gustlik Wlodzimierz Press Sgt. Grigorij Saakaszwili Wieslaw Golas Pvt. Tomek Czeresniak Witold Pyrkosz Cpl. Franek Wichura Full Cast & Crew Last Season Season 3 1970 | 6 Episodes Season 3 of Four Tank-Men and a Dog premiered on April  8, 1970. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  7 Recommendations   1968-10-10 Stawka większa niż życie 7.8  Facts Original Name  Czterej pancerni i pies Status  Ended Network Certification  - Type  Scripted Original Language  Polish Runtime  55m Homepage   http://www.tvp.pl/seriale/archiwalne/czterej-pancerni-i-pies Genres Action & Adventure War & Politics Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors j 17 jkdobro I 8 IronShaft D 7 Daniel j 6 jzvc  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}