{"link": "https://www.themoviedb.org/tv/67597?language=en", "title": "Coup de foudre", "resume": "The dating show Coup de foudre is back! Extremely popular in the 90’s, the format will remain the same but be revamped au « goût du jour »! The concept is very simple: make a perfect match between 3 men and 3 women looking for love! Candidates answer to questions and participate to several role playing during the show without seeing each other. At the end of each show, we find out if there is a possibility of Coup de foudre when they see each other? Do they like what they see?", "rate": 29, "genre": [], "cast": ["Mathieu Baron"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67597   Expand Coup de foudre   (2016) User Score Overview The dating show Coup de foudre is back! Extremely popular in the 90’s, the format will remain the same but be revamped au « goût du jour »! The concept is very simple: make a perfect match between 3 men and 3 women looking for love! Candidates answer to questions and participate to several role playing during the show without seeing each other. At the end of each show, we find out if there is a possibility of Coup de foudre when they see each other? Do they like what they see? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mathieu Baron Himself - Host Full Cast & Crew Last Season Season 2 2017 | 60 Episodes Season 2 of Coup de foudre premiered on September 18, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Coup de foudre. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification C8 Meaning Suitable for children ages 8+. Low level violence and fantasy horror is allowed. No foul language is allowed, but occasional \"socially offensive and discriminatory\" language is allowed if in the context of the story. No sexual content of any level allowed. Type  Scripted Original Language  French Runtime  30m Homepage   http://noovo.ca/emissions/coup-de-foudre/ Genres No genres have been added. Keywords dating show Content Score 50 Still needs a little work. Top Contributors 43 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}