{"link": "https://www.themoviedb.org/tv/39361?language=en", "title": "Awake", "resume": "Michael lives in two separate realities after a car accident. In one reality, his wife Hannah survives the accident; in the other reality, his son Rex survives. Michael does not know which reality is \"real\", and uses the wristbands to differentiate the two. He sees two therapists: Dr. Jonathan Lee in the \"red reality\" and Dr. Judith Evans in the \"green reality\". At work, Michael's erratic behavior triggers clashes with his team; they do not know about Michael's uncanny ability to solve crimes using details from both realities.", "rate": 75, "genre": ["Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Jason Isaacs", "Wilmer Valderrama", "Steve Harris", "Dylan Minnette", "Laura Allen"], "character": ["Michael Britten", "Detective Efrem Vega", "Detective Isaiah 'Bird' Freeman", "Rex Britten", "Hannah Britten"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39361   Expand Awake   (2012) User Score  Play Trailer Overview Michael lives in two separate realities after a car accident. In one reality, his wife Hannah survives the accident; in the other reality, his son Rex survives. Michael does not know which reality is \"real\", and uses the wristbands to differentiate the two. He sees two therapists: Dr. Jonathan Lee in the \"red reality\" and Dr. Judith Evans in the \"green reality\". At work, Michael's erratic behavior triggers clashes with his team; they do not know about Michael's uncanny ability to solve crimes using details from both realities. Featured Crew Kyle Killen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jason Isaacs Michael Britten Wilmer Valderrama Detective Efrem Vega Steve Harris Detective Isaiah 'Bird' Freeman Dylan Minnette Rex Britten Laura Allen Hannah Britten Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Awake premiered on March  1, 2012. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply How is this show? Open 2 by  GrandTardigrade Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  3 Recommendations   2013-10-29 The Escape Artist 7.0    2012-01-25 Touch 6.7    2010-06-07 Persons Unknown 6.4    2009-09-24 FlashForward 6.9    2012-05-27 Continuum 7.1    2012-09-30 666 Park Avenue 6.1    2011-06-05 Case Histories 8.2    2011-09-14 Free Agents 4.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/awake Genres Drama Mystery Sci-Fi & Fantasy Keywords double life detective car accident alternate reality Content Score 100 Yes! Looking good! Top Contributors 19 Elizabeth Jennings j 11 jnylen CM 6 Cherche Moi f 4 furkan-guven0115  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}