{"link": "https://www.themoviedb.org/tv/64049?language=en", "title": "Fight! Kickers", "resume": "Kickers, a soccer club, is a weak team that hardly wins a game. It has recorded 22 consecutive losses up till now. Neither a star player nor a sign of a victory can be found in the team. That's why they begin to lose hopes. But the team quickly changes when Kakeru Daichi, a newcomer to Kitahara Primary School, joins the team! Kakeru loves soccer and his passion towards soccer is overwhelming. He used to be a member of a prestigious soccer team, yet he gives no hint about it. He practices more than anybody in the team. Kakeru's attitude brings back the passion for soccer that the team members have forgotten. The team members support and train each other, and start to win games. This sports animation showing growth of boys is based on soccer, one of the most popular sports in the world.", "rate": 70, "genre": ["Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64049   Expand Fight! Kickers   (1986) User Score Overview Kickers, a soccer club, is a weak team that hardly wins a game. It has recorded 22 consecutive losses up till now. Neither a star player nor a sign of a victory can be found in the team. That's why they begin to lose hopes. But the team quickly changes when Kakeru Daichi, a newcomer to Kitahara Primary School, joins the team! Kakeru loves soccer and his passion towards soccer is overwhelming. He used to be a member of a prestigious soccer team, yet he gives no hint about it. He practices more than anybody in the team. Kakeru's attitude brings back the passion for soccer that the team members have forgotten. The team members support and train each other, and start to win games. This sports animation showing growth of boys is based on soccer, one of the most popular sports in the world. Featured Crew Akira Shigino Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1986 | 26 Episodes Season 1 of Fight! Kickers premiered on October 15, 1986. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Fight! Kickers. You can help by rating TV shows you've seen. Facts Original Name  がんばれ!キッカーズ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://pierrot.jp/archives/tv_list_1985/tv_014.html Genres Animation Kids Keywords soccer anime Content Score 71 Just a little bit more... Top Contributors W 14 Webfighter M 11 Migi 9 Iyoman 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}