{"link": "https://www.themoviedb.org/tv/31449?language=en", "title": "Skavlan", "resume": "Skavlan is a Norwegian-Swedish television talk show hosted by Norwegian journalist Fredrik Skavlan. It premiered in Sweden on Sveriges Television in January 2009, and the first guests to appear on the show were former Prime Minister of Sweden Göran Persson and his wife Anitra Steen. On 8 May 2009, it was announced that Skavlan had been renewed for a second season. It was also announced that the show would no longer only be produced by SVT in Sweden; Skavlan would now be partly produced in Norway by the Norwegian Broadcasting Corporation. The first twelve episodes of Skavlan's second season were produced by SVT in Sweden, and the remaining twelve by NRK in Norway.\nSkavlan speaks Norwegian and his dialog is therefore subtitled in Swedish in Sweden, even though the two languages are quite similar and mutually intelligible. If the persons being interviewed by Skavlan are Swedish, he often tells them to let him know if they do not understand what he is saying. Swedish novelist Jan Guillou has criticized SVT for subtitling the program, stating \"there is no need for that. If the host had been Danish, subtitling would have been necessary, but with a Norwegian host it does not make any sense.\"", "rate": 38, "genre": ["Talk"], "cast": ["Fredrik Skavlan"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31449   Expand Skavlan   (2009) User Score Overview Skavlan is a Norwegian-Swedish television talk show hosted by Norwegian journalist Fredrik Skavlan. It premiered in Sweden on Sveriges Television in January 2009, and the first guests to appear on the show were former Prime Minister of Sweden Göran Persson and his wife Anitra Steen. On 8 May 2009, it was announced that Skavlan had been renewed for a second season. It was also announced that the show would no longer only be produced by SVT in Sweden; Skavlan would now be partly produced in Norway by the Norwegian Broadcasting Corporation. The first twelve episodes of Skavlan's second season were produced by SVT in Sweden, and the remaining twelve by NRK in Norway. Skavlan speaks Norwegian and his dialog is therefore subtitled in Swedish in Sweden, even though the two languages are quite similar and mutually intelligible. If the persons being interviewed by Skavlan are Swedish, he often tells them to let him know if they do not understand what he is saying. Swedish novelist Jan Guillou has criticized SVT for subtitling the program, stating \"there is no need for that. If the host had been Danish, subtitling would have been necessary, but with a Norwegian host it does not make any sense.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Fredrik Skavlan Host Full Cast & Crew Last Season Season 14 2015 | 1 Episode Season 14 of Skavlan premiered on September 18, 2015. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Skavlan. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Skavlan. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Talk Show Original Language  English Runtime  58m Homepage   http://www.nrk.no/programmer/sider/skavlan/ Genres Talk Keywords talk show celebrity actor Content Score 56 We're so close, yet so far. Top Contributors j 58 jnylen k 3 korfun TB 2 TMDb Bot M 1 Mr_Democracy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}