{"link": "https://www.themoviedb.org/tv/3033?language=en", "title": "Laverne & Shirley", "resume": "Laverne & Shirley is an American television sitcom that ran on ABC from January 27, 1976 to May 10, 1983. It starred Penny Marshall as Laverne De Fazio and Cindy Williams as Shirley Feeney, single roommates who worked as bottlecappers in a fictitious Milwaukee brewery called \"Shotz Brewery.\"\nThe show was a spin-off from Happy Days, as the two lead characters were originally introduced on that series as acquaintances of Fonzie. Set in roughly the same time period, the timeline started in approximately 1958, when the series began, through 1967, when the series ended. As with Happy Days, it was made by Paramount Television, created by Garry Marshall, and executive produced by Garry Marshall, Edward K. Milkis, and Thomas L. Miller.", "rate": 71, "genre": ["Comedy"], "cast": ["Cindy Williams", "Penny Marshall", "Eddie Mekka", "Betty Garrett", "David L. Lander"], "character": ["Shirley Feeney", "Laverne De Fazio"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3033   Expand Laverne & Shirley   (1976) User Score Overview Laverne & Shirley is an American television sitcom that ran on ABC from January 27, 1976 to May 10, 1983. It starred Penny Marshall as Laverne De Fazio and Cindy Williams as Shirley Feeney, single roommates who worked as bottlecappers in a fictitious Milwaukee brewery called \"Shotz Brewery.\" The show was a spin-off from Happy Days, as the two lead characters were originally introduced on that series as acquaintances of Fonzie. Set in roughly the same time period, the timeline started in approximately 1958, when the series began, through 1967, when the series ended. As with Happy Days, it was made by Paramount Television, created by Garry Marshall, and executive produced by Garry Marshall, Edward K. Milkis, and Thomas L. Miller. Featured Crew Mark Rothman Creator Lowell Ganz Creator Garry Marshall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cindy Williams Shirley Feeney Penny Marshall Laverne De Fazio Eddie Mekka Betty Garrett David L. Lander Full Cast & Crew Last Season Season 8 1982 | 23 Episodes Season 8 of Laverne & Shirley premiered on September 28, 1982. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Shirley: Happy Birthday Cindy Williams! Open 0 by wonder2wonder\n      \n     Lavern vs Shirley /// Maryann vs Ginger ? Open 2 by  manfromatlantis Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1970-09-24 The Odd Couple 7.1    1977-01-14 Fantasy Island 6.5    1977-03-15 Three's Company 7.3    1961-01-05 Mister Ed 7.4    1968-09-21 Adam-12 6.7    1984-01-04 Night Court 6.9    1967-09-11 The Carol Burnett Show 7.8    1975-09-09 Welcome Back, Kotter 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Comedy Keywords female friendship retro sitcom 1950s Content Score 93 Almost there... Top Contributors 10 Banana 3 TheOneManBoxOffice 2 niqo19 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}