{"link": "https://www.themoviedb.org/tv/62745?language=en", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon?", "resume": "Bell Cranell is a rookie adventurer and the sole member of his dirt-poor guild founded by the petite goddess Hestia. Adventurers come from far and wide looking to strike it big in the massive labyrinth known as Dungeon, located beneath the city of Orario. Bell is more interested in picking up girls than Dungeon-crawling, but his reality check comes sooner than expected. Saved from a brush with death by the beautiful, renowned adventurer Aiz Wallenstein, Bell falls head-over-heels and sets his sights on winning her heart, but she's not the only woman he's caught the attention of, for better of worse.", "rate": 70, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Saori Oonishi", "Yuka Terasaki", "Yoshitsugu Matsuoka", "Maaya Uchida", "Shizuka Ishigami"], "character": ["Aiz Wallenstein", "Hephaistos", "Bell Cranell", "Ririruka Ahde", "Syr Flover"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62745   Expand Is It Wrong to Try to Pick Up Girls in a Dungeon?   (2015) User Score  Play Trailer Overview Bell Cranell is a rookie adventurer and the sole member of his dirt-poor guild founded by the petite goddess Hestia. Adventurers come from far and wide looking to strike it big in the massive labyrinth known as Dungeon, located beneath the city of Orario. Bell is more interested in picking up girls than Dungeon-crawling, but his reality check comes sooner than expected. Saved from a brush with death by the beautiful, renowned adventurer Aiz Wallenstein, Bell falls head-over-heels and sets his sights on winning her heart, but she's not the only woman he's caught the attention of, for better of worse. Featured Crew Fujino Ōmori Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Saori Oonishi Aiz Wallenstein Yuka Terasaki Hephaistos Yoshitsugu Matsuoka Bell Cranell Maaya Uchida Ririruka Ahde Shizuka Ishigami Syr Flover Full Cast & Crew Last Season Season 1 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Is It Wrong to Try to Pick Up Girls in a Dungeon?. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2015-10-03 Chivalry of a Failed Knight 7.9    2013-04-05 My Teen Romantic Comedy SNAFU 7.4    2011-04-14 Aria the Scarlet Ammo 6.4    2013-03-31 Date a Live 7.9    2017-07-04 Tsuredure Children 8.0    2015-04-05 The Heroic Legend of Arslan 6.8    2012-04-05 Sankarea: Undying Love 7.0    2012-07-06 Aesthetica of a Rogue Hero 7.1  Facts Original Name  ダンジョンに出会いを求めるのは間違っているだろうか Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://danmachi.com/ Genres Animation Comedy Sci-Fi & Fantasy Keywords magic harem battle dungeon gods based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 50 WillofOwn 12 Elizabeth Jennings CM 11 Cherche Moi 9 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}