{"link": "https://www.themoviedb.org/tv/67075?language=en", "title": "Mob Psycho 100", "resume": "Shigeo Kageyama, a.k.a. \"Mob,\" is a boy who has trouble expressing himself, but who happens to be a powerful esper. Mob is determined to live a normal life and keeps his ESP suppressed, but when his emotions surge to a level of 100%, something terrible happens to him! As he's surrounded by false espers, evil spirits, and mysterious organizations, what will Mob think? What choices will he make?", "rate": 82, "genre": ["Action", "Adventure", "Animation", "Comedy"], "cast": ["Setsuo Ito", "Takahiro Sakurai", "Miyu Irino", "Akio Otsuka"], "character": ["Shigeo \"Mob\" Kageyama (voice)", "Arataka Reigen (voice)", "Ritsu Kageyama (voice)", "Ekubo (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67075   Expand Mob Psycho 100   (2016) User Score Overview Shigeo Kageyama, a.k.a. \"Mob,\" is a boy who has trouble expressing himself, but who happens to be a powerful esper. Mob is determined to live a normal life and keeps his ESP suppressed, but when his emotions surge to a level of 100%, something terrible happens to him! As he's surrounded by false espers, evil spirits, and mysterious organizations, what will Mob think? What choices will he make? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Setsuo Ito Shigeo \"Mob\" Kageyama (voice) Takahiro Sakurai Arataka Reigen (voice) Miyu Irino Ritsu Kageyama (voice) Akio Otsuka Ekubo (voice) Full Cast & Crew Last Season Season 1 2016 | 12 Episodes Season 1 of Mob Psycho 100 premiered on July 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   2014-01-05 Noragami 7.4    2012-12-03 Guilty Crown 7.4    2012-01-10 Daily Lives of High School Boys 7.3    2016-01-14 KonoSuba – God’s blessing on this wonderful world!! 8.4    2006-07-09 Welcome to the N.H.K. 8.5    2016-04-03 My Hero Academia 8.0    2016-01-08 ERASED 7.8    2012-04-13 Kids on the Slope 8.4  Facts Original Name  モブサイコ100 Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://mobpsycho100.com Genres Action & Adventure Animation Comedy Keywords supernatural powers slice of life sibling rivalry based on manga super power extrasensory perception high school rivalry shounen anime Content Score 93 Almost there... Top Contributors 68 RubeensVinicius 43 Marr 🇳🇱 J 26 JohnyB0y 11 deanzel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}