{"link": "https://www.themoviedb.org/tv/63175?language=en", "title": "Minority Report", "resume": "Minority Report follows the unlikely partnership between a man haunted by the future and a cop haunted by her past, as they race to stop the worst crimes of the year 2065 before they happen. Set in Washington, D.C., it is 10 years after the demise of Precrime, a law enforcement agency tasked with identifying and eliminating criminals... before their crimes were committed. To carry out this brand of justice, the agency used three precogs - \"precognitives\" Dash, Arthur and Agatha - who were able to see the future. Now, in 2065, crime-solving is different, and justice leans more on sophisticated and trusted technology than on the instincts of the precogs.", "rate": 54, "genre": ["Crime", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Stark Sands", "Meagan Good", "Nick Zano", "Daniel London", "Laura Regan"], "character": ["Dash", "Lara Vega", "Arthur", "Wally", "Agatha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63175   Expand Minority Report   (2016) User Score Overview Minority Report follows the unlikely partnership between a man haunted by the future and a cop haunted by her past, as they race to stop the worst crimes of the year 2065 before they happen. Set in Washington, D.C., it is 10 years after the demise of Precrime, a law enforcement agency tasked with identifying and eliminating criminals... before their crimes were committed. To carry out this brand of justice, the agency used three precogs - \"precognitives\" Dash, Arthur and Agatha - who were able to see the future. Now, in 2065, crime-solving is different, and justice leans more on sophisticated and trusted technology than on the instincts of the precogs. Featured Crew Max Borenstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  7 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stark Sands Dash Meagan Good Lara Vega Nick Zano Arthur Daniel London Wally Laura Regan Agatha Full Cast & Crew Last Season Season 1 2016 | 10 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Minority Report. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  8 Recommendations   2015-09-22 Limitless 6.8    2016-01-13 Second Chance 6.5    2015-06-01 The Whispers 5.7    2015-05-14 Wayward Pines 6.5    2015-10-27 Wicked City 5.4    2016-03-07 Damien 6.5    2014-06-19 Dominion 5.9    2015-08-25 Public Morals 7.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.fox.com/minority-report Genres Crime Drama Sci-Fi & Fantasy Keywords future washington d.c. psychic power police detective female detective based on movie changing the past or future Content Score 93 Almost there... Top Contributors 40 Banana 35 Marr 🇳🇱 27 Elizabeth Jennings 10 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}