{"link": "https://www.themoviedb.org/tv/437?language=en", "title": "Mr. Belvedere", "resume": "Mr. Belvedere is an American sitcom that originally aired on ABC from March 15, 1985, until July 8, 1990. The series is based on the Lynn Aloysius Belvedere character created by Gwen Davenport for her 1947 novel Belvedere, which was later adapted into the 1948 film Sitting Pretty. The sitcom stars Christopher Hewett in the title role, who takes a job as a housekeeper with an American family headed by George Owens, played by Bob Uecker.", "rate": 67, "genre": ["Comedy"], "cast": ["Christopher Hewett", "Ilene Graff", "Brice Beckham", "Bob Uecker", "Rob Stone"], "character": ["Lynn Belvedere", "Marsha Cameron Owens", "Wesley T. Owens", "George Owens", "Kevin Owens"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 437   Expand Mr. Belvedere   (1985) User Score Overview Mr. Belvedere is an American sitcom that originally aired on ABC from March 15, 1985, until July 8, 1990. The series is based on the Lynn Aloysius Belvedere character created by Gwen Davenport for her 1947 novel Belvedere, which was later adapted into the 1948 film Sitting Pretty. The sitcom stars Christopher Hewett in the title role, who takes a job as a housekeeper with an American family headed by George Owens, played by Bob Uecker. Featured Crew Gwen Davenport Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Hewett Lynn Belvedere Ilene Graff Marsha Cameron Owens Brice Beckham Wesley T. Owens Bob Uecker George Owens Rob Stone Kevin Owens Full Cast & Crew Last Season Season 6 1989 | 22 Episodes Season 6 of Mr. Belvedere premiered on September 16, 1989. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Kevin: Happy Birthday Rob Stone! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1984-03-19 Kate & Allie 5.3    1982-09-25 Silver Spoons 5.1    1987-09-24 A Different World 5.2    1981-10-29 Gimme a Break! 5.7    1983-09-16 Webster 4.9    1986-09-17 Head of the Class 6.3    1983-10-03 Scarecrow and Mrs. King 5.5    1987-09-20 My Two Dads 5.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 24m Homepage  - Genres Comedy Keywords butler illegal immigrant neighbor feud Content Score 93 Almost there... Top Contributors w 6 wonder2wonder PE 5 Patrick E. Abe 1 CowMuncher 1 Daemon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}