{"link": "https://www.themoviedb.org/tv/71810?language=en", "title": "Lost Love in Times", "resume": "Feng Qingchen is a sorceress of Mingyi Tower, the secret organisation tasked with protecting the royal family. Yuan Ling is a prince from Western Wei, a ruling kingdom during the Northern and Southern Dynasties. Yuan Zhan, the seventh prince, is Yuan Ling’s biggest competitor in both power and love. After getting to know each other, Feng Qingchen is impressed by Yuan Ling’s abilities and suppresses her feelings for the sake of seeing him ascend his rightful position. Despite Qingchen’s contributions to the kingdom, the court is vehemently against Yuan Ling marrying a woman who dabbles in black magic. Yuan Zhan launches a coup on the day of the wedding ceremony, and Qingchen uses her powers to reset the universe in an effort to prevent further bloodshed. Will Qingchen succeed to heal the rift between Yuan Ling and Yuan Zhan? Will Yuan Ling and Yuan Zhan be able to join hands and overthrow the corrupt officials, and eventually return peace to the land? Will the love between Qingchen and Yuan Ling prevail?", "rate": 48, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Liu Shishi", "William Chan Wai-Ting", "Gong Jun", "Joe Xu", "Ryan Zhang"], "character": ["Feng Qingchen", "Yuan Ling", "Yuan Che", "Yuan Zhan", "Yuan Ming"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71810   Expand Lost Love in Times   (2017) User Score Overview Feng Qingchen is a sorceress of Mingyi Tower, the secret organisation tasked with protecting the royal family. Yuan Ling is a prince from Western Wei, a ruling kingdom during the Northern and Southern Dynasties. Yuan Zhan, the seventh prince, is Yuan Ling’s biggest competitor in both power and love. After getting to know each other, Feng Qingchen is impressed by Yuan Ling’s abilities and suppresses her feelings for the sake of seeing him ascend his rightful position. Despite Qingchen’s contributions to the kingdom, the court is vehemently against Yuan Ling marrying a woman who dabbles in black magic. Yuan Zhan launches a coup on the day of the wedding ceremony, and Qingchen uses her powers to reset the universe in an effort to prevent further bloodshed. Will Qingchen succeed to heal the rift between Yuan Ling and Yuan Zhan? Will Yuan Ling and Yuan Zhan be able to join hands and overthrow the corrupt officials, and eventually return peace to the land? Will the love between Qingchen and Yuan Ling prevail? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Liu Shishi Feng Qingchen William Chan Wai-Ting Yuan Ling Gong Jun Yuan Che Joe Xu Yuan Zhan Ryan Zhang Yuan Ming Full Cast & Crew Last Season Season 1 2017 | 56 Episodes Season 1 of Lost Love in Times premiered on July 13, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Lost Love in Times. You can help by rating TV shows you've seen. Facts Original Name  醉玲珑 Status  Ended Network Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords china romance historical fiction Content Score 86 Almost there... Top Contributors M 61 Maria180493 j 58 jklmo 31 Elizabeth Jennings 5 嘀。老司机  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}