{"link": "https://www.themoviedb.org/tv/32025?language=en", "title": "American Pickers", "resume": "Pickers like Mike Wolfe and Frank Fritz are on a mission to recycle America, even if it means diving into countless piles of grimy junk or getting chased off a gun-wielding homeowner’s land. Hitting back roads from coast to coast, the two men earn a living by restoring forgotten relics to their former glory, transforming one person’s trash into another’s treasure.", "rate": 74, "genre": ["Reality", "Comedy", "Documentary"], "cast": ["Frank Fritz", "Mike Wolfe", "Danielle Colby-Cushman"], "character": ["Himself", "Himself", "Herself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 32025   Expand American Pickers   (2010) User Score Overview Pickers like Mike Wolfe and Frank Fritz are on a mission to recycle America, even if it means diving into countless piles of grimy junk or getting chased off a gun-wielding homeowner’s land. Hitting back roads from coast to coast, the two men earn a living by restoring forgotten relics to their former glory, transforming one person’s trash into another’s treasure. Featured Crew Mike Wolfe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Frank Fritz Himself Mike Wolfe Himself Danielle Colby-Cushman Herself Full Cast & Crew Current Season season 19 2018 | 4 Episodes Season 19 of American Pickers premiered on April  9, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for American Pickers. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  8 Recommendations   2009-07-19 Pawn Stars 6.5    2010-10-25 American Restoration 6.1    2010-12-01 Storage Wars 5.3    2013-01-01 Hardcore Pawn: Chicago 3.8    1990-09-10 Captain Planet and the Planeteers 5.9    2014-10-13 Misfit Garage 7.5    2012-01-08 Cajun Pawn Stars 5.7    2008-03-09 Ax Men 5.0  Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.history.com/shows/american-pickers Genres Reality Comedy Documentary Keywords iowa antique nashville tennessee unrestored Content Score 64 We're so close, yet so far. Top Contributors 22 Gary 14 Elizabeth Jennings a 9 apung21 PE 8 Patrick E. Abe  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}