{"link": "https://www.themoviedb.org/tv/2617?language=en", "title": "Step by Step", "resume": "Step by Step is an American television sitcom that starred Patrick Duffy and Suzanne Somers as two single parents, who spontaneously get married after meeting one another during a vacation, resulting in them becoming the heads of a large blended family. The series aired for seven seasons, originally running on ABC as part of their TGIF lineup on Friday nights from September 20, 1991 to August 15, 1997, and was canceled by the network after six seasons, reportedly due to declining ratings. The series was picked up on CBS and aired on that network from September 19, 1997 to June 26, 1998 for its seventh and final season.", "rate": 61, "genre": ["Comedy"], "cast": ["Patrick Duffy", "Suzanne Somers", "Brandon Call", "Staci Keanan", "Christine Lakin"], "character": ["Frank Lambert", "Carol Foster Lambert", "J.T. Lambert", "Dana Foster", "Alicia Lambert"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2617   Expand Step by Step   (1991) User Score Overview Step by Step is an American television sitcom that starred Patrick Duffy and Suzanne Somers as two single parents, who spontaneously get married after meeting one another during a vacation, resulting in them becoming the heads of a large blended family. The series aired for seven seasons, originally running on ABC as part of their TGIF lineup on Friday nights from September 20, 1991 to August 15, 1997, and was canceled by the network after six seasons, reportedly due to declining ratings. The series was picked up on CBS and aired on that network from September 19, 1997 to June 26, 1998 for its seventh and final season. Featured Crew William Bickley Creator Michael Warren Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  1 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Patrick Duffy Frank Lambert Suzanne Somers Carol Foster Lambert Brandon Call J.T. Lambert Staci Keanan Dana Foster Christine Lakin Alicia Lambert Full Cast & Crew Last Season Season 7 1997 | 19 Episodes Season 7 of Step by Step premiered on September 19, 1997. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Carol: Happy Birthday Suzanne Somers! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  5 Recommendations   1989-09-22 Family Matters 6.2    1985-09-24 Growing Pains 6.1    1977-03-15 Three's Company 7.3    1991-09-17 Home Improvement 7.0    1989-02-28 Coach 6.8    1984-09-20 Who's the Boss? 6.4    1995-09-13 The Drew Carey Show 6.4    1984-10-03 Charles in Charge 5.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  20m, 30m Homepage  - Genres Comedy Keywords big family sitcom blended family Content Score 100 Yes! Looking good! Top Contributors s 12 speedycars 8 Banana L 8 Leah W 4 Wiruss  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}