{"link": "https://www.themoviedb.org/tv/2432?language=en", "title": "Taken", "resume": "Taken, also known as Steven Spielberg Presents Taken, is a science fiction miniseries which first aired on the Sci-Fi Channel in 2002 and won an Emmy Award for Outstanding Miniseries. Filmed in Vancouver, British Columbia, Canada, it was written by Leslie Bohem, and directed by Breck Eisner, Félix Enríquez Alcalá, John Fawcett, Tobe Hooper, Jeremy Paul Kagan, Michael Katleman, Sergio Mimica-Gezzan, Bryan Spicer, Jeff Woolnough and Thomas J. Wright. The executive producers were Leslie Bohem and Steven Spielberg.\nThe show takes place from 1944 to 2002 and follows the lives of three families: the Crawfords, who seek to cover up the Roswell crash and the existence of aliens; the Keys, who are subject to frequent experimentation by the aliens; and the Clarkes, who sheltered one of the surviving aliens from the crash. As a result of the decades-long storyline, not a single actor or character appears in every episode of the series. Reception was positive, and the series won an Emmy Award.\nWhen the show was launched, the Sci-Fi Channel used the simultaneous establishment of the organization Coalition for Freedom of Information in its promotion campaign. Both the Sci-Fi Channel and the Coalition for Freedom of Information are clients of Washington, D.C. public relations firm PodestaMattoon, and this apparent co-mingling of clients was criticized. The Coalition for Freedom of Information is a group which seeks the release of classified governmental UFO files as well as scientific, congressional, and media credibility for the study of this subject.", "rate": 74, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Dakota Fanning", "Matt Frewer", "Emily Bergl", "Heather Donahue", "Joel Gretsch"], "character": ["Allie Keys", "Dr. Chet Wakeman", "Lisa Clarke", "Mary Crawford", "Owen Crawford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2432   Expand Taken   (2002) User Score  Play Trailer Overview Taken, also known as Steven Spielberg Presents Taken, is a science fiction miniseries which first aired on the Sci-Fi Channel in 2002 and won an Emmy Award for Outstanding Miniseries. Filmed in Vancouver, British Columbia, Canada, it was written by Leslie Bohem, and directed by Breck Eisner, Félix Enríquez Alcalá, John Fawcett, Tobe Hooper, Jeremy Paul Kagan, Michael Katleman, Sergio Mimica-Gezzan, Bryan Spicer, Jeff Woolnough and Thomas J. Wright. The executive producers were Leslie Bohem and Steven Spielberg. The show takes place from 1944 to 2002 and follows the lives of three families: the Crawfords, who seek to cover up the Roswell crash and the existence of aliens; the Keys, who are subject to frequent experimentation by the aliens; and the Clarkes, who sheltered one of the surviving aliens from the crash. As a result of the decades-long storyline, not a single actor or character appears in every episode of the series. Reception was positive, and the series won an Emmy Award. When the show was launched, the Sci-Fi Channel used the simultaneous establishment of the organization Coalition for Freedom of Information in its promotion campaign. Both the Sci-Fi Channel and the Coalition for Freedom of Information are clients of Washington, D.C. public relations firm PodestaMattoon, and this apparent co-mingling of clients was criticized. The Coalition for Freedom of Information is a group which seeks the release of classified governmental UFO files as well as scientific, congressional, and media credibility for the study of this subject. Featured Crew Leslie Bohem Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  9 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dakota Fanning Allie Keys Matt Frewer Dr. Chet Wakeman Emily Bergl Lisa Clarke Heather Donahue Mary Crawford Joel Gretsch Owen Crawford Full Cast & Crew Last Season Season 1 2002 | 10 Episodes Season 1 of Taken premiered on December  2, 2002. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Taken. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  5 Recommendations   2004-07-11 The 4400 6.9    2004-10-24 ReGenesis 7.0    2006-12-11 The Lost Room 7.7    2004-07-19 The Grid 7.0    2011-06-06 Injustice 7.3    2002-06-16 The Dead Zone 6.5    2005-09-16 Threshold 6.9    1999-10-06 Roswell 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m Homepage   http://www.scifi.com/taken Genres Sci-Fi & Fantasy Keywords alien miniseries alien invasion Content Score 100 Yes! Looking good! Top Contributors TB 13 TMDb Bot 9 Renato 7 Banana w 5 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}