{"link": "https://www.themoviedb.org/tv/3476?language=en", "title": "Inspector Morse", "resume": "Inspector Morse is a detective drama based on Colin Dexter's series of Chief Inspector Morse novels. The series starred John Thaw as Chief Inspector Morse and Kevin Whately as Sergeant Lewis, as well as a large cast of notable actors and actresses.", "rate": 78, "genre": ["Crime", "Drama", "Mystery"], "cast": ["John Thaw", "Kevin Whately", "James Grout", "Liz Kettle", "Clare Holman"], "character": ["Detective Chief Inspector Endeavour Morse", "Detective Sergeant Robert 'Robbie' Lewis", "Chief Superintendent Strange", "WPC", "Dr. Laura Hobson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3476   Expand Inspector Morse   (1987) User Score Overview Inspector Morse is a detective drama based on Colin Dexter's series of Chief Inspector Morse novels. The series starred John Thaw as Chief Inspector Morse and Kevin Whately as Sergeant Lewis, as well as a large cast of notable actors and actresses. Featured Crew Tony Warren Creator Colin Dexter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Thaw Detective Chief Inspector Endeavour Morse Kevin Whately Detective Sergeant Robert 'Robbie' Lewis James Grout Chief Superintendent Strange Liz Kettle WPC Clare Holman Dr. Laura Hobson Full Cast & Crew Last Season Season 12 2000 | 1 Episode Season 12 of Inspector Morse premiered on November 15, 2000. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Fancy a pint and a night at the opera? Open 2 by  wonder2wonder Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   2007-02-18 Inspector Lewis 7.6    2000-09-04 Waking the Dead 7.9    1997-03-23 Midsomer Murders 7.7    2011-05-01 Vera 6.8    2011-09-16 DCI Banks 7.9    1997-05-09 Jonathan Creek 7.7    1992-12-06 A Touch of Frost 7.9    2002-10-27 Foyle's War 8.1  Facts Status  Ended Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  100m Homepage   http://www.museum.tv/eotv/inspectormor.htm Genres Crime Drama Mystery Keywords opera england pub classical music beer murder criminal police detective oxford england forensic science crime investigation academia crime solving colleagues Content Score 100 Yes! Looking good! Top Contributors 88 Nike 34 genplant29 17 Elizabeth Jennings z 9 zoroman2017  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}