{"link": "https://www.themoviedb.org/tv/63839?language=en", "title": "800 Words", "resume": "A recently widowed father, quits his job as a popular 800 word columnist for a top selling Sydney newspaper. Over the internet he buys a house on an impulse in a remote New Zealand seaside town. He then has to break the news to his two teenage kids who just lost their mum, and now face an even more uncertain future. But the colourful and inquisitive locals ensure his dream of a fresh start does not go to plan.", "rate": 62, "genre": ["Comedy", "Drama"], "cast": ["Erik Thomson", "Melina Vidler", "Benson Jack Anthony", "Rick Donald", "Jonny Brugh"], "character": ["George Turner", "Shay Turner", "Arlo Turner", "Woody", "Monty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63839   Expand 800 Words   (2015) User Score  Play Trailer Overview A recently widowed father, quits his job as a popular 800 word columnist for a top selling Sydney newspaper. Over the internet he buys a house on an impulse in a remote New Zealand seaside town. He then has to break the news to his two teenage kids who just lost their mum, and now face an even more uncertain future. But the colourful and inquisitive locals ensure his dream of a fresh start does not go to plan. Featured Crew Maxine Fleming Creator James Griffin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Erik Thomson George Turner Melina Vidler Shay Turner Benson Jack Anthony Arlo Turner Rick Donald Woody Jonny Brugh Monty Full Cast & Crew Last Season Season 3 2017 | 8 Episodes Season 3 of 800 Words premiered on September 12, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply t The only question Open 1 by  K7T345 A very good show Open 0 by K7T345\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2016-06-08 Power Monkeys 7.0    2006-01-01 In Justice 6.8    2011-05-02 Case Sensitive 5.4    2011-01-13 Kidnap and Ransom 7.6    2015-04-15 The Delivery Man 6.5    2004-07-19 The Grid 7.0    2010-07-12 The Silence 6.8    2013-09-05 The Guilty 7.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   https://au.tv.yahoo.com/shows/800-words/ Genres Comedy Drama Keywords new zealand surf single father Content Score 100 Yes! Looking good! Top Contributors t 40 tmdb48730457 14 Elizabeth Jennings 5 Marco s 4 spirea  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}