{"link": "https://www.themoviedb.org/tv/1567?language=en", "title": "CatDog", "resume": "CatDog is an American animated television series created for Nickelodeon by Peter Hannan. The series depicts the life of conjoined brothers, with one half being a cat and the other a dog. Nickelodeon produced the series from Burbank, California. The first episode aired on April 4, 1998, before the show officially premiered in October. The episode \"Fetch\" was also shown in theaters with The Rugrats Movie.\nToward the end of the series run, a made-for-TV film was released, titled CatDog: The Great Parent Mystery. Reruns were played on Nicktoons until 2011 and later aired on TeenNick as part of The '90s Are All That block. The series is produced by Nickelodeon Animation Studio and Peter Hannan Productions and has been released on DVD.", "rate": 65, "genre": ["Animation", "Comedy"], "cast": ["Jim Cummings", "Dwight Schultz", "Maria Bamford", "Maria Bamford", "Maria Bamford"], "character": ["Cat (voice)", "Old Lady", "Mrs. Claus", "Surfer Girl"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1567   Expand CatDog   (1998) User Score Overview CatDog is an American animated television series created for Nickelodeon by Peter Hannan. The series depicts the life of conjoined brothers, with one half being a cat and the other a dog. Nickelodeon produced the series from Burbank, California. The first episode aired on April 4, 1998, before the show officially premiered in October. The episode \"Fetch\" was also shown in theaters with The Rugrats Movie. Toward the end of the series run, a made-for-TV film was released, titled CatDog: The Great Parent Mystery. Reruns were played on Nicktoons until 2011 and later aired on TeenNick as part of The '90s Are All That block. The series is produced by Nickelodeon Animation Studio and Peter Hannan Productions and has been released on DVD. Featured Crew Peter Hannan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Cummings Cat (voice) Dwight Schultz Maria Bamford Old Lady Maria Bamford Mrs. Claus Maria Bamford Surfer Girl Full Cast & Crew Last Season Season 3 2000 | 22 Episodes Season 3 of CatDog premiered on August 12, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1997-04-20 The Angry Beavers 6.9    1998-09-01 The Wild Thornberrys 6.0    1994-10-30 Aaahh!!! Real Monsters 6.4    1999-08-16 Rocket Power 6.4    1991-08-11 Rugrats 7.1    1996-10-07 Hey Arnold! 6.8    1993-09-18 Rocko's Modern Life 7.7    2001-03-30 The Fairly OddParents 6.7  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  11m Homepage   http://www.nickelodeon.com.au/toonroom/xtoonroomcat.php Genres Animation Comedy Keywords cartoon cat cartoon dog conjoined twins Content Score 100 Yes! Looking good! Top Contributors 17 Banana w 4 waterhorse z 4 zurman1 4 FelipeFusion  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}