{"link": "https://www.themoviedb.org/tv/63196?language=en", "title": "Con Man", "resume": "Con Man centers on the post-show life of Wray Nerely the co-star of “Spectrum,” a sci-fi series, which was canceled before its time and went on to become a cult classic beloved by fans. Wray’s good friend, Jack Moore starred as the series Captain and has gone on to become a major celebrity, while Wray hasn’t found his desired level of stardom. Wray is the begrudging guest of sci-fi conventions, comic book store appearances, and different pop culture events; however, everything is not as it seems from the outside. The series will explore these events and all the weird and crazy things that happen to them along the way.", "rate": 68, "genre": ["Comedy"], "cast": ["Alan Tudyk", "Nathan Fillion", "Mindy Sterling", "Alison Haislip", "Nolan North"], "character": ["Wray Nerely", "Jack Moore", "Bobbie", "Faith", "Jerry Lansing"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63196   Expand Con Man   (2015) User Score  Play Trailer Overview Con Man centers on the post-show life of Wray Nerely the co-star of “Spectrum,” a sci-fi series, which was canceled before its time and went on to become a cult classic beloved by fans. Wray’s good friend, Jack Moore starred as the series Captain and has gone on to become a major celebrity, while Wray hasn’t found his desired level of stardom. Wray is the begrudging guest of sci-fi conventions, comic book store appearances, and different pop culture events; however, everything is not as it seems from the outside. The series will explore these events and all the weird and crazy things that happen to them along the way. Featured Crew Alan Tudyk Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Tudyk Wray Nerely Nathan Fillion Jack Moore Mindy Sterling Bobbie Alison Haislip Faith Nolan North Jerry Lansing Full Cast & Crew Last Season Season 2 2016 | 12 Episodes Season 2 of Con Man premiered on December  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   2015-08-20 Documentary Now! 7.5    2015-12-24 Dawn of the Croods 6.6    2015-04-26 HAPPYish 6.9    2015-09-30 You, Me and the Apocalypse 7.2    2015-01-11 Togetherness 6.0    2014-03-21 Welcome to Sweden 6.3    2009-03-15 Kings 7.9    2005-09-16 Threshold 6.9  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  10m Homepage   https://vimeo.com/ondemand/conman/132973956 Genres Comedy Keywords actor fan convention Content Score 100 Yes! Looking good! Top Contributors 49 spaceship broken d 38 dynamichael 13 Elizabeth Jennings 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}