{"link": "https://www.themoviedb.org/tv/61112?language=en", "title": "Manhattan", "resume": "Set against the backdrop of the greatest clandestine race against time in the history of science with the mission to build the world's first atomic bomb in Los Alamos, New Mexico. Flawed scientists and their families attempt to co-exist in a world where secrets and lies infiltrate every aspect of their lives.", "rate": 74, "genre": ["Drama", "War", "Politics"], "cast": ["John Benjamin Hickey", "Olivia Williams", "Ashley Zukerman", "Rachel Brosnahan", "Daniel Stern"], "character": ["Frank Winter", "Liza Winter", "Charlie Isaacs", "Abby Isaacs", "Glen Babbit"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61112   Expand Manhattan   (2014) User Score  Play Trailer Overview Set against the backdrop of the greatest clandestine race against time in the history of science with the mission to build the world's first atomic bomb in Los Alamos, New Mexico. Flawed scientists and their families attempt to co-exist in a world where secrets and lies infiltrate every aspect of their lives. Featured Crew Sam Shaw Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  8 Videos Trailers  4 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Benjamin Hickey Frank Winter Olivia Williams Liza Winter Ashley Zukerman Charlie Isaacs Rachel Brosnahan Abby Isaacs Daniel Stern Glen Babbit Full Cast & Crew Last Season Season 2 2015 | 10 Episodes Season 2 of Manhattan premiered on October 13, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  4 Backdrops  10 Posters  8 Recommendations   2014-10-02 Gracepoint 6.5    2007-03-15 Raines 7.3    2013-04-19 Alpha House 7.3    2014-05-30 Crossbones 6.0    2012-03-30 Magic City 6.7    2015-01-04 The Saboteurs 7.5    2015-05-25 Texas Rising 6.4    2012-09-25 Vegas 7.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://wgnamerica.com/shows/manhattan Genres Drama War & Politics Keywords war atomic bomb new mexico world war ii military base scientist dark secrets clandestine Content Score 100 Yes! Looking good! Top Contributors 149 Elizabeth Jennings 10 Banana M 8 Manu b 5 bonjour1992  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}