{"link": "https://www.themoviedb.org/tv/77031?language=en", "title": "Vida", "resume": "Two Mexican-American sisters from the Eastside of Los Angeles who couldn't be more different or distanced from each other are forced to return to their old neighborhood, where they are confronted by the past and surprising truth about their mother’s identity.", "rate": 64, "genre": ["Drama"], "cast": ["Melissa Barrera", "Mishel Prada", "Ser Anzoategui", "Chelsea Rendon", "Carlos Miranda"], "character": ["Lyn", "Emma", "Eddy", "Marisol", "Johnny"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77031   Expand Vida   (2018) User Score  Play Trailer Overview Two Mexican-American sisters from the Eastside of Los Angeles who couldn't be more different or distanced from each other are forced to return to their old neighborhood, where they are confronted by the past and surprising truth about their mother’s identity. Featured Crew Tanya Saracho Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  2 Posters  5 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melissa Barrera Lyn Mishel Prada Emma Ser Anzoategui Eddy Chelsea Rendon Marisol Carlos Miranda Johnny Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Vida premiered on May  6, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply a Spanish With No English Subs! Open 0 by acontributor\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  2 Posters  5 Recommendations   2018-04-08 Killing Eve 8.7    2017-09-27 SEAL Team 6.6    2016-09-06 Atlanta 7.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   https://www.starz.com/series/vida Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 37 Elizabeth Jennings W 6 Wallyson o 5 ohakim s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}