{"link": "https://www.themoviedb.org/tv/39898?language=en", "title": "Kung Fu Panda: Legends of Awesomeness", "resume": "Kung Fu Panda: Legends of Awesomeness is an American computer-animated television series spun-off from the Kung Fu Panda films. It takes place between the two films showing Po's training to becoming a successful Dragon Warrior. The series was originally set to air on Nickelodeon in 2010, but it was pushed back to 2011 instead. Over 52 episodes have been produced or ordered, with a third season also confirmed. Two special previews were aired on September 19 and October 21, 2011 and it officially premiered on November 7, 2011.", "rate": 71, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Kari Wahlgren", "James Hong", "James Sie", "Amir Talai", "Fred Tatasciore"], "character": ["Tigresse (voice)", "Mr. Ping (voice)", "Monkey (voice)", "Crane (voice)", "Shifu (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39898   Expand Kung Fu Panda: Legends of Awesomeness   (2011) User Score  Play Trailer Overview Kung Fu Panda: Legends of Awesomeness is an American computer-animated television series spun-off from the Kung Fu Panda films. It takes place between the two films showing Po's training to becoming a successful Dragon Warrior. The series was originally set to air on Nickelodeon in 2010, but it was pushed back to 2011 instead. Over 52 episodes have been produced or ordered, with a third season also confirmed. Two special previews were aired on September 19 and October 21, 2011 and it officially premiered on November 7, 2011. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kari Wahlgren Tigresse (voice) James Hong Mr. Ping (voice) James Sie Monkey (voice) Amir Talai Crane (voice) Fred Tatasciore Shifu (voice) Full Cast & Crew Last Season Season 3 2013 | 28 Episodes Season 3 of Kung Fu Panda: Legends of Awesomeness premiered on June 24, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   1984-09-08 The New Scooby-Doo Mysteries 6.2    1940-11-25 The Woody Woodpecker Show 7.1    1995-09-09 Earthworm Jim 6.6    1993-09-06 Adventures of Sonic the Hedgehog 4.9    2002-09-07 Baby Looney Tunes 5.5    2015-01-16 The Adventures of Puss in Boots 6.4    1975-09-06 The Tom and Jerry Show 7.6    2012-04-01 Marvel's Ultimate Spider-Man 6.6  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  23m Homepage   http://www.nick.com/shows/kung-fu-panda-legends-of-awesomeness Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords kung fu panda animation kung fu master 3d Content Score 93 Almost there... Top Contributors J 52 JeePeCe I 23 ILiviu 15 Maikkoum 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}