{"link": "https://www.themoviedb.org/tv/49474?language=en", "title": "Treehouse Masters", "resume": "People who know and work with Pete Nelson describe him as a tree whisperer. For his part, Nelson lets the trees do the talking. He's a world-renowned treehouse designer and builder, and this series documents the work he and his team of craftsmen—including his son Charlie—do to create incredible homes and businesses in nature's canopy. Pete uses a combination of science and art to realize clients' sky-high aspirations of magnificent multi-bedroom treehouses with elaborate kitchens and bathrooms, or simpler, peaceful one-room escapes. Other backyard escapes featured in the series include a spa retreat, a brewery, and a honeymoon suite. \"We awaken that inner child who dreams of living among the trees,\" Pete says.", "rate": 67, "genre": ["Documentary", "Reality"], "cast": ["Pete Nelson"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49474   Expand Treehouse Masters   (2013) User Score  Play Trailer Overview People who know and work with Pete Nelson describe him as a tree whisperer. For his part, Nelson lets the trees do the talking. He's a world-renowned treehouse designer and builder, and this series documents the work he and his team of craftsmen—including his son Charlie—do to create incredible homes and businesses in nature's canopy. Pete uses a combination of science and art to realize clients' sky-high aspirations of magnificent multi-bedroom treehouses with elaborate kitchens and bathrooms, or simpler, peaceful one-room escapes. Other backyard escapes featured in the series include a spa retreat, a brewery, and a honeymoon suite. \"We awaken that inner child who dreams of living among the trees,\" Pete says. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pete Nelson Himself - Host Full Cast & Crew Last Season Season 9 2017 | 9 Episodes Season 9 of Treehouse Masters premiered on August  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Treehouse Masters. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  60m Homepage   http://www.animalplanet.com/tv-shows/treehouse-masters Genres Documentary Reality Keywords tree house Content Score 64 We're so close, yet so far. Top Contributors 27 Elizabeth Jennings o 18 obishiro g 5 gecko10 TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}