{"link": "https://www.themoviedb.org/tv/78881?language=en", "title": "Picnic at Hanging Rock", "resume": "Three schoolgirls and their governess mysteriously disappear on Valentines Day in 1900.", "rate": 60, "genre": ["Drama", "Mystery"], "cast": ["Natalie Dormer", "Lily Sullivan", "Samara Weaving", "Madeleine Madden", "Inez Curro"], "character": ["Mrs. Hester Appleyard", "Miranda Reid", "Irma Leopold", "Marion Quade", "Sara Waybourne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 78881   Expand Picnic at Hanging Rock   (2018) User Score  Play Trailer Overview Three schoolgirls and their governess mysteriously disappear on Valentines Day in 1900. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Natalie Dormer Mrs. Hester Appleyard Lily Sullivan Miranda Reid Samara Weaving Irma Leopold Madeleine Madden Marion Quade Inez Curro Sara Waybourne Full Cast & Crew Current Season Season 1 2018 | 6 Episodes Season 1 of Picnic at Hanging Rock premiered on May  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Picnic at Hanging Rock. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  English Runtime  50m Homepage   https://www.showcasechannel.com.au/shows/picnic-at-hanging-rock/ Genres Drama Mystery Keywords forest valentine's day 20th century Content Score 93 Almost there... Top Contributors 34 Elizabeth Jennings T 26 Ticktock 12 Mikedeth5 5 Shock Corridor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}