{"link": "https://www.themoviedb.org/tv/21561?language=en", "title": "The Outer Limits", "resume": "The Outer Limits is an anthology series of distinct story episodes, sometimes with a plot twist at the end. Unlike the original incarnation of the series, which was a pure anthology with each episode completely unrelated to the others, the revival series maintained an anthology format, but occasionally featured recurring story elements that were often tied together during season-finale clip shows.", "rate": 80, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Joe Pascual"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21561   Expand The Outer Limits   (1995) User Score Overview The Outer Limits is an anthology series of distinct story episodes, sometimes with a plot twist at the end. Unlike the original incarnation of the series, which was a pure anthology with each episode completely unrelated to the others, the revival series maintained an anthology format, but occasionally featured recurring story elements that were often tied together during season-finale clip shows. Featured Crew Leslie Stevens Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joe Pascual Full Cast & Crew Last Season Season 7 2001 | 22 Episodes Season 7 of The Outer Limits premiered on March 16, 2001. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w **SPOILERS**: \"I, Robot (1995)\" Open 0 by wonder2wonder\n      \n     w Favorite episodes? Open 8 by  stugood Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   1963-09-16 The Outer Limits 7.8    1985-09-27 The Twilight Zone 7.4    1989-03-26 Quantum Leap 7.6    1995-03-22 Sliders 7.0    2002-09-18 The Twilight Zone 7.5    1990-04-19 Wings 6.7    1996-01-09 3rd Rock from the Sun 7.3    1989-06-10 Tales from the Crypt 7.7  Facts Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  44m, 60m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords anthology aliens Content Score 64 We're so close, yet so far. Top Contributors 22 Elizabeth Jennings 19 Banana t 15 tmdb59661364 S 14 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}