{"link": "https://www.themoviedb.org/tv/2343?language=en", "title": "Inspector Lewis", "resume": "Inspector Robert Lewis and Sergeant James Hathaway solve the tough cases that the learned inhabitants of Oxford throw at them.", "rate": 75, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Kevin Whately", "Laurence Fox", "Clare Holman", "Rebecca Front"], "character": ["Detective Inspector Robert 'Robbie' Lewis", "Detective Sergeant James Hathaway", "Dr. Laura Hobson", "Chief Superintendent Jean Innocent"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2343   Expand Inspector Lewis   (2007) User Score Overview Inspector Robert Lewis and Sergeant James Hathaway solve the tough cases that the learned inhabitants of Oxford throw at them. Featured Crew Colin Dexter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  3 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Whately Detective Inspector Robert 'Robbie' Lewis Laurence Fox Detective Sergeant James Hathaway Clare Holman Dr. Laura Hobson Rebecca Front Chief Superintendent Jean Innocent Full Cast & Crew Last Season Season 9 2015 | 6 Episodes Season 9 of Inspector Lewis premiered on October  6, 2015. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Classic British crime-solving t.v. series (2006-2015) Open 3 by  AusFem Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1987-01-06 Inspector Morse 7.7    2012-01-02 Endeavour 8.1    2011-05-01 Vera 6.8    1996-03-16 Dalziel and Pascoe 7.8    2000-09-04 Waking the Dead 7.9    1997-03-23 Midsomer Murders 7.7    2002-10-27 Foyle's War 8.1    2011-09-16 DCI Banks 7.9  Facts Status  Ended Network Certification 12 Meaning Films classified 12A and video works classified 12 contain material that is not generally suitable for children aged under 12. Type  Scripted Original Language  English Runtime  90m Homepage   https://www.itv.com/itvplayer/lewis Genres Crime Drama Mystery Keywords england murder criminal police detective oxford england forensic science crime investigation academia crime solving colleagues Content Score 93 Almost there... Top Contributors 42 genplant29 24 Banana 21 Elizabeth Jennings JT 19 James T  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}