{"link": "https://www.themoviedb.org/tv/3755?language=en", "title": "Sister, Sister", "resume": "Sister, Sister is an American television sitcom starring identical twins Tia Mowry and Tamera Mowry. The premise of the show was that the girls were separated and adopted at birth, one to a single mother, one to a single father, and have met again after 14 years apart.\nCreated by Kim Bass, Gary Gilbert and Fred Shafferman, the series was produced by de Passe Entertainment and Paramount Network Television. The cast, along with Tia and Tamera Mowry, also included Jackee Harry, Marques Houston and Tim Reid, with RonReaco Lee and Deon Richmond joining the cast in the fifth season.\nThe series ran from April 1, 1994 to April 28, 1995 on ABC, and was canceled by the network after two seasons, due to poor ratings. The series was picked up by The WB and aired on that network from September 6, 1995, through May 23, 1999.", "rate": 59, "genre": ["Comedy"], "cast": ["Tia Mowry", "Tamera Mowry", "Tim Reid", "Jackée Harry", "Brittany Murphy"], "character": ["Tia Landry", "Tamera Campbell", "Sarah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3755   Expand Sister, Sister   (1994) User Score Overview Sister, Sister is an American television sitcom starring identical twins Tia Mowry and Tamera Mowry. The premise of the show was that the girls were separated and adopted at birth, one to a single mother, one to a single father, and have met again after 14 years apart. Created by Kim Bass, Gary Gilbert and Fred Shafferman, the series was produced by de Passe Entertainment and Paramount Network Television. The cast, along with Tia and Tamera Mowry, also included Jackee Harry, Marques Houston and Tim Reid, with RonReaco Lee and Deon Richmond joining the cast in the fifth season. The series ran from April 1, 1994 to April 28, 1995 on ABC, and was canceled by the network after two seasons, due to poor ratings. The series was picked up by The WB and aired on that network from September 6, 1995, through May 23, 1999. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Tia Mowry Tia Landry Tamera Mowry Tamera Campbell Tim Reid Jackée Harry Brittany Murphy Sarah Full Cast & Crew Last Season Season 6 1998 | 21 Episodes Season 6 of Sister, Sister premiered on September 13, 1998. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Tia: Happy Birthday Tia Mowry! Open 0 by wonder2wonder\n      \n     w Tamera: Happy Birthday Tamera Mowry! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1993-11-28 The Adventures of Pete & Pete 8.1    2002-03-27 George Lopez 4.9    1991-03-01 Clarissa Explains It All 6.2    1999-10-16 The Amanda Show 5.2    2004-09-18 Super Robot Monkey Team Hyperforce Go! 5.2    2001-02-03 Lloyd in Space 4.8    Helter Skelter 6.5    2003-04-12 All Grown Up! 4.7  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  23m Homepage  - Genres Comedy Keywords twin sister twins separated at birth sitcom black sitcom Content Score 86 Almost there... Top Contributors 7 Banana s 3 speedycars 2 dgw R 2 Rebafan23  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}