{"link": "https://www.themoviedb.org/tv/75419?language=en", "title": "Knight Squad", "resume": "Two mismatched students at a magical school for knights in training form an unlikely alliance to protect each other’s secret and pursue their dreams.", "rate": 47, "genre": ["Comedy"], "cast": ["Owen Joyner", "Daniella Perkins", "Amarr M. Wooten", "Lexi DiBenedetto", "Lilimar"], "character": ["Arc", "Ciara", "Warwick", "Prudence", "Sage"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75419   Expand Knight Squad   (2018) User Score Overview Two mismatched students at a magical school for knights in training form an unlikely alliance to protect each other’s secret and pursue their dreams. Featured Crew Sean William Cunningham Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  6 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  1 Opening Credits  0 Top Billed Cast Owen Joyner Arc Daniella Perkins Ciara Amarr M. Wooten Warwick Lexi DiBenedetto Prudence Lilimar Sage Full Cast & Crew Current Season Season 1 2018 | 13 Episodes Season 1 of Knight Squad premiered on February 19, 2018. View All Seasons Social Reviews  0 Discussions  6 Subject Status Replies Last Reply a Saturdays in June Open 0 by acontributor\n      \n     a New Episode May 5th Open 3 by  acontributor a A Knight's Tail Open 1 by  Taylorfirst1 Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Knight Squad. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  24m Homepage   http://www.nick.com/knight-squad/ Genres Comedy Keywords magic knight teen comedy Content Score 100 Yes! Looking good! Top Contributors a 27 acontributor 25 Elizabeth Jennings b 5 basher 4 MauSilva  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}