{"link": "https://www.themoviedb.org/tv/1580?language=en", "title": "Gidget", "resume": "Gidget is an American sitcom about a surfing, boy-crazy teenager called \"Gidget\" and her widowed father Russ Lawrence, a UCLA professor. Sally Field stars as Gidget with Don Porter as father Russell Lawrence. The series was first broadcast on ABC from September 15, 1965 to April 21, 1966.\nGidget was among the first regularly scheduled color programs on ABC, but did poorly in the Nielsen ratings and was cancelled at the end of its first season.", "rate": 65, "genre": ["Comedy"], "cast": ["Don Porter", "Sally Field", "Betty Conner", "Lynette Winter"], "character": ["Professor Russell Lawrence", "Frances Elizabeth 'Gidget' Lawrence", "Anne Cooper", "Larue"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1580   Expand Gidget   (1965) User Score Overview Gidget is an American sitcom about a surfing, boy-crazy teenager called \"Gidget\" and her widowed father Russ Lawrence, a UCLA professor. Sally Field stars as Gidget with Don Porter as father Russell Lawrence. The series was first broadcast on ABC from September 15, 1965 to April 21, 1966. Gidget was among the first regularly scheduled color programs on ABC, but did poorly in the Nielsen ratings and was cancelled at the end of its first season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Don Porter Professor Russell Lawrence Sally Field Frances Elizabeth 'Gidget' Lawrence Betty Conner Anne Cooper Lynette Winter Larue Full Cast & Crew Last Season Season 1 1965 | 32 Episodes Season 1 of Gidget premiered on September 15, 1965. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply should of lasted Open 2 by  bionic_man w Gidget: Happy Birthday Sally Field! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1968-09-28 The Ghost & Mrs. Muir 6.7    1967-09-10 Gentle Ben 5.0    1965-09-14 F Troop 6.4    1971-08-01 The Sonny & Cher Comedy Hour 5.0    1962-10-11 McHale's Navy 6.1    1970-09-17 The Flip Wilson Show 3.7    1979-09-30 To the Manor Born 7.1    1968-09-23 Here's Lucy 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords parent child relationship single father sitcom Content Score 86 Almost there... Top Contributors 10 Banana T 5 Torq00 1 t0by  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}