{"link": "https://www.themoviedb.org/tv/65228?language=en", "title": "Animals.", "resume": "An animated comedy focusing on the downtrodden creatures native to Earth’s least-habitable environment: New York City. Whether it’s lovelorn rats, gender-questioning pigeons or aging bedbugs in the midst of a midlife crisis, the awkward small talk, moral ambiguity and existential woes of non-human urbanites prove startlingly similar to our own.", "rate": 58, "genre": ["Animation", "Comedy"], "cast": ["Phil Matarese", "Mike Luciano", "Jason Mantzoukas", "Nathan Fielder", "Katie Aselton"], "character": ["Phil", "Mike", "Fink", "DJ Lab Rat", "Mom / Rebecca"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65228   Expand Animals.   (2016) User Score  Play Trailer Overview An animated comedy focusing on the downtrodden creatures native to Earth’s least-habitable environment: New York City. Whether it’s lovelorn rats, gender-questioning pigeons or aging bedbugs in the midst of a midlife crisis, the awkward small talk, moral ambiguity and existential woes of non-human urbanites prove startlingly similar to our own. Featured Crew Phil Matarese Creator Mike Luciano Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil Matarese Phil Mike Luciano Mike Jason Mantzoukas Fink Nathan Fielder DJ Lab Rat Katie Aselton Mom / Rebecca Full Cast & Crew Next Season Season 3 2018 | 1 Episode Season 3 of Animals. is set to premiere on August  3, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  11 Recommendations   2016-03-01 Loosely Exactly Nicole 5.8    2013-11-24 Getting On 6.8    2015-10-16 Truth Be Told 5.5    2009-07-08 Getting On 6.7    2016-01-13 Teachers 7.1    2017-05-17 Downward Dog 6.7    2016-10-19 HIM 6.2    2016-06-07 Agatha Raisin 6.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  28m, 22m, 25m Homepage   http://www.hbo.com/animals Genres Animation Comedy Keywords talking animal anthropomorphism new york city adult animation urbanites Content Score 100 Yes! Looking good! Top Contributors 81 Elizabeth Jennings 14 Maretoh 6 Banana AK 4 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}