{"link": "https://www.themoviedb.org/tv/51823?language=en", "title": "The Legacy", "resume": "The death of a matriarch brings forgotten secrets out into the open and causes a prolonged battle for the family inheritance.", "rate": 79, "genre": ["Drama"], "cast": ["Trine Dyrholm", "Jesper Christensen", "Carsten Bjørnlund", "Mikkel Boe Følsgaard", "Marie Bach Hansen"], "character": ["Gro", "Thomas", "Frederik", "Emil", "Signe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51823   Expand The Legacy   (2014) User Score  Play Trailer Overview The death of a matriarch brings forgotten secrets out into the open and causes a prolonged battle for the family inheritance. Featured Crew Maya Ilsøe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  12 Posters  4 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Trine Dyrholm Gro Jesper Christensen Thomas Carsten Bjørnlund Frederik Mikkel Boe Følsgaard Emil Marie Bach Hansen Signe Full Cast & Crew Last Season Season 3 2017 | 9 Episodes Season 3 of The Legacy premiered on January  1, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply SB Seasons 1 and 2 Open 0 by Glen Griffiths\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  12 Posters  4 Recommendations   2011-09-21 The Bridge 8.0    2013-09-12 Peaky Blinders 8.2  Facts Original Name  Arvingerne Status  Returning Series Networks Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  Danish Runtime  60m Homepage   http://www.dr.dk/dr1/arvingerne/ Genres Drama Keywords family history family secret conflict heir nordic noir Content Score 100 Yes! Looking good! Top Contributors s 59 setec 24 Steve 20 Elizabeth Jennings md 9 movie dino  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}