{"link": "https://www.themoviedb.org/tv/2009?language=en", "title": "Rocket Power", "resume": "Rocket Power is an American animated television series that aired on Nickelodeon for three seasons. The show mainly revolves around 4 friends and their daily lives of playing extreme sports, surfing, and getting into some crazy situations.", "rate": 65, "genre": ["Animation", "Comedy", "Family"], "cast": ["Joseph Ashton", "Shayna Fox", "John Kassir", "Ray Bumatai", "Gary LeRoi Gray"], "character": ["Otto Rocket (voice)", "Reggie Rocket (voice)", "Ray Rocket (voice)", "Tito Makani (voice)", "Sam Dullard (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2009   Expand Rocket Power   (1999) User Score Overview Rocket Power is an American animated television series that aired on Nickelodeon for three seasons. The show mainly revolves around 4 friends and their daily lives of playing extreme sports, surfing, and getting into some crazy situations. Featured Crew Arlene Klasky Creator Gábor Csupó Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joseph Ashton Otto Rocket (voice) Shayna Fox Reggie Rocket (voice) John Kassir Ray Rocket (voice) Ray Bumatai Tito Makani (voice) Gary LeRoi Gray Sam Dullard (voice) Full Cast & Crew Last Season Season 3 2001 | 39 Episodes Season 3 of Rocket Power premiered on September 10, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1998-03-01 CatDog 6.4    1998-09-01 The Wild Thornberrys 6.0    1996-10-07 Hey Arnold! 6.8    1997-04-20 The Angry Beavers 6.9    2003-08-01 My Life as a Teenage Robot 6.1    1991-08-11 Rugrats 7.1    1994-10-30 Aaahh!!! Real Monsters 6.4    2002-12-06 Codename: Kids Next Door 6.5  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m, 24m Homepage   http://www.facebook.com/pages/Rocket-Power/126300870718765 Genres Animation Comedy Family Keywords california sport kids Content Score 93 Almost there... Top Contributors 43 Banana 36 linkeurena 6 niqo19 A 5 AnthonyAtkins232  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}