{"link": "https://www.themoviedb.org/tv/61720?language=en", "title": "Violetta", "resume": "Violetta is an Argentine telenovela filmed in Buenos Aires, Argentina and developed by Disney Channel Latin America and Europe, Middle East and Africa (EMEA) and production company Pol-ka, debuted in its country of origin, Latin America and Italy on May 14, 2012.\nVioletta tells the story of a musically talented teenager (played by Argentine actress Martina Stoessel) who returns to her native Buenos Aires with her father, Herman, (played by Diego Ramos) after living in Europe for several years, navigating the trials and tribulations of growing up.\nEach episode includes original musical numbers from diverse musical genres such as pop music and popular music.", "rate": 75, "genre": ["Family"], "cast": ["Martina Stoessel", "Jorge Blanco", "Diego Ramos", "Mercedes Lambre", "Alba Rico"], "character": ["Violetta", "León", "Germán", "Ludmila", "Naty"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61720   Expand Violetta   (2012) User Score Overview Violetta is an Argentine telenovela filmed in Buenos Aires, Argentina and developed by Disney Channel Latin America and Europe, Middle East and Africa (EMEA) and production company Pol-ka, debuted in its country of origin, Latin America and Italy on May 14, 2012. Violetta tells the story of a musically talented teenager (played by Argentine actress Martina Stoessel) who returns to her native Buenos Aires with her father, Herman, (played by Diego Ramos) after living in Europe for several years, navigating the trials and tribulations of growing up. Each episode includes original musical numbers from diverse musical genres such as pop music and popular music. Featured Crew Víctor Tevah Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martina Stoessel Violetta Jorge Blanco León Diego Ramos Germán Mercedes Lambre Ludmila Alba Rico Naty Full Cast & Crew Last Season Season 3 2014 | 2 Episodes Season 3 of Violetta premiered on July 28, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  1 Recommendations   2009-11-28 Big Time Rush 4.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  45m Homepage   http://disneychannel.disneylatino.com/violetta Genres Family Keywords musical argentina telenovela Content Score 93 Almost there... Top Contributors 50 SWFT V 11 Vaine 8 Elizabeth Jennings z 4 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}