{"link": "https://www.themoviedb.org/tv/79028?language=en", "title": "Power Couple Brasil", "resume": "Confined in a mansion in Sao Paulo, couples will have to face trials of endurance, skill and reasoning and, of course, test how much one knows the other. In the end, only the strongest couple with the best knowledge of themselves will win the competition.", "rate": 27, "genre": ["Reality"], "cast": ["Gugu Liberato"], "character": ["Host - Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 79028   Expand Power Couple Brasil   (2016) User Score Overview Confined in a mansion in Sao Paulo, couples will have to face trials of endurance, skill and reasoning and, of course, test how much one knows the other. In the end, only the strongest couple with the best knowledge of themselves will win the competition. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gugu Liberato Host - Himself Full Cast & Crew Current Season Season 3 2018 | 48 Episodes Season 3 of Power Couple Brasil premiered on April 24, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Power Couple Brasil. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification L Meaning Content is suitable for all audiences. Type  Reality Original Language  Portuguese Runtime  90m Homepage   http://entretenimento.r7.com/power-couple-brasil-3 Genres Reality Keywords competition married couple Content Score 56 We're so close, yet so far. Top Contributors HS 45 Hugo S.  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}