{"link": "https://www.themoviedb.org/tv/60611?language=en", "title": "Believe", "resume": "Believe is about an unlikely relationship between a gifted young girl and a man sprung from prison who has been tasked with protecting her from the evil elements that hunt her power.", "rate": 65, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Jake McLaughlin", "Johnny Sequoyah", "Jamie Chung", "Delroy Lindo", "Kyle MacLachlan"], "character": ["Willam Tate", "Bo Adams", "Channing", "Dr. Milton Winter", "Roman Skouras"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60611   Expand Believe   (2014) User Score  Play Trailer Overview Believe is about an unlikely relationship between a gifted young girl and a man sprung from prison who has been tasked with protecting her from the evil elements that hunt her power. Featured Crew Alfonso Cuarón Creator Mark Friedman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jake McLaughlin Willam Tate Johnny Sequoyah Bo Adams Jamie Chung Channing Delroy Lindo Dr. Milton Winter Kyle MacLachlan Roman Skouras Full Cast & Crew Last Season Season 1 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  6 Recommendations   2014-05-15 Resurrection 6.9    2012-10-04 Hunted 7.1    2013-11-17 Almost Human 7.0    2014-01-07 Intelligence 6.3    2014-08-23 Intruders 6.5    2013-10-06 Witches of East End 6.6    2015-01-27 Stalker 5.8    2011-07-11 Alphas 6.5  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/believe Genres Sci-Fi & Fantasy Drama Keywords telekinesis secret government organization superhuman ex-con supernatural ability Content Score 100 Yes! Looking good! Top Contributors 32 Travis Bell f 27 furkan-guven0115 20 Banana 17 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}