{"link": "https://www.themoviedb.org/tv/894?language=en", "title": "The Prisoner", "resume": "After resigning, a secret agent is abducted and taken to what looks like an idyllic village, but is really a bizarre prison. His warders demand information. He gives them nothing, but only tries to escape.", "rate": 76, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Patrick McGoohan", "Peter Swanwick", "Angelo Muscat"], "character": ["Number 6", "Supervisor", "The Butler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 894   Expand The Prisoner   (1967) User Score  Play Trailer Overview After resigning, a secret agent is abducted and taken to what looks like an idyllic village, but is really a bizarre prison. His warders demand information. He gives them nothing, but only tries to escape. Featured Crew Patrick McGoohan Creator George Markstein Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  31 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patrick McGoohan Number 6 Peter Swanwick Supervisor Angelo Muscat The Butler Full Cast & Crew Last Season Season 1 1967 | 17 Episodes Season 1 of The Prisoner premiered on September 29, 1967. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply The Prisoner - big budget movie? Open 1 by  lima-2 Iconic Open 3 by  fan_of_films Go to Discussions Media Most Popular Videos  1 Backdrops  31 Posters  12 Recommendations   1983-10-03 Scarecrow and Mrs. King 5.5    1992-02-18 Men Behaving Badly 7.4    2003-09-11 QI 8.2    1998-11-12 Dinnerladies 6.4    1982-11-02 The Comic Strip Presents 7.0    1955-10-02 Alfred Hitchcock Presents 7.8    1995-04-21 Father Ted 7.9    1990-11-18 House of Cards 8.3  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  60m, 50m, 48m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords small town kidnapping trapped strange event Content Score 71 Just a little bit more... Top Contributors 16 Banana 7 Elizabeth Jennings O 5 Ozbourne 4 luftikus009  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}