{"link": "https://www.themoviedb.org/tv/43058?language=en", "title": "Real Humans", "resume": "Set in a parallel universe, Real Humans imagines a world where robots have become so human that they're barely distinguishable from real humans and follows the resulting emotional effects on two families as well as the trials of a group of robots who have attained free will and want their freedom from human ownership.", "rate": 77, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Lisette Pagler", "Pia Halvorsen", "Johan Paulsen", "Natalie Minnevik", "Kåre Hedebrant"], "character": ["Mimi", "Inger Engman", "Hans Engman", "Mathilda Engman", "Tobias Engman"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43058   Expand Real Humans   (2012) User Score  Play Trailer Overview Set in a parallel universe, Real Humans imagines a world where robots have become so human that they're barely distinguishable from real humans and follows the resulting emotional effects on two families as well as the trials of a group of robots who have attained free will and want their freedom from human ownership. Featured Crew Lars Lundström Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lisette Pagler Mimi Pia Halvorsen Inger Engman Johan Paulsen Hans Engman Natalie Minnevik Mathilda Engman Kåre Hedebrant Tobias Engman Full Cast & Crew Last Season Season 2 2013 | 10 Episodes Season 2 of Real Humans premiered on December  1, 2013. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Season 3? Open 0 by warrior-poet\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  7 Recommendations   2014-10-12 1864 6.4    2002-06-21 Odyssey 5 6.9    2010-01-29 Solsidan 6.7    2014-08-23 Intruders 6.5    2015-03-25 Big Time in Hollywood, Fl 5.7    1999-09-24 Now and Again 6.1    2013-12-04 Mob City 7.0    2000-04-16 The Corner 7.1  Facts Original Name  Äkta människor Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  Swedish Runtime  60m Homepage   http://www.svt.se/akta-manniskor/ Genres Drama Sci-Fi & Fantasy Keywords artificial intelligence technology robot Content Score 100 Yes! Looking good! Top Contributors 117 Marr 🇳🇱 15 Elizabeth Jennings 9 Banana 6 Trottel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}