{"link": "https://www.themoviedb.org/tv/4345?language=en", "title": "Saved by the Bell", "resume": "Saved by the Bell is an American television sitcom that aired on NBC from 1989 to 1993. The series was a retool of the Disney Channel series Good Morning, Miss Bliss. The show follows the exploits of a group of friends and their principal, and although the series primarily showcases light-hearted comedic situations, it occasionally touches on serious social issues, such as drug use, driving under the influence, homelessness, divorce, death, and environmental issues. This made Saved by the Bell a precursor to later shows that introduce young audiences to critical moral dilemmas.\nSaved by the Bell stars Mark-Paul Gosselaar, Dustin Diamond, Lark Voorhies, Dennis Haskins, Tiffani-Amber Thiessen, Elizabeth Berkley, and Mario Lopez.\nSaved by the Bell was named one of the \"20 Best School Shows of All Time\" by AOL TV. The show's popularity spawned two spin-off series to follow: Saved by the Bell: The College Years, a prime time series that follows several of the original characters to college, and Saved by the Bell: The New Class, a Saturday morning series that follows a new group of students at Bayside High School. The series also spawned two TV movies and a short-lived comic book series. Saved by the Bell also aired in Australia on Channel Seven, and from 1990 until 2004 on Nickelodeon. Reruns have aired in local syndication and on MTV2.", "rate": 63, "genre": ["Comedy", "Drama", "Family"], "cast": ["Lark Voorhies", "Elizabeth Berkley", "Mario López", "Tiffani Thiessen", "Mark-Paul Gosselaar"], "character": ["Lisa Turtle", "Jessie Spano", "A.C. Slater", "Kelly Kapowski", "Zack Morris"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4345   Expand Saved by the Bell   (1989) User Score  Play Trailer Overview Saved by the Bell is an American television sitcom that aired on NBC from 1989 to 1993. The series was a retool of the Disney Channel series Good Morning, Miss Bliss. The show follows the exploits of a group of friends and their principal, and although the series primarily showcases light-hearted comedic situations, it occasionally touches on serious social issues, such as drug use, driving under the influence, homelessness, divorce, death, and environmental issues. This made Saved by the Bell a precursor to later shows that introduce young audiences to critical moral dilemmas. Saved by the Bell stars Mark-Paul Gosselaar, Dustin Diamond, Lark Voorhies, Dennis Haskins, Tiffani-Amber Thiessen, Elizabeth Berkley, and Mario Lopez. Saved by the Bell was named one of the \"20 Best School Shows of All Time\" by AOL TV. The show's popularity spawned two spin-off series to follow: Saved by the Bell: The College Years, a prime time series that follows several of the original characters to college, and Saved by the Bell: The New Class, a Saturday morning series that follows a new group of students at Bayside High School. The series also spawned two TV movies and a short-lived comic book series. Saved by the Bell also aired in Australia on Channel Seven, and from 1990 until 2004 on Nickelodeon. Reruns have aired in local syndication and on MTV2. Featured Crew Sam Bobrick Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lark Voorhies Lisa Turtle Elizabeth Berkley Jessie Spano Mario López A.C. Slater Tiffani Thiessen Kelly Kapowski Mark-Paul Gosselaar Zack Morris Full Cast & Crew Last Season Season 4 1992 | 26 Episodes Season 4 of Saved by the Bell premiered on September 12, 1992. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply w Kelly: Happy Birthday Tiffani Thiessen! Open 0 by wonder2wonder\n      \n     w Slater: Happy Birthday Mario López! Open 0 by wonder2wonder\n      \n     w Jessie: happy Birthday Elizabeth Berkley! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   1991-09-17 Home Improvement 7.0    1989-09-22 Family Matters 6.2    1985-09-24 Growing Pains 6.1    1984-09-20 The Cosby Show 6.8    1988-10-18 Roseanne 6.7    1987-09-22 Full House 5.9    1990-09-10 The Fresh Prince of Bel-Air 7.3    1995-09-13 The Drew Carey Show 6.4  Facts Status  Ended Networks Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m, 20m, 23m Homepage  - Genres Comedy Drama Family Keywords high school teen comedy sitcom Content Score 100 Yes! Looking good! Top Contributors 9 Banana M 9 Manu a 8 alexmate 8 DarkMan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}