{"link": "https://www.themoviedb.org/tv/61663?language=en", "title": "Your Lie in April", "resume": "Kousei Arima was a genius pianist until his mother's sudden death took away his ability to play. Each day was dull for Kousei. But, then he meets a violinist named Kaori Miyazono who has an eccentric playing style. Can the heartfelt sounds of the girl's violin lead the boy to play the piano again?", "rate": 85, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Natsuki Hanae", "Risa Taneda", "Ayane Sakura", "Ryota Ohsaka"], "character": ["Kousei Arima (voice)", "Kaori Miyazono (voice)", "Tsubaki Sawabe (voice)", "Ryouta Watari (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61663   Expand Your Lie in April   (2014) User Score  Play Trailer Overview Kousei Arima was a genius pianist until his mother's sudden death took away his ability to play. Each day was dull for Kousei. But, then he meets a violinist named Kaori Miyazono who has an eccentric playing style. Can the heartfelt sounds of the girl's violin lead the boy to play the piano again? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  5 Videos Trailers  3 Teasers  0 Clips  0 Featurettes  0 Opening Credits  5 Top Billed Cast Natsuki Hanae Kousei Arima (voice) Risa Taneda Kaori Miyazono (voice) Ayane Sakura Tsubaki Sawabe (voice) Ryota Ohsaka Ryouta Watari (voice) Full Cast & Crew Last Season Season 1 2014 | 22 Episodes Season 1 of Your Lie in April premiered on October 10, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  8 Backdrops  4 Posters  5 Recommendations   2013-04-05 My Teen Romantic Comedy SNAFU 7.4    2015-04-05 Plastic Memories 6.8    2015-10-03 K-Project 6.3    2013-12-24 Turbo FAST 4.7    2005-03-25 Krypto the Superdog 1.3    2015-07-05 Charlotte 6.8    2014-04-06 Brynhildr in the Darkness 7.6    2014-01-05 Noragami 7.4  Facts Original Name  四月は君の嘘 Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://www.kimiuso.jp/ Genres Animation Comedy Drama Keywords music school based on manga piano anime Content Score 93 Almost there... Top Contributors 85 Marr 🇳🇱 37 clauseover 22 sp1ti 20 NekoMeowww  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}