{"link": "https://www.themoviedb.org/tv/65454?language=en", "title": "Horace and Pete", "resume": "The owners of a dive bar in Brooklyn, Horace and Pete, along with bar regulars share their experiences and lives with each other while drinking or working at the bar.", "rate": 74, "genre": ["Drama", "Comedy"], "cast": ["Louis C.K.", "Steve Buscemi", "Edie Falco", "Alan Alda", "Jessica Lange"], "character": ["Horace", "Pete", "Sylvia", "Uncle Pete", "Marsha"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65454   Expand Horace and Pete   (2016) User Score Overview The owners of a dive bar in Brooklyn, Horace and Pete, along with bar regulars share their experiences and lives with each other while drinking or working at the bar. Featured Crew Louis C.K. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Louis C.K. Horace Steve Buscemi Pete Edie Falco Sylvia Alan Alda Uncle Pete Jessica Lange Marsha Full Cast & Crew Last Season Season 1 2016 | 10 Episodes Season 1 of Horace and Pete premiered on January 30, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply In Awe...(spoilers) Open 0 by bestdayever\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   2000-04-16 The Corner 7.1    2016-01-21 Baskets 7.2    2013-04-19 Alpha House 7.3    2013-07-21 Axe Cop 5.5    2017-08-13 Get Shorty 6.2    2016-09-08 Better Things 6.7    2012-02-27 Danger 5 7.7    2006-06-11 Lucky Louie 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 43m, 51m, 67m Homepage   https://louisck.net/show/horace-and-pete Genres Drama Comedy Keywords sibling relationship parent child relationship bar dark comedy brooklyn new york city Content Score 93 Almost there... Top Contributors 94 Elizabeth Jennings 6 RubeensVinicius 5 lol32lol K 3 Kadang  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}