{"link": "https://www.themoviedb.org/tv/62476?language=en", "title": "The Bureau", "resume": "Within the DGSE (General Directorate for External Security), a department called the Office Of Legends (BDL) forms and remote pilot the most important agents of the French intelligence services: Clandestine. Immersion in hostile country, their mission is to identify individuals who may be recruited as sources of information. Operating \"under caption\", that is to say in a fabricated identity from scratch, they live for many years in a permanent duplicity. Our hero just returned from a clandestine mission six years in Damascus. But contrary to what is required by safety rules, he does not abandon his legend and the identity under which he lived in Syria, thus putting in danger the whole system.", "rate": 82, "genre": ["Drama"], "cast": ["Mathieu Kassovitz", "Jean-Pierre Darroussin", "Léa Drucker", "Sara Giraudeau"], "character": ["Guillaume Debailly", "Henri Duflot", "Docteur Balmes", "Marina Loiseau"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62476   Expand The Bureau   (2015) User Score  Play Trailer Overview Within the DGSE (General Directorate for External Security), a department called the Office Of Legends (BDL) forms and remote pilot the most important agents of the French intelligence services: Clandestine. Immersion in hostile country, their mission is to identify individuals who may be recruited as sources of information. Operating \"under caption\", that is to say in a fabricated identity from scratch, they live for many years in a permanent duplicity. Our hero just returned from a clandestine mission six years in Damascus. But contrary to what is required by safety rules, he does not abandon his legend and the identity under which he lived in Syria, thus putting in danger the whole system. Featured Crew Eric Rochant Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mathieu Kassovitz Guillaume Debailly Jean-Pierre Darroussin Henri Duflot Léa Drucker Docteur Balmes Sara Giraudeau Marina Loiseau Full Cast & Crew Last Season Season 3 2017 | 10 Episodes Season 3 of The Bureau premiered on May 22, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  4 Recommendations   2008-01-19 Breaking Bad 8.3    2007-09-24 The Big Bang Theory 6.8  Facts Original Name  Le Bureau des légendes Status  Returning Series Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  French Runtime  55m Homepage   http://www.canalplus.fr/c-series/pid8008-c-le-bureau-des-legendes.html Genres Drama Keywords undercover agent secret identity Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings 10 gonzooin M 7 Manu S 6 Shady12  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}