{"link": "https://www.themoviedb.org/tv/12323?language=en", "title": "Beyond Belief: Fact or Fiction", "resume": "Beyond Belief: Fact or Fiction is an American television anthology series created by Lynn Lehmann, presented by Dick Clark Productions, and produced and aired by the Fox network from 1997 to 2002. Each episode featured five stories, all of which appeared to defy logic, and some of which were allegedly based on actual events. The viewer was offered the challenge of determining which are true and which are false. At the end of the show, it was revealed to the viewer whether the tales were true or works of fiction.\nThe series was hosted by James Brolin in season one and later by Jonathan Frakes for the remainder of the series. The show was narrated by Don LaFontaine for the first three seasons and by Campbell Lane for the fourth and final season.", "rate": 71, "genre": ["Sci-Fi", "Fantasy"], "cast": ["James Brolin", "Jonathan Frakes", "Don LaFontaine", "Campbell Lane", "Grace Park"], "character": ["Host", "Host", "Maddie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12323   Expand Beyond Belief: Fact or Fiction   (1998) User Score Overview Beyond Belief: Fact or Fiction is an American television anthology series created by Lynn Lehmann, presented by Dick Clark Productions, and produced and aired by the Fox network from 1997 to 2002. Each episode featured five stories, all of which appeared to defy logic, and some of which were allegedly based on actual events. The viewer was offered the challenge of determining which are true and which are false. At the end of the show, it was revealed to the viewer whether the tales were true or works of fiction. The series was hosted by James Brolin in season one and later by Jonathan Frakes for the remainder of the series. The show was narrated by Don LaFontaine for the first three seasons and by Campbell Lane for the fourth and final season. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Brolin Host Jonathan Frakes Host Don LaFontaine Campbell Lane Grace Park Maddie Full Cast & Crew Last Season Season 4 2002 | 13 Episodes Season 4 of Beyond Belief: Fact or Fiction premiered on June 27, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2004-07-01 Salad Fingers 7.7    1987-01-20 Unsolved Mysteries 7.4    1986-05-28 Pingu 6.5    2013-03-17 In the Flesh 7.4    1995-03-26 The Outer Limits 8.0    1989-08-20 Saved by the Bell 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 43m Homepage  - Genres Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors l 10 luckyplaya84 z 10 zurman1 8 Lucy 4 hpcodecraft  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}