{"link": "https://www.themoviedb.org/tv/61469?language=en", "title": "Survivor's Remorse", "resume": "Cam Calloway is about to find out the price he'll pay for stardom, love and loyalty. A basketball star in his early 20s, Calloway's life changes after he signs a multimillion-dollar contract with a team in Atlanta. He arrives in Georgia bright-eyed and eager to begin his career, joined by cousin and confidant Reggie Vaughn, who tries to keep Cam focused and free from distractions caused by Cam's blunt-but-loyal sister M-Chuck and opportunistic mom Cassie. Feeling a responsibility to support needy family and friends, Cam wrestles with the rewards and pitfalls of sudden wealth and fame.", "rate": 70, "genre": ["Drama"], "cast": ["Jessie Usher", "RonReaco Lee", "Teyonah Parris", "Mike Epps", "Erica Ash"], "character": ["Cam Calloway", "Reggie Vaughn", "Missy Vaughn", "Uncle Julius", "Mary Charles 'M-Chuck' Calloway"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61469   Expand Survivor's Remorse   (2014) User Score  Play Trailer Overview Cam Calloway is about to find out the price he'll pay for stardom, love and loyalty. A basketball star in his early 20s, Calloway's life changes after he signs a multimillion-dollar contract with a team in Atlanta. He arrives in Georgia bright-eyed and eager to begin his career, joined by cousin and confidant Reggie Vaughn, who tries to keep Cam focused and free from distractions caused by Cam's blunt-but-loyal sister M-Chuck and opportunistic mom Cassie. Feeling a responsibility to support needy family and friends, Cam wrestles with the rewards and pitfalls of sudden wealth and fame. Featured Crew Mike O'Malley Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jessie Usher Cam Calloway RonReaco Lee Reggie Vaughn Teyonah Parris Missy Vaughn Mike Epps Uncle Julius Erica Ash Mary Charles 'M-Chuck' Calloway Full Cast & Crew Last Season Season 4 2017 | 10 Episodes Season 4 of Survivor's Remorse premiered on August 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Survivor's Remorse. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  25m Homepage   https://www.starz.com/series/survivorsremorse Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 46 Elizabeth Jennings 16 Banana z 4 zurman1 4 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}