{"link": "https://www.themoviedb.org/tv/67232?language=en", "title": "The Son", "resume": "The multigenerational epic follows two concurrent time periods: One, the story of young Eli McCullough after he is kidnapped and indoctrinated into a tribe of Comanches in 1849. The other, 60 years later, when we see a grown Eli struggle to maintain his family’s cattle empire during the turbulent Bandit Wars of South Texas. Based on Philipp Meyer’s acclaimed novel.", "rate": 68, "genre": ["Drama"], "cast": ["Pierce Brosnan", "Henry Garrett", "Jacob Lofland", "Zahn McClarnon", "Elizabeth Frances"], "character": ["Eli McCullough", "Pete McCullough", "Young Eli McCullough", "Toshaway", "Prairie Flower"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67232   Expand The Son   (2017) User Score  Play Trailer Overview The multigenerational epic follows two concurrent time periods: One, the story of young Eli McCullough after he is kidnapped and indoctrinated into a tribe of Comanches in 1849. The other, 60 years later, when we see a grown Eli struggle to maintain his family’s cattle empire during the turbulent Bandit Wars of South Texas. Based on Philipp Meyer’s acclaimed novel. Featured Crew Philippe Meyer Creator Lee Shipman Creator Brian McGreevy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Pierce Brosnan Eli McCullough Henry Garrett Pete McCullough Jacob Lofland Young Eli McCullough Zahn McClarnon Toshaway Elizabeth Frances Prairie Flower Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of The Son premiered on April  8, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply Loving the young Eli story line... Open 2 by  ApathyandBeyond Great Conservative Series... Open 3 by  clunybrown2017 Eli's Age Open 2 by  FatDrunkAndStupid Go to Discussions Media Most Popular Videos  2 Backdrops  3 Posters  2 Recommendations   2018-02-11 Here and Now 7.7    2017-11-05 SMILF 6.7    2015-08-05 Difficult People 7.4    2018-03-25 Trust 7.4    2017-01-25 Mary Kills People 7.5    2016-06-05 Feed the Beast 6.2    2017-01-18 SIX 7.1    2016-05-26 Private Eyes 6.0  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  45m Homepage   http://www.amc.com/shows/the-son Genres Drama Keywords texas native american oil tycoon comanche Content Score 100 Yes! Looking good! Top Contributors 41 Elizabeth Jennings 17 Bendik p 4 plumpro 4 express  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}