{"link": "https://www.themoviedb.org/tv/2254?language=en", "title": "Sunset Beach", "resume": "Sunset Beach is an American television soap opera that aired on NBC from January 6, 1997 to December 31, 1999. The show follows the loves and lives of the people living in the Orange County coastal area named Sunset Beach, on the coast of California. Although there is a town in California called Sunset Beach, the show's beach scenes were shot on nearby Seal Beach. The show was co-produced by NBC and Spelling Television.\nSunset Beach won two Daytime Emmy Awards and was nominated another eleven times. The show also received twenty-two nominations for various other awards.", "rate": 66, "genre": ["Soap", "Drama"], "cast": ["Eddie Cibrian", "Kathleen Noone", "Nick Kiriazis", "Lesley-Anne Down", "Sarah Buxton"], "character": ["Cole Deschanel", "Bette Katzenkazrahi", "Father Antonio Torres", "Olivia Richards", "Annie Douglas Richards"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2254   Expand Sunset Beach   (1997) User Score Overview Sunset Beach is an American television soap opera that aired on NBC from January 6, 1997 to December 31, 1999. The show follows the loves and lives of the people living in the Orange County coastal area named Sunset Beach, on the coast of California. Although there is a town in California called Sunset Beach, the show's beach scenes were shot on nearby Seal Beach. The show was co-produced by NBC and Spelling Television. Sunset Beach won two Daytime Emmy Awards and was nominated another eleven times. The show also received twenty-two nominations for various other awards. Featured Crew Charles Pratt, Jr. Creator Robert Guza Jr. Creator Josh Griffith Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eddie Cibrian Cole Deschanel Kathleen Noone Bette Katzenkazrahi Nick Kiriazis Father Antonio Torres Lesley-Anne Down Olivia Richards Sarah Buxton Annie Douglas Richards Full Cast & Crew Last Season Season 3 1999 | 255 Episodes Season 3 of Sunset Beach premiered on January  6, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1990-10-04 Beverly Hills, 90210 5.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Soap Drama Keywords california soap opera Content Score 93 Almost there... Top Contributors 24 joel6 17 Banana D 3 Daniel s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}