{"link": "https://www.themoviedb.org/tv/4266?language=en", "title": "Party of Five", "resume": "Following his parents' tragic death, 24-year-old Charlie Salinger is back at home – and in over his head – as his siblings' legal guardian. Together, Charlie, 16-year-old Bailey, 15-year-old Julia and 11-year-old Claudia share the responsibility of taking care of 11-month-old Owen. Through it all, as they learn to run their parents' restaurant, manage disastrous relationships and school problems.", "rate": 63, "genre": ["Drama"], "cast": ["Scott Wolf", "Neve Campbell", "Matthew Fox", "Lacey Chabert", "Jennifer Love Hewitt"], "character": ["Bailey Salinger", "Julia Salinger", "Charlie Salinger", "Claudia Salinger", "Sarah Reeves"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4266   Expand Party of Five   (1994) User Score Overview Following his parents' tragic death, 24-year-old Charlie Salinger is back at home – and in over his head – as his siblings' legal guardian. Together, Charlie, 16-year-old Bailey, 15-year-old Julia and 11-year-old Claudia share the responsibility of taking care of 11-month-old Owen. Through it all, as they learn to run their parents' restaurant, manage disastrous relationships and school problems. Featured Crew Christopher Keyser Creator Amy Lippman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  13 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Scott Wolf Bailey Salinger Neve Campbell Julia Salinger Matthew Fox Charlie Salinger Lacey Chabert Claudia Salinger Jennifer Love Hewitt Sarah Reeves Full Cast & Crew Last Season Season 6 1999 | 24 Episodes Season 6 of Party of Five premiered on October  5, 1999. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Julia:  Happy Birthday Neve Campbell! Open 0 by wonder2wonder\n      \n     w Claudia: Happy Birthday Lacey Chabert! Open 0 by wonder2wonder\n      \n     w Charlie Salinger: Happy Birthday Matthew Fox! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  13 Posters  6 Recommendations   1990-10-04 Beverly Hills, 90210 5.8    1992-07-08 Melrose Place 4.9    1997-09-08 Ally McBeal 5.9    1986-09-13 The Real Ghostbusters 6.9    2001-07-06 Dinner for Five 8.2    2016-03-21 72 Dangerous Places to Live 6.0    1988-10-01 RoboCop: The Animated Series 4.7    1993-04-21 Walker, Texas Ranger 5.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage  - Genres Drama Keywords sibling relationship san francisco big family death of parent child care living with sibling Content Score 93 Almost there... Top Contributors 25 Imzadi 17 Banana b 9 bugfix 6 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}