{"link": "https://www.themoviedb.org/tv/75886?language=en", "title": "What the Duck: The Series", "resume": "The relationship of several couples who try to search for the meaning of the word ‘love’ which differ.\nPop and Mo are a young couple, in which the girl has dreams of becoming a steward and air hostess but only the girl, Mo, alone becomes an air hostess in an airline as what she dreamt of. That makes the guy, Pop, have to reluctantly work in the Catering department of the airlineinstead. This is just to be near airplanes, his girlfriend, and the steward profession that he dreams of. He then finds that his definition of love changes when he meets Oat, a trouble making coworker in Catering.\nWhile working he becomes the one that people make fun of. “Necessary wife” is the position that he unhappily becomes because Oat likes to irritate and tease him often. Having to work together makes these two unintentionally become rivals in the workplace. Oat annoys Pop a lot, such that Pop doesn't know what to do with him. But the relationship of this couple progresses from not liking each other's faces to becoming a close firm friendship before they realize it.  At the same time, Mo meets Nick, a handsome pilot trainee of the airline, who is very dedicated to her.", "rate": 0, "genre": ["Comedy", "Drama"], "cast": ["Puwanai Sangwan", "Charoenchai Khantichaikhajohn", "Satida Pinsinchai", "Pranapong Khaisang", "Suppasit Jongcheveevat"], "character": ["Pop", "Oat", "Mo", "Nick", "Pree"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75886   Expand What the Duck: The Series   (2018) User Score  Play Trailer Overview The relationship of several couples who try to search for the meaning of the word ‘love’ which differ. Pop and Mo are a young couple, in which the girl has dreams of becoming a steward and air hostess but only the girl, Mo, alone becomes an air hostess in an airline as what she dreamt of. That makes the guy, Pop, have to reluctantly work in the Catering department of the airlineinstead. This is just to be near airplanes, his girlfriend, and the steward profession that he dreams of. He then finds that his definition of love changes when he meets Oat, a trouble making coworker in Catering. While working he becomes the one that people make fun of. “Necessary wife” is the position that he unhappily becomes because Oat likes to irritate and tease him often. Having to work together makes these two unintentionally become rivals in the workplace. Oat annoys Pop a lot, such that Pop doesn't know what to do with him. But the relationship of this couple progresses from not liking each other's faces to becoming a close firm friendship before they realize it.  At the same time, Mo meets Nick, a handsome pilot trainee of the airline, who is very dedicated to her. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Puwanai Sangwan Pop Charoenchai Khantichaikhajohn Oat Satida Pinsinchai Mo Pranapong Khaisang Nick Suppasit Jongcheveevat Pree Full Cast & Crew Current Season Season 1 2018 | 20 Episodes Season 1 of What the Duck: The Series premiered on January  1, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on What the Duck: The Series. You can help by rating TV shows you've seen. Facts Original Name  What the Duck รักแลนดิ้ง Status  In Production Network Certification  - Type  Scripted Original Language  Thai Runtime  40m Homepage  - Genres Comedy Drama Keywords gay romance school Content Score 93 Almost there... Top Contributors 38 kbogesz 3 winnersx265 m 1 megkd 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}