{"link": "https://www.themoviedb.org/tv/67280?language=en", "title": "Divorce", "resume": "A couple goes through a long, drawn-out divorce.", "rate": 61, "genre": ["Comedy"], "cast": ["Sarah Jessica Parker", "Thomas Haden Church", "Molly Shannon", "Talia Balsam", "Charlie Kilgore"], "character": ["Frances DuFresne", "Robert DuFresne", "Diane", "Dallas", "Tom DuFresne"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67280   Expand Divorce   (2016) User Score  Play Trailer Overview A couple goes through a long, drawn-out divorce. Featured Crew Sharon Horgan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sarah Jessica Parker Frances DuFresne Thomas Haden Church Robert DuFresne Molly Shannon Diane Talia Balsam Dallas Charlie Kilgore Tom DuFresne Full Cast & Crew Current Season Season 2 2018 | 8 Episodes Season 2 of Divorce premiered on January 14, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  6 Recommendations   2017-11-05 SMILF 6.7    2017-01-25 Mary Kills People 7.5    2014-09-26 Transparent 6.7    2016-06-07 Agatha Raisin 6.3    2017-03-16 The Marvelous Mrs. Maisel 8.0    2018-03-25 Barry 7.2    2015-08-05 Difficult People 7.4    2018-02-26 Good Girls 5.8  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage   http://www.hbo.com/divorce Genres Comedy Keywords dark comedy divorce middle age Content Score 100 Yes! Looking good! Top Contributors 37 henriquesene 32 Elizabeth Jennings 16 Banana a 7 adambakir92  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}