{"link": "https://www.themoviedb.org/tv/74024?language=en", "title": "Velvet Colección", "resume": "It is the year 1967. After five happy years of marriage in New York with Alberto and their young son, Anna Ribera returns to Spain to take her project Velvet to the next level. She and Alberto had been managing all things Velvet from across the ocean and, together with their best friends and partners, had made a name for Velvet as the number one address in the world of fashion and innovation. Now they decide to take the next step and turn their reputation into a franchise, first at home, then abroad. The first step is opening shop in the other great Spanish city, Barcelona, on its world famous promenade, the Passeig de Gracia. There, the second Velvet Fashion Store is about to open its gates, managed by Ana's good friend Clara who had made it up the career ladder from seamstress to directorial assistant in the Madrid Velvet years.", "rate": 100, "genre": ["Drama"], "cast": ["Imanol Arias", "Mónica Cruz", "Andrea Duro", "Paula Echevarría", "Patricia Conde"], "character": ["Eduard Godó", "Carmela Cortés", "Marie Leduc", "Ana Rivera", "Brigitte Bardot"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74024   Expand Velvet Colección   (2017) User Score Overview It is the year 1967. After five happy years of marriage in New York with Alberto and their young son, Anna Ribera returns to Spain to take her project Velvet to the next level. She and Alberto had been managing all things Velvet from across the ocean and, together with their best friends and partners, had made a name for Velvet as the number one address in the world of fashion and innovation. Now they decide to take the next step and turn their reputation into a franchise, first at home, then abroad. The first step is opening shop in the other great Spanish city, Barcelona, on its world famous promenade, the Passeig de Gracia. There, the second Velvet Fashion Store is about to open its gates, managed by Ana's good friend Clara who had made it up the career ladder from seamstress to directorial assistant in the Madrid Velvet years. Featured Crew Gustavo Ron Creator Jorge Torregrossa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Imanol Arias Eduard Godó Mónica Cruz Carmela Cortés Andrea Duro Marie Leduc Paula Echevarría Ana Rivera Patricia Conde Brigitte Bardot Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Velvet Colección premiered on September 20, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Velvet Colección. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  - Homepage   http://velvetcoleccion.movistarplus.es/ Genres Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors j 21 jordiAS2K 16 dariorufi 14 Elizabeth Jennings a 9 antoniwilson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}