{"link": "https://www.themoviedb.org/tv/43720?language=en", "title": "Neverland", "resume": "Neverland is an adventure/fantasy miniseries that aired on the Syfy network on December 4 and 5, 2011, and Sky Movies on December 9 and 16, written and directed by Nick Willing. It is a prequel to and re-imagining of the Peter Pan story.", "rate": 61, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Charlie Rowe", "Anna Friel", "Cas Anvar", "Charles Dance", "Rhys Ifans"], "character": ["Peter Pan", "Captain Elizabeth Bonny", "Gentleman Starkey", "Dr. Fludd", "James Hook"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 43720   Expand Neverland   (2011) User Score  Play Trailer Overview Neverland is an adventure/fantasy miniseries that aired on the Syfy network on December 4 and 5, 2011, and Sky Movies on December 9 and 16, written and directed by Nick Willing. It is a prequel to and re-imagining of the Peter Pan story. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  15 Posters  14 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Charlie Rowe Peter Pan Anna Friel Captain Elizabeth Bonny Cas Anvar Gentleman Starkey Charles Dance Dr. Fludd Rhys Ifans James Hook Full Cast & Crew Last Season Season 1 2011 | 2 Episodes Season 1 of Neverland premiered on December  4, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Neverland. Login to be first! Go to Discussions Media Most Popular Videos  2 Backdrops  15 Posters  14 Recommendations   2007-12-02 Tin Man 6.5    2009-12-06 Alice 6.3    2014-04-24 Black Box 6.4    2009-04-19 La prophétie de l'Oracle 4.8    2005-12-05 The Triangle 6.1    2000-05-07 Jason and the Argonauts 5.6    2008-09-03 Lost in Austen 7.2    1992-05-05 Forever Knight 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  120m Homepage  - Genres Sci-Fi & Fantasy Keywords peter pan growing up miniseries pirate troubled teen fantasy world Content Score 93 Almost there... Top Contributors TB 83 TMDb Bot 8 Dave 6 Banana 4 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}