{"link": "https://www.themoviedb.org/tv/34639?language=en", "title": "XIII: The Series", "resume": "After a plot to kill the president of the USA an agent with lost memories tries to recover his life and memories. Others use him to cover up some dirty business involving high ranking officials from the CIA and the White House.", "rate": 61, "genre": ["Action", "Adventure", "Drama"], "cast": ["Stuart Townsend", "Roxane Mesquida"], "character": ["XIII / Ross Tanner / Steve Rowland", "Betty Barnowsky"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34639   Expand XIII: The Series   (2011) User Score Overview After a plot to kill the president of the USA an agent with lost memories tries to recover his life and memories. Others use him to cover up some dirty business involving high ranking officials from the CIA and the White House. Featured Crew Jean Van Hamme Creator William Vance Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  5 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Stuart Townsend XIII / Ross Tanner / Steve Rowland Roxane Mesquida Betty Barnowsky Full Cast & Crew Last Season Season 2 2012 | 13 Episodes Season 2 of XIII: The Series premiered on September  1, 2012. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Too Many Times XIII Makes Stupid Decisions Open 0 by write2topcat\n      \n     Good Show but Open 0 by write2topcat\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  6 Recommendations   2009-02-25 Burnistoun 7.8    1999-01-13 Chewin' the Fat 8.2  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  52m, 44m Homepage   http://www.prodigypictures.com/xiii_ Genres Action & Adventure Drama Keywords memory loss conspiracy ex cia agent Content Score 64 We're so close, yet so far. Top Contributors 45 Banana 37 SuperMario 10 Elizabeth Jennings 4 sidvicio  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}