{"link": "https://www.themoviedb.org/tv/3714?language=en", "title": "Pippi Longstocking", "resume": "Pippi Longstocking is a TV series based on Astrid Lindgren's Pippi Longstocking children's books. The show ran for thirteen episodes, the first episode being broadcast 8 February 1969 on the then Swedish public service channel Sveriges Radio.\nThe series' theme song, \"Here Comes Pippi Longstocking\" was composed by Jan Johansson, with lyrics by Astrid Lindgren. The song was sung by series star Inger Nilsson.", "rate": 72, "genre": ["Comedy", "Drama", "Family", "Kids"], "cast": ["Inger Nilsson", "Maria Persson", "Pär Sundberg", "Margot Trooger", "Hans Clarin"], "character": ["Pippi Långstrump", "Annika", "Tommy", "Fröken Prysselius", "Dunder-Karlsson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3714   Expand Pippi Longstocking   (1969) User Score Overview Pippi Longstocking is a TV series based on Astrid Lindgren's Pippi Longstocking children's books. The show ran for thirteen episodes, the first episode being broadcast 8 February 1969 on the then Swedish public service channel Sveriges Radio. The series' theme song, \"Here Comes Pippi Longstocking\" was composed by Jan Johansson, with lyrics by Astrid Lindgren. The song was sung by series star Inger Nilsson. Featured Crew Astrid Lindgren Creator Olle Hellbom Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Inger Nilsson Pippi Långstrump Maria Persson Annika Pär Sundberg Tommy Margot Trooger Fröken Prysselius Hans Clarin Dunder-Karlsson Full Cast & Crew Last Season Season 2 1970 | 8 Episodes Season 2 of Pippi Longstocking premiered on December  6, 1970. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Pippi Longstocking. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  4 Recommendations   1954-09-12 Lassie 5.3    1975-11-22 Emil i Lönneberga 8.3    1982-10-08 Once upon a time… Space 5.9    1979-03-24 Once Upon a Time... Man 8.2    1987-09-20 My Two Dads 5.7    1987-06-17 Once Upon a Time... Life 8.0    1970-02-15 Catweazle 6.0    1982-09-24 Meister Eder und sein Pumuckl 5.6  Facts Original Name  Pippi Långstrump Status  Ended Network Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  Swedish Runtime  25m Homepage  - Genres Comedy Drama Family Kids Keywords based on children's book Content Score 93 Almost there... Top Contributors t 21 themechanic 19 Elizabeth Jennings S 14 Samara w 11 waRhawK  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}