{"link": "https://www.themoviedb.org/tv/72502?language=en", "title": "AHO-GIRL", "resume": "She is Yoshiko Hanabatake, and she's an idiot through and through. She loves bananas, and she loves her childhood friend Akkun. That is all!", "rate": 84, "genre": ["Comedy", "Animation"], "cast": ["Aoi Yuki", "Tomokazu Sugita", "Sayaka Harada", "Sumire Uesaka"], "character": ["Yoshiko Hanabatake (voice)", "Akuru Akutsu (voice)", "Sayaka Sumino (voice)", "Iinchou Fuuki (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72502   Expand AHO-GIRL   (2017) User Score Overview She is Yoshiko Hanabatake, and she's an idiot through and through. She loves bananas, and she loves her childhood friend Akkun. That is all! Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Aoi Yuki Yoshiko Hanabatake (voice) Tomokazu Sugita Akuru Akutsu (voice) Sayaka Harada Sayaka Sumino (voice) Sumire Uesaka Iinchou Fuuki (voice) Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of AHO-GIRL premiered on July  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   2010-01-05 Ladies versus Butlers! 10.0    2017-01-04 Akiba's Trip The Animation 8.8    2016-07-02 First Love Monster 5.7    2014-04-09 Chaika - The Coffin Princess 8.2    2017-07-04 Tsuredure Children 8.0    2017-07-07 18if 6.3    2017-07-09 A Centaur's Life 8.7    2015-07-09 Himouto! Umaru-chan 8.6  Facts Original Name  アホガール Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  13m Homepage   http://ahogirl.jp/ Genres Comedy Animation Keywords idiot slapstick romance school violence banana shounen anime based on 4-koma half-length episodes Content Score 86 Almost there... Top Contributors 64 Marr 🇳🇱 i 20 iknvya 11 sp1ti 7 Despair-Paradise  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}