{"link": "https://www.themoviedb.org/tv/62881?language=en", "title": "Bringing Up Bates", "resume": "Twenty-seven years ago Gil and Kelly Jo Bates tied the knot with no plans to have kids. Fast forward 19 kids later and this tight-knit family, seemingly too good to be true, has a tremendous bond but are far from perfect. As you will see, when you have a house full of 19 children, from ages two to 25, daily chaos is multiplied exponentially, but so are the joyful and poignant moments that life can bring.", "rate": 50, "genre": [], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62881   Expand Bringing Up Bates   (2015) User Score Overview Twenty-seven years ago Gil and Kelly Jo Bates tied the knot with no plans to have kids. Fast forward 19 kids later and this tight-knit family, seemingly too good to be true, has a tremendous bond but are far from perfect. As you will see, when you have a house full of 19 children, from ages two to 25, daily chaos is multiplied exponentially, but so are the joyful and poignant moments that life can bring. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 7 2018 | 3 Episodes Season 7 of Bringing Up Bates premiered on January  4, 2018. View All Seasons Social Reviews  1 Discussions  0 h A review by harvdog03  10.0 Written by  harvdog03  on January 19, 2018 This show just make me happy.  I want to be part of this family. Read All Reviews Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Bringing Up Bates. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 50 Still needs a little work. Top Contributors 7 eddiehinkle b 6 bowen4514@gmail.com 6 Elizabeth Jennings u 4 uaufspou123  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}