{"link": "https://www.themoviedb.org/tv/16420?language=en", "title": "Boys Over Flowers", "resume": "A working class girl winds up at an exclusive prep school. Unassuming high school girl Jan Di stands up to -- and eventually falls for -- a spoiled rich kid who belongs to the school's most powerfu clique.", "rate": 78, "genre": ["Comedy", "Drama"], "cast": ["Koo Hye-sun", "Lee Min-ho", "Kim Hyun-joong", "Kim Bum", "Kim Joon"], "character": ["Geum Jan-di", "Gu Jun-pyo", "Yoon Ji-hoo", "So Yi-jeong", "Song Woo-bin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 16420   Expand Boys Over Flowers   (2009) User Score  Play Trailer Overview A working class girl winds up at an exclusive prep school. Unassuming high school girl Jan Di stands up to -- and eventually falls for -- a spoiled rich kid who belongs to the school's most powerfu clique. Featured Crew Korean Broadcasting System Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Koo Hye-sun Geum Jan-di Lee Min-ho Gu Jun-pyo Kim Hyun-joong Yoon Ji-hoo Kim Bum So Yi-jeong Kim Joon Song Woo-bin Full Cast & Crew Last Season Season 1 2009 | 25 Episodes Season 1 of Boys Over Flowers premiered on January  5, 2009. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  8 Recommendations   2013-12-09 The Prime Minister and I 7.1    2009-10-07 You're Beautiful 7.9    2013-10-09 The Heirs 7.4    2010-09-01 Playful Kiss 6.9    2015-05-15 The Producers 7.3    2012-08-15 Arang and the Magistrate 8.0    2014-08-07 Surplus Princess 7.5    2011-05-25 City Hunter 7.5  Facts Original Name  꽃보다 남자 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/f4/ Genres Comedy Drama Keywords rich parents rich kids Content Score 100 Yes! Looking good! Top Contributors M 21 Maria180493 b 13 bielorkut NS 5 Norte Serra 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}