{"link": "https://www.themoviedb.org/tv/72725?language=en", "title": "차이나는 클라스", "resume": "We don't have an overview translated in English. Help us expand our database by adding one.", "rate": 0, "genre": [], "cast": ["DinDin", "Yoon Dukwon", "Jisook", "Gang Ji-young", "Lee Yong-ju"], "character": ["Himself", "Himself", "Herself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72725   Expand 차이나는 클라스   (2017) User Score Overview We don't have an overview translated in English. Help us expand our database by adding one. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast DinDin Himself Yoon Dukwon Himself Jisook Herself Gang Ji-young Herself Lee Yong-ju Himself Full Cast & Crew Last Season Season 1 2017 | 66 Episodes Season 1 of 차이나는 클라스 premiered on March  5, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on 차이나는 클라스. You can help by rating TV shows you've seen. Facts Status  Planned Network Certification ALL Meaning This rating is for programming that is appropriate for all ages. This program usually involves programs designed for children or families. Type  Talk Show Original Language  Korean Runtime  - Homepage   http://tv.jtbc.joins.com/event/pr10010461/pm10041878 Genres No genres have been added. Keywords No keywords have been added. Content Score 56 We're so close, yet so far. Top Contributors 27 koreacpv s 22 soiwe3481 TB 2 TMDb Bot 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}