{"link": "https://www.themoviedb.org/tv/625?language=en", "title": "The Black Donnellys", "resume": "Meet the Donnelly brothers: Tommy, Jimmy, Kevin and Sean. There is nothing these four Irish brothers wouldn't do to protect each other, and for them that means lying, cheating, stealing and, occasionally, calling the cops. Narrated by wannabe gangster Joey \"Ice Cream,\" this gritty series bears witness to the Donnelly brothers' sudden involvement in organized crime, focusing on how they go from boys to mobsters, and showing how their new life affects their relationships with friends, family and lovers.", "rate": 77, "genre": ["Drama"], "cast": ["Jonathan Tucker", "Tom Guiry", "Olivia Wilde", "Billy Lush", "Michael Stahl-David"], "character": ["Tommy Donnelly", "Jimmy Donnelly", "Jenny Reilly", "Kevin Donnelly", "Sean Donnelly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 625   Expand The Black Donnellys   (2007) User Score  Play Trailer Overview Meet the Donnelly brothers: Tommy, Jimmy, Kevin and Sean. There is nothing these four Irish brothers wouldn't do to protect each other, and for them that means lying, cheating, stealing and, occasionally, calling the cops. Narrated by wannabe gangster Joey \"Ice Cream,\" this gritty series bears witness to the Donnelly brothers' sudden involvement in organized crime, focusing on how they go from boys to mobsters, and showing how their new life affects their relationships with friends, family and lovers. Featured Crew Robert Moresco Creator Paul Haggis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonathan Tucker Tommy Donnelly Tom Guiry Jimmy Donnelly Olivia Wilde Jenny Reilly Billy Lush Kevin Donnelly Michael Stahl-David Sean Donnelly Full Cast & Crew Last Season Season 1 2007 | 13 Episodes Season 1 of The Black Donnellys premiered on February 26, 2007. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   2006-09-20 Kidnapped 7.0    2004-07-21 Rescue Me 7.6    2008-06-28 Wipeout 5.5    1992-04-10 Heartbeat 5.3    1998-10-23 Brimstone 7.6    2010-02-07 Celebrity Undercover Boss 5.0    2008-12-03 Man v. Food 6.7    2006-07-09 Brotherhood 7.4  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  60m, 46m Homepage   http://www.nbc.com/The_Black_Donnellys/ Genres Drama Keywords new york sibling relationship irish-american organized crime Content Score 100 Yes! Looking good! Top Contributors 25 United600 12 Banana S 10 Samara R 7 Restos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}