{"link": "https://www.themoviedb.org/tv/39468?language=en", "title": "Mildred Pierce", "resume": "Mildred Pierce depicts an overprotective, self-sacrificing mother during the Great Depression who finds herself separated from her husband, opening a restaurant of her own and falling in love with a man, all the while trying to earn her spoiled, narcissistic daughter's love and respect.", "rate": 73, "genre": ["Drama"], "cast": ["Kate Winslet", "Brían F. O'Byrne", "Melissa Leo", "James Le Gros", "Mare Winningham"], "character": ["Mildred Pierce", "Bert Pierce", "Lucy Gessler", "Wally Burgan", "Ida Corwin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39468   Expand Mildred Pierce   (2011) User Score  Play Trailer Overview Mildred Pierce depicts an overprotective, self-sacrificing mother during the Great Depression who finds herself separated from her husband, opening a restaurant of her own and falling in love with a man, all the while trying to earn her spoiled, narcissistic daughter's love and respect. Featured Crew James M. Cain Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  14 Posters  10 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kate Winslet Mildred Pierce Brían F. O'Byrne Bert Pierce Melissa Leo Lucy Gessler James Le Gros Wally Burgan Mare Winningham Ida Corwin Full Cast & Crew Last Season Miniseries 2011 | 5 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply Compared to the 1945 version Open 2 by  AusFem Go to Discussions Media Most Popular Videos  2 Backdrops  14 Posters  10 Recommendations   2013-03-18 Top of the Lake 7.1    2011-10-10 Enlightened 7.1    2006-03-12 Big Love 7.6    2005-06-05 The Comeback 7.6    2011-07-19 The Hour 7.3    2012-01-29 Luck 7.8    George Harrison: Living in the Material World 7.5    2014-11-02 Olive Kitteridge 7.7  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Miniseries Original Language  English Runtime  336m Homepage   http://www.hbo.com/mildred-pierce Genres Drama Keywords daughter depression infidelity friendship california based on novel or book kidnapping restaurant business woman rags to riches respect love miniseries divorcee adaptation gay director Content Score 100 Yes! Looking good! Top Contributors 66 SWFT TB 27 TMDb Bot 11 lineker 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}