{"link": "https://www.themoviedb.org/tv/74387?language=en", "title": "Final Space", "resume": "An astronaut named Gary and his planet-destroying sidekick Mooncake embark on serialized journeys through space in order to unlock the mystery of “Final Space,” the last point in the universe, if it actually does exist.", "rate": 78, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Olan Rogers", "Fred Armisen", "David Tennant", "Tom Kenny", "Steven Yeun"], "character": ["Gary Space/Mooncake (voice)", "KVN (Voice)", "Lord Commander (voice)", "HUE (voice)", "Little Cato (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 74387   Expand Final Space   (2018) User Score  Play Trailer Overview An astronaut named Gary and his planet-destroying sidekick Mooncake embark on serialized journeys through space in order to unlock the mystery of “Final Space,” the last point in the universe, if it actually does exist. Featured Crew Olan Rogers Creator David Sacks Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  4 Videos Trailers  1 Teasers  2 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Olan Rogers Gary Space/Mooncake (voice) Fred Armisen KVN (Voice) David Tennant Lord Commander (voice) Tom Kenny HUE (voice) Steven Yeun Little Cato (voice) Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Final Space premiered on February 26, 2018. View All Seasons Social Reviews  1 Discussions  0 A review by Dsnake1  9.0 Written by  Dsnake1  on May  8, 2018 I've been waiting for Final Space for quite some time. I loved the pilot on the creator's YouTube channel, and I knew it could be great. Overall, I think Final Space fulfilled expectations.  Season 1 was full of introductions, but in ten 22-minute episodes, they managed to tell a story worth telling  and  make me feel for the characters. There were legitimately sad moments in this animated comedy, which isn't something that can always be said about these types of shows. Olan Rogers, the creator, did a fantastic job of teasing out emotions while still filling the show with the comedy he's kno...  read the rest. Read All Reviews Media Most Popular Videos  3 Backdrops  9 Posters  4 Recommendations   2017-01-11 Jeff & Some Aliens 8.4    2016-12-07 Shut Eye 6.3    2014-08-04 Partners 5.1    2016-03-13 Houdini & Doyle 5.7    2013-07-21 Axe Cop 5.5    2010-09-29 Todd and the Book of Pure Evil 7.6    2011-10-14 Spy 7.6    2013-09-26 The Michael J. Fox Show 5.6  Facts Status  In Production Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.tbs.com/shows/final-space Genres Animation Sci-Fi & Fantasy Keywords evil genius  bounty hunter doomsday device Content Score 100 Yes! Looking good! Top Contributors 67 Elizabeth Jennings 12 d2dyno 8 admin1967 5 tupelihd  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}