{"link": "https://www.themoviedb.org/tv/60864?language=en", "title": "The Messengers", "resume": "When a mysterious object crashes to Earth, a group of seemingly unconnected strangers die from the energy pulse, but then awaken to learn that they have assigned the task of preventing the impending Apocalypse.", "rate": 62, "genre": ["Sci-Fi", "Fantasy", "Drama", "Action", "Adventure", "Mystery"], "cast": ["Diogo Morgado", "Joel Courtney", "Shantel VanSanten", "Sofia Black-D'Elia", "Lane Garrison"], "character": ["The Man", "Peter Moore", "Vera Buckley", "Erin Calder", "Ronnie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60864   Expand The Messengers   (2015) User Score  Play Trailer Overview When a mysterious object crashes to Earth, a group of seemingly unconnected strangers die from the energy pulse, but then awaken to learn that they have assigned the task of preventing the impending Apocalypse. Featured Crew Eoghan O'Donnell Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Diogo Morgado The Man Joel Courtney Peter Moore Shantel VanSanten Vera Buckley Sofia Black-D'Elia Erin Calder Lane Garrison Ronnie Full Cast & Crew Last Season Season 1 2015 | 13 Episodes Season 1 of The Messengers premiered on April 17, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  12 Recommendations   2015-06-01 The Whispers 5.7    2013-10-06 Witches of East End 6.6    2014-06-19 Dominion 5.9    2005-10-30 Egypt 8.2    2014-06-29 Reckless 5.5    2015-04-05 American Odyssey 6.7    2015-08-25 Fried 6.0    2009-10-04 Autumn's Concerto 7.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  40m Homepage   http://www.cwtv.com/shows/the-messengers Genres Sci-Fi & Fantasy Drama Action & Adventure Mystery Keywords angel supernatural powers biblical prophecy Content Score 100 Yes! Looking good! Top Contributors 35 Elizabeth Jennings 24 benf45 s 23 sora_sey G 16 GrEg  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}