{"link": "https://www.themoviedb.org/tv/5024?language=en", "title": "VeggieTales", "resume": "VeggieTales is an American series of children's computer animated films featuring anthropomorphic vegetables in stories conveying moral themes based on Christianity. They frequently retell Biblical stories, sometimes anachronistically reframed, and include humorous references to pop culture in many different eras by putting Veggie spins on them. The series was developed by Big Idea Entertainment.\nVeggieTales was created by Phil Vischer and Mike Nawrocki, who also provide many of the voices. Originally released in direct-to-video format, the series debuted on December 21, 1993. From September 9, 2006, to September 7, 2009, VeggieTales appeared on NBC's children's programming block qubo in a repackaged and edited format. In 2009, Netflix, made many VeggieTales videos and feature films available via their video streaming service. Big Idea has also published VeggieTales books and music CDs and branded items such as toys, clothing, and garden seeds for vegetables and flowers.", "rate": 73, "genre": ["Comedy", "Animation", "Kids"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5024   Expand VeggieTales   (1993) User Score Overview VeggieTales is an American series of children's computer animated films featuring anthropomorphic vegetables in stories conveying moral themes based on Christianity. They frequently retell Biblical stories, sometimes anachronistically reframed, and include humorous references to pop culture in many different eras by putting Veggie spins on them. The series was developed by Big Idea Entertainment. VeggieTales was created by Phil Vischer and Mike Nawrocki, who also provide many of the voices. Originally released in direct-to-video format, the series debuted on December 21, 1993. From September 9, 2006, to September 7, 2009, VeggieTales appeared on NBC's children's programming block qubo in a repackaged and edited format. In 2009, Netflix, made many VeggieTales videos and feature films available via their video streaming service. Big Idea has also published VeggieTales books and music CDs and branded items such as toys, clothing, and garden seeds for vegetables and flowers. Featured Crew Mike Nawrocki Creator Phil Vischer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 1 1993 | 63 Episodes Season 1 of VeggieTales premiered on December 21, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2014-11-26 VeggieTales In The House 6.8    1993-01-01 Dr. Quinn, Medicine Woman 6.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bigidea.com/ Genres Comedy Animation Kids Keywords vegetable religion cartoon food Content Score 64 We're so close, yet so far. Top Contributors 15 Banana 3 felectronika  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}