{"link": "https://www.themoviedb.org/tv/4459?language=en", "title": "The Muppet Show", "resume": "The Muppet Show is a comedy-variety television series produced by puppeteer Jim Henson and featuring The Muppets. After two pilot episodes produced in 1974 and 1975 failed to get the attention of America's network heads, Lew Grade approached Henson to produce the programme for his ATV Associated Television franchise in the UK. The show premiered on 5 September 1976, and five series were produced until 15 March 1981 at ATV's Elstree Studio just north of London, lasting 120 episodes. The series shows a vaudeville or music hall-style song-and-dance variety show, as well as glimpses behind the scenes of such a show. Kermit the Frog stars as a showrunner who tries to keep control of the antics of the other Muppet characters, as well as keep the guest stars happy. The show was known for outrageous physical slapstick, sometimes absurdist comedy, and humorous parodies. Each episode also featured a human guest star. As the show's popularity rose, many celebrities were eager to perform with the Muppets on television and in film.\nMany of the puppeteers also worked on Sesame Street. Muppet performers over the course of the show include Jim Henson, Frank Oz, Jerry Nelson, Richard Hunt, Dave Goelz, Fran Brill, Eren Ozker, Steve Whitmire, Louise Gold, Kathryn Mullen, Karen Prell, Brian Muehl, Bob Payne, and John Lovelady. Jerry Juhl and Jack Burns were two of the show writers.", "rate": 80, "genre": ["Kids", "Comedy", "Family"], "cast": ["Jim Henson", "Frank Oz", "Dave Goelz", "Jerry Nelson", "Richard Hunt"], "character": ["Waldorf", "Fozzie Bear", "Gonzo", "Floyd Pepper", "Scooter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4459   Expand The Muppet Show   (1976) User Score Overview The Muppet Show is a comedy-variety television series produced by puppeteer Jim Henson and featuring The Muppets. After two pilot episodes produced in 1974 and 1975 failed to get the attention of America's network heads, Lew Grade approached Henson to produce the programme for his ATV Associated Television franchise in the UK. The show premiered on 5 September 1976, and five series were produced until 15 March 1981 at ATV's Elstree Studio just north of London, lasting 120 episodes. The series shows a vaudeville or music hall-style song-and-dance variety show, as well as glimpses behind the scenes of such a show. Kermit the Frog stars as a showrunner who tries to keep control of the antics of the other Muppet characters, as well as keep the guest stars happy. The show was known for outrageous physical slapstick, sometimes absurdist comedy, and humorous parodies. Each episode also featured a human guest star. As the show's popularity rose, many celebrities were eager to perform with the Muppets on television and in film. Many of the puppeteers also worked on Sesame Street. Muppet performers over the course of the show include Jim Henson, Frank Oz, Jerry Nelson, Richard Hunt, Dave Goelz, Fran Brill, Eren Ozker, Steve Whitmire, Louise Gold, Kathryn Mullen, Karen Prell, Brian Muehl, Bob Payne, and John Lovelady. Jerry Juhl and Jack Burns were two of the show writers. Featured Crew Jim Henson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  3 Images Backdrops  13 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jim Henson Waldorf Frank Oz Fozzie Bear Dave Goelz Gonzo Jerry Nelson Floyd Pepper Richard Hunt Scooter Full Cast & Crew Last Season Season 5 1980 | 24 Episodes Season 5 of The Muppet Show premiered on March 10, 1980. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply d Favorite guest star/episode Open 0 by diamonddaisy\n      \n     d Favorite Skit, recurring  or otherwise Open 0 by diamonddaisy\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  13 Posters  5 Recommendations   1983-01-10 Fraggle Rock 7.7    1983-09-10 Inspector Gadget 6.6    1960-09-30 The Flintstones 7.0    1974-01-15 Happy Days 7.3    1969-11-10 Sesame Street 7.4    1966-01-12 Batman 7.0    1962-09-23 The Jetsons 6.6    1985-03-03 Moonlighting 7.2  Facts Status  Ended Networks Broadcast Syndication Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Kids Comedy Family Keywords puppet the muppets theatre audience Content Score 93 Almost there... Top Contributors 19 Elizabeth Jennings 10 Banana CM 9 Cherche Moi m 8 mccalimero62  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}