{"link": "https://www.themoviedb.org/tv/61350?language=en", "title": "Please Like Me", "resume": "After breaking up with his girlfriend, Josh comes to the realization that he is homosexual. With the support of his now ex girlfriend Claire, and his best friend and house mate Tom, Josh must help his mother with her battle with depression and the rest of his family embrace his new found lifestyle.", "rate": 76, "genre": ["Drama", "Comedy"], "cast": ["Josh Thomas", "Thomas Ward", "Caitlin Stasey", "Keegan Joyce", "David Roberts"], "character": ["Josh", "Tom", "Claire", "Arnold", "Alan"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61350   Expand Please Like Me   (2013) User Score  Play Trailer Overview After breaking up with his girlfriend, Josh comes to the realization that he is homosexual. With the support of his now ex girlfriend Claire, and his best friend and house mate Tom, Josh must help his mother with her battle with depression and the rest of his family embrace his new found lifestyle. Featured Crew Josh Thomas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  1 Images Backdrops  13 Posters  6 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Josh Thomas Josh Thomas Ward Tom Caitlin Stasey Claire Keegan Joyce Arnold David Roberts Alan Full Cast & Crew Last Season Season 4 2016 | 6 Episodes Season 4 of Please Like Me premiered on November  9, 2016. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply SPOILERS Hoping someone out there has watched the \"Burrito Bowl\" episode so we can discuss it Open 3 by Master_YODA\n      \n     Question about the \"Degustation\" episode (the one in the fancy restaurant) Open 2 by theburbs\n      \n     I made the mistake of Googling Caitlin Stasey Open 0 by theburbs\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  13 Posters  6 Recommendations   2015-10-06 Chewing Gum 7.0    2011-10-17 Threesome 6.3    2016-05-26 Neil Gaiman's Likely Stories 5.8    2012-02-20 The Bleak Old Shop of Stuff 6.7    2014-10-02 Lovesick 7.3    2014-07-17 Married 6.3    2013-01-16 Kroll Show 7.1    2014-10-10 Cristela 6.1  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  28m Homepage   http://www.abc.net.au/tv/pleaselikeme Genres Drama Comedy Keywords australia depression roommate gay relationship best friend gay man lgbt young adult Content Score 100 Yes! Looking good! Top Contributors 138 Banana 22 Elizabeth Jennings 13 whatUwant TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}