{"link": "https://www.themoviedb.org/tv/2263?language=en", "title": "Friday the 13th", "resume": "Friday the 13th: The Series is an American-Canadian horror television series that ran for three seasons, from October 3, 1987 to May 26, 1990 in first-run syndication. The series follows Micki and Ryan, owners of an antiques store, and their assistant, Jack Marshak, as they try to recover cursed antiques, to put them into safety in the store's vault.\nOriginally, the series was to be titled The 13th Hour, but producer Frank Mancuso, Jr. thought this would turn away viewers and instead took the name Friday the 13th to deliberately draw in audiences. Despite this title, the series has no story connections to the film series of the same name, as Jason Voorhees does not make an appearance, nor does any character connected to the films. In the United Kingdom it was listed on TV schedules as Fridays Curse, though when going to advertisement breaks on ITV it would show as Friday the 13th: The series.\nThe two series have several cast and crew ties, however. The show's producer, Frank Mancuso, Jr., was producer of the movie series from Friday the 13th Part 2 until the final installment distributed by Paramount. The show's star, John D. LeMay, went on to star in Jason Goes to Hell: The Final Friday, guest star John Shepherd played Tommy Jarvis in Friday the 13th: A New Beginning, and episode director David Cronenberg appeared in Jason X. Fred Mollin, Rob Hedden, and Tom McLoughlin worked behind the scenes of both series.", "rate": 77, "genre": ["Mystery", "Sci-Fi", "Fantasy"], "cast": ["Louise Robey", "Chris Wiggins", "John D. LeMay"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2263   Expand Friday the 13th   (1987) User Score Overview Friday the 13th: The Series is an American-Canadian horror television series that ran for three seasons, from October 3, 1987 to May 26, 1990 in first-run syndication. The series follows Micki and Ryan, owners of an antiques store, and their assistant, Jack Marshak, as they try to recover cursed antiques, to put them into safety in the store's vault. Originally, the series was to be titled The 13th Hour, but producer Frank Mancuso, Jr. thought this would turn away viewers and instead took the name Friday the 13th to deliberately draw in audiences. Despite this title, the series has no story connections to the film series of the same name, as Jason Voorhees does not make an appearance, nor does any character connected to the films. In the United Kingdom it was listed on TV schedules as Fridays Curse, though when going to advertisement breaks on ITV it would show as Friday the 13th: The series. The two series have several cast and crew ties, however. The show's producer, Frank Mancuso, Jr., was producer of the movie series from Friday the 13th Part 2 until the final installment distributed by Paramount. The show's star, John D. LeMay, went on to star in Jason Goes to Hell: The Final Friday, guest star John Shepherd played Tommy Jarvis in Friday the 13th: A New Beginning, and episode director David Cronenberg appeared in Jason X. Fred Mollin, Rob Hedden, and Tom McLoughlin worked behind the scenes of both series. Featured Crew Frank Mancuso Jr. Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Louise Robey Chris Wiggins John D. LeMay Full Cast & Crew Last Season Season 3 1989 | 20 Episodes Season 3 of Friday the 13th premiered on October  7, 1989. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1984-09-30 Tales from the Darkside 7.0    2009-02-11 Nature's Great Events 8.4    2009-03-03 The Listener 5.3    1970-12-16 Night Gallery 7.8    1984-10-03 Charles in Charge 5.1    2010-06-20 The Gates 6.8    2007-03-11 Blood Ties 7.4    2011-02-07 Outcasts 6.2  Facts Status  Ended Network Broadcast Syndication Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Mystery Sci-Fi & Fantasy Keywords magic horror curse devil magical object antiques shop Content Score 64 We're so close, yet so far. Top Contributors 23 Mitsarinho 10 Banana 8 DaMaN z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}