{"link": "https://www.themoviedb.org/tv/1487?language=en", "title": "Static Shock", "resume": "Static Shock is an American animated television series produced by Warner Bros. Animation. It is part of the DC animated universe. It was animated at the Slightly Offbeat Productions Studios in Penrose, Auckland, New Zealand. The New Zealand based Animation Studio originally animated the show reel and then went onto produce the series, which premiered in September 2000 on the Kids' WB! block and ran for four seasons, with a total of 52 half-hour episodes.\nThe series centers around the adventures of DC Comics superhero Virgil Ovid Hawkins/Static and is based on the original Milestone Media Static comics. After the show's initial run on The WB it was later picked up for rebroadcast by Cartoon Network, airing initially during the Miguzi block. Disney XD aired reruns of the series in February 2009 in the United States up until 2010. Currently, Warner Bros. has no plans to release the series on DVD. In 2011, the first season was made available for download on iTunes.", "rate": 75, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Phil LaMarr"], "character": ["Virgil Ovid Hawkins / Static (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1487   Expand Static Shock   (2000) User Score Overview Static Shock is an American animated television series produced by Warner Bros. Animation. It is part of the DC animated universe. It was animated at the Slightly Offbeat Productions Studios in Penrose, Auckland, New Zealand. The New Zealand based Animation Studio originally animated the show reel and then went onto produce the series, which premiered in September 2000 on the Kids' WB! block and ran for four seasons, with a total of 52 half-hour episodes. The series centers around the adventures of DC Comics superhero Virgil Ovid Hawkins/Static and is based on the original Milestone Media Static comics. After the show's initial run on The WB it was later picked up for rebroadcast by Cartoon Network, airing initially during the Miguzi block. Disney XD aired reruns of the series in February 2009 in the United States up until 2010. Currently, Warner Bros. has no plans to release the series on DVD. In 2011, the first season was made available for download on iTunes. Featured Crew Dwayne McDuffie Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phil LaMarr Virgil Ovid Hawkins / Static (voice) Full Cast & Crew Last Season Season 4 2004 | 13 Episodes Season 4 of Static Shock premiered on January 17, 2004. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   2004-09-11 The Batman 6.8    2002-12-06 Codename: Kids Next Door 6.5    2013-08-11 Marvel’s Hulk and the Agents of S.M.A.S.H 5.5    2000-11-04 X-Men: Evolution 7.3    2000-09-09 Jackie Chan Adventures 7.1    1999-11-28 Little Bill 3.6    2001-08-11 Cubix 4.3    2006-09-02 Fantastic Four: World's Greatest Heroes 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords dc comics superhero black superhero Content Score 64 We're so close, yet so far. Top Contributors 20 Banana RF 9 Ranielly Ferreira z 8 zurman1 CM 8 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}