{"link": "https://www.themoviedb.org/tv/18614?language=en", "title": "Hung", "resume": "Desperate times call for desperate measures and Ray Drecker's situation couldn't be much tougher. The former high school sports legend turned middle-aged high school basketball coach is divorced and struggling to provide for his kids when his already run-down house catches fire. Looking to take on a second job, Ray decides to exploit his best asset in a last-ditch attempt to change his fortunes.", "rate": 64, "genre": ["Comedy"], "cast": ["Thomas Jane", "Jane Adams", "Anne Heche", "Charlie Saxton", "Rebecca Creskoff"], "character": ["Ray Drecker", "Tanya Skagle", "Jessica Haxon", "Damon Drecker", "Lenore Bernard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18614   Expand Hung   (2009) User Score  Play Trailer Overview Desperate times call for desperate measures and Ray Drecker's situation couldn't be much tougher. The former high school sports legend turned middle-aged high school basketball coach is divorced and struggling to provide for his kids when his already run-down house catches fire. Looking to take on a second job, Ray decides to exploit his best asset in a last-ditch attempt to change his fortunes. Featured Crew Dmitry Lipkin Creator Colette Burson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  12 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Thomas Jane Ray Drecker Jane Adams Tanya Skagle Anne Heche Jessica Haxon Charlie Saxton Damon Drecker Rebecca Creskoff Lenore Bernard Full Cast & Crew Last Season Season 3 2011 | 10 Episodes Season 3 of Hung premiered on October  2, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  10 Posters  12 Recommendations   2009-09-20 Bored to Death 7.4    2011-02-09 Mr. Sunshine 6.4    2007-10-02 Pushing Daisies 7.8    2011-04-13 Happy Endings 7.3    2011-09-14 Up All Night 6.2    1997-03-04 Just Shoot Me! 6.4    2009-06-08 Nurse Jackie 7.2    2010-09-28 No Ordinary Family 6.1  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  28m, 30m Homepage   http://www.hbo.com/hung/ Genres Comedy Keywords sex sex worker Content Score 100 Yes! Looking good! Top Contributors 18 Banana R 12 Rebecca a 12 adambakir92 10 United600  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}