{"link": "https://www.themoviedb.org/tv/69581?language=en", "title": "The Worst Witch", "resume": "Join Mildred Hubble in CBBC's adaptation of The Worst Witch books, written by Jill Murphy.", "rate": 74, "genre": ["Family", "Kids", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Bella Ramsey", "Meibh Campbell", "Jenny Richardson", "Miriam Petche", "Dagny Rollins"], "character": ["Mildred Hubble", "Maud Spellbody", "Ethel Hallow", "Esmeralda Hallow", "Felicity Foxglove"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69581   Expand The Worst Witch   (2017) User Score  Play Trailer Overview Join Mildred Hubble in CBBC's adaptation of The Worst Witch books, written by Jill Murphy. Featured Crew Jill Murphy Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bella Ramsey Mildred Hubble Meibh Campbell Maud Spellbody Jenny Richardson Ethel Hallow Miriam Petche Esmeralda Hallow Dagny Rollins Felicity Foxglove Full Cast & Crew Current Season Season 2 2018 | 12 Episodes Season 2 of The Worst Witch premiered on January  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Worst Witch. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification ALL Meaning This rating is for programming that is appropriate for all ages. This program usually involves programs designed for children or families. Type  Scripted Original Language  English Runtime  29m Homepage   http://bbc.co.uk/cbbc/shows/the-worst-witch Genres Family Kids Mystery Sci-Fi & Fantasy Keywords witch school of witchcraft teenager based on children's book Content Score 100 Yes! Looking good! Top Contributors t 28 tmdb45070722 22 Banana b 13 basher 10 save  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}