{"link": "https://www.themoviedb.org/tv/1931?language=en", "title": "Disney's Adventures of the Gummi Bears", "resume": "Disney's Adventures of the Gummi Bears is a Disney animated television series that first aired in the United States in the mid-1980s through the early 1990s. The series was the first animated production by Walt Disney Animation Television, and loosely inspired by the gummi bear candies; Disney CEO Michael Eisner was struck with inspiration for the show when his son requested the candies one day. The series premiered on NBC on September 14, 1985, and aired there for four seasons. The series moved to ABC for one season from 1989 to 1990, and concluded on September 6, 1991 as part of the Disney Afternoon television syndication package. Of the series' 65 shows, 30 were double-features, consisting of two 11-minute cartoons, thereby bringing the series total to 94 distinct episodes overall. The show is well-remembered for its theme music, written by Michael and Patty Silversher and creation of \"gummiberry juice\" which was a topic of magic potion, gaining abilities to defend them against the foes.\nThe series was later rebroadcast on the syndicated Disney Afternoon block, and rerun on the Disney Afternoon through the summer of 1991. In later years, it was shown on the Disney Channel and Toon Disney, with its most recent televised airing occurring on Toon Disney on December 28, 2001. Seasons 1 to 3 of the series were released on DVD on November 14, 2006.", "rate": 76, "genre": ["Animation", "Comedy", "Family", "Kids", "Sci-Fi", "Fantasy"], "cast": ["Roger C. Carmel", "Katie Leigh", "Rob Paulsen", "Jason Marsden", "R.J. Williams"], "character": ["Sir Tuxford / Town Crier / Charm Teacher", "Sunni Gummi (voice)", "Gusto Gummi", "Cavin", "Cavin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1931   Expand Disney's Adventures of the Gummi Bears   (1985) User Score Overview Disney's Adventures of the Gummi Bears is a Disney animated television series that first aired in the United States in the mid-1980s through the early 1990s. The series was the first animated production by Walt Disney Animation Television, and loosely inspired by the gummi bear candies; Disney CEO Michael Eisner was struck with inspiration for the show when his son requested the candies one day. The series premiered on NBC on September 14, 1985, and aired there for four seasons. The series moved to ABC for one season from 1989 to 1990, and concluded on September 6, 1991 as part of the Disney Afternoon television syndication package. Of the series' 65 shows, 30 were double-features, consisting of two 11-minute cartoons, thereby bringing the series total to 94 distinct episodes overall. The show is well-remembered for its theme music, written by Michael and Patty Silversher and creation of \"gummiberry juice\" which was a topic of magic potion, gaining abilities to defend them against the foes. The series was later rebroadcast on the syndicated Disney Afternoon block, and rerun on the Disney Afternoon through the summer of 1991. In later years, it was shown on the Disney Channel and Toon Disney, with its most recent televised airing occurring on Toon Disney on December 28, 2001. Seasons 1 to 3 of the series were released on DVD on November 14, 2006. Featured Crew Jymn Magon Creator Michael Eisner Creator Art Vitello Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roger C. Carmel Sir Tuxford / Town Crier / Charm Teacher Katie Leigh Sunni Gummi (voice) Rob Paulsen Gusto Gummi Jason Marsden Cavin R.J. Williams Cavin Full Cast & Crew Last Season Season 6 1990 | 20 Episodes Season 6 of Disney's Adventures of the Gummi Bears premiered on September 10, 1990. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  7 Recommendations   1989-03-05 Chip 'n Dale Rescue Rangers 7.1    1992-07-25 TaleSpin 7.3    1987-09-18 DuckTales 7.6    1984-09-15 Snorks 6.0    1969-03-05 The Ant and the Aardvark 7.5    1981-09-12 The Smurfs 6.2    1987-09-10 Teenage Mutant Ninja Turtles 7.3    1985-09-09 The Care Bears 6.3  Facts Status  Ended Networks Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m, 25m, 30m Homepage  - Genres Animation Comedy Family Kids Sci-Fi & Fantasy Keywords monster Content Score 93 Almost there... Top Contributors V 74 Vivo 51 rpeters b 26 bratbob M 25 Michal.f  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}