{"link": "https://www.themoviedb.org/tv/2957?language=en", "title": "Fraggle Rock", "resume": "The Fraggles are a fun-loving community of creatures who live in a subterranean fantasy land where they love to play, sing and dance their cares away, sharing their world with the tiny Doozers and the giant Gorgs. The series teaches empathy and tolerance and encourages children to understand people different from themselves.", "rate": 77, "genre": ["Kids", "Family", "Sci-Fi", "Fantasy"], "cast": ["Dave Goelz", "Bob Stutt", "Fulton Mackay", "Simon O'Brien", "Jerry Nelson"], "character": ["Uncle \"Traveling\" Matt"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2957   Expand Fraggle Rock   (1983) User Score  Play Trailer Overview The Fraggles are a fun-loving community of creatures who live in a subterranean fantasy land where they love to play, sing and dance their cares away, sharing their world with the tiny Doozers and the giant Gorgs. The series teaches empathy and tolerance and encourages children to understand people different from themselves. Featured Crew Jim Henson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dave Goelz Uncle \"Traveling\" Matt Bob Stutt Fulton Mackay Simon O'Brien Jerry Nelson Full Cast & Crew Last Season Season 5 1987 | 15 Episodes Season 5 of Fraggle Rock premiered on January  5, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Fraggle Rock. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   1987-09-20 My Two Dads 5.7    1983-09-16 Webster 4.9    1976-09-18 The Muppet Show 7.8    1985-09-09 The Care Bears 6.3    1981-10-29 Gimme a Break! 5.7    1983-09-10 Inspector Gadget 6.6    1987-09-26 Jake and the Fatman 4.9    1986-09-17 Head of the Class 6.3  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   https://www.henson.com/fraggle-rock.php Genres Kids Family Sci-Fi & Fantasy Keywords muppet Content Score 100 Yes! Looking good! Top Contributors 24 Elizabeth Jennings CM 6 Cherche Moi 5 efeka n 5 nicbrown  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}