{"link": "https://www.themoviedb.org/tv/62255?language=en", "title": "Seraph of the End", "resume": "In 2012, the world allegedly comes to an end at the hands of a human-made virus, ravaging the global populace and leaving only children untouched. It is at this time that vampires emerge from the recesses of the earth, likely followed by age-old horrors of the dark thought only to be myth. The vampires sweep the earth and claim it in a single violent stroke, subjugating the remnants of humanity and leading them beneath the surface to safety. This \"protection\" comes at the price of donating blood to their captors. At the age of twelve, Yūichirō and his friend and fellow orphan Mikaela plotted to escape along with the children in Hyakuya Orphanage. However, this resulted in their deaths and Mikaela sacrifices himself in order for Yūichirō to escape and be saved by members of the Moon Demon Company, an extermination unit of the Japanese Imperial Demon Army. Four years later, Yūichirō dedicates his life to destroy vampires and seek revenge against them for murdering his \"family\".", "rate": 77, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62255   Expand Seraph of the End   (2015) User Score Overview In 2012, the world allegedly comes to an end at the hands of a human-made virus, ravaging the global populace and leaving only children untouched. It is at this time that vampires emerge from the recesses of the earth, likely followed by age-old horrors of the dark thought only to be myth. The vampires sweep the earth and claim it in a single violent stroke, subjugating the remnants of humanity and leading them beneath the surface to safety. This \"protection\" comes at the price of donating blood to their captors. At the age of twelve, Yūichirō and his friend and fellow orphan Mikaela plotted to escape along with the children in Hyakuya Orphanage. However, this resulted in their deaths and Mikaela sacrifices himself in order for Yūichirō to escape and be saved by members of the Moon Demon Company, an extermination unit of the Japanese Imperial Demon Army. Four years later, Yūichirō dedicates his life to destroy vampires and seek revenge against them for murdering his \"family\". Featured Crew Daisuke Tokudo Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Battle in Nagoya 2015 | 12 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2015-04-05 Blood Blockade Battlefront 7.7    2012-10-05 Blast of Tempest 7.7    2014-10-05 The Fruit of Grisaia 5.8    2015-10-03 K-Project 6.3    2013-09-09 Tokyo Ravens 5.8    2011-07-08 No. 6 7.5    2014-04-08 Black Bullet 6.8    2016-01-11 Grimgar of Fantasy and Ash 7.2  Facts Original Name  終わりのセラフ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://owarino-seraph.jp/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords supernatural powers dark fantasy vampirism shounen Content Score 64 We're so close, yet so far. Top Contributors f 15 fwaits 14 fanningert 14 Yourik 10 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}