{"link": "https://www.themoviedb.org/tv/5478?language=en", "title": "Celebrity Family Feud", "resume": "Celebrity Family Feud is a spin-off game show created by NBC, and hosted by television weather anchor Al Roker. The announcer was Burton Richardson. Celebrity Family Feud pitted two families against each other in a contest to name the most popular responses to a survey-type question posed to 100 people. This version, which was a spin-off of the original Family Feud, featured celebrity families instead of regular families, and was a revival of the primetime All-Star Specials featured during the late 1970s and early 1980s.\nThis version also featured five-player teams composed of a celebrity captain and four friends and/or relatives, with a $50,000 charity payoff at stake. In addition, it debuted changes to the set and sound effects of the current syndicated set, including the classic theme music as the opening/closing theme and as faceoff/commercial cues.\nRoker was chosen as the host of this version because, at the time of taping, the then-host of the syndicated daytime Feud, John O'Hurley, was committed to a series on another network, which was the one-episode flop Secret Talents of the Stars. The show debuted sound effect and set changes that appeared that fall on the ensuing O'Hurley season of the syndicated Family Feud.", "rate": 88, "genre": ["Reality"], "cast": ["Steve Harvey"], "character": ["Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 5478   Expand Celebrity Family Feud   (2008) User Score Overview Celebrity Family Feud is a spin-off game show created by NBC, and hosted by television weather anchor Al Roker. The announcer was Burton Richardson. Celebrity Family Feud pitted two families against each other in a contest to name the most popular responses to a survey-type question posed to 100 people. This version, which was a spin-off of the original Family Feud, featured celebrity families instead of regular families, and was a revival of the primetime All-Star Specials featured during the late 1970s and early 1980s. This version also featured five-player teams composed of a celebrity captain and four friends and/or relatives, with a $50,000 charity payoff at stake. In addition, it debuted changes to the set and sound effects of the current syndicated set, including the classic theme music as the opening/closing theme and as faceoff/commercial cues. Roker was chosen as the host of this version because, at the time of taping, the then-host of the syndicated daytime Feud, John O'Hurley, was committed to a series on another network, which was the one-episode flop Secret Talents of the Stars. The show debuted sound effect and set changes that appeared that fall on the ensuing O'Hurley season of the syndicated Family Feud. Featured Crew Mark Goodson Creator Bill Todman Creator Paul Alter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Steve Harvey Himself Full Cast & Crew Last Season Season 4 2017 | 8 Episodes Season 4 of Celebrity Family Feud premiered on June 10, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply I'm commenting here because there is no listing for regular FF w Steve Harvey Open 0 by couchplotato\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1999-08-16 Who Wants to Be a Millionaire? (US) 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.nbc.com/Celebrity_Family_Feud/ Genres Reality Keywords game show celebrity Content Score 64 We're so close, yet so far. Top Contributors 13 Banana n 8 neil1269 4 Obong Squad b 4 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}