{"link": "https://www.themoviedb.org/tv/3320?language=en", "title": "Biker Mice from Mars", "resume": "Biker Mice from Mars is a science fiction action animated series created by Rick Ungar that began airing in 1993 in the United States and lasted for three seasons before it was cancelled. It follows three anthropomorphic mice motorcyclists named Throttle, Modo, and Vinnie who escape a war on their home planet Mars before arriving to defend the Earth from the evil that destroyed their homeland and to one day return to Mars. The mice's signature weapons consist of a cestus and a laser, a bionic arm, and flares. Despite the frequent battles, no blood is shown, no firearms are used and many villains are monsters, aliens, and robots. These elements allowed the show to still be considered suitable for children.", "rate": 64, "genre": ["Animation", "Action", "Adventure", "Comedy"], "cast": ["Dorian Harewood", "Rob Paulsen", "Brad Garrett", "Susan Silo", "William Morgan Sheppard"], "character": ["Greasepit"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3320   Expand Biker Mice from Mars   (1993) User Score  Play Trailer Overview Biker Mice from Mars is a science fiction action animated series created by Rick Ungar that began airing in 1993 in the United States and lasted for three seasons before it was cancelled. It follows three anthropomorphic mice motorcyclists named Throttle, Modo, and Vinnie who escape a war on their home planet Mars before arriving to defend the Earth from the evil that destroyed their homeland and to one day return to Mars. The mice's signature weapons consist of a cestus and a laser, a bionic arm, and flares. Despite the frequent battles, no blood is shown, no firearms are used and many villains are monsters, aliens, and robots. These elements allowed the show to still be considered suitable for children. Featured Crew Rick Ungar Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dorian Harewood Rob Paulsen Brad Garrett Greasepit Susan Silo William Morgan Sheppard Full Cast & Crew Last Season Season 3 1995 | 13 Episodes Season 3 of Biker Mice from Mars premiered on September 23, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2002-03-05 The Osbournes 6.4    Dr. Zitbag's Transylvania Pet Shop 6.5    Biker Mice from Mars 6.0    1997-10-11 Men in Black: The Series 6.3    2000-06-09 The Invisible Man 7.2    1988-09-06 Count Duckula 6.9    1996-09-16 Beast Wars: Transformers 7.7    1997-09-01 Extreme Ghostbusters 6.0  Facts Status  Ended Network WLVI Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.bikermice.tv/ Genres Animation Action & Adventure Comedy Keywords mouse motorcycle Content Score 100 Yes! Looking good! Top Contributors C 6 CroCop d 5 drako-13 R 4 Rebecca 4 Rafaelasauani  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}