{"link": "https://www.themoviedb.org/tv/61405?language=en", "title": "Gracepoint", "resume": "When a young boy is found dead on an idyllic beach, a major police investigation gets underway in the small California seaside town where the tragedy occurred. Soon deemed a homicide, the case sparks a media frenzy, which throws the boy's family into further turmoil and upends the lives of all of the town's residents.", "rate": 65, "genre": ["Mystery", "Crime", "Drama"], "cast": ["David Tennant", "Anna Gunn", "Sarah-Jane Potts", "Kevin Zegers", "Giacomo Baessato"], "character": ["Emmett Carver", "Detective Ellie Miller", "Gemma Fisher", "Owen", "Officer Kearn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61405   Expand Gracepoint   (2014) User Score  Play Trailer Overview When a young boy is found dead on an idyllic beach, a major police investigation gets underway in the small California seaside town where the tragedy occurred. Soon deemed a homicide, the case sparks a media frenzy, which throws the boy's family into further turmoil and upends the lives of all of the town's residents. Featured Crew Chris Chibnall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Tennant Emmett Carver Anna Gunn Detective Ellie Miller Sarah-Jane Potts Gemma Fisher Kevin Zegers Owen Giacomo Baessato Officer Kearn Full Cast & Crew Last Season Season 1 2014 | 10 Episodes Season 1 of Gracepoint premiered on October  2, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  3 Recommendations   2014-08-23 Intruders 6.5    1976-09-04 The Duchess of Duke Street 7.7    2015-03-02 Acquitted 7.0    2013-04-19 Alpha House 7.3    1968-09-17 Julia 6.3    1994-09-27 Takin' Over the Asylum 8.0    2012-09-06 The Bletchley Circle 7.8    2015-03-02 Arthur & George 6.0  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  43m Homepage   http://www.fox.com/gracepoint/ Genres Mystery Crime Drama Keywords small town loss of loved one remake missing child murder investigation child murder murder mystery Content Score 100 Yes! Looking good! Top Contributors 24 CouchTater 23 lineker 21 Elizabeth Jennings 9 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}