{"link": "https://www.themoviedb.org/tv/10190?language=en", "title": "Witchblade", "resume": "Witchblade is an American television series that aired on TNT from 2001 to 2002. The series is based on the Witchblade comic book series, and followed a pilot film which debuted in August 2000. Some of the episodes were written by Ralph Hemecker, Marc Silvestri and J.D. Zeik.\nYancy Butler starred as Sara Pezzini, Anthony Cistaro as Kenneth Irons, David Chokachi as Jake McCartey, Eric Etebari as Ian Nottingham, Will Yun Lee as Danny Woo, Conrad Dunn as Tommy Gallo, Kenneth Welsh as Joe Siri, and John Hensley as Gabriel Bowman, among others. Although critically acclaimed and popular with audiences, the show was canceled in September 2002; there was speculation that the cancellation was connected to Butler's entering rehab for alcoholism.\nThe series ran for two seasons on TNT, for a total of 24 episodes. The first episode aired June 12, 2001; the last episode aired August 26, 2002. In spite of its cancellation, Witchblade was ranked seventh in the Top 10 Basic Cable Dramas for 2002.\nAccording to Top Cow editor Matt Hawkins the Witchblade TV series was cancelled because the lead actress Yancy Butler was an alcoholic and went into rehab – it was and remains the highest rated TV series to be cancelled.", "rate": 58, "genre": ["Sci-Fi", "Fantasy", "Mystery"], "cast": ["David Chokachi", "Yancy Butler", "Eric Etebari", "Will Yun Lee", "Lazar Rockwood"], "character": ["Det. Jake McCartey", "Sara Pezzini", "Ian Nottingham", "Det. Danny Woo", "Lazar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10190   Expand Witchblade   (2000) User Score Overview Witchblade is an American television series that aired on TNT from 2001 to 2002. The series is based on the Witchblade comic book series, and followed a pilot film which debuted in August 2000. Some of the episodes were written by Ralph Hemecker, Marc Silvestri and J.D. Zeik. Yancy Butler starred as Sara Pezzini, Anthony Cistaro as Kenneth Irons, David Chokachi as Jake McCartey, Eric Etebari as Ian Nottingham, Will Yun Lee as Danny Woo, Conrad Dunn as Tommy Gallo, Kenneth Welsh as Joe Siri, and John Hensley as Gabriel Bowman, among others. Although critically acclaimed and popular with audiences, the show was canceled in September 2002; there was speculation that the cancellation was connected to Butler's entering rehab for alcoholism. The series ran for two seasons on TNT, for a total of 24 episodes. The first episode aired June 12, 2001; the last episode aired August 26, 2002. In spite of its cancellation, Witchblade was ranked seventh in the Top 10 Basic Cable Dramas for 2002. According to Top Cow editor Matt Hawkins the Witchblade TV series was cancelled because the lead actress Yancy Butler was an alcoholic and went into rehab – it was and remains the highest rated TV series to be cancelled. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Chokachi Det. Jake McCartey Yancy Butler Sara Pezzini Eric Etebari Ian Nottingham Will Yun Lee Det. Danny Woo Lazar Rockwood Lazar Full Cast & Crew Last Season Season 2 2002 | 12 Episodes Season 2 of Witchblade premiered on June 16, 2002. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   1989-09-19 Doogie Howser, M.D. 5.7    1985-09-09 She-Ra: Princess of Power 6.2    1980-01-27 Galactica 1980 5.5    1983-09-17 Dungeons & Dragons 7.6    1996-09-21 Profiler 6.5    1999-06-09 Crusade 6.6    1985-01-23 ThunderCats 7.3    1975-11-07 Wonder Woman 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www2.warnerbros.com/web/witchblade/home.jsp Genres Sci-Fi & Fantasy Mystery Keywords new york based on comic artifact police detective magical object Content Score 86 Almost there... Top Contributors T 16 TexBill 13 Banana 4 Евгений w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}