{"link": "https://www.themoviedb.org/tv/7283?language=en", "title": "Los Serrano", "resume": "Los Serrano is a Spanish television drama comedy which premiered on 22 April 2003 and aired on Telecinco. It tells the story of the Serrano family, who lives in Round Santa Justa No 133, located in the fictional neighborhood of Santa Justa, in the Ribera del Manzanares, in Madrid. The success of the series in Spain and in several other countries in Europe and elsewhere helped launch the career of several young actors and actresses, especially actor and musician Fran Perea, who acts in the series and sings its theme song, \"1 más 1 son 7\".", "rate": 51, "genre": ["Comedy", "Family"], "cast": ["Antonio Resines", "Jesús Bonilla", "Antonio Molero", "Alejo Sauras", "Natalia Sánchez"], "character": ["Diego Serrano", "Santiago Serrano", "Fructuoso Martínez \"Fiti\"", "Raúl Martínez", "Maria Teresa \"Teté\" Capdevila"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7283   Expand Los Serrano   (2003) User Score Overview Los Serrano is a Spanish television drama comedy which premiered on 22 April 2003 and aired on Telecinco. It tells the story of the Serrano family, who lives in Round Santa Justa No 133, located in the fictional neighborhood of Santa Justa, in the Ribera del Manzanares, in Madrid. The success of the series in Spain and in several other countries in Europe and elsewhere helped launch the career of several young actors and actresses, especially actor and musician Fran Perea, who acts in the series and sings its theme song, \"1 más 1 son 7\". Featured Crew Daniel Écija Creator Álex Pina Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Antonio Resines Diego Serrano Jesús Bonilla Santiago Serrano Antonio Molero Fructuoso Martínez \"Fiti\" Alejo Sauras Raúl Martínez Natalia Sánchez Maria Teresa \"Teté\" Capdevila Full Cast & Crew Last Season Season 8 2008 | 7 Episodes Season 8 of Los Serrano premiered on June  5, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2008-01-09 Sin Tetas No Hay Paraíso 2.7    2005-01-16 Aída 4.0    2001-09-13 Cuéntame cómo pasó 6.6    2005-10-09 Los hombres de Paco 5.5    1999-01-17 7 vidas 5.9    2007-04-22 La Que Se Avecina 6.3    2008-02-04 Física o Química 3.0    2003-09-07 Aquí no hay quien viva 7.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  80m Homepage   http://www.telecinco.es/losserrano Genres Comedy Family Keywords bar school family blended family Content Score 93 Almost there... Top Contributors 111 prm96 i 5 ivanhoe.bg 5 United600 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}