{"link": "https://www.themoviedb.org/tv/19521?language=en", "title": "The Wonderful Adventures of Nils", "resume": "The Wonderful Adventures of Nils is an anime adaptation of the novel The Wonderful Adventures of Nils by the Swedish author Selma Lagerlöf. The 52 episode series ran on the Japanese network NHK from January 1980 to March 1981. The series was the very first production by Studio Pierrot. The anime was mostly fairly true to the original, apart from the appearance of Nils' pet hamster, and the greater role allowed to the fox Smirre. The music was written by Czech composer Karel Svoboda.\nThe anime was also broadcast in Canada, France, Germany, Sweden, Finland, Iceland Belgium, Greece, Bulgaria, The Netherlands, Poland, Portugal, Romania, in the Arab World, Spain, Slovenia, Slovakia, Hungary, Israel, Turkey, Italy, Hong Kong, Mainland China, South Africa, and Albania, but in some countries it was cut to allow for commercials. In Germany, the animated series episodes were also combined into one full feature animated movie in 1981; the same release has also been dubbed and released in Estonia on DVD and VHS.", "rate": 77, "genre": ["Animation", "Action", "Adventure"], "cast": ["Jōji Yanami", "Hideyuki Tanaka", "Keiko Yokozawa", "Kei Tomiyama", "Mami Koyama"], "character": ["Ten", "Gunnar", "Nils"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19521   Expand The Wonderful Adventures of Nils   (1980) User Score Overview The Wonderful Adventures of Nils is an anime adaptation of the novel The Wonderful Adventures of Nils by the Swedish author Selma Lagerlöf. The 52 episode series ran on the Japanese network NHK from January 1980 to March 1981. The series was the very first production by Studio Pierrot. The anime was mostly fairly true to the original, apart from the appearance of Nils' pet hamster, and the greater role allowed to the fox Smirre. The music was written by Czech composer Karel Svoboda. The anime was also broadcast in Canada, France, Germany, Sweden, Finland, Iceland Belgium, Greece, Bulgaria, The Netherlands, Poland, Portugal, Romania, in the Arab World, Spain, Slovenia, Slovakia, Hungary, Israel, Turkey, Italy, Hong Kong, Mainland China, South Africa, and Albania, but in some countries it was cut to allow for commercials. In Germany, the animated series episodes were also combined into one full feature animated movie in 1981; the same release has also been dubbed and released in Estonia on DVD and VHS. Featured Crew Selma Lagerlöf Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jōji Yanami Ten Hideyuki Tanaka Gunnar Keiko Yokozawa Kei Tomiyama Mami Koyama Nils Full Cast & Crew Last Season Nils no fushigi na tabi season 1 1980 | 52 Episodes Season 1 of The Wonderful Adventures of Nils premiered on January  8, 1980. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   1974-04-03 Vicky the Viking 6.1    1979-03-24 Once Upon a Time... Man 8.2  Facts Original Name  ニルスのふしぎな旅 Status  Ended Networks Certification 0 Meaning Can be aired at any time. Type  Scripted Original Language  Japanese Runtime  30m Homepage   http://de.wikipedia.org/wiki/Wunderbare_Reise_des_kleinen_Nils_Holgersson_mit_den_Wildg%C3%A4nsen_%28Zeichentrickserie%29 Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors V 9 Vivo 9 Karl Dietz h 7 hablaras t 6 tw715  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}