{"link": "https://www.themoviedb.org/tv/2167?language=en", "title": "All Saints", "resume": "All Saints is an Australian medical drama which first screened on the Seven Network. The series debuted on 24 February 1998 and concluded its run on 27 October 2009. It had been one of Australia's highest rating dramas and also achieved popularity overseas in many countries including United Kingdom, Ireland, Belgium, and Iran.", "rate": 60, "genre": ["Drama"], "cast": ["John Howard", "Judith McGrath", "Georgie Parker", "Alexandra Davies", "Ben Tari"], "character": ["Dr. Frank Campion"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2167   Expand All Saints   (1998) User Score Overview All Saints is an Australian medical drama which first screened on the Seven Network. The series debuted on 24 February 1998 and concluded its run on 27 October 2009. It had been one of Australia's highest rating dramas and also achieved popularity overseas in many countries including United Kingdom, Ireland, Belgium, and Iran. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Howard Dr. Frank Campion Judith McGrath Georgie Parker Alexandra Davies Ben Tari Full Cast & Crew Last Season Season 12 2009 | 37 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on All Saints. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://yahoo7.com.au/allsaints Genres Drama Keywords australia hospital medical drama Content Score 86 Almost there... Top Contributors 27 lineker 11 dzero 6 Banana D 3 Daniel  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}