{"link": "https://www.themoviedb.org/tv/76773?language=en", "title": "Station 19", "resume": "A group of heroic firefighters at Seattle Fire Station 19—from captain to newest recruit—risk their lives and hearts both in the line of duty and off the clock. These brave men and women are like family, literally and figuratively, and together they put their own lives in jeopardy as first responders to save the lives of others.", "rate": 69, "genre": ["Drama"], "cast": ["Jaina Lee Ortiz", "Grey Damon", "Jason George", "Barrett Doss", "Jay Hayden"], "character": ["Andy Herrera", "Jack Gibson", "Ben Warren", "Victoria Hughes", "Travis Montgomery"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76773   Expand Station 19   (2018) User Score  Play Trailer Overview A group of heroic firefighters at Seattle Fire Station 19—from captain to newest recruit—risk their lives and hearts both in the line of duty and off the clock. These brave men and women are like family, literally and figuratively, and together they put their own lives in jeopardy as first responders to save the lives of others. Featured Crew Stacy McKee Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jaina Lee Ortiz Andy Herrera Grey Damon Jack Gibson Jason George Ben Warren Barrett Doss Victoria Hughes Jay Hayden Travis Montgomery Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of Station 19 premiered on March 21, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  4 Recommendations   2018-03-13 For The People 6.5    2018-03-29 Siren 7.3    2018-01-03 9-1-1 6.7    2014-01-08 Chicago P.D. 6.9    2017-11-02 S.W.A.T. 6.6    2015-11-17 Chicago Med 6.7    2012-10-10 Chicago Fire 7.1    2010-09-24 Blue Bloods 6.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  45m Homepage   http://abc.go.com/shows/station-19 Genres Drama Keywords firemen seattle fire fighting spin off fire department Content Score 100 Yes! Looking good! Top Contributors j 58 jd1048576 10 Banana 7 Gabriel W. Almeida AK 5 Avshalom Kor  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}