{"link": "https://www.themoviedb.org/tv/38207?language=en", "title": "The Lying Game", "resume": "Emma, a kind-hearted foster kid who can't catch a break, finds out she has an identical twin sister, Sutton, who - unlike Emma - was adopted by wealthy parents and is seemingly living an ideal life. After their initial meeting, Sutton talks Emma into stepping into her life for a few days while she pursues a lead on their birth mother. Initially excited to do this favor for her sister, Emma soon learns that Sutton has gone missing and could be in trouble. Now, Emma must decide whether to come clean to Sutton's family and risk her own safety in the hope of uncovering her twin sister's true whereabouts, along with the truth about why they were separated in the first place.", "rate": 66, "genre": ["Drama", "Mystery"], "cast": ["Alexandra Chando", "Alice Greczyn", "Helen Slater", "Blair Redford", "Andy Buckley"], "character": ["Emma Becker / Sutton Mercer", "Madeline Rybak", "Kristin Merce", "Ethan Whitehorse", "Dr. Ted Mercer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38207   Expand The Lying Game   (2011) User Score Overview Emma, a kind-hearted foster kid who can't catch a break, finds out she has an identical twin sister, Sutton, who - unlike Emma - was adopted by wealthy parents and is seemingly living an ideal life. After their initial meeting, Sutton talks Emma into stepping into her life for a few days while she pursues a lead on their birth mother. Initially excited to do this favor for her sister, Emma soon learns that Sutton has gone missing and could be in trouble. Now, Emma must decide whether to come clean to Sutton's family and risk her own safety in the hope of uncovering her twin sister's true whereabouts, along with the truth about why they were separated in the first place. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexandra Chando Emma Becker / Sutton Mercer Alice Greczyn Madeline Rybak Helen Slater Kristin Merce Blair Redford Ethan Whitehorse Andy Buckley Dr. Ted Mercer Full Cast & Crew Last Season Season 2 2013 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  9 Posters  5 Recommendations   2013-03-19 Twisted 5.3    2014-02-17 Star-Crossed 5.6    2010-09-08 Hellcats 5.6    2012-10-16 Emily Owens, M.D 5.7    2013-01-14 The Carrie Diaries 4.9    2010-01-18 Life Unexpected 7.4    1999-09-29 Popular 6.9    2012-06-13 Dallas 5.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.abcfamily.go.com/shows/lying-game Genres Drama Mystery Keywords twin sister teenager foster child lying identity swap wealthy teens based on young adult novel Content Score 86 Almost there... Top Contributors 48 Banana s 6 speedycars 4 seawolf w 3 webmaster  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}