{"link": "https://www.themoviedb.org/tv/184?language=en", "title": "Jeremiah", "resume": "Jeremiah is an American television series starring Luke Perry and Malcolm-Jamal Warner that ran on the Showtime network from 2002 to 2004. The series takes place in a post-apocalyptic future where most of the adult population has been wiped out by a deadly virus.", "rate": 70, "genre": ["Drama", "Action", "Adventure"], "cast": ["Luke Perry", "Peter Stebbings", "Malcolm-Jamal Warner", "Sean Astin", "Ingrid Kavelaars"], "character": ["Jeremiah", "Kurdy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 184   Expand Jeremiah   (2002) User Score Overview Jeremiah is an American television series starring Luke Perry and Malcolm-Jamal Warner that ran on the Showtime network from 2002 to 2004. The series takes place in a post-apocalyptic future where most of the adult population has been wiped out by a deadly virus. Featured Crew J. Michael Straczynski Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Perry Jeremiah Peter Stebbings Malcolm-Jamal Warner Kurdy Sean Astin Ingrid Kavelaars Full Cast & Crew Last Season Season 2 2003 | 15 Episodes Season 2 of Jeremiah premiered on October 10, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Watched on Hulu Open 0 by lantzn\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2011-02-07 Outcasts 6.2    1998-09-09 First Wave 6.6    2002-09-20 John Doe 7.5    2009-08-02 Defying Gravity 6.6    1999-06-09 Crusade 6.6    1995-09-22 Space: Above and Beyond 6.8    2004-10-24 ReGenesis 7.0    2010-01-22 Caprica 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Drama Action & Adventure Keywords future post-apocalyptic survivor virus Content Score 93 Almost there... Top Contributors 14 Banana R 3 Rebecca w 3 webmaster s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}