{"link": "https://www.themoviedb.org/tv/70626?language=en", "title": "Stranger", "resume": "Hwang Shi-Mok had brain surgery when he was a child, which caused him to lack emotion. Now, Hwang Shi-Mok works as a prosecutor. He is rational, but cold and lonely. He is also one of the only prosecutors not involved in corruption. One day, a dead body is thrown in front of him. He meets Police Lieutenant Han Yeo-Jin at a murder crime scene. They work together to eradicate corruption at the prosecutor's office and solve a serial murder case.", "rate": 81, "genre": ["Crime"], "cast": ["Cho Seung-woo", "Bae Doona", "Lee Joon-hyuk", "Shin Hye-sun", "Yoo Jae-myeong"], "character": ["Hwang Shi-mok", "Han Yeo-jin", "Seo Dong-jae", "Young Eun-soo", "Lee Chang-joon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70626   Expand Stranger   (2017) User Score  Play Trailer Overview Hwang Shi-Mok had brain surgery when he was a child, which caused him to lack emotion. Now, Hwang Shi-Mok works as a prosecutor. He is rational, but cold and lonely. He is also one of the only prosecutors not involved in corruption. One day, a dead body is thrown in front of him. He meets Police Lieutenant Han Yeo-Jin at a murder crime scene. They work together to eradicate corruption at the prosecutor's office and solve a serial murder case. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cho Seung-woo Hwang Shi-mok Bae Doona Han Yeo-jin Lee Joon-hyuk Seo Dong-jae Shin Hye-sun Young Eun-soo Yoo Jae-myeong Lee Chang-joon Full Cast & Crew Last Season Season 1 2017 | 16 Episodes Season 1 of Stranger premiered on June 10, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  4 Recommendations   2017-09-04 Argon 6.8    2016-11-21 White Nights 8.0    2008-03-16 Fated to Love You 7.3    2015-07-22 Diamond Lover 6.9    2011-08-08 Birdie Buddy 7.7    2016-03-23 Click your Heart 7.0    2016-03-06 Refresh Man 7.0  Facts Original Name  비밀의 숲 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/stranger Genres Crime Keywords thriller korea Content Score 93 Almost there... Top Contributors M 58 Maria180493 a 5 asura766 VA 4 Viktor Andersson 3 auu  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}