{"link": "https://www.themoviedb.org/tv/520?language=en", "title": "Sledge Hammer!", "resume": "Sledge Hammer! is an American satirical police sitcom produced by New World Television that ran for two seasons on ABC from 1986 to 1988. The series was created by Alan Spencer and stars David Rasche as Inspector Sledge Hammer, a preposterous caricature of the standard \"cop on the edge\" character. Al Jean and Mike Reiss, best known for their work on The Simpsons, wrote for the show and worked as story editors.", "rate": 75, "genre": ["Comedy", "Crime"], "cast": ["David Rasche", "Anne-Marie Martin", "Harrison Page"], "character": ["Sledge Hammer", "Dori Doreau", "Captain Trunk"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 520   Expand Sledge Hammer!   (1986) User Score Overview Sledge Hammer! is an American satirical police sitcom produced by New World Television that ran for two seasons on ABC from 1986 to 1988. The series was created by Alan Spencer and stars David Rasche as Inspector Sledge Hammer, a preposterous caricature of the standard \"cop on the edge\" character. Al Jean and Mike Reiss, best known for their work on The Simpsons, wrote for the show and worked as story editors. Featured Crew Alan Spencer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Rasche Sledge Hammer Anne-Marie Martin Dori Doreau Harrison Page Captain Trunk Full Cast & Crew Last Season Season 2 1987 | 19 Episodes Season 2 of Sledge Hammer! premiered on September 17, 1987. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2004-07-19 The Grid 7.0    2005-12-10 Painkiller Jane 6.0    1982-09-24 Bring 'Em Back Alive 6.8    2006-01-01 In Justice 6.8    2002-08-25 I'm a Celebrity Get Me Out of Here! 5.0    1984-05-06 V: The Final Battle 7.3    1992-03-04 The Young Indiana Jones Chronicles 6.3    1985-03-03 Moonlighting 7.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage   http://www.sledgehammeronline.com/ Genres Comedy Crime Keywords police san francisco satire police detective sitcom Content Score 64 We're so close, yet so far. Top Contributors 18 Banana C 11 Christian p 10 pertolero 6 Panayotis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}