{"link": "https://www.themoviedb.org/tv/62217?language=en", "title": "Cherry Season", "resume": "Oyku, an ambitious university student dreams of being a top fashion designer. Since she was a little girl she has been in love with Mete, her best friend’s brother. But he has a girlfriend already. Mete’s best friend Ayaz is the son of a top fashion designer who could help Oyku realize her dreams. He is also a real flirt, who starts dating Oyku. But are they really going to fall in love or will Mete realize that the girl of his dreams has been there all along?", "rate": 28, "genre": ["Comedy"], "cast": ["Ozge Gurel", "Serkan Çayoglu"], "character": ["Öykü Acar", "Ayaz Dinçer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62217   Expand Cherry Season   (2014) User Score Overview Oyku, an ambitious university student dreams of being a top fashion designer. Since she was a little girl she has been in love with Mete, her best friend’s brother. But he has a girlfriend already. Mete’s best friend Ayaz is the son of a top fashion designer who could help Oyku realize her dreams. He is also a real flirt, who starts dating Oyku. But are they really going to fall in love or will Mete realize that the girl of his dreams has been there all along? Featured Crew Asli Zengin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ozge Gurel Öykü Acar Serkan Çayoglu Ayaz Dinçer Full Cast & Crew Last Season Season 1 2014 | 66 Episodes Season 1 of Cherry Season premiered on July  4, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  8 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Cherry Season. You can help by rating TV shows you've seen. Facts Original Name  Kiraz Mevsimi Status  Returning Series Network Certification  - Type  Scripted Original Language  Turkish Runtime  90m, 120m Homepage   http://www.fox.com.tr/Kiraz-Mevsimi/izle Genres Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors V 63 Vaine 15 Elizabeth Jennings a 6 alex.pettiti z 5 zerox  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}