{"link": "https://www.themoviedb.org/tv/13643?language=en", "title": "North & South", "resume": "Margaret Hale is a southerner from a country vicarage newly settled in the industrial northern town of Milton. In the shock of her move, she misjudges charismatic cotton mill-owner John Thornton, whose strength of purpose and passion are a match for her own pride and willfulness. When the workers of Milton call a strike, Margaret takes their side, and the two are brought into deeper conflict. As events spiral out of control, Margaret - to her surprise - begins to fall in love with Thornton...", "rate": 81, "genre": ["Drama"], "cast": ["Richard Armitage", "Daniela Denby-Ashe", "Sinéad Cusack", "Jo Joyner", "Tim Pigott-Smith"], "character": ["John Thornton", "Margaret Hale", "Hannah Thornton", "Fanny Thornton", "Richard Hale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 13643   Expand North & South   (2004) User Score Overview Margaret Hale is a southerner from a country vicarage newly settled in the industrial northern town of Milton. In the shock of her move, she misjudges charismatic cotton mill-owner John Thornton, whose strength of purpose and passion are a match for her own pride and willfulness. When the workers of Milton call a strike, Margaret takes their side, and the two are brought into deeper conflict. As events spiral out of control, Margaret - to her surprise - begins to fall in love with Thornton... Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  29 Posters  9 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Armitage John Thornton Daniela Denby-Ashe Margaret Hale Sinéad Cusack Hannah Thornton Jo Joyner Fanny Thornton Tim Pigott-Smith Richard Hale Full Cast & Crew Last Season Miniseries 2004 | 4 Episodes Season 1 of North & South premiered on November 14, 2004. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply Anyone from IMDb? Open 4 by  lantzn w Favorite character? Open 0 by wonder2wonder\n      \n     Just started watching this again on Netflix. Open 2 by  sheezcrazy Go to Discussions Media Most Popular Videos  0 Backdrops  29 Posters  9 Recommendations   1999-11-28 Wives and Daughters 7.3    2009-10-04 Emma 7.7    2008-01-01 Sense and Sensibility 7.7    2012-09-25 The Paradise 6.8    1996-11-17 The Tenant of Wildfell Hall 7.3    2006-09-24 Jane Eyre 7.5    2008-09-03 Lost in Austen 7.2    2008-10-26 Little Dorrit 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   http://www.bbc.co.uk/programmes/b00kq3rz Genres Drama Keywords england romance period drama costume drama Content Score 86 Almost there... Top Contributors TB 34 TMDb Bot 24 Elizabeth Jennings M 8 Maria180493 g 4 g4gx4  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}