{"link": "https://www.themoviedb.org/tv/61823?language=en", "title": "Red Rock", "resume": "Starting on the day a long, dormant feud between two local families is brutally reignited, this continuing drama is based around a busy Dublin Garda station. On one side, the Hennessys, a local dynasty, whose name is above half the businesses in town. On the other side, the Kielys, who have turned petty crime into a cottage industry. Charting the life and dramas of a community about to be enveloped by a feud, through the eyes of those who police it, each episode will be a mix of 'crime of the week' stories and on-going serial arcs, following principle characters in both their professional and personal lives. A powerful and moving drama, Red Rock is a contemporary western, set in the shadow of Ireland's 'gold rush'.", "rate": 75, "genre": ["Soap", "Drama", "Crime"], "cast": ["Adam Weafer", "Jane McGrath", "India Mullen", "Richard Flood", "Sean Mahon"], "character": ["David Hennessy", "Garda Sharon Cleere", "Katie Kiely", "Garda Supt. James McKay", "Garda Sergeant Brian McGonigle"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61823   Expand Red Rock   (2015) User Score  Play Trailer Overview Starting on the day a long, dormant feud between two local families is brutally reignited, this continuing drama is based around a busy Dublin Garda station. On one side, the Hennessys, a local dynasty, whose name is above half the businesses in town. On the other side, the Kielys, who have turned petty crime into a cottage industry. Charting the life and dramas of a community about to be enveloped by a feud, through the eyes of those who police it, each episode will be a mix of 'crime of the week' stories and on-going serial arcs, following principle characters in both their professional and personal lives. A powerful and moving drama, Red Rock is a contemporary western, set in the shadow of Ireland's 'gold rush'. Featured Crew Peter McKenna Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adam Weafer David Hennessy Jane McGrath Garda Sharon Cleere India Mullen Katie Kiely Richard Flood Garda Supt. James McKay Sean Mahon Garda Sergeant Brian McGonigle Full Cast & Crew Current Season Season 4 2018 | 13 Episodes Season 4 of Red Rock premiered on January 22, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply c Sharon and Rory in season 3 Open 0 by cynthiad\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   2011-10-25 Death in Paradise 7.6    2012-01-15 Call the Midwife 6.8  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://www.tv3.ie/shows/redrock Genres Soap Drama Crime Keywords police feud ireland garda Content Score 100 Yes! Looking good! Top Contributors 54 MarkSweeney 23 Elizabeth Jennings 10 tatergator 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}