{"link": "https://www.themoviedb.org/tv/38112?language=en", "title": "The Qwaser of Stigmata", "resume": "The Qwaser of Stigmata is an ongoing action manga series authored by Hiroyuki Yoshino featuring art by Kenetsu Satō. It is notable for its violence, fanservice, and the use of breast milk as a central plot device. The manga is serialized in the seinen/shōnen manga magazine Monthly Champion Red. A 24-episode anime television series adaptation was broadcast in heavily censored form and streamed uncensored on Biglobe. The anime received an OVA adaptation called The Qwaser of Stigmata : Portrait of the Empress based on chapter 16 bundled with the tenth volume to be shipped on October 20, 2010. On December 26, 2010, JBook announced that a second season was green-lit. The second season was produced under the title The Qwaser of Stigmata II, airing as 12 episodes between April and June 2011.\nOn July 1, 2012, Sentai Filmworks had announced that they had licensed both seasons and OVA of The Qwaser of Stigmata for digital distribution and home video release in the U.S., along with multiple other series'. No firm date has been set as to when these will occur.", "rate": 60, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Kana Hanazawa", "Aya Hirano", "Yuuko Sanpei", "Ayako Kawasumi", "Aki Toyosaki"], "character": ["Fumika Mitarai", "Katja", "Sasha", "Miyuri Tsujidō", "Tomo Yamanobe"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38112   Expand The Qwaser of Stigmata   (2010) User Score Overview The Qwaser of Stigmata is an ongoing action manga series authored by Hiroyuki Yoshino featuring art by Kenetsu Satō. It is notable for its violence, fanservice, and the use of breast milk as a central plot device. The manga is serialized in the seinen/shōnen manga magazine Monthly Champion Red. A 24-episode anime television series adaptation was broadcast in heavily censored form and streamed uncensored on Biglobe. The anime received an OVA adaptation called The Qwaser of Stigmata : Portrait of the Empress based on chapter 16 bundled with the tenth volume to be shipped on October 20, 2010. On December 26, 2010, JBook announced that a second season was green-lit. The second season was produced under the title The Qwaser of Stigmata II, airing as 12 episodes between April and June 2011. On July 1, 2012, Sentai Filmworks had announced that they had licensed both seasons and OVA of The Qwaser of Stigmata for digital distribution and home video release in the U.S., along with multiple other series'. No firm date has been set as to when these will occur. Featured Crew Hiraku Kaneko Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  10 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kana Hanazawa Fumika Mitarai Aya Hirano Katja Yuuko Sanpei Sasha Ayako Kawasumi Miyuri Tsujidō Aki Toyosaki Tomo Yamanobe Full Cast & Crew Last Season Season 2 2011 | 12 Episodes Season 2 of The Qwaser of Stigmata premiered on April 12, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  10 Posters  7 Recommendations   2012-10-04 BTOOOM! 6.3    2014-07-06 Akame ga Kill! 7.0  Facts Original Name  聖痕のクェイサー Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords based on manga anime Content Score 93 Almost there... Top Contributors 18 CrewMdk 12 BrerFox t 12 theusedversion 5 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}