{"link": "https://www.themoviedb.org/tv/33301?language=en", "title": "Franklin & Bash", "resume": "When they're not hanging out at their favorite hot dog stand pontificating on what they'd go through to enjoy a night with their favorite female celebrities, Jared Franklin and Peter Bash are chasing down their latest clients...sometimes literally. With business cards in hand, they're ready to nab a client within seconds after a car accident, arrest for solicitation or any other incident where their legal services may be needed. Once in the courtroom, they show their flair for the dramatic and the shocking.", "rate": 71, "genre": ["Drama", "Comedy"], "cast": ["Mark-Paul Gosselaar", "Breckin Meyer", "Malcolm McDowell", "Reed Diamond", "Toni Trucks"], "character": ["Peter Bash", "Jared Franklin", "Stanton Infeld", "Damien Karp", "Anita Haskins"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33301   Expand Franklin & Bash   (2011) User Score  Play Trailer Overview When they're not hanging out at their favorite hot dog stand pontificating on what they'd go through to enjoy a night with their favorite female celebrities, Jared Franklin and Peter Bash are chasing down their latest clients...sometimes literally. With business cards in hand, they're ready to nab a client within seconds after a car accident, arrest for solicitation or any other incident where their legal services may be needed. Once in the courtroom, they show their flair for the dramatic and the shocking. Featured Crew Kevin Falls Creator Bill Chais Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  9 Posters  15 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark-Paul Gosselaar Peter Bash Breckin Meyer Jared Franklin Malcolm McDowell Stanton Infeld Reed Diamond Damien Karp Toni Trucks Anita Haskins Full Cast & Crew Last Season Season 4 2014 | 10 Episodes Season 4 of Franklin & Bash premiered on August 13, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  9 Posters  15 Recommendations   2011-04-06 Breaking In 5.4    2013-11-14 Ground Floor 6.1    2011-01-17 Harry's Law 6.7    2014-01-23 Rake 5.4    2013-10-03 The Millers 4.9    2010-08-17 Melissa & Joey 6.2    2013-09-17 Dads 4.8    2011-03-06 Breakout Kings 6.1  Facts Status  Ended Networks Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://www.tnt.tv/series/franklinandbash/ Genres Drama Comedy Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 52 United600 29 Travis Bell c 15 cijah 10 Nuno Filipe de Vilhena Santos  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}