{"link": "https://www.themoviedb.org/tv/71233?language=en", "title": "CRISIS: Special Security Squad", "resume": "Inami and Tamaru work at the Public Security Mobile Investigation Unit Special Investigation Team, a team made up of specialists with different expertise. Inami tackles criminals with showy maneuvers, while Tamaru corners criminals with cool calculation. Together, the team tackles terrorists, new religious cults, military spies, secret narcotics organisations and complicit politicians.", "rate": 0, "genre": ["Action", "Adventure", "Crime"], "cast": ["Shun Oguri", "Hidetoshi Nishijima", "Tetsushi Tanaka", "Toru Nomaguchi", "Yuko Araki"], "character": ["Akira Inami", "Saburo Tamaru", "Mitsunari Yoshinaga", "Yusuke Kashii", "Rei Oyama"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71233   Expand CRISIS: Special Security Squad   (2017) User Score Overview Inami and Tamaru work at the Public Security Mobile Investigation Unit Special Investigation Team, a team made up of specialists with different expertise. Inami tackles criminals with showy maneuvers, while Tamaru corners criminals with cool calculation. Together, the team tackles terrorists, new religious cults, military spies, secret narcotics organisations and complicit politicians. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Shun Oguri Akira Inami Hidetoshi Nishijima Saburo Tamaru Tetsushi Tanaka Mitsunari Yoshinaga Toru Nomaguchi Yusuke Kashii Yuko Araki Rei Oyama Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of CRISIS: Special Security Squad premiered on April 11, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on CRISIS: Special Security Squad. You can help by rating TV shows you've seen. Facts Original Name  CRISIS 公安機動捜査隊特捜班 Status  Ended Networks Certification  - Type  Scripted Original Language  Japanese Runtime  60m Homepage   http://www.ktv.jp/crisis/en/ Genres Action & Adventure Crime Keywords police terrorist cult Content Score 86 Almost there... Top Contributors 41 thirstyhippo TB 3 TMDb Bot b 3 blazingcd 3 part-mozi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}