{"link": "https://www.themoviedb.org/tv/34?language=en", "title": "Keeping Up Appearances", "resume": "Keeping Up Appearances is a British sitcom created and written by Roy Clarke for the BBC. Centred on the life of eccentric, social-climbing snob Hyacinth Bucket, the sitcom follows her obsessive and determined attempts to impress in middle class society and portray herself as more affluent than she truly is.\nThe show stars Patricia Routledge, who received two BAFTA nominations for her performance as Hyacinth. Broadcast between 1990 and 1995 on BBC One, the sitcom spawned five series and 44 episodes—4 of which are Christmas specials. Keeping Up Appearances was a great success in the UK and also captivated a large audience in the US, Canada, and Australia, but production ceased in 1995 when Routledge wanted to move on to other projects. Since its original release, all five series—including Christmas specials—are available on DVD. In 2004, the sitcom was ranked 12th in the countdown of Britain's Best Sitcom. It is regularly repeated worldwide.", "rate": 74, "genre": ["Comedy"], "cast": ["Patricia Routledge", "Clive Swift", "Judy Cornwell", "Geoffrey Hughes", "Josephine Tewson"], "character": ["Hyacinth Bucket", "Richard Bucket", "Daisy", "Onslow", "Elizabeth 'Liz' Warden"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 34   Expand Keeping Up Appearances   (1990) User Score Overview Keeping Up Appearances is a British sitcom created and written by Roy Clarke for the BBC. Centred on the life of eccentric, social-climbing snob Hyacinth Bucket, the sitcom follows her obsessive and determined attempts to impress in middle class society and portray herself as more affluent than she truly is. The show stars Patricia Routledge, who received two BAFTA nominations for her performance as Hyacinth. Broadcast between 1990 and 1995 on BBC One, the sitcom spawned five series and 44 episodes—4 of which are Christmas specials. Keeping Up Appearances was a great success in the UK and also captivated a large audience in the US, Canada, and Australia, but production ceased in 1995 when Routledge wanted to move on to other projects. Since its original release, all five series—including Christmas specials—are available on DVD. In 2004, the sitcom was ranked 12th in the countdown of Britain's Best Sitcom. It is regularly repeated worldwide. Featured Crew Roy Clarke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  5 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Patricia Routledge Hyacinth Bucket Clive Swift Richard Bucket Judy Cornwell Daisy Geoffrey Hughes Onslow Josephine Tewson Elizabeth 'Liz' Warden Full Cast & Crew Last Season Season 5 1995 | 10 Episodes Season 5 of Keeping Up Appearances premiered on September  3, 1995. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply There are no discussions for Keeping Up Appearances. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1972-09-08 Are You Being Served? 7.0    1994-11-10 The Vicar of Dibley 7.3    1976-02-20 Open All Hours 7.7    1974-09-05 Porridge 8.3    1990-01-04 One Foot in the Grave 7.5    1979-09-30 To the Manor Born 7.1    1962-01-04 Steptoe and Son 8.2    1984-02-26 Spitting Image 7.8  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords snob humor slob sitcom british humour bouquet pbs bbc Content Score 93 Almost there... Top Contributors 32 Ibuddy66 O 8 Ozbourne f 7 ftlocation E 6 Equinox3141  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}