{"link": "https://www.themoviedb.org/tv/72636?language=en", "title": "MADE IN ABYSS", "resume": "The “Abyss” is the last unexplored region, an enormous and treacherous cave system filled with ancient relics and strange creatures. Only the bravest of adventurers can traverse its depths, earning them the nickname, “Cave Raiders.” Within the depths of the Abyss, a girl named Riko stumbles upon a robot who looks like a young boy. Tantalized by the Abyss, Riko and her new friend descend into uncharted territory to unlock its mysteries, but what lies in wait for them in the darkness?", "rate": 82, "genre": ["Action", "Adventure", "Animation", "Sci-Fi", "Fantasy"], "cast": ["Miyu Tomita", "Mariya Ise", "Shiori Izawa", "Taishi Murata", "Maaya Sakamoto"], "character": ["Riko", "Reg", "Nanachi", "Jiruo", "Lyza"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72636   Expand MADE IN ABYSS   (2017) User Score  Play Trailer Overview The “Abyss” is the last unexplored region, an enormous and treacherous cave system filled with ancient relics and strange creatures. Only the bravest of adventurers can traverse its depths, earning them the nickname, “Cave Raiders.” Within the depths of the Abyss, a girl named Riko stumbles upon a robot who looks like a young boy. Tantalized by the Abyss, Riko and her new friend descend into uncharted territory to unlock its mysteries, but what lies in wait for them in the darkness? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  34 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Miyu Tomita Riko Mariya Ise Reg Shiori Izawa Nanachi Taishi Murata Jiruo Maaya Sakamoto Lyza Full Cast & Crew Last Season Season 1 2017 | 13 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for MADE IN ABYSS. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  34 Posters  4 Recommendations   2017-10-12 Last Hero Inuyashiki 7.4    2017-10-06 Girls' Last Tour 7.5    2015-04-05 Blood Blockade Battlefront 7.7    2016-07-04 Orange 7.3    2015-04-03 Food Wars!: Shokugeki no Soma 7.9    2015-04-04 Is It Wrong to Try to Pick Up Girls in a Dungeon? 6.9    2014-07-11 Terror in Resonance 6.7    2016-01-14 KonoSuba – God’s blessing on this wonderful world!! 8.4  Facts Original Name  メイドインアビス Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://miabyss.com/ Genres Action & Adventure Animation Sci-Fi & Fantasy Keywords android post-apocalyptic treasure hunt survival orphan based on manga anime human android relationship Content Score 93 Almost there... Top Contributors 58 Marr 🇳🇱 44 Animes Flix 30 Mar2ck 12 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}