{"link": "https://www.themoviedb.org/tv/51370?language=en", "title": "Resurrection", "resume": "Resurrection is an American fantasy drama television series based on the book The Returned by Jason Mott that follows the residents of Arcadia, Missouri, whose lives are upended when their loved ones return from the dead, unaged since their deaths.", "rate": 68, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Omar Epps", "Frances Fisher", "Matt Craven", "Devin Kelley", "Mark Hildreth"], "character": ["J. Martin Bellamy", "Lucille Langston", "Sheriff Fred Langston", "Maggie Langston", "Pastor Tom Hale"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 51370   Expand Resurrection   (2014) User Score Overview Resurrection is an American fantasy drama television series based on the book The Returned by Jason Mott that follows the residents of Arcadia, Missouri, whose lives are upended when their loved ones return from the dead, unaged since their deaths. Featured Crew Aaron Zelman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Omar Epps J. Martin Bellamy Frances Fisher Lucille Langston Matt Craven Sheriff Fred Langston Devin Kelley Maggie Langston Mark Hildreth Pastor Tom Hale Full Cast & Crew Last Season Season 2 2015 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2014-03-10 Believe 6.3    2015-09-30 You, Me and the Apocalypse 7.2    2013-02-14 Zero Hour 4.9    2013-10-06 Witches of East End 6.6    2014-08-23 Intruders 6.5    2014-10-28 Benched 5.6    2015-03-25 Big Time in Hollywood, Fl 5.7    2011-06-06 Injustice 7.3  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://abc.go.com/shows/resurrection Genres Drama Sci-Fi & Fantasy Keywords based on novel or book resurrection Content Score 100 Yes! Looking good! Top Contributors 41 Elizabeth Jennings 38 Travis Bell f 14 furkan-guven0115 R 8 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}