{"link": "https://www.themoviedb.org/tv/70719?language=en", "title": "Ten Days in the Valley", "resume": "Single mother Jane Sadler's life is turned upside down when her young daughter goes missing in the middle of the night. And just like in the controversial police TV show she produces, everything is a mystery, everyone has a secret and no one can be trusted.", "rate": 60, "genre": ["Mystery", "Drama"], "cast": ["Kyra Sedgwick", "Erika Christensen", "Adewale Akinnuoye-Agbaje", "Abigail Pniowsky", "Malcolm-Jamal Warner"], "character": ["Jane Sadler", "Ali Petrovich", "John Bird", "Lake Sadler-Greene", "Matt Walker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70719   Expand Ten Days in the Valley   (2017) User Score  Play Trailer Overview Single mother Jane Sadler's life is turned upside down when her young daughter goes missing in the middle of the night. And just like in the controversial police TV show she produces, everything is a mystery, everyone has a secret and no one can be trusted. Featured Crew Tassie Cameron Creator Marsha Greene Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kyra Sedgwick Jane Sadler Erika Christensen Ali Petrovich Adewale Akinnuoye-Agbaje John Bird Abigail Pniowsky Lake Sadler-Greene Malcolm-Jamal Warner Matt Walker Full Cast & Crew Last Season Season 1 2017 | 10 Episodes Season 1 of Ten Days in the Valley premiered on October  1, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Terrible Open 6 by  Satai Delenn Go to Discussions Media Most Popular Videos  2 Backdrops  4 Posters  3 Recommendations   2017-10-03 The Mayor 6.7    2017-10-13 Lore 6.1    2017-09-26 Law & Order True Crime 6.1    2017-07-24 Somewhere Between 5.9    2017-09-25 The Brave 6.6    2017-09-11 Liar 6.8    2017-10-01 Ghosted 6.2    2018-02-26 Good Girls 5.8  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  42m Homepage   http://abc.go.com/shows/ten-days-in-the-valley Genres Mystery Drama Keywords secret police night investigation mystery single mother missing daughter Content Score 100 Yes! Looking good! Top Contributors 58 Gabriel W. Almeida 41 Warpath 29 Banana 13 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}