{"link": "https://www.themoviedb.org/tv/33240?language=en", "title": "Battlestar Galactica: Blood & Chrome", "resume": "The first Cylon war has been raging for 10 years and a young Ensign William Adama joins the fleet. He's disappointed not to be assigned to a fighter but to a freighter. His co-pilot, Lt. Coker Fasjovic, isn't too keen on having a rookie flying his aircraft as he has only a short time before he again becomes a civilian. Their cargo is a civilian scientist, Dr. Becca Kelly, but they no sooner leave than she has new orders for them and a new destination. She is less than forthcoming about just what her secret mission is but Adama is keen, particularly as it involves going into Cylon controlled space. Nothing is as it seems however. --- Battlestar Galactica: Blood & Chrome is a prequel to the reimagined Battlestar Galactica series. Distribution began as a pilot of a possible new series in 10 online webisodes and later on as a TV movie.", "rate": 68, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Luke Pasqualino", "Ben Cotton", "Brian Markinson", "Jill Teed", "Lili Bordan"], "character": ["William Adama", "Coker Fasjovik", "Silas Nash", "Commander Ozar", "Dr. Becca Kelly"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 33240   Expand Battlestar Galactica: Blood & Chrome   (2012) User Score  Play Trailer Overview The first Cylon war has been raging for 10 years and a young Ensign William Adama joins the fleet. He's disappointed not to be assigned to a fighter but to a freighter. His co-pilot, Lt. Coker Fasjovic, isn't too keen on having a rookie flying his aircraft as he has only a short time before he again becomes a civilian. Their cargo is a civilian scientist, Dr. Becca Kelly, but they no sooner leave than she has new orders for them and a new destination. She is less than forthcoming about just what her secret mission is but Adama is keen, particularly as it involves going into Cylon controlled space. Nothing is as it seems however. --- Battlestar Galactica: Blood & Chrome is a prequel to the reimagined Battlestar Galactica series. Distribution began as a pilot of a possible new series in 10 online webisodes and later on as a TV movie. Featured Crew David Eick Creator Michael Taylor Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Luke Pasqualino William Adama Ben Cotton Coker Fasjovik Brian Markinson Silas Nash Jill Teed Commander Ozar Lili Bordan Dr. Becca Kelly Full Cast & Crew Last Season Season 1 2012 | 10 Episodes Season 1 of Battlestar Galactica: Blood & Chrome premiered on November  9, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2010-01-22 Caprica 6.7    2005-09-16 Threshold 6.9    1983-09-05 Reilly, Ace of Spies 6.8    2007-10-05 Battlestar Galactica: Razor Flashbacks 7.0    2009-10-02 Stargate Universe 7.1    The Lost Valentine 6.3    1976-03-21 Charlie's Angels 5.9    2003-12-08 Battlestar Galactica 8.3  Facts Status  Ended Network Certification 16 Meaning Can be aired only from 10:00pm Uhr to 6:00am. Type  Scripted Original Language  English Runtime  94m Homepage  - Genres Sci-Fi & Fantasy Keywords war cyborg space travel alien space alien planet Content Score 100 Yes! Looking good! Top Contributors 9 Elizabeth Jennings 8 Nero Kosonen R 7 Rubberduck b 6 bromazepam01  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}