{"link": "https://www.themoviedb.org/tv/4956?language=en", "title": "Dilbert", "resume": "Dilbert is an animated television series adaptation of the comic strip of the same name, produced by Adelaide Productions, Idbox, and United Media and distributed by Columbia TriStar Television. The first episode was broadcast on January 25, 1999, and was UPN's highest-rated comedy series premiere at that point in the network's history; it lasted two seasons on UPN and won a Primetime Emmy before its cancellation.", "rate": 69, "genre": ["Animation", "Comedy"], "cast": ["Larry Miller", "Kathy Griffin", "Tom Kenny", "Jim Wise", "Jackie Hoffman"], "character": ["Pointy-haired Boss", "Alice"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4956   Expand Dilbert   (1999) User Score Overview Dilbert is an animated television series adaptation of the comic strip of the same name, produced by Adelaide Productions, Idbox, and United Media and distributed by Columbia TriStar Television. The first episode was broadcast on January 25, 1999, and was UPN's highest-rated comedy series premiere at that point in the network's history; it lasted two seasons on UPN and won a Primetime Emmy before its cancellation. Featured Crew Scott Adams Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Larry Miller Pointy-haired Boss Kathy Griffin Alice Tom Kenny Jim Wise Jackie Hoffman Full Cast & Crew Last Season Season 2 1999 | 17 Episodes Season 2 of Dilbert premiered on November  2, 1999. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   1994-01-26 The Critic 7.7    1999-04-07 Strangers with Candy 7.0    1994-03-05 Duckman 8.1    2006-08-07 Gene Simmons Family Jewels 4.4    1994-12-19 The Head 7.3    2004-07-01 The Soup 4.9    1994-04-15 Space Ghost Coast to Coast 8.3    2000-05-31 Clerks: The Animated Series 7.0  Facts Status  Ended Networks Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Animation Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors A 8 AnthonyAtkins232 6 TheOneManBoxOffice 5 anthonyryan1 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}