{"link": "https://www.themoviedb.org/tv/62776?language=en", "title": "Dr. Ken", "resume": "Dr. Ken is a brilliant physician with no bedside manner. He is always trying to be a good doctor, as well as a good husband and dad to his two kids. However, these good intentions have a way of driving everyone crazy at both work and at home. Luckily, his therapist wife Allison is just the right partner to keep things sane.", "rate": 55, "genre": ["Comedy"], "cast": ["Ken Jeong", "Suzy Nakamura", "Tisha Campbell-Martin", "Dave Foley", "Jonathan Slavin"], "character": ["Dr. Ken", "Allison Park", "Damona", "Pat", "Hector"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62776   Expand Dr. Ken   (2015) User Score  Play Trailer Overview Dr. Ken is a brilliant physician with no bedside manner. He is always trying to be a good doctor, as well as a good husband and dad to his two kids. However, these good intentions have a way of driving everyone crazy at both work and at home. Luckily, his therapist wife Allison is just the right partner to keep things sane. Featured Crew Jared Stern Creator Ken Jeong Creator John Fox Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ken Jeong Dr. Ken Suzy Nakamura Allison Park Tisha Campbell-Martin Damona Dave Foley Pat Jonathan Slavin Hector Full Cast & Crew Last Season Season 2 2016 | 22 Episodes Season 2 of Dr. Ken premiered on September 23, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Dr. Ken. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2016-03-15 Crowded 6.4    2015-02-19 The Odd Couple 5.4    2016-09-11 Son of Zorn 5.6    2015-02-04 Fresh Off the Boat 7.0    2017-04-25 Great News 6.5    2016-03-02 The Real O'Neals 7.7    2016-01-07 Angel from Hell 6.1    2015-08-05 Difficult People 7.4  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  25m Homepage   http://abc.go.com/shows/dr-ken Genres Comedy Keywords doctor east asian lead sitcom Content Score 100 Yes! Looking good! Top Contributors 39 Elizabeth Jennings 13 Banana z 10 zyck z 6 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}