{"link": "https://www.themoviedb.org/tv/72496?language=en", "title": "Law & Order True Crime", "resume": "An anthology series that delves into the players, the crime and the media circus, detailing the day-to-day battles of the trial and unveiling the shocking truth of what really went down when the cameras stopped rolling.", "rate": 61, "genre": ["Crime", "Drama"], "cast": ["Edie Falco", "Gus Halper", "Miles Gaston Villanueva", "Josh Charles", "Sam Jaeger"], "character": ["Leslie Abramson", "Erik Menendez", "Lyle Menendez", "Dr. Jerome Oziel", "Detective Les Zoeller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72496   Expand Law & Order True Crime   (2017) User Score  Play Trailer Overview An anthology series that delves into the players, the crime and the media circus, detailing the day-to-day battles of the trial and unveiling the shocking truth of what really went down when the cameras stopped rolling. Featured Crew René Balcer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  2 Images Backdrops  4 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Edie Falco Leslie Abramson Gus Halper Erik Menendez Miles Gaston Villanueva Lyle Menendez Josh Charles Dr. Jerome Oziel Sam Jaeger Detective Les Zoeller Full Cast & Crew Last Season The Menendez Murders 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply T Good Premiere Open 0 by TheBayHarborButcher\n      \n     Go to Discussions Media Most Popular Videos  2 Backdrops  4 Posters  3 Recommendations   2017-10-03 The Mayor 6.7    2017-11-07 Damnation 7.2    2017-12-06 Knightfall 6.2    2017-10-21 Gunpowder 6.8    2017-10-11 Dynasty 6.8  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.nbc.com/law-and-order-true-crime-menendez Genres Crime Drama Keywords court trial based on true events Content Score 100 Yes! Looking good! Top Contributors p 33 plumpro 18 Elizabeth Jennings 6 Banana 5 Mervan  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}