{"link": "https://www.themoviedb.org/tv/862?language=en", "title": "In the Heat of the Night", "resume": "In the Heat of the Night is an American television series based on the motion picture and novel of the same name starring Carroll O'Connor as the white police chief William Gillespie, and Howard Rollins as the African-American police detective Virgil Tibbs. It was broadcast on NBC from 1988 until 1992, and then on CBS until 1995. Its executive producers were Fred Silverman, Juanita Bartlett and Carroll O'Connor. TGG Direct released the first season of the series to DVD on August 28, 2012.", "rate": 65, "genre": ["Crime", "Drama"], "cast": ["Carroll O'Connor", "Alan Autry", "David Hart", "Hugh O'Connor", "Howard Rollins"], "character": ["Police Chief Bill Gillespie", "Virgil Tibbs"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 862   Expand In the Heat of the Night   (1988) User Score  Play Trailer Overview In the Heat of the Night is an American television series based on the motion picture and novel of the same name starring Carroll O'Connor as the white police chief William Gillespie, and Howard Rollins as the African-American police detective Virgil Tibbs. It was broadcast on NBC from 1988 until 1992, and then on CBS until 1995. Its executive producers were Fred Silverman, Juanita Bartlett and Carroll O'Connor. TGG Direct released the first season of the series to DVD on August 28, 2012. Featured Crew James Lee Barrett Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Carroll O'Connor Police Chief Bill Gillespie Alan Autry David Hart Hugh O'Connor Howard Rollins Virgil Tibbs Full Cast & Crew Last Season Season 8 1994 | 4 Episodes Season 8 of In the Heat of the Night premiered on October 21, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  1 Posters  1 Recommendations   1985-01-31 Night Heat 7.3    1983-09-30 Manimal 6.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Crime Drama Keywords police police chief racism police detective Content Score 100 Yes! Looking good! Top Contributors 13 Banana 4 Steve S 2 Samara TB 1 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}