{"link": "https://www.themoviedb.org/tv/62142?language=en", "title": "The Returned", "resume": "A small town that is turned upside down when several local people, who have long been presumed dead, suddenly reappear; their presence creates both positive and negative consequences. As families are reunited, the lives of those who were left behind are challenged both physically and emotionally.", "rate": 71, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Kevin Alejandro", "Agnes Bruckner", "India Ennenga", "Sandrine Holt", "Sophie Lowe"], "character": ["Tommy Solano", "Nikki Banks", "Camille Winship", "Julie Han", "Lena Winship"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62142   Expand The Returned   (2015) User Score  Play Trailer Overview A small town that is turned upside down when several local people, who have long been presumed dead, suddenly reappear; their presence creates both positive and negative consequences. As families are reunited, the lives of those who were left behind are challenged both physically and emotionally. Featured Crew Carlton Cuse Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kevin Alejandro Tommy Solano Agnes Bruckner Nikki Banks India Ennenga Camille Winship Sandrine Holt Julie Han Sophie Lowe Lena Winship Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of The Returned premiered on March  9, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  2 Recommendations   2012-11-26 The Returned 7.3    2011-02-08 Traffic Light 7.2    2011-07-27 The Code 6.7    2016-08-12 Ask the Storybots 7.5    2015-08-07 Project Mc² 4.7    2010-06-20 The Gates 6.8    2016-01-03 Bordertown 5.1    2017-01-01 Beau Séjour 7.9  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m Homepage   http://www.aetv.com/the-returned Genres Drama Sci-Fi & Fantasy Keywords small town resurrection based on tv series remake sibling rivalry ensemble cast based on movie suspense thriller Content Score 100 Yes! Looking good! Top Contributors 80 Marr 🇳🇱 44 Elizabeth Jennings 8 isavedtheday CM 7 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}