{"link": "https://www.themoviedb.org/tv/2391?language=en", "title": "Tales from the Crypt", "resume": "Tales from the Crypt, sometimes titled HBO's Tales from the Crypt, is an American horror anthology television series that ran from June 10, 1989 to July 19, 1996 on the premium cable channel HBO for seven seasons with a total of 93 episodes. The title is based on the 1950s EC Comics series of the same name and most of the content originated in that comic or the four other EC Comics of the time. The show was produced by HBO with uncredited association by The Geffen Film Company and Warner Bros. Television. The series is not to be confused with the 1972 film by the same name or Tales from the Darkside, another similarly themed horror anthology series.\nBecause it was aired on HBO, a premium cable television channel, it was one of the few anthology series to be allowed to have full freedom from censorship by network standards and practices as a result, HBO allowed the series to contain graphic violence as well as other content that had not appeared in most television series up to that time, such as profanity, gore, nudity and sexual situations, which could give the series a TV-MA rating for today's standards. The show is subsequently edited for such content when broadcast in syndication or on basic cable. While the series began production in the United States, in the final season filming moved to Britain, resulting in episodes which revolved around British characters.", "rate": 77, "genre": ["Comedy", "Mystery"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2391   Expand Tales from the Crypt   (1989) User Score Overview Tales from the Crypt, sometimes titled HBO's Tales from the Crypt, is an American horror anthology television series that ran from June 10, 1989 to July 19, 1996 on the premium cable channel HBO for seven seasons with a total of 93 episodes. The title is based on the 1950s EC Comics series of the same name and most of the content originated in that comic or the four other EC Comics of the time. The show was produced by HBO with uncredited association by The Geffen Film Company and Warner Bros. Television. The series is not to be confused with the 1972 film by the same name or Tales from the Darkside, another similarly themed horror anthology series. Because it was aired on HBO, a premium cable television channel, it was one of the few anthology series to be allowed to have full freedom from censorship by network standards and practices as a result, HBO allowed the series to contain graphic violence as well as other content that had not appeared in most television series up to that time, such as profanity, gore, nudity and sexual situations, which could give the series a TV-MA rating for today's standards. The show is subsequently edited for such content when broadcast in syndication or on basic cable. While the series began production in the United States, in the final season filming moved to Britain, resulting in episodes which revolved around British characters. Featured Crew William Gaines Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  13 Content Issues  1 Images Backdrops  3 Posters  10 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 1990 | 18 Episodes Season 2 of Tales from the Crypt premiered on April 21, 1990. View All Seasons Social Reviews  1 Discussions  14 A review by Brandon  10.0 Written by  Brandon  on May 10, 2017 The Man That Was Death 5 Stars Aww, poor little fellas. When I think of their childhood, all those cute little maggots hahahahaha. Our story is about a man with nobler ambitions. He likes to kill human pests and he does it in front of an audience. Now that's entertainment hahahaha. So hang onto your hats kiddies, this one's a real shocker. Niles Talbot (William Sadler) is a prison executioner that is just a little too good for his job. He works the electric chair. One of his favorite things in life is pulling the switch and watching the life dissipate from his victims. When...  read the rest. Read All Reviews Media Most Popular Videos  0 Backdrops  3 Posters  10 Recommendations   1984-09-30 Tales from the Darkside 7.0    1995-03-26 The Outer Limits 8.0    1959-10-02 The Twilight Zone 8.2    1955-10-02 Alfred Hitchcock Presents 7.8    1963-09-16 The Outer Limits 7.8    1985-09-27 The Twilight Zone 7.4    1976-09-18 The Muppet Show 7.8    1992-09-22 Beavis and Butt-head 6.9  Facts Status  Ended Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Mystery Keywords based on comic horror anthology Content Score 64 We're so close, yet so far. Top Contributors 13 efeka 11 TheOneManBoxOffice 10 Panayotis 9 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}