{"link": "https://www.themoviedb.org/tv/71727?language=en", "title": "The Mayor", "resume": "A struggling hip-hop artist runs for mayor to promote his mix-tape and wins.", "rate": 63, "genre": ["Comedy"], "cast": ["Brandon Micheal Hall", "Yvette Nicole Brown", "Lea Michele", "Marcel Spears", "Bernard David Jones"], "character": ["Courtney Rose", "Dina Rose", "Valentina Barella", "T.K. Clifton", "Jermaine Leforge"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71727   Expand The Mayor   (2017) User Score  Play Trailer Overview A struggling hip-hop artist runs for mayor to promote his mix-tape and wins. Featured Crew Jeremy Bronson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brandon Micheal Hall Courtney Rose Yvette Nicole Brown Dina Rose Lea Michele Valentina Barella Marcel Spears T.K. Clifton Bernard David Jones Jermaine Leforge Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of The Mayor premiered on October  2, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Gonna Get Cancelled Open 0 by Dali Parton\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  3 Recommendations   2017-09-26 Law & Order True Crime 6.1    2017-10-01 Ten Days in the Valley 6.0    2017-10-01 Ghosted 6.2    2017-10-03 Kevin (Probably) Saves the World 7.3    2016-09-08 Better Things 6.7    2017-10-11 Dynasty 6.8    2016-10-16 Berlin Station 7.4    2017-12-06 HAPPY! 7.4  Facts Status  Cancelled Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  22m Homepage   http://abc.go.com/shows/the-mayor Genres Comedy Keywords hip-hop mayor mayor elections sitcom Content Score 100 Yes! Looking good! Top Contributors 43 Warpath 25 Banana 13 Elizabeth Jennings 11 Gabriel W. Almeida  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}