{"link": "https://www.themoviedb.org/tv/2798?language=en", "title": "Space Ghost Coast to Coast", "resume": "Space Ghost: Coast to Coast is an American animated parody talk show, hosted by the 1960s Hanna-Barbera cartoon character Space Ghost. The show premiered on April 15, 1994, on Cartoon Network. Though the original 1960s series aired as a standard Hanna-Barbera Saturday morning superhero cartoon, Space Ghost Coast to Coast was a total reboot of the series intended for adults, now reinterpreted as an absurdist parody talk show and produced using the original artwork.\nThe series' focus on surrealism, non-sequiturs and random, unpredictable parody humor proved the perfect vehicle to launch the network's late night television block, Adult Swim, serving as the flagship show from 2001–2004. Space Ghost Coast to Coast was recommended to be the first fully produced series to air on Cartoon Network. SGC2C was also the first and only Cartoon Network original series to later air on Adult Swim and Gametap. The show was rated TV-Y7, TV-PG, and TV-14, making it the first and only Cartoon Network original show to receive these three TV ratings.", "rate": 83, "genre": ["Animation", "Comedy"], "cast": ["Corri English"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2798   Expand Space Ghost Coast to Coast   (1994) User Score Overview Space Ghost: Coast to Coast is an American animated parody talk show, hosted by the 1960s Hanna-Barbera cartoon character Space Ghost. The show premiered on April 15, 1994, on Cartoon Network. Though the original 1960s series aired as a standard Hanna-Barbera Saturday morning superhero cartoon, Space Ghost Coast to Coast was a total reboot of the series intended for adults, now reinterpreted as an absurdist parody talk show and produced using the original artwork. The series' focus on surrealism, non-sequiturs and random, unpredictable parody humor proved the perfect vehicle to launch the network's late night television block, Adult Swim, serving as the flagship show from 2001–2004. Space Ghost Coast to Coast was recommended to be the first fully produced series to air on Cartoon Network. SGC2C was also the first and only Cartoon Network original series to later air on Adult Swim and Gametap. The show was rated TV-Y7, TV-PG, and TV-14, making it the first and only Cartoon Network original show to receive these three TV ratings. Featured Crew Mike Lazzo Creator Alex Toth Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Corri English Full Cast & Crew Last Season Season 8 2003 | 8 Episodes Season 8 of Space Ghost Coast to Coast premiered on January  1, 2003. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations   2000-12-21 Sealab 2021 7.8    2000-12-30 Harvey Birdman, Attorney at Law 7.7    2005-12-13 Moral Orel 7.5    2006-10-16 Frisky Dingo 8.1    2000-12-30 Aqua Teen Hunger Force 7.2    1998-08-19 Upright Citizens Brigade 8.0    2000-12-21 The Brak Show 7.0    1994-03-05 Duckman 8.1  Facts Status  Ended Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  15m, 11m Homepage   http://www.adultswim.com/shows/space-ghost-coast-to-coast/ Genres Animation Comedy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors m 9 mrpink84 m 3 morrison A 3 AnthonyAtkins232 j 3 jco666  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}