{"link": "https://www.themoviedb.org/tv/61751?language=en", "title": "All Hail King Julien", "resume": "King Julien is back and shaking his booty harder than ever! Discover the wild world of Madagascar as the king takes on the jungle’s craziest adventures in this comedy series. With his loyal sidekicks Maurice and Mort, they meet a whole new cast of colorful animals, including ambitious head of security Clover and the villainous Foosa. No one can stop this king from ruling with an iron fist...in the air...wavin' like he just doesn't care.", "rate": 57, "genre": ["Family", "Animation", "Comedy"], "cast": ["Danny Jacobs", "Jeff Bennett", "India de Beaufort", "Kevin Michael Richardson", "Andy Richter"], "character": ["King Julien (voice)", "Horst / Hector / Willie (voice)", "Clover (voice)", "Maurice (voice)", "Mort / Ted (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61751   Expand All Hail King Julien   (2015) User Score  Play Trailer Overview King Julien is back and shaking his booty harder than ever! Discover the wild world of Madagascar as the king takes on the jungle’s craziest adventures in this comedy series. With his loyal sidekicks Maurice and Mort, they meet a whole new cast of colorful animals, including ambitious head of security Clover and the villainous Foosa. No one can stop this king from ruling with an iron fist...in the air...wavin' like he just doesn't care. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Danny Jacobs King Julien (voice) Jeff Bennett Horst / Hector / Willie (voice) India de Beaufort Clover (voice) Kevin Michael Richardson Maurice (voice) Andy Richter Mort / Ted (voice) Full Cast & Crew Last Season Season 4 2016 | 4 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2015-10-03 K-Project 6.3    2013-12-24 Turbo FAST 4.7    2011-02-08 Traffic Light 7.2    2016-03-21 72 Dangerous Places to Live 6.0    2017-01-01 Beau Séjour 7.9    2015-06-18 Hoff the Record 6.0    2015-12-01 Real Rob 5.8    2008-10-30 Wakfu 8.4  Facts Status  Returning Series Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  20m Homepage   https://www.netflix.com/title/80018987 Genres Family Animation Comedy Keywords madagascar animation 3d Content Score 93 Almost there... Top Contributors 41 Elizabeth Jennings s 31 sgtfrankieboy 15 Maikkoum 10 SkullCollector  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}