{"link": "https://www.themoviedb.org/tv/7842?language=en", "title": "The Tom and Jerry Show", "resume": "The New Tom & Jerry Show is an animated television series produced for Saturday mornings by Hanna-Barbera Productions in association with Metro-Goldwyn-Mayer Television in 1975 for ABC based on the theatrical shorts and characters Tom and Jerry.", "rate": 77, "genre": ["Animation", "Comedy"], "cast": ["Alan Oppenheimer", "Lennie Weinrib", "Henry Corden", "Janet Waldo", "Hal Smith"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 7842   Expand The Tom and Jerry Show   (1975) User Score Overview The New Tom & Jerry Show is an animated television series produced for Saturday mornings by Hanna-Barbera Productions in association with Metro-Goldwyn-Mayer Television in 1975 for ABC based on the theatrical shorts and characters Tom and Jerry. Featured Crew William Hanna Creator Joseph Barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alan Oppenheimer Lennie Weinrib Henry Corden Janet Waldo Hal Smith Full Cast & Crew Last Season Season 1 1975 | 51 Episodes Season 1 of The Tom and Jerry Show premiered on September  6, 1975. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for The Tom and Jerry Show. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1940-11-25 The Woody Woodpecker Show 7.1    1995-09-09 The Sylvester & Tweety Mysteries 7.3    1964-12-18 The Pink Panther Show 7.0    1960-11-14 Popeye the Sailor 5.8    1960-10-11 The Bugs Bunny Show 7.8    1977-09-10 Captain Caveman and the Teen Angels 6.1    1960-09-30 The Flintstones 7.0    1958-10-02 The Huckleberry Hound Show 7.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Comedy Keywords cat and mouse Content Score 93 Almost there... Top Contributors 6 Robson Guedes Vieira 6 Banana f 4 frederhe 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}