{"link": "https://www.themoviedb.org/tv/31936?language=en", "title": "Melissa & Joey", "resume": "Melissa & Joey is an ABC Family original television series starring Melissa Joan Hart and Joey Lawrence that premiered on ABC Family on August 17, 2010. The series follows local politician Mel Burke and Joe Longo, whom Mel hires to look after her niece and nephew after a Ponzi scheme leaves him broke.", "rate": 67, "genre": ["Drama", "Comedy"], "cast": ["Melissa Joan Hart", "Joey Lawrence", "Taylor Spreitler", "Nick Robinson"], "character": ["Melissa Burke", "Joe Longo", "Lennox Scanlon", "Ryder Scanlon"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31936   Expand Melissa & Joey   (2010) User Score Overview Melissa & Joey is an ABC Family original television series starring Melissa Joan Hart and Joey Lawrence that premiered on ABC Family on August 17, 2010. The series follows local politician Mel Burke and Joe Longo, whom Mel hires to look after her niece and nephew after a Ponzi scheme leaves him broke. Featured Crew Bob Young Creator David Kendall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Melissa Joan Hart Melissa Burke Joey Lawrence Joe Longo Taylor Spreitler Lennox Scanlon Nick Robinson Ryder Scanlon Full Cast & Crew Last Season Season 4 2014 | 22 Episodes Season 4 of Melissa & Joey premiered on October 22, 2014. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Lennox: Happy Birthday Taylor Spreitler! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   2010-06-16 Hot in Cleveland 6.8    2011-06-01 Franklin & Bash 7.1    2012-06-20 Baby Daddy 5.9    2010-09-22 Better With You 6.0    2013-11-14 Ground Floor 6.1    2016-03-15 Crowded 6.4    2014-03-31 Friends with Better Lives 5.4    2014-01-17 I Didn't Do It 6.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://abcfamily.go.com/shows/melissa-joey Genres Drama Comedy Keywords nanny family sitcom child care Content Score 93 Almost there... Top Contributors 18 Elizabeth Jennings 16 seawolf TB 14 TMDb Bot 12 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}