{"link": "https://www.themoviedb.org/tv/3200?language=en", "title": "Even Stevens", "resume": "Even Stevens is an American comedy television series that aired on Disney Channel with a total of three seasons and 65 episodes from June 17, 2000, to June 13, 2003. It follows the life of the Stevenses, a Jewish family living in suburban Sacramento, California, mainly focusing on the clashing personalities of its two younger siblings, Ren and Louis.\nThe series was produced by Brookwell McNamara Entertainment and Fireworks Entertainment. It is often cited as launching Shia LaBeouf's breakout career as an actor. The show features a fast motion photography, which features in every episode.\nThe feature-length Disney Channel Original Movie based on the series, The Even Stevens Movie, premiered on June 13, 2003, and serves as the series finale.\nAs of January 15, 2010, in America, Even Stevens has been removed from television syndication altogether, though The Even Stevens Movie continues to air on Disney Channel and Disney XD, and on Family Channel occasionally. However, in the UK, Even Stevens continues to air on CITV and now Pop Girl. From its launch on June 1, 2011 to late 2012, the series were shown as re-runs on Disney XD in Canada & US.", "rate": 77, "genre": ["Comedy"], "cast": ["Christy Carlson Romano", "Shia LaBeouf", "Margo Harshman", "A.J. Trauth", "Nick Spano"], "character": ["Renee \"Ren\" Stevens", "Louis Stevens", "Tawny Dean", "Alan Twitty", "Donald \"Donnie\" Stevens"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3200   Expand Even Stevens   (2000) User Score Overview Even Stevens is an American comedy television series that aired on Disney Channel with a total of three seasons and 65 episodes from June 17, 2000, to June 13, 2003. It follows the life of the Stevenses, a Jewish family living in suburban Sacramento, California, mainly focusing on the clashing personalities of its two younger siblings, Ren and Louis. The series was produced by Brookwell McNamara Entertainment and Fireworks Entertainment. It is often cited as launching Shia LaBeouf's breakout career as an actor. The show features a fast motion photography, which features in every episode. The feature-length Disney Channel Original Movie based on the series, The Even Stevens Movie, premiered on June 13, 2003, and serves as the series finale. As of January 15, 2010, in America, Even Stevens has been removed from television syndication altogether, though The Even Stevens Movie continues to air on Disney Channel and Disney XD, and on Family Channel occasionally. However, in the UK, Even Stevens continues to air on CITV and now Pop Girl. From its launch on June 1, 2011 to late 2012, the series were shown as re-runs on Disney XD in Canada & US. Featured Crew Matt Dearborn Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Christy Carlson Romano Renee \"Ren\" Stevens Shia LaBeouf Louis Stevens Margo Harshman Tawny Dean A.J. Trauth Alan Twitty Nick Spano Donald \"Donnie\" Stevens Full Cast & Crew Last Season Season 3 2002 | 22 Episodes Season 3 of Even Stevens premiered on February 22, 2002. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply S A very scary story Open 0 by Strannger18\n      \n     w Louis: Happy Birthday Shia LaBeouf! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2004-06-18 Phil of the Future 7.0    1997-11-03 Franklin 6.6    2001-01-12 Lizzie McGuire 5.6    2005-09-18 Life with Derek 8.2    1993-09-24 Boy Meets World 7.5    1996-09-02 Arthur 6.7    2007-01-12 Cory in the House 5.4    2003-01-17 That's So Raven 5.6  Facts Status  Ended Networks Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Scripted Original Language  English Runtime  22m, 30m Homepage  - Genres Comedy Keywords california sibling relationship jewish teenager family Content Score 100 Yes! Looking good! Top Contributors 18 Jason Patrick 11 Banana 8 lineker z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}