{"link": "https://www.themoviedb.org/tv/1818?language=en", "title": "Lexx", "resume": "Lexx is a science fantasy television series that follows the adventures of a group of mismatched individuals aboard the organic space craft Lexx. They travel through two universes and encounter planets including a parody of the Earth.\nThe series is a Canadian and German co-production, with some additional funding from Britain's Channel 5. The Sci Fi Channel purchased the series from Salter Street Films and began airing versions of Season 2 episodes for United States' audience in January 2000.\nLexx was co-produced by Salter Street Films, later absorbed by Alliance Atlantis. In Canada, Lexx aired on the Alliance Atlantis-owned Showcase network.\nThe series was primarily filmed in Halifax and Berlin, with additional filming on location in Iceland, Bangkok, and Namibia.", "rate": 73, "genre": ["Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Brian Downey", "Jeffrey Hirschfield", "Xenia Seeberg", "Tom Gallant", "Patricia Zentilli"], "character": ["Zev Bellringer"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1818   Expand Lexx   (1997) User Score Overview Lexx is a science fantasy television series that follows the adventures of a group of mismatched individuals aboard the organic space craft Lexx. They travel through two universes and encounter planets including a parody of the Earth. The series is a Canadian and German co-production, with some additional funding from Britain's Channel 5. The Sci Fi Channel purchased the series from Salter Street Films and began airing versions of Season 2 episodes for United States' audience in January 2000. Lexx was co-produced by Salter Street Films, later absorbed by Alliance Atlantis. In Canada, Lexx aired on the Alliance Atlantis-owned Showcase network. The series was primarily filmed in Halifax and Berlin, with additional filming on location in Iceland, Bangkok, and Namibia. Featured Crew Paul Donovan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Brian Downey Jeffrey Hirschfield Xenia Seeberg Zev Bellringer Tom Gallant Patricia Zentilli Full Cast & Crew Last Season Season 4 2001 | 23 Episodes Season 4 of Lexx premiered on July 13, 2001. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Rutger Hauer Open 0 by wonder2wonder\n      \n     w Eva Habermann Open 0 by wonder2wonder\n      \n     w Best episode? Open 1 by StonerWithaBoner\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  2 Recommendations   2000-10-02 Andromeda 7.1    1995-03-22 Sliders 7.0    1995-03-26 The Outer Limits 8.0    2000-07-24 Mysterious Ways 6.3    2002-06-16 The Dead Zone 6.5    1987-03-31 Max Headroom 6.6    1992-02-18 Men Behaving Badly 7.4    1994-11-06 Earth 2 7.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Drama Sci-Fi & Fantasy Keywords spacecraft outlaw space fugitive Content Score 93 Almost there... Top Contributors 20 Banana 9 lineker 9 Joe Carson CM 8 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}