{"link": "https://www.themoviedb.org/tv/49157?language=en", "title": "Houdini", "resume": "The two-night scripted miniseries “Houdini” follows the epic tales of Harry Houdini as he emerges as America’s first bonafide world-renowned superstar.", "rate": 69, "genre": ["Drama"], "cast": ["Adrien Brody", "Kristen Connolly", "Evan Jones", "Tim Pigott-Smith", "Tom Benedict Knight"], "character": ["Harry Houdini", "Bess Houdini", "Jim Collins", "William Melville", "Dash Houdini"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 49157   Expand Houdini   (2014) User Score  Play Trailer Overview The two-night scripted miniseries “Houdini” follows the epic tales of Harry Houdini as he emerges as America’s first bonafide world-renowned superstar. Featured Crew Uli Edel Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Adrien Brody Harry Houdini Kristen Connolly Bess Houdini Evan Jones Jim Collins Tim Pigott-Smith William Melville Tom Benedict Knight Dash Houdini Full Cast & Crew Last Season Season 1 2014 | 2 Episodes Season 1 of Houdini premiered on September  1, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  9 Recommendations   2011-10-14 Spy 7.6    2012-01-10 The Mystery of Edwin Drood 5.1    2014-03-10 Believe 6.3    2014-04-24 Black Box 6.4    2011-03-06 Wonders of the Universe 8.2    2003-01-17 That's So Raven 5.6    2001-10-06 The Mitchell and Webb Situation 8.0    1983-09-21 Hotel 7.8  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Miniseries Original Language  English Runtime  172m Homepage   http://www.history.com/shows/houdini Genres Drama Keywords magic biography miniseries historical drama houdini Content Score 100 Yes! Looking good! Top Contributors 66 Marr 🇳🇱 TB 43 TMDb Bot 34 Elizabeth Jennings l 12 lexura  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}