{"link": "https://www.themoviedb.org/tv/29200?language=en", "title": "G.I. Joe", "resume": "G.I. Joe: A Real American Hero is a half-hour American animated television series based on the successful toyline from Hasbro and the comic book series from Marvel Comics. The cartoon had its beginnings with two five-part mini-series in 1983 and 1984, then became a regular series that ran in syndication from 1985 to 1986.\nRon Friedman created the G.I. Joe animated series for television, and wrote all four miniseries. The fourth mini-series was intended to be a feature film, but as noted subsequently was released as a television mini-series instead because of production difficulties.", "rate": 78, "genre": ["Animation", "Action", "Adventure"], "cast": ["Christopher Collins", "Andrew Koenig", "Brian Cummings", "Don Brown", "Garry Chalk"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 29200   Expand G.I. Joe   (1983) User Score Overview G.I. Joe: A Real American Hero is a half-hour American animated television series based on the successful toyline from Hasbro and the comic book series from Marvel Comics. The cartoon had its beginnings with two five-part mini-series in 1983 and 1984, then became a regular series that ran in syndication from 1985 to 1986. Ron Friedman created the G.I. Joe animated series for television, and wrote all four miniseries. The fourth mini-series was intended to be a feature film, but as noted subsequently was released as a television mini-series instead because of production difficulties. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Christopher Collins Andrew Koenig Brian Cummings Don Brown Garry Chalk Full Cast & Crew Last Season Season 4 1991 | 20 Episodes Season 4 of G.I. Joe premiered on September 23, 1991. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  5 Recommendations   1976-04-27 The Bugs Bunny/Road Runner Show 8.3    1983-09-17 The Charlie Brown and Snoopy Show 7.0    1989-09-09 Captain N: The Game Master 5.6    1986-09-15 Rambo 5.7    1980-11-08 Richie Rich 5.8    1988-10-01 Dino-Riders 7.0    Felix the Cat 5.7    1994-09-10 ReBoot 8.3  Facts Status  Ended Networks - Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Animation Action & Adventure Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 3 minhus TB 3 TMDb Bot 2 Maikkoum T 1 TVPlayerLatino  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}