{"link": "https://www.themoviedb.org/tv/38922?language=en", "title": "Boss", "resume": "Boss is an American political drama television serial created by Farhad Safinia. The series stars Kelsey Grammer as Tom Kane, the mayor of Chicago, who has recently been diagnosed with dementia with Lewy bodies, a degenerative neurological disorder.", "rate": 81, "genre": ["Drama", "War", "Politics"], "cast": ["Kelsey Grammer", "Connie Nielsen", "Jeff Hephner", "Kathleen Robertson", "Troy Garity"], "character": ["Mayor Tom Kane", "Meredith Kane", "Ben Zajac", "Kitty O'Neil", "Sam Miller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 38922   Expand Boss   (2011) User Score  Play Trailer Overview Boss is an American political drama television serial created by Farhad Safinia. The series stars Kelsey Grammer as Tom Kane, the mayor of Chicago, who has recently been diagnosed with dementia with Lewy bodies, a degenerative neurological disorder. Featured Crew Farhad Safinia Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  12 Posters  11 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kelsey Grammer Mayor Tom Kane Connie Nielsen Meredith Kane Jeff Hephner Ben Zajac Kathleen Robertson Kitty O'Neil Troy Garity Sam Miller Full Cast & Crew Last Season Season 2 2012 | 10 Episodes Season 2 of Boss premiered on August 17, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  12 Posters  11 Recommendations   2012-06-24 The Newsroom 7.8    2008-07-15 The Cleaner 7.1    2012-10-14 Jack Irish 7.4    2012-10-11 Copper 6.0    2011-01-11 Lights Out 8.1    2012-07-02 Blackout 6.0    2011-07-19 The Hour 7.3    2006-07-09 Brotherhood 7.4  Facts Status  Cancelled Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  55m Homepage   http://www.starz.com/originals/Boss Genres Drama War & Politics Keywords chicago politics mayor dementia Content Score 100 Yes! Looking good! Top Contributors 28 Banana 16 rantamplan 7 Elizabeth Jennings p 6 pepeman  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}