{"link": "https://www.themoviedb.org/tv/71181?language=en", "title": "Troy: Fall of a City", "resume": "A rich story of love, intrigue, betrayal and belonging told from the perspective of the Trojan royal family at the heart of the siege of Troy.", "rate": 50, "genre": ["War", "Politics", "Drama", "Action", "Adventure"], "cast": ["Louis Hunter", "Bella Dayne", "David Threlfall", "Frances O'Connor", "Tom Weston-Jones"], "character": ["Paris", "Helen", "King Priam", "Hecuba", "Hector"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 71181   Expand Troy: Fall of a City   (2018) User Score  Play Trailer Overview A rich story of love, intrigue, betrayal and belonging told from the perspective of the Trojan royal family at the heart of the siege of Troy. Featured Crew David Farr Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  7 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Louis Hunter Paris Bella Dayne Helen David Threlfall King Priam Frances O'Connor Hecuba Tom Weston-Jones Hector Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of Troy: Fall of a City premiered on February 17, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Achilles is black, Zeus is black! Open 0 by NotoriousRio\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Troy: Fall of a City. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification 16 Meaning Content suitable for viewers over the age of 16. Type  Scripted Original Language  English Runtime  56m Homepage   http://www.bbc.co.uk/programmes/b09szdtr Genres War & Politics Drama Action & Adventure Keywords ancient greece trojan helen of troy troy Content Score 100 Yes! Looking good! Top Contributors 46 Elizabeth Jennings R 10 Rebecca 9 0x3199 7 AR2030  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}