{"link": "https://www.themoviedb.org/tv/10458?language=en", "title": "The Real McCoys", "resume": "The Real McCoys is an American situation comedy co-produced by Danny Thomas' \"Marterto Productions\", in association with Walter Brennan and Irving Pincus' \"Westgate\" company. The series aired for five seasons on the ABC-TV network from 1957 through 1962 and then for its final year on CBS from 1962 to 1963.\nThe series, set in the San Fernando Valley of California, was filmed in Hollywood at Desilu studios.", "rate": 65, "genre": ["Comedy"], "cast": ["Richard Crenna", "Walter Brennan", "Kathleen Nolan", "Lydia Reed", "Tony Martinez"], "character": ["Grandpa Amos McCoy"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10458   Expand The Real McCoys   (1957) User Score Overview The Real McCoys is an American situation comedy co-produced by Danny Thomas' \"Marterto Productions\", in association with Walter Brennan and Irving Pincus' \"Westgate\" company. The series aired for five seasons on the ABC-TV network from 1957 through 1962 and then for its final year on CBS from 1962 to 1963. The series, set in the San Fernando Valley of California, was filmed in Hollywood at Desilu studios. Featured Crew Irving Pincus Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Crenna Walter Brennan Grandpa Amos McCoy Kathleen Nolan Lydia Reed Tony Martinez Full Cast & Crew Last Season Season 6 1962 | 39 Episodes Season 6 of The Real McCoys premiered on September 30, 1962. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply good show Open 1 by  JohnSteed Go to Discussions Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1955-09-06 The Life and Legend of Wyatt Earp 8.2    1955-09-20 The Phil Silvers Show 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Comedy Keywords farm california family sitcom Content Score 79 Pump it up! We're close now. Top Contributors 9 Banana BD 2 Bob Daredevil d 1 de0987  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}