{"link": "https://www.themoviedb.org/tv/4899?language=en", "title": "I Spy", "resume": "I Spy is an American television secret-agent adventure series. It ran for three seasons on NBC from 1965 to 1968 and teamed Robert Culp as international tennis player Kelly Robinson with Bill Cosby as his trainer, Alexander Scott. The characters' travels as ostensible \"tennis bums\", Robinson playing talented tennis as an amateur with the wealthy in return for food and lodging, and Scott tagging along, provided a cover story concealing their roles as top agents for the Pentagon. Their real work usually kept them busy chasing villains, spies, and beautiful women.\nThe creative forces behind the show were writers David Friedkin and Morton Fine and cinematographer Fouad Said. Together they formed Three F Productions under the aegis of Desilu Studios where the show was produced. Fine and Friedkin were co-producers and head writers, and wrote the scripts for 16 episodes, one of which Friedkin directed. Friedkin also dabbled in acting and appeared in two episodes in the first season.\nActor-producer Sheldon Leonard, best known for playing gangster roles in the 1940s and '50s, was the executive producer. He also played a gangster-villain role in two episodes and appeared in a third show as himself in a humorous cameo. In addition, he directed one episode and served as occasional second-unit director throughout the series.", "rate": 71, "genre": ["Action", "Adventure"], "cast": ["Bill Cosby", "Robert Culp", "Vera Miles", "Carroll O'Connor", "Eartha Kitt"], "character": ["Alexander Scott", "Kelly Robinson", "Rachel", "Dr. Karolyi", "Angel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 4899   Expand I Spy   (1965) User Score Overview I Spy is an American television secret-agent adventure series. It ran for three seasons on NBC from 1965 to 1968 and teamed Robert Culp as international tennis player Kelly Robinson with Bill Cosby as his trainer, Alexander Scott. The characters' travels as ostensible \"tennis bums\", Robinson playing talented tennis as an amateur with the wealthy in return for food and lodging, and Scott tagging along, provided a cover story concealing their roles as top agents for the Pentagon. Their real work usually kept them busy chasing villains, spies, and beautiful women. The creative forces behind the show were writers David Friedkin and Morton Fine and cinematographer Fouad Said. Together they formed Three F Productions under the aegis of Desilu Studios where the show was produced. Fine and Friedkin were co-producers and head writers, and wrote the scripts for 16 episodes, one of which Friedkin directed. Friedkin also dabbled in acting and appeared in two episodes in the first season. Actor-producer Sheldon Leonard, best known for playing gangster roles in the 1940s and '50s, was the executive producer. He also played a gangster-villain role in two episodes and appeared in a third show as himself in a humorous cameo. In addition, he directed one episode and served as occasional second-unit director throughout the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Cosby Alexander Scott Robert Culp Kelly Robinson Vera Miles Rachel Carroll O'Connor Dr. Karolyi Eartha Kitt Angel Full Cast & Crew Last Season Season 3 1967 | 26 Episodes Season 3 of I Spy premiered on September 11, 1967. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1965-01-24 Branded 8.3    1968-01-09 It Takes a Thief 7.4    1957-09-18 Wagon Train 6.3    1962-10-02 Combat! 7.1    1970-09-16 McCloud 7.0    1971-09-14 Cannon 5.6    1973-01-28 Barnaby Jones 8.0    1959-10-15 The Untouchables 8.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Keywords tennis secret agent Content Score 86 Almost there... Top Contributors 17 Banana S 5 Samara b 4 b2k 3 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}