{"link": "https://www.themoviedb.org/tv/46733?language=en", "title": "Married to Medicine", "resume": "Follows a group of successful and educated women who are connected to the world of medicine in Atlanta, including doctors and wives of doctors. Whether delivering babies in Louboutins or rushing off to galas in Buckhead, these women do everything with style, drama, and of course, southern flair.", "rate": 70, "genre": ["Reality"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46733   Expand Married to Medicine   (2013) User Score  Play Trailer Overview Follows a group of successful and educated women who are connected to the world of medicine in Atlanta, including doctors and wives of doctors. Whether delivering babies in Louboutins or rushing off to galas in Buckhead, these women do everything with style, drama, and of course, southern flair. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Waiting to Exhale 2017 | 18 Episodes View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply IMDB Sign in! Open 5 by  booklover0226 Go to Discussions Media Most Popular Videos  1 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Married to Medicine. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Reality Original Language  English Runtime  43m Homepage   http://bravotv.com/married-to-medicine Genres Reality Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors 12 Banana TB 11 TMDb Bot b 7 basher 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}