{"link": "https://www.themoviedb.org/tv/985?language=en", "title": "Wacky Races", "resume": "Wacky Races is an American animated television series produced by Hanna-Barbera. The series, inspired by the 1965 slapstick comedy film The Great Race, features 11 different cars racing against each other in various road rallies throughout North America, with each driver hoping to win the title of the \"World's Wackiest Racer.\" Wacky Races ran on CBS from September 14, 1968, to January 4, 1969. Seventeen episodes were produced, with each episode featuring two different races.\nThe cartoon had an unusually large number of regular characters, with twenty-three people and animals spread among the 11 race cars. Reruns of the series currently air several times a day on Cartoon Network's classic animation network Boomerang.", "rate": 71, "genre": ["Family", "Animation", "Comedy"], "cast": ["John Stephenson", "Paul Winchell", "Don Messick", "Daws Butler", "Janet Waldo"], "character": ["Blubber Bear (voice)", "Clyde (voice)", "Gravel Slag (voice)", "Big Gruesome (voice)", "Penelope Pitstop (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 985   Expand Wacky Races   (1968) User Score Overview Wacky Races is an American animated television series produced by Hanna-Barbera. The series, inspired by the 1965 slapstick comedy film The Great Race, features 11 different cars racing against each other in various road rallies throughout North America, with each driver hoping to win the title of the \"World's Wackiest Racer.\" Wacky Races ran on CBS from September 14, 1968, to January 4, 1969. Seventeen episodes were produced, with each episode featuring two different races. The cartoon had an unusually large number of regular characters, with twenty-three people and animals spread among the 11 race cars. Reruns of the series currently air several times a day on Cartoon Network's classic animation network Boomerang. Featured Crew hanna-barbera Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast John Stephenson Blubber Bear (voice) Paul Winchell Clyde (voice) Don Messick Gravel Slag (voice) Daws Butler Big Gruesome (voice) Janet Waldo Penelope Pitstop (voice) Full Cast & Crew Last Season Season 1 1968 | 34 Episodes Season 1 of Wacky Races premiered on September 14, 1968. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  5 Recommendations   1960-11-14 Popeye the Sailor 5.8    1974-09-07 Hong Kong Phooey 6.1    1961-09-27 Top Cat 6.9    1969-09-13 The Perils of Penelope Pitstop 5.7    1958-10-02 The Huckleberry Hound Show 7.0    1940-11-25 The Woody Woodpecker Show 7.1    1964-12-18 The Pink Panther Show 7.0    1977-09-10 Captain Caveman and the Teen Angels 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  11m Homepage  - Genres Family Animation Comedy Keywords racing car Content Score 93 Almost there... Top Contributors z 32 zurman1 23 Banana c 4 copmad 4 m.aicardi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}