{"link": "https://www.themoviedb.org/tv/39218?language=en", "title": "Puella Magi Madoka Magica", "resume": "She has a loving family and best friends, laughs and cries from time to time... Madoka Kaname, an eighth grader of Mitakihara middle school, is one of those who lives such a life. One day, she had a very magical encounter. She doesn't know if it happened by chance or by fate yet. This is a fateful encounter that can change her destiny. This is a beginning of the new story of the magical witch girls.", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Aoi Yuki", "Chiwa Saito", "Eri Kitamura", "Ai Nonaka", "Emiri Kato"], "character": ["Madoka Kaname (voice)", "Homura Akemi (voice)", "Sayaka Miki (voice)", "Kyoko Sakura (voice)", "Kyuubey (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39218   Expand Puella Magi Madoka Magica   (2011) User Score  Play Trailer Overview She has a loving family and best friends, laughs and cries from time to time... Madoka Kaname, an eighth grader of Mitakihara middle school, is one of those who lives such a life. One day, she had a very magical encounter. She doesn't know if it happened by chance or by fate yet. This is a fateful encounter that can change her destiny. This is a beginning of the new story of the magical witch girls. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  13 Posters  6 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  7 Opening Credits  0 Top Billed Cast Aoi Yuki Madoka Kaname (voice) Chiwa Saito Homura Akemi (voice) Eri Kitamura Sayaka Miki (voice) Ai Nonaka Kyoko Sakura (voice) Emiri Kato Kyuubey (voice) Full Cast & Crew Last Season Season 1 2011 | 12 Episodes Season 1 of Puella Magi Madoka Magica premiered on January  7, 2011. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Puella Magi Madoka Magica. Login to be first! Go to Discussions Media Most Popular Videos  9 Backdrops  13 Posters  6 Recommendations   2006-04-03 The Melancholy of Haruhi Suzumiya 7.6    2007-07-27 Baccano! 8.4    2013-10-04 Kill la Kill 7.7    2007-04-01 Gurren Lagann 7.9    2010-04-03 Angel Beats! 7.4    2007-07-05 Higurashi When They Cry 7.6    2009-07-03 Monogatari 7.7    2010-01-08 Durarara!! 7.4  Facts Original Name  魔法少女まどか☆マギカ Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.madoka-magica.com/tv/ Genres Animation Sci-Fi & Fantasy Keywords magic wish surrealism teenage girl schoolgirl girls with guns schoolmates dark fantasy transfer student foreshadowing magical girl anime sinister Content Score 93 Almost there... Top Contributors 189 RubeensVinicius 112 Marr 🇳🇱 t 22 tmdb87307992 16 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}