{"link": "https://www.themoviedb.org/tv/35790?language=en", "title": "Cardcaptor Sakura", "resume": "Sakura Kinomoto, an elementary school student who discovers that she possesses magical powers after accidentally freeing a set of magical cards from the book they had been sealed in for years. She is then tasked with retrieving those cards in order to avoid an unknown catastrophe from befalling the world.", "rate": 75, "genre": ["Animation", "Sci-Fi", "Fantasy"], "cast": ["Sakura Tange", "Junko Iwao", "Motoko Kumai", "Aya Hisakawa", "Emi Shinohara"], "character": ["Sakura Kinomoto", "Tomoyo Daidouji", "Syaoran Li", "Kerberos", "Naoko Yanagisawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35790   Expand Cardcaptor Sakura   (1998) User Score Overview Sakura Kinomoto, an elementary school student who discovers that she possesses magical powers after accidentally freeing a set of magical cards from the book they had been sealed in for years. She is then tasked with retrieving those cards in order to avoid an unknown catastrophe from befalling the world. Featured Crew Satsuki Igarashi Creator Nanase Ohkawa Creator Tsubaki Nekoi Creator Mokona Apapa Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sakura Tange Sakura Kinomoto Junko Iwao Tomoyo Daidouji Motoko Kumai Syaoran Li Aya Hisakawa Kerberos Emi Shinohara Naoko Yanagisawa Full Cast & Crew Current Season Clear Card 2018 | 1 Episode View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations   2002-06-03 Hamtaro 6.8    2005-04-09 Tsubasa Chronicle 6.6    1964-09-18 Jonny Quest 7.9    2002-04-08 Azumanga Daioh 8.7    1964-09-25 Gomer Pyle, U.S.M.C. 6.8    2000-09-09 Jackie Chan Adventures 7.1    1992-10-10 Yu Yu Hakusho 7.7    2010-01-08 Durarara!! 7.4  Facts Original Name  カードキャプターさくら Status  Returning Series Networks Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  Japanese Runtime  30m Homepage  - Genres Animation Sci-Fi & Fantasy Keywords based on manga anime watercolour style nakayoshi Content Score 100 Yes! Looking good! Top Contributors M 36 Marcelo90 32 Nakirasu 19 BlackDelivery 14 sp1ti  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}