{"link": "https://www.themoviedb.org/tv/67506?language=en", "title": "SOTUS The Series", "resume": "The \"Gear\" is one of the engineering mechanical devices in the cogwheel system (as in a clock). Having one signifies that one is a student of the Faculty of Engineering. However, to get one, all engineering freshmen must first undergo the SOTUS (acronym for Seniority, Order, Tradition, Unity, and Spirit) system. Arthit (Perawat Sangpotirat), one of the third year seniors, often abuses his power over the freshmen by making them do things against the rules. Freshmen students are practically powerless to complain or resist any orders given by their seniors. Arthit was seemingly unstoppable, until Kongpob (Prachaya Ruangroj) stood up against the abuses by the former. Continual encounters between the two developed from animosity to something much more affectionate.", "rate": 64, "genre": ["Drama"], "cast": ["Prachaya Ruangroj", "Perawat Sangpotirat", "Suwanamas Neen", "Thitipoom Techaapaikhun", "Korn Khunatipapisiri"], "character": ["Kongpob \"Kong\" Suthiluck", "Arthit Rojnapat", "May", "M/Em/Aim", "Tew"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67506   Expand SOTUS The Series   (2016) User Score  Play Trailer Overview The \"Gear\" is one of the engineering mechanical devices in the cogwheel system (as in a clock). Having one signifies that one is a student of the Faculty of Engineering. However, to get one, all engineering freshmen must first undergo the SOTUS (acronym for Seniority, Order, Tradition, Unity, and Spirit) system. Arthit (Perawat Sangpotirat), one of the third year seniors, often abuses his power over the freshmen by making them do things against the rules. Freshmen students are practically powerless to complain or resist any orders given by their seniors. Arthit was seemingly unstoppable, until Kongpob (Prachaya Ruangroj) stood up against the abuses by the former. Continual encounters between the two developed from animosity to something much more affectionate. Featured Crew BitterSweet Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Prachaya Ruangroj Kongpob \"Kong\" Suthiluck Perawat Sangpotirat Arthit Rojnapat Suwanamas Neen May Thitipoom Techaapaikhun M/Em/Aim Korn Khunatipapisiri Tew Full Cast & Crew Current Season Sotus S: The Series 2017 | 10 Episodes Season 2 of SOTUS The Series premiered on December  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on SOTUS The Series. You can help by rating TV shows you've seen. Facts Original Name  SOTUS The Series พี่ว้ากตัวร้ายกับนายปีหนึ่ง Status  Returning Series Network Certification น 15+ Meaning Nor 15+ Movies appropriate for audiences aged 15 and older. Some violence, brutality, inhumanity, bad language or indecent gestures allowed. Type  Scripted Original Language  Thai Runtime  45m Homepage   https://www.facebook.com/fellowwchannel Genres Drama Keywords gay romance thai school Content Score 100 Yes! Looking good! Top Contributors 45 kbogesz L 12 Luxairel Lp 7 L phatom TB 5 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}