{"link": "https://www.themoviedb.org/tv/2455?language=en", "title": "Coach", "resume": "Coach is an American television sitcom that aired for nine seasons on ABC from 1989 to 1997. The series stars Craig T. Nelson as Hayden Fox, head coach of the fictional Division I-A college football team the Minnesota State University Screaming Eagles. The program also starred Jerry Van Dyke as Luther Van Dam and Bill Fagerbakke as Michael \"Dauber\" Dybinski, assistant coaches under Fox. The role of Hayden's girlfriend Christine Armstrong, a television news anchor, was played by Shelley Fabares.", "rate": 69, "genre": ["Comedy"], "cast": ["Craig T. Nelson", "Jerry Van Dyke", "Shelley Fabares", "Bill Fagerbakke", "Clare Carey"], "character": ["Coach Hayden Fox"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2455   Expand Coach   (1989) User Score Overview Coach is an American television sitcom that aired for nine seasons on ABC from 1989 to 1997. The series stars Craig T. Nelson as Hayden Fox, head coach of the fictional Division I-A college football team the Minnesota State University Screaming Eagles. The program also starred Jerry Van Dyke as Luther Van Dam and Bill Fagerbakke as Michael \"Dauber\" Dybinski, assistant coaches under Fox. The role of Hayden's girlfriend Christine Armstrong, a television news anchor, was played by Shelley Fabares. Featured Crew Barry Kemp Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig T. Nelson Coach Hayden Fox Jerry Van Dyke Shelley Fabares Bill Fagerbakke Clare Carey Full Cast & Crew Last Season Season 9 1996 | 23 Episodes Season 9 of Coach premiered on September 28, 1996. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1983-09-16 Webster 4.9    1985-09-24 Growing Pains 6.1    1981-10-29 Gimme a Break! 5.7    1982-03-23 Joanie Loves Chachi 2.4    1984-09-25 Three's a Crowd 6.7    1984-01-04 Night Court 6.9    1957-10-04 Leave It to Beaver 7.1    1982-09-27 Square Pegs 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  24m, 30m Homepage  - Genres Comedy Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 12 t0by s 3 speedycars S 2 Samara P 2 PC  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}