{"link": "https://www.themoviedb.org/tv/35094?language=en", "title": "Wild Kratts", "resume": "The adventures of Chris and Martin Kratt as they encounter incredible wild animals, combining science education with fun and adventure as the duo travels to animal habitats around the globe.", "rate": 80, "genre": ["Family", "Animation", "Comedy"], "cast": ["Chris Kratt", "Martin Kratt", "Athena Karkanis", "Jonathan Malen", "Heather Bambrick"], "character": ["Chris", "Martin,M.K", "Aviva Corcovado", "Jimmy Z", "Koki"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 35094   Expand Wild Kratts   (2011) User Score  Play Trailer Overview The adventures of Chris and Martin Kratt as they encounter incredible wild animals, combining science education with fun and adventure as the duo travels to animal habitats around the globe. Featured Crew Martin Kratt Creator Chris Kratt Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  19 Images Backdrops  4 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Kratt Chris Martin Kratt Martin,M.K Athena Karkanis Aviva Corcovado Jonathan Malen Jimmy Z Heather Bambrick Koki Full Cast & Crew Last Season Season 4 2017 | 3 Episodes Season 4 of Wild Kratts premiered on January 17, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Wild Kratts. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  4 Posters  3 Recommendations   2008-09-01 Sid the Science Kid 6.1    2007-09-03 Super Why! 5.7    2012-02-18 Transformers: Rescue Bots 6.8  Facts Status  Returning Series Network Certification TV-Y Meaning This program is designed to be appropriate for all children. Type  Scripted Original Language  English Runtime  22m Homepage   http://pbskids.org/wildkratts/ Genres Family Animation Comedy Keywords animal educational nature Content Score 100 Yes! Looking good! Top Contributors 18 Banana 16 Elizabeth Jennings 14 svance n 9 norbertn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}