{"link": "https://www.themoviedb.org/tv/3752?language=en", "title": "Fort Boyard", "resume": "Fort Boyard is a French game show created by Jacques Antoine that was first broadcast in 1990 and is popular to this day. It has been re-made across the globe, successfully in many countries. Those include: Germany, the United Kingdom, Sweden, Norway, Canada, Ukraine, Russia, Denmark, Belgium, the Netherlands, Greece and more recently in Algeria, Poland and Finland over a 20-year period.\nSet and filmed on the real Fort Boyard in France, the programme appears similar to The Crystal Maze.\nIn both programmes the contestants have to complete challenges to win prize money. However, while The Crystal Maze varies the type of games quite considerably, Fort Boyard tends to focus mainly on physical and endurance challenges. Although Fort Boyard was something of a pioneer in the area of game show fear and adventure, later programmes such as Fear Factor have pushed things even further, requiring Fort Boyard to react and adapt with new twists and games, including a couple of seasons in which the contestants spent the night in the Fort.", "rate": 58, "genre": ["Action", "Adventure", "Family"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3752   Expand Fort Boyard   (1990) User Score Overview Fort Boyard is a French game show created by Jacques Antoine that was first broadcast in 1990 and is popular to this day. It has been re-made across the globe, successfully in many countries. Those include: Germany, the United Kingdom, Sweden, Norway, Canada, Ukraine, Russia, Denmark, Belgium, the Netherlands, Greece and more recently in Algeria, Poland and Finland over a 20-year period. Set and filmed on the real Fort Boyard in France, the programme appears similar to The Crystal Maze. In both programmes the contestants have to complete challenges to win prize money. However, while The Crystal Maze varies the type of games quite considerably, Fort Boyard tends to focus mainly on physical and endurance challenges. Although Fort Boyard was something of a pioneer in the area of game show fear and adventure, later programmes such as Fear Factor have pushed things even further, requiring Fort Boyard to react and adapt with new twists and games, including a couple of seasons in which the contestants spent the night in the Fort. Featured Crew Jacques Antoine Creator Jean-Pierre Mitrecey Creator Pierre Launay Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 28 2017 | 1 Episode Season 28 of Fort Boyard premiered on June 24, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Fort Boyard. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  1 Recommendations   1985-09-29 MacGyver 7.3  Facts Status  Returning Series Networks Leafrad Certification  - Type  Scripted Original Language  French Runtime  130m Homepage   http://fort-boyard.france2.fr/ Genres Action & Adventure Family Keywords game show challenge endurance strength Content Score 64 We're so close, yet so far. Top Contributors C 112 CZ.Fox b 15 bbool E 7 EightNine 5 Kelian  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}