{"link": "https://www.themoviedb.org/tv/12317?language=en", "title": "Australian Story", "resume": "Australian Story is a national weekly documentary series, produced and broadcast on ABC Television. Since 1996 Australian Story has featured many Australians from diverse backgrounds and reputations. Examples include Hazel Hawke, rugby league coach Wayne Bennett, Australia's first female Prime Minister Julia Gillard, comedian & broadcaster Red Symons, actor and author William McInnes, former Governor-General Peter Hollingworth, fashion designers Sass & Bide, art-activist Van Rudd, Crocodile Hunter Steve Irwin and actress and singer Belinda Emmett. Lower profile Australians have also been profiled, such as Sabina Wolanski who was the Holocaust survivor chosen to represent the six million dead at the opening of the Memorial to the Murdered Jews of Europe.\nThere is no reporter narration – the stories are 'told' by the profile subjects and other individuals such as friends, family, colleagues and critics. The program aims to present a varied and contrasting picture of contemporary Australia and Australians, both known and unknown.\nBut on the whole, the personal approach to story-telling has been very well received with the program winning many professional awards including seven Walkley Awards for excellence in journalism and four consecutive Logie Awards.", "rate": 10, "genre": ["Documentary", "News"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12317   Expand Australian Story   (1996) User Score Overview Australian Story is a national weekly documentary series, produced and broadcast on ABC Television. Since 1996 Australian Story has featured many Australians from diverse backgrounds and reputations. Examples include Hazel Hawke, rugby league coach Wayne Bennett, Australia's first female Prime Minister Julia Gillard, comedian & broadcaster Red Symons, actor and author William McInnes, former Governor-General Peter Hollingworth, fashion designers Sass & Bide, art-activist Van Rudd, Crocodile Hunter Steve Irwin and actress and singer Belinda Emmett. Lower profile Australians have also been profiled, such as Sabina Wolanski who was the Holocaust survivor chosen to represent the six million dead at the opening of the Memorial to the Murdered Jews of Europe. There is no reporter narration – the stories are 'told' by the profile subjects and other individuals such as friends, family, colleagues and critics. The program aims to present a varied and contrasting picture of contemporary Australia and Australians, both known and unknown. But on the whole, the personal approach to story-telling has been very well received with the program winning many professional awards including seven Walkley Awards for excellence in journalism and four consecutive Logie Awards. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Series 2018 2018 | 17 Episodes Season 23 of Australian Story premiered on February  5, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Australian Story. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Documentary Original Language  English Runtime  30m Homepage   http://www.abc.net.au/austory/ Genres Documentary News Keywords documentary Content Score 56 We're so close, yet so far. Top Contributors 84 United600 TB 19 TMDb Bot 5 Banana 2 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}