{"link": "https://www.themoviedb.org/tv/1087?language=en", "title": "Serial Experiments Lain", "resume": "Lain is an avant-garde anime influenced by philosophical subjects such as reality, identity, and communication. The series focuses on Lain Iwakura, an adolescent girl living in suburban Japan, and her introduction to the Wired, a global communications network similar to the Internet.", "rate": 81, "genre": ["Animation", "Drama", "Sci-Fi", "Fantasy", "Mystery"], "cast": ["Rei Igarashi", "Ayako Kawasumi", "Kaori Shimizu", "Ryūsuke Ōbayashi", "Shigeru Chiba"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1087   Expand Serial Experiments Lain   (1998) User Score Overview Lain is an avant-garde anime influenced by philosophical subjects such as reality, identity, and communication. The series focuses on Lain Iwakura, an adolescent girl living in suburban Japan, and her introduction to the Wired, a global communications network similar to the Internet. Featured Crew Yoshitoshi ABe Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rei Igarashi Ayako Kawasumi Kaori Shimizu Ryūsuke Ōbayashi Shigeru Chiba Full Cast & Crew Last Season Season 1 1998 | 13 Episodes Season 1 of Serial Experiments Lain premiered on July  6, 1998. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  6 Recommendations   2004-02-03 Paranoia Agent 7.8    1995-10-04 Neon Genesis Evangelion 8.0    2011-04-06 Steins;Gate 8.2    2011-01-07 Puella Magi Madoka Magica 7.9    2000-04-26 FLCL 8.1    2004-04-06 Monster 7.7    2003-03-19 The Diary of Tortov Roddle 8.8    2003-04-08 Kino's Journey 7.4  Facts Original Name  シリアルエクスペリメンツレイン Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage  - Genres Animation Drama Sci-Fi & Fantasy Mystery Keywords computer dementia cyberpunk seinen men in black anime virtual world Content Score 93 Almost there... Top Contributors 10 Panayotis d 10 disturbD 7 BarkingBaphomet 7 qw0aszx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}