{"link": "https://www.themoviedb.org/tv/67814?language=en", "title": "The Legend of Chusen", "resume": "Can a man love a woman but still take down her father? Zhang Xiao Fan and his childhood friend Lin Jing Yu were the only survivors of the Grass Village massacre that wiped out both of their families. Taken in by the Qing Yun Sect, the boys were trained in the ways of the Immortal Sword. Xiao Fan falls in love with Bi Yao, the daughter of the Ghost King. But when the Ghost King tries to grow his power by overthrowing the Qing Yun Sect, Xiao Fan must choose between protecting his people and hurting the woman he loves.", "rate": 95, "genre": ["Action", "Adventure", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Li Yifeng", "Zhao Liying", "Yang Zi", "Tina Tang"], "character": ["Zhang Xiao Fan", "Bi Yao", "Lu Xue Qi", "Tian Ling'er"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67814   Expand The Legend of Chusen   (2016) User Score Overview Can a man love a woman but still take down her father? Zhang Xiao Fan and his childhood friend Lin Jing Yu were the only survivors of the Grass Village massacre that wiped out both of their families. Taken in by the Qing Yun Sect, the boys were trained in the ways of the Immortal Sword. Xiao Fan falls in love with Bi Yao, the daughter of the Ghost King. But when the Ghost King tries to grow his power by overthrowing the Qing Yun Sect, Xiao Fan must choose between protecting his people and hurting the woman he loves. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Li Yifeng Zhang Xiao Fan Zhao Liying Bi Yao Yang Zi Lu Xue Qi Tina Tang Tian Ling'er Full Cast & Crew Last Season Season 2 2016 | 18 Episodes Season 2 of The Legend of Chusen premiered on December  8, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on The Legend of Chusen. You can help by rating TV shows you've seen. Facts Original Name  青云志 Status  Ended Network Hunan Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Action & Adventure Drama Mystery Sci-Fi & Fantasy Keywords xianxia Content Score 86 Almost there... Top Contributors M 44 Maria180493 17 Tony z 10 zurman1 10 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}