{"link": "https://www.themoviedb.org/tv/39845?language=en", "title": "The Voice", "resume": "The Voice is an Australian reality talent show based on the original Dutch version of the program created by John de Mol and is part of a wider international franchise. The first series premiered on the Nine Network on 15 April 2012 featuring Delta Goodrem, Joel Madden, Seal and Keith Urban as the coaches. Karise Eden was the show's first season's winner, defeating Darren Percival, Rachael Leahcar and Sarah De Bono in the live-to-air finale broadcast on 18 June 2012. Urban was replaced by Ricky Martin for the show's second series after joining the American Idol judging panel. The series is hosted by Darren McMullen with Faustina Agolley as the social media correspondent.", "rate": 90, "genre": ["Reality"], "cast": ["Delta Goodrem", "Boy George", "Kelly Rowland", "Joe Jonas"], "character": ["Herself", "Himself", "Herself", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39845   Expand The Voice   (2012) User Score Overview The Voice is an Australian reality talent show based on the original Dutch version of the program created by John de Mol and is part of a wider international franchise. The first series premiered on the Nine Network on 15 April 2012 featuring Delta Goodrem, Joel Madden, Seal and Keith Urban as the coaches. Karise Eden was the show's first season's winner, defeating Darren Percival, Rachael Leahcar and Sarah De Bono in the live-to-air finale broadcast on 18 June 2012. Urban was replaced by Ricky Martin for the show's second series after joining the American Idol judging panel. The series is hosted by Darren McMullen with Faustina Agolley as the social media correspondent. Featured Crew John de Mol Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Delta Goodrem Herself Boy George Himself Kelly Rowland Herself Joe Jonas Himself Full Cast & Crew Current Season Season 7 2018 | 20 Episodes Season 7 of The Voice premiered on April 15, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Voice. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage   http://www.thevoice.com.au/ Genres Reality Keywords singing competition reality competition Content Score 93 Almost there... Top Contributors c 62 courtneysmith86 11 szab b 8 basher 7 oldboy3  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}