{"link": "https://www.themoviedb.org/tv/39614?language=en", "title": "The Voice UK", "resume": "A vocal contest reality series featuring people with real talent and great voices. Only the very best singers make it through the the blind auditions, the decisions from the four celebrity coaches are based solely on the voices they hear - and nothing else.", "rate": 33, "genre": ["Reality"], "cast": ["Will.i.am"], "character": ["Himself - Coach"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 39614   Expand The Voice UK   (2012) User Score  Play Trailer Overview A vocal contest reality series featuring people with real talent and great voices. Only the very best singers make it through the the blind auditions, the decisions from the four celebrity coaches are based solely on the voices they hear - and nothing else. Featured Crew John de Mol Creator VanVelzen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Will.i.am Himself - Coach Full Cast & Crew Current Season Season 7 2018 | 14 Episodes Season 7 of The Voice UK premiered on January  6, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  3 Recommendations   1992-10-23 The World of Peter Rabbit and Friends 6.7  Facts Status  Returning Series Networks Certification  - Type  Reality Original Language  English Runtime  120m, 90m Homepage   http://itv.com/thevoice Genres Reality Keywords singing competition Content Score 71 Just a little bit more... Top Contributors 49 Banana 29 Elizabeth Jennings 9 szab 7 Ash  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}