{"link": "https://www.themoviedb.org/tv/70194?language=en", "title": "My Father is Strange", "resume": "Ahn Joong-Hee is an actor who used to be a member of an idol group. One day, he appears in front of a family who consists Byun Han-Soo and Na Young-Sil and their 4 children including Hye-Young and Mi-Young. Joong-Hee begins to live wth them.", "rate": 70, "genre": ["Comedy", "Drama", "Family"], "cast": ["Kim Yeong-cheol", "Kim Hae-sook", "Ryu Soo-young", "Lee Yoo-ri", "Lee Joon"], "character": ["Byun Han-Soo", "Na Young-Sil", "Cha Jung-Hwan", "Byun Hye-Young", "Ahn Joong-Hee"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70194   Expand My Father is Strange   (2017) User Score  Play Trailer Overview Ahn Joong-Hee is an actor who used to be a member of an idol group. One day, he appears in front of a family who consists Byun Han-Soo and Na Young-Sil and their 4 children including Hye-Young and Mi-Young. Joong-Hee begins to live wth them. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Yeong-cheol Byun Han-Soo Kim Hae-sook Na Young-Sil Ryu Soo-young Cha Jung-Hwan Lee Yoo-ri Byun Hye-Young Lee Joon Ahn Joong-Hee Full Cast & Crew Last Season Season 1 2017 | 52 Episodes Season 1 of My Father is Strange premiered on March  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on My Father is Strange. You can help by rating TV shows you've seen. Facts Original Name  아버지가 이상해 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://www.kbs.co.kr/drama/papa/ Genres Comedy Drama Family Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors M 61 Maria180493 14 Elizabeth Jennings 5 andermairena n 4 nubie  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}