{"link": "https://www.themoviedb.org/tv/12875?language=en", "title": "The Dean Martin Show", "resume": "The Dean Martin Show, also known as The Dean Martin Variety Show, is a TV variety-comedy series that ran from 1965 to 1974 for 264 episodes. It was broadcast by NBC and hosted by entertainer Dean Martin. The theme song to the series was his 1964 hit \"Everybody Loves Somebody.\"", "rate": 70, "genre": ["Comedy"], "cast": ["Dean Martin", "Kay Medford", "Les Brown", "Lou Jacobi", "Marian Mercer"], "character": ["Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12875   Expand The Dean Martin Show   (1965) User Score Overview The Dean Martin Show, also known as The Dean Martin Variety Show, is a TV variety-comedy series that ran from 1965 to 1974 for 264 episodes. It was broadcast by NBC and hosted by entertainer Dean Martin. The theme song to the series was his 1964 hit \"Everybody Loves Somebody.\" Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dean Martin Host Kay Medford Les Brown Lou Jacobi Marian Mercer Full Cast & Crew Last Season Season 9 1973 | 30 Episodes Season 9 of The Dean Martin Show premiered on September 13, 1973. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1970-09-17 The Flip Wilson Show 3.7    1963-09-29 The Judy Garland Show 5.0    1952-12-05 The Abbott and Costello Show 5.6    1965-09-01 Gidget 5.2    1968-09-23 Here's Lucy 5.8    1979-09-30 To the Manor Born 7.1    1962-09-20 The Alfred Hitchcock Hour 7.7    1965-09-14 F Troop 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Comedy Keywords variety show Content Score 86 Almost there... Top Contributors 11 Banana CM 4 Cherche Moi TB 2 TMDb Bot s 2 slartus  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}