{"link": "https://www.themoviedb.org/tv/70878?language=en", "title": "Eromanga Sensei", "resume": "This \"sibling romantic comedy\" revolves around Masamune Izumi, a light novel author in high school. Masamune's little sister is Sagiri, a shut-in girl who hasn't left her room for an entire year. She even forces her brother to make and bring her meals when she stomps the floor. Masamune wants his sister to leave her room, because the two of them are each other's only family.\nMasamune's novel illustrator, pen name \"Eromanga,\" draws extremely perverted drawings, and is very reliable. Masamune had never met his illustrator, and figured he was just a disgusting, perverted otaku. However, the truth is revealed… that his \"Eromanga-sensei\" is his own younger sister! To add to the chaos that erupts between the siblings, a beautiful, female, best-selling shoujo manga creator becomes their rival!", "rate": 61, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Matsuoka Shozo", "Masami Takahashi", "Saori Ohnishi", "Nobunaga Shimaki", "Akane Fujita"], "character": ["Izumi Masami", "Yamada Elf", "Senju Murasama", "Shodo Shido", "Izumi Saegumi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70878   Expand Eromanga Sensei   (2017) User Score  Play Trailer Overview This \"sibling romantic comedy\" revolves around Masamune Izumi, a light novel author in high school. Masamune's little sister is Sagiri, a shut-in girl who hasn't left her room for an entire year. She even forces her brother to make and bring her meals when she stomps the floor. Masamune wants his sister to leave her room, because the two of them are each other's only family. Masamune's novel illustrator, pen name \"Eromanga,\" draws extremely perverted drawings, and is very reliable. Masamune had never met his illustrator, and figured he was just a disgusting, perverted otaku. However, the truth is revealed… that his \"Eromanga-sensei\" is his own younger sister! To add to the chaos that erupts between the siblings, a beautiful, female, best-selling shoujo manga creator becomes their rival! Featured Crew Ryohei Takeshita Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Matsuoka Shozo Izumi Masami Masami Takahashi Yamada Elf Saori Ohnishi Senju Murasama Nobunaga Shimaki Shodo Shido Akane Fujita Izumi Saegumi Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Eromanga Sensei premiered on April  9, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Eromanga Sensei. You can help by rating TV shows you've seen. Facts Original Name  エロマンガ先生 Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://eromanga-sensei.com/ Genres Animation Comedy Drama Keywords based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 18 sp1ti C 13 Chintaran 10 Jenazad 10 Leaked Inc  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}