{"link": "https://www.themoviedb.org/tv/75820?language=en", "title": "Mr. Sunshine", "resume": "Based in Shinmiyangyo, or the U.S. expedition to Korea in the late 19th century, Mr. Sunshine tells the story of a Korean boy born into a family of a house servant running away to board an American warship, later to return to his homeland as a U.S. marine officer. He ironically falls in love with an aristocrat’s daughter and discovers the dark scheme to colonize the country that he once ran away from.", "rate": 0, "genre": ["Drama"], "cast": ["Lee Byung-hun", "Kim Tae-ri", "Yoo Yeon-seok", "Byun Yo-han", "Kim Min-jung"], "character": ["Eugene Choi", "Go Ae-Shin", "Goo Dong-Mae", "Kim Hee-Sung", "Hee-Na"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 75820   Expand Mr. Sunshine   (2018) User Score Overview Based in Shinmiyangyo, or the U.S. expedition to Korea in the late 19th century, Mr. Sunshine tells the story of a Korean boy born into a family of a house servant running away to board an American warship, later to return to his homeland as a U.S. marine officer. He ironically falls in love with an aristocrat’s daughter and discovers the dark scheme to colonize the country that he once ran away from. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Byung-hun Eugene Choi Kim Tae-ri Go Ae-Shin Yoo Yeon-seok Goo Dong-Mae Byun Yo-han Kim Hee-Sung Kim Min-jung Hee-Na Full Cast & Crew Current Season Season 1 2018 | 2 Episodes Season 1 of Mr. Sunshine is set to premiere on July  7, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  3 Facts Original Name  미스터 션샤인 Status  Returning Series Networks Certification  - Type  Scripted Original Language  Korean Runtime  60m Homepage   http://program.tving.com/tvn/mrsunshine/ Genres Drama Keywords romance korea Content Score 86 Almost there... Top Contributors M 51 Maria180493 1 Chelsea  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}