{"link": "https://www.themoviedb.org/tv/245?language=en", "title": "The Brittas Empire", "resume": "The Brittas Empire is a British sitcom created and originally written by Andrew Norriss and Richard Fegen. Chris Barrie plays Gordon Brittas, the well-meaning but incompetent manager of Whitbury New Town Leisure Centre.\nThe show ran for seven series and 53 episodes — including two Christmas specials — from 1991 to 1997 on BBC1. Norriss and Fegen wrote the first five series, after which they left the show.\nThe Brittas Empire enjoyed a long and successful run throughout the 1990s, and gained itself large mainstream audiences. In 2004 the show came 47th on the BBC's Britain's Best Sitcom poll, and all series have been released on DVD.\nThe creators Andrew Norriss and Richard Fegen often combine farce with either surreal or dramatic elements in episodes. For example in the first series, the leisure centre prepares for a royal visit, only for the doors to seal, the boiler room to flood and a visitor to become electrocuted. Unlike the traditional sitcom, deaths were quite common in The Brittas Empire.", "rate": 73, "genre": ["Comedy"], "cast": ["Chris Barrie", "Michael Burns", "Julia St. John", "Pippa Haywood", "Tim Marriott"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 245   Expand The Brittas Empire   (1991) User Score Overview The Brittas Empire is a British sitcom created and originally written by Andrew Norriss and Richard Fegen. Chris Barrie plays Gordon Brittas, the well-meaning but incompetent manager of Whitbury New Town Leisure Centre. The show ran for seven series and 53 episodes — including two Christmas specials — from 1991 to 1997 on BBC1. Norriss and Fegen wrote the first five series, after which they left the show. The Brittas Empire enjoyed a long and successful run throughout the 1990s, and gained itself large mainstream audiences. In 2004 the show came 47th on the BBC's Britain's Best Sitcom poll, and all series have been released on DVD. The creators Andrew Norriss and Richard Fegen often combine farce with either surreal or dramatic elements in episodes. For example in the first series, the leisure centre prepares for a royal visit, only for the doors to seal, the boiler room to flood and a visitor to become electrocuted. Unlike the traditional sitcom, deaths were quite common in The Brittas Empire. Featured Crew Andrew Norriss Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Barrie Michael Burns Julia St. John Pippa Haywood Tim Marriott Full Cast & Crew Last Season Season 8 1997 | 6 Episodes Season 8 of The Brittas Empire premiered on July 18, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  2 Recommendations   1962-01-04 Steptoe and Son 8.2    1995-09-14 They Think It's All Over 7.3    1965-07-22 Till Death Us Do Part 7.2    1973-01-09 Whatever Happened to the Likely Lads? 7.8    1976-02-20 Open All Hours 7.7    1990-11-08 Harry Enfield's Television Programme 7.6    1977-04-12 Citizen Smith 7.6    1974-09-05 Porridge 8.3  Facts Status  Ended Network Certification PG Meaning PG stands for Parental Guidance. This means a film is suitable for general viewing, but some scenes may be unsuitable for young children. A PG film should not unsettle a child aged around eight or older. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/comedy/thebrittasempire/ Genres Comedy Keywords sitcom british humour workplace comedy Content Score 93 Almost there... Top Contributors O 7 Ozbourne 2 lineker H 2 HeadSwitch 1 rudely_murray  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}