{"link": "https://www.themoviedb.org/tv/1791?language=en", "title": "The Guardian", "resume": "Nick Fallin is a hotshot lawyer working at his father's ultrasuccessful Pittsburgh law firm. Unfortunately, the high life has gotten the best of Nick. Arrested for drug use, he's sentenced to do 1,500 hours of community service, somehow to be squeezed into his 24/7 cutthroat world of mergers, acquisitions and board meetings. Reluctantly, he's now The Guardian - a part-time child advocate at Legal Aid Services, where one case after another is an eye-opening instance of kids caught up in difficult circumstances.", "rate": 61, "genre": ["Drama"], "cast": ["Simon Baker", "Dabney Coleman", "Alan Rosenberg", "Raphael Sbarge", "Charles Malik Whitfield"], "character": ["Nick Fallin", "Burton Fallin", "Alvin Masterson", "Jake Straka", "James Mooney"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1791   Expand The Guardian   (2001) User Score  Play Trailer Overview Nick Fallin is a hotshot lawyer working at his father's ultrasuccessful Pittsburgh law firm. Unfortunately, the high life has gotten the best of Nick. Arrested for drug use, he's sentenced to do 1,500 hours of community service, somehow to be squeezed into his 24/7 cutthroat world of mergers, acquisitions and board meetings. Reluctantly, he's now The Guardian - a part-time child advocate at Legal Aid Services, where one case after another is an eye-opening instance of kids caught up in difficult circumstances. Featured Crew David Hollander Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  8 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Simon Baker Nick Fallin Dabney Coleman Burton Fallin Alan Rosenberg Alvin Masterson Raphael Sbarge Jake Straka Charles Malik Whitfield James Mooney Full Cast & Crew Last Season Season 3 2003 | 22 Episodes Season 3 of The Guardian premiered on September 23, 2003. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Nick Fallin: Happy Birthday Simon Baker! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  8 Posters  2 Recommendations   2007-09-26 Dirty Sexy Money 6.0    2013-01-02 Africa 8.2    1996-09-19 The Pretender 7.3    2015-07-31 Wet Hot American Summer: First Day of Camp 6.4    2007-09-26 Life 7.8    2010-09-23 An Idiot Abroad 7.8    2007-09-25 Reaper 7.0    2007-10-02 Pushing Daisies 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m, 45m, 44m Homepage  - Genres Drama Keywords parent child relationship community service lawyer recovering drug addict pittsburgh Content Score 100 Yes! Looking good! Top Contributors 13 Banana S 9 Shady12 6 lineker o 6 ormx  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}