{"link": "https://www.themoviedb.org/tv/72735?language=en", "title": "The Detail", "resume": "Three fiercely talented female homicide investigators who work tirelessly to solve crimes while navigating the complicated demands of their personal lives.", "rate": 80, "genre": ["Crime", "Drama"], "cast": ["Wendy Crewson", "Angela Griffin", "Shenae Grimes", "David Cubitt", "David Ferry"], "character": ["Staff Inspector Fiona Currie", "Detective Stevie Hall", "Detective Jacqueline Cooper", "Kyle Price", "Harry Barker"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 72735   Expand The Detail   (2018) User Score  Play Trailer Overview Three fiercely talented female homicide investigators who work tirelessly to solve crimes while navigating the complicated demands of their personal lives. Featured Crew Ilana Frank Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Wendy Crewson Staff Inspector Fiona Currie Angela Griffin Detective Stevie Hall Shenae Grimes Detective Jacqueline Cooper David Cubitt Kyle Price David Ferry Harry Barker Full Cast & Crew Current Season Season 1 2018 | 10 Episodes Season 1 of The Detail premiered on March 25, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Detail. You can help by rating TV shows you've seen. Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  40m Homepage   https://www.ctv.ca/The-Detail Genres Crime Drama Keywords canada crime female detective police procedural Content Score 100 Yes! Looking good! Top Contributors 25 United600 t 21 tmdb21435511 t 17 tmdb42368388 12 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}