{"link": "https://www.themoviedb.org/tv/59134?language=en", "title": "The Doctor Blake Mysteries", "resume": "Dr Lucien Blake left Ballarat as a young man. But now he finds himself returning to take over not only his dead father's medical practice, but also his on-call role as the town's police surgeon, only to find change is afoot, nothing is sacred, and no one is safe.", "rate": 76, "genre": ["Drama", "Mystery"], "cast": ["Craig McLachlan", "Nadine Garner", "Cate Wolfe", "Joel Tobeck"], "character": ["Doctor Lucien Blake", "Jean Beazley", "Mattie O'Brien", "Chief Supt Matthew Lawson"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 59134   Expand The Doctor Blake Mysteries   (2013) User Score Overview Dr Lucien Blake left Ballarat as a young man. But now he finds himself returning to take over not only his dead father's medical practice, but also his on-call role as the town's police surgeon, only to find change is afoot, nothing is sacred, and no one is safe. Featured Crew George Adams Creator Tony Wright Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Craig McLachlan Doctor Lucien Blake Nadine Garner Jean Beazley Cate Wolfe Mattie O'Brien Joel Tobeck Chief Supt Matthew Lawson Full Cast & Crew Last Season Series 5 2017 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2015-05-24 Tales by Light 7.8    2014-04-29 Happy Valley 7.7    2012-06-26 Line of Duty 8.0    2007-07-24 Damages 7.2    2008-01-24 Murdoch Mysteries 6.9    2011-10-25 Death in Paradise 7.6    2012-01-02 Endeavour 8.1    2015-03-08 Poldark 7.9  Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  54m Homepage   http://www.abc.net.au/tv/doctorblake/ Genres Drama Mystery Keywords period drama murder mystery 1950s general practitioner (gp) Content Score 93 Almost there... Top Contributors 83 Elizabeth Jennings z 4 zurman1 4 nazgul5 TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}