{"link": "https://www.themoviedb.org/tv/21631?language=en", "title": "Física o Química", "resume": "Física o Química was a Spanish television series made by Antena 3. The first episode premiered on 4 February 2008.\nBefore its televised broadcast, Física o Química was released on cell phones in Vodafone live! and on the official website of Antena 3. After the success of the first season, which ended on 31 March 2008, Antena 3 announced the filming of a new season which would feature more episodes and few cast changes. The second season premiered on 8 September 2008, with guest appearances by Michel Brown and María Casal, among others; it ended on 8 December 2008. The third season premiered on 13 April 2009 and included new characters portrayed by Óscar Sinela, Sandra Blázquez, Miriam Giovanelli, Adrián Rodríguez, Irene Sánchez and José Manuel Seda, and the entry of character actor Álex Barahona who had already appeared on the show, thus compensating for the departure of Michel Brown, Andrés Cheung, Karim El-Kerem and Xavi Mira. Antena 3 confirmed the filming of the fourth season with Adrián Rodríguez as a regular character and the return of Leonor Martín.\nFísica o Química started its seventh season with the departure of Nuria González, Úrsula Corberó, Angy Fernández and José Manuel Seda. Filming began on 28 February 2011. In May 2011 the series was cancelled due to a fall in viewing figures. On 1 June 2011, the death of a main character caused considerable outcry on the Antena 3 website.", "rate": 40, "genre": ["Drama", "Comedy"], "cast": ["Andrea Duro", "Javier Calvo", "Adam Jezierski", "Sandra Blázquez", "Ana Milán"], "character": ["Yolanda Freire", "Fer Redondo", "Gorka Martínez", "Alma Núñez", "Olimpia Díaz"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 21631   Expand Física o Química   (2008) User Score Overview Física o Química was a Spanish television series made by Antena 3. The first episode premiered on 4 February 2008. Before its televised broadcast, Física o Química was released on cell phones in Vodafone live! and on the official website of Antena 3. After the success of the first season, which ended on 31 March 2008, Antena 3 announced the filming of a new season which would feature more episodes and few cast changes. The second season premiered on 8 September 2008, with guest appearances by Michel Brown and María Casal, among others; it ended on 8 December 2008. The third season premiered on 13 April 2009 and included new characters portrayed by Óscar Sinela, Sandra Blázquez, Miriam Giovanelli, Adrián Rodríguez, Irene Sánchez and José Manuel Seda, and the entry of character actor Álex Barahona who had already appeared on the show, thus compensating for the departure of Michel Brown, Andrés Cheung, Karim El-Kerem and Xavi Mira. Antena 3 confirmed the filming of the fourth season with Adrián Rodríguez as a regular character and the return of Leonor Martín. Física o Química started its seventh season with the departure of Nuria González, Úrsula Corberó, Angy Fernández and José Manuel Seda. Filming began on 28 February 2011. In May 2011 the series was cancelled due to a fall in viewing figures. On 1 June 2011, the death of a main character caused considerable outcry on the Antena 3 website. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andrea Duro Yolanda Freire Javier Calvo Fer Redondo Adam Jezierski Gorka Martínez Sandra Blázquez Alma Núñez Ana Milán Olimpia Díaz Full Cast & Crew Last Season The physical chemistry season 6 2011 | 14 Episodes Season 6 of Física o Química premiered on September 25, 2011. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   2005-01-16 Aída 4.0    2013-04-10 MasterChef 7.3    1999-01-17 7 vidas 5.9    2014-06-09 Chiringuito de Pepe 6.5    2001-09-13 Cuéntame cómo pasó 6.6    1985-10-26 David the Gnome 7.3    2005-09-18 Camera Café 6.5    2007-04-22 La Que Se Avecina 6.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  80m Homepage   http://www.antena3.com/series/fisica-o-quimica/ Genres Drama Comedy Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 136 prm96 d 7 dtarda z 5 zurman1 s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}