{"link": "https://www.themoviedb.org/tv/18197?language=en", "title": "The Langoliers", "resume": "The Langoliers is a miniseries consisting of 2 episodes of 2 hours each. It was directed and written by Tom Holland and based on the novella by Stephen King. The series was produced by Mitchell Galin and David R. Kappes. The miniseries originally aired May 14–21, 1995 on the ABC network.", "rate": 61, "genre": ["Drama", "Sci-Fi", "Fantasy"], "cast": ["Dean Stockwell", "Patricia Wettig", "Kate Maberly", "David Morse", "Bronson Pinchot"], "character": ["Bob Jenkins", "Laurel Stevenson", "Dinah Catherine Bellman", "Captain Brian Engle", "Craig Toomey"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18197   Expand The Langoliers   (1995) User Score  Play Trailer Overview The Langoliers is a miniseries consisting of 2 episodes of 2 hours each. It was directed and written by Tom Holland and based on the novella by Stephen King. The series was produced by Mitchell Galin and David R. Kappes. The miniseries originally aired May 14–21, 1995 on the ABC network. Featured Crew Stephen King Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  18 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dean Stockwell Bob Jenkins Patricia Wettig Laurel Stevenson Kate Maberly Dinah Catherine Bellman David Morse Captain Brian Engle Bronson Pinchot Craig Toomey Full Cast & Crew Last Season Season 1 1995 | 3 Episodes Season 1 of The Langoliers premiered on May 14, 1995. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  4 Posters  18 Recommendations   1993-05-09 The Tommyknockers 5.1    1994-05-08 The Stand 6.8    1997-04-27 The Shining 6.0    1999-02-14 Storm of the Century 6.8    2002-01-27 Rose Red 6.6    1979-11-17 Salem's Lot 6.4    2004-06-20 Salem's Lot 5.5    1984-05-06 V: The Final Battle 7.3  Facts Status  Ended Networks - Certification 12 Meaning Not recommended for children under 12. Not allowed air before 10:00 p.m. Some channels and programs are subject to exception. Type  Miniseries Original Language  English Runtime  90m, 180m Homepage  - Genres Drama Sci-Fi & Fantasy Keywords suspense miniseries airplane trip telekenesis Content Score 100 Yes! Looking good! Top Contributors TB 93 TMDb Bot R 8 Rebecca w 3 webmaster t 3 timidenono  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}