{"link": "https://www.themoviedb.org/tv/70592?language=en", "title": "Re:Creators", "resume": "Humans have created many stories. Joy, sadness, anger, deep emotion. Stories shake our emotions, and fascinate us. However, these are only the thoughts of bystanders. But what if the characters in the story have \"intentions\"? To them, are we god-like existences for bringing their story into the world? Our world is changed. Mete out punishment upon the realm of the gods. In Re:CREATORS, everyone becomes a Creator.", "rate": 90, "genre": ["Action", "Adventure", "Animation", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Mikako Komatsu", "Maaya Sakamoto", "Sora Amamiya", "Daiki Yamashita"], "character": ["Yupitilia Celestia", "Chikujouin Makagami", "Kanoya Rui", "Mizushino Souta"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70592   Expand Re:Creators   (2017) User Score Overview Humans have created many stories. Joy, sadness, anger, deep emotion. Stories shake our emotions, and fascinate us. However, these are only the thoughts of bystanders. But what if the characters in the story have \"intentions\"? To them, are we god-like existences for bringing their story into the world? Our world is changed. Mete out punishment upon the realm of the gods. In Re:CREATORS, everyone becomes a Creator. Featured Crew Ei Aoki Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  2 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mikako Komatsu Yupitilia Celestia Maaya Sakamoto Chikujouin Makagami Sora Amamiya Kanoya Rui Daiki Yamashita Mizushino Souta Full Cast & Crew Last Season Season 1 2017 | 22 Episodes Season 1 of Re:Creators premiered on April  8, 2017. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply There are no discussions for Re:Creators. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Re:Creators. You can help by rating TV shows you've seen. Facts Original Name  Re:CREATORS Status  Returning Series Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://recreators.tv/ Genres Action & Adventure Animation Mystery Sci-Fi & Fantasy Keywords anime Content Score 100 Yes! Looking good! Top Contributors 19 TenmaWorks 18 sp1ti 14 Elizabeth Jennings 12 YareYareDaze2  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}