{"link": "https://www.themoviedb.org/tv/60605?language=en", "title": "Hinterland", "resume": "Tom Mathias comes to Aberystwyth having abandoned his life in London. He's a brilliant but troubled man. Despite his faults he is an excellent detective, who knows that the key to solving the crime lies not in where you look for truth, but how you look. From the windswept sand dunes of the coastline to the badlands of the hinterland, Y Gwyll is a series of four two-hour stories that are original and local, yet timeless and universal.", "rate": 75, "genre": ["Crime", "Drama", "Mystery"], "cast": ["Richard Harrington", "Mali Harries", "Alex Harries", "Hannah Daniel", "Aneirin Hughes"], "character": ["DCI Tom Mathias", "DI Mared Rhys", "DC Lloyd Elis", "DS Siân Owens", "Chief Superintendent Brian Prosser"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60605   Expand Hinterland   (2013) User Score  Play Trailer Overview Tom Mathias comes to Aberystwyth having abandoned his life in London. He's a brilliant but troubled man. Despite his faults he is an excellent detective, who knows that the key to solving the crime lies not in where you look for truth, but how you look. From the windswept sand dunes of the coastline to the badlands of the hinterland, Y Gwyll is a series of four two-hour stories that are original and local, yet timeless and universal. Featured Crew Ed Talfan Creator Ed Thomas Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  1 Images Backdrops  5 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Richard Harrington DCI Tom Mathias Mali Harries DI Mared Rhys Alex Harries DC Lloyd Elis Hannah Daniel DS Siân Owens Aneirin Hughes Chief Superintendent Brian Prosser Full Cast & Crew Last Season Season 3 2016 | 8 Episodes Season 3 of Hinterland premiered on October 28, 2016. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply F S3 US Premiere Open 0 by FormerlyKnownAs\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  5 Posters  3 Recommendations   2013-03-10 Shetland 7.5    2016-09-22 Paranoid 6.4    2011-06-05 Case Histories 8.2    2006-01-01 In Justice 6.8    2014-09-28 The Brokenwood Mysteries 7.6    2014-11-22 Witnesses 6.6    2015-05-05 No Offence 7.8    2011-01-13 Kidnap and Ransom 7.6  Facts Original Name  Y Gwyll Status  Returning Series Networks Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  Welsh Runtime  60m Homepage   https://www.s4c.co.uk/ygwyll/e_index.shtml Genres Crime Drama Mystery Keywords police welsh Content Score 100 Yes! Looking good! Top Contributors d 60 dariushuntly J 16 Jason 13 Elizabeth Jennings 8 efeka  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}