{"link": "https://www.themoviedb.org/tv/2181?language=en", "title": "Route 66", "resume": "Route 66 is an American TV series in which two young men traveled across America in a Chevrolet Corvette sports car. The show ran weekly on Fridays on CBS from October 7, 1960 to March 20, 1964. It starred Martin Milner as Tod Stiles and, for the first two and a half seasons, George Maharis as Buz Murdock. Maharis was ill for much of the third season, during which time Tod was shown traveling on his own. Tod met Lincoln Case, played by Glenn Corbett, late in the third season, and traveled with him until the end of the fourth and final season. The series currently airs on Me-TV, My Family TV and RTV.\nAmong the series more notable aspects were the featured Corvette convertible, and the program's instrumental theme song, which became a major pop hit.", "rate": 73, "genre": ["Drama"], "cast": ["Glenn Corbett", "Martin Milner"], "character": ["Linc Case", "Tod Stiles"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2181   Expand Route 66   (1960) User Score Overview Route 66 is an American TV series in which two young men traveled across America in a Chevrolet Corvette sports car. The show ran weekly on Fridays on CBS from October 7, 1960 to March 20, 1964. It starred Martin Milner as Tod Stiles and, for the first two and a half seasons, George Maharis as Buz Murdock. Maharis was ill for much of the third season, during which time Tod was shown traveling on his own. Tod met Lincoln Case, played by Glenn Corbett, late in the third season, and traveled with him until the end of the fourth and final season. The series currently airs on Me-TV, My Family TV and RTV. Among the series more notable aspects were the featured Corvette convertible, and the program's instrumental theme song, which became a major pop hit. Featured Crew Stirling Silliphant Creator Herbert B. Leonard Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Glenn Corbett Linc Case Martin Milner Tod Stiles Full Cast & Crew Last Season Season 4 1963 | 23 Episodes Season 4 of Route 66 premiered on September 27, 1963. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   1952-10-01 This Is Your Life 7.7    1961-10-02 Ben Casey 6.5    1969-09-11 Room 222 5.8    1955-10-03 Captain Kangaroo 6.4    1952-10-03 The Adventures of Ozzie and Harriet 5.6    1958-09-24 The Donna Reed Show 6.7    1990-06-28 Waiting for God 7.8    1965-09-16 The Dean Martin Show 4.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords route 66 road trip traveller Content Score 64 We're so close, yet so far. Top Contributors TM 12 Teófilo Moraes Guimarães 11 Banana 10 lineker R 8 Rebecca  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}