{"link": "https://www.themoviedb.org/tv/11720?language=en", "title": "Adventures in Paradise", "resume": "Adventures in Paradise is an American television series created by James Michener which ran on ABC from 1959 until 1962, starring Gardner McKay as Adam Troy, the captain of the schooner Tiki III, which sailed the South Pacific looking for passengers and adventure. USA Network aired reruns of this series between 1984 and 1988. The plots deal with the romantic and detective stories of Korean War veteran Troy. The supporting cast, varying from season to season, features George Tobias, Guy Stockwell, and Linda Lawson.", "rate": 77, "genre": ["Action", "Adventure", "Drama"], "cast": ["Gardner McKay", "George Tobias", "Guy Stockwell"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11720   Expand Adventures in Paradise   (1959) User Score Overview Adventures in Paradise is an American television series created by James Michener which ran on ABC from 1959 until 1962, starring Gardner McKay as Adam Troy, the captain of the schooner Tiki III, which sailed the South Pacific looking for passengers and adventure. USA Network aired reruns of this series between 1984 and 1988. The plots deal with the romantic and detective stories of Korean War veteran Troy. The supporting cast, varying from season to season, features George Tobias, Guy Stockwell, and Linda Lawson. Featured Crew James A. Michener Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  0 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Gardner McKay George Tobias Guy Stockwell Full Cast & Crew Last Season Season 3 1961 | 26 Episodes Season 3 of Adventures in Paradise premiered on October  1, 1961. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  0 Posters  1 Recommendations   1969-09-24 Medical Center 6.3    1964-09-24 Daniel Boone 5.9    1955-09-20 The Phil Silvers Show 7.7  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Action & Adventure Drama Keywords french polynesia charter sailor Content Score 50 Still needs a little work. Top Contributors PE 4 Patrick E. Abe 2 Zlogorek  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}