{"link": "https://www.themoviedb.org/tv/64607?language=en", "title": "Dark Net", "resume": "A documentary series that explores the furthest reaches of the internet and the people who frequent it, Dark Net provides a revealing and cautionary look inside a vast cyber netherworld rarely witnessed by most of us. Provocative, thought-provoking and frequently profound, each episode illuminates an exciting, ever-expanding frontier where people can do anything and see anything, whether they should or not.", "rate": 60, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64607   Expand Dark Net   (2016) User Score  Play Trailer Overview A documentary series that explores the furthest reaches of the internet and the people who frequent it, Dark Net provides a revealing and cautionary look inside a vast cyber netherworld rarely witnessed by most of us. Provocative, thought-provoking and frequently profound, each episode illuminates an exciting, ever-expanding frontier where people can do anything and see anything, whether they should or not. Featured Crew Mati Kochavi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 2 2017 | 8 Episodes Season 2 of Dark Net premiered on April  6, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  2 Recommendations   2016-11-29 Leah Remini: Scientology and the Aftermath 8.2    2016-03-16 Criminal Minds: Beyond Borders 5.7    2016-03-02 Hap and Leonard 7.3    2016-03-07 Damien 6.5    2016-07-17 Vice Principals 6.8    2017-02-05 24: Legacy 5.6    2017-01-06 Emerald City 6.2    2016-10-05 Frequency 7.3  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Documentary Original Language  English Runtime  30m Homepage   http://www.sho.com/sho/dark-net/home Genres Documentary Keywords computer internet internet culture Content Score 71 Just a little bit more... Top Contributors 37 Elizabeth Jennings a 4 arcaida R 3 Rabbit 3 yuvalg72  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}