{"link": "https://www.themoviedb.org/tv/1841?language=en", "title": "The Adventures of Sinbad", "resume": "The Adventures of Sinbad is a Canadian television series which aired from 1996 to 1998. It follows on the story from the pilot of the same name, and revolves around the series' protagonist, Sinbad. The series is a re-telling of the adventures of Sinbad from The Arabian Nights.", "rate": 72, "genre": ["Action", "Adventure", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Zen Gesner", "George Buza", "Tim Progosh", "Oris Erhuero", "Mariah Shirley"], "character": ["Sinbad", "Doubar", "Firouz", "Rongar", "Bryn"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1841   Expand The Adventures of Sinbad   (1996) User Score  Play Trailer Overview The Adventures of Sinbad is a Canadian television series which aired from 1996 to 1998. It follows on the story from the pilot of the same name, and revolves around the series' protagonist, Sinbad. The series is a re-telling of the adventures of Sinbad from The Arabian Nights. Featured Crew Ed Naha Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  1 Top Billed Cast Zen Gesner Sinbad George Buza Doubar Tim Progosh Firouz Oris Erhuero Rongar Mariah Shirley Bryn Full Cast & Crew Last Season Season 2 1997 | 22 Episodes Season 2 of The Adventures of Sinbad premiered on October  4, 1997. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  3 Backdrops  3 Posters  3 Recommendations   2011-09-28 Suburgatory 6.8    2012-04-11 Don't Trust the B---- in Apartment 23 6.7    1963-11-23 Doctor Who 7.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Action & Adventure Drama Sci-Fi & Fantasy Keywords ship magic arabian sword fight sinbad swashbuckler based on myths or folklore sword and sorcery voyages Content Score 100 Yes! Looking good! Top Contributors L 73 Law 5 d00ziie 4 Banana TB 3 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}