{"link": "https://www.themoviedb.org/tv/69337?language=en", "title": "Love & Life & Lie", "resume": "Liu Xin Tong is a positive girl, living in a poor household. There was nothing out of the ordinary until she got into an accident that moved her and her mother into a rich businessman's house. There, she meets Li Yao Nan, her fated love along with two siblings that play important roles in her new life. She is met with multiple obstacles that she must overcome to ultimately keep her lover and friends, in addition to finding out the real truth about her birth.", "rate": 48, "genre": ["Drama"], "cast": ["Chen Xiao", "Zhou Dongyu", "Ye Qing", "Leanne Liu", "Ian Wang"], "character": ["Li Yao Nan", "Liu Xin Tong", "Ji Zhi Zhen", "Xu Feng Ming", "Pei Jia Qi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69337   Expand Love & Life & Lie   (2017) User Score Overview Liu Xin Tong is a positive girl, living in a poor household. There was nothing out of the ordinary until she got into an accident that moved her and her mother into a rich businessman's house. There, she meets Li Yao Nan, her fated love along with two siblings that play important roles in her new life. She is met with multiple obstacles that she must overcome to ultimately keep her lover and friends, in addition to finding out the real truth about her birth. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chen Xiao Li Yao Nan Zhou Dongyu Liu Xin Tong Ye Qing Ji Zhi Zhen Leanne Liu Xu Feng Ming Ian Wang Pei Jia Qi Full Cast & Crew Last Season Season 1 2017 | 41 Episodes Season 1 of Love & Life & Lie premiered on January  4, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on Love & Life & Lie. You can help by rating TV shows you've seen. Facts Original Name  遇见爱情的利先生 Status  Ended Network Zhejiang Television Certification  - Type  Scripted Original Language  Chinese Runtime  45m Homepage  - Genres Drama Keywords china romance Content Score 86 Almost there... Top Contributors M 31 Maria180493 3 galactica_j  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}