{"link": "https://www.themoviedb.org/tv/896?language=en", "title": "The Lost World", "resume": "Early 20th-century adventurers find themselves fighting for survival after their hot-air balloon crashes into a remote part of the Amazon, stranding them on a prehistoric plateau.", "rate": 74, "genre": ["Action", "Adventure", "Sci-Fi", "Fantasy"], "cast": ["Jennifer O'Dell", "Michael Sinelnikoff", "Rachel Blakely", "David Orth", "Peter McCauley"], "character": ["Veronica Layton", "Professor Arthur Summerlee", "Marguerite Krux", "Edward \"Ned\" T. Malone", "Professor George Edward Challenger"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 896   Expand The Lost World   (1999) User Score  Play Trailer Overview Early 20th-century adventurers find themselves fighting for survival after their hot-air balloon crashes into a remote part of the Amazon, stranding them on a prehistoric plateau. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer O'Dell Veronica Layton Michael Sinelnikoff Professor Arthur Summerlee Rachel Blakely Marguerite Krux David Orth Edward \"Ned\" T. Malone Peter McCauley Professor George Edward Challenger Full Cast & Crew Last Season Season 3 2001 | 22 Episodes Season 3 of The Lost World premiered on October 20, 2001. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1986-09-19 Starman 6.4    1989-09-19 Doogie Howser, M.D. 5.7    1999-09-25 Relic Hunter 6.4    1995-01-09 Spellbinder 8.2    1986-03-25 Perfect Strangers 6.6    1993-01-27 Kung Fu: The Legend Continues 5.5    2002-09-20 What I Like About You 5.3    1997-10-06 Earth: Final Conflict 6.8  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   https://web.archive.org/web/20020811083849fw_/http://www.lostworldtv.net:80/home.html Genres Action & Adventure Sci-Fi & Fantasy Keywords based on novel or book expedition exploration stranded dinosaur lost world uncharted Content Score 93 Almost there... Top Contributors I 20 ILiviu z 15 zazaza131233 d 11 denis j 7 joachimgr  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}