{"link": "https://www.themoviedb.org/tv/67070?language=en", "title": "Fleabag", "resume": "As she hurls herself headlong at modern living, Fleabag is thrown  roughly up against the walls of contemporary London, sleeping with  anyone who dares to stand too close, squeezing money from wherever she  can, rejecting anyone who tries to help her, and keeping up her bravado  throughout.", "rate": 72, "genre": ["Comedy"], "cast": ["Phoebe Waller-Bridge", "Jenny Rainsford", "Olivia Colman", "Hugh Skinner", "Sian Clifford"], "character": ["Fleabag", "Boo", "Godmother", "Harry", "Claire"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67070   Expand Fleabag   (2016) User Score  Play Trailer Overview As she hurls herself headlong at modern living, Fleabag is thrown  roughly up against the walls of contemporary London, sleeping with  anyone who dares to stand too close, squeezing money from wherever she  can, rejecting anyone who tries to help her, and keeping up her bravado  throughout. Featured Crew Phoebe Waller-Bridge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  3 Images Backdrops  3 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Phoebe Waller-Bridge Fleabag Jenny Rainsford Boo Olivia Colman Godmother Hugh Skinner Harry Sian Clifford Claire Full Cast & Crew Last Season Season 1 2016 | 6 Episodes Season 1 of Fleabag premiered on July 21, 2016. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply Incredible Open 3 by  dawna3 Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  3 Recommendations   2014-01-13 Uncle 7.3    2013-02-04 Seed 6.3    2010-06-28 Huge 5.5    2011-10-17 Threesome 6.3    2016-10-19 HIM 6.2    2016-03-22 The A Word 7.5    2015-01-19 Catastrophe 7.3    2016-03-01 Loosely Exactly Nicole 5.8  Facts Status  Returning Series Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/p040tlqx Genres Comedy Keywords london england sexuality grief sitcom british humour Content Score 100 Yes! Looking good! Top Contributors 28 Elizabeth Jennings 24 EveDemocracy z 10 zurman1 7 felectronika  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}