{"link": "https://www.themoviedb.org/tv/3437?language=en", "title": "Hotel", "resume": "Hotel is an American prime time drama series which aired on ABC from September 21, 1983 to May 5, 1988 in the timeslot following Dynasty.\nBased on Arthur Hailey's 1965 novel of the same name, the series was produced by Aaron Spelling and set in the elegant and fictitious St. Gregory Hotel in San Francisco. Establishing shots of the hotel were filmed in front of The Fairmont San Francisco atop the Nob Hill neighborhood. Episodes followed the activities of passing guests, as well as the personal and professional lives of the hotel staff.", "rate": 75, "genre": ["Drama"], "cast": ["James Brolin", "Connie Sellecca", "Nathan Cook", "Shari Belafonte", "Michael Spound"], "character": ["Peter McDermott", "Christine Francis", "Billy Griffin", "Julie Gillette", "Dave Kendall"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3437   Expand Hotel   (1983) User Score Overview Hotel is an American prime time drama series which aired on ABC from September 21, 1983 to May 5, 1988 in the timeslot following Dynasty. Based on Arthur Hailey's 1965 novel of the same name, the series was produced by Aaron Spelling and set in the elegant and fictitious St. Gregory Hotel in San Francisco. Establishing shots of the hotel were filmed in front of The Fairmont San Francisco atop the Nob Hill neighborhood. Episodes followed the activities of passing guests, as well as the personal and professional lives of the hotel staff. Featured Crew Aaron Spelling Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  1 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Brolin Peter McDermott Connie Sellecca Christine Francis Nathan Cook Billy Griffin Shari Belafonte Julie Gillette Michael Spound Dave Kendall Full Cast & Crew Last Season Season 5 1987 | 16 Episodes Season 5 of Hotel premiered on October  3, 1987. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply w Peter McDermott: Happy Birthday James Brolin! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  1 Recommendations   1954-10-15 The Adventures of Rin Tin Tin 6.5    1974-09-11 Petrocelli 7.8    1957-10-10 Zorro 8.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage  - Genres Drama Keywords hotel based on novel or book san francisco Content Score 93 Almost there... Top Contributors 14 Banana 4 lineker 3 Zlogorek w 2 wonder2wonder  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}