{"link": "https://www.themoviedb.org/tv/76954?language=en", "title": "The Mechanism", "resume": "A scandal erupts in Brazil during an investigation of alleged government corruption via oil and construction companies. Loosely inspired by true events.", "rate": 77, "genre": ["Crime", "Drama"], "cast": ["Selton Mello", "Caroline Abras", "Alessandra Colasanti", "Jonathan Haagensen", "Otto Jr."], "character": ["Marco Ruffo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 76954   Expand The Mechanism   (2018) User Score  Play Trailer Overview A scandal erupts in Brazil during an investigation of alleged government corruption via oil and construction companies. Loosely inspired by true events. Featured Crew José Padilha Creator Elena Soares Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Selton Mello Marco Ruffo Caroline Abras Alessandra Colasanti Jonathan Haagensen Otto Jr. Full Cast & Crew Current Season Season 1 2018 | 8 Episodes Season 1 of The Mechanism premiered on March 23, 2018. View All Seasons Social Reviews  1 Discussions  0 A review by Baz  6.0 Written by  Baz  on April 20, 2018 The Mechanism as a series over 8 episodes is probably just enough of the series and hopefully that’s where it ends. Look there’s some great true based threads from Brasil and the corruption. However, the little intricacies that were really unrealistic were the jail scenes where the entire syndicate were detained in a most unlikely jail setup. Reminded me of the jail cells in a an western film. Male and female prisoners in the same jail row.  It was pretty captivating for the first 5 episodes then I found it a bit tedious and repetitive. Although it was refreshing to see a series tha...  read the rest. Read All Reviews Media Most Popular Videos  1 Backdrops  4 Posters  4 Recommendations   2018-02-02 Requiem 6.4    2017-05-02 Money Heist 8.1    2017-07-21 Ozark 8.0    2017-12-01 Dark 7.9    1987-04-05 Married... with Children 7.4  Facts Original Name  O Mecanismo Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Portuguese Runtime  60m Homepage   https://www.netflix.com/title/80120485 Genres Crime Drama Keywords No keywords have been added. Content Score 100 Yes! Looking good! Top Contributors 29 pauloguerra 14 Elizabeth Jennings W 7 Wallyson 5 Lewis  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}