{"link": "https://www.themoviedb.org/tv/61930?language=en", "title": "Cute High Earth Defense Club LOVE!", "resume": "The Earth Defense Club at Binan High School are a group of boys that do nothing, but be lazy. One day when two of the club members, Atsushi and En, are taking a bath in a bathhouse, a talking pink Wombat appears out of nowhere and requests the two boys to help save the Earth with the power of love. Unfortunately, the bathhouse owner's son, Yumoto sees the wombat and chases after it while saying \"Let me fluff you up!\". The next day, the two boys and the other two club members, Io and Ryu are met with the pink wombat and suddenly, bracelets appears and clasp onto each of the four members' wrists, as well as Yumoto (who just happened to be nearby) and they are transformed into the Battle Lovers.", "rate": 80, "genre": ["Comedy", "Animation"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61930   Expand Cute High Earth Defense Club LOVE!   (2015) User Score Overview The Earth Defense Club at Binan High School are a group of boys that do nothing, but be lazy. One day when two of the club members, Atsushi and En, are taking a bath in a bathhouse, a talking pink Wombat appears out of nowhere and requests the two boys to help save the Earth with the power of love. Unfortunately, the bathhouse owner's son, Yumoto sees the wombat and chases after it while saying \"Let me fluff you up!\". The next day, the two boys and the other two club members, Io and Ryu are met with the pink wombat and suddenly, bracelets appears and clasp onto each of the four members' wrists, as well as Yumoto (who just happened to be nearby) and they are transformed into the Battle Lovers. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Current Season Season 3 2018 | 12 Episodes Season 3 of Cute High Earth Defense Club LOVE! premiered on April  9, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Cute High Earth Defense Club LOVE!. You can help by rating TV shows you've seen. Facts Original Name  美男高校地球防衛部LOVE! Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  25m Homepage  - Genres Comedy Animation Keywords parody anime Content Score 56 We're so close, yet so far. Top Contributors 18 Elizabeth Jennings 13 sp1ti S 7 Streed 7 Iuri3D  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}