{"link": "https://www.themoviedb.org/tv/10867?language=en", "title": "The Wonder Pets", "resume": "Wonder Pets! is an American animated children's television series. It debuted on March 3, 2006, on the Nick Jr. block of the Nickelodeon cable television network and Noggin on the same day. It won an Emmy Award in 2008 for Outstanding Achievement in Music Direction and Composition in the United States.", "rate": 63, "genre": ["Animation", "Kids"], "cast": ["Sofie Zamchick", "Teala Dunn", "Cooper Corrao", "Danica Lee", "Steven Tyler"], "character": ["Linny The Guinea Pig", "Tuck the Turtle", "Ollie the Bunny", "Ming-Ming Duckling", "The Mad Hatter"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10867   Expand The Wonder Pets   (2006) User Score Overview Wonder Pets! is an American animated children's television series. It debuted on March 3, 2006, on the Nick Jr. block of the Nickelodeon cable television network and Noggin on the same day. It won an Emmy Award in 2008 for Outstanding Achievement in Music Direction and Composition in the United States. Featured Crew Josh Selig Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Sofie Zamchick Linny The Guinea Pig Teala Dunn Tuck the Turtle Cooper Corrao Ollie the Bunny Danica Lee Ming-Ming Duckling Steven Tyler The Mad Hatter Full Cast & Crew Last Season Wonder pets season 3 2008 | 16 Episodes Season 3 of The Wonder Pets premiered on September  8, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2005-09-06 Go, Diego, Go! 4.6    2004-05-31 Peppa Pig 5.3    2000-08-13 Dora the Explorer 4.2  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage   http://www.2kgames.com/2kplay/wonderpets/index.html Genres Animation Kids Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 3 joshzam s 2 speedycars l 2 lucybenson  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}