{"link": "https://www.themoviedb.org/tv/2428?language=en", "title": "Taggart", "resume": "Taggart is a Scottish detective television programme, created by Glenn Chandler, who has written many of the episodes, and made by STV Productions for the ITV network. The series revolves around a group of detectives initially in the Maryhill CID of Strathclyde Police, though various storylines have happened in other parts of the Greater Glasgow area, and as of the most recent series the team have operated out of the fictional John Street police station across the street from the City Chambers. It is one of the UK's longest-running dramas and is the longest-running police drama after the cancellation of The Bill.\nThe show's 100th story aired on Christmas Eve 2009 on the ITV network. In May 2011, it was reported that the ITV network had decided to axe Taggart from the network after 28 years. The series may continue to be screened in Scotland on the STV network and on overseas broadcasters.", "rate": 77, "genre": ["Action", "Adventure", "Drama"], "cast": ["Mark McManus", "Harriet Buchan", "Tom Watson"], "character": ["DCI Jim Taggart", "Jean Taggart", "Superintendent Murray"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2428   Expand Taggart   (1983) User Score Overview Taggart is a Scottish detective television programme, created by Glenn Chandler, who has written many of the episodes, and made by STV Productions for the ITV network. The series revolves around a group of detectives initially in the Maryhill CID of Strathclyde Police, though various storylines have happened in other parts of the Greater Glasgow area, and as of the most recent series the team have operated out of the fictional John Street police station across the street from the City Chambers. It is one of the UK's longest-running dramas and is the longest-running police drama after the cancellation of The Bill. The show's 100th story aired on Christmas Eve 2009 on the ITV network. In May 2011, it was reported that the ITV network had decided to axe Taggart from the network after 28 years. The series may continue to be screened in Scotland on the STV network and on overseas broadcasters. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  5 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Mark McManus DCI Jim Taggart Harriet Buchan Jean Taggart Tom Watson Superintendent Murray Full Cast & Crew Last Season Season 27 2010 | 9 Episodes Season 27 of Taggart premiered on October  3, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  2 Recommendations   James Dean 6.5    1990-09-27 Rab C. Nesbitt 7.1    1981-10-18 Bergerac 7.5    1991-06-10 Soldier Soldier 6.5    1993-09-27 Cracker 8.5    2003-08-31 Rosemary & Thyme 7.0    1992-12-06 A Touch of Frost 7.9    1997-05-04 Invasion 0.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  90m, 60m Homepage  - Genres Action & Adventure Drama Keywords police scotland police detective Content Score 56 We're so close, yet so far. Top Contributors m 132 miro22 18 Banana 9 actors s 3 speedycars  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}