{"link": "https://www.themoviedb.org/tv/19997?language=en", "title": "The Andromeda Strain", "resume": "A U.S. satellite crash-lands near a small town in Utah, unleashing a deadly plague that kills virtually everyone except two survivors, who may provide clues to immunizing the population. As the military attempts to quarantine the area, a team of highly specialized scientists is assembled to find a cure and stop the spread of the alien pathogen, code-named Andromeda.", "rate": 63, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Benjamin Bratt", "Christa Miller", "Eric McCormack", "Daniel Dae Kim", "Viola Davis"], "character": ["Dr. Jeremy Stone", "Dr. Angela Noyce", "Jack Nash", "Dr. Tsi Chou", "Dr. Charlene Barton"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 19997   Expand The Andromeda Strain   (2008) User Score  Play Trailer Overview A U.S. satellite crash-lands near a small town in Utah, unleashing a deadly plague that kills virtually everyone except two survivors, who may provide clues to immunizing the population. As the military attempts to quarantine the area, a team of highly specialized scientists is assembled to find a cure and stop the spread of the alien pathogen, code-named Andromeda. Featured Crew Robert Schenkkan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  19 Posters  16 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Benjamin Bratt Dr. Jeremy Stone Christa Miller Dr. Angela Noyce Eric McCormack Jack Nash Daniel Dae Kim Dr. Tsi Chou Viola Davis Dr. Charlene Barton Full Cast & Crew Last Season Season 1 2008 | 2 Episodes Season 1 of The Andromeda Strain premiered on May 26, 2008. View All Seasons Social Reviews  1 Discussions  0 A review by Andres Gomez  4.0 Written by  Andres Gomez  on August  2, 2015 The cast is quite decent and, with exceptions of some moments in which the horrible script ruins their performance, they do a good job. The problem is that the story is bad and expectable and the FX horrible. Read All Reviews Media Most Popular Videos  1 Backdrops  19 Posters  16 Recommendations   2006-12-11 The Lost Room 7.7    2009-12-28 The Day of the Triffids 5.6    2004-10-24 ReGenesis 7.0    1987-01-20 Unsolved Mysteries 7.4    2005-12-05 The Triangle 6.1    2000-12-03 Frank Herbert's Dune 6.7    1981-09-10 The Day of the Triffids 6.7    2009-07-12 Meteor 5.0  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  120m Homepage  - Genres Sci-Fi & Fantasy Keywords extraterrestrial miniseries disease scientist Content Score 100 Yes! Looking good! Top Contributors TB 184 TMDb Bot VA 19 Viktor Andersson k 9 ktoswang 7 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}