{"link": "https://www.themoviedb.org/tv/64518?language=en", "title": "Gåsmamman", "resume": "Sonja (Alexandra Rapaport) lives a rather carefree life with her beloved family. The husband Frederick's marijuana business providing family finances a silver lining. But life is shattered and Sonja forced to play a dangerous game with both organized crime and police to protect their children. She can no longer be sure which ones are her friends and who she can trust.", "rate": 70, "genre": [], "cast": ["Alexandra Rapaport", "Magnus Roosmann", "Clara Christiansson", "Edvin Ryding", "Joel Lützow"], "character": ["Sonja Ek", "Fredrik Ek", "Nina Ek", "Linus Ek", "Gustav Ek"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64518   Expand Gåsmamman   (2015) User Score Overview Sonja (Alexandra Rapaport) lives a rather carefree life with her beloved family. The husband Frederick's marijuana business providing family finances a silver lining. But life is shattered and Sonja forced to play a dangerous game with both organized crime and police to protect their children. She can no longer be sure which ones are her friends and who she can trust. Featured Crew Richard Holm Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexandra Rapaport Sonja Ek Magnus Roosmann Fredrik Ek Clara Christiansson Nina Ek Edvin Ryding Linus Ek Joel Lützow Gustav Ek Full Cast & Crew Last Season Season 3 2017 | 8 Episodes Season 3 of Gåsmamman premiered on September 28, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  5 Recommendations We don't have enough data to suggest any TV shows based on Gåsmamman. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  Swedish Runtime  45m Homepage   http://www.cmore.se/serie/72596-gasmamman Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 38 Bendik 14 Zejho VA 10 Viktor Andersson t 7 thermo6  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}