{"link": "https://www.themoviedb.org/tv/70637?language=en", "title": "Akashic Records of Bastard Magic Instructor", "resume": "The Alzano Imperial Magic Academy is located in the southern part of the Alzano Empire and is among most prominent magic schools in the world, where students can learn the highest forms of magic. All those who strive to learn magic dream of studying at this academy, and its students as well as its teachers are proud to be a part of its 400-year history. Glenn Radars is a new instructor who has suddenly been appointed to teach part-time at this highly respected academy. The previously unheard-of lessons of this man known as a good-for-nothing bastard are about to begin.", "rate": 90, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Souma Saitou", "Akane Fujita", "Yume Miyamoto", "Ari Ozawa"], "character": ["Glenn Radars", "Sistine Fibel", "Rumia Tingel", "Re=L Rayford"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 70637   Expand Akashic Records of Bastard Magic Instructor   (2017) User Score Overview The Alzano Imperial Magic Academy is located in the southern part of the Alzano Empire and is among most prominent magic schools in the world, where students can learn the highest forms of magic. All those who strive to learn magic dream of studying at this academy, and its students as well as its teachers are proud to be a part of its 400-year history. Glenn Radars is a new instructor who has suddenly been appointed to teach part-time at this highly respected academy. The previously unheard-of lessons of this man known as a good-for-nothing bastard are about to begin. Featured Crew Minato Kazuto Creator Touko Machida Creator Tarou Hitsuji Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Souma Saitou Glenn Radars Akane Fujita Sistine Fibel Yume Miyamoto Rumia Tingel Ari Ozawa Re=L Rayford Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Akashic Records of Bastard Magic Instructor premiered on April  4, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Akashic Records of Bastard Magic Instructor. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   2017-07-12 My First Girlfriend is a Gal 7.4    2017-04-01 The Silver Guardian 6.4    2017-04-04 The Royal Tutor 7.7    2017-07-04 Tsuredure Children 8.0    2016-07-10 Tales of Zestiria the X 7.7    2017-04-12 Kenka Banchou Otome: Girl Beats Boys 6.6    2017-04-06 Clockwork Planet 6.1    2016-01-09 Luck & Logic 7.0  Facts Original Name  ロクでなし魔術講師と禁忌教典 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://rokuaka.jp/ Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords based on light novel anime Content Score 100 Yes! Looking good! Top Contributors 25 Despair-Paradise 24 sp1ti 19 Marr 🇳🇱 t 7 tmdb29261405  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}