{"link": "https://www.themoviedb.org/tv/61781?language=en", "title": "Pointless Celebrities", "resume": "Alexander Armstrong and Richard Osman present a celebrity version of the general knowledge quiz in which contestants try to come up with the answers that nobody else could think of.", "rate": 75, "genre": ["Talk"], "cast": ["Alexander Armstrong", "Richard Osman"], "character": ["Himself - Host", "Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61781   Expand Pointless Celebrities   (2011) User Score Overview Alexander Armstrong and Richard Osman present a celebrity version of the general knowledge quiz in which contestants try to come up with the answers that nobody else could think of. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alexander Armstrong Himself - Host Richard Osman Himself - Host Full Cast & Crew Last Season Season 9 2016 | 2 Episodes Season 9 of Pointless Celebrities premiered on January  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   1981-12-24 The Kenny Everett Television Show 7.0    Match of the Day 2 5.3    1981-02-26 Hi-de-Hi! 7.3    1987-09-26 ChuckleVision 6.3  Facts Status  Returning Series Network Certification  - Type  Talk Show Original Language  English Runtime  50m Homepage   http://www.bbc.co.uk/programmes/b01d09p5 Genres Talk Keywords quiz show Content Score 56 We're so close, yet so far. Top Contributors 25 Elizabeth Jennings 12 Damien Haynes R 4 Rebecca PS 2 P. Snoopy  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}