{"link": "https://www.themoviedb.org/tv/80389?language=en", "title": "Your House Helper", "resume": "Kim Ji-Woon was born to a lawmaker father and doctor mother. He then went on to work at a big company, but he quit his job and stopped talking to his parents. Kim Ji-Woon meets a woman and begins to work as a housekeeper at her home. While doing his job, he listens to his customer's worries and gives advice to help them solve their problems.", "rate": 0, "genre": ["Comedy"], "cast": ["Ha Seok-jin", "Bona", "Lee Ji-hoon", "Ko Won-hee", "Jeon Soo-jin"], "character": ["Kim Ji-Woon", "Im Da-Young", "Kwon Jin-Kook", "Yoon Sang-A", "Kang Hye-Joo"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 80389   Expand Your House Helper   (2018) User Score Overview Kim Ji-Woon was born to a lawmaker father and doctor mother. He then went on to work at a big company, but he quit his job and stopped talking to his parents. Kim Ji-Woon meets a woman and begins to work as a housekeeper at her home. While doing his job, he listens to his customer's worries and gives advice to help them solve their problems. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ha Seok-jin Kim Ji-Woon Bona Im Da-Young Lee Ji-hoon Kwon Jin-Kook Ko Won-hee Yoon Sang-A Jeon Soo-jin Kang Hye-Joo Full Cast & Crew Current Season Season 1 2018 | 0 Episodes Season 1 of Your House Helper is set to premiere on July  4, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Facts Original Name  당신의 하우스헬퍼 Status  Returning Series Network Certification  - Type  Scripted Original Language  Korean Runtime  - Homepage   http://www.kbs.co.kr/drama/yourhousehelper/ Genres Comedy Keywords romance Content Score 86 Almost there... Top Contributors M 41 Maria180493 1 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}