{"link": "https://www.themoviedb.org/tv/63869?language=en", "title": "Sea of Plastic", "resume": "Mar de plástico (Spanish: Sea of Plastic) is a Spanish crime drama television series produced by Boomerang TV for Atresmedia. It airs on Atresmedia's main channel Antena 3. The series focuses on the investigation of a murder in the fictional town of Campoamargo, set in an area of the province of Almería known as the \"sea of plastic\" due to the numerous greenhouses that cover it, and the interracial conflicts that arise in the greenhouses. The pilot episode aired on 22 September 2015 on simulcast in Antena 3, Neox, Nova and Mega.", "rate": 68, "genre": ["Crime", "Mystery"], "cast": ["Rodolfo Sancho", "Miquel Fernández", "Luís Fernández", "Nya de la Rubia", "Patrick Criado"], "character": ["Héctor", "Pablo", "Salva", "Lola", "Fernando Rueda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 63869   Expand Sea of Plastic   (2015) User Score Overview Mar de plástico (Spanish: Sea of Plastic) is a Spanish crime drama television series produced by Boomerang TV for Atresmedia. It airs on Atresmedia's main channel Antena 3. The series focuses on the investigation of a murder in the fictional town of Campoamargo, set in an area of the province of Almería known as the \"sea of plastic\" due to the numerous greenhouses that cover it, and the interracial conflicts that arise in the greenhouses. The pilot episode aired on 22 September 2015 on simulcast in Antena 3, Neox, Nova and Mega. Featured Crew Juan Carlos Cueto Creator Rocio Martínez Llano Creator Alberto Manzano Creator Pablo Tebar Alberto Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rodolfo Sancho Héctor Miquel Fernández Pablo Luís Fernández Salva Nya de la Rubia Lola Patrick Criado Fernando Rueda Full Cast & Crew Last Season Season 2 2016 | 14 Episodes Season 2 of Sea of Plastic premiered on September 12, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on Sea of Plastic. You can help by rating TV shows you've seen. Facts Original Name  Mar de plástico Status  Returning Series Network Certification  - Type  Scripted Original Language  Spanish; Castilian Runtime  87m Homepage   http://www.antena3.com/series/mar-de-plastico/ Genres Crime Mystery Keywords police village life village thriller small village Content Score 93 Almost there... Top Contributors 53 prm96 a 38 aballester M 13 Megacine 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}