{"link": "https://www.themoviedb.org/tv/9026?language=en", "title": "The Triangle", "resume": "The Triangle is a three-part US-British-German science fiction miniseries concerning the Bermuda Triangle, which first aired on Sci-Fi Channel in the US December 5 – December 7, 2005. It was written by Dean Devlin, Bryan Singer and Rockne S. O'Bannon, directed by Craig R. Baxley, and produced by special effects experts Volker Engel and Marc Weigert, together with Kelly Van Horn, for Devlin's and Singer's production companies Electric Entertainment and Bad Hat Harry Productions, the BBC, and Engel's and Weigert's production company Uncharted Territory.", "rate": 61, "genre": ["Sci-Fi", "Fantasy"], "cast": ["Eric Stoltz", "Catherine Bell", "Bruce Davison", "Lou Diamond Phillips", "Michael E. Rodgers"], "character": ["Howard Thomas", "Emily Patterson", "Stan Lathem", "Meeno Paloma", "Bruce Geller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 9026   Expand The Triangle   (2005) User Score  Play Trailer Overview The Triangle is a three-part US-British-German science fiction miniseries concerning the Bermuda Triangle, which first aired on Sci-Fi Channel in the US December 5 – December 7, 2005. It was written by Dean Devlin, Bryan Singer and Rockne S. O'Bannon, directed by Craig R. Baxley, and produced by special effects experts Volker Engel and Marc Weigert, together with Kelly Van Horn, for Devlin's and Singer's production companies Electric Entertainment and Bad Hat Harry Productions, the BBC, and Engel's and Weigert's production company Uncharted Territory. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  9 Posters  9 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Eric Stoltz Howard Thomas Catherine Bell Emily Patterson Bruce Davison Stan Lathem Lou Diamond Phillips Meeno Paloma Michael E. Rodgers Bruce Geller Full Cast & Crew Last Season Season 1 2005 | 3 Episodes Season 1 of The Triangle premiered on December  5, 2005. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply There are no discussions for The Triangle. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  9 Posters  9 Recommendations   2004-10-24 ReGenesis 7.0    2010-07-12 The Silence 6.8    2004-07-19 The Grid 7.0    2005-12-04 Sleeper Cell 7.4    2011-02-07 Outcasts 6.2    2012-08-30 Good Cop 6.6    2006-01-01 In Justice 6.8    1998-09-09 First Wave 6.6  Facts Status  Ended Network Certification  - Type  Miniseries Original Language  English Runtime  90m Homepage  - Genres Sci-Fi & Fantasy Keywords experiment bermuda triangle disappearance miniseries strange event Content Score 93 Almost there... Top Contributors TB 77 TMDb Bot 15 Elizabeth Jennings 14 Banana DK 13 Dapper Kraken  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}