{"link": "https://www.themoviedb.org/tv/18538?language=en", "title": "Suspense", "resume": "Suspense is an American television anthology series that ran on CBS Television from 1949 to 1954. It was adapted from the radio program of the same name which ran from 1942 to 1962. Like many early television programs, the show was broadcast live from New York City. It was sponsored by the Auto-Lite corporation, and each episode was introduced by host Rex Marshall, who promoted Auto-Lite spark plugs, car batteries, headlights, and other car parts.\nSome of the early scripts were adapted from Suspense radio scripts, while others were original for television. Like the radio program, many scripts were adaptations of literary classics by well-known authors. Classic authors such as Edgar Allan Poe, Agatha Christie, and Charles Dickens all had stories adapted for the series, while contemporary authors such as Roald Dahl and Gore Vidal also contributed. Many notable actors appeared on the program, including Bela Lugosi, Boris Karloff, Franchot Tone, Robert Emhardt, Leslie Nielsen, Lloyd Bridges, and many more.\nThe program was a live television series, but most episodes were recorded on kinescope. However, only about 90 of the 260 episodes survive today.", "rate": 60, "genre": ["Drama"], "cast": ["Paul Frees"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 18538   Expand Suspense   (1949) User Score Overview Suspense is an American television anthology series that ran on CBS Television from 1949 to 1954. It was adapted from the radio program of the same name which ran from 1942 to 1962. Like many early television programs, the show was broadcast live from New York City. It was sponsored by the Auto-Lite corporation, and each episode was introduced by host Rex Marshall, who promoted Auto-Lite spark plugs, car batteries, headlights, and other car parts. Some of the early scripts were adapted from Suspense radio scripts, while others were original for television. Like the radio program, many scripts were adaptations of literary classics by well-known authors. Classic authors such as Edgar Allan Poe, Agatha Christie, and Charles Dickens all had stories adapted for the series, while contemporary authors such as Roald Dahl and Gore Vidal also contributed. Many notable actors appeared on the program, including Bela Lugosi, Boris Karloff, Franchot Tone, Robert Emhardt, Leslie Nielsen, Lloyd Bridges, and many more. The program was a live television series, but most episodes were recorded on kinescope. However, only about 90 of the 260 episodes survive today. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Paul Frees Full Cast & Crew Last Season Season 6 1953 | 50 Episodes Season 6 of Suspense premiered on September  1, 1953. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Suspense. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  25m, 30m Homepage  - Genres Drama Keywords anthology Content Score 56 We're so close, yet so far. Top Contributors 12 Banana T 2 Torq00 2 Zlogorek 2 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}