{"link": "https://www.themoviedb.org/tv/1393?language=en", "title": "Not Going Out", "resume": "Lee is a childish northerner who lives in a fancy penthouse apartment in London who goes through a variety of jobs such as a janitor and ice cream man as well as attempting relationships with female flatmates. His best mate, Daily Mail reading, middle class citizen Tim is always there to stop Lee from getting in trouble, or not? Mayhem is never far away with cleaner Barbara who has never done an honest day's work in her life.", "rate": 79, "genre": ["Comedy"], "cast": ["Lee Mack", "Tim Vine"], "character": ["Lee", "Tim Adams"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1393   Expand Not Going Out   (2006) User Score Overview Lee is a childish northerner who lives in a fancy penthouse apartment in London who goes through a variety of jobs such as a janitor and ice cream man as well as attempting relationships with female flatmates. His best mate, Daily Mail reading, middle class citizen Tim is always there to stop Lee from getting in trouble, or not? Mayhem is never far away with cleaner Barbara who has never done an honest day's work in her life. Featured Crew Lee Mack Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Mack Lee Tim Vine Tim Adams Full Cast & Crew Current Season Season 9 2018 | 7 Episodes Season 9 of Not Going Out premiered on March  8, 2018. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   1993-11-18 Goodnight Sweetheart 8.2    2002-11-14 Harry Hill's TV Burp 7.2    1962-01-04 Steptoe and Son 8.2    2001-01-14 Phoenix Nights 8.2    1990-09-27 Rab C. Nesbitt 7.1    1995-11-13 The Thin Blue Line 7.3    2000-01-12 That Peter Kay Thing 6.4    2015-04-29 Peter Kay's Car Share 7.5  Facts Status  Returning Series Network Certification 15 Meaning No-one under 15 is allowed to see a 15 film at the cinema or buy/rent a 15 rated video. 15 rated works are not suitable for children under 15 years of age. Type  Scripted Original Language  English Runtime  30m Homepage   http://www.bbc.co.uk/programmes/b006mw70 Genres Comedy Keywords london england sister apartment laziness british farce sitcom northerner innuendo british humour british sitcom Content Score 64 We're so close, yet so far. Top Contributors 54 Elizabeth Jennings a 47 alexmate 6 kcdh O 5 Ozbourne  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}