{"link": "https://www.themoviedb.org/tv/354?language=en", "title": "My Hero", "resume": "My Hero is a BBC sitcom created by Paul Mendelson. The programme ran for six series, first broadcast in February 2000, and concluding in September 2006. The series follows the antics of the dim-witted superhero \"Thermoman\", portrayed by Ardal O'Hanlon in series one to five and by James Dreyfus in the final series. The series was regularly directed by John Stroud. In the UK, the digital channel Gold regularly re-runs the programme, although the last series has yet to appear on the channel. In the United States it was shown on PBS and, briefly, BBC America. In Australia, UKTV offered re-runs of the first three series, while BBC Entertainment provided repeats for Scandinavia.", "rate": 56, "genre": ["Comedy", "Sci-Fi", "Fantasy"], "cast": ["Ardal O'Hanlon", "Tim Wylton", "Philip Whitchurch", "Lill Roughley", "Hugh Dennis"], "character": ["Dr. Piers Crispin"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 354   Expand My Hero   (2000) User Score Overview My Hero is a BBC sitcom created by Paul Mendelson. The programme ran for six series, first broadcast in February 2000, and concluding in September 2006. The series follows the antics of the dim-witted superhero \"Thermoman\", portrayed by Ardal O'Hanlon in series one to five and by James Dreyfus in the final series. The series was regularly directed by John Stroud. In the UK, the digital channel Gold regularly re-runs the programme, although the last series has yet to appear on the channel. In the United States it was shown on PBS and, briefly, BBC America. In Australia, UKTV offered re-runs of the first three series, while BBC Entertainment provided repeats for Scandinavia. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ardal O'Hanlon Tim Wylton Philip Whitchurch Lill Roughley Hugh Dennis Dr. Piers Crispin Full Cast & Crew Last Season Season 6 2006 | 8 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  4 Recommendations   1999-01-08 Gimme Gimme Gimme 7.0    2000-09-19 My Family 7.2    1995-11-13 The Thin Blue Line 7.3  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 28m Homepage   http://www.myhero.org.uk/ Genres Comedy Sci-Fi & Fantasy Keywords superhero sitcom british humour Content Score 86 Almost there... Top Contributors O 12 Ozbourne s 3 speedycars S 3 Spock2001 a 1 alexmate  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}