{"link": "https://www.themoviedb.org/tv/62812?language=en", "title": "Proof", "resume": "A brilliant surgeon searches for proof of life after death.", "rate": 60, "genre": ["Sci-Fi", "Fantasy", "Drama"], "cast": ["Jennifer Beals", "Matthew Modine", "Joe Morton"], "character": ["Dr. Carolyn Tyler", "Ivan Turing", "Dr. Charles Russell"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62812   Expand Proof   (2015) User Score  Play Trailer Overview A brilliant surgeon searches for proof of life after death. Featured Crew Rob Bragin Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jennifer Beals Dr. Carolyn Tyler Matthew Modine Ivan Turing Joe Morton Dr. Charles Russell Full Cast & Crew Last Season Season 1 2015 | 10 Episodes Season 1 of Proof premiered on June 16, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  4 Recommendations   2015-06-18 Complications 6.5    2017-03-30 Hindsight 6.5    2016-06-08 Power Monkeys 7.0    2014-11-23 Remember Me 6.7    2015-06-10 The Interceptor 5.7    2011-09-14 Free Agents 4.8    2015-03-17 Ordinary Lies 7.0    2006-01-01 In Justice 6.8  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  43m, 42m Homepage   http://www.tntdrama.com/shows/proof.html Genres Sci-Fi & Fantasy Drama Keywords religion science vs religion life after death Content Score 71 Just a little bit more... Top Contributors 15 Elizabeth Jennings 13 Banana 12 lineker 9 Imzadi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}