{"link": "https://www.themoviedb.org/tv/2913?language=en", "title": "Are You Afraid of the Dark?", "resume": "Are You Afraid of the Dark? is a joint Canadian-American horror/fantasy-themed anthology television series. The original series was a joint production between the Canadian company Cinar and the American company Nickelodeon. The show was filmed in Richmond, British Columbia and in Montreal, Quebec including their suburbs.\nThe episode \"The Tale of the Twisted Claw\" was aired as a pilot on the evening of October 31, 1991 in the USA and in October 1990 in Canada. Are You Afraid of the Dark? was aired from August 15, 1992 to April 20, 1996 on Nickelodeon's SNICK. The series also aired on the Canadian television network YTV from October 30, 1990 until June 11, 2000.\nA revived series with new directors, writers, and cast was produced by Nickelodeon from 1999 to 2000 and also aired on SNICK. The sole member from the original lineup to return for the sixth and seventh seasons was Tucker, although Ross Hull returned for the concluding miniseries, which notably broke from the show's established format by blurring the line between story and \"reality\".", "rate": 74, "genre": ["Sci-Fi", "Fantasy"], "cast": ["JoAnna Garcia", "Daniel DeSanto", "Jodie Resther", "David Deveau", "Jacob Tierney"], "character": ["Sam"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2913   Expand Are You Afraid of the Dark?   (1992) User Score  Play Trailer Overview Are You Afraid of the Dark? is a joint Canadian-American horror/fantasy-themed anthology television series. The original series was a joint production between the Canadian company Cinar and the American company Nickelodeon. The show was filmed in Richmond, British Columbia and in Montreal, Quebec including their suburbs. The episode \"The Tale of the Twisted Claw\" was aired as a pilot on the evening of October 31, 1991 in the USA and in October 1990 in Canada. Are You Afraid of the Dark? was aired from August 15, 1992 to April 20, 1996 on Nickelodeon's SNICK. The series also aired on the Canadian television network YTV from October 30, 1990 until June 11, 2000. A revived series with new directors, writers, and cast was produced by Nickelodeon from 1999 to 2000 and also aired on SNICK. The sole member from the original lineup to return for the sixth and seventh seasons was Tucker, although Ross Hull returned for the concluding miniseries, which notably broke from the show's established format by blurring the line between story and \"reality\". Featured Crew D. J. MacHale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  3 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast JoAnna Garcia Sam Daniel DeSanto Jodie Resther David Deveau Jacob Tierney Full Cast & Crew Last Season Season 7 2000 | 13 Episodes Season 7 of Are You Afraid of the Dark? premiered on April  2, 2000. View All Seasons Social Reviews  1 Discussions  4 D A review by DavidLinck85  10.0 Written by  DavidLinck85  on August  9, 2017 There were a lot of great kids show that came on in the 90s and a lot of them were on Nickelodeon. In my opinion Are You Afraid of the Dark was one of the all-time greatest shows ever for kids because it had great story telling, great prodution value that still hilds up today. The stories that were on Are You Afraid of the Dark were extreamly creepy even for a kids show, also a lot of great actors got their start on this show. So if you love a great spooky and creepy horror anthology show for kids then I recommend Are You Afraid of the Dark. Read All Reviews Media Most Popular Videos  1 Backdrops  3 Posters  5 Recommendations   1995-10-27 Goosebumps 6.7    1991-08-11 Doug 7.0    1983-09-10 Inspector Gadget 6.6    1993-09-13 Animaniacs 7.6    1962-09-23 The Jetsons 6.6    1988-09-17 Garfield and Friends 6.6    1989-09-09 Beetlejuice 7.2    1994-09-12 Party of Five 6.3  Facts Status  Ended Networks Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Sci-Fi & Fantasy Keywords horror anthology Content Score 100 Yes! Looking good! Top Contributors d 12 denis D 12 Daniel 10 rpeters 9 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}