{"link": "https://www.themoviedb.org/tv/62810?language=en", "title": "Odd Mom Out", "resume": "Acclaimed author Jill Kargman plays a version of herself as she navigates the treacherous and elite ecosystem of New York's Upper East Side, and the uber-wealthy mommy clique inhabiting this fantastically outrageous domain.", "rate": 67, "genre": ["Comedy"], "cast": ["Jill Kargman", "K.K. Glick", "Abby Elliott", "Andy Buckley", "Joanna Cassidy"], "character": ["Jill", "Vanessa", "Brooke", "Andy", "Candace"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62810   Expand Odd Mom Out   (2015) User Score  Play Trailer Overview Acclaimed author Jill Kargman plays a version of herself as she navigates the treacherous and elite ecosystem of New York's Upper East Side, and the uber-wealthy mommy clique inhabiting this fantastically outrageous domain. Featured Crew Jill Kargman Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  1 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jill Kargman Jill K.K. Glick Vanessa Abby Elliott Brooke Andy Buckley Andy Joanna Cassidy Candace Full Cast & Crew Last Season Season 3 2017 | 10 Episodes Season 3 of Odd Mom Out premiered on July 12, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  4 Posters  1 Recommendations   2013-08-05 Quick Draw 6.3    2015-09-30 Marley's Ghosts 7.0    2016-03-01 Loosely Exactly Nicole 5.8    2014-03-21 Welcome to Sweden 6.3    2013-04-19 Alpha House 7.3    2015-03-25 Big Time in Hollywood, Fl 5.7    2014-10-02 Bad Judge 6.1    2016-01-13 Teachers 7.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  23m Homepage   http://www.bravotv.com/odd-mom-out Genres Comedy Keywords new york wealthy new york elite Content Score 100 Yes! Looking good! Top Contributors 46 Elizabeth Jennings 7 Banana s 6 speedycars b 5 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}