{"link": "https://www.themoviedb.org/tv/62681?language=en", "title": "Deutschland 83", "resume": "A gripping coming-of-age story set against the real culture wars and political events of Germany in the 1980s. The drama follows Martin Rauch as the 24 year-old East Germany native is pulled from the world as he knows it and sent to the West as an undercover spy for the Stasi foreign service. Hiding in plain sight in the West German army, he must gather the secrets of NATO military strategy. Everything is new, nothing is quite what it seems and everyone he encounters is harboring secrets, both political and personal.", "rate": 77, "genre": ["Drama"], "cast": ["Jonas Nay", "Sonja Gerhardt", "Alexander Beyer", "Sylvester Groth", "Ulrich Noethen"], "character": ["Martin Rauch / Moritz Stamm", "Annett Schneider", "Tobias Tischbier", "Walter Schweppenstette", "General Wolfgang Edel"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62681   Expand Deutschland 83   (2015) User Score  Play Trailer Overview A gripping coming-of-age story set against the real culture wars and political events of Germany in the 1980s. The drama follows Martin Rauch as the 24 year-old East Germany native is pulled from the world as he knows it and sent to the West as an undercover spy for the Stasi foreign service. Hiding in plain sight in the West German army, he must gather the secrets of NATO military strategy. Everything is new, nothing is quite what it seems and everyone he encounters is harboring secrets, both political and personal. Featured Crew Anna Winger Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  6 Videos Trailers  2 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jonas Nay Martin Rauch / Moritz Stamm Sonja Gerhardt Annett Schneider Alexander Beyer Tobias Tischbier Sylvester Groth Walter Schweppenstette Ulrich Noethen General Wolfgang Edel Full Cast & Crew Last Season Season 1 2015 | 8 Episodes Season 1 of Deutschland 83 premiered on June 17, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  6 Posters  6 Recommendations   2016-01-02 Tomorrow I Quit 7.9    2015-09-03 Sedwitz 8.0    2015-01-04 The Saboteurs 7.5    2014-09-21 The Code 7.4    2014-09-28 The Brokenwood Mysteries 7.6    2015-03-25 Big Time in Hollywood, Fl 5.7    2016-02-05 Familie Braun 7.7    2017-11-05 SMILF 6.7  Facts Status  Returning Series Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  German Runtime  60m, 45m Homepage  - Genres Drama Keywords germany espionage stasi 1980s Content Score 100 Yes! Looking good! Top Contributors 57 Elizabeth Jennings S 14 Samara 9 Banana 8 Abu-Dun  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}