{"link": "https://www.themoviedb.org/tv/60728?language=en", "title": "Kill la Kill", "resume": "The story centers around two fiercely fighting schoolgirls, Ryuuko Matoi and Satsuki Kiryuuin. On a campus ruled by force, a transfer student wielding a Basami sword brings about upheaval.", "rate": 78, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Ami Koshimizu", "Ryoka Yuzuki", "Aya Suzaki", "Akio Nojima"], "character": ["Ryuuko Matoi (voice)", "Satsuki Kiryuuin (voice)", "Mako Mankanshoku (voice)", "Mitsuzou Soroi (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 60728   Expand Kill la Kill   (2013) User Score  Play Trailer Overview The story centers around two fiercely fighting schoolgirls, Ryuuko Matoi and Satsuki Kiryuuin. On a campus ruled by force, a transfer student wielding a Basami sword brings about upheaval. Featured Crew Hiroyuki Imaishi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  5 Posters  7 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Ami Koshimizu Ryuuko Matoi (voice) Ryoka Yuzuki Satsuki Kiryuuin (voice) Aya Suzaki Mako Mankanshoku (voice) Akio Nojima Mitsuzou Soroi (voice) Full Cast & Crew Last Season Season 1 2013 | 25 Episodes Season 1 of Kill la Kill premiered on October  4, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  5 Posters  7 Recommendations   2012-10-04 BTOOOM! 6.3    2007-04-01 Gurren Lagann 7.9    2015-10-03 K-Project 6.3    2011-01-07 Puella Magi Madoka Magica 7.9    2012-10-07 Magi 7.5    2010-01-08 Durarara!! 7.4    2012-10-09  Girls und Panzer 6.4    2011-01-06 Infinite Stratos 5.0  Facts Original Name  キルラキル Status  Ended Network Certification MA15+ Meaning Not suitable for children and teens under 15; MA15+-rated programming may only be broadcast between 9:00 p.m. and 5:00 a.m. on any given day. Consumer advice is mandatory. Some R18+ rated movies on DVD/Blu-ray are often re-edited on free TV/cable channels to secure a more \"appropriate\" MA15+ rating. Some movies that were rated R18 on DVD have since been aired in Australian TV with MA15+ rating. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.kill-la-kill.jp/ Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords fight clothing school schoolgirl caste system Content Score 100 Yes! Looking good! Top Contributors 26 Razze 15 RubeensVinicius 13 BrerFox 12 Jenazad  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}