{"link": "https://www.themoviedb.org/tv/44652?language=en", "title": "Last Resort", "resume": "Last Resort is an American military drama television series. When the crew of the U.S. Navy Ohio-class ballistic missile submarine, the USS Colorado, pick up a U.S. Navy SEAL team off Pakistan's coast, the Colorado receives an order to launch nuclear ballistic missiles at Pakistan.", "rate": 70, "genre": ["Action", "Adventure", "Drama"], "cast": ["Andre Braugher", "Scott Speedman", "Daisy Betts", "Camille De Pazzis", "Dichen Lachman"], "character": ["Captain Marcus Chaplin", "XO Sam Kendal", "Lieutenant Grace Shepard", "Sophie Girard", "Tani Tumrenjack"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44652   Expand Last Resort   (2012) User Score  Play Trailer Overview Last Resort is an American military drama television series. When the crew of the U.S. Navy Ohio-class ballistic missile submarine, the USS Colorado, pick up a U.S. Navy SEAL team off Pakistan's coast, the Colorado receives an order to launch nuclear ballistic missiles at Pakistan. Featured Crew Karl Gajdusek Creator Shawn Ryan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  8 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Andre Braugher Captain Marcus Chaplin Scott Speedman XO Sam Kendal Daisy Betts Lieutenant Grace Shepard Camille De Pazzis Sophie Girard Dichen Lachman Tani Tumrenjack Full Cast & Crew Last Season Season 1 2012 | 13 Episodes Season 1 of Last Resort premiered on September 27, 2012. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  8 Recommendations   2013-02-14 Zero Hour 4.9    2008-03-04 New Amsterdam 7.5    2012-01-25 Touch 6.7    2011-07-11 Alphas 6.5    2009-04-09 Southland 7.8    2012-01-16 Alcatraz 5.9    2010-09-20 The Event 6.2    2012-05-27 Continuum 7.1  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  45m, 42m Homepage   https://movie.douban.com/subject/10535502/ Genres Action & Adventure Drama Keywords island navy submarine military government conspiracy Content Score 100 Yes! Looking good! Top Contributors 13 Travis Bell k 10 ktoswang 7 Banana 6 Atanas  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}