{"link": "https://www.themoviedb.org/tv/46994?language=en", "title": "Slugterra", "resume": "Slugterra is an American/Canadian animated television series created by Asaph Fipke. It premiered on Disney XD on October 15, 2012, at 3:30 PM ET. The series is produced by the Canadian animation studio Nerd Corps Entertainment.", "rate": 70, "genre": ["Action", "Adventure", "Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": ["Lee Tockar", "Shannon Chan-Kent", "Andrew Francis", "Sam Vincent"], "character": ["Pronto", "Trixie", "Kord", "Eli"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 46994   Expand Slugterra   (2012) User Score Overview Slugterra is an American/Canadian animated television series created by Asaph Fipke. It premiered on Disney XD on October 15, 2012, at 3:30 PM ET. The series is produced by the Canadian animation studio Nerd Corps Entertainment. Featured Crew Asaph Fipke Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Lee Tockar Pronto Shannon Chan-Kent Trixie Andrew Francis Kord Sam Vincent Eli Full Cast & Crew Last Season Season Specials 2014 | 4 Episodes Season 4 of Slugterra premiered on August 20, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Slugterra. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  22m Homepage   http://disneyxd.disney.com/slugterra Genres Action & Adventure Animation Comedy Sci-Fi & Fantasy Keywords good vs evil cartoon slug mystical land slugterra Content Score 93 Almost there... Top Contributors c 39 coffinbearer 21 david8s95 z 5 zurman1 s 4 sarkadii  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}