{"link": "https://www.themoviedb.org/tv/45783?language=en", "title": "Kuroko's Basketball", "resume": "In the story, Kagami Taiga has just enrolled into Seirin High School when he meets Kuroko Tetsuya of the school's basketball team. Kuroko happens to be the shadowy sixth member of the legendary Generation of Miracles basketball team. Together, Kagami and Kuroko aim to take their team to the inter-high school championship - against Kuroko's former teammates.", "rate": 79, "genre": ["Animation", "Comedy"], "cast": ["Kensho Ono", "Yuki Ono", "Junichi Suwabe", "Daisuke Ono", "Hiroshi Kamiya"], "character": ["Kuroko Tetsuya", "Kagami Taiga", "Aomine Daiki", "Shintaro Midorima", "Seijuurou Akashi"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45783   Expand Kuroko's Basketball   (2012) User Score Overview In the story, Kagami Taiga has just enrolled into Seirin High School when he meets Kuroko Tetsuya of the school's basketball team. Kuroko happens to be the shadowy sixth member of the legendary Generation of Miracles basketball team. Together, Kagami and Kuroko aim to take their team to the inter-high school championship - against Kuroko's former teammates. Featured Crew Shunsuke Tada Creator Noboru Takagi Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kensho Ono Kuroko Tetsuya Yuki Ono Kagami Taiga Junichi Suwabe Aomine Daiki Daisuke Ono Shintaro Midorima Hiroshi Kamiya Seijuurou Akashi Full Cast & Crew Last Season Season 3 2015 | 25 Episodes Season 3 of Kuroko's Basketball premiered on January 10, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   2016-10-06 Miss Bernard Said. 6.5    2014-04-06 Broken Blade 5.5    2015-10-03 K-Project 6.3    2012-12-03 Guilty Crown 7.4    2014-10-10 Your Lie in April 8.2  Facts Original Name  黒子のバスケ Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.kurobas.com/ Genres Animation Comedy Keywords sport basketball based on manga shounen anime Content Score 93 Almost there... Top Contributors J 17 JessicaBeatriz s 14 sora_sey 9 sp1ti 6 Indi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}