{"link": "https://www.themoviedb.org/tv/37858?language=en", "title": "Fate/stay night", "resume": "Shirou Emiya lost his parents in a fire when he was young and was later adopted by the sorcerer Kiritsugu Emiya. Shirou is drawn into the Holy Grail War summons a female \"Servant\" known as Saber to protect him and obtain the Holy Grail.", "rate": 80, "genre": ["Animation", "Sci-Fi", "Fantasy", "Action", "Adventure"], "cast": ["Noriaki Sugiyama", "Kana Ueda", "Ayako Kawasumi", "Hiroshi Kamiya"], "character": ["Shinji Matō"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 37858   Expand Fate/stay night   (2006) User Score Overview Shirou Emiya lost his parents in a fire when he was young and was later adopted by the sorcerer Kiritsugu Emiya. Shirou is drawn into the Holy Grail War summons a female \"Servant\" known as Saber to protect him and obtain the Holy Grail. Featured Crew Yamaguchi Yuji Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  7 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Noriaki Sugiyama Kana Ueda Ayako Kawasumi Hiroshi Kamiya Shinji Matō Full Cast & Crew Last Season Season 1 2006 | 24 Episodes Season 1 of Fate/stay night premiered on January  6, 2006. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply There are no discussions for Fate/stay night. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  3 Recommendations   2014-10-12 Fate/stay night [Unlimited Blade Works] 6.8    2011-10-02 Fate/Zero 7.9    2014-04-04 Selector Infected WIXOSS 5.6    2014-10-05 The Fruit of Grisaia 5.8    2009-10-02 A Certain Scientific Railgun 6.3    2012-10-04 BTOOOM! 6.3    2010-07-05 Highschool of the Dead 7.0    2008-04-07 Soul Eater 7.0  Facts Status  Ended Network Certification 14 Meaning Content suitable for viewers over the age of 14. Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.fatestaynight.jp/ Genres Animation Sci-Fi & Fantasy Action & Adventure Keywords No keywords have been added. Content Score 93 Almost there... Top Contributors 16 Banana G 12 Giaten 10 benf45 8 Deku2k  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}