{"link": "https://www.themoviedb.org/tv/67106?language=en", "title": "The Deep", "resume": "The adventures of the Nekton family, a family of daring underwater explorers who live aboard a state-of-the-art submarine, The Aronnax, and explore uncharted areas of the earth's oceans to unravel the mysteries of the deep.", "rate": 85, "genre": ["Animation"], "cast": ["Vincent Tong", "Ashleigh Ball", "Michael Dobson", "Kathleen Barr", "Lee Tockar"], "character": ["Antaeus Nekton (voice)", "Fontaine Nekton (voice)", "Will Nekton (voice)", "Kaiko Nekton (voice)", "Nereus (voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67106   Expand The Deep   (2016) User Score  Play Trailer Overview The adventures of the Nekton family, a family of daring underwater explorers who live aboard a state-of-the-art submarine, The Aronnax, and explore uncharted areas of the earth's oceans to unravel the mysteries of the deep. Featured Crew Tom Taylor Creator James Brouwer Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  3 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Vincent Tong Antaeus Nekton (voice) Ashleigh Ball Fontaine Nekton (voice) Michael Dobson Will Nekton (voice) Kathleen Barr Kaiko Nekton (voice) Lee Tockar Nereus (voice) Full Cast & Crew Last Season Season 2 2017 | 13 Episodes Season 2 of The Deep premiered on July 17, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  2 Posters  3 Recommendations We don't have enough data to suggest any TV shows based on The Deep. You can help by rating TV shows you've seen. Facts Status  Returning Series Networks Certification  - Type  Scripted Original Language  English Runtime  20m Homepage   http://www.thedeepanimated.com Genres Animation Keywords exploration underwater Content Score 100 Yes! Looking good! Top Contributors B 29 BaronessSara S 14 ShadowWatcher a 11 asusar 11 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}