{"link": "https://www.themoviedb.org/tv/15079?language=en", "title": "The Suite Life on Deck", "resume": "The series follows twin brothers Zack and Cody Martin and hotel heiress London Tipton in a new setting, the SS Tipton, where they attend classes at \"Seven Seas High\" and meet Bailey Pickett while Mr. Moseby manages the ship. The ship travels around the world to nations such as Italy, Greece, India, Sweden and the United Kingdom where the characters experience different cultures, adventures, and situations.", "rate": 64, "genre": ["Family", "Comedy"], "cast": ["Dylan Sprouse", "Cole Sprouse", "Brenda Song", "Debby Ryan", "Phill Lewis"], "character": ["Zack Martin", "Cody Martin", "London Tipton", "Bailey Pickett", "Marion Moseby"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15079   Expand The Suite Life on Deck   (2008) User Score Overview The series follows twin brothers Zack and Cody Martin and hotel heiress London Tipton in a new setting, the SS Tipton, where they attend classes at \"Seven Seas High\" and meet Bailey Pickett while Mr. Moseby manages the ship. The ship travels around the world to nations such as Italy, Greece, India, Sweden and the United Kingdom where the characters experience different cultures, adventures, and situations. Featured Crew Danny Kallis Creator Pamela Eells Creator Jim Geoghan Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  3 Content Issues  0 Images Backdrops  7 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dylan Sprouse Zack Martin Cole Sprouse Cody Martin Brenda Song London Tipton Debby Ryan Bailey Pickett Phill Lewis Marion Moseby Full Cast & Crew Last Season Season 3 2010 | 22 Episodes Season 3 of The Suite Life on Deck premiered on July  2, 2010. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply w Cody: Happy Birthday Cole Sprouse! Open 0 by wonder2wonder\n      \n     w Zac: Happy Birthday Dylan Sprouse! Open 0 by wonder2wonder\n      \n     w Bailey: Happy Birthday Debby Ryan! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  7 Posters  1 Recommendations   2006-12-02 The Suite Life of Zack & Cody 5.3    2007-10-12 Wizards of Waverly Place 6.6    2007-09-08 iCarly 6.3    2011-09-30 Jessie 6.3    2003-01-17 That's So Raven 5.6    2004-01-11 Drake & Josh 7.1    2009-11-28 Big Time Rush 4.9    2006-03-24 Hannah Montana 5.0  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage   http://disneychannel.disney.com/suite-life-on-deck Genres Family Comedy Keywords ship twin brother cruise ship teenager Content Score 93 Almost there... Top Contributors 29 Banana 19 prm96 9 neutron666 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}