{"link": "https://www.themoviedb.org/tv/8974?language=en", "title": "Hell Girl", "resume": "Hell Girl, also known as Jigoku Shōjo: Girl from Hell, is an anime series produced by Aniplex and Studio Deen. It focuses on the existence of a supernatural system that allows people to take revenge by having other people sent to Hell via the services of the mysterious titular character and her assistants who implement this system. Revenge, injustice, hatred, and the nature of human emotions are common themes throughout the series.\nIt premiered across Japan on numerous television stations, including Animax, Tokyo MX, MBS and others, between October 4, 2005 and April 4, 2006. Following the success of the first season, the series was followed soon after into a second, Jigoku Shōjo Futakomori, which premiered October 7, 2006 across Japan on Animax. A live-action television series adaptation started airing in Japan on Nippon Television from November 4, 2006. A third season of the anime, further continuing the series, was first announced on the mobile version of the series' official website Jigoku Tsūshin. The official title of the third season was announced to be Jigoku Shōjo Mitsuganae. and began airing on Japanese TV October 4, 2008.", "rate": 70, "genre": ["Animation", "Drama", "Mystery", "Sci-Fi", "Fantasy"], "cast": ["Masaya Matsukaze", "Mamiko Noto", "Takayuki Sugo", "Takako Honda", "Kanako Sakai"], "character": ["Ichimokuren", "Ai Enma", "Wanyūdō", "Hone Onna", "Kikuri"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 8974   Expand Hell Girl   (2005) User Score Overview Hell Girl, also known as Jigoku Shōjo: Girl from Hell, is an anime series produced by Aniplex and Studio Deen. It focuses on the existence of a supernatural system that allows people to take revenge by having other people sent to Hell via the services of the mysterious titular character and her assistants who implement this system. Revenge, injustice, hatred, and the nature of human emotions are common themes throughout the series. It premiered across Japan on numerous television stations, including Animax, Tokyo MX, MBS and others, between October 4, 2005 and April 4, 2006. Following the success of the first season, the series was followed soon after into a second, Jigoku Shōjo Futakomori, which premiered October 7, 2006 across Japan on Animax. A live-action television series adaptation started airing in Japan on Nippon Television from November 4, 2006. A third season of the anime, further continuing the series, was first announced on the mobile version of the series' official website Jigoku Tsūshin. The official title of the third season was announced to be Jigoku Shōjo Mitsuganae. and began airing on Japanese TV October 4, 2008. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  8 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Masaya Matsukaze Ichimokuren Mamiko Noto Ai Enma Takayuki Sugo Wanyūdō Takako Honda Hone Onna Kanako Sakai Kikuri Full Cast & Crew Last Season Hell Girl: Company in the Evening 2017 | 26 Episodes Season 4 of Hell Girl premiered on July 14, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  8 Recommendations   2003-11-24 Chrno Crusade 5.7    2008-04-07 Soul Eater 7.0    2006-10-03 Ghost Hunt 7.4    2004-08-13 Foster's Home for Imaginary Friends 6.8    2010-04-03 Angel Beats! 7.4    2012-01-10 Another 7.2    2007-10-04 Clannad 7.5    1998-11-18 The Powerpuff Girls 7.0  Facts Original Name  地獄少女 Status  Ended Networks Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  Japanese Runtime  25m Homepage   http://www.jigokushoujo.com Genres Animation Drama Mystery Sci-Fi & Fantasy Keywords horror anime Content Score 86 Almost there... Top Contributors 60 kappa-papa 18 CrewMdk 8 Jaime Neto 8 shizuku  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}