{"link": "https://www.themoviedb.org/tv/31736?language=en", "title": "Eyeshield 21", "resume": "Eyeshield 21 is a Japanese manga series written by Riichiro Inagaki and illustrated by Yusuke Murata. The series tells the story of Sena Kobayakawa, a introverted boy who joins an American football club as a secretary, but after being coerced by Hiruma, turns out to play wearing an eyeshield and the number 21, under the pseudonym of \"Eyeshield 21\". Inagaki chose American football as a central subject of Eyeshield 21 after realizing that it fit perfectly with his idea for the series.\nThe manga was originally serialized in Shueisha's Weekly Shōnen Jump from July 2002 to June 2009. The series consists of 333 chapters collected in 37 tankōbon volumes. An anime adaptation consisting of 145 television episodes was directed by Masayoshi Nishida, and co-produced by TV Tokyo, NAS, and Gallop. The television series first aired on Japan's TV Tokyo network from April 6, 2005 to March 19, 2008. The Eyeshield 21 franchise has spawned two original video animations, audio albums, video games, and other merchandise.\nIn North America, the manga was released by Viz Media from April 2005 to October 2011. The anime series was later licensed in North America by Toonami Jetstream as a joint effort with Viz Media, and aired on December 17, 2007 on its site, but before its completion, the streaming service was shut down. The whole series was streamed in English by Crunchyroll, while Sentai Filmworks licensed the series, with distribution from Section23 Films on DVDs.", "rate": 95, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Atsushi Tamura", "Aya Hirano", "Kenji Nomura", "Mamoru Miyano", "Kappei Yamaguchi"], "character": ["Yoichi Hiruma", "Mamori Anezaki", "Komusubi's Dad", "Haruto Sakuraba", "Raimon Tarou"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31736   Expand Eyeshield 21   (2005) User Score Overview Eyeshield 21 is a Japanese manga series written by Riichiro Inagaki and illustrated by Yusuke Murata. The series tells the story of Sena Kobayakawa, a introverted boy who joins an American football club as a secretary, but after being coerced by Hiruma, turns out to play wearing an eyeshield and the number 21, under the pseudonym of \"Eyeshield 21\". Inagaki chose American football as a central subject of Eyeshield 21 after realizing that it fit perfectly with his idea for the series. The manga was originally serialized in Shueisha's Weekly Shōnen Jump from July 2002 to June 2009. The series consists of 333 chapters collected in 37 tankōbon volumes. An anime adaptation consisting of 145 television episodes was directed by Masayoshi Nishida, and co-produced by TV Tokyo, NAS, and Gallop. The television series first aired on Japan's TV Tokyo network from April 6, 2005 to March 19, 2008. The Eyeshield 21 franchise has spawned two original video animations, audio albums, video games, and other merchandise. In North America, the manga was released by Viz Media from April 2005 to October 2011. The anime series was later licensed in North America by Toonami Jetstream as a joint effort with Viz Media, and aired on December 17, 2007 on its site, but before its completion, the streaming service was shut down. The whole series was streamed in English by Crunchyroll, while Sentai Filmworks licensed the series, with distribution from Section23 Films on DVDs. Featured Crew Masayoshi Nishida Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Atsushi Tamura Yoichi Hiruma Aya Hirano Mamori Anezaki Kenji Nomura Komusubi's Dad Mamoru Miyano Haruto Sakuraba Kappei Yamaguchi Raimon Tarou Full Cast & Crew Last Season Season 1 2005 | 145 Episodes Season 1 of Eyeshield 21 premiered on April  6, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  6 Recommendations We don't have enough data to suggest any TV shows based on Eyeshield 21. You can help by rating TV shows you've seen. Facts Original Name  アイシールド21 Status  Ended Network Certification  - Type  Scripted Original Language  Japanese Runtime  24m Homepage  - Genres Animation Comedy Drama Keywords american football Content Score 93 Almost there... Top Contributors M 9 Migi 6 Jenazad J 5 JohnyB0y 3 Sergiojamon  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}