{"link": "https://www.themoviedb.org/tv/47745?language=en", "title": "Karadayı", "resume": "The Kara family's life is turned upside down because of a wrongful accusation that results in the imprisonment of Nazif Kara for a murder he didn't commit.", "rate": 74, "genre": [], "cast": ["Kenan İmirzalıoğlu", "Bergüzar Korel", "Çetin Tekindor", "Yurdaer Okur", "Rıza Kocaoğlu"], "character": ["Mahir Kara", "Feride Sadoglu", "Nazif Kara", "Turgut Akin", "Yasin 'Kibrit' Ulutas"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47745   Expand Karadayı   (2012) User Score Overview The Kara family's life is turned upside down because of a wrongful accusation that results in the imprisonment of Nazif Kara for a murder he didn't commit. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  4 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kenan İmirzalıoğlu Mahir Kara Bergüzar Korel Feride Sadoglu Çetin Tekindor Nazif Kara Yurdaer Okur Turgut Akin Rıza Kocaoğlu Yasin 'Kibrit' Ulutas Full Cast & Crew Last Season Season 3 2014 | 40 Episodes Season 3 of Karadayı premiered on September 15, 2014. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  4 Posters  2 Recommendations   2007-05-17 Embarrassing Bodies 6.8    2014-04-20 Filthy Riches 6.7    Yabancı Damat 5.0    2009-09-28 Ezel 8.2    2012-09-04 Highway Thru Hell 7.0    1997-11-24 Breaking the Magician's Code: Magic's Biggest Secrets Finally Revealed 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  Turkish Runtime  130m Homepage  - Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors M 16 Mylie 10 Elizabeth Jennings 7 Marr 🇳🇱 z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}