{"link": "https://www.themoviedb.org/tv/44636?language=en", "title": "Cult", "resume": "After a rash of disappearances and a likely murder, an inquisitive, young female production assistant on a wildly popular television show called Cult joins a journalist blogger in investigating the rabid fans of the series who might be re-creating crimes seen on the program, in real life.", "rate": 45, "genre": ["Mystery", "Drama"], "cast": ["Alona Tal", "Robert Knepper", "Jessica Lucas", "Matthew Davis", "Jeffrey Pierce"], "character": ["Kelly Collins", "Billy Grimm", "Skye Yarrow", "Jeff", "Stuart"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 44636   Expand Cult   (2013) User Score  Play Trailer Overview After a rash of disappearances and a likely murder, an inquisitive, young female production assistant on a wildly popular television show called Cult joins a journalist blogger in investigating the rabid fans of the series who might be re-creating crimes seen on the program, in real life. Featured Crew Rockne S. O'Bannon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  5 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alona Tal Kelly Collins Robert Knepper Billy Grimm Jessica Lucas Skye Yarrow Matthew Davis Jeff Jeffrey Pierce Stuart Full Cast & Crew Last Season Season 1 2013 | 13 Episodes Season 1 of Cult premiered on February 19, 2013. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  5 Recommendations   2006-10-10 Intelligence 8.3    2008-03-10 The Fixer 7.6    2013-07-15 Run 6.5    2011-08-05 Friends with Benefits 6.1    2015-03-01 Battle Creek 6.5    2014-01-13 Chozen 6.1    2016-12-07 Shut Eye 6.3    2012-10-11 Copper 6.0  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage  - Genres Mystery Drama Keywords investigative journalism Content Score 100 Yes! Looking good! Top Contributors 8 seawolf 6 Travis Bell w 6 webmaster z 5 zurman1  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}