{"link": "https://www.themoviedb.org/tv/67157?language=en", "title": "The Great Indoors", "resume": "An adventure reporter must adapt to the times when he becomes the boss to a group of millennials in the digital department of the magazine.", "rate": 53, "genre": ["Comedy"], "cast": ["Joel McHale", "Stephen Fry", "Susannah Fielding", "Christopher Mintz-Plasse", "Shaun Brown"], "character": ["Ashley Jack Gordon", "Roland", "Brooke", "Clark Roberts", "Mason"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 67157   Expand The Great Indoors   (2016) User Score  Play Trailer Overview An adventure reporter must adapt to the times when he becomes the boss to a group of millennials in the digital department of the magazine. Featured Crew Mike Gibbons Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Joel McHale Ashley Jack Gordon Stephen Fry Roland Susannah Fielding Brooke Christopher Mintz-Plasse Clark Roberts Shaun Brown Mason Full Cast & Crew Last Season Season 1 2016 | 22 Episodes Season 1 of The Great Indoors premiered on October 27, 2016. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply why does there has to be british actors on american tv shows Open 2 by  Xsploit w Living in a bubble Open 0 by wonder2wonder\n      \n     started slow.......but pretty funny now Open 0 by tom99\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   2017-02-02 Powerless 5.8    2016-03-15 Crowded 6.4    2015-02-19 The Odd Couple 5.4    2015-12-07 Telenovela 7.2    2016-03-01 Loosely Exactly Nicole 5.8    2015-03-17 Ordinary Lies 7.0    2017-03-29 Imaginary Mary 6.1    2015-04-08 Your Family or Mine 4.6  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  21m Homepage   http://cbs.com/shows/the-great-indoors Genres Comedy Keywords magazine sitcom workplace comedy millennials Content Score 100 Yes! Looking good! Top Contributors p 30 plumpro 24 Banana 10 martijnwiekens 6 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}