{"link": "https://www.themoviedb.org/tv/15655?language=en", "title": "Knight Rider", "resume": "On the heels of NBC's hit movie, the iconic 1980s television classic  comes roaring back to life as a reinvented, updated and super-charged  action series showcasing the new KITT (Knight Industries Three  Thousand). Absolutely the coolest car ever created, KITT is equipped  with an \"AI\" (artificial intelligence) that is capable of hacking almost  any system. Its weapons systems match that of a jet fighter, and its  body is capable of actually transforming into other vehicles and using  sophisticated holographic imagery to elude villains.", "rate": 59, "genre": ["Drama", "Action", "Adventure"], "cast": ["Justin Bruening", "Bruce Davison", "Deanna Russo", "Paul Campbell", "Smith Cho"], "character": ["Mike Knight", "Charles Graiman", "Sarah Graiman", "Billy Morgan", "Zoe Chae"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 15655   Expand Knight Rider   (2008) User Score Overview On the heels of NBC's hit movie, the iconic 1980s television classic  comes roaring back to life as a reinvented, updated and super-charged  action series showcasing the new KITT (Knight Industries Three  Thousand). Absolutely the coolest car ever created, KITT is equipped  with an \"AI\" (artificial intelligence) that is capable of hacking almost  any system. Its weapons systems match that of a jet fighter, and its  body is capable of actually transforming into other vehicles and using  sophisticated holographic imagery to elude villains. Featured Crew Glen A. Larson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  18 Posters  11 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Justin Bruening Mike Knight Bruce Davison Charles Graiman Deanna Russo Sarah Graiman Paul Campbell Billy Morgan Smith Cho Zoe Chae Full Cast & Crew Last Season Season 1 2008 | 17 Episodes Season 1 of Knight Rider premiered on September 24, 2008. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  18 Posters  11 Recommendations   1983-09-22 Just Good Friends 6.4    2005-02-21 Masterchef Goes Large 4.8    1983-12-15 Automan 6.5    1987-09-14 BraveStarr 5.6    1968-09-14 The Adventures of Batman 7.4    1997-09-27 Honey, I Shrunk the Kids: The TV Show 5.5    1989-09-19 Doogie Howser, M.D. 5.7    1982-09-26 Knight Rider 6.5  Facts Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  43m, 60m Homepage   http://www.nbc.com/Knight_Rider Genres Drama Action & Adventure Keywords undercover car Content Score 100 Yes! Looking good! Top Contributors 17 United600 12 Banana 11 Elizabeth Jennings BB 9 Balázs Bárdosi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}