{"link": "https://www.themoviedb.org/tv/45501?language=en", "title": "Love, Chunibyo & Other Delusions", "resume": "Yuta has a problem. As one of the thousands of Japanese students afflicted with \"chunibyo,\" a state where they're so desperate to stand out that they've literally convinced themselves that they have secret knowledge and hidden powers, Yuta spent most of his middle school years living in a complete fantasy world. But that's not his major problem now, as with a lot of work and effort, he's finally managing to overcome his delusions to the point where thinks he's ready to start high school with all his cards in order. No, his BIG problem is the girl he first encounters climbing on his balcony.\nIt seems that his own efforts to rid himself of his chunibyo have attracted the attentions of another sufferer, and she's decided that this makes him her soul mate. And since Rikka's just moved in upstairs, now he's being sucked into her fantasy world! Can a formerly wild and crazy guy handle being the focus of a completely delusional girl? Or will his own chunibyo return with a vengeance?", "rate": 80, "genre": ["Animation", "Comedy", "Drama"], "cast": ["Jun Fukuyama", "Maaya Uchida", "Azumi Asakura", "Chinatsu Akasaki", "Juri Nagatsuma"], "character": ["Yūta Togashi", "Rikka Takanashi", "Kumin Tsuyuri", "Shinka Nibutani", "Satone Shichimiya"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 45501   Expand Love, Chunibyo & Other Delusions   (2012) User Score Overview Yuta has a problem. As one of the thousands of Japanese students afflicted with \"chunibyo,\" a state where they're so desperate to stand out that they've literally convinced themselves that they have secret knowledge and hidden powers, Yuta spent most of his middle school years living in a complete fantasy world. But that's not his major problem now, as with a lot of work and effort, he's finally managing to overcome his delusions to the point where thinks he's ready to start high school with all his cards in order. No, his BIG problem is the girl he first encounters climbing on his balcony. It seems that his own efforts to rid himself of his chunibyo have attracted the attentions of another sufferer, and she's decided that this makes him her soul mate. And since Rikka's just moved in upstairs, now he's being sucked into her fantasy world! Can a formerly wild and crazy guy handle being the focus of a completely delusional girl? Or will his own chunibyo return with a vengeance? Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun Fukuyama Yūta Togashi Maaya Uchida Rikka Takanashi Azumi Asakura Kumin Tsuyuri Chinatsu Akasaki Shinka Nibutani Juri Nagatsuma Satone Shichimiya Full Cast & Crew Last Season Love, Chunibyo & Other Delusions!: Heart Throb 2014 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  6 Posters  4 Recommendations   2011-10-07 Haganai: I Don't Have Many Friends 7.7    2012-07-06 Aesthetica of a Rogue Hero 7.1    2016-01-08 Dagashi Kashi 6.3    2016-04-07 Bungo Stray Dogs 7.3    2016-07-02 First Love Monster 5.7    2015-07-05 Charlotte 6.8    2015-04-04 Is It Wrong to Try to Pick Up Girls in a Dungeon? 6.9    2006-04-04 Ouran High School Host Club 7.6  Facts Original Name  中二病でも恋がしたい! Status  Ended Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  Japanese Runtime  24m Homepage   http://www.anime-chu-2.com/ Genres Animation Comedy Drama Keywords romance slice of life school based on light novel anime school club Content Score 93 Almost there... Top Contributors 33 WillofOwn A 26 Anlothen 18 CrewMdk 14 Axeshizzle  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}