{"link": "https://www.themoviedb.org/tv/6000?language=en", "title": "Celebrity Juice", "resume": "Celebrity Juice is a British television comedy panel game on ITV2, broadcast since September 24, 2008. The show is written and presented by Keith Lemon, the alter-ego of comedian Leigh Francis.", "rate": 64, "genre": ["Comedy"], "cast": ["Keith Lemon", "Holly Willoughby", "Fearne Cotton"], "character": ["Host", "Host", "Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 6000   Expand Celebrity Juice   (2008) User Score Overview Celebrity Juice is a British television comedy panel game on ITV2, broadcast since September 24, 2008. The show is written and presented by Keith Lemon, the alter-ego of comedian Leigh Francis. Featured Crew Leigh Francis Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Keith Lemon Host Holly Willoughby Host Fearne Cotton Host Full Cast & Crew Last Season Season 17 2017 | 4 Episodes Season 17 of Celebrity Juice premiered on March 23, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  3 Recommendations   The Karen Carpenter Story 5.3    1982-11-02 Countdown 5.4    2005-01-10 Come Dine with Me 4.6    2005-06-05 Mock the Week 7.0    1998-09-14 The Royle Family 7.9    1990-01-04 One Foot in the Grave 7.5    2012-08-14 Bad Education 7.5    2007-09-19 Kitchen Nightmares 7.1  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  60m Homepage   itv.com/celebjuice Genres Comedy Keywords sexual humor alter ego panel show british humour Content Score 64 We're so close, yet so far. Top Contributors f 10 freundm O 6 Ozbourne 4 szab 4 RJHB  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}