{"link": "https://www.themoviedb.org/tv/65567?language=en", "title": "The Boat", "resume": "Life aboard a German U-Boat during World War II.", "rate": 82, "genre": ["Drama", "War", "Politics"], "cast": ["Jürgen Prochnow", "Hubertus Bengsch", "Klaus Wennemann", "Herbert Grönemeyer", "Martin Semmelrogge"], "character": ["Kommandant („Der Alte“)", "1. Wachoffizier", "Leitender Ingenieur", "Leutnant Werner", "2. Wachoffizier"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65567   Expand The Boat   (1985) User Score  Play Trailer Overview Life aboard a German U-Boat during World War II. Featured Crew Günter Rohrbach Creator Wolfgang Petersen Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  6 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jürgen Prochnow Kommandant („Der Alte“) Hubertus Bengsch 1. Wachoffizier Klaus Wennemann Leitender Ingenieur Herbert Grönemeyer Leutnant Werner Martin Semmelrogge 2. Wachoffizier Full Cast & Crew Last Season Season 1 1985 | 6 Episodes Season 1 of The Boat premiered on February 24, 1985. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  6 Posters  4 Recommendations   1979-09-10 Tinker Tailor Soldier Spy 7.7    1982-09-20 Smiley's People 7.9    1969-10-05 Monty Python's Flying Circus 8.2    1962-02-23 Benny Hill 8.3    1983-09-05 Reilly, Ace of Spies 6.8    1995-09-22 Space: Above and Beyond 6.8    1973-10-31 The World at War 8.1    2005-07-21 Extras 7.8  Facts Original Name  Das Boot Status  Ended Networks - Certification 12 Meaning The broadcaster must take the decision about the air time by taking in consideration the impact on young children in the timeframe from 6:00am to 8:00pm. Type  Scripted Original Language  German Runtime  51m Homepage  - Genres Drama War & Politics Keywords sea war ship world war ii Content Score 100 Yes! Looking good! Top Contributors m 34 mEDI 12 Eramik z 10 zurman1 TB 8 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}