{"link": "https://www.themoviedb.org/tv/62819?language=en", "title": "Another Period", "resume": "Set at the turn of the century, “Another Period” follows the misadventures of the Bellacourts, Newport, RI’s first family, who have absolutely nothing to offer to the world, but who have so much money it doesn’t matter. The series focuses on sisters “Lillian” and “Beatrice”, who care only about how they look, what parties they attend and becoming famous, which is a lot harder in 1902.", "rate": 63, "genre": ["Comedy"], "cast": ["Riki Lindhome", "Natasha Leggero", "Jason Ritter", "Paget Brewster", "Christina Hendricks"], "character": ["Beatrice Bellacourt", "Lillian Bellacourt", "Frederick Bellacourt", "Dodo Bellacourt", "Celine"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62819   Expand Another Period   (2015) User Score  Play Trailer Overview Set at the turn of the century, “Another Period” follows the misadventures of the Bellacourts, Newport, RI’s first family, who have absolutely nothing to offer to the world, but who have so much money it doesn’t matter. The series focuses on sisters “Lillian” and “Beatrice”, who care only about how they look, what parties they attend and becoming famous, which is a lot harder in 1902. Featured Crew Natasha Leggero Creator Riki Lindhome Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Riki Lindhome Beatrice Bellacourt Natasha Leggero Lillian Bellacourt Jason Ritter Frederick Bellacourt Paget Brewster Dodo Bellacourt Christina Hendricks Celine Full Cast & Crew Current Season Season 3 2018 | 11 Episodes Season 3 of Another Period premiered on January 23, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply Crazy, stupid and hilarious. Open 0 by Master_YODA\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations   2012-02-20 The Bleak Old Shop of Stuff 6.7    2015-08-03 Significant Mother 5.9    2014-10-02 A to Z 5.7    2015-06-16 Clipped 4.1    2005-07-20 Criss Angel Mindfreak 4.2    2014-03-21 Welcome to Sweden 6.3    2013-07-09 Drunk History 7.2    2013-05-03 Maron 6.9  Facts Status  Returning Series Network Certification TV-14 Meaning This program contains some material that many parents would find unsuitable for children under 14 years of age. Type  Scripted Original Language  English Runtime  23m Homepage   http://www.cc.com/shows/another-period Genres Comedy Keywords parody high society upstairs downstairs period sitcom 20th century Content Score 100 Yes! Looking good! Top Contributors 30 Elizabeth Jennings t 24 tmdb45070722 10 Banana b 8 basher  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}