{"link": "https://www.themoviedb.org/tv/1082?language=en", "title": "Red Shoe Diaries", "resume": "Red Shoe Diaries is an erotic drama series that aired on the American cable television network Showtime from 1992 to 1997 and distributed by Playboy Entertainment overseas. Most episodes were directed by either Zalman King, Rafael Eisenman or both.", "rate": 48, "genre": ["Drama"], "cast": ["David Duchovny", "Billy Wirth", "Sheryl Lee", "Claire Stansfield", "Kate Jackson"], "character": ["Jake Winters"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1082   Expand Red Shoe Diaries   (1992) User Score Overview Red Shoe Diaries is an erotic drama series that aired on the American cable television network Showtime from 1992 to 1997 and distributed by Playboy Entertainment overseas. Most episodes were directed by either Zalman King, Rafael Eisenman or both. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast David Duchovny Jake Winters Billy Wirth Sheryl Lee Claire Stansfield Kate Jackson Full Cast & Crew Last Season season 2 1993 | 14 Episodes Season 2 of Red Shoe Diaries premiered on December 18, 1993. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  2 Recommendations   1996-09-28 Psi Factor: Chronicles of the Paranormal 6.3    1983-01-10 Fraggle Rock 7.7    1984-11-05 Muppet Babies 7.2    2012-07-19 Comedians in Cars Getting Coffee 7.3    1993-01-01 Dr. Quinn, Medicine Woman 6.2    2015-01-22 Backstrom 6.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Drama Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors f 8 fabio19 t 4 thyron W 3 Wombatty 3 rtentser  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}