{"link": "https://www.themoviedb.org/tv/64711?language=en", "title": "StarTalk with Neil deGrasse Tyson", "resume": "Host Neil deGrasse Tyson brings together celebrities, scientists and comedians to explore a variety of cosmic topics and collide pop culture with science in a way that late-night television has never seen before. Weekly topics range from popular science fiction, space travel, extraterrestrial life, the Big Bang, to the future of Earth and the environment. Tyson is an astrophysicist with a gifted ability to connect with everyone, inspiring us all to to \"keep looking up.\"", "rate": 69, "genre": ["Talk"], "cast": ["Neil deGrasse Tyson"], "character": ["Himself - Host"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 64711   Expand StarTalk with Neil deGrasse Tyson   (2015) User Score  Play Trailer Overview Host Neil deGrasse Tyson brings together celebrities, scientists and comedians to explore a variety of cosmic topics and collide pop culture with science in a way that late-night television has never seen before. Weekly topics range from popular science fiction, space travel, extraterrestrial life, the Big Bang, to the future of Earth and the environment. Tyson is an astrophysicist with a gifted ability to connect with everyone, inspiring us all to to \"keep looking up.\" Featured Crew Neil deGrasse Tyson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  8 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Neil deGrasse Tyson Himself - Host Full Cast & Crew Last Season Season 4 2017 | 10 Episodes Season 4 of StarTalk with Neil deGrasse Tyson premiered on October  1, 2017. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  8 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on StarTalk with Neil deGrasse Tyson. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-G Meaning Most parents would find this program suitable for all ages. Type  Talk Show Original Language  English Runtime  60m Homepage   http://channel.nationalgeographic.com/startalk/ Genres Talk Keywords talk show physics space science cosmos Content Score 71 Just a little bit more... Top Contributors 29 Bryan Bortz 25 Elizabeth Jennings s 3 speedycars s 2 sindirahardian  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}