{"link": "https://www.themoviedb.org/tv/10926?language=en", "title": "Sonic X", "resume": "Sonic X is an anime series based on the Sonic the Hedgehog video game series. It was created by Sonic Team and produced in Japan by TMS Entertainment. It aired on TV Tokyo from April 6, 2003 to March 28, 2004 and on Kids Station from 2004 to 2005. In the United States, Saban Brands currently owns and manages the copyright and branding of the series.", "rate": 56, "genre": ["Action", "Adventure", "Animation", "Comedy", "Drama", "Sci-Fi", "Fantasy"], "cast": ["Jun'ichi Kanemaru", "Sanae Kobayashi", "Taeko Kawata", "Nobutoshi Canna", "Sayaka Aoki"], "character": ["Sonic the Hedgehog", "Chris Thorndyke", "Amy Rose", "Knuckles the Echidna", "Cream the Rabbit"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 10926   Expand Sonic X   (2003) User Score Overview Sonic X is an anime series based on the Sonic the Hedgehog video game series. It was created by Sonic Team and produced in Japan by TMS Entertainment. It aired on TV Tokyo from April 6, 2003 to March 28, 2004 and on Kids Station from 2004 to 2005. In the United States, Saban Brands currently owns and manages the copyright and branding of the series. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  3 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Jun'ichi Kanemaru Sonic the Hedgehog Sanae Kobayashi Chris Thorndyke Taeko Kawata Amy Rose Nobutoshi Canna Knuckles the Echidna Sayaka Aoki Cream the Rabbit Full Cast & Crew Last Season Season 3 2005 | 26 Episodes Season 3 of Sonic X premiered on September 10, 2005. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  3 Posters  4 Recommendations   2004-12-18 W.I.T.C.H. 6.6    2006-10-02 Yin Yang Yo! 4.8    2003-11-01 Tutenstein 6.1    2000-09-30 George Shrinks 4.3    2005-05-30 The Life and Times of Juniper Lee 4.2    2005-08-27 A.T.O.M. 7.0    2006-06-03 Galactik Football 8.0    2008-10-03 The Secret Saturdays 3.8  Facts Status  Ended Network Certification TV-Y7 Meaning This program is designed for children age 7 and above. Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Animation Comedy Drama Sci-Fi & Fantasy Keywords based on video game anime Content Score 86 Almost there... Top Contributors 29 TheOneManBoxOffice z 10 zurman1 s 7 speedycars b 4 benqen  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}