{"link": "https://www.themoviedb.org/tv/2622?language=en", "title": "The Universe", "resume": "The Universe is an American documentary television series that features computer-generated imagery and computer graphics of astronomical objects in the universe plus interviews with experts who study in the fields of cosmology, astronomy, and astrophysics. The program is produced by Flight 33 Productions and Workaholic Productions.\nThe series premiered on May 29, 2007, on The History Channel and four subsequent seasons were aired until 2010. Starting from October 25, 2011, new episodes began airing exclusively on H2.", "rate": 84, "genre": ["Documentary"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2622   Expand The Universe   (2007) User Score Overview The Universe is an American documentary television series that features computer-generated imagery and computer graphics of astronomical objects in the universe plus interviews with experts who study in the fields of cosmology, astronomy, and astrophysics. The program is produced by Flight 33 Productions and Workaholic Productions. The series premiered on May 29, 2007, on The History Channel and four subsequent seasons were aired until 2010. Starting from October 25, 2011, new episodes began airing exclusively on H2. Featured Crew Erik Thompson Creator Alex Filippenko Creator Laura Danly Creator Clifford V. Johnson Creator Neil deGrasse Tyson Creator Michelle Thaller Creator Michio Kaku Creator Lawrence Krauss Creator Geoff Marcy Creator Phil Plait Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  7 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season season 9 2015 | 6 Episodes Season 9 of The Universe premiered on April 18, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  11 Posters  7 Recommendations   2012-09-13 Stephen Hawking's Grand Design 7.3    2010-04-25 Into the Universe with Stephen Hawking 7.6    1997-01-13 La Femme Nikita 7.2    2016-11-30 Incorporated 6.1    1995-03-22 Sliders 7.0    2010-06-09 Through the Wormhole 7.6    1967-09-29 The Prisoner 7.6    1995-03-26 The Outer Limits 8.0  Facts Status  In Production Networks Certification  - Type  Documentary Original Language  English Runtime  45m Homepage   http://www.history.com/shows/the-universe Genres Documentary Keywords galaxy technology universe science espace Content Score 64 We're so close, yet so far. Top Contributors 36 Elizabeth Jennings o 23 obseso C 22 CossiTD 16 waaw  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}