{"link": "https://www.themoviedb.org/tv/1803?language=en", "title": "The Facts of Life", "resume": "The Facts of Life is an American sitcom that originally ran on the NBC television network from August 24, 1979, to May 7, 1988, making it the longest running sitcom of the 1980s. A spin-off of the sitcom Diff'rent Strokes, the series' premise focuses on Edna Garrett as she becomes a housemother at the fictional Eastland School, an all-female boarding school in Peekskill, New York.", "rate": 57, "genre": ["Drama", "Comedy"], "cast": ["Cloris Leachman", "Lisa Whelchel", "Kim Fields", "Mindy Cohn", "Mackenzie Astin"], "character": ["Beverly Ann Stickle", "Blair Warner", "Tootie Ramsey", "Natalie Green", "Andy Moffett"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 1803   Expand The Facts of Life   (1979) User Score Overview The Facts of Life is an American sitcom that originally ran on the NBC television network from August 24, 1979, to May 7, 1988, making it the longest running sitcom of the 1980s. A spin-off of the sitcom Diff'rent Strokes, the series' premise focuses on Edna Garrett as she becomes a housemother at the fictional Eastland School, an all-female boarding school in Peekskill, New York. Featured Crew Norman Lear Creator Dick Clair Creator Jenna McMahon Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  23 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cloris Leachman Beverly Ann Stickle Lisa Whelchel Blair Warner Kim Fields Tootie Ramsey Mindy Cohn Natalie Green Mackenzie Astin Andy Moffett Full Cast & Crew Last Season Season 9 1987 | 24 Episodes Season 9 of The Facts of Life premiered on September 26, 1987. View All Seasons Social Reviews  0 Discussions  23 Subject Status Replies Last Reply S Beverley Anne Open 5 by  Stand*Chickie \"Look at me? Patty Hearst had an easier ride!\" Open 0 by Stand*Chickie\n      \n     S Gone with the wind 1 & 2; She's in a different world Open 9 by  Stand*Chickie Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations   1975-01-18 The Jeffersons 6.7    1982-09-25 Silver Spoons 5.1    1976-01-27 Laverne & Shirley 6.7    1963-09-29 My Favorite Martian 5.4    1989-09-19 Doogie Howser, M.D. 5.7    1978-11-03 Diff'rent Strokes 5.7    1977-03-15 Three's Company 7.3    1983-09-16 Webster 4.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 22m Homepage  - Genres Drama Comedy Keywords boarding school wealthy sitcom all girls school Content Score 93 Almost there... Top Contributors 53 SJJM4EVER 14 lineker 11 Banana 9 Steve  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}