{"link": "https://www.themoviedb.org/tv/69480?language=en", "title": "Mary Kills People", "resume": "Dr. Mary Harris, a single mother and emergency doctor by day, also moonlights as an underground angel of death - helping terminally ill patients who want to die and slip away on their own terms. So far Mary has managed to stay under the radar; but business is booming, and her double life is getting complicated. When her world starts to unravel, Mary realizes she's going to have to fight dirty if she's going to stay in the killing game.", "rate": 76, "genre": ["Drama"], "cast": ["Caroline Dhavernas", "Jay Ryan", "Richard Short", "Rachelle Lefevre", "Abigail Winter"], "character": ["Dr. Mary Harris", "Joel Collins / Detective Ben Wesley", "Desmond \"Des\" Bennett", "Olivia Bloom", "Jessica \"Jess\" Geller"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69480   Expand Mary Kills People   (2017) User Score  Play Trailer Overview Dr. Mary Harris, a single mother and emergency doctor by day, also moonlights as an underground angel of death - helping terminally ill patients who want to die and slip away on their own terms. So far Mary has managed to stay under the radar; but business is booming, and her double life is getting complicated. When her world starts to unravel, Mary realizes she's going to have to fight dirty if she's going to stay in the killing game. Featured Crew Tara Armstrong Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  18 Posters  8 Videos Trailers  1 Teasers  1 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Caroline Dhavernas Dr. Mary Harris Jay Ryan Joel Collins / Detective Ben Wesley Richard Short Desmond \"Des\" Bennett Rachelle Lefevre Olivia Bloom Abigail Winter Jessica \"Jess\" Geller Full Cast & Crew Current Season Season 2 2018 | 6 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  2 Backdrops  18 Posters  8 Recommendations   2016-01-22 Stan Lee's Lucky Man 7.3    2013-04-03 Rogue 7.1    2018-02-11 Here and Now 7.7    2016-10-09 Divorce 6.1    2017-11-05 SMILF 6.7    2016-10-13 Falling Water 6.6    2016-08-18 I Love Dick 5.2    2016-09-22 Notorious 5.8  Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  60m, 45m Homepage   http://globaltv.com/marykillspeople Genres Drama Keywords doctor medical drama assisted suicide angel of death Content Score 100 Yes! Looking good! Top Contributors 235 janar 60 Banana m 7 misfit_noel TB 4 TMDb Bot  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}