{"link": "https://www.themoviedb.org/tv/732?language=en", "title": "L.A. Law", "resume": "L.A. Law is an American television legal drama series that ran for eight seasons on NBC from September 15, 1986, to May 19, 1994.\nCreated by Steven Bochco and Terry Louise Fisher, it contained many of Bochco's trademark features including a large number of parallel storylines, social drama and off-the-wall humor. It reflected the social and cultural ideologies of the 1980s and early 1990s, and many of the cases featured on the show dealt with hot-topic issues such as abortion, racism, gay rights, homophobia, sexual harassment, AIDS, and domestic violence. The series often also reflected social tensions between the wealthy senior lawyer protagonists and their less well-paid junior staff.\nThe show was popular with audiences and critics, and won 15 Emmy Awards throughout its run, four of which were for Outstanding Drama Series.", "rate": 72, "genre": ["Drama"], "cast": ["Corbin Bernsen", "Jill Eikenberry", "Alan Rachins", "Michael Tucker", "Richard Dysart"], "character": ["Arnie Becker", "Ann Kelsey", "Douglas Brackman", "Stuart Markowitz", "Leland McKenzie"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 732   Expand L.A. Law   (1986) User Score Overview L.A. Law is an American television legal drama series that ran for eight seasons on NBC from September 15, 1986, to May 19, 1994. Created by Steven Bochco and Terry Louise Fisher, it contained many of Bochco's trademark features including a large number of parallel storylines, social drama and off-the-wall humor. It reflected the social and cultural ideologies of the 1980s and early 1990s, and many of the cases featured on the show dealt with hot-topic issues such as abortion, racism, gay rights, homophobia, sexual harassment, AIDS, and domestic violence. The series often also reflected social tensions between the wealthy senior lawyer protagonists and their less well-paid junior staff. The show was popular with audiences and critics, and won 15 Emmy Awards throughout its run, four of which were for Outstanding Drama Series. Featured Crew Steven Bochco Creator Terry Louise Fisher Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  6 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Corbin Bernsen Arnie Becker Jill Eikenberry Ann Kelsey Alan Rachins Douglas Brackman Michael Tucker Stuart Markowitz Richard Dysart Leland McKenzie Full Cast & Crew Last Season Season 8 1993 | 23 Episodes Season 8 of L.A. Law premiered on October  7, 1993. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply w Arnie Becker: Happy Birthday Corbin Bernsen! Open 0 by wonder2wonder\n      \n     w Jonathan Rollins: Happy Birthday Blair Underwood! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  6 Posters  2 Recommendations   1985-01-31 Night Heat 7.3    1982-09-26 Matt Houston 6.6    1991-09-08 Herman's Head 5.9    2006-08-07 Gene Simmons Family Jewels 4.4    1983-10-03 Scarecrow and Mrs. King 5.5    1984-03-19 Kate & Allie 5.3    1982-03-25 Cagney & Lacey 6.0    1998-10-23 Brimstone 7.6  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  45m, 60m Homepage  - Genres Drama Keywords lawyer los angeles law firm Content Score 93 Almost there... Top Contributors 13 lineker m 11 mode2 8 Banana 3 niqo19  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}