{"link": "https://www.themoviedb.org/tv/47?language=en", "title": "El Chavo del Ocho", "resume": "El Chavo del Ocho is a Mexican television sitcom that gained enormous popularity in Spanish America as well as in Brazil, Spain, United States and other countries. It centers around the adventures and tribulations of the title character, El Chavo — a poor orphan played by the show's creator, Roberto Gómez Bolaños, and other inhabitants of a fictional housing complex, or, as called in Spanish, vecindad.\nThe show traces back to May 1972, where it appeared as a sketch in the \"Chespirito\" show, produced by \"Televisión Independiente de Mexico\", broadcast on Mexico's Canal 8, XHTIM-TV. In 1975, El Chavo moved to Televisa and became a weekly half-hour series. The show was cancelled in 1980, but shorts were still produced in Chespirito from that year until 1992. At its peak of popularity during the mid-1970s, El Chavo, having 350 million viewers worldwide, was the most watched show in Mexican television.\nThe frequent occurrence of Mexican idiomatic expressions makes El Chavo del Ocho very hard to translate into other languages, save for Portuguese which is similar to Spanish. Theme music for the series was \"The Elephant Never Forgets\", a playful version of Beethoven's \"Turkish March\" in 1967 by electronic music pioneers Perrey and Kingsley.", "rate": 85, "genre": ["Comedy"], "cast": ["Roberto Gómez Bolaños", "Carlos Villagrán", "María Antonieta de las Nieves", "Ramón Valdés", "Florinda Meza García"], "character": ["El Chavo", "Quico", "La Chilindrina", "Don Ramón", "Doña Florinda"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 47   Expand El Chavo del Ocho   (1972) User Score Overview El Chavo del Ocho is a Mexican television sitcom that gained enormous popularity in Spanish America as well as in Brazil, Spain, United States and other countries. It centers around the adventures and tribulations of the title character, El Chavo — a poor orphan played by the show's creator, Roberto Gómez Bolaños, and other inhabitants of a fictional housing complex, or, as called in Spanish, vecindad. The show traces back to May 1972, where it appeared as a sketch in the \"Chespirito\" show, produced by \"Televisión Independiente de Mexico\", broadcast on Mexico's Canal 8, XHTIM-TV. In 1975, El Chavo moved to Televisa and became a weekly half-hour series. The show was cancelled in 1980, but shorts were still produced in Chespirito from that year until 1992. At its peak of popularity during the mid-1970s, El Chavo, having 350 million viewers worldwide, was the most watched show in Mexican television. The frequent occurrence of Mexican idiomatic expressions makes El Chavo del Ocho very hard to translate into other languages, save for Portuguese which is similar to Spanish. Theme music for the series was \"The Elephant Never Forgets\", a playful version of Beethoven's \"Turkish March\" in 1967 by electronic music pioneers Perrey and Kingsley. Featured Crew Roberto Gómez Bolaños Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  3 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Roberto Gómez Bolaños El Chavo Carlos Villagrán Quico María Antonieta de las Nieves La Chilindrina Ramón Valdés Don Ramón Florinda Meza García Doña Florinda Full Cast & Crew Last Season Season 3 1974 | 32 Episodes Season 3 of El Chavo del Ocho premiered on July 24, 1974. View All Seasons Social Reviews  0 Discussions  3 Subject Status Replies Last Reply There are no discussions for El Chavo del Ocho. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations   1972-04-11 El Chapulín Colorado 8.3    2006-10-21 El Chavo: The Animated Series 5.3    2003-07-06 Pasión de gavilanes 5.6    2004-10-04 Rebelde 6.5    1984-09-15 The Get Along Gang 8.0    2016-03-21 72 Dangerous Places to Live 6.0    2004-05-17 Rubí 8.0    1989-09-04 The Super Mario Bros. Super Show! 5.9  Facts Status  Ended Networks Certification L Meaning Content is suitable for all audiences. Type  Scripted Original Language  Spanish; Castilian Runtime  30m Homepage   http://chespirito.com/ Genres Comedy Keywords orphan neighborhood sitcom adult as a child Content Score 93 Almost there... Top Contributors 99 RubeensVinicius 14 awmbaptista 7 Kcarinas w 7 wdrp88  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}