{"link": "https://www.themoviedb.org/tv/68000?language=en", "title": "Training Day", "resume": "Fifteen years after the events of the feature film, Kyle Craig is assigned to go undercover in an elite squad of the LAPD as Detective Frank Rourke’s trainee to spy on him and report on his off-book methods. As Frank starts teaching his principled trainee the way of the streets, they form an uneasy alliance that will change the course of both their lives irrevocably.", "rate": 62, "genre": ["Crime", "Drama"], "cast": ["Bill Paxton", "Justin Cornwell", "Katrina Law", "Drew Van Acker", "Julie Benz"], "character": ["Frank Rourke", "Kyle Craig", "Rebecca Lee", "Tommy Campbell", "Holly Butler"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68000   Expand Training Day   (2017) User Score  Play Trailer Overview Fifteen years after the events of the feature film, Kyle Craig is assigned to go undercover in an elite squad of the LAPD as Detective Frank Rourke’s trainee to spy on him and report on his off-book methods. As Frank starts teaching his principled trainee the way of the streets, they form an uneasy alliance that will change the course of both their lives irrevocably. Featured Crew Will Beall Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  5 Content Issues  0 Images Backdrops  7 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Bill Paxton Frank Rourke Justin Cornwell Kyle Craig Katrina Law Rebecca Lee Drew Van Acker Tommy Campbell Julie Benz Holly Butler Full Cast & Crew Last Season Season 1 2017 | 13 Episodes Season 1 of Training Day premiered on February  2, 2017. View All Seasons Social Reviews  0 Discussions  5 Subject Status Replies Last Reply CW TD moved to Saturdays now Open 1 by  fonzie Episode 5 out, whos gonna watch? Open 2 by  MrRadical RIP BILL Open 3 by  HandsomeDan Go to Discussions Media Most Popular Videos  1 Backdrops  7 Posters  2 Recommendations   2016-01-22 Stan Lee's Lucky Man 7.3    2017-09-26 Law & Order True Crime 6.1    2016-10-16 Berlin Station 7.4    2016-03-07 Damien 6.5    2016-03-16 Criminal Minds: Beyond Borders 5.7    2017-03-05 The Arrangement 5.3    2017-02-27 Taken 6.1    2017-01-18 SIX 7.1  Facts Status  Cancelled Network Certification  - Type  Scripted Original Language  English Runtime  42m Homepage   http://www.cbs.com/shows/training-day/ Genres Crime Drama Keywords police dirty cop based on movie lapd Content Score 100 Yes! Looking good! Top Contributors p 27 paf69 17 Banana 17 Imzadi 6 MrRadical  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}