{"link": "https://www.themoviedb.org/tv/2035?language=en", "title": "20/20", "resume": "20/20 is an American television newsmagazine that has been broadcast on ABC since June 6, 1978. Created by ABC News executive Roone Arledge, the show was designed similarly to CBS's 60 Minutes but focuses more on human interest stories than international and political subjects. The program's name derives from the \"20/20\" measurement of visual acuity.\nThe hour-long program has been a staple on Friday evenings for much of the time since it moved to that timeslot from Thursdays in September 1987, though special editions of the program occasionally air on other nights.", "rate": 86, "genre": ["News"], "cast": ["Chris Wallace", "Cynthia McFadden", "Deborah Roberts", "Diane Sawyer", "Elizabeth Vargas"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2035   Expand 20/20   (1978) User Score  Play Trailer Overview 20/20 is an American television newsmagazine that has been broadcast on ABC since June 6, 1978. Created by ABC News executive Roone Arledge, the show was designed similarly to CBS's 60 Minutes but focuses more on human interest stories than international and political subjects. The program's name derives from the \"20/20\" measurement of visual acuity. The hour-long program has been a staple on Friday evenings for much of the time since it moved to that timeslot from Thursdays in September 1987, though special editions of the program occasionally air on other nights. Featured Crew Roone Arledge Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  2 Content Issues  0 Images Backdrops  2 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chris Wallace Cynthia McFadden Deborah Roberts Diane Sawyer Elizabeth Vargas Full Cast & Crew Last Season Season 40 — | 1 Episode We don't have an overview translated in English. Help us expand our database by adding one. View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply b McAfee Open 0 by bgirlmagic\n      \n     b Tad Cummins Open 0 by bgirlmagic\n      \n     Go to Discussions Media Most Popular Videos  1 Backdrops  2 Posters  2 Recommendations   1988-01-19 48 Hours 7.3    1979-02-11 60 Minutes 7.4    2010-09-26 Sister Wives 4.8    1991-09-09 Maury 3.8    1992-03-31 Dateline NBC 4.3    2014-03-11 Chrisley Knows Best 6.6    60 Minutes 7.5    1996-03-29 Nash Bridges 6.5  Facts Status  Returning Series Network Certification  - Type  Scripted Original Language  English Runtime  40m Homepage   http://www.abcnews.go.com/2020/ Genres News Keywords magazine show Content Score 100 Yes! Looking good! Top Contributors 3 Elizabeth Jennings 2 amian123 r 2 rbcs99@aol.com R 1 Raya212  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}