{"link": "https://www.themoviedb.org/tv/20757?language=en", "title": "Stitch!", "resume": "Stitch! is the anime adaptation of the animated feature film Lilo & Stitch and the successor for the Lilo & Stitch series by Walt Disney Animation Studios. It takes place after leroy and stitch and debuted in Japan on October 2008. The show features a Japanese girl named Yuna in place of Lilo, and is set on a fictional island in the Ryukyus off the shore of Okinawa instead of Hawaii. The island is called Izayoi. A second anime season, called Stitch! ~The Mischievous Alien's Great Adventure! began airing in Japan on October 13, 2009. A third yet different series from the first two season anime, entitled Stitch! ~Best Friends Forever~ aired on TV Asahi on July 6, 2010.\nThe first season began airing under the English language on the Australian Disney Channel on 4 December 2009, and went to also air in English later on Disney Channel Asia December 19, 2009. The first season premiered on Disney Channel Latin America on May 2, 2010, in Latin Spanish dub. The Second season premiered on Disney Channel Latin America on June 6, 2011. The Third Season premiered on Disney Channel Latin America on August 20, 2012.", "rate": 0, "genre": ["Animation", "Comedy", "Sci-Fi", "Fantasy"], "cast": [], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 20757   Expand Stitch!   (2008) User Score Overview Stitch! is the anime adaptation of the animated feature film Lilo & Stitch and the successor for the Lilo & Stitch series by Walt Disney Animation Studios. It takes place after leroy and stitch and debuted in Japan on October 2008. The show features a Japanese girl named Yuna in place of Lilo, and is set on a fictional island in the Ryukyus off the shore of Okinawa instead of Hawaii. The island is called Izayoi. A second anime season, called Stitch! ~The Mischievous Alien's Great Adventure! began airing in Japan on October 13, 2009. A third yet different series from the first two season anime, entitled Stitch! ~Best Friends Forever~ aired on TV Asahi on July 6, 2010. The first season began airing under the English language on the Australian Disney Channel on 4 December 2009, and went to also air in English later on Disney Channel Asia December 19, 2009. The first season premiered on Disney Channel Latin America on May 2, 2010, in Latin Spanish dub. The Second season premiered on Disney Channel Latin America on June 6, 2011. The Third Season premiered on Disney Channel Latin America on August 20, 2012. Featured Crew Masami Hata Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  4 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast We don't have any cast added to this TV Show. You can help by adding some! Login to Edit Cast & Crew Last Season Season 3 - Best Friends Forever 2010 | 30 Episodes Season 3 of Stitch! premiered on July  6, 2010. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  4 Recommendations We don't have enough data to suggest any TV shows based on Stitch!. You can help by rating TV shows you've seen. Facts Original Name  スティッチ! Status  Ended Network Certification 6+ Meaning Only kids the age of 6 or older can watch. Type  Scripted Original Language  Japanese Runtime  22m Homepage   http://www.disney.com.tw/DisneyChannel/supersites/stitch/index.html Genres Animation Comedy Sci-Fi & Fantasy Keywords No keywords have been added. Content Score 64 We're so close, yet so far. Top Contributors В 15 Вадим D 10 Doramius CM 8 Cherche Moi 5 disneyvn  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}