{"link": "https://www.themoviedb.org/tv/61554?language=en", "title": "The Knight", "resume": "De Ridder is a Flemish crime series that is broadcasted by the network één since 2013. The series is set in the court of Ghent where Helena De Ridder, played by Clara Cleymans, is a public prosecutor.", "rate": 83, "genre": ["Drama", "Crime"], "cast": ["Clara Cleymans", "Dahlia Pessemiers", "Michael Pas", "Michael Vergauwen", "Katelijne Damen"], "character": ["Helena De Ridder", "Zohra El Zarkaoui", "Yves Bracke", "Manu Coppens", "Christine Bogaerts"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61554   Expand The Knight   (2013) User Score Overview De Ridder is a Flemish crime series that is broadcasted by the network één since 2013. The series is set in the court of Ghent where Helena De Ridder, played by Clara Cleymans, is a public prosecutor. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Clara Cleymans Helena De Ridder Dahlia Pessemiers Zohra El Zarkaoui Michael Pas Yves Bracke Michael Vergauwen Manu Coppens Katelijne Damen Christine Bogaerts Full Cast & Crew Last Season Season 4 2016 | 4 Episodes Season 4 of The Knight premiered on September  9, 2016. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on The Knight. You can help by rating TV shows you've seen. Facts Original Name  De Ridder Status  Ended Networks - Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  50m Homepage   http://www.een.be/programmas/de-ridder/ Genres Drama Crime Keywords lawyer prosecutor Content Score 86 Almost there... Top Contributors 29 Elizabeth Jennings 4 Alwin Hummels 4 ☮ m 2 mitati  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}