{"link": "https://www.themoviedb.org/tv/62856?language=en", "title": "The Real O'Neals", "resume": "A contemporary take on a seemingly perfect Catholic family, whose lives take an unexpected turn when surprising truths are revealed. Instead of ruining their family, the honesty triggers a new, messier chapter where everyone stops pretending to be perfect and actually starts being real.", "rate": 77, "genre": ["Comedy"], "cast": ["Martha Plimpton", "Jay R. Ferguson", "Noah Galvin", "Matt Shively", "Bebe Wood"], "character": ["Eileen O'Neal", "Pat O'Neal", "Kenny O'Neal", "Jimmy O'Neal", "Shannon O'Neal"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 62856   Expand The Real O'Neals   (2016) User Score Overview A contemporary take on a seemingly perfect Catholic family, whose lives take an unexpected turn when surprising truths are revealed. Instead of ruining their family, the honesty triggers a new, messier chapter where everyone stops pretending to be perfect and actually starts being real. Featured Crew Joshua Sternin Creator Jennifer Ventimilia Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  0 Images Backdrops  5 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Martha Plimpton Eileen O'Neal Jay R. Ferguson Pat O'Neal Noah Galvin Kenny O'Neal Matt Shively Jimmy O'Neal Bebe Wood Shannon O'Neal Full Cast & Crew Last Season Season 2 2016 | 16 Episodes Season 2 of The Real O'Neals premiered on October 11, 2016. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply I wasn't aware this got cancelled, LOL Open 0 by Stand*Chickie\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  5 Posters  3 Recommendations   2015-01-22 Cucumber 7.9    2016-10-19 HIM 6.2    2016-01-13 Teachers 7.1    2016-03-01 Loosely Exactly Nicole 5.8    2015-01-22 Banana 7.8    2014-07-17 Married 6.3    2016-03-15 Crowded 6.4    2016-10-11 American Housewife 7.1  Facts Status  Cancelled Network Certification TV-PG Meaning This program contains material that parents may find unsuitable for younger children. Type  Scripted Original Language  English Runtime  23m Homepage   http://abc.go.com/shows/the-real-oneals Genres Comedy Keywords gay son family catholic lgbt lgbt teen sitcom Content Score 93 Almost there... Top Contributors 49 Banana 37 Elizabeth Jennings 7 roimidas 6 henriquesene  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}