{"link": "https://www.themoviedb.org/tv/12998?language=en", "title": "Heartbreak High", "resume": "Heartbreak High is a popular Australian television series that ran for five years from 1994 to 1999. The series dealt with the students of Hartley High, a tough high school in a multi-racial area of Sydney, and proved to be a more gritty and fast-paced show than many of its contemporaries. It was a spin-off of the 1993 Australian feature film The Heartbreak Kid which had featured Alex Dimitriades and Claudia Karvan. However, in later seasons the show shifted emphasis away from the school setting and the Poulos Family to the students' homes and hangout - the Shark Pool.", "rate": 63, "genre": ["Drama"], "cast": ["Rel Hunt", "Callan Mulvey", "Putu Winchester", "Nathalie Roy"], "character": ["Ryan Scheppers", "Drazic", "Dennis Klinsmann", "Sarah Livingstone"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12998   Expand Heartbreak High   (1994) User Score Overview Heartbreak High is a popular Australian television series that ran for five years from 1994 to 1999. The series dealt with the students of Hartley High, a tough high school in a multi-racial area of Sydney, and proved to be a more gritty and fast-paced show than many of its contemporaries. It was a spin-off of the 1993 Australian feature film The Heartbreak Kid which had featured Alex Dimitriades and Claudia Karvan. However, in later seasons the show shifted emphasis away from the school setting and the Poulos Family to the students' homes and hangout - the Shark Pool. Featured Crew Andrew Prowse Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Rel Hunt Ryan Scheppers Callan Mulvey Drazic Putu Winchester Dennis Klinsmann Nathalie Roy Sarah Livingstone Full Cast & Crew Last Season Season 7 2000 | 1 Episode Season 7 of Heartbreak High premiered on January 12, 2000. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Heartbreak High. You can help by rating TV shows you've seen. Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  50m, 45m Homepage  - Genres Drama Keywords sydney australia high school teenager based on movie teen drama Content Score 93 Almost there... Top Contributors c 153 courtneysmith86 5 17 5lucina5 10 Banana a 6 adltata  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}