{"link": "https://www.themoviedb.org/tv/12500?language=en", "title": "Rainbow", "resume": "Children's puppet programme featuring music and stories. Join George, Bungle, Zippy, and all their friends at the Rainbow House, always an exciting place to be.", "rate": 76, "genre": ["Comedy", "Kids"], "cast": ["Dawn Bowden", "Malcolm Lord", "Roy Skelton", "Geoffrey Hayes"], "character": ["Herself", "Bungle", "Zippy / George (voice)", "Himself"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 12500   Expand Rainbow   (1972) User Score Overview Children's puppet programme featuring music and stories. Join George, Bungle, Zippy, and all their friends at the Rainbow House, always an exciting place to be. Featured Crew Pamela Lonsdale Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  1 Content Issues  4 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Dawn Bowden Herself Malcolm Lord Bungle Roy Skelton Zippy / George (voice) Geoffrey Hayes Himself Full Cast & Crew Last Season Season 23 1991 | 24 Episodes View All Seasons Social Reviews  0 Discussions  2 Subject Status Replies Last Reply I could never work it out Open 0 by emrabt\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations   1982-11-01 SuperTed 6.8    1980-12-08 Button Moon 6.8    1987-09-26 ChuckleVision 6.3    1986-05-01 Bread 7.4    1988-09-06 Count Duckula 6.9    1990-02-15 The Crystal Maze 7.2    1978-02-24 Going Straight 7.3    1993-01-27 The Detectives 7.1  Facts Status  Cancelled Network Certification U Meaning The U symbol stands for Universal. A U film should be suitable for audiences aged four years and over. Type  Scripted Original Language  English Runtime  20m, 15m Homepage  - Genres Comedy Kids Keywords puppet british anthropomorphism educational Content Score 93 Almost there... Top Contributors N 401 Notamymerrick d 16 d3anwh1te c 8 cliveski 8 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}