{"link": "https://www.themoviedb.org/tv/3266?language=en", "title": "North and South", "resume": "Two friends, one northern and one southern, struggle to maintain their friendship as events build towards the American Civil War.", "rate": 73, "genre": ["Drama"], "cast": ["James Read", "Patrick Swayze", "Lesley-Anne Down", "Philip Casnoff", "Kirstie Alley"], "character": ["George Hazard", "Orry Main", "Madeline Fabray LaMotte", "Elkanah Bent", "Virgilia Hazard"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 3266   Expand North and South   (1985) User Score Overview Two friends, one northern and one southern, struggle to maintain their friendship as events build towards the American Civil War. Featured Crew David L. Wolper Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  7 Posters  6 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast James Read George Hazard Patrick Swayze Orry Main Lesley-Anne Down Madeline Fabray LaMotte Philip Casnoff Elkanah Bent Kirstie Alley Virgilia Hazard Full Cast & Crew Last Season Book III 1994 | 3 Episodes Season 3 of North and South premiered on February 26, 1994. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  7 Posters  6 Recommendations   1987-01-29 Das Erbe der Guldenburgs 3.0    1980-09-15 Shogun 7.5    1978-10-01 Centennial 7.7    1987-11-10 Napoleon and Josephine: A Love Story 7.0    1922-09-10 Our Gang 7.6    1984-02-26 Lace 6.8    1981-04-05 Masada 4.5    1986-10-24 Shaka Zulu 5.4  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  - Homepage  - Genres Drama Keywords civil war miniseries racism period drama american civil war costume drama 19th century Content Score 93 Almost there... Top Contributors 32 Banana TB 19 TMDb Bot s 14 steelman1991 12 lineker  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}