{"link": "https://www.themoviedb.org/tv/77721?language=en", "title": "Real Girl", "resume": "Tsutsui Hikari (a.k.a \"Tsuttsun\") is a high school student who is content with his virtual life of anime and video games. One day, he gets stuck cleaning the pool with Iroha, a real live girl who is stylish, sassy and known to be easy with boys ... and she aggressively approaches him! Tsuttsun, who has few friends and lives in his own world, finds himself smitten by the confident and wild Iroha ... and his whole world is turned upside down!! It's the awkward and pure love story of a boy who experiences relationship for the first time.", "rate": 70, "genre": ["Animation"], "cast": ["Uenishi Teppei", "Yuu Serizawa", "Reina Ueda", "Sayaka Kanda", "Minami Tsuda"], "character": ["Hikaru Tsutsui (Voice)", "Iroha Igarashi (Voice)", "Sumie Ayado (Voice)", "Ezomichi (Voice)", "Arisa Ishino (Voice)"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 77721   Expand Real Girl   (2018) User Score  Play Trailer Overview Tsutsui Hikari (a.k.a \"Tsuttsun\") is a high school student who is content with his virtual life of anime and video games. One day, he gets stuck cleaning the pool with Iroha, a real live girl who is stylish, sassy and known to be easy with boys ... and she aggressively approaches him! Tsuttsun, who has few friends and lives in his own world, finds himself smitten by the confident and wild Iroha ... and his whole world is turned upside down!! It's the awkward and pure love story of a boy who experiences relationship for the first time. Featured Crew Takashi Naoya Creator Deko Akao Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Uenishi Teppei Hikaru Tsutsui (Voice) Yuu Serizawa Iroha Igarashi (Voice) Reina Ueda Sumie Ayado (Voice) Sayaka Kanda Ezomichi (Voice) Minami Tsuda Arisa Ishino (Voice) Full Cast & Crew Current Season Season 1 2018 | 12 Episodes Season 1 of Real Girl premiered on April  4, 2018. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Real Girl. Login to be first! Go to Discussions Media Most Popular Videos  1 Backdrops  3 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Real Girl. You can help by rating TV shows you've seen. Facts Original Name  ３Ｄ彼女　リアルガール Status  Returning Series Network Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.3dkanojo-anime.com/ Genres Animation Keywords high school romance based on manga school life Content Score 100 Yes! Looking good! Top Contributors 38 neonime 14 sp1ti 6 Despair-Paradise 5 無情天  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}