{"link": "https://www.themoviedb.org/tv/68735?language=en", "title": "Ice", "resume": "A diamond dealer navigates the culturally diverse and treacherous world of the diamond business.", "rate": 83, "genre": ["Drama", "Crime"], "cast": ["Cam Gigandet", "Jeremy Sisto", "Ray Winstone", "Audrey Marie Anderson", "Judi Shekoni"], "character": ["Jake Green / Jake Pierce", "Freddy Green", "Cam Rose", "Ava Green", "Sister Rah / Lady Rah"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 68735   Expand Ice   (2016) User Score  Play Trailer Overview A diamond dealer navigates the culturally diverse and treacherous world of the diamond business. Featured Crew Robert Munic Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  11 Posters  2 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Cam Gigandet Jake Green / Jake Pierce Jeremy Sisto Freddy Green Ray Winstone Cam Rose Audrey Marie Anderson Ava Green Judi Shekoni Sister Rah / Lady Rah Full Cast & Crew Current Season Season 2 2018 | 10 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  1 Backdrops  11 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Ice. You can help by rating TV shows you've seen. Facts Status  Returning Series Network Certification TV-MA Meaning This program is specifically designed to be viewed by adults and therefore may be unsuitable for children under 17 Type  Scripted Original Language  English Runtime  45m Homepage   http://ice.directv.com/ Genres Drama Crime Keywords diamond heist Content Score 100 Yes! Looking good! Top Contributors 36 joeynotjoe 22 Kecla 18 Elizabeth Jennings m 5 mahlenadelga  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}