{"link": "https://www.themoviedb.org/tv/14085?language=en", "title": "King Sejong the Great", "resume": "King Sejong the Great is a 2008 South Korean historical television series depicting the life of the fourth king of Joseon, Sejong the Great. Considered one of the greatest kings in Korean history, Sejong created Hangul, the Korean alphabet. The series aired on Korean Broadcasting System from January 5 to December 7, 2008 on Saturdays and Sundays at 21:30 for 86 episodes. Episodes 1 to 26 aired on KBS1, and episodes 27 to 86 aired on KBS2.", "rate": 70, "genre": ["Drama"], "cast": ["Kim Sang-kyung", "Kim Yeong-cheol", "Kim Kap-soo", "Lee Won-Jong", "Lee Chun-hee"], "character": ["King Sejong the Great", "King Taejong", "Prime Minister Hwang Hui", "Yun Hee", "Jang Yeong-sil"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 14085   Expand King Sejong the Great   (2008) User Score Overview King Sejong the Great is a 2008 South Korean historical television series depicting the life of the fourth king of Joseon, Sejong the Great. Considered one of the greatest kings in Korean history, Sejong created Hangul, the Korean alphabet. The series aired on Korean Broadcasting System from January 5 to December 7, 2008 on Saturdays and Sundays at 21:30 for 86 episodes. Episodes 1 to 26 aired on KBS1, and episodes 27 to 86 aired on KBS2. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  3 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kim Sang-kyung King Sejong the Great Kim Yeong-cheol King Taejong Kim Kap-soo Prime Minister Hwang Hui Lee Won-Jong Yun Hee Lee Chun-hee Jang Yeong-sil Full Cast & Crew Last Season Season 1 2008 | 86 Episodes Season 1 of King Sejong the Great premiered on January  5, 2008. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for King Sejong the Great. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  3 Posters  1 Recommendations We don't have enough data to suggest any TV shows based on King Sejong the Great. You can help by rating TV shows you've seen. Facts Original Name  대왕 세종 Status  Ended Network Certification  - Type  Scripted Original Language  Korean Runtime  50m Homepage   http://www.kbs.co.kr/drama/3jong/ Genres Drama Keywords historical figure korea historical drama Content Score 86 Almost there... Top Contributors t 36 tmdb38202327 6 animerika 3 Zlogorek 1 Banana  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}