{"link": "https://www.themoviedb.org/tv/2284?language=en", "title": "Teenage Mutant Ninja Turtles", "resume": "Teenage Mutant Ninja Turtles is an American animated television series, mainly set in New York City. It first aired on February 8, 2003 and ended on February 28, 2009. The series marked the revival of the franchise as a Saturday morning cartoon on Fox's Fox Box programming block The TMNT 2003 TV series was produced by 4Kids Entertainment, and Mirage Studios, which each owned half of the rights to the show, and animated by Dong Woo Animation. Reruns ran on Cartoon Network's Miguzi block in 2004. The series migrated to The CW4Kids in its final season after 4Kids's contract with Fox ended. Nickelodeon now owns the rights to this and any future Turtles series.", "rate": 70, "genre": ["Action", "Adventure", "Animation"], "cast": ["Veronica Taylor", "Wayne Grayson", "Darren Dunstan", "Sam Riegel", "Marc Thompson"], "character": [], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 2284   Expand Teenage Mutant Ninja Turtles   (2003) User Score Overview Teenage Mutant Ninja Turtles is an American animated television series, mainly set in New York City. It first aired on February 8, 2003 and ended on February 28, 2009. The series marked the revival of the franchise as a Saturday morning cartoon on Fox's Fox Box programming block The TMNT 2003 TV series was produced by 4Kids Entertainment, and Mirage Studios, which each owned half of the rights to the show, and animated by Dong Woo Animation. Reruns ran on Cartoon Network's Miguzi block in 2004. The series migrated to The CW4Kids in its final season after 4Kids's contract with Fox ended. Nickelodeon now owns the rights to this and any future Turtles series. Featured Crew Kevin Eastman Creator Peter Laird Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  2 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Veronica Taylor Wayne Grayson Darren Dunstan Sam Riegel Marc Thompson Full Cast & Crew Last Season Season 7 2008 | 13 Episodes View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  2 Posters  1 Recommendations   2004-12-18 W.I.T.C.H. 6.6    2003-09-20 Lilo & Stitch: The Series 6.0    2003-11-01 Tutenstein 6.1    1998-09-06 Tweenies 2.2    1987-09-10 Teenage Mutant Ninja Turtles 7.3    2004-03-04 Pimp My Ride 5.2    1996-09-02 Quack Pack 6.9    1998-08-31 Noddy 5.9  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m Homepage  - Genres Action & Adventure Animation Keywords cartoon turtle animation ninja kids Content Score 93 Almost there... Top Contributors 23 Maikkoum 14 Shane 8 sp1ti CM 8 Cherche Moi  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}