{"link": "https://www.themoviedb.org/tv/11890?language=en", "title": "Good Times, Bad Times", "resume": "Goede tijden, slechte tijden, also known as GTST, is the longest-running Dutch soap opera, which began on 1 October 1990 on RTL4. The programme was the first daily soap in the Netherlands. The soap is produced by Joop van den Ende and to date over 4,000 episodes have been broadcast. It was inspired by the Australian soap The Restless Years, although it started following its own course during the third season. GTST is broadcast Monday to Friday at 20:00. Around 1.5 million viewers watch each episode. It is the highest rated soap opera in the Netherlands.\nThe soap mainly revolves around the lives of the families Alberts, Sanders, De Jong, Van Houten and Bouwhuis. It all takes place in the fictional town of Meerdijk. Like any other soap, marriage, divorce, kidnapping and business are a few of the ingredients of GTST, although in recent years, GTST has become known for writing and producing more controversial storylines. GTST is also known for having a summer break each year, ending a season sometime in June with a cliffhanger, only to resume three months later in September. Although the early cliffhangers often revolved around family drama, later cliffhangers have often revolved around disasters and unexpected twists.", "rate": 51, "genre": [], "cast": ["Everon Jackson Hooi", "Erik de Vogel", "Caroline de Bruijn", "Guido Spek", "Dilan Yurdakul"], "character": ["Bing Mauricius", "Ludo Sanders", "Janine Elschot", "Sjoerd Bouwhuis", "Aysen Baydar"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 11890   Expand Good Times, Bad Times   (1990) User Score Overview Goede tijden, slechte tijden, also known as GTST, is the longest-running Dutch soap opera, which began on 1 October 1990 on RTL4. The programme was the first daily soap in the Netherlands. The soap is produced by Joop van den Ende and to date over 4,000 episodes have been broadcast. It was inspired by the Australian soap The Restless Years, although it started following its own course during the third season. GTST is broadcast Monday to Friday at 20:00. Around 1.5 million viewers watch each episode. It is the highest rated soap opera in the Netherlands. The soap mainly revolves around the lives of the families Alberts, Sanders, De Jong, Van Houten and Bouwhuis. It all takes place in the fictional town of Meerdijk. Like any other soap, marriage, divorce, kidnapping and business are a few of the ingredients of GTST, although in recent years, GTST has become known for writing and producing more controversial storylines. GTST is also known for having a summer break each year, ending a season sometime in June with a cliffhanger, only to resume three months later in September. Although the early cliffhangers often revolved around family drama, later cliffhangers have often revolved around disasters and unexpected twists. Featured Crew Reg Watson Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  0 Images Backdrops  1 Posters  2 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Everon Jackson Hooi Bing Mauricius Erik de Vogel Ludo Sanders Caroline de Bruijn Janine Elschot Guido Spek Sjoerd Bouwhuis Dilan Yurdakul Aysen Baydar Full Cast & Crew Last Season Season 26 2015 | 5 Episodes Season 26 of Good Times, Bad Times premiered on August 31, 2015. View All Seasons Social Reviews  0 Discussions  0 Media Most Popular Videos  0 Backdrops  1 Posters  2 Recommendations We don't have enough data to suggest any TV shows based on Good Times, Bad Times. You can help by rating TV shows you've seen. Facts Original Name  Goede Tijden, Slechte Tijden Status  Returning Series Network Certification  - Type  Scripted Original Language  Dutch; Flemish Runtime  30m Homepage   http://www.rtl.nl/soaps/gtst/ Genres No genres have been added. Keywords No keywords have been added. Content Score 86 Almost there... Top Contributors 24 t0by J 15 Jordi0686 TB 10 TMDb Bot 5 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}