{"link": "https://www.themoviedb.org/tv/65858?language=en", "title": "LEGO Nexo Knights", "resume": "The adventure takes place in the futuristic Kingdom of Knighton. It focuses on the Nexo Knights as they journey to defeat Jestro the evil jester, the Book of Monsters, and their lava monster army. Clay leads the Nexo Knights, which include Macy, Lance, Aaron, and Axl. Together, under their mentor Merlok 2.0, they band together to defeat Jestro.", "rate": 60, "genre": ["Action", "Adventure", "Animation", "Kids"], "cast": ["Alessandro Juliani", "Vincent Tong", "Giles Panton", "Nicole Oliver", "Brian Drummond"], "character": ["Aaron", "Jestro", "Clay Moorington", "Queen Halbert", "Axl"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 65858   Expand LEGO Nexo Knights   (2015) User Score Overview The adventure takes place in the futuristic Kingdom of Knighton. It focuses on the Nexo Knights as they journey to defeat Jestro the evil jester, the Book of Monsters, and their lava monster army. Clay leads the Nexo Knights, which include Macy, Lance, Aaron, and Axl. Together, under their mentor Merlok 2.0, they band together to defeat Jestro. Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  4 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Alessandro Juliani Aaron Vincent Tong Jestro Giles Panton Clay Moorington Nicole Oliver Queen Halbert Brian Drummond Axl Full Cast & Crew Last Season Season 4 2017 | 10 Episodes Season 4 of LEGO Nexo Knights premiered on July 11, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for LEGO Nexo Knights. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  4 Posters  3 Recommendations   2016-01-01 72 Cutest Animals 5.0    2016-07-06 Paquita Salas 7.8  Facts Status  Returning Series Network Certification 6 Meaning Can be aired at any time. Type  Scripted Original Language  English Runtime  22m Homepage   http://www.cartoonnetwork.com/video/nexo-knights/ Genres Action & Adventure Animation Kids Keywords knight Content Score 86 Almost there... Top Contributors R 74 RicoT B 27 BCEMovieDB A 14 Anitta60 9 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}