{"link": "https://www.themoviedb.org/tv/69292?language=en", "title": "Scum's Wish", "resume": "Seventeen-year-old Mugi Awaya and Hanabi Yasuraoka appear to be the ideal couple. They are both pretty popular, and they seem to suit each other well. However, outsiders don't know of the secret they share. Both Mugi and Hanabi have hopeless crushes on someone else, and they are only dating each other to soothe their loneliness. Mugi is in love with Akane Minagawa, a young teacher who used to be his home tutor. Hanabi is also in love with a teacher, a young man who has been a family friend since she was little. In each other, they find a place where they can grieve for the ones they cannot have, and they share physical intimacy driven by loneliness. Will things stay like this for them forever?", "rate": 74, "genre": ["Animation", "Drama"], "cast": ["Chika Anzai", "Nobunaga Shimazaki", "Haruka Tomatsu", "Aki Toyosaki"], "character": ["Hanabi Yasuraoka", "Mugi Awaya", "Sanae Ebato", "Akane Minagawa"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 69292   Expand Scum's Wish   (2017) User Score Overview Seventeen-year-old Mugi Awaya and Hanabi Yasuraoka appear to be the ideal couple. They are both pretty popular, and they seem to suit each other well. However, outsiders don't know of the secret they share. Both Mugi and Hanabi have hopeless crushes on someone else, and they are only dating each other to soothe their loneliness. Mugi is in love with Akane Minagawa, a young teacher who used to be his home tutor. Hanabi is also in love with a teacher, a young man who has been a family friend since she was little. In each other, they find a place where they can grieve for the ones they cannot have, and they share physical intimacy driven by loneliness. Will things stay like this for them forever? Featured Crew Makoto Uezu Creator Masaomi Ando Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  1 Images Backdrops  2 Posters  3 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Chika Anzai Hanabi Yasuraoka Nobunaga Shimazaki Mugi Awaya Haruka Tomatsu Sanae Ebato Aki Toyosaki Akane Minagawa Full Cast & Crew Last Season Season 1 2017 | 12 Episodes Season 1 of Scum's Wish premiered on January 13, 2017. View All Seasons Social Reviews  0 Discussions  1 Subject Status Replies Last Reply There are no discussions for Scum's Wish. Login to be first! Go to Discussions Media Most Popular Videos  0 Backdrops  2 Posters  3 Recommendations   2015-04-05 Plastic Memories 6.8    2015-07-11 Prison School 7.7    2010-07-09 Shiki 6.7    2015-07-04 SHIMONETA: A Boring World Where the Concept of Dirty Jokes Doesn't Exist 7.6    2015-04-04 Seraph of the End 7.0    2013-10-02 Beyond the Boundary 7.0    2012-10-04 BTOOOM! 6.3    2017-01-05 Masamune-kun's Revenge 7.0  Facts Original Name  クズの本懐 Status  Ended Networks - Certification  - Type  Scripted Original Language  Japanese Runtime  23m Homepage   http://www.kuzunohonkai.com/ Genres Animation Drama Keywords anime Content Score 100 Yes! Looking good! Top Contributors 15 sp1ti s 11 sheva_vitali z 10 zurman1 8 dllister  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}