{"link": "https://www.themoviedb.org/tv/61967?language=en", "title": "Wet Hot American Summer: First Day of Camp", "resume": "It's the first day of camp in this outrageous prequel to the hilarious 2001 cult classic movie. And at Camp Firewood, anything can happen.", "rate": 63, "genre": ["Comedy"], "cast": ["Janeane Garofalo", "David Hyde Pierce", "Molly Shannon", "Paul Rudd", "Christopher Meloni"], "character": ["Beth", "Prof. Henry Newman", "Gail von Kleinenstein", "Andy", "Gene"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 61967   Expand Wet Hot American Summer: First Day of Camp   (2015) User Score  Play Trailer Overview It's the first day of camp in this outrageous prequel to the hilarious 2001 cult classic movie. And at Camp Firewood, anything can happen. Featured Crew David Wain Creator Michael Showalter Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  0 Content Issues  4 Images Backdrops  3 Posters  4 Videos Trailers  1 Teasers  0 Clips  0 Featurettes  3 Opening Credits  0 Top Billed Cast Janeane Garofalo Beth David Hyde Pierce Prof. Henry Newman Molly Shannon Gail von Kleinenstein Paul Rudd Andy Christopher Meloni Gene Full Cast & Crew Last Season Season 2 2017 | 1 Episode View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply There are no discussions for Wet Hot American Summer: First Day of Camp. Login to be first! Go to Discussions Media Most Popular Videos  4 Backdrops  3 Posters  4 Recommendations   2017-08-04 Wet Hot American Summer: 10 Years Later 6.8    1998-09-29 Felicity 6.5    2015-11-13 W/ Bob & David 7.1    2007-03-20 The Whitest Kids U' Know 7.9    2003-11-02 Arrested Development 8.2    1991-05-11 Sisters 6.7    2010-06-28 Huge 5.5    2009-04-09 Parks and Recreation 7.9  Facts Status  Ended Network Certification 14 Meaning Content suitable for viewers over the age of 14. Type  Miniseries Original Language  English Runtime  30m Homepage   http://www.netflix.com/title/80039813 Genres Comedy Keywords sex summer camp musical rivalry miniseries camp summer counselor camp counselor 1980s Content Score 100 Yes! Looking good! Top Contributors 41 SWFT G 39 Grandpamovies 36 cmnunes 22 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}