{"link": "https://www.themoviedb.org/tv/31356?language=en", "title": "Big Time Rush", "resume": "Four teenage friends move from Minneapolis to Los Angeles to form a potential chart-topping boy band after Kendall is inadvertently discovered by an eccentric record executive, Gustavo Rocque. As they seize this opportunity of a lifetime, these friends embark on an exciting comedy and music-filled journey to prove to themselves and their record label that they are serious about their new career choice.", "rate": 53, "genre": ["Comedy"], "cast": ["Kendall Schmidt", "Logan Henderson", "James Maslow", "Carlos PenaVega", "Challen Cates"], "character": ["Kendall Knight", "Logan Mitchell", "James Diamond", "Carlos Garcia", "Jennifer Knight"], "site_data": "html Apps Forums Leaderboard Contribute API Support Discover Movies TV Shows Movies Popular Top Rated Upcoming Now Playing TV Shows Popular Top Rated On TV Airing Today People Popular People Can't find a movie or TV show? Login to create it. en Login Sign Up  ID: 31356   Expand Big Time Rush   (2009) User Score Overview Four teenage friends move from Minneapolis to Los Angeles to form a potential chart-topping boy band after Kendall is inadvertently discovered by an eccentric record executive, Gustavo Rocque. As they seize this opportunity of a lifetime, these friends embark on an exciting comedy and music-filled journey to prove to themselves and their record label that they are serious about their new career choice. Featured Crew Scott Fellows Creator Discussions   Reviews Videos   Images   Changes Report Share Discussions General  4 Content Issues  0 Images Backdrops  8 Posters  1 Videos Trailers  0 Teasers  0 Clips  0 Featurettes  0 Opening Credits  0 Top Billed Cast Kendall Schmidt Kendall Knight Logan Henderson Logan Mitchell James Maslow James Diamond Carlos PenaVega Carlos Garcia Challen Cates Jennifer Knight Full Cast & Crew Last Season Season 4 2013 | 13 Episodes Season 4 of Big Time Rush premiered on May  2, 2013. View All Seasons Social Reviews  0 Discussions  4 Subject Status Replies Last Reply w Kendall: Happy Birthday Kendall Schmidt! Open 0 by wonder2wonder\n      \n     w Jennifer: Happy Birthday Denyse Tontz! Open 0 by wonder2wonder\n      \n     w Carlos: Happy Birthday Carlos PenaVega! Open 0 by wonder2wonder\n      \n     Go to Discussions Media Most Popular Videos  0 Backdrops  8 Posters  1 Recommendations   2008-11-08 True Jackson, VP 6.4    2009-09-12 The Troop 8.0    1999-11-08 My Parents Are Aliens 6.0    2010-03-27 Victorious 7.1    2013-06-08 Sam & Cat 5.7    2011-06-13 Kickin' It 6.5    2014-01-17 I Didn't Do It 6.8    2008-09-26 The Suite Life on Deck 6.1  Facts Status  Ended Network Certification  - Type  Scripted Original Language  English Runtime  30m, 23m, 46m Homepage   http://www.nick.com/big-time-rush/ Genres Comedy Keywords teenager music band Content Score 93 Almost there... Top Contributors F 11 FrenchyDuke R 8 Rebecca 5 lineker 4 Elizabeth Jennings  View Edit History Popularity Trend  Login to edit  URL By  signing up  for an account on TMDb, you can post directly to Twitter and Facebook. You need to be logged in to continue. Click  here  to login or  here  to sign up.    page_wrap opened in html_head  Join the Community The Basics About TMDb Contact Us Support Forums API Blog Get Involved  Contribution Bible 3rd Party Applications Add New Movie Add New TV Show Community Guidelines Leaderboard Forums Twitter Facebook Legal Terms of Use Privacy Policy Login Sign Up"}